; ModuleID = '/root/.unikraft/libs/lwip/alloc.c'
source_filename = "/root/.unikraft/libs/lwip/alloc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { {}*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, {}*, {}*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [23 x i8] c"Assertion failure: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"a\00", align 1
@uk_pr_crit.__str = internal global [8 x i8] c"liblwip\00", section ".data_shared", align 1, !dbg !0
@uk_pr_crit.__str.2 = internal global [8 x i8] c"alloc.c\00", section ".data_shared", align 1, !dbg !23
@_uk_alloc_head = external dso_local local_unnamed_addr global %struct.uk_alloc*, align 8
@flexos_comp1_alloc = external dso_local local_unnamed_addr global %struct.uk_alloc*, align 8
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i8* @sys_malloc(i64) local_unnamed_addr #0 !dbg !47 {
  %2 = tail call fastcc %struct.uk_alloc* @uk_alloc_get_default() #8, !dbg !56
  %3 = icmp eq %struct.uk_alloc* %2, null, !dbg !125

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "uk_pr_crit", scope: !3, file: !3, line: 194, type: !4, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !28)
!3 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, null}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !20, globals: !22)
!10 = !DIFile(filename: "/root/.unikraft/libs/lwip/alloc.c", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !13, line: 68, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !{!0, !23}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 8)
!28 = !{!29, !30}
!29 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!30 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !32, line: 32, baseType: !33)
!32 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !41)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !35, file: !10, line: 196, baseType: !14, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !35, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !35, file: !10, line: 196, baseType: !21, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !35, file: !10, line: 196, baseType: !21, size: 64, offset: 128)
!41 = !{!42}
!42 = !DISubrange(count: 1)
!43 = !{i32 2, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!47 = distinct !DISubprogram(name: "sys_malloc", scope: !10, file: !10, line: 40, type: !48, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !53)
!48 = !DISubroutineType(types: !49)
!49 = !{!21, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 58, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !{!54}
!54 = !DILocalVariable(name: "size", arg: 1, scope: !47, file: !10, line: 40, type: !50)
!55 = !DILocation(line: 40, column: 25, scope: !47)
!56 = !DILocation(line: 42, column: 19, scope: !47)
!57 = !DILocalVariable(name: "a", arg: 1, scope: !58, file: !59, line: 157, type: !62)
!58 = distinct !DISubprogram(name: "uk_malloc", scope: !59, file: !59, line: 157, type: !60, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !120)
!59 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !DISubroutineType(types: !61)
!61 = !{!21, !62, !50}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !59, line: 77, size: 832, elements: !64)
!64 = !{!65, !68, !73, !78, !85, !87, !92, !93, !94, !99, !104, !109, !110, !111}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !63, file: !59, line: 79, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !59, line: 54, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !63, file: !59, line: 80, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !59, line: 56, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!21, !62, !50, !50}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !63, file: !59, line: 81, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !59, line: 62, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!21, !62, !21, !50}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !63, file: !59, line: 82, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !59, line: 58, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !62, !84, !50, !50}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !63, file: !59, line: 83, baseType: !86, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !59, line: 60, baseType: !70)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !63, file: !59, line: 84, baseType: !88, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !59, line: 64, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !62, !21}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !63, file: !59, line: 87, baseType: !88, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !63, file: !59, line: 88, baseType: !66, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !63, file: !59, line: 92, baseType: !95, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !59, line: 66, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!21, !62, !52}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !63, file: !59, line: 93, baseType: !100, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !59, line: 68, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !62, !21, !52}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !63, file: !59, line: 99, baseType: !105, size: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !59, line: 70, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!83, !62, !21, !50}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !59, line: 100, baseType: !50, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !59, line: 103, baseType: !62, size: 64, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !63, file: !59, line: 104, baseType: !112, offset: 832)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, elements: !118)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !114, line: 20, baseType: !115)
!114 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !116, line: 41, baseType: !117)
!116 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!117 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!118 = !{!119}
!119 = !DISubrange(count: -1)
!120 = !{!57, !121}
!121 = !DILocalVariable(name: "size", arg: 2, scope: !58, file: !59, line: 157, type: !50)
!122 = !DILocation(line: 157, column: 48, scope: !58, inlinedAt: !123)
!123 = distinct !DILocation(line: 42, column: 9, scope: !47)
!124 = !DILocation(line: 157, column: 58, scope: !58, inlinedAt: !123)
!125 = !DILocation(line: 159, column: 6, scope: !126, inlinedAt: !123)
!126 = distinct !DILexicalBlock(scope: !58, file: !59, line: 159, column: 6)
!127 = !DILocation(line: 159, column: 6, scope: !58, inlinedAt: !123)
!128 = !{!"branch_weights", i32 1, i32 2000}
!129 = !DILocation(line: 160, column: 3, scope: !130, inlinedAt: !123)
!130 = distinct !DILexicalBlock(scope: !126, file: !59, line: 159, column: 20)
!131 = !DILocation(line: 160, column: 9, scope: !130, inlinedAt: !123)
!132 = !{!133, !133, i64 0}
!133 = !{!"int", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !DILocation(line: 161, column: 3, scope: !130, inlinedAt: !123)
!137 = !DILocalVariable(name: "a", arg: 1, scope: !138, file: !59, line: 151, type: !62)
!138 = distinct !DISubprogram(name: "uk_do_malloc", scope: !59, file: !59, line: 151, type: !60, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !139)
!139 = !{!137, !140}
!140 = !DILocalVariable(name: "size", arg: 2, scope: !138, file: !59, line: 151, type: !50)
!141 = !DILocation(line: 151, column: 51, scope: !138, inlinedAt: !142)
!142 = distinct !DILocation(line: 163, column: 9, scope: !58, inlinedAt: !123)
!143 = !DILocation(line: 151, column: 61, scope: !138, inlinedAt: !142)
!144 = !DILocation(line: 153, column: 2, scope: !145, inlinedAt: !142)
!145 = distinct !DILexicalBlock(scope: !138, file: !59, line: 153, column: 2)
!146 = !DILocation(line: 154, column: 12, scope: !138, inlinedAt: !142)
!147 = !{!148, !148, i64 0}
!148 = !{!"any pointer", !134, i64 0}
!149 = !DILocation(line: 154, column: 9, scope: !138, inlinedAt: !142)
!150 = !DILocation(line: 154, column: 2, scope: !138, inlinedAt: !142)
!151 = !DILocation(line: 163, column: 2, scope: !58, inlinedAt: !123)
!152 = !DILocation(line: 0, scope: !58, inlinedAt: !123)
!153 = !DILocation(line: 0, scope: !47)
!154 = !DILocation(line: 164, column: 1, scope: !58, inlinedAt: !123)
!155 = !DILocation(line: 42, column: 2, scope: !47)
!156 = distinct !DISubprogram(name: "uk_alloc_get_default", scope: !59, file: !59, line: 121, type: !157, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{!62}
!159 = !{!160}
!160 = !DILocalVariable(name: "pkru", scope: !156, file: !59, line: 124, type: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !114, line: 48, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !116, line: 79, baseType: !14)
!163 = !DILocation(line: 124, column: 2, scope: !156)
!164 = !DILocation(line: 124, column: 11, scope: !156)
!165 = !DILocation(line: 79, column: 2, scope: !166, inlinedAt: !172)
