; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "last_write_error_log", scope: !2, file: !3, line: 409, type: !79, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "flushAppendOnlyFile", scope: !3, file: !3, line: 337, type: !4, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !69)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !68)
!8 = !{}
!9 = !{!10, !11, !15, !16, !17, !18, !6, !20, !22, !23, !24, !39, !49, !59}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !12, line: 200, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !14, line: 145, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !26, line: 51, size: 24, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !33, !34, !35}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, file: !26, line: 52, baseType: !29, size: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 24, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !32, line: 43, baseType: !19)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !25, file: !26, line: 53, baseType: !29, size: 8, offset: 8)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !25, file: !26, line: 54, baseType: !19, size: 8, offset: 16)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !25, file: !26, line: 55, baseType: !36, offset: 24)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: -1)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !26, line: 57, size: 40, elements: !41)
!41 = !{!42, !46, !47, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !26, line: 58, baseType: !43, size: 16)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 36, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !32, line: 57, baseType: !45)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !26, line: 59, baseType: !43, size: 16, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !26, line: 60, baseType: !19, size: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !26, line: 61, baseType: !36, offset: 40)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !26, line: 63, size: 72, elements: !51)
!51 = !{!52, !56, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !26, line: 64, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 48, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !32, line: 79, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !50, file: !26, line: 65, baseType: !53, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !26, line: 66, baseType: !19, size: 8, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !50, file: !26, line: 67, baseType: !36, offset: 72)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !26, line: 69, size: 136, elements: !61)
!61 = !{!62, !65, !66, !67}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, file: !26, line: 70, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 60, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !32, line: 105, baseType: !17)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !60, file: !26, line: 71, baseType: !63, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !26, line: 72, baseType: !19, size: 8, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !60, file: !26, line: 73, baseType: !36, offset: 136)
!68 = !{!0}
!69 = !{!70, !71, !72, !73, !76}
!70 = !DILocalVariable(name: "force", arg: 1, scope: !2, file: !3, line: 337, type: !6)
!71 = !DILocalVariable(name: "nwritten", scope: !2, file: !3, line: 338, type: !11)
!72 = !DILocalVariable(name: "sync_in_progress", scope: !2, file: !3, line: 339, type: !6)
!73 = !DILocalVariable(name: "latency", scope: !2, file: !3, line: 340, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !75, line: 52, baseType: !16)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DILocalVariable(name: "can_log", scope: !77, file: !3, line: 410, type: !6)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 408, column: 54)
!78 = distinct !DILexicalBlock(scope: !2, file: !3, line: 408, column: 9)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !80, line: 34, baseType: !15)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!85 = distinct !DISubprogram(name: "aofRewriteBufferReset", scope: !3, file: !3, line: 70, type: !86, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!86 = !DISubroutineType(types: !87)
!87 = !{null}
!88 = !DILocation(line: 71, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !85, file: !3, line: 71, column: 9)
!90 = !{!91, !95, i64 1944}
!91 = !{!"redisServer", !92, i64 0, !95, i64 8, !95, i64 16, !95, i64 24, !92, i64 32, !92, i64 36, !92, i64 40, !95, i64 48, !95, i64 56, !95, i64 64, !95, i64 72, !92, i64 80, !92, i64 84, !92, i64 88, !92, i64 92, !95, i64 96, !95, i64 104, !92, i64 112, !92, i64 116, !93, i64 120, !92, i64 164, !96, i64 168, !92, i64 176, !95, i64 184, !95, i64 192, !95, i64 200, !93, i64 208, !92, i64 216, !92, i64 220, !93, i64 224, !92, i64 352, !95, i64 360, !92, i64 368, !93, i64 372, !92, i64 436, !92, i64 440, !93, i64 444, !92, i64 508, !95, i64 512, !95, i64 520, !95, i64 528, !95, i64 536, !95, i64 544, !95, i64 552, !95, i64 560, !92, i64 568, !97, i64 576, !93, i64 584, !95, i64 840, !96, i64 848, !92, i64 856, !92, i64 860, !96, i64 864, !96, i64 872, !96, i64 880, !96, i64 888, !95, i64 896, !95, i64 904, !95, i64 912, !95, i64 920, !95, i64 928, !95, i64 936, !95, i64 944, !95, i64 952, !95, i64 960, !95, i64 968, !95, i64 976, !95, i64 984, !95, i64 992, !96, i64 1000, !97, i64 1008, !97, i64 1016, !97, i64 1024, !98, i64 1032, !97, i64 1040, !97, i64 1048, !97, i64 1056, !97, i64 1064, !97, i64 1072, !97, i64 1080, !97, i64 1088, !97, i64 1096, !97, i64 1104, !96, i64 1112, !97, i64 1120, !98, i64 1128, !97, i64 1136, !97, i64 1144, !97, i64 1152, !97, i64 1160, !95, i64 1168, !97, i64 1176, !97, i64 1184, !96, i64 1192, !99, i64 1200, !97, i64 1240, !97, i64 1248, !96, i64 1256, !96, i64 1264, !93, i64 1272, !92, i64 1728, !92, i64 1732, !92, i64 1736, !92, i64 1740, !92, i64 1744, !96, i64 1752, !92, i64 1760, !92, i64 1764, !92, i64 1768, !92, i64 1772, !96, i64 1776, !96, i64 1784, !92, i64 1792, !92, i64 1796, !92, i64 1800, !92, i64 1804, !93, i64 1808, !92, i64 1880, !92, i64 1884, !95, i64 1888, !92, i64 1896, !92, i64 1900, !96, i64 1904, !96, i64 1912, !96, i64 1920, !96, i64 1928, !92, i64 1936, !92, i64 1940, !95, i64 1944, !95, i64 1952, !92, i64 1960, !92, i64 1964, !96, i64 1968, !96, i64 1976, !96, i64 1984, !96, i64 1992, !92, i64 2000, !96, i64 2008, !92, i64 2016, !92, i64 2020, !92, i64 2024, !92, i64 2028, !92, i64 2032, !92, i64 2036, !92, i64 2040, !92, i64 2044, !92, i64 2048, !92, i64 2052, !92, i64 2056, !92, i64 2060, !92, i64 2064, !95, i64 2072, !97, i64 2080, !97, i64 2088, !92, i64 2096, !95, i64 2104, !92, i64 2112, !95, i64 2120, !92, i64 2128, !92, i64 2132, !96, i64 2136, !96, i64 2144, !96, i64 2152, !96, i64 2160, !92, i64 2168, !92, i64 2172, !92, i64 2176, !92, i64 2180, !92, i64 2184, !92, i64 2188, !93, i64 2192, !100, i64 2200, !101, i64 2224, !95, i64 2240, !92, i64 2248, !95, i64 2256, !92, i64 2264, !93, i64 2268, !93, i64 2309, !97, i64 2352, !97, i64 2360, !92, i64 2368, !92, i64 2372, !95, i64 2376, !97, i64 2384, !97, i64 2392, !97, i64 2400, !97, i64 2408, !96, i64 2416, !96, i64 2424, !92, i64 2432, !92, i64 2436, !92, i64 2440, !92, i64 2444, !92, i64 2448, !95, i64 2456, !95, i64 2464, !92, i64 2472, !92, i64 2476, !95, i64 2480, !95, i64 2488, !92, i64 2496, !92, i64 2500, !96, i64 2504, !96, i64 2512, !96, i64 2520, !92, i64 2528, !92, i64 2532, !95, i64 2536, !96, i64 2544, !92, i64 2552, !92, i64 2556, !92, i64 2560, !96, i64 2568, !92, i64 2576, !92, i64 2580, !92, i64 2584, !95, i64 2592, !93, i64 2600, !97, i64 2648, !92, i64 2656, !95, i64 2664, !95, i64 2672, !92, i64 2680, !95, i64 2688, !92, i64 2696, !92, i64 2700, !97, i64 2704, !92, i64 2712, !92, i64 2716, !92, i64 2720, !92, i64 2724, !97, i64 2728, !92, i64 2736, !93, i64 2740, !95, i64 2768, !95, i64 2776, !92, i64 2784, !92, i64 2788, !92, i64 2792, !92, i64 2796, !96, i64 2800, !96, i64 2808, !96, i64 2816, !96, i64 2824, !96, i64 2832, !96, i64 2840, !96, i64 2848, !96, i64 2856, !92, i64 2864, !92, i64 2868, !96, i64 2872, !96, i64 2880, !92, i64 2888, !97, i64 2896, !95, i64 2904, !95, i64 2912, !92, i64 2920, !92, i64 2924, !97, i64 2928, !95, i64 2936, !95, i64 2944, !92, i64 2952, !92, i64 2956, !92, i64 2960, !92, i64 2964, !95, i64 2968, !92, i64 2976, !92, i64 2980, !92, i64 2984, !95, i64 2992, !95, i64 3000, !95, i64 3008, !95, i64 3016, !97, i64 3024, !97, i64 3032, !97, i64 3040, !92, i64 3048, !92, i64 3052, !92, i64 3056, !92, i64 3060, !92, i64 3064, !92, i64 3068, !92, i64 3072, !92, i64 3076, !92, i64 3080, !92, i64 3084, !92, i64 3088, !97, i64 3096, !95, i64 3104, !95, i64 3112, !95, i64 3120, !92, i64 3128, !92, i64 3132, !92, i64 3136, !96, i64 3144, !95, i64 3152, !95, i64 3160, !95, i64 3168}
!92 = !{!"int", !93, i64 0}
!93 = !{!"omnipotent char", !94, i64 0}
!94 = !{!"Simple C/C++ TBAA"}
!95 = !{!"any pointer", !93, i64 0}
!96 = !{!"long", !93, i64 0}
!97 = !{!"long long", !93, i64 0}
!98 = !{!"double", !93, i64 0}
!99 = !{!"malloc_stats", !96, i64 0, !96, i64 8, !96, i64 16, !96, i64 24, !96, i64 32}
!100 = !{!"", !92, i64 0, !96, i64 8, !97, i64 16}
!101 = !{!"redisOpArray", !95, i64 0, !92, i64 8}
!102 = !DILocation(line: 71, column: 9, scope: !89)
!103 = !DILocation(line: 71, column: 9, scope: !85)
!104 = !DILocation(line: 72, column: 9, scope: !89)
!105 = !DILocation(line: 74, column: 37, scope: !85)
!106 = !DILocation(line: 74, column: 35, scope: !85)
!107 = !DILocation(line: 75, column: 5, scope: !85)
!108 = !{!109, !95, i64 24}
!109 = !{!"list", !95, i64 0, !95, i64 8, !95, i64 16, !95, i64 24, !95, i64 32, !96, i64 40}
!110 = !DILocation(line: 76, column: 1, scope: !85)
!111 = distinct !DISubprogram(name: "aofRewriteBufferSize", scope: !3, file: !3, line: 79, type: !112, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!17}
!114 = !{!115, !125, !131, !132}
!115 = !DILocalVariable(name: "ln", scope: !111, file: !3, line: 80, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !118, line: 40, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !118, line: 36, size: 192, elements: !120)
!120 = !{!121, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !118, line: 37, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !118, line: 38, baseType: !122, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !118, line: 39, baseType: !10, size: 64, offset: 128)
!125 = !DILocalVariable(name: "li", scope: !111, file: !3, line: 81, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !118, line: 45, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !118, line: 42, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !118, line: 43, baseType: !116, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !127, file: !118, line: 44, baseType: !6, size: 32, offset: 64)
!131 = !DILocalVariable(name: "size", scope: !111, file: !3, line: 82, type: !17)
!132 = !DILocalVariable(name: "block", scope: !133, file: !3, line: 86, type: !134)
!133 = distinct !DILexicalBlock(scope: !111, file: !3, line: 85, column: 33)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "aofrwblock", file: !3, line: 65, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aofrwblock", file: !3, line: 62, size: 83886208, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !136, file: !3, line: 63, baseType: !17, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !136, file: !3, line: 63, baseType: !17, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !136, file: !3, line: 64, baseType: !141, size: 83886080, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 83886080, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 10485760)
!144 = !DILocation(line: 81, column: 5, scope: !111)
!145 = !DILocation(line: 82, column: 19, scope: !111)
!146 = !DILocation(line: 84, column: 23, scope: !111)
!147 = !DILocation(line: 81, column: 14, scope: !111)
!148 = !DILocation(line: 84, column: 5, scope: !111)
!149 = !DILocation(line: 85, column: 5, scope: !111)
!150 = !DILocation(line: 85, column: 17, scope: !111)
!151 = !DILocation(line: 80, column: 15, scope: !111)
!152 = !DILocation(line: 86, column: 29, scope: !133)
!153 = !{!154, !95, i64 16}
!154 = !{!"listNode", !95, i64 0, !95, i64 8, !95, i64 16}
!155 = !DILocation(line: 86, column: 21, scope: !133)
!156 = !DILocation(line: 87, column: 24, scope: !133)
!157 = !{!158, !96, i64 0}
!158 = !{!"aofrwblock", !96, i64 0, !96, i64 8, !93, i64 16}
!159 = !DILocation(line: 87, column: 14, scope: !133)
!160 = distinct !{!160, !149, !161}
!161 = !DILocation(line: 88, column: 5, scope: !111)
!162 = !DILocation(line: 0, scope: !133)
!163 = !DILocation(line: 90, column: 1, scope: !111)
!164 = !DILocation(line: 89, column: 5, scope: !111)
!165 = distinct !DISubprogram(name: "aofChildWriteDiffData", scope: !3, file: !3, line: 95, type: !166, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !228)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !6, !10, !6}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !170, line: 109, baseType: !171)
!170 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !170, line: 97, size: 640, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !191, !198, !220, !221, !222, !227}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !171, file: !170, line: 98, baseType: !6, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !171, file: !170, line: 99, baseType: !6, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !171, file: !170, line: 100, baseType: !16, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !171, file: !170, line: 101, baseType: !79, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !171, file: !170, line: 102, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !170, line: 76, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !170, line: 71, size: 256, elements: !181)
!181 = !{!182, !183, !189, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !180, file: !170, line: 72, baseType: !6, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !180, file: !170, line: 73, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !170, line: 65, baseType: !186)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !188, !6, !10, !6}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !180, file: !170, line: 74, baseType: !184, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !180, file: !170, line: 75, baseType: !10, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !171, file: !170, line: 103, baseType: !192, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !170, line: 94, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !170, line: 91, size: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !194, file: !170, line: 92, baseType: !6, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !194, file: !170, line: 93, baseType: !6, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !171, file: !170, line: 104, baseType: !199, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !170, line: 88, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !170, line: 79, size: 512, elements: !202)
!202 = !{!203, !204, !205, !206, !211, !216, !217, !219}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !170, line: 80, baseType: !16, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !201, file: !170, line: 81, baseType: !15, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !201, file: !170, line: 82, baseType: !15, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !201, file: !170, line: 83, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !170, line: 66, baseType: !209)
!209 = !DISubroutineType(types: !210)
!210 = !{!6, !188, !16, !10}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !201, file: !170, line: 84, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !170, line: 67, baseType: !214)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !188, !10}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !201, file: !170, line: 85, baseType: !10, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !170, line: 86, baseType: !218, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !170, line: 87, baseType: !218, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !171, file: !170, line: 105, baseType: !6, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !171, file: !170, line: 106, baseType: !10, size: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !171, file: !170, line: 107, baseType: !223, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !170, line: 68, baseType: !225)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !188}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !171, file: !170, line: 108, baseType: !223, size: 64, offset: 576)
!228 = !{!229, !230, !231, !232, !233, !234, !235}
!229 = !DILocalVariable(name: "el", arg: 1, scope: !165, file: !3, line: 95, type: !168)
!230 = !DILocalVariable(name: "fd", arg: 2, scope: !165, file: !3, line: 95, type: !6)
!231 = !DILocalVariable(name: "privdata", arg: 3, scope: !165, file: !3, line: 95, type: !10)
!232 = !DILocalVariable(name: "mask", arg: 4, scope: !165, file: !3, line: 95, type: !6)
!233 = !DILocalVariable(name: "ln", scope: !165, file: !3, line: 96, type: !116)
!234 = !DILocalVariable(name: "block", scope: !165, file: !3, line: 97, type: !134)
!235 = !DILocalVariable(name: "nwritten", scope: !165, file: !3, line: 98, type: !11)
!236 = !DILocation(line: 95, column: 41, scope: !165)
!237 = !DILocation(line: 95, column: 49, scope: !165)
!238 = !DILocation(line: 95, column: 59, scope: !165)
!239 = !DILocation(line: 95, column: 73, scope: !165)
!240 = !DILocation(line: 104, column: 5, scope: !165)
!241 = !DILocation(line: 105, column: 14, scope: !242)
!242 = distinct !DILexicalBlock(scope: !165, file: !3, line: 104, column: 14)
!243 = !{!109, !95, i64 0}
!244 = !DILocation(line: 96, column: 15, scope: !165)
!245 = !DILocation(line: 106, column: 17, scope: !242)
!246 = !DILocation(line: 97, column: 17, scope: !165)
!247 = !DILocation(line: 107, column: 42, scope: !248)
!248 = distinct !DILexicalBlock(scope: !242, file: !3, line: 107, column: 13)
!249 = !DILocation(line: 106, column: 26, scope: !242)
!250 = !DILocation(line: 107, column: 20, scope: !248)
!251 = !{!91, !92, i64 2064}
!252 = !DILocation(line: 107, column: 13, scope: !248)
!253 = !DILocation(line: 107, column: 46, scope: !248)
!254 = !DILocation(line: 108, column: 38, scope: !255)
!255 = distinct !DILexicalBlock(scope: !248, file: !3, line: 107, column: 53)
!256 = !{!91, !95, i64 72}
!257 = !DILocation(line: 108, column: 48, scope: !255)
!258 = !{!91, !92, i64 2040}
!259 = !DILocation(line: 108, column: 13, scope: !255)
!260 = !DILocation(line: 110, column: 13, scope: !255)
!261 = !DILocation(line: 112, column: 20, scope: !262)
!262 = distinct !DILexicalBlock(scope: !242, file: !3, line: 112, column: 13)
!263 = !DILocation(line: 112, column: 25, scope: !262)
!264 = !DILocation(line: 112, column: 13, scope: !242)
!265 = !DILocation(line: 120, column: 13, scope: !242)
!266 = !DILocation(line: 113, column: 37, scope: !267)
!267 = distinct !DILexicalBlock(scope: !262, file: !3, line: 112, column: 30)
!268 = !DILocation(line: 114, column: 30, scope: !267)
!269 = !DILocation(line: 113, column: 24, scope: !267)
!270 = !DILocation(line: 98, column: 13, scope: !165)
!271 = !DILocation(line: 115, column: 26, scope: !272)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 115, column: 17)
!273 = !DILocation(line: 115, column: 17, scope: !267)
!274 = !DILocation(line: 116, column: 42, scope: !267)
!275 = !DILocation(line: 116, column: 59, scope: !267)
!276 = !DILocation(line: 116, column: 63, scope: !267)
!277 = !DILocation(line: 116, column: 13, scope: !267)
!278 = !DILocation(line: 117, column: 25, scope: !267)
!279 = !DILocation(line: 118, column: 20, scope: !267)
!280 = !DILocation(line: 118, column: 25, scope: !267)
!281 = !{!158, !96, i64 8}
!282 = !DILocation(line: 119, column: 9, scope: !267)
!283 = !DILocation(line: 120, column: 25, scope: !284)
!284 = distinct !DILexicalBlock(scope: !242, file: !3, line: 120, column: 13)
!285 = !DILocation(line: 120, column: 50, scope: !284)
!286 = !DILocation(line: 120, column: 31, scope: !284)
!287 = distinct !{!287, !240, !288}
!288 = !DILocation(line: 121, column: 5, scope: !165)
!289 = !DILocation(line: 0, scope: !255)
!290 = !DILocation(line: 122, column: 1, scope: !165)
!291 = distinct !DISubprogram(name: "aofRewriteBufferAppend", scope: !3, file: !3, line: 125, type: !292, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !18, !17}
!294 = !{!295, !296, !297, !298, !299, !303, !306}
!295 = !DILocalVariable(name: "s", arg: 1, scope: !291, file: !3, line: 125, type: !18)
!296 = !DILocalVariable(name: "len", arg: 2, scope: !291, file: !3, line: 125, type: !17)
!297 = !DILocalVariable(name: "ln", scope: !291, file: !3, line: 126, type: !116)
!298 = !DILocalVariable(name: "block", scope: !291, file: !3, line: 127, type: !134)
!299 = !DILocalVariable(name: "thislen", scope: !300, file: !3, line: 133, type: !17)
!300 = distinct !DILexicalBlock(scope: !301, file: !3, line: 132, column: 20)
!301 = distinct !DILexicalBlock(scope: !302, file: !3, line: 132, column: 13)
!302 = distinct !DILexicalBlock(scope: !291, file: !3, line: 129, column: 16)
!303 = !DILocalVariable(name: "numblocks", scope: !304, file: !3, line: 144, type: !6)
!304 = distinct !DILexicalBlock(scope: !305, file: !3, line: 143, column: 18)
!305 = distinct !DILexicalBlock(scope: !302, file: !3, line: 143, column: 13)
!306 = !DILocalVariable(name: "level", scope: !307, file: !3, line: 155, type: !6)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 154, column: 44)
!308 = distinct !DILexicalBlock(scope: !304, file: !3, line: 154, column: 17)
!309 = !DILocation(line: 125, column: 44, scope: !291)
!310 = !DILocation(line: 125, column: 61, scope: !291)
!311 = !DILocation(line: 126, column: 20, scope: !291)
!312 = !{!109, !95, i64 8}
!313 = !DILocation(line: 126, column: 15, scope: !291)
!314 = !DILocation(line: 127, column: 25, scope: !291)
!315 = !DILocation(line: 127, column: 34, scope: !291)
!316 = !DILocation(line: 127, column: 17, scope: !291)
!317 = !DILocation(line: 129, column: 5, scope: !291)
!318 = !DILocation(line: 132, column: 13, scope: !301)
!319 = !DILocation(line: 132, column: 13, scope: !302)
!320 = !DILocation(line: 133, column: 45, scope: !300)
!321 = !DILocation(line: 133, column: 50, scope: !300)
!322 = !DILocation(line: 133, column: 37, scope: !300)
!323 = !DILocation(line: 133, column: 27, scope: !300)
!324 = !DILocation(line: 134, column: 17, scope: !325)
!325 = distinct !DILexicalBlock(scope: !300, file: !3, line: 134, column: 17)
!326 = !DILocation(line: 134, column: 17, scope: !300)
!327 = !DILocation(line: 141, column: 9, scope: !300)
!328 = !DILocation(line: 143, column: 13, scope: !302)
!329 = !DILocation(line: 135, column: 42, scope: !330)
!330 = distinct !DILexicalBlock(scope: !325, file: !3, line: 134, column: 26)
!331 = !DILocation(line: 135, column: 34, scope: !330)
!332 = !DILocation(line: 135, column: 17, scope: !330)
!333 = !DILocation(line: 136, column: 29, scope: !330)
!334 = !DILocation(line: 137, column: 29, scope: !330)
!335 = !DILocation(line: 138, column: 19, scope: !330)
!336 = !DILocation(line: 139, column: 21, scope: !330)
!337 = !DILocation(line: 140, column: 13, scope: !330)
!338 = !DILocation(line: 143, column: 13, scope: !305)
!339 = !DILocation(line: 146, column: 21, scope: !304)
!340 = !DILocation(line: 148, column: 25, scope: !304)
!341 = !{!96, !96, i64 0}
!342 = !DILocation(line: 149, column: 36, scope: !304)
!343 = !DILocation(line: 149, column: 13, scope: !304)
!344 = !DILocation(line: 153, column: 25, scope: !304)
!345 = !{!109, !96, i64 40}
!346 = !DILocation(line: 144, column: 17, scope: !304)
!347 = !DILocation(line: 154, column: 28, scope: !308)
!348 = !DILocation(line: 154, column: 32, scope: !308)
!349 = !DILocation(line: 154, column: 38, scope: !308)
!350 = !DILocation(line: 154, column: 17, scope: !304)
!351 = !DILocation(line: 155, column: 44, scope: !307)
!352 = !DILocation(line: 155, column: 51, scope: !307)
!353 = !DILocation(line: 155, column: 29, scope: !307)
!354 = !DILocation(line: 155, column: 21, scope: !307)
!355 = !DILocation(line: 81, column: 5, scope: !111, inlinedAt: !356)
!356 = distinct !DILocation(line: 158, column: 21, scope: !307)
!357 = !DILocation(line: 82, column: 19, scope: !111, inlinedAt: !356)
!358 = !DILocation(line: 81, column: 14, scope: !111, inlinedAt: !356)
!359 = !DILocation(line: 84, column: 5, scope: !111, inlinedAt: !356)
!360 = !DILocation(line: 85, column: 5, scope: !111, inlinedAt: !356)
!361 = !DILocation(line: 85, column: 17, scope: !111, inlinedAt: !356)
!362 = !DILocation(line: 80, column: 15, scope: !111, inlinedAt: !356)
!363 = !DILocation(line: 86, column: 29, scope: !133, inlinedAt: !356)
!364 = !DILocation(line: 86, column: 21, scope: !133, inlinedAt: !356)
!365 = !DILocation(line: 87, column: 24, scope: !133, inlinedAt: !356)
!366 = !DILocation(line: 87, column: 14, scope: !133, inlinedAt: !356)
!367 = !DILocation(line: 0, scope: !133, inlinedAt: !356)
!368 = !DILocation(line: 90, column: 1, scope: !111, inlinedAt: !356)
!369 = !DILocation(line: 89, column: 5, scope: !111, inlinedAt: !356)
!370 = !DILocation(line: 158, column: 43, scope: !307)
!371 = !DILocation(line: 157, column: 17, scope: !307)
!372 = !DILocation(line: 159, column: 13, scope: !307)
!373 = !DILocation(line: 160, column: 9, scope: !304)
!374 = distinct !{!374, !317, !375}
!375 = !DILocation(line: 161, column: 5, scope: !291)
!376 = !DILocation(line: 165, column: 32, scope: !377)
!377 = distinct !DILexicalBlock(scope: !291, file: !3, line: 165, column: 9)
!378 = !DILocation(line: 165, column: 42, scope: !377)
!379 = !DILocation(line: 165, column: 9, scope: !377)
!380 = !DILocation(line: 165, column: 72, scope: !377)
!381 = !DILocation(line: 165, column: 9, scope: !291)
!382 = !DILocation(line: 166, column: 34, scope: !383)
!383 = distinct !DILexicalBlock(scope: !377, file: !3, line: 165, column: 78)
!384 = !DILocation(line: 166, column: 45, scope: !383)
!385 = !DILocation(line: 166, column: 9, scope: !383)
!386 = !DILocation(line: 168, column: 5, scope: !383)
!387 = !DILocation(line: 169, column: 1, scope: !291)
!388 = distinct !DISubprogram(name: "aofRewriteBufferWrite", scope: !3, file: !3, line: 174, type: !389, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!11, !6}
!391 = !{!392, !393, !394, !395, !396, !398}
!392 = !DILocalVariable(name: "fd", arg: 1, scope: !388, file: !3, line: 174, type: !6)
!393 = !DILocalVariable(name: "ln", scope: !388, file: !3, line: 175, type: !116)
!394 = !DILocalVariable(name: "li", scope: !388, file: !3, line: 176, type: !126)
!395 = !DILocalVariable(name: "count", scope: !388, file: !3, line: 177, type: !11)
!396 = !DILocalVariable(name: "block", scope: !397, file: !3, line: 181, type: !134)
!397 = distinct !DILexicalBlock(scope: !388, file: !3, line: 180, column: 33)
!398 = !DILocalVariable(name: "nwritten", scope: !397, file: !3, line: 182, type: !11)
!399 = !DILocation(line: 174, column: 35, scope: !388)
!400 = !DILocation(line: 176, column: 5, scope: !388)
!401 = !DILocation(line: 177, column: 13, scope: !388)
!402 = !DILocation(line: 179, column: 23, scope: !388)
!403 = !DILocation(line: 176, column: 14, scope: !388)
!404 = !DILocation(line: 179, column: 5, scope: !388)
!405 = !DILocation(line: 180, column: 5, scope: !388)
!406 = !DILocation(line: 180, column: 17, scope: !388)
!407 = !DILocation(line: 175, column: 15, scope: !388)
!408 = !DILocation(line: 181, column: 29, scope: !397)
!409 = !DILocation(line: 181, column: 21, scope: !397)
!410 = !DILocation(line: 184, column: 20, scope: !411)
!411 = distinct !DILexicalBlock(scope: !397, file: !3, line: 184, column: 13)
!412 = !DILocation(line: 184, column: 13, scope: !411)
!413 = !DILocation(line: 184, column: 13, scope: !397)
!414 = !DILocation(line: 185, column: 33, scope: !415)
!415 = distinct !DILexicalBlock(scope: !411, file: !3, line: 184, column: 26)
!416 = !DILocation(line: 185, column: 24, scope: !415)
!417 = !DILocation(line: 182, column: 17, scope: !397)
!418 = !DILocation(line: 186, column: 45, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !3, line: 186, column: 17)
!420 = !DILocation(line: 186, column: 26, scope: !419)
!421 = !DILocation(line: 186, column: 17, scope: !415)
!422 = !DILocation(line: 187, column: 30, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !3, line: 187, column: 21)
!424 = distinct !DILexicalBlock(scope: !419, file: !3, line: 186, column: 51)
!425 = !DILocation(line: 187, column: 21, scope: !424)
!426 = !DILocation(line: 187, column: 36, scope: !423)
!427 = !DILocation(line: 187, column: 42, scope: !423)
!428 = !{!92, !92, i64 0}
!429 = !DILocation(line: 188, column: 17, scope: !424)
!430 = !DILocation(line: 190, column: 19, scope: !415)
!431 = !DILocation(line: 191, column: 9, scope: !415)
!432 = !DILocation(line: 0, scope: !388)
!433 = !DILocation(line: 192, column: 5, scope: !388)
!434 = !DILocation(line: 194, column: 1, scope: !388)
!435 = distinct !DISubprogram(name: "aofFsyncInProgress", scope: !3, file: !3, line: 202, type: !436, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!436 = !DISubroutineType(types: !437)
!437 = !{!6}
!438 = !DILocation(line: 203, column: 12, scope: !435)
!439 = !DILocation(line: 203, column: 48, scope: !435)
!440 = !DILocation(line: 203, column: 5, scope: !435)
!441 = distinct !DISubprogram(name: "aof_background_fsync", scope: !3, file: !3, line: 208, type: !4, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !442)
!442 = !{!443}
!443 = !DILocalVariable(name: "fd", arg: 1, scope: !441, file: !3, line: 208, type: !6)
!444 = !DILocation(line: 208, column: 31, scope: !441)
!445 = !DILocation(line: 209, column: 49, scope: !441)
!446 = !DILocation(line: 209, column: 42, scope: !441)
!447 = !DILocation(line: 209, column: 5, scope: !441)
!448 = !DILocation(line: 210, column: 1, scope: !441)
!449 = distinct !DISubprogram(name: "stopAppendOnly", scope: !3, file: !3, line: 234, type: !86, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!450 = !DILocation(line: 235, column: 5, scope: !449)
!451 = !{!91, !92, i64 1880}
!452 = !DILocation(line: 236, column: 5, scope: !449)
!453 = !DILocation(line: 237, column: 24, scope: !449)
!454 = !{!91, !92, i64 1960}
!455 = !DILocation(line: 237, column: 5, scope: !449)
!456 = !DILocation(line: 238, column: 18, scope: !449)
!457 = !DILocation(line: 238, column: 5, scope: !449)
!458 = !DILocation(line: 240, column: 19, scope: !449)
!459 = !DILocation(line: 241, column: 28, scope: !449)
!460 = !{!91, !92, i64 1964}
!461 = !DILocation(line: 242, column: 22, scope: !449)
!462 = !DILocation(line: 243, column: 5, scope: !449)
!463 = !DILocation(line: 244, column: 1, scope: !449)
!464 = !DILocation(line: 337, column: 30, scope: !2)
!465 = !DILocation(line: 339, column: 9, scope: !2)
!466 = !DILocation(line: 342, column: 23, scope: !467)
!467 = distinct !DILexicalBlock(scope: !2, file: !3, line: 342, column: 9)
!468 = !{!91, !95, i64 1952}
!469 = !DILocalVariable(name: "s", arg: 1, scope: !470, file: !26, line: 87, type: !475)
!470 = distinct !DISubprogram(name: "sdslen", scope: !26, file: !26, line: 87, type: !471, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !477)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !475}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !474, line: 58, baseType: !17)
!474 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !26, line: 43, baseType: !20)
!477 = !{!469, !478}
!478 = !DILocalVariable(name: "flags", scope: !470, file: !26, line: 88, type: !19)
!479 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !480)
!480 = distinct !DILocation(line: 342, column: 9, scope: !467)
!481 = !DILocation(line: 88, column: 27, scope: !470, inlinedAt: !480)
!482 = !{!93, !93, i64 0}
!483 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !480)
!484 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !480)
!485 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !480)
!486 = distinct !DILexicalBlock(scope: !470, file: !26, line: 89, column: 33)
!487 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !480)
!488 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !480)
!489 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !480)
!490 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !480)
!491 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !480)
!492 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !480)
!493 = !{!494, !494, i64 0}
!494 = !{!"short", !93, i64 0}
!495 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !480)
!496 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !480)
!497 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !480)
!498 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !480)
!499 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !480)
!500 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !480)
!501 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !480)
!502 = !DILocation(line: 101, column: 5, scope: !470, inlinedAt: !480)
!503 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !480)
!504 = !DILocation(line: 0, scope: !505)
!505 = distinct !DILexicalBlock(scope: !2, file: !3, line: 358, column: 9)
!506 = !{!91, !92, i64 1884}
!507 = !DILocation(line: 342, column: 9, scope: !2)
!508 = !DILocation(line: 0, scope: !2)
!509 = !DILocation(line: 348, column: 52, scope: !510)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 348, column: 13)
!511 = distinct !DILexicalBlock(scope: !467, file: !3, line: 342, column: 38)
!512 = !DILocation(line: 0, scope: !486, inlinedAt: !480)
!513 = !DILocation(line: 0, scope: !467)
!514 = !DILocation(line: 342, column: 32, scope: !467)
!515 = !DILocation(line: 349, column: 20, scope: !510)
!516 = !{!91, !96, i64 1928}
!517 = !DILocation(line: 349, column: 47, scope: !510)
!518 = !{!91, !96, i64 1920}
!519 = !DILocation(line: 349, column: 37, scope: !510)
!520 = !DILocation(line: 349, column: 64, scope: !510)
!521 = !DILocation(line: 350, column: 20, scope: !510)
!522 = !{!91, !96, i64 2872}
!523 = !DILocation(line: 350, column: 38, scope: !510)
!524 = !{!91, !96, i64 1976}
!525 = !DILocation(line: 350, column: 29, scope: !510)
!526 = !DILocation(line: 350, column: 53, scope: !510)
!527 = !DILocation(line: 203, column: 12, scope: !435, inlinedAt: !528)
!528 = distinct !DILocation(line: 351, column: 34, scope: !510)
!529 = !DILocation(line: 203, column: 48, scope: !435, inlinedAt: !528)
!530 = !DILocation(line: 203, column: 5, scope: !435, inlinedAt: !528)
!531 = !DILocation(line: 348, column: 13, scope: !511)
!532 = !DILocation(line: 358, column: 9, scope: !2)
!533 = !DILocation(line: 203, column: 12, scope: !435, inlinedAt: !534)
!534 = distinct !DILocation(line: 359, column: 28, scope: !505)
!535 = !DILocation(line: 203, column: 48, scope: !435, inlinedAt: !534)
!536 = !DILocation(line: 203, column: 5, scope: !435, inlinedAt: !534)
!537 = !DILocation(line: 359, column: 9, scope: !505)
!538 = !DILocation(line: 361, column: 16, scope: !539)
!539 = distinct !DILexicalBlock(scope: !2, file: !3, line: 361, column: 9)
!540 = !DILocation(line: 361, column: 26, scope: !539)
!541 = !DILocation(line: 361, column: 52, scope: !539)
!542 = !DILocation(line: 361, column: 48, scope: !539)
!543 = !DILocation(line: 366, column: 24, scope: !544)
!544 = distinct !DILexicalBlock(scope: !545, file: !3, line: 366, column: 17)
!545 = distinct !DILexicalBlock(scope: !546, file: !3, line: 365, column: 31)
!546 = distinct !DILexicalBlock(scope: !547, file: !3, line: 365, column: 13)
!547 = distinct !DILexicalBlock(scope: !539, file: !3, line: 361, column: 59)
!548 = !{!91, !96, i64 1968}
!549 = !DILocation(line: 366, column: 50, scope: !544)
!550 = !DILocation(line: 0, scope: !551)
!551 = distinct !DILexicalBlock(scope: !544, file: !3, line: 371, column: 24)
!552 = !DILocation(line: 366, column: 17, scope: !545)
!553 = !DILocation(line: 369, column: 50, scope: !554)
!554 = distinct !DILexicalBlock(scope: !544, file: !3, line: 366, column: 56)
!555 = !DILocation(line: 370, column: 17, scope: !554)
!556 = !DILocation(line: 371, column: 40, scope: !551)
!557 = !DILocation(line: 371, column: 75, scope: !551)
!558 = !DILocation(line: 371, column: 24, scope: !544)
!559 = !DILocation(line: 378, column: 37, scope: !545)
!560 = !{!91, !96, i64 2008}
!561 = !DILocation(line: 379, column: 13, scope: !545)
!562 = !DILocation(line: 380, column: 9, scope: !545)
!563 = !DILocation(line: 0, scope: !545)
!564 = !DILocation(line: 388, column: 5, scope: !565)
!565 = distinct !DILexicalBlock(scope: !2, file: !3, line: 388, column: 5)
!566 = !{!91, !97, i64 3096}
!567 = !DILocation(line: 388, column: 5, scope: !2)
!568 = !DILocation(line: 388, column: 5, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !3, line: 388, column: 5)
!570 = !DILocation(line: 340, column: 14, scope: !2)
!571 = !DILocation(line: 389, column: 32, scope: !2)
!572 = !DILocation(line: 389, column: 46, scope: !2)
!573 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !574)
!574 = distinct !DILocation(line: 389, column: 54, scope: !2)
!575 = !DILocation(line: 88, column: 27, scope: !470, inlinedAt: !574)
!576 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !574)
!577 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !574)
!578 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !574)
!579 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !574)
!580 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !574)
!581 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !574)
!582 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !574)
!583 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !574)
!584 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !574)
!585 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !574)
!586 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !574)
!587 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !574)
!588 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !574)
!589 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !574)
!590 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !574)
!591 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !574)
!592 = !DILocation(line: 0, scope: !486, inlinedAt: !574)
!593 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !574)
!594 = !DILocalVariable(name: "fd", arg: 1, scope: !595, file: !3, line: 297, type: !6)
!595 = distinct !DISubprogram(name: "aofWrite", scope: !3, file: !3, line: 297, type: !596, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !603)
!596 = !DISubroutineType(types: !597)
!597 = !{!11, !6, !598, !600}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !601, line: 40, baseType: !602)
!601 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !14, line: 129, baseType: !17)
!603 = !{!594, !604, !605, !606, !607}
!604 = !DILocalVariable(name: "buf", arg: 2, scope: !595, file: !3, line: 297, type: !598)
!605 = !DILocalVariable(name: "len", arg: 3, scope: !595, file: !3, line: 297, type: !600)
!606 = !DILocalVariable(name: "nwritten", scope: !595, file: !3, line: 298, type: !11)
!607 = !DILocalVariable(name: "totwritten", scope: !595, file: !3, line: 298, type: !11)
!608 = !DILocation(line: 297, column: 22, scope: !595, inlinedAt: !609)
!609 = distinct !DILocation(line: 389, column: 16, scope: !2)
!610 = !DILocation(line: 297, column: 38, scope: !595, inlinedAt: !609)
!611 = !DILocation(line: 297, column: 50, scope: !595, inlinedAt: !609)
!612 = !DILocation(line: 298, column: 13, scope: !595, inlinedAt: !609)
!613 = !DILocation(line: 298, column: 27, scope: !595, inlinedAt: !609)
!614 = !DILocation(line: 300, column: 5, scope: !595, inlinedAt: !609)
!615 = !DILocation(line: 301, column: 20, scope: !616, inlinedAt: !609)
!616 = distinct !DILexicalBlock(scope: !595, file: !3, line: 300, column: 16)
!617 = !DILocation(line: 303, column: 22, scope: !618, inlinedAt: !609)
!618 = distinct !DILexicalBlock(scope: !616, file: !3, line: 303, column: 13)
!619 = !DILocation(line: 303, column: 13, scope: !616, inlinedAt: !609)
!620 = !DILocation(line: 304, column: 17, scope: !621, inlinedAt: !609)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 304, column: 17)
!622 = distinct !DILexicalBlock(scope: !618, file: !3, line: 303, column: 27)
!623 = !DILocation(line: 304, column: 23, scope: !621, inlinedAt: !609)
!624 = !DILocation(line: 304, column: 17, scope: !622, inlinedAt: !609)
!625 = distinct !{!625, !626, !627}
!626 = !DILocation(line: 300, column: 5, scope: !595)
!627 = !DILocation(line: 313, column: 5, scope: !595)
!628 = !DILocation(line: 307, column: 20, scope: !622, inlinedAt: !609)
!629 = !DILocation(line: 307, column: 13, scope: !622, inlinedAt: !609)
!630 = !DILocation(line: 310, column: 13, scope: !616, inlinedAt: !609)
!631 = !DILocation(line: 311, column: 13, scope: !616, inlinedAt: !609)
!632 = !DILocation(line: 312, column: 20, scope: !616, inlinedAt: !609)
!633 = !DILocation(line: 0, scope: !595, inlinedAt: !609)
!634 = !DILocation(line: 316, column: 1, scope: !595, inlinedAt: !609)
!635 = !DILocation(line: 338, column: 13, scope: !2)
!636 = !DILocation(line: 390, column: 5, scope: !637)
!637 = distinct !DILexicalBlock(scope: !2, file: !3, line: 390, column: 5)
!638 = !DILocation(line: 390, column: 5, scope: !2)
!639 = !DILocation(line: 390, column: 5, scope: !640)
!640 = distinct !DILexicalBlock(scope: !637, file: !3, line: 390, column: 5)
!641 = !DILocation(line: 0, scope: !569)
!642 = !DILocation(line: 396, column: 9, scope: !2)
!643 = !DILocation(line: 397, column: 9, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !3, line: 397, column: 9)
!645 = distinct !DILexicalBlock(scope: !646, file: !3, line: 396, column: 27)
!646 = distinct !DILexicalBlock(scope: !2, file: !3, line: 396, column: 9)
!647 = !DILocation(line: 397, column: 9, scope: !645)
!648 = !DILocation(line: 398, column: 23, scope: !649)
!649 = distinct !DILexicalBlock(scope: !646, file: !3, line: 398, column: 16)
!650 = !{!91, !92, i64 1940}
!651 = !DILocation(line: 398, column: 53, scope: !649)
!652 = !DILocation(line: 398, column: 43, scope: !649)
!653 = !DILocation(line: 0, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !3, line: 401, column: 9)
!655 = distinct !DILexicalBlock(scope: !649, file: !3, line: 400, column: 12)
!656 = !DILocation(line: 0, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !3, line: 399, column: 9)
!658 = distinct !DILexicalBlock(scope: !649, file: !3, line: 398, column: 74)
!659 = !DILocation(line: 399, column: 9, scope: !657)
!660 = !DILocation(line: 399, column: 9, scope: !658)
!661 = !DILocation(line: 401, column: 9, scope: !654)
!662 = !DILocation(line: 401, column: 9, scope: !655)
!663 = !DILocation(line: 403, column: 5, scope: !664)
!664 = distinct !DILexicalBlock(scope: !2, file: !3, line: 403, column: 5)
!665 = !DILocation(line: 403, column: 5, scope: !2)
!666 = !DILocation(line: 406, column: 38, scope: !2)
!667 = !DILocation(line: 408, column: 44, scope: !78)
!668 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !669)
!669 = distinct !DILocation(line: 408, column: 30, scope: !78)
!670 = !DILocation(line: 88, column: 27, scope: !470, inlinedAt: !669)
!671 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !669)
!672 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !669)
!673 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !669)
!674 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !669)
!675 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !669)
!676 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !669)
!677 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !669)
!678 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !669)
!679 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !669)
!680 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !669)
!681 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !669)
!682 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !669)
!683 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !669)
!684 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !669)
!685 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !669)
!686 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !669)
!687 = !DILocation(line: 0, scope: !486, inlinedAt: !669)
!688 = !DILocation(line: 0, scope: !78)
!689 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !669)
!690 = !DILocation(line: 408, column: 18, scope: !78)
!691 = !DILocation(line: 408, column: 9, scope: !2)
!692 = !DILocation(line: 410, column: 13, scope: !77)
!693 = !DILocation(line: 413, column: 21, scope: !694)
!694 = distinct !DILexicalBlock(scope: !77, file: !3, line: 413, column: 13)
!695 = !DILocation(line: 413, column: 32, scope: !694)
!696 = !DILocation(line: 413, column: 30, scope: !694)
!697 = !DILocation(line: 413, column: 54, scope: !694)
!698 = !DILocation(line: 413, column: 13, scope: !77)
!699 = !DILocation(line: 415, column: 34, scope: !700)
!700 = distinct !DILexicalBlock(scope: !694, file: !3, line: 413, column: 82)
!701 = !DILocation(line: 416, column: 9, scope: !700)
!702 = !DILocation(line: 419, column: 22, scope: !703)
!703 = distinct !DILexicalBlock(scope: !77, file: !3, line: 419, column: 13)
!704 = !DILocation(line: 419, column: 13, scope: !77)
!705 = !DILocation(line: 0, scope: !706)
!706 = distinct !DILexicalBlock(scope: !703, file: !3, line: 425, column: 16)
!707 = !DILocation(line: 420, column: 17, scope: !708)
!708 = distinct !DILexicalBlock(scope: !703, file: !3, line: 419, column: 29)
!709 = !DILocation(line: 422, column: 30, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 420, column: 26)
!711 = distinct !DILexicalBlock(scope: !708, file: !3, line: 420, column: 17)
!712 = !DILocation(line: 422, column: 21, scope: !710)
!713 = !DILocation(line: 421, column: 17, scope: !710)
!714 = !DILocation(line: 423, column: 47, scope: !710)
!715 = !DILocation(line: 424, column: 13, scope: !710)
!716 = !DILocation(line: 426, column: 17, scope: !706)
!717 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !718)
!718 = distinct !DILocation(line: 431, column: 51, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 426, column: 26)
!720 = distinct !DILexicalBlock(scope: !706, file: !3, line: 426, column: 17)
!721 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !718)
!722 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !718)
!723 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !718)
!724 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !718)
!725 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !718)
!726 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !718)
!727 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !718)
!728 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !718)
!729 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !718)
!730 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !718)
!731 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !718)
!732 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !718)
!733 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !718)
!734 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !718)
!735 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !718)
!736 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !718)
!737 = !DILocation(line: 0, scope: !486, inlinedAt: !718)
!738 = !DILocation(line: 0, scope: !719)
!739 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !718)
!740 = !DILocation(line: 427, column: 17, scope: !719)
!741 = !DILocation(line: 432, column: 13, scope: !719)
!742 = !DILocation(line: 434, column: 34, scope: !743)
!743 = distinct !DILexicalBlock(scope: !706, file: !3, line: 434, column: 17)
!744 = !DILocation(line: 434, column: 49, scope: !743)
!745 = !DILocation(line: 434, column: 17, scope: !743)
!746 = !DILocation(line: 434, column: 67, scope: !743)
!747 = !DILocation(line: 434, column: 17, scope: !706)
!748 = !DILocation(line: 439, column: 56, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 435, column: 30)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 435, column: 21)
!751 = distinct !DILexicalBlock(scope: !743, file: !3, line: 434, column: 74)
!752 = !DILocation(line: 439, column: 47, scope: !749)
!753 = !DILocation(line: 436, column: 21, scope: !749)
!754 = !DILocation(line: 440, column: 17, scope: !749)
!755 = !{!91, !92, i64 2028}
!756 = !DILocation(line: 450, column: 20, scope: !757)
!757 = distinct !DILexicalBlock(scope: !77, file: !3, line: 450, column: 13)
!758 = !DILocation(line: 389, column: 14, scope: !2)
!759 = !DILocation(line: 450, column: 30, scope: !757)
!760 = !DILocation(line: 450, column: 13, scope: !77)
!761 = !DILocation(line: 455, column: 13, scope: !762)
!762 = distinct !DILexicalBlock(scope: !757, file: !3, line: 450, column: 51)
!763 = !DILocation(line: 456, column: 13, scope: !762)
!764 = !DILocation(line: 461, column: 42, scope: !765)
!765 = distinct !DILexicalBlock(scope: !757, file: !3, line: 457, column: 16)
!766 = !{!91, !92, i64 2024}
!767 = !DILocation(line: 465, column: 26, scope: !768)
!768 = distinct !DILexicalBlock(scope: !765, file: !3, line: 465, column: 17)
!769 = !DILocation(line: 465, column: 17, scope: !765)
!770 = !DILocation(line: 466, column: 41, scope: !771)
!771 = distinct !DILexicalBlock(scope: !768, file: !3, line: 465, column: 31)
!772 = !DILocation(line: 467, column: 33, scope: !771)
!773 = !DILocation(line: 467, column: 17, scope: !771)
!774 = !DILocation(line: 468, column: 13, scope: !771)
!775 = !DILocation(line: 474, column: 20, scope: !776)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 474, column: 13)
!777 = distinct !DILexicalBlock(scope: !78, file: !3, line: 471, column: 12)
!778 = !DILocation(line: 474, column: 42, scope: !776)
!779 = !DILocation(line: 474, column: 13, scope: !777)
!780 = !DILocation(line: 475, column: 13, scope: !781)
!781 = distinct !DILexicalBlock(scope: !776, file: !3, line: 474, column: 52)
!782 = !DILocation(line: 477, column: 42, scope: !781)
!783 = !DILocation(line: 478, column: 9, scope: !781)
!784 = !DILocation(line: 484, column: 24, scope: !785)
!785 = distinct !DILexicalBlock(scope: !2, file: !3, line: 484, column: 9)
!786 = !DILocation(line: 88, column: 27, scope: !470, inlinedAt: !787)
!787 = distinct !DILocation(line: 484, column: 10, scope: !785)
!788 = !DILocation(line: 480, column: 29, scope: !2)
!789 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !787)
!790 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !787)
!791 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !787)
!792 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !787)
!793 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !787)
!794 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !787)
!795 = !DILocalVariable(name: "s", arg: 1, scope: !796, file: !26, line: 104, type: !475)
!796 = distinct !DISubprogram(name: "sdsavail", scope: !26, file: !26, line: 104, type: !471, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !797)
!797 = !{!795, !798, !799, !802, !804, !806}
!798 = !DILocalVariable(name: "flags", scope: !796, file: !26, line: 105, type: !19)
!799 = !DILocalVariable(name: "sh", scope: !800, file: !26, line: 111, type: !24)
!800 = distinct !DILexicalBlock(scope: !801, file: !26, line: 110, column: 26)
!801 = distinct !DILexicalBlock(scope: !796, file: !26, line: 106, column: 33)
!802 = !DILocalVariable(name: "sh", scope: !803, file: !26, line: 115, type: !39)
!803 = distinct !DILexicalBlock(scope: !801, file: !26, line: 114, column: 27)
!804 = !DILocalVariable(name: "sh", scope: !805, file: !26, line: 119, type: !49)
!805 = distinct !DILexicalBlock(scope: !801, file: !26, line: 118, column: 27)
!806 = !DILocalVariable(name: "sh", scope: !807, file: !26, line: 123, type: !59)
!807 = distinct !DILexicalBlock(scope: !801, file: !26, line: 122, column: 27)
!808 = !DILocation(line: 104, column: 41, scope: !796, inlinedAt: !809)
!809 = distinct !DILocation(line: 484, column: 33, scope: !785)
!810 = !DILocation(line: 105, column: 19, scope: !796, inlinedAt: !809)
!811 = !DILocation(line: 106, column: 5, scope: !796, inlinedAt: !809)
!812 = !DILocation(line: 108, column: 13, scope: !813, inlinedAt: !809)
!813 = distinct !DILexicalBlock(scope: !801, file: !26, line: 107, column: 26)
!814 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !787)
!815 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !787)
!816 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !787)
!817 = !DILocation(line: 111, column: 13, scope: !800, inlinedAt: !809)
!818 = !DILocation(line: 112, column: 24, scope: !800, inlinedAt: !809)
!819 = !DILocation(line: 112, column: 20, scope: !800, inlinedAt: !809)
!820 = !DILocation(line: 112, column: 30, scope: !800, inlinedAt: !809)
!821 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !787)
!822 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !787)
!823 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !787)
!824 = !DILocation(line: 115, column: 13, scope: !803, inlinedAt: !809)
!825 = !DILocation(line: 116, column: 24, scope: !803, inlinedAt: !809)
!826 = !DILocation(line: 116, column: 20, scope: !803, inlinedAt: !809)
!827 = !DILocation(line: 116, column: 30, scope: !803, inlinedAt: !809)
!828 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !787)
!829 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !787)
!830 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !787)
!831 = !DILocation(line: 119, column: 13, scope: !805, inlinedAt: !809)
!832 = !DILocation(line: 120, column: 24, scope: !805, inlinedAt: !809)
!833 = !DILocation(line: 120, column: 30, scope: !805, inlinedAt: !809)
!834 = !DILocation(line: 120, column: 20, scope: !805, inlinedAt: !809)
!835 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !787)
!836 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !787)
!837 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !787)
!838 = !DILocation(line: 123, column: 13, scope: !807, inlinedAt: !809)
!839 = !DILocation(line: 124, column: 24, scope: !807, inlinedAt: !809)
!840 = !DILocation(line: 124, column: 30, scope: !807, inlinedAt: !809)
!841 = !DILocation(line: 101, column: 5, scope: !470, inlinedAt: !787)
!842 = !DILocation(line: 127, column: 5, scope: !796, inlinedAt: !809)
!843 = !DILocation(line: 0, scope: !813, inlinedAt: !809)
!844 = !DILocation(line: 128, column: 1, scope: !796, inlinedAt: !809)
!845 = !DILocation(line: 484, column: 32, scope: !785)
!846 = !DILocation(line: 484, column: 59, scope: !785)
!847 = !DILocation(line: 484, column: 9, scope: !2)
!848 = !DILocation(line: 485, column: 9, scope: !849)
!849 = distinct !DILexicalBlock(scope: !785, file: !3, line: 484, column: 67)
!850 = !DILocation(line: 486, column: 5, scope: !849)
!851 = !DILocation(line: 487, column: 9, scope: !852)
!852 = distinct !DILexicalBlock(scope: !785, file: !3, line: 486, column: 12)
!853 = !DILocation(line: 488, column: 26, scope: !852)
!854 = !DILocation(line: 488, column: 24, scope: !852)
!855 = !DILocation(line: 494, column: 16, scope: !856)
!856 = distinct !DILexicalBlock(scope: !2, file: !3, line: 494, column: 9)
!857 = !{!91, !92, i64 1896}
!858 = !DILocation(line: 494, column: 9, scope: !856)
!859 = !DILocation(line: 494, column: 40, scope: !856)
!860 = !DILocation(line: 495, column: 17, scope: !856)
!861 = !DILocation(line: 495, column: 47, scope: !856)
!862 = !DILocation(line: 495, column: 37, scope: !856)
!863 = !DILocation(line: 499, column: 16, scope: !864)
!864 = distinct !DILexicalBlock(scope: !2, file: !3, line: 499, column: 9)
!865 = !DILocation(line: 499, column: 26, scope: !864)
!866 = !DILocation(line: 499, column: 9, scope: !2)
!867 = !DILocation(line: 502, column: 9, scope: !868)
!868 = distinct !DILexicalBlock(scope: !869, file: !3, line: 502, column: 9)
!869 = distinct !DILexicalBlock(scope: !864, file: !3, line: 499, column: 47)
!870 = !DILocation(line: 502, column: 9, scope: !869)
!871 = !DILocation(line: 502, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !868, file: !3, line: 502, column: 9)
!873 = !DILocation(line: 503, column: 28, scope: !869)
!874 = !DILocation(line: 503, column: 9, scope: !869)
!875 = !DILocation(line: 504, column: 9, scope: !876)
!876 = distinct !DILexicalBlock(scope: !869, file: !3, line: 504, column: 9)
!877 = !DILocation(line: 504, column: 9, scope: !869)
!878 = !DILocation(line: 505, column: 9, scope: !879)
!879 = distinct !DILexicalBlock(scope: !869, file: !3, line: 505, column: 9)
!880 = !DILocation(line: 504, column: 9, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !3, line: 504, column: 9)
!882 = !DILocation(line: 505, column: 9, scope: !869)
!883 = !DILocation(line: 506, column: 42, scope: !869)
!884 = !DILocation(line: 506, column: 33, scope: !869)
!885 = !DILocation(line: 507, column: 40, scope: !869)
!886 = !DILocation(line: 507, column: 31, scope: !869)
!887 = !DILocation(line: 508, column: 5, scope: !869)
!888 = !DILocation(line: 508, column: 34, scope: !889)
!889 = distinct !DILexicalBlock(scope: !864, file: !3, line: 508, column: 16)
!890 = !DILocation(line: 508, column: 56, scope: !889)
!891 = !DILocation(line: 509, column: 24, scope: !889)
!892 = !DILocation(line: 509, column: 42, scope: !889)
!893 = !DILocation(line: 509, column: 33, scope: !889)
!894 = !DILocation(line: 508, column: 16, scope: !864)
!895 = !DILocation(line: 510, column: 14, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !3, line: 510, column: 13)
!897 = distinct !DILexicalBlock(scope: !889, file: !3, line: 509, column: 59)
!898 = !DILocation(line: 510, column: 13, scope: !897)
!899 = !DILocation(line: 511, column: 41, scope: !900)
!900 = distinct !DILexicalBlock(scope: !896, file: !3, line: 510, column: 32)
!901 = !DILocation(line: 208, column: 31, scope: !441, inlinedAt: !902)
!902 = distinct !DILocation(line: 511, column: 13, scope: !900)
!903 = !DILocation(line: 209, column: 49, scope: !441, inlinedAt: !902)
!904 = !DILocation(line: 209, column: 42, scope: !441, inlinedAt: !902)
!905 = !DILocation(line: 209, column: 5, scope: !441, inlinedAt: !902)
!906 = !DILocation(line: 210, column: 1, scope: !441, inlinedAt: !902)
!907 = !DILocation(line: 512, column: 46, scope: !900)
!908 = !DILocation(line: 512, column: 37, scope: !900)
!909 = !DILocation(line: 513, column: 9, scope: !900)
!910 = !DILocation(line: 514, column: 40, scope: !897)
!911 = !DILocation(line: 514, column: 31, scope: !897)
!912 = !DILocation(line: 515, column: 5, scope: !897)
!913 = !DILocation(line: 516, column: 1, scope: !2)
!914 = distinct !DISubprogram(name: "killAppendOnlyChild", scope: !3, file: !3, line: 213, type: !86, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !915)
!915 = !{!916}
!916 = !DILocalVariable(name: "statloc", scope: !914, file: !3, line: 214, type: !6)
!917 = !DILocalVariable(name: "tmpfile", scope: !918, file: !3, line: 1633, type: !925)
!918 = distinct !DISubprogram(name: "aofRemoveTempFile", scope: !3, file: !3, line: 1632, type: !919, isLocal: false, isDefinition: true, scopeLine: 1632, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !923)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !921}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !922, line: 61, baseType: !6)
!922 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!923 = !{!924, !917}
!924 = !DILocalVariable(name: "childpid", arg: 1, scope: !918, file: !3, line: 1632, type: !921)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 256)
!928 = !DILocation(line: 1633, column: 10, scope: !918, inlinedAt: !929)
!929 = distinct !DILocation(line: 225, column: 5, scope: !914)
!930 = !DILocation(line: 214, column: 5, scope: !914)
!931 = !DILocation(line: 216, column: 16, scope: !932)
!932 = distinct !DILexicalBlock(scope: !914, file: !3, line: 216, column: 9)
!933 = !DILocation(line: 216, column: 30, scope: !932)
!934 = !DILocation(line: 216, column: 9, scope: !914)
!935 = !DILocation(line: 219, column: 9, scope: !914)
!936 = !DILocation(line: 218, column: 5, scope: !914)
!937 = !DILocation(line: 220, column: 21, scope: !938)
!938 = distinct !DILexicalBlock(scope: !914, file: !3, line: 220, column: 9)
!939 = !DILocation(line: 220, column: 9, scope: !938)
!940 = !DILocation(line: 220, column: 44, scope: !938)
!941 = !DILocation(line: 220, column: 9, scope: !914)
!942 = !DILocation(line: 214, column: 9, scope: !914)
!943 = !DILocation(line: 221, column: 15, scope: !944)
!944 = distinct !DILexicalBlock(scope: !938, file: !3, line: 220, column: 51)
!945 = !DILocation(line: 221, column: 48, scope: !944)
!946 = !DILocation(line: 221, column: 38, scope: !944)
!947 = !DILocation(line: 221, column: 9, scope: !944)
!948 = distinct !{!948, !947, !949}
!949 = !DILocation(line: 221, column: 62, scope: !944)
!950 = !DILocation(line: 71, column: 16, scope: !89, inlinedAt: !951)
!951 = distinct !DILocation(line: 224, column: 5, scope: !914)
!952 = !DILocation(line: 71, column: 9, scope: !89, inlinedAt: !951)
!953 = !DILocation(line: 71, column: 9, scope: !85, inlinedAt: !951)
!954 = !DILocation(line: 72, column: 9, scope: !89, inlinedAt: !951)
!955 = !DILocation(line: 74, column: 37, scope: !85, inlinedAt: !951)
!956 = !DILocation(line: 74, column: 35, scope: !85, inlinedAt: !951)
!957 = !DILocation(line: 75, column: 5, scope: !85, inlinedAt: !951)
!958 = !DILocation(line: 76, column: 1, scope: !85, inlinedAt: !951)
!959 = !DILocation(line: 225, column: 30, scope: !914)
!960 = !DILocation(line: 1632, column: 30, scope: !918, inlinedAt: !929)
!961 = !DILocation(line: 1633, column: 5, scope: !918, inlinedAt: !929)
!962 = !DILocation(line: 1635, column: 5, scope: !918, inlinedAt: !929)
!963 = !DILocation(line: 1636, column: 5, scope: !918, inlinedAt: !929)
!964 = !DILocation(line: 1637, column: 1, scope: !918, inlinedAt: !929)
!965 = !DILocation(line: 226, column: 26, scope: !914)
!966 = !DILocation(line: 227, column: 35, scope: !914)
!967 = !{!91, !96, i64 1992}
!968 = !DILocation(line: 1533, column: 30, scope: !969, inlinedAt: !970)
!969 = distinct !DISubprogram(name: "aofClosePipes", scope: !3, file: !3, line: 1532, type: !86, isLocal: false, isDefinition: true, scopeLine: 1532, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!970 = distinct !DILocation(line: 229, column: 5, scope: !914)
!971 = !DILocation(line: 1533, column: 40, scope: !969, inlinedAt: !970)
!972 = !{!91, !92, i64 2052}
!973 = !DILocation(line: 1533, column: 5, scope: !969, inlinedAt: !970)
!974 = !DILocation(line: 1534, column: 30, scope: !969, inlinedAt: !970)
!975 = !DILocation(line: 1534, column: 40, scope: !969, inlinedAt: !970)
!976 = !DILocation(line: 1534, column: 5, scope: !969, inlinedAt: !970)
!977 = !DILocation(line: 1535, column: 18, scope: !969, inlinedAt: !970)
!978 = !DILocation(line: 1535, column: 5, scope: !969, inlinedAt: !970)
!979 = !DILocation(line: 1536, column: 18, scope: !969, inlinedAt: !970)
!980 = !{!91, !92, i64 2044}
!981 = !DILocation(line: 1536, column: 5, scope: !969, inlinedAt: !970)
!982 = !DILocation(line: 1537, column: 18, scope: !969, inlinedAt: !970)
!983 = !{!91, !92, i64 2048}
!984 = !DILocation(line: 1537, column: 5, scope: !969, inlinedAt: !970)
!985 = !DILocation(line: 1538, column: 18, scope: !969, inlinedAt: !970)
!986 = !DILocation(line: 1538, column: 5, scope: !969, inlinedAt: !970)
!987 = !DILocation(line: 1539, column: 18, scope: !969, inlinedAt: !970)
!988 = !{!91, !92, i64 2056}
!989 = !DILocation(line: 1539, column: 5, scope: !969, inlinedAt: !970)
!990 = !DILocation(line: 1540, column: 18, scope: !969, inlinedAt: !970)
!991 = !{!91, !92, i64 2060}
!992 = !DILocation(line: 1540, column: 5, scope: !969, inlinedAt: !970)
!993 = !DILocation(line: 1541, column: 1, scope: !969, inlinedAt: !970)
!994 = !DILocation(line: 230, column: 1, scope: !914)
!995 = !DILocation(line: 0, scope: !932)
!996 = distinct !DISubprogram(name: "startAppendOnly", scope: !3, file: !3, line: 248, type: !436, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !997)
!997 = !{!998, !1002, !1003}
!998 = !DILocalVariable(name: "cwd", scope: !996, file: !3, line: 249, type: !999)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 1024)
!1002 = !DILocalVariable(name: "newfd", scope: !996, file: !3, line: 250, type: !6)
!1003 = !DILocalVariable(name: "cwdp", scope: !1004, file: !3, line: 255, type: !20)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 254, column: 22)
!1005 = distinct !DILexicalBlock(scope: !996, file: !3, line: 254, column: 9)
!1006 = !DILocation(line: 249, column: 5, scope: !996)
!1007 = !DILocation(line: 249, column: 10, scope: !996)
!1008 = !DILocation(line: 252, column: 25, scope: !996)
!1009 = !{!91, !95, i64 1888}
!1010 = !DILocation(line: 252, column: 13, scope: !996)
!1011 = !DILocation(line: 250, column: 9, scope: !996)
!1012 = !DILocation(line: 253, column: 5, scope: !996)
!1013 = !DILocation(line: 254, column: 15, scope: !1005)
!1014 = !DILocation(line: 254, column: 9, scope: !996)
!1015 = !DILocation(line: 255, column: 22, scope: !1004)
!1016 = !DILocation(line: 255, column: 15, scope: !1004)
!1017 = !DILocation(line: 260, column: 20, scope: !1004)
!1018 = !DILocation(line: 261, column: 13, scope: !1004)
!1019 = !DILocation(line: 262, column: 22, scope: !1004)
!1020 = !DILocation(line: 262, column: 13, scope: !1004)
!1021 = !DILocation(line: 257, column: 9, scope: !1004)
!1022 = !DILocation(line: 265, column: 16, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !996, file: !3, line: 265, column: 9)
!1024 = !{!91, !92, i64 2096}
!1025 = !DILocation(line: 265, column: 30, scope: !1023)
!1026 = !DILocation(line: 265, column: 9, scope: !996)
!1027 = !DILocation(line: 266, column: 38, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 265, column: 37)
!1029 = !{!91, !92, i64 1936}
!1030 = !DILocation(line: 267, column: 9, scope: !1028)
!1031 = !DILocation(line: 268, column: 5, scope: !1028)
!1032 = !DILocation(line: 272, column: 20, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 272, column: 13)
!1034 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 268, column: 12)
!1035 = !DILocation(line: 272, column: 34, scope: !1033)
!1036 = !DILocation(line: 272, column: 13, scope: !1034)
!1037 = !DILocation(line: 273, column: 13, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 272, column: 41)
!1039 = !DILocation(line: 274, column: 13, scope: !1038)
!1040 = !DILocation(line: 275, column: 9, scope: !1038)
!1041 = !DILocation(line: 276, column: 13, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 276, column: 13)
!1043 = !DILocation(line: 276, column: 47, scope: !1042)
!1044 = !DILocation(line: 276, column: 13, scope: !1034)
!1045 = !DILocation(line: 277, column: 13, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 276, column: 57)
!1047 = !DILocation(line: 278, column: 13, scope: !1046)
!1048 = !DILocation(line: 279, column: 13, scope: !1046)
!1049 = !DILocation(line: 284, column: 22, scope: !996)
!1050 = !DILocation(line: 285, column: 36, scope: !996)
!1051 = !DILocation(line: 285, column: 27, scope: !996)
!1052 = !DILocation(line: 286, column: 19, scope: !996)
!1053 = !DILocation(line: 287, column: 5, scope: !996)
!1054 = !DILocation(line: 0, scope: !1046)
!1055 = !DILocation(line: 288, column: 1, scope: !996)
!1056 = distinct !DISubprogram(name: "rewriteAppendOnlyFileBackground", scope: !3, file: !3, line: 1559, type: !436, isLocal: false, isDefinition: true, scopeLine: 1559, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1057)
!1057 = !{!1058, !1059, !1060, !1063}
!1058 = !DILocalVariable(name: "childpid", scope: !1056, file: !3, line: 1560, type: !921)
!1059 = !DILocalVariable(name: "start", scope: !1056, file: !3, line: 1561, type: !16)
!1060 = !DILocalVariable(name: "tmpfile", scope: !1061, file: !3, line: 1568, type: !925)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 1567, column: 35)
!1062 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1567, column: 9)
!1063 = !DILocalVariable(name: "private_dirty", scope: !1064, file: !3, line: 1575, type: !600)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1574, column: 53)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1574, column: 13)
!1066 = !DILocation(line: 1563, column: 16, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1563, column: 9)
!1068 = !DILocation(line: 1563, column: 46, scope: !1067)
!1069 = !DILocation(line: 1563, column: 36, scope: !1067)
!1070 = !DILocation(line: 1564, column: 9, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1564, column: 9)
!1072 = !DILocation(line: 1564, column: 26, scope: !1071)
!1073 = !DILocation(line: 1564, column: 9, scope: !1056)
!1074 = !DILocation(line: 1565, column: 5, scope: !1056)
!1075 = !DILocation(line: 1566, column: 13, scope: !1056)
!1076 = !DILocation(line: 1561, column: 15, scope: !1056)
!1077 = !DILocation(line: 1567, column: 21, scope: !1062)
!1078 = !DILocation(line: 1560, column: 11, scope: !1056)
!1079 = !DILocation(line: 1567, column: 29, scope: !1062)
!1080 = !DILocation(line: 1567, column: 9, scope: !1056)
!1081 = !DILocation(line: 1568, column: 9, scope: !1061)
!1082 = !DILocation(line: 1568, column: 14, scope: !1061)
!1083 = !DILocation(line: 1571, column: 9, scope: !1061)
!1084 = !DILocation(line: 1572, column: 9, scope: !1061)
!1085 = !DILocation(line: 1573, column: 65, scope: !1061)
!1086 = !DILocation(line: 1573, column: 9, scope: !1061)
!1087 = !DILocation(line: 1574, column: 13, scope: !1065)
!1088 = !DILocation(line: 1574, column: 44, scope: !1065)
!1089 = !DILocation(line: 1574, column: 13, scope: !1061)
!1090 = !DILocation(line: 1575, column: 36, scope: !1064)
!1091 = !DILocation(line: 1575, column: 20, scope: !1064)
!1092 = !DILocation(line: 1577, column: 17, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1577, column: 17)
!1094 = !DILocation(line: 1577, column: 17, scope: !1064)
!1095 = !DILocation(line: 1580, column: 34, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 1577, column: 32)
!1097 = !DILocation(line: 1578, column: 17, scope: !1096)
!1098 = !DILocation(line: 1581, column: 13, scope: !1096)
!1099 = !DILocation(line: 1583, column: 45, scope: !1064)
!1100 = !{!91, !96, i64 2208}
!1101 = !DILocation(line: 1584, column: 13, scope: !1064)
!1102 = !DILocation(line: 1585, column: 13, scope: !1064)
!1103 = !DILocation(line: 1586, column: 9, scope: !1064)
!1104 = !DILocation(line: 1587, column: 13, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1586, column: 16)
!1106 = !DILocation(line: 1589, column: 5, scope: !1062)
!1107 = !DILocation(line: 1616, column: 5, scope: !1056)
!1108 = !DILocation(line: 1591, column: 33, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 1589, column: 12)
!1110 = !DILocation(line: 1591, column: 41, scope: !1109)
!1111 = !DILocation(line: 1591, column: 31, scope: !1109)
!1112 = !{!91, !97, i64 1120}
!1113 = !DILocation(line: 1592, column: 42, scope: !1109)
!1114 = !DILocation(line: 1592, column: 33, scope: !1109)
!1115 = !DILocation(line: 1592, column: 64, scope: !1109)
!1116 = !DILocation(line: 1592, column: 83, scope: !1109)
!1117 = !DILocation(line: 1592, column: 76, scope: !1109)
!1118 = !DILocation(line: 1592, column: 74, scope: !1109)
!1119 = !DILocation(line: 1592, column: 98, scope: !1109)
!1120 = !DILocation(line: 1592, column: 31, scope: !1109)
!1121 = !{!91, !98, i64 1128}
!1122 = !DILocation(line: 1593, column: 9, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 1593, column: 9)
!1124 = !DILocation(line: 1593, column: 9, scope: !1109)
!1125 = !DILocation(line: 1594, column: 22, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 1594, column: 13)
!1127 = !DILocation(line: 1594, column: 13, scope: !1109)
!1128 = !DILocation(line: 1595, column: 13, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 1594, column: 29)
!1130 = !DILocation(line: 1598, column: 26, scope: !1129)
!1131 = !DILocation(line: 1598, column: 17, scope: !1129)
!1132 = !DILocation(line: 1596, column: 13, scope: !1129)
!1133 = !DILocation(line: 1533, column: 30, scope: !969, inlinedAt: !1134)
!1134 = distinct !DILocation(line: 1599, column: 13, scope: !1129)
!1135 = !DILocation(line: 1533, column: 40, scope: !969, inlinedAt: !1134)
!1136 = !DILocation(line: 1533, column: 5, scope: !969, inlinedAt: !1134)
!1137 = !DILocation(line: 1534, column: 30, scope: !969, inlinedAt: !1134)
!1138 = !DILocation(line: 1534, column: 40, scope: !969, inlinedAt: !1134)
!1139 = !DILocation(line: 1534, column: 5, scope: !969, inlinedAt: !1134)
!1140 = !DILocation(line: 1535, column: 18, scope: !969, inlinedAt: !1134)
!1141 = !DILocation(line: 1535, column: 5, scope: !969, inlinedAt: !1134)
!1142 = !DILocation(line: 1536, column: 18, scope: !969, inlinedAt: !1134)
!1143 = !DILocation(line: 1536, column: 5, scope: !969, inlinedAt: !1134)
!1144 = !DILocation(line: 1537, column: 18, scope: !969, inlinedAt: !1134)
!1145 = !DILocation(line: 1537, column: 5, scope: !969, inlinedAt: !1134)
!1146 = !DILocation(line: 1538, column: 18, scope: !969, inlinedAt: !1134)
!1147 = !DILocation(line: 1538, column: 5, scope: !969, inlinedAt: !1134)
!1148 = !DILocation(line: 1539, column: 18, scope: !969, inlinedAt: !1134)
!1149 = !DILocation(line: 1539, column: 5, scope: !969, inlinedAt: !1134)
!1150 = !DILocation(line: 1540, column: 18, scope: !969, inlinedAt: !1134)
!1151 = !DILocation(line: 1540, column: 5, scope: !969, inlinedAt: !1134)
!1152 = !DILocation(line: 1541, column: 1, scope: !969, inlinedAt: !1134)
!1153 = !DILocation(line: 1600, column: 13, scope: !1129)
!1154 = !DILocation(line: 1602, column: 9, scope: !1109)
!1155 = !DILocation(line: 1604, column: 38, scope: !1109)
!1156 = !DILocation(line: 1605, column: 41, scope: !1109)
!1157 = !DILocation(line: 1605, column: 39, scope: !1109)
!1158 = !DILocation(line: 1606, column: 30, scope: !1109)
!1159 = !DILocation(line: 1607, column: 9, scope: !1109)
!1160 = !DILocation(line: 1612, column: 32, scope: !1109)
!1161 = !DILocation(line: 1613, column: 9, scope: !1109)
!1162 = !DILocation(line: 1614, column: 9, scope: !1109)
!1163 = !DILocation(line: 0, scope: !1109)
!1164 = !DILocation(line: 0, scope: !1067)
!1165 = !DILocation(line: 1617, column: 1, scope: !1056)
!1166 = !DILocation(line: 297, column: 22, scope: !595)
!1167 = !DILocation(line: 297, column: 38, scope: !595)
!1168 = !DILocation(line: 297, column: 50, scope: !595)
!1169 = !DILocation(line: 298, column: 13, scope: !595)
!1170 = !DILocation(line: 298, column: 27, scope: !595)
!1171 = !DILocation(line: 301, column: 20, scope: !616)
!1172 = !DILocation(line: 303, column: 22, scope: !618)
!1173 = !DILocation(line: 303, column: 13, scope: !616)
!1174 = !DILocation(line: 304, column: 17, scope: !621)
!1175 = !DILocation(line: 304, column: 23, scope: !621)
!1176 = !DILocation(line: 304, column: 17, scope: !622)
!1177 = !DILocation(line: 307, column: 20, scope: !622)
!1178 = !DILocation(line: 307, column: 13, scope: !622)
!1179 = !DILocation(line: 310, column: 13, scope: !616)
!1180 = !DILocation(line: 311, column: 13, scope: !616)
!1181 = !DILocation(line: 312, column: 20, scope: !616)
!1182 = !DILocation(line: 0, scope: !595)
!1183 = !DILocation(line: 0, scope: !622)
!1184 = !DILocation(line: 316, column: 1, scope: !595)
!1185 = distinct !DISubprogram(name: "catAppendOnlyGenericCommand", scope: !3, file: !3, line: 518, type: !1186, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1198)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!476, !476, !6, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !75, line: 622, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !75, line: 614, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1197}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1191, file: !75, line: 615, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1191, file: !75, line: 616, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1191, file: !75, line: 617, baseType: !55, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1191, file: !75, line: 620, baseType: !6, size: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1191, file: !75, line: 621, baseType: !10, size: 64, offset: 64)
!1198 = !{!1199, !1200, !1201, !1202, !1206, !1207, !1208}
!1199 = !DILocalVariable(name: "dst", arg: 1, scope: !1185, file: !3, line: 518, type: !476)
!1200 = !DILocalVariable(name: "argc", arg: 2, scope: !1185, file: !3, line: 518, type: !6)
!1201 = !DILocalVariable(name: "argv", arg: 3, scope: !1185, file: !3, line: 518, type: !1188)
!1202 = !DILocalVariable(name: "buf", scope: !1185, file: !3, line: 519, type: !1203)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !1204)
!1204 = !{!1205}
!1205 = !DISubrange(count: 32)
!1206 = !DILocalVariable(name: "len", scope: !1185, file: !3, line: 520, type: !6)
!1207 = !DILocalVariable(name: "j", scope: !1185, file: !3, line: 520, type: !6)
!1208 = !DILocalVariable(name: "o", scope: !1185, file: !3, line: 521, type: !1189)
!1209 = !DILocation(line: 518, column: 37, scope: !1185)
!1210 = !DILocation(line: 518, column: 46, scope: !1185)
!1211 = !DILocation(line: 518, column: 59, scope: !1185)
!1212 = !DILocation(line: 519, column: 5, scope: !1185)
!1213 = !DILocation(line: 519, column: 10, scope: !1185)
!1214 = !DILocation(line: 523, column: 12, scope: !1185)
!1215 = !DILocation(line: 524, column: 26, scope: !1185)
!1216 = !DILocation(line: 524, column: 43, scope: !1185)
!1217 = !DILocation(line: 524, column: 13, scope: !1185)
!1218 = !DILocation(line: 524, column: 12, scope: !1185)
!1219 = !DILocation(line: 520, column: 9, scope: !1185)
!1220 = !DILocation(line: 525, column: 12, scope: !1185)
!1221 = !DILocation(line: 525, column: 5, scope: !1185)
!1222 = !DILocation(line: 525, column: 16, scope: !1185)
!1223 = !DILocation(line: 526, column: 12, scope: !1185)
!1224 = !DILocation(line: 526, column: 5, scope: !1185)
!1225 = !DILocation(line: 526, column: 16, scope: !1185)
!1226 = !DILocation(line: 527, column: 29, scope: !1185)
!1227 = !DILocation(line: 527, column: 11, scope: !1185)
!1228 = !DILocation(line: 520, column: 14, scope: !1185)
!1229 = !DILocation(line: 529, column: 10, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 529, column: 5)
!1231 = !DILocation(line: 529, column: 19, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 529, column: 5)
!1233 = !DILocation(line: 529, column: 5, scope: !1230)
!1234 = !DILocation(line: 530, column: 30, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 529, column: 32)
!1236 = !{!95, !95, i64 0}
!1237 = !DILocation(line: 530, column: 13, scope: !1235)
!1238 = !DILocation(line: 521, column: 11, scope: !1185)
!1239 = !DILocation(line: 531, column: 16, scope: !1235)
!1240 = !DILocation(line: 532, column: 57, scope: !1235)
!1241 = !{!1242, !95, i64 8}
!1242 = !{!"redisObject", !92, i64 0, !92, i64 0, !92, i64 1, !92, i64 4, !95, i64 8}
!1243 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !1244)
!1244 = distinct !DILocation(line: 532, column: 47, scope: !1235)
!1245 = !DILocation(line: 88, column: 27, scope: !470, inlinedAt: !1244)
!1246 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !1244)
!1247 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !1244)
!1248 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !1244)
!1249 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !1244)
!1250 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !1244)
!1251 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !1244)
!1252 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !1244)
!1253 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !1244)
!1254 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !1244)
!1255 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !1244)
!1256 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !1244)
!1257 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !1244)
!1258 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !1244)
!1259 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !1244)
!1260 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !1244)
!1261 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !1244)
!1262 = !DILocation(line: 0, scope: !486, inlinedAt: !1244)
!1263 = !DILocation(line: 0, scope: !1235)
!1264 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !1244)
!1265 = !DILocation(line: 532, column: 17, scope: !1235)
!1266 = !DILocation(line: 532, column: 16, scope: !1235)
!1267 = !DILocation(line: 533, column: 16, scope: !1235)
!1268 = !DILocation(line: 533, column: 9, scope: !1235)
!1269 = !DILocation(line: 533, column: 20, scope: !1235)
!1270 = !DILocation(line: 534, column: 16, scope: !1235)
!1271 = !DILocation(line: 534, column: 9, scope: !1235)
!1272 = !DILocation(line: 534, column: 20, scope: !1235)
!1273 = !DILocation(line: 535, column: 33, scope: !1235)
!1274 = !DILocation(line: 535, column: 15, scope: !1235)
!1275 = !DILocation(line: 536, column: 32, scope: !1235)
!1276 = !DILocation(line: 87, column: 39, scope: !470, inlinedAt: !1277)
!1277 = distinct !DILocation(line: 536, column: 36, scope: !1235)
!1278 = !DILocation(line: 88, column: 27, scope: !470, inlinedAt: !1277)
!1279 = !DILocation(line: 88, column: 19, scope: !470, inlinedAt: !1277)
!1280 = !DILocation(line: 89, column: 5, scope: !470, inlinedAt: !1277)
!1281 = !DILocation(line: 91, column: 20, scope: !486, inlinedAt: !1277)
!1282 = !DILocation(line: 91, column: 13, scope: !486, inlinedAt: !1277)
!1283 = !DILocation(line: 93, column: 20, scope: !486, inlinedAt: !1277)
!1284 = !DILocation(line: 93, column: 34, scope: !486, inlinedAt: !1277)
!1285 = !DILocation(line: 93, column: 13, scope: !486, inlinedAt: !1277)
!1286 = !DILocation(line: 95, column: 20, scope: !486, inlinedAt: !1277)
!1287 = !DILocation(line: 95, column: 35, scope: !486, inlinedAt: !1277)
!1288 = !DILocation(line: 95, column: 13, scope: !486, inlinedAt: !1277)
!1289 = !DILocation(line: 97, column: 20, scope: !486, inlinedAt: !1277)
!1290 = !DILocation(line: 97, column: 35, scope: !486, inlinedAt: !1277)
!1291 = !DILocation(line: 97, column: 13, scope: !486, inlinedAt: !1277)
!1292 = !DILocation(line: 99, column: 20, scope: !486, inlinedAt: !1277)
!1293 = !DILocation(line: 99, column: 35, scope: !486, inlinedAt: !1277)
!1294 = !DILocation(line: 99, column: 13, scope: !486, inlinedAt: !1277)
!1295 = !DILocation(line: 0, scope: !486, inlinedAt: !1277)
!1296 = !DILocation(line: 102, column: 1, scope: !470, inlinedAt: !1277)
!1297 = !DILocation(line: 536, column: 15, scope: !1235)
!1298 = !DILocation(line: 537, column: 15, scope: !1235)
!1299 = !DILocation(line: 538, column: 9, scope: !1235)
!1300 = !DILocation(line: 529, column: 28, scope: !1232)
!1301 = !DILocation(line: 529, column: 5, scope: !1232)
!1302 = distinct !{!1302, !1233, !1303}
!1303 = !DILocation(line: 539, column: 5, scope: !1230)
!1304 = !DILocation(line: 541, column: 1, scope: !1185)
!1305 = !DILocation(line: 540, column: 5, scope: !1185)
!1306 = distinct !DISubprogram(name: "catAppendOnlyExpireAtCommand", scope: !3, file: !3, line: 550, type: !1307, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1519)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!476, !476, !1309, !1189, !1189}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !75, line: 1307, size: 640, elements: !1311)
!1311 = !{!1312, !1313, !1505, !1506, !1507, !1508, !1514, !1515, !1516, !1517, !1518}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1310, file: !75, line: 1308, baseType: !20, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !1310, file: !75, line: 1309, baseType: !1314, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !75, line: 1305, baseType: !1316)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !75, line: 780, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !75, line: 723, size: 135360, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1455, !1456, !1460, !1461, !1477, !1478, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1320, file: !75, line: 724, baseType: !63, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1320, file: !75, line: 725, baseType: !6, size: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !1320, file: !75, line: 726, baseType: !1325, size: 64, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !75, line: 656, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !75, line: 647, size: 512, elements: !1328)
!1328 = !{!1329, !1391, !1392, !1393, !1394, !1395, !1396, !1397}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !1327, file: !75, line: 648, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !1332, line: 82, baseType: !1333)
!1332 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !1332, line: 76, size: 768, elements: !1334)
!1334 = !{!1335, !1360, !1361, !1389, !1390}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1333, file: !1332, line: 77, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !1332, line: 65, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !1332, line: 58, size: 384, elements: !1339)
!1339 = !{!1340, !1346, !1350, !1351, !1355, !1359}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !1338, file: !1332, line: 59, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!63, !1344}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !1338, file: !1332, line: 60, baseType: !1347, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!10, !10, !1344}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !1338, file: !1332, line: 61, baseType: !1347, size: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !1338, file: !1332, line: 62, baseType: !1352, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!6, !10, !1344, !1344}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !1338, file: !1332, line: 63, baseType: !1356, size: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{null, !10, !10}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !1338, file: !1332, line: 64, baseType: !1356, size: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !1333, file: !1332, line: 78, baseType: !10, size: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1333, file: !1332, line: 79, baseType: !1362, size: 512, offset: 128)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1363, size: 512, elements: !1387)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !1332, line: 74, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !1332, line: 69, size: 256, elements: !1365)
!1365 = !{!1366, !1384, !1385, !1386}
