; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/api_lib.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/api_lib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.ip_addr = type { %union.anon.0, i8 }
%union.anon.0 = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.netconn = type { i32, i32, %union.anon, i8, %struct.sys_sem_t, %struct.sys_mbox_t, %struct.sys_mbox_t, i32, i8, %struct.api_msg*, void (%struct.netconn*, i32, i16)* }
%union.anon = type { %struct.ip_pcb* }
%struct.ip_pcb = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8 }
%struct.sys_sem_t = type { %struct.uk_semaphore, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }

!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !49, line: 92, baseType: !14, size: 32, elements: !50)
!49 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netconn_igmp", file: !13, line: 191, baseType: !14, size: 32, elements: !55)
!55 = !{!56, !57}
!56 = !DIEnumerator(name: "NETCONN_JOIN", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "NETCONN_LEAVE", value: 1, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netconn_evt", file: !13, line: 181, baseType: !14, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIEnumerator(name: "NETCONN_EVT_RCVPLUS", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "NETCONN_EVT_RCVMINUS", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "NETCONN_EVT_SENDPLUS", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "NETCONN_EVT_SENDMINUS", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "NETCONN_EVT_ERROR", value: 4, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 53, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!69 = !DIEnumerator(name: "ERR_OK", value: 0)
!70 = !DIEnumerator(name: "ERR_MEM", value: -1)
!71 = !DIEnumerator(name: "ERR_BUF", value: -2)
!72 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!73 = !DIEnumerator(name: "ERR_RTE", value: -4)
!74 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!75 = !DIEnumerator(name: "ERR_VAL", value: -6)
!76 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!77 = !DIEnumerator(name: "ERR_USE", value: -8)
!78 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!79 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!80 = !DIEnumerator(name: "ERR_CONN", value: -11)
!81 = !DIEnumerator(name: "ERR_IF", value: -12)
!82 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!83 = !DIEnumerator(name: "ERR_RST", value: -14)
!84 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!85 = !DIEnumerator(name: "ERR_ARG", value: -16)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !87, line: 68, baseType: !14, size: 32, elements: !88)
!87 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !94, line: 54, baseType: !14, size: 32, elements: !95)
!94 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!95 = !{!96, !97, !98}
!96 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!98 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !100, line: 52, baseType: !14, size: 32, elements: !101)
!100 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/memp.h", directory: "/root/.unikraft/apps/redis/build")
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!102 = !DIEnumerator(name: "MEMP_UDP_PCB", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "MEMP_TCP_PCB", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!106 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!108 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!109 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!110 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!111 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!112 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!113 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!114 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!115 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!116 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!117 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!118 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!119 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!120 = !{!121, !122, !501, !816, !854, !158, !240}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netconn", file: !13, line: 218, size: 1024, elements: !124)
!124 = !{!125, !126, !127, !353, !354, !792, !802, !803, !804, !805, !878}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !13, line: 220, baseType: !12, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !123, file: !13, line: 222, baseType: !27, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pcb", scope: !123, file: !13, line: 229, baseType: !128, size: 64, offset: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !13, line: 224, size: 64, elements: !129)
!129 = !{!130, !174, !324, !350}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !128, file: !13, line: 225, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_pcb", file: !133, line: 91, size: 416, elements: !134)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !{!135, !169, !170, !171, !172, !173}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !132, file: !133, line: 93, baseType: !136, size: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !94, line: 76, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !94, line: 69, size: 192, elements: !138)
!138 = !{!139, !168}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !137, file: !94, line: 73, baseType: !140, size: 160)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !94, line: 70, size: 160, elements: !141)
!141 = !{!142, !162}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !140, file: !94, line: 71, baseType: !143, size: 160)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !144, line: 67, baseType: !145)
!144 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !144, line: 59, size: 160, elements: !146)
!146 = !{!147, !157}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !145, file: !144, line: 60, baseType: !148, size: 128)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !155)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !150, line: 129, baseType: !151)
!150 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !152, line: 48, baseType: !153)
!152 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !154, line: 79, baseType: !14)
!154 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!155 = !{!156}
!156 = !DISubrange(count: 4)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !145, file: !144, line: 62, baseType: !158, size: 8, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !150, line: 125, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !152, line: 24, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !154, line: 43, baseType: !161)
!161 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !140, file: !94, line: 72, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !164, line: 57, baseType: !165)
!164 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !164, line: 51, size: 32, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !164, line: 52, baseType: !149, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !94, line: 75, baseType: !158, size: 8, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !132, file: !133, line: 93, baseType: !136, size: 192, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !132, file: !133, line: 93, baseType: !158, size: 8, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !132, file: !133, line: 93, baseType: !158, size: 8, offset: 392)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !132, file: !133, line: 93, baseType: !158, size: 8, offset: 400)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !132, file: !133, line: 93, baseType: !158, size: 8, offset: 408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !128, file: !13, line: 226, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb", file: !177, line: 242, size: 2240, elements: !178)
!177 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !194, !195, !197, !198, !199, !200, !201, !202, !204, !205, !206, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !267, !268, !269, !270, !295, !300, !305, !307, !312, !317, !318, !319, !320, !321, !322, !323}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !176, file: !177, line: 244, baseType: !136, size: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !176, file: !177, line: 244, baseType: !136, size: 192, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !176, file: !177, line: 244, baseType: !158, size: 8, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !176, file: !177, line: 244, baseType: !158, size: 8, offset: 392)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !176, file: !177, line: 244, baseType: !158, size: 8, offset: 400)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !176, file: !177, line: 244, baseType: !158, size: 8, offset: 408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !177, line: 246, baseType: !175, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !176, file: !177, line: 246, baseType: !121, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !177, line: 246, baseType: !34, size: 32, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !177, line: 246, baseType: !158, size: 8, offset: 608)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !176, file: !177, line: 246, baseType: !190, size: 16, offset: 624)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !150, line: 127, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !152, line: 36, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !154, line: 57, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !176, file: !177, line: 249, baseType: !190, size: 16, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !177, line: 251, baseType: !196, size: 16, offset: 656)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpflags_t", file: !177, line: 206, baseType: !190)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "polltmr", scope: !176, file: !177, line: 278, baseType: !158, size: 8, offset: 672)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pollinterval", scope: !176, file: !177, line: 278, baseType: !158, size: 8, offset: 680)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "last_timer", scope: !176, file: !177, line: 279, baseType: !158, size: 8, offset: 688)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !176, file: !177, line: 280, baseType: !149, size: 32, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !176, file: !177, line: 283, baseType: !149, size: 32, offset: 736)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wnd", scope: !176, file: !177, line: 284, baseType: !203, size: 32, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpwnd_size_t", file: !35, line: 51, baseType: !149)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_wnd", scope: !176, file: !177, line: 285, baseType: !203, size: 32, offset: 800)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_right_edge", scope: !176, file: !177, line: 286, baseType: !149, size: 32, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rtime", scope: !176, file: !177, line: 295, baseType: !207, size: 16, offset: 864)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !150, line: 128, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !152, line: 32, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !154, line: 55, baseType: !210)
!210 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !176, file: !177, line: 297, baseType: !190, size: 16, offset: 880)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "rttest", scope: !176, file: !177, line: 300, baseType: !149, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rtseq", scope: !176, file: !177, line: 301, baseType: !149, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !176, file: !177, line: 302, baseType: !207, size: 16, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !176, file: !177, line: 302, baseType: !207, size: 16, offset: 976)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "rto", scope: !176, file: !177, line: 304, baseType: !207, size: 16, offset: 992)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nrtx", scope: !176, file: !177, line: 305, baseType: !158, size: 8, offset: 1008)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dupacks", scope: !176, file: !177, line: 308, baseType: !158, size: 8, offset: 1016)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lastack", scope: !176, file: !177, line: 309, baseType: !149, size: 32, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd", scope: !176, file: !177, line: 312, baseType: !203, size: 32, offset: 1056)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !176, file: !177, line: 313, baseType: !203, size: 32, offset: 1088)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rto_end", scope: !176, file: !177, line: 316, baseType: !149, size: 32, offset: 1120)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !176, file: !177, line: 319, baseType: !149, size: 32, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl1", scope: !176, file: !177, line: 320, baseType: !149, size: 32, offset: 1184)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl2", scope: !176, file: !177, line: 320, baseType: !149, size: 32, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "snd_lbb", scope: !176, file: !177, line: 322, baseType: !149, size: 32, offset: 1248)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd", scope: !176, file: !177, line: 323, baseType: !203, size: 32, offset: 1280)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd_max", scope: !176, file: !177, line: 324, baseType: !203, size: 32, offset: 1312)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "snd_buf", scope: !176, file: !177, line: 326, baseType: !203, size: 32, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "snd_queuelen", scope: !176, file: !177, line: 328, baseType: !190, size: 16, offset: 1376)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "unsent_oversize", scope: !176, file: !177, line: 332, baseType: !190, size: 16, offset: 1392)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !176, file: !177, line: 335, baseType: !203, size: 32, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "unsent", scope: !176, file: !177, line: 338, baseType: !234, size: 64, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_seg", file: !236, line: 253, size: 256, elements: !237)
!236 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/tcp_priv.h", directory: "/root/.unikraft/apps/redis/build")
!237 = !{!238, !239, !252, !253, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !236, line: 254, baseType: !234, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !235, file: !236, line: 255, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !242, line: 186, size: 192, elements: !243)
!242 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !242, line: 188, baseType: !240, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !241, file: !242, line: 191, baseType: !121, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !241, file: !242, line: 200, baseType: !190, size: 16, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !241, file: !242, line: 203, baseType: !190, size: 16, offset: 144)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !241, file: !242, line: 208, baseType: !158, size: 8, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !242, line: 211, baseType: !158, size: 8, offset: 168)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !241, file: !242, line: 218, baseType: !158, size: 8, offset: 176)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !241, file: !242, line: 221, baseType: !158, size: 8, offset: 184)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !235, file: !236, line: 256, baseType: !190, size: 16, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !235, file: !236, line: 266, baseType: !158, size: 8, offset: 144)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tcphdr", scope: !235, file: !236, line: 273, baseType: !255, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_hdr", file: !257, line: 56, size: 160, elements: !258)
!257 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !256, file: !257, line: 57, baseType: !190, size: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !256, file: !257, line: 58, baseType: !190, size: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !256, file: !257, line: 59, baseType: !149, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ackno", scope: !256, file: !257, line: 60, baseType: !149, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_hdrlen_rsvd_flags", scope: !256, file: !257, line: 61, baseType: !190, size: 16, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wnd", scope: !256, file: !257, line: 62, baseType: !190, size: 16, offset: 112)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !256, file: !257, line: 63, baseType: !190, size: 16, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "urgp", scope: !256, file: !257, line: 64, baseType: !190, size: 16, offset: 144)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "unacked", scope: !176, file: !177, line: 339, baseType: !234, size: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ooseq", scope: !176, file: !177, line: 341, baseType: !234, size: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "refused_data", scope: !176, file: !177, line: 344, baseType: !240, size: 64, offset: 1664)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !176, file: !177, line: 347, baseType: !271, size: 64, offset: 1728)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb_listen", file: !177, line: 223, size: 704, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !272, file: !177, line: 225, baseType: !136, size: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !272, file: !177, line: 225, baseType: !136, size: 192, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !272, file: !177, line: 225, baseType: !158, size: 8, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !272, file: !177, line: 225, baseType: !158, size: 8, offset: 392)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !272, file: !177, line: 225, baseType: !158, size: 8, offset: 400)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !272, file: !177, line: 225, baseType: !158, size: 8, offset: 408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !177, line: 227, baseType: !271, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !272, file: !177, line: 227, baseType: !121, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !272, file: !177, line: 227, baseType: !34, size: 32, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !272, file: !177, line: 227, baseType: !158, size: 8, offset: 608)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !272, file: !177, line: 227, baseType: !190, size: 16, offset: 624)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !272, file: !177, line: 231, baseType: !286, size: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_accept_fn", file: !177, line: 70, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !121, !175, !290}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !66, line: 96, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !150, line: 126, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !152, line: 20, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !154, line: 41, baseType: !294)
!294 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !176, file: !177, line: 352, baseType: !296, size: 64, offset: 1792)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_sent_fn", file: !177, line: 96, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!290, !121, !175, !190}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !176, file: !177, line: 354, baseType: !301, size: 64, offset: 1856)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_recv_fn", file: !177, line: 82, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!290, !121, !175, !240, !290}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !176, file: !177, line: 356, baseType: !306, size: 64, offset: 1920)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connected_fn", file: !177, line: 134, baseType: !287)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !176, file: !177, line: 358, baseType: !308, size: 64, offset: 1984)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_poll_fn", file: !177, line: 108, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!290, !121, !175}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "errf", scope: !176, file: !177, line: 360, baseType: !313, size: 64, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_err_fn", file: !177, line: 120, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !121, !290}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "keep_idle", scope: !176, file: !177, line: 369, baseType: !149, size: 32, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "persist_cnt", scope: !176, file: !177, line: 376, baseType: !158, size: 8, offset: 2144)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "persist_backoff", scope: !176, file: !177, line: 378, baseType: !158, size: 8, offset: 2152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "persist_probe", scope: !176, file: !177, line: 380, baseType: !158, size: 8, offset: 2160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "keep_cnt_sent", scope: !176, file: !177, line: 383, baseType: !158, size: 8, offset: 2168)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "snd_scale", scope: !176, file: !177, line: 386, baseType: !158, size: 8, offset: 2176)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_scale", scope: !176, file: !177, line: 387, baseType: !158, size: 8, offset: 2184)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !128, file: !13, line: 227, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_pcb", file: !327, line: 81, size: 768, elements: !328)
!327 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/udp.h", directory: "/root/.unikraft/apps/redis/build")
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !349}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !326, file: !327, line: 83, baseType: !136, size: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !326, file: !327, line: 83, baseType: !136, size: 192, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !326, file: !327, line: 83, baseType: !158, size: 8, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !326, file: !327, line: 83, baseType: !158, size: 8, offset: 392)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !326, file: !327, line: 83, baseType: !158, size: 8, offset: 400)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !326, file: !327, line: 83, baseType: !158, size: 8, offset: 408)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !327, line: 87, baseType: !325, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !327, line: 89, baseType: !158, size: 8, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !326, file: !327, line: 91, baseType: !190, size: 16, offset: 528)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !326, file: !327, line: 91, baseType: !190, size: 16, offset: 544)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ip4", scope: !326, file: !327, line: 96, baseType: !163, size: 32, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ifindex", scope: !326, file: !327, line: 99, baseType: !158, size: 8, offset: 608)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !326, file: !327, line: 101, baseType: !158, size: 8, offset: 616)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !326, file: !327, line: 110, baseType: !343, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "udp_recv_fn", file: !327, line: 77, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !121, !325, !240, !347, !190}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "recv_arg", scope: !326, file: !327, line: 112, baseType: !121, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !128, file: !13, line: 228, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "raw_pcb", file: !13, line: 210, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pending_err", scope: !123, file: !13, line: 231, baseType: !290, size: 8, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "op_completed", scope: !123, file: !13, line: 234, baseType: !355, size: 256, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sem_t", file: !356, line: 72, baseType: !357)
!356 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/sys_arch.h", directory: "/root/.unikraft/apps/redis/build")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 69, size: 256, elements: !358)
!358 = !{!359, !791}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !357, file: !356, line: 70, baseType: !360, size: 192)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !361, line: 51, size: 192, elements: !362)
!361 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!362 = !{!363, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !360, file: !361, line: 52, baseType: !364, size: 64)
!364 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !360, file: !361, line: 53, baseType: !366, size: 128, offset: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !367, line: 42, size: 128, elements: !368)
!367 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!368 = !{!369, !789}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !366, file: !367, line: 42, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !367, line: 35, size: 192, elements: !372)
!372 = !{!373, !374, !785}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !371, file: !367, line: 36, baseType: !67, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !371, file: !367, line: 37, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !377, line: 59, size: 1024, elements: !378)
!377 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!378 = !{!379, !380, !381, !382, !383, !389, !390, !395, !397, !398, !544, !545, !546, !755}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !377, line: 60, baseType: !6, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !376, file: !377, line: 61, baseType: !121, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !376, file: !377, line: 62, baseType: !121, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !376, file: !377, line: 63, baseType: !121, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !376, file: !377, line: 64, baseType: !384, size: 128, offset: 256)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !376, file: !377, line: 64, size: 128, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !384, file: !377, line: 64, baseType: !375, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !384, file: !377, line: 64, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !376, file: !377, line: 65, baseType: !151, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !376, file: !377, line: 66, baseType: !391, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !392, line: 49, baseType: !393)
!392 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !394, line: 128, baseType: !364)
!394 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!395 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !376, file: !377, line: 67, baseType: !396, size: 8, offset: 512)
!396 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !376, file: !377, line: 68, baseType: !366, size: 128, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !376, file: !377, line: 69, baseType: !399, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !401, line: 90, size: 2176, elements: !402)
!401 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!402 = !{!403, !408, !426, !431, !433, !435, !440, !448, !453, !459, !460, !461, !466, !541, !542, !543}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !400, file: !401, line: 91, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !401, line: 68, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !399}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !400, file: !401, line: 93, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !401, line: 71, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!67, !399, !375, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !416, line: 62, baseType: !417)
!416 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !416, line: 55, size: 128, elements: !418)
!418 = !{!419, !420, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !417, file: !416, line: 57, baseType: !396, size: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !417, file: !416, line: 59, baseType: !421, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !416, line: 53, baseType: !67)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !417, file: !416, line: 61, baseType: !423, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !392, line: 48, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !394, line: 129, baseType: !425)
!425 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !400, file: !401, line: 94, baseType: !427, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !401, line: 74, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !399, !375}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !400, file: !401, line: 95, baseType: !432, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !401, line: 76, baseType: !428)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !400, file: !401, line: 96, baseType: !434, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !401, line: 78, baseType: !428)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !400, file: !401, line: 98, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !401, line: 81, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!67, !399, !375, !421}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !400, file: !401, line: 99, baseType: !441, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !401, line: 83, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!67, !399, !445, !447}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !400, file: !401, line: 100, baseType: !449, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !401, line: 85, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!67, !399, !375, !67}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !400, file: !401, line: 101, baseType: !454, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !401, line: 87, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!67, !399, !445, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !400, file: !401, line: 104, baseType: !396, size: 8, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !400, file: !401, line: 105, baseType: !376, size: 1024, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !400, file: !401, line: 106, baseType: !462, size: 128, offset: 1664)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !377, line: 93, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !462, file: !377, line: 93, baseType: !375, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !462, file: !377, line: 93, baseType: !388, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !400, file: !401, line: 107, baseType: !467, size: 192, offset: 1792)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !468, line: 59, size: 192, elements: !469)
!468 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!469 = !{!470, !532, !536}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !467, file: !468, line: 61, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !468, line: 51, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!121, !475, !425, !425}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !477, line: 77, size: 832, elements: !478)
!477 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!478 = !{!479, !486, !491, !496, !502, !504, !509, !510, !511, !516, !521, !526, !527, !528}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !476, file: !477, line: 79, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !477, line: 54, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!121, !475, !484}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !485, line: 58, baseType: !425)
!485 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!486 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !476, file: !477, line: 80, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !477, line: 56, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!121, !475, !484, !484}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !476, file: !477, line: 81, baseType: !492, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !477, line: 62, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!121, !475, !121, !484}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !476, file: !477, line: 82, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !477, line: 58, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!67, !475, !501, !484, !484}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !476, file: !477, line: 83, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !477, line: 60, baseType: !488)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !476, file: !477, line: 84, baseType: !505, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !477, line: 64, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !475, !121}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !476, file: !477, line: 87, baseType: !505, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !476, file: !477, line: 88, baseType: !480, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !476, file: !477, line: 92, baseType: !512, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !477, line: 66, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!121, !475, !425}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !476, file: !477, line: 93, baseType: !517, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !477, line: 68, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !475, !121, !425}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !476, file: !477, line: 99, baseType: !522, size: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !477, line: 70, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!67, !475, !121, !484}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !476, file: !477, line: 100, baseType: !484, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !477, line: 103, baseType: !475, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !476, file: !477, line: 104, baseType: !529, offset: 832)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: -1)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !467, file: !468, line: 63, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !121}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !467, file: !468, line: 65, baseType: !537, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !468, line: 56, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !121, !121}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !400, file: !401, line: 108, baseType: !475, size: 64, offset: 1984)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !401, line: 109, baseType: !399, size: 64, offset: 2048)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !400, file: !401, line: 110, baseType: !121, size: 64, offset: 2112)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !376, file: !377, line: 70, baseType: !121, size: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !376, file: !377, line: 72, baseType: !67, size: 32, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !376, file: !377, line: 82, baseType: !547, size: 64, offset: 896)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !549, line: 569, size: 14912, elements: !550)
!549 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!550 = !{!551, !552, !623, !624, !625, !626, !630, !631, !635, !636, !640, !652, !653, !654, !656, !657, !658, !719, !740, !741, !746, !753}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !548, file: !549, line: 571, baseType: !67, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !548, file: !549, line: 576, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !549, line: 287, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !549, line: 181, size: 1408, elements: !556)
!556 = !{!557, !559, !560, !561, !562, !563, !568, !569, !570, !577, !581, !586, !590, !591, !592, !593, !597, !601, !602, !603, !605, !606, !610, !622}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !555, file: !549, line: 182, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !555, file: !549, line: 183, baseType: !67, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !555, file: !549, line: 184, baseType: !67, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !555, file: !549, line: 185, baseType: !210, size: 16, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !555, file: !549, line: 186, baseType: !210, size: 16, offset: 144)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !555, file: !549, line: 187, baseType: !564, size: 128, offset: 192)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !549, line: 117, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !564, file: !549, line: 118, baseType: !558, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !564, file: !549, line: 119, baseType: !67, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !555, file: !549, line: 188, baseType: !67, size: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !555, file: !549, line: 195, baseType: !121, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !555, file: !549, line: 197, baseType: !571, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!574, !547, !121, !576, !67}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !575, line: 145, baseType: !364)
!575 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !555, file: !549, line: 199, baseType: !578, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!574, !547, !121, !6, !67}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !555, file: !549, line: 202, baseType: !582, size: 64, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !547, !121, !585, !67}
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !575, line: 114, baseType: !364)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !555, file: !549, line: 203, baseType: !587, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!67, !547, !121}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !555, file: !549, line: 206, baseType: !564, size: 128, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !555, file: !549, line: 207, baseType: !558, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !555, file: !549, line: 208, baseType: !67, size: 32, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !555, file: !549, line: 211, baseType: !594, size: 24, offset: 928)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 24, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 3)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !555, file: !549, line: 212, baseType: !598, size: 8, offset: 952)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 8, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 1)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !555, file: !549, line: 215, baseType: !564, size: 128, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !555, file: !549, line: 218, baseType: !67, size: 32, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !555, file: !549, line: 219, baseType: !604, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !575, line: 44, baseType: !364)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !555, file: !549, line: 222, baseType: !547, size: 64, offset: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !555, file: !549, line: 226, baseType: !607, size: 32, offset: 1280)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !575, line: 175, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !609, line: 12, baseType: !67)
!609 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !555, file: !549, line: 228, baseType: !611, size: 64, offset: 1312)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !575, line: 171, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 163, size: 64, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !612, file: !575, line: 165, baseType: !67, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !612, file: !575, line: 170, baseType: !616, size: 32, offset: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !575, line: 166, size: 32, elements: !617)
!617 = !{!618, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !616, file: !575, line: 168, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !485, line: 124, baseType: !14)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !616, file: !575, line: 169, baseType: !621, size: 32)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 32, elements: !155)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !555, file: !549, line: 229, baseType: !67, size: 32, offset: 1376)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !548, file: !549, line: 576, baseType: !553, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !548, file: !549, line: 576, baseType: !553, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !548, file: !549, line: 578, baseType: !67, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !548, file: !549, line: 579, baseType: !627, size: 200, offset: 288)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 25)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !548, file: !549, line: 582, baseType: !67, size: 32, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !548, file: !549, line: 583, baseType: !632, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !634, line: 9, flags: DIFlagFwdDecl)
!634 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !548, file: !549, line: 585, baseType: !67, size: 32, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !548, file: !549, line: 587, baseType: !637, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !547}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !548, file: !549, line: 590, baseType: !641, size: 64, offset: 768)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !549, line: 47, size: 256, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !642, file: !549, line: 49, baseType: !641, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !642, file: !549, line: 50, baseType: !67, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !642, file: !549, line: 50, baseType: !67, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !642, file: !549, line: 50, baseType: !67, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !642, file: !549, line: 50, baseType: !67, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !642, file: !549, line: 51, baseType: !650, size: 32, offset: 192)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32, elements: !599)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !549, line: 25, baseType: !14)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !548, file: !549, line: 591, baseType: !67, size: 32, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !548, file: !549, line: 592, baseType: !641, size: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !548, file: !549, line: 593, baseType: !655, size: 64, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !548, file: !549, line: 596, baseType: !67, size: 32, offset: 1024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !548, file: !549, line: 597, baseType: !576, size: 64, offset: 1088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !548, file: !549, line: 632, baseType: !659, size: 2880, offset: 1152)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !548, file: !549, line: 599, size: 2880, elements: !660)
!660 = !{!661, !710}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !659, file: !549, line: 622, baseType: !662, size: 1728)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !549, line: 601, size: 1728, elements: !663)
!663 = !{!664, !665, !666, !670, !682, !683, !685, !692, !693, !694, !695, !699, !703, !704, !705, !706, !707, !708, !709}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !662, file: !549, line: 603, baseType: !14, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !662, file: !549, line: 604, baseType: !576, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !662, file: !549, line: 605, baseType: !667, size: 208, offset: 128)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 208, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 26)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !662, file: !549, line: 606, baseType: !671, size: 288, offset: 352)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !549, line: 55, size: 288, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !671, file: !549, line: 57, baseType: !67, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !671, file: !549, line: 58, baseType: !67, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !671, file: !549, line: 59, baseType: !67, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !671, file: !549, line: 60, baseType: !67, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !671, file: !549, line: 61, baseType: !67, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !671, file: !549, line: 62, baseType: !67, size: 32, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !671, file: !549, line: 63, baseType: !67, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !671, file: !549, line: 64, baseType: !67, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !671, file: !549, line: 65, baseType: !67, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !662, file: !549, line: 607, baseType: !67, size: 32, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !662, file: !549, line: 608, baseType: !684, size: 64, offset: 704)
!684 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !662, file: !549, line: 609, baseType: !686, size: 112, offset: 768)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !549, line: 319, size: 112, elements: !687)
!687 = !{!688, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !686, file: !549, line: 320, baseType: !689, size: 48)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 48, elements: !595)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !686, file: !549, line: 321, baseType: !689, size: 48, offset: 48)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !686, file: !549, line: 322, baseType: !193, size: 16, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !662, file: !549, line: 610, baseType: !611, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !662, file: !549, line: 611, baseType: !611, size: 64, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !662, file: !549, line: 612, baseType: !611, size: 64, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !662, file: !549, line: 613, baseType: !696, size: 64, offset: 1088)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !662, file: !549, line: 614, baseType: !700, size: 192, offset: 1152)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 24)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !662, file: !549, line: 615, baseType: !67, size: 32, offset: 1344)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !662, file: !549, line: 616, baseType: !611, size: 64, offset: 1376)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !662, file: !549, line: 617, baseType: !611, size: 64, offset: 1440)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !662, file: !549, line: 618, baseType: !611, size: 64, offset: 1504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !662, file: !549, line: 619, baseType: !611, size: 64, offset: 1568)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !662, file: !549, line: 620, baseType: !611, size: 64, offset: 1632)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !662, file: !549, line: 621, baseType: !67, size: 32, offset: 1696)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !659, file: !549, line: 631, baseType: !711, size: 2880)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !549, line: 626, size: 2880, elements: !712)
!712 = !{!713, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !711, file: !549, line: 629, baseType: !714, size: 1920)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 1920, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 30)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !711, file: !549, line: 630, baseType: !718, size: 960, offset: 1920)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 960, elements: !715)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !548, file: !549, line: 636, baseType: !720, size: 64, offset: 4032)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !549, line: 93, size: 6336, elements: !722)
!722 = !{!723, !724, !725, !732}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !721, file: !549, line: 94, baseType: !720, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !721, file: !549, line: 95, baseType: !67, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !721, file: !549, line: 97, baseType: !726, size: 2048, offset: 128)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 2048, elements: !730)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null}
!730 = !{!731}
!731 = !DISubrange(count: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !721, file: !549, line: 98, baseType: !733, size: 4160, offset: 2176)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !549, line: 74, size: 4160, elements: !734)
!734 = !{!735, !737, !738, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !733, file: !549, line: 75, baseType: !736, size: 2048)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2048, elements: !730)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !733, file: !549, line: 76, baseType: !736, size: 2048, offset: 2048)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !733, file: !549, line: 78, baseType: !651, size: 32, offset: 4096)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !733, file: !549, line: 81, baseType: !651, size: 32, offset: 4128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !548, file: !549, line: 637, baseType: !721, size: 6336, offset: 4096)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !548, file: !549, line: 641, baseType: !742, size: 64, offset: 10432)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !67}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !548, file: !549, line: 646, baseType: !747, size: 192, offset: 10496)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !549, line: 291, size: 192, elements: !748)
!748 = !{!749, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !747, file: !549, line: 293, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !747, file: !549, line: 294, baseType: !67, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !747, file: !549, line: 295, baseType: !553, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !548, file: !549, line: 648, baseType: !754, size: 4224, offset: 10688)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 4224, elements: !595)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !376, file: !377, line: 85, baseType: !756, size: 64, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !49, line: 114, size: 640, elements: !758)
!758 = !{!759, !763, !764, !771, !784}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !757, file: !49, line: 116, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !761, line: 64, baseType: !762)
!761 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !761, line: 63, baseType: !425)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !757, file: !49, line: 118, baseType: !760, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !757, file: !49, line: 120, baseType: !765, size: 128, offset: 128)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !766, line: 51, size: 128, elements: !767)
!766 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !766, line: 52, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !765, file: !766, line: 53, baseType: !769, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !757, file: !49, line: 122, baseType: !772, size: 256, offset: 256)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !49, line: 98, size: 256, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !772, file: !49, line: 107, baseType: !48, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !772, file: !49, line: 109, baseType: !760, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !772, file: !49, line: 111, baseType: !777, size: 96, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !761, line: 72, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !761, line: 68, size: 96, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !778, file: !761, line: 69, baseType: !67, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !778, file: !761, line: 70, baseType: !67, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !778, file: !761, line: 71, baseType: !783, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !761, line: 61, baseType: !67)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !757, file: !49, line: 124, baseType: !765, size: 128, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !371, file: !367, line: 38, baseType: !786, size: 64, offset: 128)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !367, line: 38, size: 64, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !786, file: !367, line: 38, baseType: !370, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !366, file: !367, line: 42, baseType: !790, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !357, file: !356, line: 71, baseType: !67, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "recvmbox", scope: !123, file: !13, line: 238, baseType: !793, size: 192, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_mbox_t", file: !356, line: 78, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 74, size: 192, elements: !795)
!795 = !{!796, !797, !801}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !794, file: !356, line: 75, baseType: !475, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mbox", scope: !794, file: !356, line: 76, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_mbox", file: !800, line: 48, flags: DIFlagFwdDecl)
!800 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukmpi/include/uk/mbox.h", directory: "/root/.unikraft/apps/redis/build")
!801 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !794, file: !356, line: 77, baseType: !67, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "acceptmbox", scope: !123, file: !13, line: 242, baseType: !793, size: 192, offset: 640)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !123, file: !13, line: 251, baseType: !67, size: 32, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !13, line: 277, baseType: !158, size: 8, offset: 864)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "current_msg", scope: !123, file: !13, line: 282, baseType: !806, size: 64, offset: 896)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "api_msg", file: !808, line: 79, size: 512, elements: !809)
!808 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/api_msg.h", directory: "/root/.unikraft/apps/redis/build")
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !807, file: !808, line: 82, baseType: !122, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !807, file: !808, line: 84, baseType: !290, size: 8, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !807, file: !808, line: 151, baseType: !813, size: 384, offset: 128)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !807, file: !808, line: 86, size: 384, elements: !814)
!814 = !{!815, !824, !828, !834, !842, !862, !866, !871}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !813, file: !808, line: 88, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netbuf", file: !818, line: 60, size: 384, elements: !819)
!818 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!819 = !{!820, !821, !822, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !817, file: !818, line: 61, baseType: !240, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !817, file: !818, line: 61, baseType: !240, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !817, file: !818, line: 62, baseType: !136, size: 192, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !817, file: !818, line: 63, baseType: !190, size: 16, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !813, file: !808, line: 92, baseType: !825, size: 8)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 90, size: 8, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !825, file: !808, line: 91, baseType: !158, size: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !813, file: !808, line: 98, baseType: !829, size: 128)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 94, size: 128, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !829, file: !808, line: 95, baseType: !347, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !829, file: !808, line: 96, baseType: !190, size: 16, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !829, file: !808, line: 97, baseType: !158, size: 8, offset: 80)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !813, file: !808, line: 104, baseType: !835, size: 192)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 100, size: 192, elements: !836)
!836 = !{!837, !839, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !835, file: !808, line: 101, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !835, file: !808, line: 102, baseType: !840, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !835, file: !808, line: 103, baseType: !158, size: 8, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !813, file: !808, line: 121, baseType: !843, size: 384)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 106, size: 384, elements: !844)
!844 = !{!845, !857, !858, !859, !860, !861}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !843, file: !808, line: 108, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netvector", file: !13, line: 293, size: 128, elements: !849)
!849 = !{!850, !853}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !848, file: !13, line: 295, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !848, file: !13, line: 297, baseType: !854, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !855, line: 40, baseType: !856)
!855 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !575, line: 129, baseType: !425)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vector_cnt", scope: !843, file: !808, line: 110, baseType: !190, size: 16, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vector_off", scope: !843, file: !808, line: 112, baseType: !854, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !843, file: !808, line: 114, baseType: !854, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !843, file: !808, line: 116, baseType: !854, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "apiflags", scope: !843, file: !808, line: 117, baseType: !158, size: 8, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !813, file: !808, line: 125, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 123, size: 64, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !863, file: !808, line: 124, baseType: !854, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !813, file: !808, line: 135, baseType: !867, size: 16)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 128, size: 16, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "shut", scope: !867, file: !808, line: 129, baseType: !158, size: 8)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "polls_left", scope: !867, file: !808, line: 133, baseType: !158, size: 8, offset: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "jl", scope: !813, file: !808, line: 144, baseType: !872, size: 192)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !808, line: 139, size: 192, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "multiaddr", scope: !872, file: !808, line: 140, baseType: !347, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "netif_addr", scope: !872, file: !808, line: 141, baseType: !347, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !872, file: !808, line: 142, baseType: !158, size: 8, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "join_or_leave", scope: !872, file: !808, line: 143, baseType: !54, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !123, file: !13, line: 285, baseType: !879, size: 64, offset: 960)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "netconn_callback", file: !13, line: 215, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !122, !58, !190}
!883 = !{!0, !884}
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !886, isLocal: true, isDefinition: true)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 80, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 10)
!889 = !{!890, !891}
!890 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!891 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !893, line: 32, baseType: !894)
!893 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 192, elements: !599)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !896, file: !10, line: 196, baseType: !14, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !896, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !896, file: !10, line: 196, baseType: !121, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !896, file: !10, line: 196, baseType: !121, size: 64, offset: 128)
!902 = !{i32 2, !"Dwarf Version", i32 4}
!903 = !{i32 2, !"Debug Info Version", i32 3}
!904 = !{i32 1, !"wchar_size", i32 4}
!905 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!906 = distinct !DISubprogram(name: "netconn_new_with_proto_and_callback", scope: !10, file: !10, line: 151, type: !907, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!122, !12, !158, !879}
!909 = !{!910, !911, !912, !913, !914, !915}
!910 = !DILocalVariable(name: "t", arg: 1, scope: !906, file: !10, line: 151, type: !12)
!911 = !DILocalVariable(name: "proto", arg: 2, scope: !906, file: !10, line: 151, type: !158)
!912 = !DILocalVariable(name: "callback", arg: 3, scope: !906, file: !10, line: 151, type: !879)
!913 = !DILocalVariable(name: "conn", scope: !906, file: !10, line: 153, type: !122)
!914 = !DILocalVariable(name: "msg", scope: !906, file: !10, line: 154, type: !807)
!915 = !DILocalVariable(name: "err", scope: !916, file: !10, line: 159, type: !290)
!916 = distinct !DILexicalBlock(scope: !917, file: !10, line: 158, column: 21)
!917 = distinct !DILexicalBlock(scope: !906, file: !10, line: 158, column: 7)
!918 = !DILocation(line: 151, column: 55, scope: !906)
!919 = !DILocation(line: 151, column: 63, scope: !906)
!920 = !DILocation(line: 151, column: 87, scope: !906)
!921 = !DILocation(line: 154, column: 3, scope: !906)
!922 = !DILocation(line: 157, column: 10, scope: !906)
!923 = !DILocation(line: 153, column: 19, scope: !906)
!924 = !DILocation(line: 158, column: 12, scope: !917)
!925 = !DILocation(line: 158, column: 7, scope: !906)
!926 = !DILocation(line: 161, column: 26, scope: !916)
!927 = !DILocation(line: 161, column: 32, scope: !916)
!928 = !DILocation(line: 161, column: 38, scope: !916)
!929 = !{!930, !930, i64 0}
!930 = !{!"omnipotent char", !931, i64 0}
!931 = !{!"Simple C/C++ TBAA"}
!932 = !DILocation(line: 162, column: 26, scope: !916)
!933 = !DILocation(line: 162, column: 31, scope: !916)
!934 = !{!935, !936, i64 0}
!935 = !{!"api_msg", !936, i64 0, !930, i64 8, !930, i64 16}
!936 = !{!"any pointer", !930, i64 0}
!937 = !DILocalVariable(name: "fn", arg: 1, scope: !938, file: !10, line: 120, type: !941)
!938 = distinct !DISubprogram(name: "netconn_apimsg", scope: !10, file: !10, line: 120, type: !939, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !943)
!939 = !DISubroutineType(types: !940)
!940 = !{!290, !941, !806}
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpip_callback_fn", file: !942, line: 72, baseType: !533)
!942 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcpip.h", directory: "/root/.unikraft/apps/redis/build")
!943 = !{!937, !944, !945}
!944 = !DILocalVariable(name: "apimsg", arg: 2, scope: !938, file: !10, line: 120, type: !806)
!945 = !DILocalVariable(name: "err", scope: !938, file: !10, line: 122, type: !290)
!946 = !DILocation(line: 120, column: 34, scope: !938, inlinedAt: !947)
!947 = distinct !DILocation(line: 163, column: 11, scope: !916)
!948 = !DILocation(line: 120, column: 54, scope: !938, inlinedAt: !947)
!949 = !DILocation(line: 133, column: 45, scope: !938, inlinedAt: !947)
!950 = !DILocation(line: 133, column: 9, scope: !938, inlinedAt: !947)
!951 = !DILocation(line: 122, column: 9, scope: !938, inlinedAt: !947)
!952 = !DILocation(line: 134, column: 11, scope: !953, inlinedAt: !947)
!953 = distinct !DILexicalBlock(scope: !938, file: !10, line: 134, column: 7)
!954 = !DILocation(line: 134, column: 7, scope: !938, inlinedAt: !947)
!955 = !DILocation(line: 137, column: 3, scope: !938, inlinedAt: !947)
!956 = !DILocation(line: 138, column: 1, scope: !938, inlinedAt: !947)
!957 = !DILocation(line: 159, column: 11, scope: !916)
!958 = !DILocation(line: 164, column: 9, scope: !916)
!959 = !DILocation(line: 135, column: 20, scope: !960, inlinedAt: !947)
!960 = distinct !DILexicalBlock(scope: !953, file: !10, line: 134, column: 22)
!961 = !{!935, !930, i64 8}
!962 = !DILocation(line: 135, column: 5, scope: !960, inlinedAt: !947)
!963 = !DILocation(line: 164, column: 13, scope: !964)
!964 = distinct !DILexicalBlock(scope: !916, file: !10, line: 164, column: 9)
!965 = !DILocation(line: 165, column: 7, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !10, line: 165, column: 7)
!967 = distinct !DILexicalBlock(scope: !968, file: !10, line: 165, column: 7)
!968 = distinct !DILexicalBlock(scope: !964, file: !10, line: 164, column: 24)
!969 = !DILocation(line: 165, column: 7, scope: !967)
!970 = !DILocation(line: 165, column: 7, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !10, line: 165, column: 7)
!972 = distinct !DILexicalBlock(scope: !966, file: !10, line: 165, column: 7)
!973 = !DILocation(line: 165, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !10, line: 165, column: 7)
!975 = distinct !DILexicalBlock(scope: !976, file: !10, line: 165, column: 7)
!976 = distinct !DILexicalBlock(scope: !971, file: !10, line: 165, column: 7)
!977 = !DILocation(line: 166, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !10, line: 166, column: 7)
!979 = distinct !DILexicalBlock(scope: !968, file: !10, line: 166, column: 7)
!980 = !DILocation(line: 166, column: 7, scope: !979)
!981 = !DILocation(line: 166, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !983, file: !10, line: 166, column: 7)
!983 = distinct !DILexicalBlock(scope: !978, file: !10, line: 166, column: 7)
!984 = !DILocation(line: 166, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !10, line: 166, column: 7)
!986 = distinct !DILexicalBlock(scope: !987, file: !10, line: 166, column: 7)
!987 = distinct !DILexicalBlock(scope: !982, file: !10, line: 166, column: 7)
!988 = !DILocation(line: 168, column: 7, scope: !989)
!989 = distinct !DILexicalBlock(scope: !990, file: !10, line: 168, column: 7)
!990 = distinct !DILexicalBlock(scope: !968, file: !10, line: 168, column: 7)
!991 = !DILocation(line: 168, column: 7, scope: !990)
!992 = !DILocation(line: 168, column: 7, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !10, line: 168, column: 7)
!994 = distinct !DILexicalBlock(scope: !989, file: !10, line: 168, column: 7)
!995 = !DILocation(line: 168, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !997, file: !10, line: 168, column: 7)
!997 = distinct !DILexicalBlock(scope: !998, file: !10, line: 168, column: 7)
!998 = distinct !DILexicalBlock(scope: !993, file: !10, line: 168, column: 7)
!999 = !DILocation(line: 171, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !10, line: 171, column: 7)
!1001 = distinct !DILexicalBlock(scope: !968, file: !10, line: 171, column: 7)
!1002 = !DILocation(line: 171, column: 7, scope: !1001)
!1003 = !DILocation(line: 171, column: 7, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !10, line: 171, column: 7)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !10, line: 171, column: 7)
!1006 = !DILocation(line: 171, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !10, line: 171, column: 7)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !10, line: 171, column: 7)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !10, line: 171, column: 7)
!1010 = !DILocation(line: 172, column: 7, scope: !968)
!1011 = !DILocation(line: 174, column: 7, scope: !968)
!1012 = !DILocation(line: 175, column: 15, scope: !968)
!1013 = !{!936, !936, i64 0}
!1014 = !DILocalVariable(name: "a", arg: 1, scope: !1015, file: !477, line: 237, type: !475)
!1015 = distinct !DISubprogram(name: "uk_free", scope: !477, file: !477, line: 237, type: !507, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !1016)
!1016 = !{!1014, !1017}
!1017 = !DILocalVariable(name: "ptr", arg: 2, scope: !1015, file: !477, line: 237, type: !121)
!1018 = !DILocation(line: 237, column: 45, scope: !1015, inlinedAt: !1019)
!1019 = distinct !DILocation(line: 175, column: 7, scope: !968)
!1020 = !DILocalVariable(name: "a", arg: 1, scope: !1021, file: !477, line: 231, type: !475)
!1021 = distinct !DISubprogram(name: "uk_do_free", scope: !477, file: !477, line: 231, type: !507, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !1022)
!1022 = !{!1020, !1023}
!1023 = !DILocalVariable(name: "ptr", arg: 2, scope: !1021, file: !477, line: 231, type: !121)
!1024 = !DILocation(line: 231, column: 48, scope: !1021, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 239, column: 2, scope: !1015, inlinedAt: !1019)
!1026 = !DILocation(line: 233, column: 2, scope: !1027, inlinedAt: !1025)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !477, line: 233, column: 2)
!1028 = distinct !DILexicalBlock(scope: !1021, file: !477, line: 233, column: 2)
!1029 = !DILocation(line: 233, column: 2, scope: !1028, inlinedAt: !1025)
!1030 = !{!"branch_weights", i32 1, i32 2000}
!1031 = !DILocation(line: 233, column: 2, scope: !1032, inlinedAt: !1025)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !477, line: 233, column: 2)
!1033 = !DILocation(line: 175, column: 36, scope: !968)
!1034 = !DILocation(line: 231, column: 57, scope: !1021, inlinedAt: !1025)
!1035 = !DILocation(line: 237, column: 54, scope: !1015, inlinedAt: !1019)
!1036 = !DILocation(line: 234, column: 5, scope: !1021, inlinedAt: !1025)
!1037 = !DILocation(line: 234, column: 2, scope: !1021, inlinedAt: !1025)
!1038 = !DILocation(line: 235, column: 1, scope: !1021, inlinedAt: !1025)
!1039 = !DILocation(line: 0, scope: !968)
!1040 = !DILocation(line: 182, column: 1, scope: !906)
!1041 = !DILocation(line: 194, column: 43, scope: !2)
!1042 = !DILocation(line: 196, column: 2, scope: !2)
!1043 = !DILocation(line: 196, column: 10, scope: !2)
!1044 = !DILocation(line: 197, column: 2, scope: !2)
!1045 = !DILocation(line: 198, column: 2, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 198, column: 2)
!1047 = distinct !DILexicalBlock(scope: !2, file: !3, line: 198, column: 2)
!1048 = !DILocation(line: 199, column: 2, scope: !2)
!1049 = !DILocation(line: 200, column: 1, scope: !2)
!1050 = distinct !DISubprogram(name: "netconn_prepare_delete", scope: !10, file: !10, line: 194, type: !1051, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!290, !122}
!1053 = !{!1054, !1055, !1056}
!1054 = !DILocalVariable(name: "conn", arg: 1, scope: !1050, file: !10, line: 194, type: !122)
!1055 = !DILocalVariable(name: "err", scope: !1050, file: !10, line: 196, type: !290)
!1056 = !DILocalVariable(name: "msg", scope: !1050, file: !10, line: 197, type: !807)
!1057 = !DILocation(line: 194, column: 40, scope: !1050)
!1058 = !DILocation(line: 197, column: 3, scope: !1050)
!1059 = !DILocation(line: 200, column: 12, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1050, file: !10, line: 200, column: 7)
!1061 = !DILocation(line: 200, column: 7, scope: !1050)
!1062 = !DILocation(line: 205, column: 24, scope: !1050)
!1063 = !DILocation(line: 205, column: 29, scope: !1050)
!1064 = !DILocation(line: 212, column: 24, scope: !1050)
!1065 = !DILocation(line: 212, column: 28, scope: !1050)
!1066 = !DILocation(line: 212, column: 31, scope: !1050)
!1067 = !DILocation(line: 212, column: 42, scope: !1050)
!1068 = !DILocation(line: 120, column: 34, scope: !938, inlinedAt: !1069)
