; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/asctime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/asctime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i8* @asctime(%struct.tm*) local_unnamed_addr #0 !dbg !7 {
  %2 = tail call %struct._reent* @__getreent() #3, !dbg !250
  %3 = getelementptr inbounds %struct._reent, %struct._reent* %2, i64 0, i32 16, i32 0, i32 0, i64 2, !dbg !252
  %4 = bitcast i8** %3 to i8*, !dbg !252
  %5 = tail call i8* @asctime_r(%struct.tm* %0, i8* nonnull %4) #3, !dbg !253
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !254
  ret i8* %5, !dbg !254
}

; Function Attrs: noredzone
declare dso_local %struct._reent* @__getreent() local_unnamed_addr #1

; Function Attrs: noredzone
declare dso_local i8* @asctime_r(%struct.tm*, i8*) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.module.flags = !{!3, !4, !5}
!llvm.ident = !{!6}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/asctime.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "asctime", scope: !1, file: !1, line: 59, type: !8, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !32)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !15, line: 31, size: 448, elements: !16)
!15 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!16 = !{!17, !19, !20, !21, !22, !23, !24, !25, !26, !27, !29}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !14, file: !15, line: 32, baseType: !18, size: 32)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !14, file: !15, line: 33, baseType: !18, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !14, file: !15, line: 34, baseType: !18, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !14, file: !15, line: 35, baseType: !18, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !14, file: !15, line: 36, baseType: !18, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !14, file: !15, line: 37, baseType: !18, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !14, file: !15, line: 38, baseType: !18, size: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !14, file: !15, line: 39, baseType: !18, size: 32, offset: 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !14, file: !15, line: 40, baseType: !18, size: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !14, file: !15, line: 41, baseType: !28, size: 64, offset: 320)
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !14, file: !15, line: 42, baseType: !30, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!32 = !{!33, !34}
!33 = !DILocalVariable(name: "tim_p", arg: 1, scope: !7, file: !1, line: 59, type: !12)
!34 = !DILocalVariable(name: "reent", scope: !7, file: !1, line: 62, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !37, line: 569, size: 14912, elements: !38)
!37 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!38 = !{!39, !40, !117, !118, !119, !120, !124, !125, !128, !129, !133, !145, !146, !147, !149, !150, !151, !213, !234, !235, !240, !247}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !36, file: !37, line: 571, baseType: !18, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !36, file: !37, line: 576, baseType: !41, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !37, line: 287, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !37, line: 181, size: 1408, elements: !44)
!44 = !{!45, !48, !49, !50, !52, !53, !58, !59, !61, !67, !71, !76, !80, !81, !82, !83, !87, !91, !92, !93, !95, !96, !100, !116}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !43, file: !37, line: 182, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !43, file: !37, line: 183, baseType: !18, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !43, file: !37, line: 184, baseType: !18, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !37, line: 185, baseType: !51, size: 16, offset: 128)
!51 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !43, file: !37, line: 186, baseType: !51, size: 16, offset: 144)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !43, file: !37, line: 187, baseType: !54, size: 128, offset: 192)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !37, line: 117, size: 128, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !54, file: !37, line: 118, baseType: !46, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !54, file: !37, line: 119, baseType: !18, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !43, file: !37, line: 188, baseType: !18, size: 32, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !43, file: !37, line: 195, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !43, file: !37, line: 197, baseType: !62, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !35, !60, !10, !18}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !66, line: 145, baseType: !28)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !43, file: !37, line: 199, baseType: !68, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!65, !35, !60, !30, !18}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !43, file: !37, line: 202, baseType: !72, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !35, !60, !75, !18}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !66, line: 114, baseType: !28)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !43, file: !37, line: 203, baseType: !77, size: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!18, !35, !60}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !43, file: !37, line: 206, baseType: !54, size: 128, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !43, file: !37, line: 207, baseType: !46, size: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !43, file: !37, line: 208, baseType: !18, size: 32, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !43, file: !37, line: 211, baseType: !84, size: 24, offset: 928)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 24, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 3)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !43, file: !37, line: 212, baseType: !88, size: 8, offset: 952)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !43, file: !37, line: 215, baseType: !54, size: 128, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !43, file: !37, line: 218, baseType: !18, size: 32, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !37, line: 219, baseType: !94, size: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !66, line: 44, baseType: !28)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !43, file: !37, line: 222, baseType: !35, size: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !43, file: !37, line: 226, baseType: !97, size: 32, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !66, line: 175, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !99, line: 12, baseType: !18)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !43, file: !37, line: 228, baseType: !101, size: 64, offset: 1312)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !66, line: 171, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 163, size: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !102, file: !66, line: 165, baseType: !18, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !102, file: !66, line: 170, baseType: !106, size: 32, offset: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !66, line: 166, size: 32, elements: !107)
!107 = !{!108, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !106, file: !66, line: 168, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !110, line: 124, baseType: !111)
!110 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!111 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !106, file: !66, line: 169, baseType: !113, size: 32)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 4)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !43, file: !37, line: 229, baseType: !18, size: 32, offset: 1376)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !36, file: !37, line: 576, baseType: !41, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !36, file: !37, line: 576, baseType: !41, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !36, file: !37, line: 578, baseType: !18, size: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !36, file: !37, line: 579, baseType: !121, size: 200, offset: 288)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 200, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 25)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !36, file: !37, line: 582, baseType: !18, size: 32, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !36, file: !37, line: 583, baseType: !126, size: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !37, line: 40, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !36, file: !37, line: 585, baseType: !18, size: 32, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !36, file: !37, line: 587, baseType: !130, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !35}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !36, file: !37, line: 590, baseType: !134, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !37, line: 47, size: 256, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !135, file: !37, line: 49, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !135, file: !37, line: 50, baseType: !18, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !135, file: !37, line: 50, baseType: !18, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !135, file: !37, line: 50, baseType: !18, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !135, file: !37, line: 50, baseType: !18, size: 32, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !135, file: !37, line: 51, baseType: !143, size: 32, offset: 192)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 32, elements: !89)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !37, line: 25, baseType: !111)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !36, file: !37, line: 591, baseType: !18, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !36, file: !37, line: 592, baseType: !134, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !36, file: !37, line: 593, baseType: !148, size: 64, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !36, file: !37, line: 596, baseType: !18, size: 32, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !36, file: !37, line: 597, baseType: !10, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !36, file: !37, line: 632, baseType: !152, size: 2880, offset: 1152)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !37, line: 599, size: 2880, elements: !153)
!153 = !{!154, !204}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !152, file: !37, line: 622, baseType: !155, size: 1728)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !37, line: 601, size: 1728, elements: !156)
!156 = !{!157, !158, !159, !163, !175, !176, !178, !186, !187, !188, !189, !193, !197, !198, !199, !200, !201, !202, !203}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !155, file: !37, line: 603, baseType: !111, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !155, file: !37, line: 604, baseType: !10, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !155, file: !37, line: 605, baseType: !160, size: 208, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 208, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 26)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !155, file: !37, line: 606, baseType: !164, size: 288, offset: 352)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !37, line: 55, size: 288, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !164, file: !37, line: 57, baseType: !18, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !164, file: !37, line: 58, baseType: !18, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !164, file: !37, line: 59, baseType: !18, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !164, file: !37, line: 60, baseType: !18, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !164, file: !37, line: 61, baseType: !18, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !164, file: !37, line: 62, baseType: !18, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !164, file: !37, line: 63, baseType: !18, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !164, file: !37, line: 64, baseType: !18, size: 32, offset: 224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !164, file: !37, line: 65, baseType: !18, size: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !155, file: !37, line: 607, baseType: !18, size: 32, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !155, file: !37, line: 608, baseType: !177, size: 64, offset: 704)
!177 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !155, file: !37, line: 609, baseType: !179, size: 112, offset: 768)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !37, line: 319, size: 112, elements: !180)
!180 = !{!181, !184, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !179, file: !37, line: 320, baseType: !182, size: 48)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 48, elements: !85)
!183 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !179, file: !37, line: 321, baseType: !182, size: 48, offset: 48)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !179, file: !37, line: 322, baseType: !183, size: 16, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !155, file: !37, line: 610, baseType: !101, size: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !155, file: !37, line: 611, baseType: !101, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !155, file: !37, line: 612, baseType: !101, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !155, file: !37, line: 613, baseType: !190, size: 64, offset: 1088)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !155, file: !37, line: 614, baseType: !194, size: 192, offset: 1152)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 24)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !155, file: !37, line: 615, baseType: !18, size: 32, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !155, file: !37, line: 616, baseType: !101, size: 64, offset: 1376)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !155, file: !37, line: 617, baseType: !101, size: 64, offset: 1440)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !155, file: !37, line: 618, baseType: !101, size: 64, offset: 1504)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !155, file: !37, line: 619, baseType: !101, size: 64, offset: 1568)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !155, file: !37, line: 620, baseType: !101, size: 64, offset: 1632)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !155, file: !37, line: 621, baseType: !18, size: 32, offset: 1696)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !152, file: !37, line: 631, baseType: !205, size: 2880)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !37, line: 626, size: 2880, elements: !206)
!206 = !{!207, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !205, file: !37, line: 629, baseType: !208, size: 1920)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1920, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 30)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !205, file: !37, line: 630, baseType: !212, size: 960, offset: 1920)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 960, elements: !209)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !36, file: !37, line: 636, baseType: !214, size: 64, offset: 4032)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !37, line: 93, size: 6336, elements: !216)
!216 = !{!217, !218, !219, !226}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !215, file: !37, line: 94, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !215, file: !37, line: 95, baseType: !18, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !215, file: !37, line: 97, baseType: !220, size: 2048, offset: 128)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 2048, elements: !224)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null}
!224 = !{!225}
!225 = !DISubrange(count: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !215, file: !37, line: 98, baseType: !227, size: 4160, offset: 2176)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !37, line: 74, size: 4160, elements: !228)
!228 = !{!229, !231, !232, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !227, file: !37, line: 75, baseType: !230, size: 2048)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !227, file: !37, line: 76, baseType: !230, size: 2048, offset: 2048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !227, file: !37, line: 78, baseType: !144, size: 32, offset: 4096)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !227, file: !37, line: 81, baseType: !144, size: 32, offset: 4128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !36, file: !37, line: 637, baseType: !215, size: 6336, offset: 4096)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !36, file: !37, line: 641, baseType: !236, size: 64, offset: 10432)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !18}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !36, file: !37, line: 646, baseType: !241, size: 192, offset: 10496)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !37, line: 291, size: 192, elements: !242)
!242 = !{!243, !245, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !241, file: !37, line: 293, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !241, file: !37, line: 294, baseType: !18, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !241, file: !37, line: 295, baseType: !41, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !36, file: !37, line: 648, baseType: !248, size: 4224, offset: 10688)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 4224, elements: !85)
!249 = !DILocation(line: 59, column: 1, scope: !7)
!250 = !DILocation(line: 62, column: 26, scope: !7)
!251 = !DILocation(line: 62, column: 18, scope: !7)
!252 = !DILocation(line: 65, column: 28, scope: !7)
!253 = !DILocation(line: 65, column: 10, scope: !7)
!254 = !DILocation(line: 65, column: 3, scope: !7)
