; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/async.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/async.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.dictType = type { i32 (i8*)*, i8* (i8*, i8*)*, i8* (i8*, i8*)*, i32 (i8*, i8*, i8*)*, void (i8*, i8*)*, void (i8*, i8*)* }
%struct.redisAsyncContext = type { %struct.redisContext, i32, i8*, i8*, %struct.anon.1, void (%struct.redisAsyncContext*, i32)*, void (%struct.redisAsyncContext*, i32)*, %struct.redisCallbackList, %struct.anon.2 }
%struct.redisContext = type { i32, [128 x i8], i32, i32, i8*, %struct.redisReader*, i32, %struct.timeval*, %struct.anon, %struct.anon.0 }
%struct.redisReader = type { i32, [128 x i8], i8*, i64, i64, i64, [9 x %struct.redisReadTask], i32, i8*, %struct.redisReplyObjectFunctions*, i8* }
%struct.redisReadTask = type { i32, i32, i32, i8*, %struct.redisReadTask*, i8* }
%struct.redisReplyObjectFunctions = type { i8* (%struct.redisReadTask*, i8*, i64)*, i8* (%struct.redisReadTask*, i32)*, i8* (%struct.redisReadTask*, i64)*, i8* (%struct.redisReadTask*)*, void (i8*)* }
%struct.timeval = type { i64, i64 }
%struct.anon = type { i8*, i8*, i32 }
%struct.anon.0 = type { i8* }
%struct.anon.1 = type { i8*, void (i8*)*, void (i8*)*, void (i8*)*, void (i8*)*, void (i8*)* }
%struct.redisCallbackList = type { %struct.redisCallback*, %struct.redisCallback* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "callbackDict", scope: !2, file: !3, line: 96, type: !82, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !81)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/async.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "redisConnectionType", file: !6, line: 134, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/hiredis.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "REDIS_CONN_TCP", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "REDIS_CONN_UNIX", value: 1, isUnsigned: true)
!11 = !{!12, !13, !34, !37, !18, !39, !53, !63, !72}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReply", file: !6, line: 119, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReply", file: !6, line: 112, size: 384, elements: !16)
!16 = !{!17, !19, !21, !27, !30, !31}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !6, line: 113, baseType: !18, size: 32)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !15, file: !6, line: 114, baseType: !20, size: 64, offset: 64)
!20 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, file: !6, line: 115, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 40, baseType: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !25, line: 129, baseType: !26)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!26 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !15, file: !6, line: 116, baseType: !28, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !15, file: !6, line: 117, baseType: !22, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !15, file: !6, line: 118, baseType: !32, size: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !38, line: 42, baseType: !28)
!38 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/sds.h", directory: "/root/.unikraft/apps/redis/build")
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !38, line: 50, size: 24, elements: !41)
!41 = !{!42, !47, !48, !49}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !38, line: 51, baseType: !43, size: 8)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !44, line: 24, baseType: !45)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !46, line: 43, baseType: !36)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !38, line: 52, baseType: !43, size: 8, offset: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !38, line: 53, baseType: !36, size: 8, offset: 16)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !38, line: 54, baseType: !50, offset: 24)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: -1)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !38, line: 56, size: 40, elements: !55)
!55 = !{!56, !60, !61, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !38, line: 57, baseType: !57, size: 16)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !44, line: 36, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !46, line: 57, baseType: !59)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !54, file: !38, line: 58, baseType: !57, size: 16, offset: 16)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !38, line: 59, baseType: !36, size: 8, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !54, file: !38, line: 60, baseType: !50, offset: 40)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !38, line: 62, size: 72, elements: !65)
!65 = !{!66, !69, !70, !71}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, file: !38, line: 63, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !44, line: 48, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !46, line: 79, baseType: !7)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !64, file: !38, line: 64, baseType: !67, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !38, line: 65, baseType: !36, size: 8, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !64, file: !38, line: 66, baseType: !50, offset: 72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !38, line: 68, size: 136, elements: !74)
!74 = !{!75, !78, !79, !80}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, file: !38, line: 69, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !44, line: 60, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !46, line: 105, baseType: !26)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !73, file: !38, line: 70, baseType: !76, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !38, line: 71, baseType: !36, size: 8, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !73, file: !38, line: 72, baseType: !50, offset: 136)
!81 = !{!0}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !83, line: 58, baseType: !84)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/dict.h", directory: "/root/.unikraft/apps/redis/build")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !83, line: 51, size: 384, elements: !85)
!85 = !{!86, !92, !96, !97, !101, !105}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !84, file: !83, line: 52, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!7, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !84, file: !83, line: 53, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!12, !12, !90}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !84, file: !83, line: 54, baseType: !93, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !84, file: !83, line: 55, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!18, !12, !90, !90}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !84, file: !83, line: 56, baseType: !102, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !12, !12}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !84, file: !83, line: 57, baseType: !102, size: 64, offset: 320)
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{i32 1, !"wchar_size", i32 4}
!109 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!110 = distinct !DISubprogram(name: "redisAsyncConnect", scope: !3, file: !3, line: 153, type: !111, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !275)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !273, !18}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisAsyncContext", file: !115, line: 101, baseType: !116)
!115 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/async.h", directory: "/root/.unikraft/apps/redis/build")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisAsyncContext", file: !115, line: 61, size: 2752, elements: !117)
!117 = !{!118, !207, !208, !209, !210, !219, !226, !229, !248}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !116, file: !115, line: 63, baseType: !119, size: 1664)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisContext", file: !6, line: 161, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisContext", file: !6, line: 140, size: 1664, elements: !121)
!121 = !{!122, !123, !127, !128, !129, !130, !186, !187, !197, !203}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !120, file: !6, line: 141, baseType: !18, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !120, file: !6, line: 142, baseType: !124, size: 1024, offset: 32)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !120, file: !6, line: 143, baseType: !18, size: 32, offset: 1056)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !6, line: 144, baseType: !18, size: 32, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "obuf", scope: !120, file: !6, line: 145, baseType: !28, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !120, file: !6, line: 146, baseType: !131, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReader", file: !133, line: 95, baseType: !134)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.h", directory: "/root/.unikraft/apps/redis/build")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReader", file: !133, line: 80, size: 4480, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !156, !157, !158, !185}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !134, file: !133, line: 81, baseType: !18, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !134, file: !133, line: 82, baseType: !124, size: 1024, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !134, file: !133, line: 84, baseType: !28, size: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !134, file: !133, line: 85, baseType: !22, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !133, line: 86, baseType: !22, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "maxbuf", scope: !134, file: !133, line: 87, baseType: !22, size: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "rstack", scope: !134, file: !133, line: 89, baseType: !143, size: 2880, offset: 1344)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 2880, elements: !154)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReadTask", file: !133, line: 70, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReadTask", file: !133, line: 63, size: 320, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !153}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !133, line: 64, baseType: !18, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !145, file: !133, line: 65, baseType: !18, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !145, file: !133, line: 66, baseType: !18, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !145, file: !133, line: 67, baseType: !12, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !145, file: !133, line: 68, baseType: !152, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !145, file: !133, line: 69, baseType: !12, size: 64, offset: 256)
!154 = !{!155}
!155 = !DISubrange(count: 9)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ridx", scope: !134, file: !133, line: 90, baseType: !18, size: 32, offset: 4224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !134, file: !133, line: 91, baseType: !12, size: 64, offset: 4288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !134, file: !133, line: 93, baseType: !159, size: 64, offset: 4352)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReplyObjectFunctions", file: !133, line: 78, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReplyObjectFunctions", file: !133, line: 72, size: 320, elements: !162)
!162 = !{!163, !169, !173, !177, !181}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "createString", scope: !161, file: !133, line: 73, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!12, !167, !28, !22}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "createArray", scope: !161, file: !133, line: 74, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!12, !167, !18}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "createInteger", scope: !161, file: !133, line: 75, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!12, !167, !20}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "createNil", scope: !161, file: !133, line: 76, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!12, !167}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "freeObject", scope: !161, file: !133, line: 77, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !12}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !134, file: !133, line: 94, baseType: !12, size: 64, offset: 4416)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !120, file: !6, line: 148, baseType: !5, size: 32, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !120, file: !6, line: 149, baseType: !188, size: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !190, line: 44, size: 128, elements: !191)
!190 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!191 = !{!192, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !189, file: !190, line: 45, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !190, line: 34, baseType: !194)
!194 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !189, file: !190, line: 46, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !190, line: 39, baseType: !194)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !120, file: !6, line: 155, baseType: !198, size: 192, offset: 1408)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !6, line: 151, size: 192, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !198, file: !6, line: 152, baseType: !28, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "source_addr", scope: !198, file: !6, line: 153, baseType: !28, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !198, file: !6, line: 154, baseType: !18, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "unix_sock", scope: !120, file: !6, line: 159, baseType: !204, size: 64, offset: 1600)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !6, line: 157, size: 64, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !204, file: !6, line: 158, baseType: !28, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !116, file: !115, line: 66, baseType: !18, size: 32, offset: 1664)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !116, file: !115, line: 67, baseType: !28, size: 64, offset: 1728)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !115, line: 70, baseType: !12, size: 64, offset: 1792)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !116, file: !115, line: 83, baseType: !211, size: 384, offset: 1856)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !116, file: !115, line: 73, size: 384, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !115, line: 74, baseType: !12, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "addRead", scope: !211, file: !115, line: 78, baseType: !182, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "delRead", scope: !211, file: !115, line: 79, baseType: !182, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "addWrite", scope: !211, file: !115, line: 80, baseType: !182, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "delWrite", scope: !211, file: !115, line: 81, baseType: !182, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !211, file: !115, line: 82, baseType: !182, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "onDisconnect", scope: !116, file: !115, line: 87, baseType: !220, size: 64, offset: 2240)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDisconnectCallback", file: !115, line: 57, baseType: !222)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224, !18}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "onConnect", scope: !116, file: !115, line: 90, baseType: !227, size: 64, offset: 2304)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisConnectCallback", file: !115, line: 58, baseType: !222)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "replies", scope: !116, file: !115, line: 93, baseType: !230, size: 128, offset: 2368)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallbackList", file: !115, line: 54, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCallbackList", file: !115, line: 52, size: 128, elements: !232)
!232 = !{!233, !247}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !231, file: !115, line: 53, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallback", file: !115, line: 49, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCallback", file: !115, line: 45, size: 192, elements: !237)
!237 = !{!238, !240, !246}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !115, line: 46, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !236, file: !115, line: 47, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallbackFn", file: !115, line: 44, baseType: !243)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245, !12, !12}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !236, file: !115, line: 48, baseType: !12, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !115, line: 53, baseType: !234, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !116, file: !115, line: 100, baseType: !249, size: 256, offset: 2496)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !116, file: !115, line: 96, size: 256, elements: !250)
!250 = !{!251, !252, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !249, file: !115, line: 97, baseType: !230, size: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !249, file: !115, line: 98, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !83, line: 60, size: 384, elements: !255)
!255 = !{!256, !266, !268, !269, !270, !271}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !254, file: !83, line: 61, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !83, line: 49, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !83, line: 45, size: 192, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !260, file: !83, line: 46, baseType: !12, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !260, file: !83, line: 47, baseType: !12, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !83, line: 48, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !83, line: 62, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !254, file: !83, line: 63, baseType: !26, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !254, file: !83, line: 64, baseType: !26, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !254, file: !83, line: 65, baseType: !26, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !254, file: !83, line: 66, baseType: !12, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "patterns", scope: !249, file: !115, line: 99, baseType: !253, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!275 = !{!276, !277, !278, !280}
!276 = !DILocalVariable(name: "ip", arg: 1, scope: !110, file: !3, line: 153, type: !273)
!277 = !DILocalVariable(name: "port", arg: 2, scope: !110, file: !3, line: 153, type: !18)
!278 = !DILocalVariable(name: "c", scope: !110, file: !3, line: 154, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!280 = !DILocalVariable(name: "ac", scope: !110, file: !3, line: 155, type: !113)
!281 = !DILocation(line: 153, column: 50, scope: !110)
!282 = !DILocation(line: 153, column: 58, scope: !110)
!283 = !DILocation(line: 157, column: 9, scope: !110)
!284 = !DILocation(line: 154, column: 19, scope: !110)
!285 = !DILocation(line: 158, column: 11, scope: !286)
!286 = distinct !DILexicalBlock(scope: !110, file: !3, line: 158, column: 9)
!287 = !DILocation(line: 158, column: 9, scope: !110)
!288 = !DILocalVariable(name: "c", arg: 1, scope: !289, file: !3, line: 105, type: !279)
!289 = distinct !DISubprogram(name: "redisAsyncInitialize", scope: !3, file: !3, line: 105, type: !290, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{!113, !279}
!292 = !{!288, !293}
!293 = !DILocalVariable(name: "ac", scope: !289, file: !3, line: 106, type: !113)
!294 = !DILocation(line: 105, column: 62, scope: !289, inlinedAt: !295)
!295 = distinct !DILocation(line: 161, column: 10, scope: !110)
!296 = !DILocation(line: 108, column: 18, scope: !289, inlinedAt: !295)
!297 = !DILocation(line: 108, column: 10, scope: !289, inlinedAt: !295)
!298 = !DILocation(line: 109, column: 12, scope: !299, inlinedAt: !295)
!299 = distinct !DILexicalBlock(scope: !289, file: !3, line: 109, column: 9)
!300 = !DILocation(line: 109, column: 9, scope: !289, inlinedAt: !295)
!301 = !DILocation(line: 110, column: 9, scope: !299, inlinedAt: !295)
!302 = !DILocation(line: 140, column: 1, scope: !289, inlinedAt: !295)
!303 = !DILocation(line: 155, column: 24, scope: !110)
!304 = !DILocation(line: 162, column: 9, scope: !110)
!305 = !DILocation(line: 163, column: 9, scope: !306)
!306 = distinct !DILexicalBlock(scope: !307, file: !3, line: 162, column: 21)
!307 = distinct !DILexicalBlock(scope: !110, file: !3, line: 162, column: 9)
!308 = !DILocation(line: 164, column: 9, scope: !306)
!309 = !DILocation(line: 117, column: 8, scope: !289, inlinedAt: !295)
!310 = !DILocation(line: 117, column: 14, scope: !289, inlinedAt: !295)
!311 = !{!312, !313, i64 136}
!312 = !{!"redisContext", !313, i64 0, !314, i64 4, !313, i64 132, !313, i64 136, !316, i64 144, !316, i64 152, !314, i64 160, !316, i64 168, !317, i64 176, !318, i64 200}
!313 = !{!"int", !314, i64 0}
!314 = !{!"omnipotent char", !315, i64 0}
!315 = !{!"Simple C/C++ TBAA"}
!316 = !{!"any pointer", !314, i64 0}
!317 = !{!"", !316, i64 0, !316, i64 8, !313, i64 16}
!318 = !{!"", !316, i64 0}
!319 = !DILocation(line: 119, column: 9, scope: !289, inlinedAt: !295)
!320 = !DILocation(line: 119, column: 13, scope: !289, inlinedAt: !295)
!321 = !{!322, !313, i64 208}
!322 = !{!"redisAsyncContext", !312, i64 0, !313, i64 208, !316, i64 216, !316, i64 224, !323, i64 232, !316, i64 280, !316, i64 288, !324, i64 296, !325, i64 312}
!323 = !{!"", !316, i64 0, !316, i64 8, !316, i64 16, !316, i64 24, !316, i64 32, !316, i64 40}
!324 = !{!"redisCallbackList", !316, i64 0, !316, i64 8}
!325 = !{!"", !324, i64 0, !316, i64 16, !316, i64 24}
!326 = !DILocation(line: 120, column: 9, scope: !289, inlinedAt: !295)
!327 = !DILocation(line: 120, column: 16, scope: !289, inlinedAt: !295)
!328 = !{!316, !316, i64 0}
!329 = !DILocation(line: 123, column: 9, scope: !289, inlinedAt: !295)
!330 = !DILocation(line: 123, column: 12, scope: !289, inlinedAt: !295)
!331 = !DILocation(line: 123, column: 17, scope: !289, inlinedAt: !295)
!332 = !{!322, !316, i64 232}
!333 = !DILocation(line: 124, column: 12, scope: !289, inlinedAt: !295)
!334 = !DILocation(line: 124, column: 20, scope: !289, inlinedAt: !295)
!335 = !DILocation(line: 126, column: 12, scope: !289, inlinedAt: !295)
!336 = !DILocation(line: 126, column: 21, scope: !289, inlinedAt: !295)
!337 = !DILocation(line: 128, column: 12, scope: !289, inlinedAt: !295)
!338 = !DILocation(line: 128, column: 20, scope: !289, inlinedAt: !295)
!339 = !{!322, !316, i64 272}
!340 = !DILocation(line: 131, column: 9, scope: !289, inlinedAt: !295)
!341 = !DILocation(line: 131, column: 22, scope: !289, inlinedAt: !295)
!342 = !DILocation(line: 133, column: 9, scope: !289, inlinedAt: !295)
!343 = !DILocation(line: 133, column: 22, scope: !289, inlinedAt: !295)
!344 = !DILocation(line: 135, column: 9, scope: !289, inlinedAt: !295)
!345 = !DILocation(line: 135, column: 26, scope: !289, inlinedAt: !295)
!346 = !DILocalVariable(name: "type", arg: 1, scope: !347, file: !348, line: 73, type: !267)
!347 = distinct !DISubprogram(name: "dictCreate", scope: !348, file: !348, line: 73, type: !349, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !353)
!348 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/dict.c", directory: "/root/.unikraft/apps/redis/build")
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !267, !12}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !83, line: 67, baseType: !254)
!353 = !{!346, !354, !355}
!354 = !DILocalVariable(name: "privDataPtr", arg: 2, scope: !347, file: !348, line: 73, type: !12)
!355 = !DILocalVariable(name: "ht", scope: !347, file: !348, line: 74, type: !351)
!356 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !357)
!357 = distinct !DILocation(line: 137, column: 24, scope: !289, inlinedAt: !295)
!358 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !357)
!359 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !357)
!360 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !357)
!361 = !DILocalVariable(name: "ht", arg: 1, scope: !362, file: !348, line: 80, type: !351)
!362 = distinct !DISubprogram(name: "_dictInit", scope: !348, file: !348, line: 80, type: !363, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !365)
!363 = !DISubroutineType(types: !364)
!364 = !{!18, !351, !267, !12}
!365 = !{!361, !366, !367}
!366 = !DILocalVariable(name: "type", arg: 2, scope: !362, file: !348, line: 80, type: !267)
!367 = !DILocalVariable(name: "privDataPtr", arg: 3, scope: !362, file: !348, line: 80, type: !12)
!368 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !369)
!369 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !357)
!370 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !369)
!371 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !369)
!372 = !DILocalVariable(name: "ht", arg: 1, scope: !373, file: !348, line: 65, type: !351)
!373 = distinct !DISubprogram(name: "_dictReset", scope: !348, file: !348, line: 65, type: !374, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !376)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !351}
!376 = !{!372}
!377 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !378)
!378 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !369)
!379 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !378)
!380 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !378)
!381 = !{!382, !316, i64 0}
!382 = !{!"dict", !316, i64 0, !316, i64 8, !383, i64 16, !383, i64 24, !383, i64 32, !316, i64 40}
!383 = !{!"long", !314, i64 0}
!384 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !378)
!385 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !378)
!386 = !{!383, !383, i64 0}
!387 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !378)
!388 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !378)
!389 = !{!382, !383, i64 32}
!390 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !378)
!391 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !369)
!392 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !369)
!393 = !{!382, !316, i64 8}
!394 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !369)
!395 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !369)
!396 = !{!382, !316, i64 40}
!397 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !369)
!398 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !357)
!399 = !DILocation(line: 137, column: 13, scope: !289, inlinedAt: !295)
!400 = !DILocation(line: 137, column: 22, scope: !289, inlinedAt: !295)
!401 = !{!322, !316, i64 328}
!402 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !403)
!403 = distinct !DILocation(line: 138, column: 24, scope: !289, inlinedAt: !295)
!404 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !403)
!405 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !403)
!406 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !403)
!407 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !408)
!408 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !403)
!409 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !408)
!410 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !408)
!411 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !412)
!412 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !408)
!413 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !412)
!414 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !412)
!415 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !412)
!416 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !412)
!417 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !412)
!418 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !412)
!419 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !412)
!420 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !408)
!421 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !408)
!422 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !408)
!423 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !408)
!424 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !408)
!425 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !403)
!426 = !DILocation(line: 138, column: 13, scope: !289, inlinedAt: !295)
!427 = !DILocation(line: 138, column: 22, scope: !289, inlinedAt: !295)
!428 = !{!322, !316, i64 336}
!429 = !DILocation(line: 139, column: 5, scope: !289, inlinedAt: !295)
!430 = !DILocation(line: 106, column: 24, scope: !289, inlinedAt: !295)
!431 = !DILocalVariable(name: "ac", arg: 1, scope: !432, file: !3, line: 144, type: !113)
!432 = distinct !DISubprogram(name: "__redisAsyncCopyError", scope: !3, file: !3, line: 144, type: !433, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !435)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !113}
!435 = !{!431, !436}
!436 = !DILocalVariable(name: "c", scope: !432, file: !3, line: 148, type: !279)
!437 = !DILocation(line: 144, column: 54, scope: !432, inlinedAt: !438)
!438 = distinct !DILocation(line: 167, column: 5, scope: !110)
!439 = !DILocation(line: 145, column: 9, scope: !432, inlinedAt: !438)
!440 = !DILocation(line: 148, column: 19, scope: !432, inlinedAt: !438)
!441 = !DILocation(line: 149, column: 18, scope: !432, inlinedAt: !438)
!442 = !{!312, !313, i64 0}
!443 = !DILocation(line: 149, column: 13, scope: !432, inlinedAt: !438)
!444 = !DILocation(line: 150, column: 18, scope: !432, inlinedAt: !438)
!445 = !DILocation(line: 150, column: 16, scope: !432, inlinedAt: !438)
!446 = !{!322, !316, i64 216}
!447 = !DILocation(line: 151, column: 1, scope: !432, inlinedAt: !438)
!448 = !DILocation(line: 168, column: 5, scope: !110)
!449 = !DILocation(line: 0, scope: !110)
!450 = !DILocation(line: 0, scope: !286)
!451 = !DILocation(line: 169, column: 1, scope: !110)
!452 = distinct !DISubprogram(name: "redisAsyncConnectBind", scope: !3, file: !3, line: 171, type: !453, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{!113, !273, !18, !273}
!455 = !{!456, !457, !458, !459, !460}
!456 = !DILocalVariable(name: "ip", arg: 1, scope: !452, file: !3, line: 171, type: !273)
!457 = !DILocalVariable(name: "port", arg: 2, scope: !452, file: !3, line: 171, type: !18)
!458 = !DILocalVariable(name: "source_addr", arg: 3, scope: !452, file: !3, line: 172, type: !273)
!459 = !DILocalVariable(name: "c", scope: !452, file: !3, line: 173, type: !279)
!460 = !DILocalVariable(name: "ac", scope: !452, file: !3, line: 174, type: !113)
!461 = !DILocation(line: 171, column: 54, scope: !452)
!462 = !DILocation(line: 171, column: 62, scope: !452)
!463 = !DILocation(line: 172, column: 54, scope: !452)
!464 = !DILocation(line: 173, column: 23, scope: !452)
!465 = !DILocation(line: 173, column: 19, scope: !452)
!466 = !DILocation(line: 105, column: 62, scope: !289, inlinedAt: !467)
!467 = distinct !DILocation(line: 174, column: 29, scope: !452)
!468 = !DILocation(line: 108, column: 18, scope: !289, inlinedAt: !467)
!469 = !DILocation(line: 108, column: 10, scope: !289, inlinedAt: !467)
!470 = !DILocation(line: 109, column: 12, scope: !299, inlinedAt: !467)
!471 = !DILocation(line: 109, column: 9, scope: !289, inlinedAt: !467)
!472 = !DILocation(line: 110, column: 9, scope: !299, inlinedAt: !467)
!473 = !DILocation(line: 140, column: 1, scope: !289, inlinedAt: !467)
!474 = !DILocation(line: 174, column: 24, scope: !452)
!475 = !DILocation(line: 144, column: 54, scope: !432, inlinedAt: !476)
!476 = distinct !DILocation(line: 175, column: 5, scope: !452)
!477 = !DILocation(line: 145, column: 9, scope: !432, inlinedAt: !476)
!478 = !DILocation(line: 117, column: 8, scope: !289, inlinedAt: !467)
!479 = !DILocation(line: 117, column: 14, scope: !289, inlinedAt: !467)
!480 = !DILocation(line: 119, column: 9, scope: !289, inlinedAt: !467)
!481 = !DILocation(line: 119, column: 13, scope: !289, inlinedAt: !467)
!482 = !DILocation(line: 120, column: 9, scope: !289, inlinedAt: !467)
!483 = !DILocation(line: 120, column: 16, scope: !289, inlinedAt: !467)
!484 = !DILocation(line: 123, column: 9, scope: !289, inlinedAt: !467)
!485 = !DILocation(line: 123, column: 12, scope: !289, inlinedAt: !467)
!486 = !DILocation(line: 123, column: 17, scope: !289, inlinedAt: !467)
!487 = !DILocation(line: 124, column: 12, scope: !289, inlinedAt: !467)
!488 = !DILocation(line: 124, column: 20, scope: !289, inlinedAt: !467)
!489 = !DILocation(line: 126, column: 12, scope: !289, inlinedAt: !467)
!490 = !DILocation(line: 126, column: 21, scope: !289, inlinedAt: !467)
!491 = !DILocation(line: 128, column: 12, scope: !289, inlinedAt: !467)
!492 = !DILocation(line: 128, column: 20, scope: !289, inlinedAt: !467)
!493 = !DILocation(line: 131, column: 9, scope: !289, inlinedAt: !467)
!494 = !DILocation(line: 131, column: 22, scope: !289, inlinedAt: !467)
!495 = !DILocation(line: 133, column: 9, scope: !289, inlinedAt: !467)
!496 = !DILocation(line: 133, column: 22, scope: !289, inlinedAt: !467)
!497 = !DILocation(line: 135, column: 9, scope: !289, inlinedAt: !467)
!498 = !DILocation(line: 135, column: 26, scope: !289, inlinedAt: !467)
!499 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !500)
!500 = distinct !DILocation(line: 137, column: 24, scope: !289, inlinedAt: !467)
!501 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !500)
!502 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !500)
!503 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !500)
!504 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !505)
!505 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !500)
!506 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !505)
!507 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !505)
!508 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !509)
!509 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !505)
!510 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !509)
!511 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !509)
!512 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !509)
!513 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !509)
!514 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !509)
!515 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !509)
!516 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !509)
!517 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !505)
!518 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !505)
!519 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !505)
!520 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !505)
!521 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !505)
!522 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !500)
!523 = !DILocation(line: 137, column: 13, scope: !289, inlinedAt: !467)
!524 = !DILocation(line: 137, column: 22, scope: !289, inlinedAt: !467)
!525 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !526)
!526 = distinct !DILocation(line: 138, column: 24, scope: !289, inlinedAt: !467)
!527 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !526)
!528 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !526)
!529 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !526)
!530 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !531)
!531 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !526)
!532 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !531)
!533 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !531)
!534 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !535)
!535 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !531)
!536 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !535)
!537 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !535)
!538 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !535)
!539 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !535)
!540 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !535)
!541 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !535)
!542 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !535)
!543 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !531)
!544 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !531)
!545 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !531)
!546 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !531)
!547 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !531)
!548 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !526)
!549 = !DILocation(line: 138, column: 13, scope: !289, inlinedAt: !467)
!550 = !DILocation(line: 138, column: 22, scope: !289, inlinedAt: !467)
!551 = !DILocation(line: 139, column: 5, scope: !289, inlinedAt: !467)
!552 = !DILocation(line: 106, column: 24, scope: !289, inlinedAt: !467)
!553 = !DILocation(line: 148, column: 19, scope: !432, inlinedAt: !476)
!554 = !DILocation(line: 149, column: 18, scope: !432, inlinedAt: !476)
!555 = !DILocation(line: 149, column: 13, scope: !432, inlinedAt: !476)
!556 = !DILocation(line: 150, column: 18, scope: !432, inlinedAt: !476)
!557 = !DILocation(line: 150, column: 16, scope: !432, inlinedAt: !476)
!558 = !DILocation(line: 151, column: 1, scope: !432, inlinedAt: !476)
!559 = !DILocation(line: 0, scope: !452)
!560 = !DILocation(line: 176, column: 5, scope: !452)
!561 = distinct !DISubprogram(name: "redisAsyncConnectBindWithReuse", scope: !3, file: !3, line: 179, type: !453, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !562)
!562 = !{!563, !564, !565, !566, !567}
!563 = !DILocalVariable(name: "ip", arg: 1, scope: !561, file: !3, line: 179, type: !273)
!564 = !DILocalVariable(name: "port", arg: 2, scope: !561, file: !3, line: 179, type: !18)
!565 = !DILocalVariable(name: "source_addr", arg: 3, scope: !561, file: !3, line: 180, type: !273)
!566 = !DILocalVariable(name: "c", scope: !561, file: !3, line: 181, type: !279)
!567 = !DILocalVariable(name: "ac", scope: !561, file: !3, line: 182, type: !113)
!568 = !DILocation(line: 179, column: 63, scope: !561)
!569 = !DILocation(line: 179, column: 71, scope: !561)
!570 = !DILocation(line: 180, column: 63, scope: !561)
!571 = !DILocation(line: 181, column: 23, scope: !561)
!572 = !DILocation(line: 181, column: 19, scope: !561)
!573 = !DILocation(line: 105, column: 62, scope: !289, inlinedAt: !574)
!574 = distinct !DILocation(line: 182, column: 29, scope: !561)
!575 = !DILocation(line: 108, column: 18, scope: !289, inlinedAt: !574)
!576 = !DILocation(line: 108, column: 10, scope: !289, inlinedAt: !574)
!577 = !DILocation(line: 109, column: 12, scope: !299, inlinedAt: !574)
!578 = !DILocation(line: 109, column: 9, scope: !289, inlinedAt: !574)
!579 = !DILocation(line: 110, column: 9, scope: !299, inlinedAt: !574)
!580 = !DILocation(line: 140, column: 1, scope: !289, inlinedAt: !574)
!581 = !DILocation(line: 182, column: 24, scope: !561)
!582 = !DILocation(line: 144, column: 54, scope: !432, inlinedAt: !583)
!583 = distinct !DILocation(line: 183, column: 5, scope: !561)
!584 = !DILocation(line: 145, column: 9, scope: !432, inlinedAt: !583)
!585 = !DILocation(line: 117, column: 8, scope: !289, inlinedAt: !574)
!586 = !DILocation(line: 117, column: 14, scope: !289, inlinedAt: !574)
!587 = !DILocation(line: 119, column: 9, scope: !289, inlinedAt: !574)
!588 = !DILocation(line: 119, column: 13, scope: !289, inlinedAt: !574)
!589 = !DILocation(line: 120, column: 9, scope: !289, inlinedAt: !574)
!590 = !DILocation(line: 120, column: 16, scope: !289, inlinedAt: !574)
!591 = !DILocation(line: 123, column: 9, scope: !289, inlinedAt: !574)
!592 = !DILocation(line: 123, column: 12, scope: !289, inlinedAt: !574)
!593 = !DILocation(line: 123, column: 17, scope: !289, inlinedAt: !574)
!594 = !DILocation(line: 124, column: 12, scope: !289, inlinedAt: !574)
!595 = !DILocation(line: 124, column: 20, scope: !289, inlinedAt: !574)
!596 = !DILocation(line: 126, column: 12, scope: !289, inlinedAt: !574)
!597 = !DILocation(line: 126, column: 21, scope: !289, inlinedAt: !574)
!598 = !DILocation(line: 128, column: 12, scope: !289, inlinedAt: !574)
!599 = !DILocation(line: 128, column: 20, scope: !289, inlinedAt: !574)
!600 = !DILocation(line: 131, column: 9, scope: !289, inlinedAt: !574)
!601 = !DILocation(line: 131, column: 22, scope: !289, inlinedAt: !574)
!602 = !DILocation(line: 133, column: 9, scope: !289, inlinedAt: !574)
!603 = !DILocation(line: 133, column: 22, scope: !289, inlinedAt: !574)
!604 = !DILocation(line: 135, column: 9, scope: !289, inlinedAt: !574)
!605 = !DILocation(line: 135, column: 26, scope: !289, inlinedAt: !574)
!606 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !607)
!607 = distinct !DILocation(line: 137, column: 24, scope: !289, inlinedAt: !574)
!608 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !607)
!609 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !607)
!610 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !607)
!611 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !612)
!612 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !607)
!613 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !612)
!614 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !612)
!615 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !616)
!616 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !612)
!617 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !616)
!618 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !616)
!619 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !616)
!620 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !616)
!621 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !616)
!622 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !616)
!623 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !616)
!624 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !612)
!625 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !612)
!626 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !612)
!627 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !612)
!628 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !612)
!629 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !607)
!630 = !DILocation(line: 137, column: 13, scope: !289, inlinedAt: !574)
!631 = !DILocation(line: 137, column: 22, scope: !289, inlinedAt: !574)
!632 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !633)
!633 = distinct !DILocation(line: 138, column: 24, scope: !289, inlinedAt: !574)
!634 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !633)
!635 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !633)
!636 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !633)
!637 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !638)
!638 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !633)
!639 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !638)
!640 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !638)
!641 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !642)
!642 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !638)
!643 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !642)
!644 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !642)
!645 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !642)
!646 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !642)
!647 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !642)
!648 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !642)
!649 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !642)
!650 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !638)
!651 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !638)
!652 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !638)
!653 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !638)
!654 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !638)
!655 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !633)
!656 = !DILocation(line: 138, column: 13, scope: !289, inlinedAt: !574)
!657 = !DILocation(line: 138, column: 22, scope: !289, inlinedAt: !574)
!658 = !DILocation(line: 139, column: 5, scope: !289, inlinedAt: !574)
!659 = !DILocation(line: 106, column: 24, scope: !289, inlinedAt: !574)
!660 = !DILocation(line: 148, column: 19, scope: !432, inlinedAt: !583)
!661 = !DILocation(line: 149, column: 18, scope: !432, inlinedAt: !583)
!662 = !DILocation(line: 149, column: 13, scope: !432, inlinedAt: !583)
!663 = !DILocation(line: 150, column: 18, scope: !432, inlinedAt: !583)
!664 = !DILocation(line: 150, column: 16, scope: !432, inlinedAt: !583)
!665 = !DILocation(line: 151, column: 1, scope: !432, inlinedAt: !583)
!666 = !DILocation(line: 0, scope: !561)
!667 = !DILocation(line: 184, column: 5, scope: !561)
!668 = distinct !DISubprogram(name: "redisAsyncConnectUnix", scope: !3, file: !3, line: 187, type: !669, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!113, !273}
!671 = !{!672, !673, !674}
!672 = !DILocalVariable(name: "path", arg: 1, scope: !668, file: !3, line: 187, type: !273)
!673 = !DILocalVariable(name: "c", scope: !668, file: !3, line: 188, type: !279)
!674 = !DILocalVariable(name: "ac", scope: !668, file: !3, line: 189, type: !113)
!675 = !DILocation(line: 187, column: 54, scope: !668)
!676 = !DILocation(line: 191, column: 9, scope: !668)
!677 = !DILocation(line: 188, column: 19, scope: !668)
!678 = !DILocation(line: 192, column: 11, scope: !679)
!679 = distinct !DILexicalBlock(scope: !668, file: !3, line: 192, column: 9)
!680 = !DILocation(line: 192, column: 9, scope: !668)
!681 = !DILocation(line: 105, column: 62, scope: !289, inlinedAt: !682)
!682 = distinct !DILocation(line: 195, column: 10, scope: !668)
!683 = !DILocation(line: 108, column: 18, scope: !289, inlinedAt: !682)
!684 = !DILocation(line: 108, column: 10, scope: !289, inlinedAt: !682)
!685 = !DILocation(line: 109, column: 12, scope: !299, inlinedAt: !682)
!686 = !DILocation(line: 109, column: 9, scope: !289, inlinedAt: !682)
!687 = !DILocation(line: 110, column: 9, scope: !299, inlinedAt: !682)
!688 = !DILocation(line: 140, column: 1, scope: !289, inlinedAt: !682)
!689 = !DILocation(line: 189, column: 24, scope: !668)
!690 = !DILocation(line: 196, column: 9, scope: !668)
!691 = !DILocation(line: 197, column: 9, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !3, line: 196, column: 21)
!693 = distinct !DILexicalBlock(scope: !668, file: !3, line: 196, column: 9)
!694 = !DILocation(line: 198, column: 9, scope: !692)
!695 = !DILocation(line: 117, column: 8, scope: !289, inlinedAt: !682)
!696 = !DILocation(line: 117, column: 14, scope: !289, inlinedAt: !682)
!697 = !DILocation(line: 119, column: 9, scope: !289, inlinedAt: !682)
!698 = !DILocation(line: 119, column: 13, scope: !289, inlinedAt: !682)
!699 = !DILocation(line: 120, column: 9, scope: !289, inlinedAt: !682)
!700 = !DILocation(line: 120, column: 16, scope: !289, inlinedAt: !682)
!701 = !DILocation(line: 123, column: 9, scope: !289, inlinedAt: !682)
!702 = !DILocation(line: 123, column: 12, scope: !289, inlinedAt: !682)
!703 = !DILocation(line: 123, column: 17, scope: !289, inlinedAt: !682)
!704 = !DILocation(line: 124, column: 12, scope: !289, inlinedAt: !682)
!705 = !DILocation(line: 124, column: 20, scope: !289, inlinedAt: !682)
!706 = !DILocation(line: 126, column: 12, scope: !289, inlinedAt: !682)
!707 = !DILocation(line: 126, column: 21, scope: !289, inlinedAt: !682)
!708 = !DILocation(line: 128, column: 12, scope: !289, inlinedAt: !682)
!709 = !DILocation(line: 128, column: 20, scope: !289, inlinedAt: !682)
!710 = !DILocation(line: 131, column: 9, scope: !289, inlinedAt: !682)
!711 = !DILocation(line: 131, column: 22, scope: !289, inlinedAt: !682)
!712 = !DILocation(line: 133, column: 9, scope: !289, inlinedAt: !682)
!713 = !DILocation(line: 133, column: 22, scope: !289, inlinedAt: !682)
!714 = !DILocation(line: 135, column: 9, scope: !289, inlinedAt: !682)
!715 = !DILocation(line: 135, column: 26, scope: !289, inlinedAt: !682)
!716 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !717)
!717 = distinct !DILocation(line: 137, column: 24, scope: !289, inlinedAt: !682)
!718 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !717)
!719 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !717)
!720 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !717)
!721 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !722)
!722 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !717)
!723 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !722)
!724 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !722)
!725 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !726)
!726 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !722)
!727 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !726)
!728 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !726)
!729 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !726)
!730 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !726)
!731 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !726)
!732 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !726)
!733 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !726)
!734 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !722)
!735 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !722)
!736 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !722)
!737 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !722)
!738 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !722)
!739 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !717)
!740 = !DILocation(line: 137, column: 13, scope: !289, inlinedAt: !682)
!741 = !DILocation(line: 137, column: 22, scope: !289, inlinedAt: !682)
!742 = !DILocation(line: 73, column: 35, scope: !347, inlinedAt: !743)
!743 = distinct !DILocation(line: 138, column: 24, scope: !289, inlinedAt: !682)
!744 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !743)
!745 = !DILocation(line: 74, column: 16, scope: !347, inlinedAt: !743)
!746 = !DILocation(line: 74, column: 11, scope: !347, inlinedAt: !743)
!747 = !DILocation(line: 80, column: 28, scope: !362, inlinedAt: !748)
!748 = distinct !DILocation(line: 75, column: 5, scope: !347, inlinedAt: !743)
!749 = !DILocation(line: 80, column: 42, scope: !362, inlinedAt: !748)
!750 = !DILocation(line: 80, column: 54, scope: !362, inlinedAt: !748)
!751 = !DILocation(line: 65, column: 30, scope: !373, inlinedAt: !752)
!752 = distinct !DILocation(line: 81, column: 5, scope: !362, inlinedAt: !748)
!753 = !DILocation(line: 66, column: 9, scope: !373, inlinedAt: !752)
!754 = !DILocation(line: 66, column: 15, scope: !373, inlinedAt: !752)
!755 = !DILocation(line: 67, column: 9, scope: !373, inlinedAt: !752)
!756 = !DILocation(line: 67, column: 14, scope: !373, inlinedAt: !752)
!757 = !DILocation(line: 69, column: 9, scope: !373, inlinedAt: !752)
!758 = !DILocation(line: 69, column: 14, scope: !373, inlinedAt: !752)
!759 = !DILocation(line: 70, column: 1, scope: !373, inlinedAt: !752)
!760 = !DILocation(line: 82, column: 9, scope: !362, inlinedAt: !748)
!761 = !DILocation(line: 82, column: 14, scope: !362, inlinedAt: !748)
!762 = !DILocation(line: 83, column: 9, scope: !362, inlinedAt: !748)
!763 = !DILocation(line: 83, column: 18, scope: !362, inlinedAt: !748)
!764 = !DILocation(line: 84, column: 5, scope: !362, inlinedAt: !748)
!765 = !DILocation(line: 76, column: 5, scope: !347, inlinedAt: !743)
!766 = !DILocation(line: 138, column: 13, scope: !289, inlinedAt: !682)
!767 = !DILocation(line: 138, column: 22, scope: !289, inlinedAt: !682)
!768 = !DILocation(line: 139, column: 5, scope: !289, inlinedAt: !682)
!769 = !DILocation(line: 106, column: 24, scope: !289, inlinedAt: !682)
!770 = !DILocation(line: 144, column: 54, scope: !432, inlinedAt: !771)
!771 = distinct !DILocation(line: 201, column: 5, scope: !668)
!772 = !DILocation(line: 145, column: 9, scope: !432, inlinedAt: !771)
!773 = !DILocation(line: 148, column: 19, scope: !432, inlinedAt: !771)
!774 = !DILocation(line: 149, column: 18, scope: !432, inlinedAt: !771)
!775 = !DILocation(line: 149, column: 13, scope: !432, inlinedAt: !771)
!776 = !DILocation(line: 150, column: 18, scope: !432, inlinedAt: !771)
!777 = !DILocation(line: 150, column: 16, scope: !432, inlinedAt: !771)
!778 = !DILocation(line: 151, column: 1, scope: !432, inlinedAt: !771)
!779 = !DILocation(line: 202, column: 5, scope: !668)
!780 = !DILocation(line: 0, scope: !668)
!781 = !DILocation(line: 0, scope: !679)
!782 = !DILocation(line: 203, column: 1, scope: !668)
!783 = distinct !DISubprogram(name: "redisAsyncSetConnectCallback", scope: !3, file: !3, line: 205, type: !784, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!18, !113, !227}
!786 = !{!787, !788}
!787 = !DILocalVariable(name: "ac", arg: 1, scope: !783, file: !3, line: 205, type: !113)
!788 = !DILocalVariable(name: "fn", arg: 2, scope: !783, file: !3, line: 205, type: !227)
!789 = !DILocation(line: 205, column: 53, scope: !783)
!790 = !DILocation(line: 205, column: 79, scope: !783)
!791 = !DILocation(line: 206, column: 13, scope: !792)
!792 = distinct !DILexicalBlock(scope: !783, file: !3, line: 206, column: 9)
!793 = !{!322, !316, i64 288}
!794 = !DILocation(line: 206, column: 23, scope: !792)
!795 = !DILocation(line: 206, column: 9, scope: !783)
!796 = !DILocation(line: 207, column: 23, scope: !797)
!797 = distinct !DILexicalBlock(scope: !792, file: !3, line: 206, column: 32)
!798 = !DILocation(line: 212, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !3, line: 212, column: 9)
!800 = distinct !DILexicalBlock(scope: !797, file: !3, line: 212, column: 9)
!801 = !{!322, !316, i64 256}
!802 = !DILocation(line: 212, column: 9, scope: !800)
!803 = !DILocation(line: 0, scope: !783)
!804 = !DILocation(line: 0, scope: !797)
!805 = !DILocation(line: 216, column: 1, scope: !783)
!806 = distinct !DISubprogram(name: "redisAsyncSetDisconnectCallback", scope: !3, file: !3, line: 218, type: !807, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!18, !113, !220}
!809 = !{!810, !811}
!810 = !DILocalVariable(name: "ac", arg: 1, scope: !806, file: !3, line: 218, type: !113)
!811 = !DILocalVariable(name: "fn", arg: 2, scope: !806, file: !3, line: 218, type: !220)
!812 = !DILocation(line: 218, column: 56, scope: !806)
!813 = !DILocation(line: 218, column: 85, scope: !806)
!814 = !DILocation(line: 219, column: 13, scope: !815)
!815 = distinct !DILexicalBlock(scope: !806, file: !3, line: 219, column: 9)
!816 = !{!322, !316, i64 280}
!817 = !DILocation(line: 219, column: 26, scope: !815)
!818 = !DILocation(line: 219, column: 9, scope: !806)
!819 = !DILocation(line: 220, column: 26, scope: !820)
!820 = distinct !DILexicalBlock(scope: !815, file: !3, line: 219, column: 35)
!821 = !DILocation(line: 221, column: 9, scope: !820)
!822 = !DILocation(line: 0, scope: !806)
!823 = !DILocation(line: 0, scope: !820)
!824 = !DILocation(line: 224, column: 1, scope: !806)
!825 = distinct !DISubprogram(name: "redisAsyncFree", scope: !3, file: !3, line: 323, type: !433, isLocal: false, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !826)
!826 = !{!827, !828}
!827 = !DILocalVariable(name: "ac", arg: 1, scope: !825, file: !3, line: 323, type: !113)
!828 = !DILocalVariable(name: "c", scope: !825, file: !3, line: 324, type: !279)
!829 = !DILocation(line: 323, column: 40, scope: !825)
!830 = !DILocation(line: 324, column: 19, scope: !825)
!831 = !DILocation(line: 325, column: 8, scope: !825)
!832 = !DILocation(line: 325, column: 14, scope: !825)
!833 = !DILocation(line: 326, column: 20, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !3, line: 326, column: 9)
!835 = !DILocation(line: 326, column: 9, scope: !825)
!836 = !DILocation(line: 327, column: 9, scope: !834)
!837 = !DILocation(line: 328, column: 1, scope: !825)
!838 = distinct !DISubprogram(name: "__redisAsyncFree", scope: !3, file: !3, line: 275, type: !433, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !839)
!839 = !{!840, !841, !842, !843, !852}
!840 = !DILocalVariable(name: "ac", arg: 1, scope: !838, file: !3, line: 275, type: !113)
!841 = !DILocalVariable(name: "c", scope: !838, file: !3, line: 276, type: !279)
!842 = !DILocalVariable(name: "cb", scope: !838, file: !3, line: 277, type: !235)
!843 = !DILocalVariable(name: "it", scope: !838, file: !3, line: 278, type: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !83, line: 73, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !83, line: 69, size: 256, elements: !847)
!847 = !{!848, !849, !850, !851}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !846, file: !83, line: 70, baseType: !351, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !846, file: !83, line: 71, baseType: !18, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !846, file: !83, line: 72, baseType: !258, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !846, file: !83, line: 72, baseType: !258, size: 64, offset: 192)
!852 = !DILocalVariable(name: "de", scope: !838, file: !3, line: 279, type: !258)
!853 = !DILocation(line: 275, column: 49, scope: !838)
!854 = !DILocation(line: 276, column: 29, scope: !838)
!855 = !DILocation(line: 276, column: 19, scope: !838)
!856 = !DILocation(line: 277, column: 5, scope: !838)
!857 = !DILocation(line: 282, column: 5, scope: !838)
!858 = !DILocation(line: 282, column: 38, scope: !838)
!859 = !DILocation(line: 277, column: 19, scope: !838)
!860 = !DILocalVariable(name: "list", arg: 1, scope: !861, file: !3, line: 249, type: !864)
!861 = distinct !DISubprogram(name: "__redisShiftCallback", scope: !3, file: !3, line: 249, type: !862, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !865)
!862 = !DISubroutineType(types: !863)
!863 = !{!18, !864, !234}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!865 = !{!860, !866, !867}
!866 = !DILocalVariable(name: "target", arg: 2, scope: !861, file: !3, line: 249, type: !234)
!867 = !DILocalVariable(name: "cb", scope: !861, file: !3, line: 250, type: !234)
!868 = !DILocation(line: 249, column: 52, scope: !861, inlinedAt: !869)
!869 = distinct !DILocation(line: 282, column: 12, scope: !838)
!870 = !DILocation(line: 249, column: 73, scope: !861, inlinedAt: !869)
!871 = !DILocation(line: 250, column: 31, scope: !861, inlinedAt: !869)
!872 = !{!324, !316, i64 0}
!873 = !DILocation(line: 250, column: 20, scope: !861, inlinedAt: !869)
!874 = !DILocation(line: 251, column: 12, scope: !875, inlinedAt: !869)
!875 = distinct !DILexicalBlock(scope: !861, file: !3, line: 251, column: 9)
!876 = !DILocation(line: 251, column: 9, scope: !861, inlinedAt: !869)
!877 = !DILocation(line: 252, column: 26, scope: !878, inlinedAt: !869)
!878 = distinct !DILexicalBlock(scope: !875, file: !3, line: 251, column: 21)
!879 = !{!880, !316, i64 0}
!880 = !{!"redisCallback", !316, i64 0, !316, i64 8, !316, i64 16}
!881 = !DILocation(line: 252, column: 20, scope: !878, inlinedAt: !869)
!882 = !DILocation(line: 253, column: 25, scope: !883, inlinedAt: !869)
!883 = distinct !DILexicalBlock(scope: !878, file: !3, line: 253, column: 13)
!884 = !{!324, !316, i64 8}
!885 = !DILocation(line: 253, column: 16, scope: !883, inlinedAt: !869)
!886 = !DILocation(line: 253, column: 13, scope: !878, inlinedAt: !869)
!887 = !DILocation(line: 254, column: 24, scope: !883, inlinedAt: !869)
!888 = !DILocation(line: 254, column: 13, scope: !883, inlinedAt: !869)
!889 = !DILocation(line: 262, column: 5, scope: !861, inlinedAt: !869)
!890 = !DILocation(line: 263, column: 1, scope: !861, inlinedAt: !869)
!891 = !DILocation(line: 286, column: 42, scope: !838)
!892 = !DILocation(line: 249, column: 52, scope: !861, inlinedAt: !893)
!893 = distinct !DILocation(line: 286, column: 12, scope: !838)
!894 = !DILocation(line: 249, column: 73, scope: !861, inlinedAt: !893)
!895 = !DILocation(line: 250, column: 31, scope: !861, inlinedAt: !893)
!896 = !DILocation(line: 250, column: 20, scope: !861, inlinedAt: !893)
!897 = !DILocation(line: 251, column: 12, scope: !875, inlinedAt: !893)
!898 = !DILocation(line: 251, column: 9, scope: !861, inlinedAt: !893)
!899 = !DILocation(line: 257, column: 13, scope: !878, inlinedAt: !869)
!900 = !DILocation(line: 258, column: 27, scope: !901, inlinedAt: !869)
!901 = distinct !DILexicalBlock(scope: !878, file: !3, line: 257, column: 13)
!902 = !DILocation(line: 258, column: 13, scope: !901, inlinedAt: !869)
!903 = !DILocation(line: 259, column: 9, scope: !878, inlinedAt: !869)
!904 = !DILocation(line: 260, column: 9, scope: !878, inlinedAt: !869)
!905 = !DILocalVariable(name: "ac", arg: 1, scope: !906, file: !3, line: 265, type: !113)
!906 = distinct !DISubprogram(name: "__redisRunCallback", scope: !3, file: !3, line: 265, type: !907, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !113, !234, !13}
!909 = !{!905, !910, !911, !912}
!910 = !DILocalVariable(name: "cb", arg: 2, scope: !906, file: !3, line: 265, type: !234)
!911 = !DILocalVariable(name: "reply", arg: 3, scope: !906, file: !3, line: 265, type: !13)
!912 = !DILocalVariable(name: "c", scope: !906, file: !3, line: 266, type: !279)
!913 = !DILocation(line: 265, column: 51, scope: !906, inlinedAt: !914)
!914 = distinct !DILocation(line: 283, column: 9, scope: !838)
!915 = !DILocation(line: 265, column: 70, scope: !906, inlinedAt: !914)
!916 = !DILocation(line: 265, column: 86, scope: !906, inlinedAt: !914)
!917 = !DILocation(line: 267, column: 13, scope: !918, inlinedAt: !914)
!918 = distinct !DILexicalBlock(scope: !906, file: !3, line: 267, column: 9)
!919 = !{!880, !316, i64 8}
!920 = !DILocation(line: 267, column: 16, scope: !918, inlinedAt: !914)
!921 = !DILocation(line: 267, column: 9, scope: !906, inlinedAt: !914)
!922 = !DILocation(line: 266, column: 19, scope: !906, inlinedAt: !914)
!923 = !DILocation(line: 268, column: 18, scope: !924, inlinedAt: !914)
!924 = distinct !DILexicalBlock(scope: !918, file: !3, line: 267, column: 25)
!925 = !DILocation(line: 269, column: 29, scope: !924, inlinedAt: !914)
!926 = !{!880, !316, i64 16}
!927 = !DILocation(line: 269, column: 9, scope: !924, inlinedAt: !914)
!928 = !DILocation(line: 270, column: 18, scope: !924, inlinedAt: !914)
!929 = !DILocation(line: 271, column: 5, scope: !924, inlinedAt: !914)
!930 = !DILocation(line: 272, column: 1, scope: !906, inlinedAt: !914)
!931 = distinct !{!931, !857, !932}
!932 = !DILocation(line: 283, column: 39, scope: !838)
!933 = !DILocation(line: 252, column: 26, scope: !878, inlinedAt: !893)
!934 = !DILocation(line: 252, column: 20, scope: !878, inlinedAt: !893)
!935 = !DILocation(line: 253, column: 25, scope: !883, inlinedAt: !893)
!936 = !DILocation(line: 253, column: 16, scope: !883, inlinedAt: !893)
!937 = !DILocation(line: 253, column: 13, scope: !878, inlinedAt: !893)
!938 = !DILocation(line: 254, column: 24, scope: !883, inlinedAt: !893)
!939 = !DILocation(line: 254, column: 13, scope: !883, inlinedAt: !893)
!940 = !DILocation(line: 257, column: 13, scope: !878, inlinedAt: !893)
!941 = !DILocation(line: 258, column: 27, scope: !901, inlinedAt: !893)
!942 = !DILocation(line: 258, column: 13, scope: !901, inlinedAt: !893)
!943 = !DILocation(line: 259, column: 9, scope: !878, inlinedAt: !893)
!944 = !DILocation(line: 260, column: 9, scope: !878, inlinedAt: !893)
!945 = !DILocation(line: 263, column: 1, scope: !861, inlinedAt: !893)
!946 = !DILocation(line: 286, column: 5, scope: !838)
!947 = !DILocation(line: 265, column: 51, scope: !906, inlinedAt: !948)
!948 = distinct !DILocation(line: 287, column: 9, scope: !838)
!949 = !DILocation(line: 265, column: 70, scope: !906, inlinedAt: !948)
!950 = !DILocation(line: 265, column: 86, scope: !906, inlinedAt: !948)
!951 = !DILocation(line: 267, column: 13, scope: !918, inlinedAt: !948)
!952 = !DILocation(line: 267, column: 16, scope: !918, inlinedAt: !948)
!953 = !DILocation(line: 267, column: 9, scope: !906, inlinedAt: !948)
!954 = !DILocation(line: 266, column: 19, scope: !906, inlinedAt: !948)
!955 = !DILocation(line: 268, column: 18, scope: !924, inlinedAt: !948)
!956 = !DILocation(line: 269, column: 29, scope: !924, inlinedAt: !948)
!957 = !DILocation(line: 269, column: 9, scope: !924, inlinedAt: !948)
!958 = !DILocation(line: 270, column: 18, scope: !924, inlinedAt: !948)
!959 = !DILocation(line: 271, column: 5, scope: !924, inlinedAt: !948)
!960 = !DILocation(line: 272, column: 1, scope: !906, inlinedAt: !948)
!961 = distinct !{!961, !946, !962}
!962 = !DILocation(line: 287, column: 39, scope: !838)
!963 = !DILocation(line: 262, column: 5, scope: !861, inlinedAt: !893)
!964 = !DILocation(line: 290, column: 34, scope: !838)
!965 = !DILocalVariable(name: "ht", arg: 1, scope: !966, file: !348, line: 258, type: !351)
!966 = distinct !DISubprogram(name: "dictGetIterator", scope: !348, file: !348, line: 258, type: !967, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !969)
!967 = !DISubroutineType(types: !968)
!968 = !{!844, !351}
!969 = !{!965, !970}
!970 = !DILocalVariable(name: "iter", scope: !966, file: !348, line: 259, type: !844)
!971 = !DILocation(line: 258, column: 44, scope: !966, inlinedAt: !972)
!972 = distinct !DILocation(line: 290, column: 10, scope: !838)
!973 = !DILocation(line: 259, column: 26, scope: !966, inlinedAt: !972)
!974 = !DILocation(line: 259, column: 19, scope: !966, inlinedAt: !972)
!975 = !DILocation(line: 261, column: 14, scope: !966, inlinedAt: !972)
!976 = !{!977, !316, i64 0}
!977 = !{!"dictIterator", !316, i64 0, !313, i64 8, !316, i64 16, !316, i64 24}
!978 = !DILocation(line: 262, column: 11, scope: !966, inlinedAt: !972)
!979 = !DILocation(line: 262, column: 17, scope: !966, inlinedAt: !972)
!980 = !{!977, !313, i64 8}
!981 = !DILocation(line: 263, column: 11, scope: !966, inlinedAt: !972)
!982 = !DILocation(line: 264, column: 11, scope: !966, inlinedAt: !972)
!983 = !DILocation(line: 263, column: 17, scope: !966, inlinedAt: !972)
!984 = !DILocation(line: 265, column: 5, scope: !966, inlinedAt: !972)
!985 = !DILocation(line: 278, column: 19, scope: !838)
!986 = !DILocation(line: 291, column: 5, scope: !838)
!987 = !DILocation(line: 270, column: 19, scope: !988, inlinedAt: !995)
!988 = distinct !DILexicalBlock(scope: !989, file: !348, line: 270, column: 13)
!989 = distinct !DILexicalBlock(scope: !990, file: !348, line: 269, column: 15)
!990 = distinct !DISubprogram(name: "dictNext", scope: !348, file: !348, line: 268, type: !991, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{!258, !844}
!993 = !{!994}
!994 = !DILocalVariable(name: "iter", arg: 1, scope: !990, file: !348, line: 268, type: !844)
!995 = distinct !DILocation(line: 291, column: 18, scope: !838)
!996 = !DILocation(line: 268, column: 42, scope: !990, inlinedAt: !995)
!997 = !DILocation(line: 269, column: 5, scope: !990, inlinedAt: !995)
!998 = !DILocation(line: 270, column: 25, scope: !988, inlinedAt: !995)
!999 = !DILocation(line: 270, column: 13, scope: !989, inlinedAt: !995)
!1000 = !DILocation(line: 271, column: 24, scope: !1001, inlinedAt: !995)
!1001 = distinct !DILexicalBlock(scope: !988, file: !348, line: 270, column: 34)
!1002 = !DILocation(line: 273, column: 35, scope: !1003, inlinedAt: !995)
!1003 = distinct !DILexicalBlock(scope: !1001, file: !348, line: 272, column: 17)
!1004 = !DILocation(line: 273, column: 39, scope: !1003, inlinedAt: !995)
!1005 = !{!382, !383, i64 16}
!1006 = !DILocation(line: 273, column: 21, scope: !1003, inlinedAt: !995)
!1007 = !DILocation(line: 272, column: 29, scope: !1003, inlinedAt: !995)
!1008 = !DILocation(line: 272, column: 17, scope: !1001, inlinedAt: !995)
!1009 = !DILocation(line: 274, column: 37, scope: !1001, inlinedAt: !995)
!1010 = !DILocation(line: 274, column: 27, scope: !1001, inlinedAt: !995)
!1011 = !DILocation(line: 275, column: 9, scope: !1001, inlinedAt: !995)
!1012 = !DILocation(line: 0, scope: !838)
!1013 = !{!977, !316, i64 16}
!1014 = !DILocation(line: 278, column: 13, scope: !1015, inlinedAt: !995)
!1015 = distinct !DILexicalBlock(scope: !989, file: !348, line: 278, column: 13)
!1016 = !DILocation(line: 278, column: 13, scope: !989, inlinedAt: !995)
!1017 = distinct !{!1017, !1018, !1019}
!1018 = !DILocation(line: 269, column: 5, scope: !990)
!1019 = !DILocation(line: 284, column: 5, scope: !990)
!1020 = !DILocation(line: 285, column: 5, scope: !990, inlinedAt: !995)
!1021 = !DILocation(line: 286, column: 1, scope: !990, inlinedAt: !995)
!1022 = !DILocation(line: 279, column: 16, scope: !838)
!1023 = !DILocalVariable(name: "iter", arg: 1, scope: !1024, file: !348, line: 288, type: !844)
!1024 = distinct !DISubprogram(name: "dictReleaseIterator", scope: !348, file: !348, line: 288, type: !1025, isLocal: true, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !844}
!1027 = !{!1023}
!1028 = !DILocation(line: 288, column: 47, scope: !1024, inlinedAt: !1029)
!1029 = distinct !DILocation(line: 293, column: 5, scope: !838)
!1030 = !DILocation(line: 289, column: 5, scope: !1024, inlinedAt: !1029)
!1031 = !DILocation(line: 290, column: 1, scope: !1024, inlinedAt: !1029)
!1032 = !DILocation(line: 294, column: 25, scope: !838)
!1033 = !DILocation(line: 294, column: 5, scope: !838)
!1034 = !DILocation(line: 296, column: 34, scope: !838)
!1035 = !DILocation(line: 258, column: 44, scope: !966, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 296, column: 10, scope: !838)
!1037 = !DILocation(line: 259, column: 26, scope: !966, inlinedAt: !1036)
!1038 = !DILocation(line: 259, column: 19, scope: !966, inlinedAt: !1036)
!1039 = !DILocation(line: 261, column: 14, scope: !966, inlinedAt: !1036)
!1040 = !DILocation(line: 262, column: 11, scope: !966, inlinedAt: !1036)
!1041 = !DILocation(line: 262, column: 17, scope: !966, inlinedAt: !1036)
!1042 = !DILocation(line: 263, column: 11, scope: !966, inlinedAt: !1036)
!1043 = !DILocation(line: 264, column: 11, scope: !966, inlinedAt: !1036)
!1044 = !DILocation(line: 263, column: 17, scope: !966, inlinedAt: !1036)
!1045 = !DILocation(line: 265, column: 5, scope: !966, inlinedAt: !1036)
!1046 = !DILocation(line: 297, column: 5, scope: !838)
!1047 = !DILocation(line: 281, column: 44, scope: !1048, inlinedAt: !995)
!1048 = distinct !DILexicalBlock(scope: !1015, file: !348, line: 278, column: 26)
!1049 = !{!1050, !316, i64 16}
!1050 = !{!"dictEntry", !316, i64 0, !316, i64 8, !316, i64 16}
!1051 = !DILocation(line: 281, column: 29, scope: !1048, inlinedAt: !995)
!1052 = !{!977, !316, i64 24}
!1053 = !DILocation(line: 282, column: 13, scope: !1048, inlinedAt: !995)
!1054 = !DILocation(line: 292, column: 31, scope: !838)
!1055 = !{!1050, !316, i64 8}
!1056 = !DILocation(line: 265, column: 51, scope: !906, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 292, column: 9, scope: !838)
!1058 = !DILocation(line: 265, column: 70, scope: !906, inlinedAt: !1057)
!1059 = !DILocation(line: 265, column: 86, scope: !906, inlinedAt: !1057)
!1060 = !DILocation(line: 267, column: 13, scope: !918, inlinedAt: !1057)
!1061 = !DILocation(line: 267, column: 16, scope: !918, inlinedAt: !1057)
!1062 = !DILocation(line: 267, column: 9, scope: !906, inlinedAt: !1057)
!1063 = !DILocation(line: 266, column: 19, scope: !906, inlinedAt: !1057)
!1064 = !DILocation(line: 268, column: 18, scope: !924, inlinedAt: !1057)
!1065 = !DILocation(line: 269, column: 29, scope: !924, inlinedAt: !1057)
!1066 = !DILocation(line: 269, column: 9, scope: !924, inlinedAt: !1057)
!1067 = !DILocation(line: 270, column: 18, scope: !924, inlinedAt: !1057)
!1068 = !DILocation(line: 271, column: 5, scope: !924, inlinedAt: !1057)
!1069 = !DILocation(line: 272, column: 1, scope: !906, inlinedAt: !1057)
!1070 = distinct !{!1070, !986, !1071}
!1071 = !DILocation(line: 292, column: 55, scope: !838)
!1072 = !DILocation(line: 270, column: 19, scope: !988, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 297, column: 18, scope: !838)
!1074 = !DILocation(line: 268, column: 42, scope: !990, inlinedAt: !1073)
!1075 = !DILocation(line: 269, column: 5, scope: !990, inlinedAt: !1073)
!1076 = !DILocation(line: 270, column: 25, scope: !988, inlinedAt: !1073)
!1077 = !DILocation(line: 270, column: 13, scope: !989, inlinedAt: !1073)
!1078 = !DILocation(line: 271, column: 24, scope: !1001, inlinedAt: !1073)
!1079 = !DILocation(line: 273, column: 35, scope: !1003, inlinedAt: !1073)
!1080 = !DILocation(line: 273, column: 39, scope: !1003, inlinedAt: !1073)
!1081 = !DILocation(line: 273, column: 21, scope: !1003, inlinedAt: !1073)
!1082 = !DILocation(line: 272, column: 29, scope: !1003, inlinedAt: !1073)
!1083 = !DILocation(line: 272, column: 17, scope: !1001, inlinedAt: !1073)
!1084 = !DILocation(line: 274, column: 37, scope: !1001, inlinedAt: !1073)
!1085 = !DILocation(line: 274, column: 27, scope: !1001, inlinedAt: !1073)
!1086 = !DILocation(line: 275, column: 9, scope: !1001, inlinedAt: !1073)
!1087 = !DILocation(line: 278, column: 13, scope: !1015, inlinedAt: !1073)
!1088 = !DILocation(line: 278, column: 13, scope: !989, inlinedAt: !1073)
!1089 = !DILocation(line: 285, column: 5, scope: !990, inlinedAt: !1073)
!1090 = !DILocation(line: 286, column: 1, scope: !990, inlinedAt: !1073)
!1091 = !DILocation(line: 288, column: 47, scope: !1024, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 299, column: 5, scope: !838)
!1093 = !DILocation(line: 289, column: 5, scope: !1024, inlinedAt: !1092)
!1094 = !DILocation(line: 290, column: 1, scope: !1024, inlinedAt: !1092)
!1095 = !DILocation(line: 300, column: 25, scope: !838)
!1096 = !DILocation(line: 300, column: 5, scope: !838)
!1097 = !DILocation(line: 303, column: 5, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 303, column: 5)
!1099 = distinct !DILexicalBlock(scope: !838, file: !3, line: 303, column: 5)
!1100 = !DILocation(line: 303, column: 5, scope: !1099)
!1101 = !DILocation(line: 281, column: 44, scope: !1048, inlinedAt: !1073)
!1102 = !DILocation(line: 281, column: 29, scope: !1048, inlinedAt: !1073)
!1103 = !DILocation(line: 282, column: 13, scope: !1048, inlinedAt: !1073)
!1104 = !DILocation(line: 298, column: 31, scope: !838)
!1105 = !DILocation(line: 265, column: 51, scope: !906, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 298, column: 9, scope: !838)
!1107 = !DILocation(line: 265, column: 70, scope: !906, inlinedAt: !1106)
!1108 = !DILocation(line: 265, column: 86, scope: !906, inlinedAt: !1106)
!1109 = !DILocation(line: 267, column: 13, scope: !918, inlinedAt: !1106)
!1110 = !DILocation(line: 267, column: 16, scope: !918, inlinedAt: !1106)
!1111 = !DILocation(line: 267, column: 9, scope: !906, inlinedAt: !1106)
!1112 = !DILocation(line: 266, column: 19, scope: !906, inlinedAt: !1106)
!1113 = !DILocation(line: 268, column: 18, scope: !924, inlinedAt: !1106)
!1114 = !DILocation(line: 269, column: 29, scope: !924, inlinedAt: !1106)
!1115 = !DILocation(line: 269, column: 9, scope: !924, inlinedAt: !1106)
!1116 = !DILocation(line: 270, column: 18, scope: !924, inlinedAt: !1106)
!1117 = !DILocation(line: 271, column: 5, scope: !924, inlinedAt: !1106)
!1118 = !DILocation(line: 272, column: 1, scope: !906, inlinedAt: !1106)
!1119 = distinct !{!1119, !1046, !1120}
!1120 = !DILocation(line: 298, column: 55, scope: !838)
!1121 = !DILocation(line: 307, column: 13, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !838, file: !3, line: 307, column: 9)
!1123 = !DILocation(line: 307, column: 9, scope: !1122)
!1124 = !DILocation(line: 307, column: 26, scope: !1122)
!1125 = !DILocation(line: 307, column: 33, scope: !1122)
!1126 = !DILocation(line: 307, column: 39, scope: !1122)
!1127 = !DILocation(line: 307, column: 9, scope: !838)
!1128 = !DILocation(line: 308, column: 22, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 308, column: 13)
!1130 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 307, column: 59)
!1131 = !DILocation(line: 308, column: 13, scope: !1130)
!1132 = !DILocation(line: 309, column: 13, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 308, column: 39)
!1134 = !DILocation(line: 310, column: 9, scope: !1133)
!1135 = !DILocation(line: 311, column: 38, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 310, column: 16)
!1137 = !DILocation(line: 311, column: 42, scope: !1136)
!1138 = !DILocation(line: 311, column: 33, scope: !1136)
!1139 = !DILocation(line: 311, column: 13, scope: !1136)
!1140 = !DILocation(line: 316, column: 5, scope: !838)
!1141 = !DILocation(line: 317, column: 1, scope: !838)
!1142 = distinct !DISubprogram(name: "redisAsyncDisconnect", scope: !3, file: !3, line: 357, type: !433, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1143)
!1143 = !{!1144, !1145}
!1144 = !DILocalVariable(name: "ac", arg: 1, scope: !1142, file: !3, line: 357, type: !113)
!1145 = !DILocalVariable(name: "c", scope: !1142, file: !3, line: 358, type: !279)
!1146 = !DILocation(line: 357, column: 46, scope: !1142)
!1147 = !DILocation(line: 358, column: 19, scope: !1142)
!1148 = !DILocation(line: 359, column: 8, scope: !1142)
!1149 = !DILocation(line: 359, column: 14, scope: !1142)
!1150 = !DILocation(line: 360, column: 20, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 360, column: 9)
!1152 = !DILocation(line: 360, column: 41, scope: !1151)
!1153 = !DILocation(line: 360, column: 56, scope: !1151)
!1154 = !{!322, !316, i64 296}
!1155 = !DILocation(line: 360, column: 61, scope: !1151)
!1156 = !DILocation(line: 360, column: 9, scope: !1142)
!1157 = !DILocalVariable(name: "ac", arg: 1, scope: !1158, file: !3, line: 331, type: !113)
!1158 = distinct !DISubprogram(name: "__redisAsyncDisconnect", scope: !3, file: !3, line: 331, type: !433, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1159)
!1159 = !{!1157, !1160}
!1160 = !DILocalVariable(name: "c", scope: !1158, file: !3, line: 332, type: !279)
!1161 = !DILocation(line: 331, column: 55, scope: !1158, inlinedAt: !1162)
!1162 = distinct !DILocation(line: 361, column: 9, scope: !1151)
!1163 = !DILocation(line: 144, column: 54, scope: !432, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 335, column: 5, scope: !1158, inlinedAt: !1162)
!1165 = !DILocation(line: 145, column: 9, scope: !432, inlinedAt: !1164)
!1166 = !DILocation(line: 148, column: 19, scope: !432, inlinedAt: !1164)
!1167 = !DILocation(line: 149, column: 18, scope: !432, inlinedAt: !1164)
!1168 = !DILocation(line: 149, column: 9, scope: !432, inlinedAt: !1164)
!1169 = !DILocation(line: 149, column: 13, scope: !432, inlinedAt: !1164)
!1170 = !DILocation(line: 150, column: 18, scope: !432, inlinedAt: !1164)
!1171 = !DILocation(line: 150, column: 9, scope: !432, inlinedAt: !1164)
!1172 = !DILocation(line: 150, column: 16, scope: !432, inlinedAt: !1164)
!1173 = !DILocation(line: 151, column: 1, scope: !432, inlinedAt: !1164)
!1174 = !DILocation(line: 337, column: 17, scope: !1175, inlinedAt: !1162)
!1175 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 337, column: 9)
!1176 = !DILocation(line: 337, column: 9, scope: !1158, inlinedAt: !1162)
!1177 = !DILocation(line: 249, column: 52, scope: !861, inlinedAt: !1178)
!1178 = distinct !DILocation(line: 339, column: 9, scope: !1179, inlinedAt: !1162)
!1179 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 337, column: 23)
!1180 = !DILocation(line: 249, column: 73, scope: !861, inlinedAt: !1178)
!1181 = !DILocation(line: 250, column: 20, scope: !861, inlinedAt: !1178)
!1182 = !DILocation(line: 251, column: 9, scope: !861, inlinedAt: !1178)
!1183 = !DILocation(line: 262, column: 5, scope: !861, inlinedAt: !1178)
!1184 = !DILocation(line: 263, column: 1, scope: !861, inlinedAt: !1178)
!1185 = !DILocation(line: 339, column: 9, scope: !1179, inlinedAt: !1162)
!1186 = !DILocation(line: 332, column: 19, scope: !1158, inlinedAt: !1162)
!1187 = !DILocation(line: 343, column: 18, scope: !1188, inlinedAt: !1162)
!1188 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 340, column: 12)
!1189 = !DILocation(line: 348, column: 5, scope: !1158, inlinedAt: !1162)
!1190 = !DILocation(line: 349, column: 1, scope: !1158, inlinedAt: !1162)
!1191 = !DILocation(line: 361, column: 9, scope: !1151)
!1192 = !DILocation(line: 362, column: 1, scope: !1142)
!1193 = distinct !DISubprogram(name: "redisProcessCallbacks", scope: !3, file: !3, line: 411, type: !433, isLocal: false, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199}
!1195 = !DILocalVariable(name: "ac", arg: 1, scope: !1193, file: !3, line: 411, type: !113)
!1196 = !DILocalVariable(name: "c", scope: !1193, file: !3, line: 412, type: !279)
!1197 = !DILocalVariable(name: "cb", scope: !1193, file: !3, line: 413, type: !235)
!1198 = !DILocalVariable(name: "reply", scope: !1193, file: !3, line: 414, type: !12)
!1199 = !DILocalVariable(name: "status", scope: !1193, file: !3, line: 415, type: !18)
!1200 = !DILocation(line: 411, column: 47, scope: !1193)
!1201 = !DILocation(line: 412, column: 29, scope: !1193)
!1202 = !DILocation(line: 412, column: 19, scope: !1193)
!1203 = !DILocation(line: 413, column: 5, scope: !1193)
!1204 = !DILocation(line: 413, column: 19, scope: !1193)
!1205 = !DILocation(line: 414, column: 5, scope: !1193)
!1206 = !DILocation(line: 414, column: 11, scope: !1193)
!1207 = !DILocation(line: 417, column: 5, scope: !1193)
!1208 = !DILocation(line: 417, column: 21, scope: !1193)
!1209 = !DILocation(line: 415, column: 9, scope: !1193)
!1210 = !DILocation(line: 417, column: 46, scope: !1193)
!1211 = !DILocation(line: 418, column: 13, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 418, column: 13)
!1213 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 417, column: 59)
!1214 = !DILocation(line: 418, column: 19, scope: !1212)
!1215 = !DILocation(line: 418, column: 13, scope: !1213)
!1216 = !DILocation(line: 421, column: 20, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 421, column: 17)
!1218 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 418, column: 28)
!1219 = !DILocation(line: 421, column: 26, scope: !1217)
!1220 = !DILocation(line: 421, column: 48, scope: !1217)
!1221 = !DILocation(line: 421, column: 61, scope: !1217)
!1222 = !{!312, !316, i64 144}
!1223 = !DILocalVariable(name: "s", arg: 1, scope: !1224, file: !38, line: 86, type: !1227)
!1224 = distinct !DISubprogram(name: "sdslen", scope: !38, file: !38, line: 86, type: !1225, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1228)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!22, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!1228 = !{!1223, !1229}
!1229 = !DILocalVariable(name: "flags", scope: !1224, file: !38, line: 87, type: !36)
!1230 = !DILocation(line: 86, column: 39, scope: !1224, inlinedAt: !1231)
!1231 = distinct !DILocation(line: 421, column: 51, scope: !1217)
!1232 = !DILocation(line: 87, column: 27, scope: !1224, inlinedAt: !1231)
!1233 = !{!314, !314, i64 0}
!1234 = !DILocation(line: 87, column: 19, scope: !1224, inlinedAt: !1231)
!1235 = !DILocation(line: 88, column: 5, scope: !1224, inlinedAt: !1231)
!1236 = !DILocation(line: 90, column: 20, scope: !1237, inlinedAt: !1231)
!1237 = distinct !DILexicalBlock(scope: !1224, file: !38, line: 88, column: 33)
!1238 = !DILocation(line: 90, column: 13, scope: !1237, inlinedAt: !1231)
!1239 = !DILocation(line: 92, column: 20, scope: !1237, inlinedAt: !1231)
!1240 = !DILocation(line: 92, column: 34, scope: !1237, inlinedAt: !1231)
!1241 = !DILocation(line: 92, column: 13, scope: !1237, inlinedAt: !1231)
!1242 = !DILocation(line: 94, column: 20, scope: !1237, inlinedAt: !1231)
!1243 = !DILocation(line: 94, column: 35, scope: !1237, inlinedAt: !1231)
!1244 = !{!1245, !1245, i64 0}
!1245 = !{!"short", !314, i64 0}
!1246 = !DILocation(line: 94, column: 13, scope: !1237, inlinedAt: !1231)
!1247 = !DILocation(line: 96, column: 20, scope: !1237, inlinedAt: !1231)
!1248 = !DILocation(line: 96, column: 35, scope: !1237, inlinedAt: !1231)
!1249 = !{!313, !313, i64 0}
!1250 = !DILocation(line: 96, column: 13, scope: !1237, inlinedAt: !1231)
!1251 = !DILocation(line: 98, column: 20, scope: !1237, inlinedAt: !1231)
!1252 = !DILocation(line: 98, column: 35, scope: !1237, inlinedAt: !1231)
!1253 = !DILocation(line: 98, column: 13, scope: !1237, inlinedAt: !1231)
!1254 = !DILocation(line: 100, column: 5, scope: !1224, inlinedAt: !1231)
!1255 = !DILocation(line: 101, column: 1, scope: !1224, inlinedAt: !1231)
!1256 = !DILocation(line: 422, column: 17, scope: !1217)
!1257 = !DILocation(line: 0, scope: !1237, inlinedAt: !1231)
!1258 = !DILocation(line: 0, scope: !1217)
!1259 = !DILocation(line: 421, column: 67, scope: !1217)
!1260 = !DILocation(line: 422, column: 32, scope: !1217)
!1261 = !DILocation(line: 422, column: 37, scope: !1217)
!1262 = !DILocation(line: 421, column: 17, scope: !1218)
!1263 = !DILocation(line: 331, column: 55, scope: !1158, inlinedAt: !1264)
!1264 = distinct !DILocation(line: 423, column: 17, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1217, file: !3, line: 422, column: 46)
!1266 = !DILocation(line: 144, column: 54, scope: !432, inlinedAt: !1267)
!1267 = distinct !DILocation(line: 335, column: 5, scope: !1158, inlinedAt: !1264)
!1268 = !DILocation(line: 145, column: 9, scope: !432, inlinedAt: !1267)
!1269 = !DILocation(line: 148, column: 19, scope: !432, inlinedAt: !1267)
!1270 = !DILocation(line: 149, column: 18, scope: !432, inlinedAt: !1267)
!1271 = !DILocation(line: 149, column: 9, scope: !432, inlinedAt: !1267)
!1272 = !DILocation(line: 149, column: 13, scope: !432, inlinedAt: !1267)
!1273 = !DILocation(line: 150, column: 18, scope: !432, inlinedAt: !1267)
!1274 = !DILocation(line: 150, column: 9, scope: !432, inlinedAt: !1267)
!1275 = !DILocation(line: 150, column: 16, scope: !432, inlinedAt: !1267)
!1276 = !DILocation(line: 151, column: 1, scope: !432, inlinedAt: !1267)
!1277 = !DILocation(line: 337, column: 17, scope: !1175, inlinedAt: !1264)
!1278 = !DILocation(line: 337, column: 9, scope: !1158, inlinedAt: !1264)
!1279 = !DILocation(line: 249, column: 52, scope: !861, inlinedAt: !1280)
!1280 = distinct !DILocation(line: 339, column: 9, scope: !1179, inlinedAt: !1264)
!1281 = !DILocation(line: 249, column: 73, scope: !861, inlinedAt: !1280)
!1282 = !DILocation(line: 250, column: 20, scope: !861, inlinedAt: !1280)
!1283 = !DILocation(line: 251, column: 9, scope: !861, inlinedAt: !1280)
!1284 = !DILocation(line: 262, column: 5, scope: !861, inlinedAt: !1280)
!1285 = !DILocation(line: 263, column: 1, scope: !861, inlinedAt: !1280)
!1286 = !DILocation(line: 339, column: 9, scope: !1179, inlinedAt: !1264)
!1287 = !DILocation(line: 332, column: 19, scope: !1158, inlinedAt: !1264)
!1288 = !DILocation(line: 343, column: 18, scope: !1188, inlinedAt: !1264)
!1289 = !DILocation(line: 348, column: 5, scope: !1158, inlinedAt: !1264)
!1290 = !DILocation(line: 349, column: 1, scope: !1158, inlinedAt: !1264)
!1291 = !DILocation(line: 424, column: 17, scope: !1265)
!1292 = !DILocation(line: 428, column: 25, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 428, column: 16)
!1294 = !DILocation(line: 428, column: 16, scope: !1218)
!1295 = !DILocalVariable(name: "list", arg: 1, scope: !1296, file: !3, line: 227, type: !864)
!1296 = distinct !DISubprogram(name: "__redisPushCallback", scope: !3, file: !3, line: 227, type: !862, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1297)
!1297 = !{!1295, !1298, !1299}
