; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/atoi.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/atoi.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @atoi(i8*) local_unnamed_addr #0 !dbg !9 {
  %2 = tail call i64 @strtol(i8* %0, i8** null, i32 10) #3, !dbg !18
  %3 = trunc i64 %2 to i32, !dbg !19
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !20
  ret i32 %3, !dbg !20
}

; Function Attrs: noredzone
declare dso_local i64 @strtol(i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: noredzone nounwind
define dso_local i32 @_atoi_r(%struct._reent*, i8*) local_unnamed_addr #0 !dbg !21 {
  %3 = tail call i64 @_strtol_r(%struct._reent* %0, i8* %1, i8** null, i32 10) #3, !dbg !244
  %4 = trunc i64 %3 to i32, !dbg !245
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !246
  ret i32 %4, !dbg !246
}

; Function Attrs: noredzone
declare dso_local i64 @_strtol_r(%struct._reent*, i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.module.flags = !{!5, !6, !7}
!llvm.ident = !{!8}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/atoi.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!9 = distinct !DISubprogram(name: "atoi", scope: !1, file: !1, line: 67, type: !10, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !15)
!10 = !DISubroutineType(types: !11)
!11 = !{!4, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !{!16}
!16 = !DILocalVariable(name: "s", arg: 1, scope: !9, file: !1, line: 67, type: !12)
!17 = !DILocation(line: 67, column: 1, scope: !9)
!18 = !DILocation(line: 70, column: 16, scope: !9)
!19 = !DILocation(line: 70, column: 10, scope: !9)
!20 = !DILocation(line: 70, column: 3, scope: !9)
!21 = distinct !DISubprogram(name: "_atoi_r", scope: !1, file: !1, line: 75, type: !22, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !240)
!22 = !DISubroutineType(types: !23)
!23 = !{!4, !24, !12}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !26, line: 569, size: 14912, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !29, !108, !109, !110, !111, !115, !116, !119, !120, !124, !136, !137, !138, !140, !141, !142, !204, !225, !226, !231, !238}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !25, file: !26, line: 571, baseType: !4, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !25, file: !26, line: 576, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !26, line: 287, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !26, line: 181, size: 1408, elements: !33)
!33 = !{!34, !37, !38, !39, !41, !42, !47, !48, !50, !58, !62, !67, !71, !72, !73, !74, !78, !82, !83, !84, !86, !87, !91, !107}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !32, file: !26, line: 182, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !32, file: !26, line: 183, baseType: !4, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !32, file: !26, line: 184, baseType: !4, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !26, line: 185, baseType: !40, size: 16, offset: 128)
!40 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !32, file: !26, line: 186, baseType: !40, size: 16, offset: 144)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !32, file: !26, line: 187, baseType: !43, size: 128, offset: 192)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !26, line: 117, size: 128, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !43, file: !26, line: 118, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !43, file: !26, line: 119, baseType: !4, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !32, file: !26, line: 188, baseType: !4, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !32, file: !26, line: 195, baseType: !49, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !32, file: !26, line: 197, baseType: !51, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !24, !49, !57, !4}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !55, line: 145, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !32, file: !26, line: 199, baseType: !59, size: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!54, !24, !49, !12, !4}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !32, file: !26, line: 202, baseType: !63, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !24, !49, !66, !4}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !55, line: 114, baseType: !56)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !32, file: !26, line: 203, baseType: !68, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!4, !24, !49}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !32, file: !26, line: 206, baseType: !43, size: 128, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !32, file: !26, line: 207, baseType: !35, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !32, file: !26, line: 208, baseType: !4, size: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !32, file: !26, line: 211, baseType: !75, size: 24, offset: 928)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 24, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !32, file: !26, line: 212, baseType: !79, size: 8, offset: 952)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !32, file: !26, line: 215, baseType: !43, size: 128, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !32, file: !26, line: 218, baseType: !4, size: 32, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !26, line: 219, baseType: !85, size: 64, offset: 1152)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !55, line: 44, baseType: !56)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !32, file: !26, line: 222, baseType: !24, size: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !26, line: 226, baseType: !88, size: 32, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !55, line: 175, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !90, line: 12, baseType: !4)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !32, file: !26, line: 228, baseType: !92, size: 64, offset: 1312)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !55, line: 171, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 163, size: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !93, file: !55, line: 165, baseType: !4, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !93, file: !55, line: 170, baseType: !97, size: 32, offset: 32)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !93, file: !55, line: 166, size: 32, elements: !98)
!98 = !{!99, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !97, file: !55, line: 168, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !101, line: 124, baseType: !102)
!101 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !97, file: !55, line: 169, baseType: !104, size: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !26, line: 229, baseType: !4, size: 32, offset: 1376)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !25, file: !26, line: 576, baseType: !30, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !25, file: !26, line: 576, baseType: !30, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !25, file: !26, line: 578, baseType: !4, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !25, file: !26, line: 579, baseType: !112, size: 200, offset: 288)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 200, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !25, file: !26, line: 582, baseType: !4, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !25, file: !26, line: 583, baseType: !117, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !26, line: 40, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !25, file: !26, line: 585, baseType: !4, size: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !25, file: !26, line: 587, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !24}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !25, file: !26, line: 590, baseType: !125, size: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !26, line: 47, size: 256, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !126, file: !26, line: 49, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !126, file: !26, line: 50, baseType: !4, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !126, file: !26, line: 50, baseType: !4, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !126, file: !26, line: 50, baseType: !4, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !126, file: !26, line: 50, baseType: !4, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !126, file: !26, line: 51, baseType: !134, size: 32, offset: 192)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 32, elements: !80)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !26, line: 25, baseType: !102)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !25, file: !26, line: 591, baseType: !4, size: 32, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !25, file: !26, line: 592, baseType: !125, size: 64, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !25, file: !26, line: 593, baseType: !139, size: 64, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !25, file: !26, line: 596, baseType: !4, size: 32, offset: 1024)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !25, file: !26, line: 597, baseType: !57, size: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !25, file: !26, line: 632, baseType: !143, size: 2880, offset: 1152)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !26, line: 599, size: 2880, elements: !144)
!144 = !{!145, !195}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !143, file: !26, line: 622, baseType: !146, size: 1728)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !26, line: 601, size: 1728, elements: !147)
!147 = !{!148, !149, !150, !154, !166, !167, !169, !177, !178, !179, !180, !184, !188, !189, !190, !191, !192, !193, !194}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !146, file: !26, line: 603, baseType: !102, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !146, file: !26, line: 604, baseType: !57, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !146, file: !26, line: 605, baseType: !151, size: 208, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 208, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 26)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !146, file: !26, line: 606, baseType: !155, size: 288, offset: 352)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !26, line: 55, size: 288, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !155, file: !26, line: 57, baseType: !4, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !155, file: !26, line: 58, baseType: !4, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !155, file: !26, line: 59, baseType: !4, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !155, file: !26, line: 60, baseType: !4, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !155, file: !26, line: 61, baseType: !4, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !155, file: !26, line: 62, baseType: !4, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !155, file: !26, line: 63, baseType: !4, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !155, file: !26, line: 64, baseType: !4, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !155, file: !26, line: 65, baseType: !4, size: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !146, file: !26, line: 607, baseType: !4, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !146, file: !26, line: 608, baseType: !168, size: 64, offset: 704)
!168 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !146, file: !26, line: 609, baseType: !170, size: 112, offset: 768)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !26, line: 319, size: 112, elements: !171)
!171 = !{!172, !175, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !170, file: !26, line: 320, baseType: !173, size: 48)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 48, elements: !76)
!174 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !170, file: !26, line: 321, baseType: !173, size: 48, offset: 48)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !170, file: !26, line: 322, baseType: !174, size: 16, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !146, file: !26, line: 610, baseType: !92, size: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !146, file: !26, line: 611, baseType: !92, size: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !146, file: !26, line: 612, baseType: !92, size: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !146, file: !26, line: 613, baseType: !181, size: 64, offset: 1088)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !146, file: !26, line: 614, baseType: !185, size: 192, offset: 1152)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 24)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !146, file: !26, line: 615, baseType: !4, size: 32, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !146, file: !26, line: 616, baseType: !92, size: 64, offset: 1376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !146, file: !26, line: 617, baseType: !92, size: 64, offset: 1440)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !146, file: !26, line: 618, baseType: !92, size: 64, offset: 1504)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !146, file: !26, line: 619, baseType: !92, size: 64, offset: 1568)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !146, file: !26, line: 620, baseType: !92, size: 64, offset: 1632)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !146, file: !26, line: 621, baseType: !4, size: 32, offset: 1696)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !143, file: !26, line: 631, baseType: !196, size: 2880)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !26, line: 626, size: 2880, elements: !197)
!197 = !{!198, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !196, file: !26, line: 629, baseType: !199, size: 1920)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1920, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 30)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !196, file: !26, line: 630, baseType: !203, size: 960, offset: 1920)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 960, elements: !200)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !25, file: !26, line: 636, baseType: !205, size: 64, offset: 4032)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !26, line: 93, size: 6336, elements: !207)
!207 = !{!208, !209, !210, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !206, file: !26, line: 94, baseType: !205, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !206, file: !26, line: 95, baseType: !4, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !206, file: !26, line: 97, baseType: !211, size: 2048, offset: 128)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 2048, elements: !215)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null}
!215 = !{!216}
!216 = !DISubrange(count: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !206, file: !26, line: 98, baseType: !218, size: 4160, offset: 2176)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !26, line: 74, size: 4160, elements: !219)
!219 = !{!220, !222, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !218, file: !26, line: 75, baseType: !221, size: 2048)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2048, elements: !215)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !218, file: !26, line: 76, baseType: !221, size: 2048, offset: 2048)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !218, file: !26, line: 78, baseType: !135, size: 32, offset: 4096)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !218, file: !26, line: 81, baseType: !135, size: 32, offset: 4128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !25, file: !26, line: 637, baseType: !206, size: 6336, offset: 4096)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !25, file: !26, line: 641, baseType: !227, size: 64, offset: 10432)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !4}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !25, file: !26, line: 646, baseType: !232, size: 192, offset: 10496)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !26, line: 291, size: 192, elements: !233)
!233 = !{!234, !236, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !232, file: !26, line: 293, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !232, file: !26, line: 294, baseType: !4, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !232, file: !26, line: 295, baseType: !30, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !25, file: !26, line: 648, baseType: !239, size: 4224, offset: 10688)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 4224, elements: !76)
!240 = !{!241, !242}
!241 = !DILocalVariable(name: "ptr", arg: 1, scope: !21, file: !1, line: 75, type: !24)
!242 = !DILocalVariable(name: "s", arg: 2, scope: !21, file: !1, line: 75, type: !12)
!243 = !DILocation(line: 75, column: 1, scope: !21)
!244 = !DILocation(line: 79, column: 16, scope: !21)
!245 = !DILocation(line: 79, column: 10, scope: !21)
!246 = !DILocation(line: 79, column: 3, scope: !21)
