; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bitops.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bitops.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bitsinbyte", scope: !2, file: !3, line: 44, type: !84, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "redisPopcount", scope: !3, file: !3, line: 40, type: !4, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !70)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bitops.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !9, line: 129, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !15, globals: !69)
!14 = !{}
!15 = !{!10, !16, !22, !24, !25, !27, !29, !6, !11, !12, !30, !33, !45, !55, !62}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 48, baseType: !19)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 79, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 60, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !20, line: 105, baseType: !10)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !18, line: 56, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !20, line: 103, baseType: !12)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 43, baseType: !23)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !35, line: 51, size: 24, elements: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !35, line: 52, baseType: !31, size: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !34, file: !35, line: 53, baseType: !31, size: 8, offset: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !35, line: 54, baseType: !23, size: 8, offset: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !34, file: !35, line: 55, baseType: !41, offset: 24)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, elements: !43)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !{!44}
!44 = !DISubrange(count: -1)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !35, line: 57, size: 40, elements: !47)
!47 = !{!48, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !35, line: 58, baseType: !49, size: 16)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 36, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 57, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !35, line: 59, baseType: !49, size: 16, offset: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !35, line: 60, baseType: !23, size: 8, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !35, line: 61, baseType: !41, offset: 40)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !35, line: 63, size: 72, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !35, line: 64, baseType: !17, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !56, file: !35, line: 65, baseType: !17, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !35, line: 66, baseType: !23, size: 8, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !35, line: 67, baseType: !41, offset: 72)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !35, line: 69, size: 136, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !35, line: 70, baseType: !25, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !63, file: !35, line: 71, baseType: !25, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !35, line: 72, baseType: !23, size: 8, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !63, file: !35, line: 73, baseType: !41, offset: 136)
!69 = !{!0}
!70 = !{!71, !72, !73, !74, !75, !76, !78, !79, !80, !81, !82, !83}
!71 = !DILocalVariable(name: "s", arg: 1, scope: !2, file: !3, line: 40, type: !11)
!72 = !DILocalVariable(name: "count", arg: 2, scope: !2, file: !3, line: 40, type: !12)
!73 = !DILocalVariable(name: "bits", scope: !2, file: !3, line: 41, type: !6)
!74 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 42, type: !22)
!75 = !DILocalVariable(name: "p4", scope: !2, file: !3, line: 43, type: !16)
!76 = !DILocalVariable(name: "aux1", scope: !77, file: !3, line: 55, type: !17)
!77 = distinct !DILexicalBlock(scope: !2, file: !3, line: 54, column: 22)
!78 = !DILocalVariable(name: "aux2", scope: !77, file: !3, line: 55, type: !17)
!79 = !DILocalVariable(name: "aux3", scope: !77, file: !3, line: 55, type: !17)
!80 = !DILocalVariable(name: "aux4", scope: !77, file: !3, line: 55, type: !17)
!81 = !DILocalVariable(name: "aux5", scope: !77, file: !3, line: 55, type: !17)
!82 = !DILocalVariable(name: "aux6", scope: !77, file: !3, line: 55, type: !17)
!83 = !DILocalVariable(name: "aux7", scope: !77, file: !3, line: 55, type: !17)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!86 = !{!87}
!87 = !DISubrange(count: 256)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!92 = !DILocation(line: 40, column: 28, scope: !2)
!93 = !DILocation(line: 40, column: 36, scope: !2)
!94 = !DILocation(line: 41, column: 12, scope: !2)
!95 = !DILocation(line: 42, column: 20, scope: !2)
!96 = !DILocation(line: 47, column: 5, scope: !2)
!97 = !DILocation(line: 47, column: 11, scope: !2)
!98 = !DILocation(line: 47, column: 28, scope: !2)
!99 = !DILocation(line: 47, column: 32, scope: !2)
!100 = !DILocation(line: 48, column: 30, scope: !101)
!101 = distinct !DILexicalBlock(scope: !2, file: !3, line: 47, column: 42)
!102 = !DILocation(line: 48, column: 28, scope: !101)
!103 = !{!104, !104, i64 0}
!104 = !{!"omnipotent char", !105, i64 0}
!105 = !{!"Simple C/C++ TBAA"}
!106 = !DILocation(line: 48, column: 17, scope: !101)
!107 = !DILocation(line: 48, column: 14, scope: !101)
!108 = !DILocation(line: 49, column: 14, scope: !101)
!109 = distinct !{!109, !96, !110}
!110 = !DILocation(line: 50, column: 5, scope: !2)
!111 = !DILocation(line: 0, scope: !101)
!112 = !DILocation(line: 53, column: 10, scope: !2)
!113 = !DILocation(line: 43, column: 15, scope: !2)
!114 = !DILocation(line: 54, column: 5, scope: !2)
!115 = !DILocation(line: 54, column: 16, scope: !2)
!116 = !DILocation(line: 57, column: 19, scope: !77)
!117 = !DILocation(line: 55, column: 18, scope: !77)
!118 = !DILocation(line: 55, column: 24, scope: !77)
!119 = !DILocation(line: 55, column: 30, scope: !77)
!120 = !DILocation(line: 60, column: 19, scope: !77)
!121 = !DILocation(line: 57, column: 16, scope: !77)
!122 = !{!123, !123, i64 0}
!123 = !{!"int", !104, i64 0}
!124 = !DILocation(line: 55, column: 36, scope: !77)
!125 = !DILocation(line: 61, column: 19, scope: !77)
!126 = !DILocation(line: 61, column: 16, scope: !77)
!127 = !DILocation(line: 55, column: 42, scope: !77)
!128 = !DILocation(line: 62, column: 19, scope: !77)
!129 = !DILocation(line: 62, column: 16, scope: !77)
!130 = !DILocation(line: 55, column: 48, scope: !77)
!131 = !DILocation(line: 63, column: 19, scope: !77)
!132 = !DILocation(line: 63, column: 16, scope: !77)
!133 = !DILocation(line: 55, column: 54, scope: !77)
!134 = !DILocation(line: 64, column: 15, scope: !77)
!135 = !DILocation(line: 66, column: 30, scope: !77)
!136 = !DILocation(line: 66, column: 36, scope: !77)
!137 = !DILocation(line: 66, column: 21, scope: !77)
!138 = !DILocation(line: 67, column: 22, scope: !77)
!139 = !DILocation(line: 67, column: 45, scope: !77)
!140 = !DILocation(line: 67, column: 51, scope: !77)
!141 = !DILocation(line: 67, column: 36, scope: !77)
!142 = !DILocation(line: 74, column: 30, scope: !77)
!143 = !DILocation(line: 74, column: 36, scope: !77)
!144 = !DILocation(line: 74, column: 21, scope: !77)
!145 = !DILocation(line: 75, column: 22, scope: !77)
!146 = !DILocation(line: 75, column: 45, scope: !77)
!147 = !DILocation(line: 75, column: 51, scope: !77)
!148 = !DILocation(line: 75, column: 36, scope: !77)
!149 = !DILocation(line: 76, column: 30, scope: !77)
!150 = !DILocation(line: 76, column: 36, scope: !77)
!151 = !DILocation(line: 76, column: 21, scope: !77)
!152 = !DILocation(line: 77, column: 22, scope: !77)
!153 = !DILocation(line: 77, column: 45, scope: !77)
!154 = !DILocation(line: 77, column: 51, scope: !77)
!155 = !DILocation(line: 77, column: 36, scope: !77)
!156 = !DILocation(line: 78, column: 30, scope: !77)
!157 = !DILocation(line: 78, column: 36, scope: !77)
!158 = !DILocation(line: 78, column: 21, scope: !77)
!159 = !DILocation(line: 79, column: 22, scope: !77)
!160 = !DILocation(line: 79, column: 45, scope: !77)
!161 = !DILocation(line: 79, column: 51, scope: !77)
!162 = !DILocation(line: 79, column: 36, scope: !77)
!163 = !DILocation(line: 80, column: 34, scope: !77)
!164 = !DILocation(line: 80, column: 26, scope: !77)
!165 = !DILocation(line: 80, column: 41, scope: !77)
!166 = !DILocation(line: 84, column: 36, scope: !77)
!167 = !DILocation(line: 84, column: 28, scope: !77)
!168 = !DILocation(line: 84, column: 43, scope: !77)
!169 = !DILocation(line: 85, column: 36, scope: !77)
!170 = !DILocation(line: 85, column: 28, scope: !77)
!171 = !DILocation(line: 85, column: 43, scope: !77)
!172 = !DILocation(line: 86, column: 36, scope: !77)
!173 = !DILocation(line: 86, column: 28, scope: !77)
!174 = !DILocation(line: 86, column: 43, scope: !77)
!175 = !DILocation(line: 85, column: 57, scope: !77)
!176 = !DILocation(line: 86, column: 57, scope: !77)
!177 = !DILocation(line: 86, column: 71, scope: !77)
!178 = !DILocation(line: 80, column: 17, scope: !77)
!179 = !DILocation(line: 80, column: 14, scope: !77)
!180 = distinct !{!180, !114, !181}
!181 = !DILocation(line: 87, column: 5, scope: !2)
!182 = !DILocation(line: 89, column: 9, scope: !2)
!183 = !DILocation(line: 0, scope: !77)
!184 = !DILocation(line: 90, column: 5, scope: !2)
!185 = !DILocation(line: 90, column: 16, scope: !2)
!186 = !DILocation(line: 90, column: 41, scope: !2)
!187 = !DILocation(line: 90, column: 39, scope: !2)
!188 = !DILocation(line: 90, column: 28, scope: !2)
!189 = !DILocation(line: 90, column: 25, scope: !2)
!190 = distinct !{!190, !191}
!191 = !{!"llvm.loop.unroll.disable"}
!192 = distinct !{!192, !184, !193}
!193 = !DILocation(line: 90, column: 43, scope: !2)
!194 = !DILocation(line: 0, scope: !2)
!195 = !DILocation(line: 91, column: 5, scope: !2)
!196 = distinct !DISubprogram(name: "redisBitpos", scope: !3, file: !3, line: 101, type: !197, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !200)
!197 = !DISubroutineType(types: !198)
!198 = !{!12, !11, !10, !199}
!199 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!201 = !DILocalVariable(name: "s", arg: 1, scope: !196, file: !3, line: 101, type: !11)
!202 = !DILocalVariable(name: "count", arg: 2, scope: !196, file: !3, line: 101, type: !10)
!203 = !DILocalVariable(name: "bit", arg: 3, scope: !196, file: !3, line: 101, type: !199)
!204 = !DILocalVariable(name: "l", scope: !196, file: !3, line: 102, type: !24)
!205 = !DILocalVariable(name: "c", scope: !196, file: !3, line: 103, type: !22)
!206 = !DILocalVariable(name: "skipval", scope: !196, file: !3, line: 104, type: !10)
!207 = !DILocalVariable(name: "word", scope: !196, file: !3, line: 104, type: !10)
!208 = !DILocalVariable(name: "one", scope: !196, file: !3, line: 104, type: !10)
!209 = !DILocalVariable(name: "pos", scope: !196, file: !3, line: 105, type: !12)
!210 = !DILocalVariable(name: "j", scope: !196, file: !3, line: 106, type: !10)
!211 = !DILocalVariable(name: "found", scope: !196, file: !3, line: 107, type: !199)
!212 = !DILocation(line: 101, column: 24, scope: !196)
!213 = !DILocation(line: 101, column: 41, scope: !196)
!214 = !DILocation(line: 101, column: 52, scope: !196)
!215 = !DILocation(line: 104, column: 28, scope: !196)
!216 = !DILocation(line: 105, column: 10, scope: !196)
!217 = !DILocation(line: 119, column: 15, scope: !196)
!218 = !DILocation(line: 104, column: 19, scope: !196)
!219 = !DILocation(line: 103, column: 20, scope: !196)
!220 = !DILocation(line: 107, column: 9, scope: !196)
!221 = !DILocation(line: 122, column: 5, scope: !196)
!222 = !DILocation(line: 122, column: 11, scope: !196)
!223 = !DILocation(line: 122, column: 28, scope: !196)
!224 = !DILocation(line: 122, column: 45, scope: !196)
!225 = !DILocation(line: 123, column: 13, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !3, line: 123, column: 13)
!227 = distinct !DILexicalBlock(scope: !196, file: !3, line: 122, column: 55)
!228 = !DILocation(line: 123, column: 16, scope: !226)
!229 = !DILocation(line: 123, column: 13, scope: !227)
!230 = !DILocation(line: 125, column: 13, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !3, line: 123, column: 28)
!232 = !DILocation(line: 133, column: 9, scope: !196)
!233 = !DILocation(line: 102, column: 20, scope: !196)
!234 = !DILocation(line: 134, column: 9, scope: !196)
!235 = !DILocation(line: 127, column: 10, scope: !227)
!236 = !DILocation(line: 128, column: 14, scope: !227)
!237 = !DILocation(line: 129, column: 13, scope: !227)
!238 = distinct !{!238, !221, !239}
!239 = !DILocation(line: 130, column: 5, scope: !196)
!240 = !DILocation(line: 0, scope: !227)
!241 = !DILocation(line: 135, column: 19, scope: !242)
!242 = distinct !DILexicalBlock(scope: !243, file: !3, line: 134, column: 17)
!243 = distinct !DILexicalBlock(scope: !196, file: !3, line: 134, column: 9)
!244 = !DILocation(line: 136, column: 9, scope: !242)
!245 = !DILocation(line: 136, column: 22, scope: !242)
!246 = !DILocation(line: 137, column: 17, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 137, column: 17)
!248 = distinct !DILexicalBlock(scope: !242, file: !3, line: 136, column: 37)
!249 = !{!250, !250, i64 0}
!250 = !{!"long", !104, i64 0}
!251 = !DILocation(line: 137, column: 20, scope: !247)
!252 = !DILocation(line: 137, column: 17, scope: !248)
!253 = !DILocation(line: 138, column: 14, scope: !248)
!254 = !DILocation(line: 139, column: 19, scope: !248)
!255 = !DILocation(line: 140, column: 17, scope: !248)
!256 = distinct !{!256, !244, !257}
!257 = !DILocation(line: 141, column: 9, scope: !242)
!258 = !DILocation(line: 106, column: 19, scope: !196)
!259 = !DILocation(line: 152, column: 10, scope: !260)
!260 = distinct !DILexicalBlock(scope: !196, file: !3, line: 152, column: 5)
!261 = !DILocation(line: 152, column: 5, scope: !260)
!262 = !DILocation(line: 154, column: 13, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 152, column: 38)
!264 = distinct !DILexicalBlock(scope: !260, file: !3, line: 152, column: 5)
!265 = !DILocation(line: 133, column: 7, scope: !196)
!266 = !DILocation(line: 154, column: 13, scope: !267)
!267 = distinct !DILexicalBlock(scope: !263, file: !3, line: 154, column: 13)
!268 = !DILocation(line: 152, column: 5, scope: !264)
!269 = !DILocation(line: 151, column: 9, scope: !196)
!270 = !DILocation(line: 155, column: 21, scope: !271)
!271 = distinct !DILexicalBlock(scope: !267, file: !3, line: 154, column: 20)
!272 = !DILocation(line: 158, column: 9, scope: !271)
!273 = !DILocation(line: 104, column: 38, scope: !196)
!274 = !DILocation(line: 176, column: 5, scope: !196)
!275 = !DILocation(line: 177, column: 19, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 177, column: 13)
!277 = distinct !DILexicalBlock(scope: !196, file: !3, line: 176, column: 16)
!278 = !DILocation(line: 177, column: 27, scope: !276)
!279 = !DILocation(line: 177, column: 33, scope: !276)
!280 = !DILocation(line: 177, column: 13, scope: !277)
!281 = !DILocation(line: 178, column: 12, scope: !277)
!282 = !DILocation(line: 177, column: 41, scope: !276)
!283 = !DILocation(line: 179, column: 13, scope: !277)
!284 = !DILocation(line: 184, column: 5, scope: !196)
!285 = !DILocation(line: 0, scope: !276)
!286 = !DILocation(line: 186, column: 1, scope: !196)
!287 = !DILocation(line: 153, column: 14, scope: !263)
!288 = !DILocation(line: 156, column: 14, scope: !271)
!289 = !DILocation(line: 155, column: 18, scope: !271)
!290 = !DILocation(line: 157, column: 18, scope: !271)
!291 = !DILocation(line: 0, scope: !271)
!292 = !DILocation(line: 0, scope: !263)
!293 = !DILocation(line: 166, column: 13, scope: !294)
!294 = distinct !DILexicalBlock(scope: !196, file: !3, line: 166, column: 9)
!295 = !DILocation(line: 166, column: 26, scope: !294)
!296 = !DILocation(line: 166, column: 18, scope: !294)
!297 = !DILocation(line: 0, scope: !196)
!298 = distinct !{!298, !274, !299}
!299 = !DILocation(line: 180, column: 5, scope: !196)
!300 = distinct !DISubprogram(name: "setUnsignedBitfield", scope: !3, file: !3, line: 209, type: !301, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !22, !25, !25, !25}
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312}
!304 = !DILocalVariable(name: "p", arg: 1, scope: !300, file: !3, line: 209, type: !22)
!305 = !DILocalVariable(name: "offset", arg: 2, scope: !300, file: !3, line: 209, type: !25)
!306 = !DILocalVariable(name: "bits", arg: 3, scope: !300, file: !3, line: 209, type: !25)
!307 = !DILocalVariable(name: "value", arg: 4, scope: !300, file: !3, line: 209, type: !25)
!308 = !DILocalVariable(name: "byte", scope: !300, file: !3, line: 210, type: !25)
!309 = !DILocalVariable(name: "bit", scope: !300, file: !3, line: 210, type: !25)
!310 = !DILocalVariable(name: "byteval", scope: !300, file: !3, line: 210, type: !25)
!311 = !DILocalVariable(name: "bitval", scope: !300, file: !3, line: 210, type: !25)
!312 = !DILocalVariable(name: "j", scope: !300, file: !3, line: 210, type: !25)
!313 = !DILocation(line: 209, column: 41, scope: !300)
!314 = !DILocation(line: 209, column: 53, scope: !300)
!315 = !DILocation(line: 209, column: 70, scope: !300)
!316 = !DILocation(line: 209, column: 85, scope: !300)
!317 = !DILocation(line: 210, column: 42, scope: !300)
!318 = !DILocation(line: 212, column: 10, scope: !319)
!319 = distinct !DILexicalBlock(scope: !300, file: !3, line: 212, column: 5)
!320 = !DILocation(line: 212, column: 19, scope: !321)
!321 = distinct !DILexicalBlock(scope: !319, file: !3, line: 212, column: 5)
!322 = !DILocation(line: 212, column: 5, scope: !319)
!323 = !DILocation(line: 213, column: 48, scope: !324)
!324 = distinct !DILexicalBlock(scope: !321, file: !3, line: 212, column: 32)
!325 = !DILocation(line: 213, column: 39, scope: !324)
!326 = !DILocation(line: 213, column: 25, scope: !324)
!327 = !DILocation(line: 213, column: 54, scope: !324)
!328 = !DILocation(line: 213, column: 18, scope: !324)
!329 = !DILocation(line: 210, column: 34, scope: !300)
!330 = !DILocation(line: 214, column: 23, scope: !324)
!331 = !DILocation(line: 210, column: 14, scope: !300)
!332 = !DILocation(line: 215, column: 27, scope: !324)
!333 = !DILocation(line: 215, column: 17, scope: !324)
!334 = !DILocation(line: 210, column: 20, scope: !300)
!335 = !DILocation(line: 216, column: 19, scope: !324)
!336 = !DILocation(line: 210, column: 25, scope: !300)
!337 = !DILocation(line: 217, column: 24, scope: !324)
!338 = !DILocation(line: 217, column: 20, scope: !324)
!339 = !DILocation(line: 217, column: 17, scope: !324)
!340 = !DILocation(line: 218, column: 27, scope: !324)
!341 = !DILocation(line: 219, column: 27, scope: !324)
!342 = !DILocation(line: 219, column: 19, scope: !324)
!343 = !DILocation(line: 219, column: 17, scope: !324)
!344 = !DILocation(line: 220, column: 15, scope: !324)
!345 = !DILocation(line: 212, column: 28, scope: !321)
!346 = !DILocation(line: 212, column: 5, scope: !321)
!347 = distinct !{!347, !322, !348}
!348 = !DILocation(line: 221, column: 5, scope: !319)
!349 = !DILocation(line: 222, column: 1, scope: !300)
!350 = distinct !DISubprogram(name: "setSignedBitfield", scope: !3, file: !3, line: 224, type: !351, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !353)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !22, !25, !25, !27}
!353 = !{!354, !355, !356, !357, !358}
!354 = !DILocalVariable(name: "p", arg: 1, scope: !350, file: !3, line: 224, type: !22)
!355 = !DILocalVariable(name: "offset", arg: 2, scope: !350, file: !3, line: 224, type: !25)
!356 = !DILocalVariable(name: "bits", arg: 3, scope: !350, file: !3, line: 224, type: !25)
!357 = !DILocalVariable(name: "value", arg: 4, scope: !350, file: !3, line: 224, type: !27)
!358 = !DILocalVariable(name: "uv", scope: !350, file: !3, line: 225, type: !25)
!359 = !DILocation(line: 224, column: 39, scope: !350)
!360 = !DILocation(line: 224, column: 51, scope: !350)
!361 = !DILocation(line: 224, column: 68, scope: !350)
!362 = !DILocation(line: 224, column: 82, scope: !350)
!363 = !DILocation(line: 225, column: 14, scope: !350)
!364 = !DILocation(line: 209, column: 41, scope: !300, inlinedAt: !365)
!365 = distinct !DILocation(line: 226, column: 5, scope: !350)
!366 = !DILocation(line: 209, column: 53, scope: !300, inlinedAt: !365)
!367 = !DILocation(line: 209, column: 70, scope: !300, inlinedAt: !365)
!368 = !DILocation(line: 209, column: 85, scope: !300, inlinedAt: !365)
!369 = !DILocation(line: 210, column: 42, scope: !300, inlinedAt: !365)
!370 = !DILocation(line: 212, column: 10, scope: !319, inlinedAt: !365)
!371 = !DILocation(line: 212, column: 19, scope: !321, inlinedAt: !365)
!372 = !DILocation(line: 212, column: 5, scope: !319, inlinedAt: !365)
!373 = !DILocation(line: 213, column: 48, scope: !324, inlinedAt: !365)
!374 = !DILocation(line: 213, column: 39, scope: !324, inlinedAt: !365)
!375 = !DILocation(line: 213, column: 25, scope: !324, inlinedAt: !365)
!376 = !DILocation(line: 213, column: 54, scope: !324, inlinedAt: !365)
!377 = !DILocation(line: 213, column: 18, scope: !324, inlinedAt: !365)
!378 = !DILocation(line: 210, column: 34, scope: !300, inlinedAt: !365)
!379 = !DILocation(line: 214, column: 23, scope: !324, inlinedAt: !365)
!380 = !DILocation(line: 210, column: 14, scope: !300, inlinedAt: !365)
!381 = !DILocation(line: 215, column: 27, scope: !324, inlinedAt: !365)
!382 = !DILocation(line: 215, column: 17, scope: !324, inlinedAt: !365)
!383 = !DILocation(line: 210, column: 20, scope: !300, inlinedAt: !365)
!384 = !DILocation(line: 216, column: 19, scope: !324, inlinedAt: !365)
!385 = !DILocation(line: 210, column: 25, scope: !300, inlinedAt: !365)
!386 = !DILocation(line: 217, column: 24, scope: !324, inlinedAt: !365)
!387 = !DILocation(line: 217, column: 20, scope: !324, inlinedAt: !365)
!388 = !DILocation(line: 217, column: 17, scope: !324, inlinedAt: !365)
!389 = !DILocation(line: 218, column: 27, scope: !324, inlinedAt: !365)
!390 = !DILocation(line: 219, column: 27, scope: !324, inlinedAt: !365)
!391 = !DILocation(line: 219, column: 19, scope: !324, inlinedAt: !365)
!392 = !DILocation(line: 219, column: 17, scope: !324, inlinedAt: !365)
!393 = !DILocation(line: 220, column: 15, scope: !324, inlinedAt: !365)
!394 = !DILocation(line: 212, column: 28, scope: !321, inlinedAt: !365)
!395 = !DILocation(line: 212, column: 5, scope: !321, inlinedAt: !365)
!396 = !DILocation(line: 222, column: 1, scope: !300, inlinedAt: !365)
!397 = !DILocation(line: 227, column: 1, scope: !350)
!398 = distinct !DISubprogram(name: "getUnsignedBitfield", scope: !3, file: !3, line: 229, type: !399, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!25, !22, !25, !25}
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410}
!402 = !DILocalVariable(name: "p", arg: 1, scope: !398, file: !3, line: 229, type: !22)
!403 = !DILocalVariable(name: "offset", arg: 2, scope: !398, file: !3, line: 229, type: !25)
!404 = !DILocalVariable(name: "bits", arg: 3, scope: !398, file: !3, line: 229, type: !25)
!405 = !DILocalVariable(name: "byte", scope: !398, file: !3, line: 230, type: !25)
!406 = !DILocalVariable(name: "bit", scope: !398, file: !3, line: 230, type: !25)
!407 = !DILocalVariable(name: "byteval", scope: !398, file: !3, line: 230, type: !25)
!408 = !DILocalVariable(name: "bitval", scope: !398, file: !3, line: 230, type: !25)
!409 = !DILocalVariable(name: "j", scope: !398, file: !3, line: 230, type: !25)
!410 = !DILocalVariable(name: "value", scope: !398, file: !3, line: 230, type: !25)
!411 = !DILocation(line: 229, column: 45, scope: !398)
!412 = !DILocation(line: 229, column: 57, scope: !398)
!413 = !DILocation(line: 229, column: 74, scope: !398)
!414 = !DILocation(line: 230, column: 45, scope: !398)
!415 = !DILocation(line: 230, column: 42, scope: !398)
!416 = !DILocation(line: 232, column: 10, scope: !417)
!417 = distinct !DILexicalBlock(scope: !398, file: !3, line: 232, column: 5)
!418 = !DILocation(line: 232, column: 19, scope: !419)
!419 = distinct !DILexicalBlock(scope: !417, file: !3, line: 232, column: 5)
!420 = !DILocation(line: 232, column: 5, scope: !417)
!421 = !DILocation(line: 233, column: 23, scope: !422)
!422 = distinct !DILexicalBlock(scope: !419, file: !3, line: 232, column: 32)
!423 = !DILocation(line: 230, column: 14, scope: !398)
!424 = !DILocation(line: 234, column: 27, scope: !422)
!425 = !DILocation(line: 234, column: 17, scope: !422)
!426 = !DILocation(line: 230, column: 20, scope: !398)
!427 = !DILocation(line: 235, column: 19, scope: !422)
!428 = !DILocation(line: 230, column: 25, scope: !398)
!429 = !DILocation(line: 236, column: 27, scope: !422)
!430 = !DILocation(line: 236, column: 35, scope: !422)
!431 = !DILocation(line: 230, column: 34, scope: !398)
!432 = !DILocation(line: 237, column: 23, scope: !422)
!433 = !DILocation(line: 237, column: 28, scope: !422)
!434 = !DILocation(line: 238, column: 15, scope: !422)
!435 = !DILocation(line: 232, column: 5, scope: !419)
!436 = distinct !{!436, !420, !437}
!437 = !DILocation(line: 239, column: 5, scope: !417)
!438 = !DILocation(line: 240, column: 5, scope: !398)
!439 = !DILocation(line: 0, scope: !422)
!440 = distinct !DISubprogram(name: "getSignedBitfield", scope: !3, file: !3, line: 243, type: !441, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!27, !22, !25, !25}
!443 = !{!444, !445, !446, !447, !448}
!444 = !DILocalVariable(name: "p", arg: 1, scope: !440, file: !3, line: 243, type: !22)
!445 = !DILocalVariable(name: "offset", arg: 2, scope: !440, file: !3, line: 243, type: !25)
!446 = !DILocalVariable(name: "bits", arg: 3, scope: !440, file: !3, line: 243, type: !25)
!447 = !DILocalVariable(name: "value", scope: !440, file: !3, line: 244, type: !27)
!448 = !DILocalVariable(name: "conv", scope: !440, file: !3, line: 245, type: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !3, line: 245, size: 64, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !449, file: !3, line: 245, baseType: !25, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !449, file: !3, line: 245, baseType: !27, size: 64)
!453 = !DILocation(line: 243, column: 42, scope: !440)
!454 = !DILocation(line: 243, column: 54, scope: !440)
!455 = !DILocation(line: 243, column: 71, scope: !440)
!456 = !DILocation(line: 229, column: 45, scope: !398, inlinedAt: !457)
!457 = distinct !DILocation(line: 254, column: 14, scope: !440)
!458 = !DILocation(line: 229, column: 57, scope: !398, inlinedAt: !457)
!459 = !DILocation(line: 229, column: 74, scope: !398, inlinedAt: !457)
!460 = !DILocation(line: 230, column: 45, scope: !398, inlinedAt: !457)
!461 = !DILocation(line: 230, column: 42, scope: !398, inlinedAt: !457)
!462 = !DILocation(line: 232, column: 10, scope: !417, inlinedAt: !457)
!463 = !DILocation(line: 232, column: 19, scope: !419, inlinedAt: !457)
!464 = !DILocation(line: 232, column: 5, scope: !417, inlinedAt: !457)
!465 = !DILocation(line: 233, column: 23, scope: !422, inlinedAt: !457)
!466 = !DILocation(line: 230, column: 14, scope: !398, inlinedAt: !457)
!467 = !DILocation(line: 234, column: 27, scope: !422, inlinedAt: !457)
!468 = !DILocation(line: 234, column: 17, scope: !422, inlinedAt: !457)
!469 = !DILocation(line: 230, column: 20, scope: !398, inlinedAt: !457)
!470 = !DILocation(line: 235, column: 19, scope: !422, inlinedAt: !457)
!471 = !DILocation(line: 230, column: 25, scope: !398, inlinedAt: !457)
!472 = !DILocation(line: 236, column: 27, scope: !422, inlinedAt: !457)
!473 = !DILocation(line: 236, column: 35, scope: !422, inlinedAt: !457)
!474 = !DILocation(line: 230, column: 34, scope: !398, inlinedAt: !457)
!475 = !DILocation(line: 237, column: 23, scope: !422, inlinedAt: !457)
!476 = !DILocation(line: 237, column: 28, scope: !422, inlinedAt: !457)
!477 = !DILocation(line: 238, column: 15, scope: !422, inlinedAt: !457)
!478 = !DILocation(line: 232, column: 5, scope: !419, inlinedAt: !457)
!479 = !DILocation(line: 240, column: 5, scope: !398, inlinedAt: !457)
!480 = !DILocation(line: 0, scope: !422, inlinedAt: !457)
!481 = !DILocation(line: 245, column: 36, scope: !440)
!482 = !DILocation(line: 244, column: 13, scope: !440)
!483 = !DILocation(line: 260, column: 38, scope: !484)
!484 = distinct !DILexicalBlock(scope: !440, file: !3, line: 260, column: 9)
!485 = !DILocation(line: 260, column: 30, scope: !484)
!486 = !DILocation(line: 260, column: 15, scope: !484)
!487 = !DILocation(line: 260, column: 9, scope: !440)
!488 = !DILocation(line: 261, column: 33, scope: !484)
!489 = !DILocation(line: 261, column: 15, scope: !484)
!490 = !DILocation(line: 261, column: 9, scope: !484)
!491 = !DILocation(line: 0, scope: !440)
!492 = !DILocation(line: 262, column: 5, scope: !440)
!493 = distinct !DISubprogram(name: "checkUnsignedBitfieldOverflow", scope: !3, file: !3, line: 288, type: !494, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !497)
!494 = !DISubroutineType(types: !495)
!495 = !{!199, !25, !27, !25, !199, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !508}
!498 = !DILocalVariable(name: "value", arg: 1, scope: !493, file: !3, line: 288, type: !25)
!499 = !DILocalVariable(name: "incr", arg: 2, scope: !493, file: !3, line: 288, type: !27)
!500 = !DILocalVariable(name: "bits", arg: 3, scope: !493, file: !3, line: 288, type: !25)
!501 = !DILocalVariable(name: "owtype", arg: 4, scope: !493, file: !3, line: 288, type: !199)
!502 = !DILocalVariable(name: "limit", arg: 5, scope: !493, file: !3, line: 288, type: !496)
!503 = !DILocalVariable(name: "max", scope: !493, file: !3, line: 289, type: !25)
!504 = !DILocalVariable(name: "maxincr", scope: !493, file: !3, line: 290, type: !27)
!505 = !DILocalVariable(name: "minincr", scope: !493, file: !3, line: 291, type: !27)
!506 = !DILocalVariable(name: "mask", scope: !507, file: !3, line: 316, type: !25)
!507 = distinct !DILexicalBlock(scope: !493, file: !3, line: 315, column: 5)
!508 = !DILocalVariable(name: "res", scope: !507, file: !3, line: 317, type: !25)
!509 = !DILocation(line: 288, column: 44, scope: !493)
!510 = !DILocation(line: 288, column: 59, scope: !493)
!511 = !DILocation(line: 288, column: 74, scope: !493)
!512 = !DILocation(line: 288, column: 84, scope: !493)
!513 = !DILocation(line: 288, column: 102, scope: !493)
!514 = !DILocation(line: 289, column: 26, scope: !493)
!515 = !DILocation(line: 289, column: 20, scope: !493)
!516 = !DILocation(line: 289, column: 14, scope: !493)
!517 = !DILocation(line: 293, column: 21, scope: !518)
!518 = distinct !DILexicalBlock(scope: !493, file: !3, line: 293, column: 9)
!519 = !DILocation(line: 289, column: 68, scope: !493)
!520 = !DILocation(line: 293, column: 15, scope: !518)
!521 = !DILocation(line: 291, column: 23, scope: !493)
!522 = !DILocation(line: 293, column: 30, scope: !518)
!523 = !DILocation(line: 293, column: 34, scope: !518)
!524 = !DILocation(line: 290, column: 26, scope: !493)
!525 = !DILocation(line: 293, column: 42, scope: !518)
!526 = !DILocation(line: 293, column: 9, scope: !493)
!527 = !DILocation(line: 302, column: 25, scope: !528)
!528 = distinct !DILexicalBlock(scope: !518, file: !3, line: 302, column: 16)
!529 = !DILocation(line: 294, column: 13, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !3, line: 294, column: 13)
!531 = distinct !DILexicalBlock(scope: !518, file: !3, line: 293, column: 54)
!532 = !DILocation(line: 294, column: 13, scope: !531)
!533 = !DILocation(line: 295, column: 24, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !3, line: 295, column: 17)
!535 = distinct !DILexicalBlock(scope: !530, file: !3, line: 294, column: 20)
!536 = !DILocation(line: 295, column: 17, scope: !535)
!537 = !DILocation(line: 297, column: 31, scope: !538)
!538 = distinct !DILexicalBlock(scope: !534, file: !3, line: 297, column: 24)
!539 = !DILocation(line: 297, column: 24, scope: !534)
!540 = !DILocation(line: 298, column: 24, scope: !541)
!541 = distinct !DILexicalBlock(scope: !538, file: !3, line: 297, column: 50)
!542 = !DILocation(line: 299, column: 13, scope: !541)
!543 = !DILocation(line: 302, column: 21, scope: !528)
!544 = !DILocation(line: 302, column: 33, scope: !528)
!545 = !DILocation(line: 302, column: 16, scope: !518)
!546 = !DILocation(line: 303, column: 13, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !3, line: 303, column: 13)
!548 = distinct !DILexicalBlock(scope: !528, file: !3, line: 302, column: 44)
!549 = !DILocation(line: 303, column: 13, scope: !548)
!550 = !DILocation(line: 304, column: 24, scope: !551)
!551 = distinct !DILexicalBlock(scope: !552, file: !3, line: 304, column: 17)
!552 = distinct !DILexicalBlock(scope: !547, file: !3, line: 303, column: 20)
!553 = !DILocation(line: 304, column: 17, scope: !552)
!554 = !DILocation(line: 306, column: 31, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !3, line: 306, column: 24)
!556 = !DILocation(line: 306, column: 24, scope: !551)
!557 = !DILocation(line: 307, column: 24, scope: !558)
!558 = distinct !DILexicalBlock(scope: !555, file: !3, line: 306, column: 50)
!559 = !DILocation(line: 308, column: 13, scope: !558)
!560 = !DILocation(line: 316, column: 40, scope: !507)
!561 = !DILocation(line: 316, column: 18, scope: !507)
!562 = !DILocation(line: 317, column: 29, scope: !507)
!563 = !DILocation(line: 317, column: 18, scope: !507)
!564 = !DILocation(line: 319, column: 16, scope: !507)
!565 = !DILocation(line: 319, column: 13, scope: !507)
!566 = !DILocation(line: 320, column: 16, scope: !507)
!567 = !DILocation(line: 322, column: 5, scope: !493)
!568 = !DILocation(line: 0, scope: !493)
!569 = !DILocation(line: 0, scope: !531)
!570 = !DILocation(line: 323, column: 1, scope: !493)
!571 = distinct !DISubprogram(name: "checkSignedBitfieldOverflow", scope: !3, file: !3, line: 325, type: !572, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !575)
!572 = !DISubroutineType(types: !573)
!573 = !{!199, !27, !27, !25, !199, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590}
!576 = !DILocalVariable(name: "value", arg: 1, scope: !571, file: !3, line: 325, type: !27)
!577 = !DILocalVariable(name: "incr", arg: 2, scope: !571, file: !3, line: 325, type: !27)
!578 = !DILocalVariable(name: "bits", arg: 3, scope: !571, file: !3, line: 325, type: !25)
!579 = !DILocalVariable(name: "owtype", arg: 4, scope: !571, file: !3, line: 325, type: !199)
!580 = !DILocalVariable(name: "limit", arg: 5, scope: !571, file: !3, line: 325, type: !574)
!581 = !DILocalVariable(name: "max", scope: !571, file: !3, line: 326, type: !27)
!582 = !DILocalVariable(name: "min", scope: !571, file: !3, line: 327, type: !27)
!583 = !DILocalVariable(name: "maxincr", scope: !571, file: !3, line: 332, type: !27)
!584 = !DILocalVariable(name: "minincr", scope: !571, file: !3, line: 333, type: !27)
!585 = !DILocalVariable(name: "mask", scope: !586, file: !3, line: 359, type: !25)
!586 = distinct !DILexicalBlock(scope: !571, file: !3, line: 358, column: 5)
!587 = !DILocalVariable(name: "msb", scope: !586, file: !3, line: 360, type: !25)
!588 = !DILocalVariable(name: "a", scope: !586, file: !3, line: 361, type: !25)
!589 = !DILocalVariable(name: "b", scope: !586, file: !3, line: 361, type: !25)
!590 = !DILocalVariable(name: "c", scope: !586, file: !3, line: 361, type: !25)
!591 = !DILocation(line: 325, column: 41, scope: !571)
!592 = !DILocation(line: 325, column: 56, scope: !571)
!593 = !DILocation(line: 325, column: 71, scope: !571)
!594 = !DILocation(line: 325, column: 81, scope: !571)
!595 = !DILocation(line: 325, column: 98, scope: !571)
!596 = !DILocation(line: 326, column: 25, scope: !571)
!597 = !DILocation(line: 326, column: 19, scope: !571)
!598 = !DILocation(line: 326, column: 65, scope: !571)
!599 = !DILocation(line: 326, column: 69, scope: !571)
!600 = !DILocation(line: 326, column: 13, scope: !571)
!601 = !DILocation(line: 327, column: 13, scope: !571)
!602 = !DILocation(line: 332, column: 26, scope: !571)
!603 = !DILocation(line: 332, column: 13, scope: !571)
!604 = !DILocation(line: 335, column: 15, scope: !605)
!605 = distinct !DILexicalBlock(scope: !571, file: !3, line: 335, column: 9)
!606 = !DILocation(line: 335, column: 21, scope: !605)
!607 = !DILocation(line: 335, column: 36, scope: !605)
!608 = !DILocation(line: 335, column: 44, scope: !605)
!609 = !DILocation(line: 335, column: 55, scope: !605)
!610 = !DILocation(line: 333, column: 26, scope: !571)
!611 = !DILocation(line: 335, column: 65, scope: !605)
!612 = !DILocation(line: 335, column: 78, scope: !605)
!613 = !DILocation(line: 335, column: 70, scope: !605)
!614 = !DILocation(line: 335, column: 90, scope: !605)
!615 = !DILocation(line: 335, column: 9, scope: !571)
!616 = !DILocation(line: 337, column: 13, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !3, line: 337, column: 13)
!618 = distinct !DILexicalBlock(scope: !605, file: !3, line: 336, column: 5)
!619 = !DILocation(line: 337, column: 13, scope: !618)
!620 = !DILocation(line: 338, column: 24, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 338, column: 17)
!622 = distinct !DILexicalBlock(scope: !617, file: !3, line: 337, column: 20)
!623 = !DILocation(line: 338, column: 17, scope: !622)
!624 = !DILocation(line: 340, column: 31, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !3, line: 340, column: 24)
!626 = !DILocation(line: 340, column: 24, scope: !621)
!627 = !DILocation(line: 341, column: 24, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !3, line: 340, column: 50)
!629 = !DILocation(line: 342, column: 13, scope: !628)
!630 = !DILocation(line: 345, column: 22, scope: !631)
!631 = distinct !DILexicalBlock(scope: !605, file: !3, line: 345, column: 16)
!632 = !DILocation(line: 345, column: 28, scope: !631)
!633 = !DILocation(line: 345, column: 43, scope: !631)
!634 = !DILocation(line: 345, column: 51, scope: !631)
!635 = !DILocation(line: 345, column: 62, scope: !631)
!636 = !DILocation(line: 345, column: 76, scope: !631)
!637 = !DILocation(line: 345, column: 96, scope: !631)
!638 = !DILocation(line: 345, column: 16, scope: !605)
!639 = !DILocation(line: 346, column: 13, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !3, line: 346, column: 13)
!641 = distinct !DILexicalBlock(scope: !631, file: !3, line: 345, column: 108)
!642 = !DILocation(line: 346, column: 13, scope: !641)
!643 = !DILocation(line: 347, column: 24, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !3, line: 347, column: 17)
!645 = distinct !DILexicalBlock(scope: !640, file: !3, line: 346, column: 20)
!646 = !DILocation(line: 347, column: 17, scope: !645)
!647 = !DILocation(line: 349, column: 31, scope: !648)
!648 = distinct !DILexicalBlock(scope: !644, file: !3, line: 349, column: 24)
!649 = !DILocation(line: 349, column: 24, scope: !644)
!650 = !DILocation(line: 350, column: 24, scope: !651)
!651 = distinct !DILexicalBlock(scope: !648, file: !3, line: 349, column: 50)
!652 = !DILocation(line: 351, column: 13, scope: !651)
!653 = !DILocation(line: 359, column: 40, scope: !586)
!654 = !DILocation(line: 359, column: 18, scope: !586)
!655 = !DILocation(line: 360, column: 44, scope: !586)
!656 = !DILocation(line: 360, column: 36, scope: !586)
!657 = !DILocation(line: 360, column: 18, scope: !586)
!658 = !DILocation(line: 361, column: 18, scope: !586)
!659 = !DILocation(line: 361, column: 29, scope: !586)
!660 = !DILocation(line: 362, column: 14, scope: !586)
!661 = !DILocation(line: 361, column: 39, scope: !586)
!662 = !DILocation(line: 367, column: 15, scope: !663)
!663 = distinct !DILexicalBlock(scope: !586, file: !3, line: 367, column: 13)
!664 = !DILocation(line: 367, column: 13, scope: !586)
!665 = !DILocation(line: 368, column: 15, scope: !666)
!666 = distinct !DILexicalBlock(scope: !663, file: !3, line: 367, column: 22)
!667 = !DILocation(line: 370, column: 18, scope: !668)
!668 = distinct !DILexicalBlock(scope: !663, file: !3, line: 369, column: 16)
!669 = !DILocation(line: 370, column: 15, scope: !668)
!670 = !DILocation(line: 372, column: 16, scope: !586)
!671 = !DILocation(line: 374, column: 5, scope: !571)
!672 = !DILocation(line: 0, scope: !571)
!673 = !DILocation(line: 0, scope: !618)
!674 = !DILocation(line: 375, column: 1, scope: !571)
!675 = distinct !DISubprogram(name: "printBits", scope: !3, file: !3, line: 379, type: !676, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !678)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !22, !10}
!678 = !{!679, !680, !681, !682, !683}
!679 = !DILocalVariable(name: "p", arg: 1, scope: !675, file: !3, line: 379, type: !22)
!680 = !DILocalVariable(name: "count", arg: 2, scope: !675, file: !3, line: 379, type: !10)
!681 = !DILocalVariable(name: "j", scope: !675, file: !3, line: 380, type: !10)
!682 = !DILocalVariable(name: "i", scope: !675, file: !3, line: 380, type: !10)
!683 = !DILocalVariable(name: "byte", scope: !675, file: !3, line: 380, type: !10)
!684 = !DILocation(line: 379, column: 31, scope: !675)
!685 = !DILocation(line: 379, column: 48, scope: !675)
!686 = !DILocation(line: 380, column: 19, scope: !675)
!687 = !DILocation(line: 382, column: 10, scope: !688)
!688 = distinct !DILexicalBlock(scope: !675, file: !3, line: 382, column: 5)
!689 = !DILocation(line: 382, column: 19, scope: !690)
!690 = distinct !DILexicalBlock(scope: !688, file: !3, line: 382, column: 5)
!691 = !DILocation(line: 382, column: 5, scope: !688)
!692 = !DILocation(line: 383, column: 16, scope: !693)
!693 = distinct !DILexicalBlock(scope: !690, file: !3, line: 382, column: 33)
!694 = !DILocation(line: 380, column: 25, scope: !675)
!695 = !DILocation(line: 380, column: 22, scope: !675)
!696 = !DILocation(line: 384, column: 14, scope: !697)
!697 = distinct !DILexicalBlock(scope: !693, file: !3, line: 384, column: 9)
!698 = !DILocation(line: 384, column: 9, scope: !697)
!699 = !DILocation(line: 385, column: 26, scope: !700)
!700 = distinct !DILexicalBlock(scope: !697, file: !3, line: 384, column: 9)
!701 = !DILocation(line: 385, column: 13, scope: !700)
!702 = !DILocation(line: 384, column: 9, scope: !700)
!703 = !DILocation(line: 385, column: 32, scope: !700)
!704 = !DILocation(line: 386, column: 9, scope: !693)
!705 = !DILocation(line: 382, column: 29, scope: !690)
!706 = !DILocation(line: 382, column: 5, scope: !690)
!707 = distinct !{!707, !691, !708}
!708 = !DILocation(line: 387, column: 5, scope: !688)
!709 = !DILocation(line: 388, column: 5, scope: !675)
!710 = !DILocation(line: 389, column: 1, scope: !675)
!711 = distinct !DISubprogram(name: "getBitOffsetFromArgument", scope: !3, file: !3, line: 411, type: !712, isLocal: false, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !951)
!712 = !DISubroutineType(types: !713)
!713 = !{!199, !714, !824, !950, !199, !199}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !716, line: 780, baseType: !717)
!716 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !716, line: 723, size: 135360, elements: !718)
!718 = !{!719, !720, !721, !823, !833, !836, !837, !838, !839, !840, !842, !866, !867, !868, !869, !870, !871, !872, !873, !876, !877, !878, !879, !880, !881, !882, !883, !888, !889, !890, !891, !892, !893, !894, !895, !899, !900, !904, !905, !921, !922, !939, !940, !941, !942, !943, !944, !945, !946}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !716, line: 724, baseType: !25, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !717, file: !716, line: 725, baseType: !199, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !717, file: !716, line: 726, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !716, line: 656, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !716, line: 647, size: 512, elements: !725)
!725 = !{!726, !787, !788, !789, !790, !791, !792, !794}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !724, file: !716, line: 648, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !729, line: 82, baseType: !730)
!729 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !729, line: 76, size: 768, elements: !731)
!731 = !{!732, !757, !758, !785, !786}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !730, file: !729, line: 77, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !729, line: 65, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !729, line: 58, size: 384, elements: !736)
!736 = !{!737, !743, !747, !748, !752, !756}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !735, file: !729, line: 59, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!25, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !735, file: !729, line: 60, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!11, !11, !741}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !735, file: !729, line: 61, baseType: !744, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !735, file: !729, line: 62, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!199, !11, !741, !741}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !735, file: !729, line: 63, baseType: !753, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !11, !11}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !735, file: !729, line: 64, baseType: !753, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !730, file: !729, line: 78, baseType: !11, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !730, file: !729, line: 79, baseType: !759, size: 512, offset: 128)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 512, elements: !783)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !729, line: 74, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !729, line: 69, size: 256, elements: !762)
!762 = !{!763, !780, !781, !782}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !761, file: !729, line: 70, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !729, line: 56, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !729, line: 47, size: 192, elements: !768)
!768 = !{!769, !770, !778}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !767, file: !729, line: 48, baseType: !11, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !767, file: !729, line: 54, baseType: !771, size: 64, offset: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !729, line: 49, size: 64, elements: !772)
!772 = !{!773, !774, !775, !776}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !771, file: !729, line: 50, baseType: !11, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !771, file: !729, line: 51, baseType: !25, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !771, file: !729, line: 52, baseType: !27, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !771, file: !729, line: 53, baseType: !777, size: 64)
!777 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !729, line: 55, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !761, file: !729, line: 71, baseType: !10, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !761, file: !729, line: 72, baseType: !10, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !761, file: !729, line: 73, baseType: !10, size: 64, offset: 192)
!783 = !{!784}
!784 = !DISubrange(count: 2)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !730, file: !729, line: 80, baseType: !12, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !730, file: !729, line: 81, baseType: !10, size: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !724, file: !716, line: 649, baseType: !727, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !724, file: !716, line: 650, baseType: !727, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !724, file: !716, line: 651, baseType: !727, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !724, file: !716, line: 652, baseType: !727, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !724, file: !716, line: 653, baseType: !199, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !724, file: !716, line: 654, baseType: !793, size: 64, offset: 384)
!793 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !724, file: !716, line: 655, baseType: !795, size: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !797, line: 54, baseType: !798)
!797 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !797, line: 47, size: 384, elements: !799)
!799 = !{!800, !809, !810, !814, !818, !822}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !798, file: !797, line: 48, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !797, line: 40, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !797, line: 36, size: 192, elements: !804)
!804 = !{!805, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !803, file: !797, line: 37, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !797, line: 38, baseType: !806, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !803, file: !797, line: 39, baseType: !11, size: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !798, file: !797, line: 49, baseType: !801, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !798, file: !797, line: 50, baseType: !811, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!11, !11}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !798, file: !797, line: 51, baseType: !815, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !11}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !798, file: !797, line: 52, baseType: !819, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!199, !11, !11}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !798, file: !797, line: 53, baseType: !10, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !716, line: 727, baseType: !824, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !716, line: 622, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !716, line: 614, size: 128, elements: !827)
!827 = !{!828, !829, !830, !831, !832}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !826, file: !716, line: 615, baseType: !21, size: 4, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !826, file: !716, line: 616, baseType: !21, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !826, file: !716, line: 617, baseType: !21, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !826, file: !716, line: 620, baseType: !199, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !826, file: !716, line: 621, baseType: !11, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !717, file: !716, line: 728, baseType: !834, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !35, line: 43, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !717, file: !716, line: 729, baseType: !6, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !717, file: !716, line: 730, baseType: !834, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !717, file: !716, line: 734, baseType: !6, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !717, file: !716, line: 735, baseType: !199, size: 32, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !717, file: !716, line: 736, baseType: !841, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !717, file: !716, line: 737, baseType: !843, size: 64, offset: 640)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !716, line: 1307, size: 640, elements: !845)
!845 = !{!846, !847, !852, !853, !854, !855, !861, !862, !863, !864, !865}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !716, line: 1308, baseType: !835, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !844, file: !716, line: 1309, baseType: !848, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !716, line: 1305, baseType: !850)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !714}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !844, file: !716, line: 1310, baseType: !199, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !844, file: !716, line: 1311, baseType: !835, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !844, file: !716, line: 1312, baseType: !199, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !844, file: !716, line: 1315, baseType: !856, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !716, line: 1306, baseType: !858)
!858 = !DISubroutineType(types: !859)
!859 = !{!860, !843, !841, !199, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !844, file: !716, line: 1317, baseType: !199, size: 32, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !844, file: !716, line: 1318, baseType: !199, size: 32, offset: 416)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !844, file: !716, line: 1319, baseType: !199, size: 32, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !844, file: !716, line: 1320, baseType: !793, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !844, file: !716, line: 1320, baseType: !793, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !717, file: !716, line: 737, baseType: !843, size: 64, offset: 704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !717, file: !716, line: 738, baseType: !199, size: 32, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !717, file: !716, line: 739, baseType: !199, size: 32, offset: 800)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !717, file: !716, line: 740, baseType: !12, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !717, file: !716, line: 741, baseType: !795, size: 64, offset: 896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !717, file: !716, line: 742, baseType: !29, size: 64, offset: 960)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !717, file: !716, line: 743, baseType: !6, size: 64, offset: 1024)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !717, file: !716, line: 745, baseType: !874, size: 64, offset: 1088)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !875, line: 34, baseType: !12)
!875 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !717, file: !716, line: 746, baseType: !874, size: 64, offset: 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !717, file: !716, line: 747, baseType: !874, size: 64, offset: 1216)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !717, file: !716, line: 748, baseType: !199, size: 32, offset: 1280)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !717, file: !716, line: 749, baseType: !199, size: 32, offset: 1312)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !717, file: !716, line: 750, baseType: !199, size: 32, offset: 1344)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !717, file: !716, line: 751, baseType: !199, size: 32, offset: 1376)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !717, file: !716, line: 752, baseType: !199, size: 32, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !717, file: !716, line: 753, baseType: !884, size: 64, offset: 1472)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !885, line: 173, baseType: !886)
!885 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !9, line: 100, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !9, line: 44, baseType: !12)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !717, file: !716, line: 754, baseType: !884, size: 64, offset: 1536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !717, file: !716, line: 755, baseType: !834, size: 64, offset: 1600)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !717, file: !716, line: 756, baseType: !793, size: 64, offset: 1664)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !717, file: !716, line: 757, baseType: !793, size: 64, offset: 1728)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !717, file: !716, line: 758, baseType: !793, size: 64, offset: 1792)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !717, file: !716, line: 759, baseType: !793, size: 64, offset: 1856)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !717, file: !716, line: 760, baseType: !793, size: 64, offset: 1920)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !717, file: !716, line: 763, baseType: !896, size: 328, offset: 1984)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 328, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 41)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !717, file: !716, line: 764, baseType: !199, size: 32, offset: 2336)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !717, file: !716, line: 765, baseType: !901, size: 368, offset: 2368)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 368, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 46)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !717, file: !716, line: 766, baseType: !199, size: 32, offset: 2752)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !717, file: !716, line: 767, baseType: !906, size: 256, offset: 2816)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !716, line: 673, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !716, line: 665, size: 256, elements: !908)
!908 = !{!909, !917, !918, !919, !920}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !907, file: !716, line: 666, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !716, line: 663, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !716, line: 659, size: 192, elements: !913)
!913 = !{!914, !915, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !912, file: !716, line: 660, baseType: !841, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !912, file: !716, line: 661, baseType: !199, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !912, file: !716, line: 662, baseType: !843, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !907, file: !716, line: 667, baseType: !199, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !907, file: !716, line: 668, baseType: !199, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !907, file: !716, line: 671, baseType: !199, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !907, file: !716, line: 672, baseType: !874, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !717, file: !716, line: 768, baseType: !199, size: 32, offset: 3072)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !717, file: !716, line: 769, baseType: !923, size: 704, offset: 3136)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !716, line: 703, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !716, line: 677, size: 704, elements: !925)
!925 = !{!926, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !924, file: !716, line: 679, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !716, line: 52, baseType: !793)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !924, file: !716, line: 683, baseType: !727, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !924, file: !716, line: 685, baseType: !824, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !924, file: !716, line: 689, baseType: !6, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !924, file: !716, line: 690, baseType: !824, size: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !924, file: !716, line: 691, baseType: !824, size: 64, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !924, file: !716, line: 692, baseType: !927, size: 64, offset: 384)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !924, file: !716, line: 692, baseType: !927, size: 64, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !924, file: !716, line: 693, baseType: !199, size: 32, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !924, file: !716, line: 696, baseType: !199, size: 32, offset: 544)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !924, file: !716, line: 697, baseType: !793, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !924, file: !716, line: 700, baseType: !11, size: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !717, file: !716, line: 770, baseType: !793, size: 64, offset: 3840)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !717, file: !716, line: 771, baseType: !795, size: 64, offset: 3904)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !717, file: !716, line: 772, baseType: !727, size: 64, offset: 3968)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !717, file: !716, line: 773, baseType: !795, size: 64, offset: 4032)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !717, file: !716, line: 774, baseType: !834, size: 64, offset: 4096)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !717, file: !716, line: 775, baseType: !801, size: 64, offset: 4160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !717, file: !716, line: 778, baseType: !199, size: 32, offset: 4224)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !717, file: !716, line: 779, baseType: !947, size: 131072, offset: 4256)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 131072, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 16384)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!952 = !DILocalVariable(name: "c", arg: 1, scope: !711, file: !3, line: 411, type: !714)
!953 = !DILocalVariable(name: "o", arg: 2, scope: !711, file: !3, line: 411, type: !824)
!954 = !DILocalVariable(name: "offset", arg: 3, scope: !711, file: !3, line: 411, type: !950)
!955 = !DILocalVariable(name: "hash", arg: 4, scope: !711, file: !3, line: 411, type: !199)
!956 = !DILocalVariable(name: "bits", arg: 5, scope: !711, file: !3, line: 411, type: !199)
!957 = !DILocalVariable(name: "loffset", scope: !711, file: !3, line: 412, type: !793)
!958 = !DILocalVariable(name: "err", scope: !711, file: !3, line: 413, type: !835)
!959 = !DILocalVariable(name: "p", scope: !711, file: !3, line: 414, type: !835)
!960 = !DILocalVariable(name: "plen", scope: !711, file: !3, line: 415, type: !6)
!961 = !DILocalVariable(name: "usehash", scope: !711, file: !3, line: 416, type: !199)
!962 = !DILocation(line: 411, column: 38, scope: !711)
!963 = !DILocation(line: 411, column: 47, scope: !711)
!964 = !DILocation(line: 411, column: 58, scope: !711)
!965 = !DILocation(line: 411, column: 70, scope: !711)
!966 = !DILocation(line: 411, column: 80, scope: !711)
!967 = !DILocation(line: 412, column: 5, scope: !711)
!968 = !DILocation(line: 414, column: 18, scope: !711)
!969 = !{!970, !971, i64 8}
!970 = !{!"redisObject", !123, i64 0, !123, i64 0, !123, i64 1, !123, i64 4, !971, i64 8}
!971 = !{!"any pointer", !104, i64 0}
!972 = !DILocation(line: 414, column: 11, scope: !711)
!973 = !DILocalVariable(name: "s", arg: 1, scope: !974, file: !35, line: 87, type: !979)
!974 = distinct !DISubprogram(name: "sdslen", scope: !35, file: !35, line: 87, type: !975, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !980)
!975 = !DISubroutineType(types: !976)
!976 = !{!977, !979}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !978, line: 58, baseType: !10)
!978 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!980 = !{!973, !981}
!981 = !DILocalVariable(name: "flags", scope: !974, file: !35, line: 88, type: !23)
!982 = !DILocation(line: 87, column: 39, scope: !974, inlinedAt: !983)
!983 = distinct !DILocation(line: 415, column: 19, scope: !711)
!984 = !DILocation(line: 88, column: 27, scope: !974, inlinedAt: !983)
!985 = !DILocation(line: 88, column: 19, scope: !974, inlinedAt: !983)
!986 = !DILocation(line: 89, column: 5, scope: !974, inlinedAt: !983)
!987 = !DILocation(line: 91, column: 20, scope: !988, inlinedAt: !983)
!988 = distinct !DILexicalBlock(scope: !974, file: !35, line: 89, column: 33)
!989 = !DILocation(line: 91, column: 13, scope: !988, inlinedAt: !983)
!990 = !DILocation(line: 93, column: 20, scope: !988, inlinedAt: !983)
!991 = !DILocation(line: 93, column: 34, scope: !988, inlinedAt: !983)
!992 = !DILocation(line: 93, column: 13, scope: !988, inlinedAt: !983)
!993 = !DILocation(line: 95, column: 20, scope: !988, inlinedAt: !983)
!994 = !DILocation(line: 95, column: 35, scope: !988, inlinedAt: !983)
!995 = !{!996, !996, i64 0}
!996 = !{!"short", !104, i64 0}
!997 = !DILocation(line: 95, column: 13, scope: !988, inlinedAt: !983)
!998 = !DILocation(line: 97, column: 20, scope: !988, inlinedAt: !983)
!999 = !DILocation(line: 97, column: 35, scope: !988, inlinedAt: !983)
!1000 = !DILocation(line: 97, column: 13, scope: !988, inlinedAt: !983)
!1001 = !DILocation(line: 99, column: 20, scope: !988, inlinedAt: !983)
!1002 = !DILocation(line: 99, column: 35, scope: !988, inlinedAt: !983)
!1003 = !DILocation(line: 99, column: 13, scope: !988, inlinedAt: !983)
!1004 = !DILocation(line: 0, scope: !988, inlinedAt: !983)
!1005 = !DILocation(line: 0, scope: !711)
!1006 = !DILocation(line: 102, column: 1, scope: !974, inlinedAt: !983)
!1007 = !DILocation(line: 415, column: 12, scope: !711)
!1008 = !DILocation(line: 416, column: 9, scope: !711)
!1009 = !DILocation(line: 419, column: 9, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !711, file: !3, line: 419, column: 9)
!1011 = !DILocation(line: 419, column: 14, scope: !1010)
!1012 = !DILocation(line: 419, column: 24, scope: !1010)
!1013 = !DILocation(line: 419, column: 21, scope: !1010)
!1014 = !DILocation(line: 419, column: 37, scope: !1010)
!1015 = !DILocation(line: 419, column: 42, scope: !1010)
!1016 = !DILocation(line: 421, column: 20, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !711, file: !3, line: 421, column: 9)
!1018 = !DILocation(line: 421, column: 33, scope: !1017)
!1019 = !DILocation(line: 412, column: 15, scope: !711)
!1020 = !DILocation(line: 421, column: 9, scope: !1017)
!1021 = !DILocation(line: 421, column: 52, scope: !1017)
!1022 = !DILocation(line: 421, column: 9, scope: !711)
!1023 = !DILocation(line: 422, column: 9, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 421, column: 58)
!1025 = !DILocation(line: 423, column: 9, scope: !1024)
!1026 = !DILocation(line: 427, column: 9, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !711, file: !3, line: 427, column: 9)
!1028 = !DILocation(line: 427, column: 9, scope: !711)
!1029 = !DILocation(line: 427, column: 29, scope: !1027)
!1030 = !DILocation(line: 427, column: 26, scope: !1027)
!1031 = !{!1032, !1032, i64 0}
!1032 = !{!"long long", !104, i64 0}
!1033 = !DILocation(line: 427, column: 18, scope: !1027)
!1034 = !DILocation(line: 430, column: 10, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !711, file: !3, line: 430, column: 9)
!1036 = !DILocation(line: 430, column: 18, scope: !1035)
!1037 = !DILocation(line: 430, column: 23, scope: !1035)
!1038 = !DILocation(line: 430, column: 61, scope: !1035)
!1039 = !DILocation(line: 430, column: 9, scope: !711)
!1040 = !DILocation(line: 432, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 431, column: 5)
!1042 = !DILocation(line: 433, column: 9, scope: !1041)
!1043 = !DILocation(line: 436, column: 13, scope: !711)
!1044 = !DILocation(line: 437, column: 5, scope: !711)
!1045 = !DILocation(line: 0, scope: !1024)
!1046 = !DILocation(line: 438, column: 1, scope: !711)
!1047 = distinct !DISubprogram(name: "getBitfieldTypeFromArgument", scope: !3, file: !3, line: 447, type: !1048, isLocal: false, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1050)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!199, !714, !824, !860, !860}
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1051 = !DILocalVariable(name: "c", arg: 1, scope: !1047, file: !3, line: 447, type: !714)
!1052 = !DILocalVariable(name: "o", arg: 2, scope: !1047, file: !3, line: 447, type: !824)
!1053 = !DILocalVariable(name: "sign", arg: 3, scope: !1047, file: !3, line: 447, type: !860)
!1054 = !DILocalVariable(name: "bits", arg: 4, scope: !1047, file: !3, line: 447, type: !860)
!1055 = !DILocalVariable(name: "p", scope: !1047, file: !3, line: 448, type: !835)
!1056 = !DILocalVariable(name: "err", scope: !1047, file: !3, line: 449, type: !835)
!1057 = !DILocalVariable(name: "llbits", scope: !1047, file: !3, line: 450, type: !793)
!1058 = !DILocation(line: 447, column: 41, scope: !1047)
!1059 = !DILocation(line: 447, column: 50, scope: !1047)
!1060 = !DILocation(line: 447, column: 58, scope: !1047)
!1061 = !DILocation(line: 447, column: 69, scope: !1047)
!1062 = !DILocation(line: 448, column: 18, scope: !1047)
!1063 = !DILocation(line: 448, column: 11, scope: !1047)
!1064 = !DILocation(line: 450, column: 5, scope: !1047)
!1065 = !DILocation(line: 452, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 452, column: 9)
!1067 = !DILocation(line: 452, column: 14, scope: !1066)
!1068 = !DILocation(line: 452, column: 9, scope: !1047)
!1069 = !DILocation(line: 454, column: 21, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 454, column: 16)
!1071 = !DILocation(line: 454, column: 16, scope: !1066)
!1072 = !DILocation(line: 457, column: 9, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 456, column: 12)
!1074 = !DILocation(line: 458, column: 9, scope: !1073)
!1075 = !DILocation(line: 0, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 452, column: 22)
!1077 = !DILocation(line: 461, column: 21, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 461, column: 9)
!1079 = !DILocation(line: 461, column: 24, scope: !1078)
!1080 = !DILocation(line: 450, column: 15, scope: !1047)
!1081 = !DILocation(line: 461, column: 10, scope: !1078)
!1082 = !DILocation(line: 461, column: 46, scope: !1078)
!1083 = !DILocation(line: 462, column: 9, scope: !1078)
!1084 = !DILocation(line: 462, column: 16, scope: !1078)
!1085 = !DILocation(line: 461, column: 51, scope: !1078)
!1086 = !DILocation(line: 463, column: 10, scope: !1078)
!1087 = !DILocation(line: 463, column: 16, scope: !1078)
!1088 = !DILocation(line: 463, column: 31, scope: !1078)
!1089 = !DILocation(line: 463, column: 21, scope: !1078)
!1090 = !DILocation(line: 464, column: 16, scope: !1078)
!1091 = !DILocation(line: 464, column: 31, scope: !1078)
!1092 = !DILocation(line: 464, column: 21, scope: !1078)
!1093 = !DILocation(line: 466, column: 9, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 465, column: 5)
!1095 = !DILocation(line: 467, column: 9, scope: !1094)
!1096 = !DILocation(line: 469, column: 13, scope: !1047)
!1097 = !DILocation(line: 469, column: 11, scope: !1047)
!1098 = !DILocation(line: 470, column: 5, scope: !1047)
!1099 = !DILocation(line: 0, scope: !1073)
!1100 = !DILocation(line: 471, column: 1, scope: !1047)
!1101 = distinct !DISubprogram(name: "lookupStringForBitCommand", scope: !3, file: !3, line: 478, type: !1102, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1104)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!824, !714, !6}
!1104 = !{!1105, !1106, !1107, !1108}
!1105 = !DILocalVariable(name: "c", arg: 1, scope: !1101, file: !3, line: 478, type: !714)
!1106 = !DILocalVariable(name: "maxbit", arg: 2, scope: !1101, file: !3, line: 478, type: !6)
!1107 = !DILocalVariable(name: "byte", scope: !1101, file: !3, line: 479, type: !6)
!1108 = !DILocalVariable(name: "o", scope: !1101, file: !3, line: 480, type: !824)
!1109 = !DILocation(line: 478, column: 41, scope: !1101)
!1110 = !DILocation(line: 478, column: 51, scope: !1101)
!1111 = !DILocation(line: 479, column: 26, scope: !1101)
!1112 = !DILocation(line: 479, column: 12, scope: !1101)
!1113 = !DILocation(line: 480, column: 33, scope: !1101)
!1114 = !{!1115, !971, i64 16}
!1115 = !{!"client", !250, i64 0, !123, i64 8, !971, i64 16, !971, i64 24, !971, i64 32, !250, i64 40, !971, i64 48, !250, i64 56, !123, i64 64, !971, i64 72, !971, i64 80, !971, i64 88, !123, i64 96, !123, i64 100, !250, i64 104, !971, i64 112, !1032, i64 120, !250, i64 128, !250, i64 136, !250, i64 144, !250, i64 152, !123, i64 160, !123, i64 164, !123, i64 168, !123, i64 172, !123, i64 176, !250, i64 184, !250, i64 192, !971, i64 200, !1032, i64 208, !1032, i64 216, !1032, i64 224, !1032, i64 232, !1032, i64 240, !104, i64 248, !123, i64 292, !104, i64 296, !123, i64 344, !1116, i64 352, !123, i64 384, !1117, i64 392, !1032, i64 480, !971, i64 488, !971, i64 496, !971, i64 504, !971, i64 512, !971, i64 520, !123, i64 528, !104, i64 532}
!1116 = !{!"multiState", !971, i64 0, !123, i64 8, !123, i64 12, !123, i64 16, !250, i64 24}
!1117 = !{!"blockingState", !1032, i64 0, !971, i64 8, !971, i64 16, !250, i64 24, !971, i64 32, !971, i64 40, !1032, i64 48, !1032, i64 56, !123, i64 64, !123, i64 68, !1032, i64 72, !971, i64 80}
!1118 = !DILocation(line: 480, column: 39, scope: !1101)
!1119 = !{!1115, !971, i64 72}
!1120 = !DILocation(line: 480, column: 36, scope: !1101)
!1121 = !{!971, !971, i64 0}
!1122 = !DILocation(line: 480, column: 15, scope: !1101)
!1123 = !DILocation(line: 480, column: 11, scope: !1101)
!1124 = !DILocation(line: 482, column: 11, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 482, column: 9)
!1126 = !DILocation(line: 482, column: 9, scope: !1101)
!1127 = !DILocation(line: 483, column: 57, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 482, column: 20)
!1129 = !DILocation(line: 483, column: 37, scope: !1128)
!1130 = !DILocation(line: 483, column: 13, scope: !1128)
!1131 = !DILocation(line: 484, column: 18, scope: !1128)
!1132 = !DILocation(line: 484, column: 24, scope: !1128)
!1133 = !DILocation(line: 484, column: 21, scope: !1128)
!1134 = !DILocation(line: 484, column: 9, scope: !1128)
!1135 = !DILocation(line: 485, column: 5, scope: !1128)
!1136 = !DILocation(line: 486, column: 13, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 486, column: 13)
!1138 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 485, column: 12)
!1139 = !DILocation(line: 486, column: 13, scope: !1138)
!1140 = !DILocation(line: 487, column: 37, scope: !1138)
!1141 = !DILocation(line: 487, column: 43, scope: !1138)
!1142 = !DILocation(line: 487, column: 40, scope: !1138)
!1143 = !DILocation(line: 487, column: 13, scope: !1138)
!1144 = !DILocation(line: 488, column: 33, scope: !1138)
!1145 = !DILocation(line: 488, column: 41, scope: !1138)
!1146 = !DILocation(line: 488, column: 18, scope: !1138)
!1147 = !DILocation(line: 488, column: 16, scope: !1138)
!1148 = !DILocation(line: 0, scope: !1138)
!1149 = !DILocation(line: 490, column: 5, scope: !1101)
!1150 = !DILocation(line: 0, scope: !1137)
!1151 = !DILocation(line: 491, column: 1, scope: !1101)
!1152 = distinct !DISubprogram(name: "getObjectReadOnlyString", scope: !3, file: !3, line: 506, type: !1153, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1156)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!22, !824, !1155, !835}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!1156 = !{!1157, !1158, !1159, !1160}
!1157 = !DILocalVariable(name: "o", arg: 1, scope: !1152, file: !3, line: 506, type: !824)
!1158 = !DILocalVariable(name: "len", arg: 2, scope: !1152, file: !3, line: 506, type: !1155)
!1159 = !DILocalVariable(name: "llbuf", arg: 3, scope: !1152, file: !3, line: 506, type: !835)
!1160 = !DILocalVariable(name: "p", scope: !1152, file: !3, line: 508, type: !22)
!1161 = !DILocation(line: 506, column: 46, scope: !1152)
!1162 = !DILocation(line: 506, column: 55, scope: !1152)
!1163 = !DILocation(line: 506, column: 66, scope: !1152)
!1164 = !DILocation(line: 507, column: 5, scope: !1152)
!1165 = !DILocation(line: 508, column: 20, scope: !1152)
!1166 = !DILocation(line: 512, column: 11, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 512, column: 9)
!1168 = !DILocation(line: 512, column: 17, scope: !1167)
!1169 = !DILocation(line: 512, column: 26, scope: !1167)
!1170 = !DILocation(line: 512, column: 9, scope: !1152)
!1171 = !DILocation(line: 514, column: 13, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 514, column: 13)
!1173 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 512, column: 47)
!1174 = !DILocation(line: 514, column: 13, scope: !1173)
!1175 = !DILocation(line: 514, column: 64, scope: !1172)
!1176 = !DILocation(line: 514, column: 25, scope: !1172)
!1177 = !DILocation(line: 514, column: 23, scope: !1172)
!1178 = !DILocation(line: 514, column: 18, scope: !1172)
!1179 = !DILocation(line: 515, column: 16, scope: !1167)
!1180 = !DILocation(line: 516, column: 33, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 515, column: 19)
!1182 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 515, column: 16)
!1183 = !DILocation(line: 517, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 517, column: 13)
!1185 = !DILocation(line: 517, column: 13, scope: !1181)
!1186 = !DILocation(line: 87, column: 39, scope: !974, inlinedAt: !1187)
!1187 = distinct !DILocation(line: 517, column: 25, scope: !1184)
!1188 = !DILocation(line: 88, column: 27, scope: !974, inlinedAt: !1187)
!1189 = !DILocation(line: 88, column: 19, scope: !974, inlinedAt: !1187)
!1190 = !DILocation(line: 89, column: 5, scope: !974, inlinedAt: !1187)
!1191 = !DILocation(line: 91, column: 20, scope: !988, inlinedAt: !1187)
!1192 = !DILocation(line: 91, column: 13, scope: !988, inlinedAt: !1187)
!1193 = !DILocation(line: 93, column: 20, scope: !988, inlinedAt: !1187)
!1194 = !DILocation(line: 93, column: 34, scope: !988, inlinedAt: !1187)
!1195 = !DILocation(line: 93, column: 13, scope: !988, inlinedAt: !1187)
!1196 = !DILocation(line: 95, column: 20, scope: !988, inlinedAt: !1187)
!1197 = !DILocation(line: 95, column: 35, scope: !988, inlinedAt: !1187)
!1198 = !DILocation(line: 95, column: 13, scope: !988, inlinedAt: !1187)
!1199 = !DILocation(line: 97, column: 20, scope: !988, inlinedAt: !1187)
!1200 = !DILocation(line: 97, column: 35, scope: !988, inlinedAt: !1187)
!1201 = !DILocation(line: 97, column: 13, scope: !988, inlinedAt: !1187)
!1202 = !DILocation(line: 99, column: 20, scope: !988, inlinedAt: !1187)
!1203 = !DILocation(line: 99, column: 35, scope: !988, inlinedAt: !1187)
!1204 = !DILocation(line: 99, column: 13, scope: !988, inlinedAt: !1187)
!1205 = !DILocation(line: 0, scope: !988, inlinedAt: !1187)
!1206 = !DILocation(line: 0, scope: !1184)
!1207 = !DILocation(line: 102, column: 1, scope: !974, inlinedAt: !1187)
!1208 = !DILocation(line: 517, column: 23, scope: !1184)
!1209 = !DILocation(line: 517, column: 18, scope: !1184)
!1210 = !DILocation(line: 0, scope: !1152)
!1211 = !DILocation(line: 521, column: 5, scope: !1152)
!1212 = distinct !DISubprogram(name: "setbitCommand", scope: !3, file: !3, line: 525, type: !850, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1221, !1222, !1223, !1224}
!1214 = !DILocalVariable(name: "c", arg: 1, scope: !1212, file: !3, line: 525, type: !714)
!1215 = !DILocalVariable(name: "o", scope: !1212, file: !3, line: 526, type: !824)
!1216 = !DILocalVariable(name: "err", scope: !1212, file: !3, line: 527, type: !835)
!1217 = !DILocalVariable(name: "bitoffset", scope: !1212, file: !3, line: 528, type: !6)
!1218 = !DILocalVariable(name: "byte", scope: !1212, file: !3, line: 529, type: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !885, line: 200, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !9, line: 145, baseType: !12)
!1221 = !DILocalVariable(name: "bit", scope: !1212, file: !3, line: 529, type: !1219)
!1222 = !DILocalVariable(name: "byteval", scope: !1212, file: !3, line: 530, type: !199)
!1223 = !DILocalVariable(name: "bitval", scope: !1212, file: !3, line: 530, type: !199)
!1224 = !DILocalVariable(name: "on", scope: !1212, file: !3, line: 531, type: !12)
!1225 = !DILocation(line: 525, column: 28, scope: !1212)
!1226 = !DILocation(line: 528, column: 5, scope: !1212)
!1227 = !DILocation(line: 531, column: 5, scope: !1212)
!1228 = !DILocation(line: 533, column: 39, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 533, column: 9)
!1230 = !DILocation(line: 533, column: 36, scope: !1229)
!1231 = !DILocation(line: 528, column: 12, scope: !1212)
!1232 = !DILocation(line: 533, column: 9, scope: !1229)
!1233 = !DILocation(line: 533, column: 63, scope: !1229)
!1234 = !DILocation(line: 533, column: 9, scope: !1212)
!1235 = !DILocation(line: 536, column: 39, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 536, column: 9)
!1237 = !DILocation(line: 536, column: 36, scope: !1236)
!1238 = !DILocation(line: 531, column: 10, scope: !1212)
!1239 = !DILocation(line: 536, column: 9, scope: !1236)
!1240 = !DILocation(line: 536, column: 56, scope: !1236)
!1241 = !DILocation(line: 536, column: 9, scope: !1212)
!1242 = !DILocation(line: 540, column: 9, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 540, column: 9)
!1244 = !DILocation(line: 540, column: 12, scope: !1243)
!1245 = !DILocation(line: 540, column: 9, scope: !1212)
!1246 = !DILocation(line: 541, column: 9, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 540, column: 18)
!1248 = !DILocation(line: 542, column: 9, scope: !1247)
!1249 = !DILocation(line: 545, column: 42, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 545, column: 9)
!1251 = !DILocation(line: 545, column: 14, scope: !1250)
!1252 = !DILocation(line: 526, column: 11, scope: !1212)
!1253 = !DILocation(line: 545, column: 54, scope: !1250)
!1254 = !DILocation(line: 545, column: 9, scope: !1212)
!1255 = !DILocation(line: 548, column: 22, scope: !1212)
!1256 = !DILocation(line: 529, column: 13, scope: !1212)
!1257 = !DILocation(line: 549, column: 29, scope: !1212)
!1258 = !DILocation(line: 549, column: 15, scope: !1212)
!1259 = !DILocation(line: 530, column: 9, scope: !1212)
!1260 = !DILocation(line: 550, column: 26, scope: !1212)
!1261 = !DILocation(line: 550, column: 13, scope: !1212)
!1262 = !DILocation(line: 529, column: 19, scope: !1212)
!1263 = !DILocation(line: 551, column: 27, scope: !1212)
!1264 = !DILocation(line: 551, column: 22, scope: !1212)
!1265 = !DILocation(line: 530, column: 18, scope: !1212)
!1266 = !DILocation(line: 554, column: 16, scope: !1212)
!1267 = !DILocation(line: 554, column: 13, scope: !1212)
!1268 = !DILocation(line: 555, column: 18, scope: !1212)
!1269 = !DILocation(line: 555, column: 21, scope: !1212)
!1270 = !DILocation(line: 555, column: 28, scope: !1212)
!1271 = !DILocation(line: 555, column: 13, scope: !1212)
!1272 = !DILocation(line: 556, column: 32, scope: !1212)
!1273 = !DILocation(line: 556, column: 30, scope: !1212)
!1274 = !DILocation(line: 557, column: 26, scope: !1212)
!1275 = !DILocation(line: 557, column: 32, scope: !1212)
!1276 = !DILocation(line: 557, column: 29, scope: !1212)
!1277 = !DILocation(line: 557, column: 5, scope: !1212)
!1278 = !DILocation(line: 558, column: 51, scope: !1212)
!1279 = !DILocation(line: 558, column: 48, scope: !1212)
!1280 = !DILocation(line: 558, column: 62, scope: !1212)
!1281 = !DILocation(line: 558, column: 66, scope: !1212)
!1282 = !{!1283, !123, i64 40}
!1283 = !{!"redisDb", !971, i64 0, !971, i64 8, !971, i64 16, !971, i64 24, !971, i64 32, !123, i64 40, !1032, i64 48, !971, i64 56}
!1284 = !DILocation(line: 558, column: 5, scope: !1212)
!1285 = !DILocation(line: 559, column: 17, scope: !1212)
!1286 = !{!1287, !1032, i64 2080}
