; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/blocked.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/blocked.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/blocked.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !22, !32, !42}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !7, line: 51, size: 24, elements: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !{!9, !15, !16, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !6, file: !7, line: 52, baseType: !10, size: 8)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 24, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !13, line: 43, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !6, file: !7, line: 53, baseType: !10, size: 8, offset: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !6, file: !7, line: 54, baseType: !14, size: 8, offset: 16)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !6, file: !7, line: 55, baseType: !18, offset: 24)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !{!21}
!21 = !DISubrange(count: -1)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !7, line: 57, size: 40, elements: !24)
!24 = !{!25, !29, !30, !31}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !23, file: !7, line: 58, baseType: !26, size: 16)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 36, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !13, line: 57, baseType: !28)
!28 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !23, file: !7, line: 59, baseType: !26, size: 16, offset: 16)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !7, line: 60, baseType: !14, size: 8, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !23, file: !7, line: 61, baseType: !18, offset: 40)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !7, line: 63, size: 72, elements: !34)
!34 = !{!35, !39, !40, !41}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !33, file: !7, line: 64, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 48, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !13, line: 79, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !33, file: !7, line: 65, baseType: !36, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !7, line: 66, baseType: !14, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !7, line: 67, baseType: !18, offset: 72)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !7, line: 69, size: 136, elements: !44)
!44 = !{!45, !49, !50, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !7, line: 70, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 60, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !13, line: 105, baseType: !48)
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !43, file: !7, line: 71, baseType: !46, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !7, line: 72, baseType: !14, size: 8, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !43, file: !7, line: 73, baseType: !18, offset: 136)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "getTimeoutFromObjectOrReply", scope: !1, file: !1, line: 78, type: !57, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !305)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !60, !173, !304, !59}
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !62, line: 780, baseType: !63)
!62 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !62, line: 723, size: 135360, elements: !64)
!64 = !{!65, !66, !67, !172, !182, !185, !190, !191, !192, !193, !195, !219, !220, !221, !222, !223, !224, !226, !227, !230, !231, !232, !233, !234, !235, !236, !237, !242, !243, !244, !245, !246, !247, !248, !249, !253, !254, !258, !259, !275, !276, !293, !294, !295, !296, !297, !298, !299, !300}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !62, line: 724, baseType: !46, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !63, file: !62, line: 725, baseType: !59, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !63, file: !62, line: 726, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !62, line: 656, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !62, line: 647, size: 512, elements: !71)
!71 = !{!72, !136, !137, !138, !139, !140, !141, !143}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !70, file: !62, line: 648, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !75, line: 82, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !75, line: 76, size: 768, elements: !77)
!77 = !{!78, !103, !104, !134, !135}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !75, line: 77, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !75, line: 65, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !75, line: 58, size: 384, elements: !82)
!82 = !{!83, !89, !93, !94, !98, !102}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !81, file: !75, line: 59, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!46, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !81, file: !75, line: 60, baseType: !90, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!4, !4, !87}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !81, file: !75, line: 61, baseType: !90, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !81, file: !75, line: 62, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!59, !4, !87, !87}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !81, file: !75, line: 63, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !4, !4}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !81, file: !75, line: 64, baseType: !99, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !76, file: !75, line: 78, baseType: !4, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !76, file: !75, line: 79, baseType: !105, size: 512, offset: 128)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, elements: !132)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !75, line: 74, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !75, line: 69, size: 256, elements: !108)
!108 = !{!109, !129, !130, !131}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !107, file: !75, line: 70, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !75, line: 56, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !75, line: 47, size: 192, elements: !114)
!114 = !{!115, !116, !127}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !75, line: 48, baseType: !4, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !113, file: !75, line: 54, baseType: !117, size: 64, offset: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !75, line: 49, size: 64, elements: !118)
!118 = !{!119, !120, !121, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !117, file: !75, line: 50, baseType: !4, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !117, file: !75, line: 51, baseType: !46, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !117, file: !75, line: 52, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !11, line: 56, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !13, line: 103, baseType: !124)
!124 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !117, file: !75, line: 53, baseType: !126, size: 64)
!126 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !75, line: 55, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !107, file: !75, line: 71, baseType: !48, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !107, file: !75, line: 72, baseType: !48, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !107, file: !75, line: 73, baseType: !48, size: 64, offset: 192)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !76, file: !75, line: 80, baseType: !124, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !76, file: !75, line: 81, baseType: !48, size: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !70, file: !62, line: 649, baseType: !73, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !70, file: !62, line: 650, baseType: !73, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !70, file: !62, line: 651, baseType: !73, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !70, file: !62, line: 652, baseType: !73, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !62, line: 653, baseType: !59, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !70, file: !62, line: 654, baseType: !142, size: 64, offset: 384)
!142 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !70, file: !62, line: 655, baseType: !144, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !146, line: 54, baseType: !147)
!146 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !146, line: 47, size: 384, elements: !148)
!148 = !{!149, !158, !159, !163, !167, !171}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !147, file: !146, line: 48, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !146, line: 40, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !146, line: 36, size: 192, elements: !153)
!153 = !{!154, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !146, line: 37, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !146, line: 38, baseType: !155, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !146, line: 39, baseType: !4, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !146, line: 49, baseType: !150, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !147, file: !146, line: 50, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!4, !4}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !147, file: !146, line: 51, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !4}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !147, file: !146, line: 52, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!59, !4, !4}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !147, file: !146, line: 53, baseType: !48, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !62, line: 727, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !62, line: 622, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !62, line: 614, size: 128, elements: !176)
!176 = !{!177, !178, !179, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !62, line: 615, baseType: !38, size: 4, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !175, file: !62, line: 616, baseType: !38, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !175, file: !62, line: 617, baseType: !38, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !175, file: !62, line: 620, baseType: !59, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !175, file: !62, line: 621, baseType: !4, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !63, file: !62, line: 728, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !7, line: 43, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !63, file: !62, line: 729, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !187, line: 40, baseType: !188)
!187 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !189, line: 129, baseType: !48)
!189 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !63, file: !62, line: 730, baseType: !183, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !63, file: !62, line: 734, baseType: !186, size: 64, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !63, file: !62, line: 735, baseType: !59, size: 32, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !63, file: !62, line: 736, baseType: !194, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !63, file: !62, line: 737, baseType: !196, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !62, line: 1307, size: 640, elements: !198)
!198 = !{!199, !200, !205, !206, !207, !208, !214, !215, !216, !217, !218}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !62, line: 1308, baseType: !184, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !197, file: !62, line: 1309, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !62, line: 1305, baseType: !203)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !60}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !197, file: !62, line: 1310, baseType: !59, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !197, file: !62, line: 1311, baseType: !184, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !62, line: 1312, baseType: !59, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !197, file: !62, line: 1315, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !62, line: 1306, baseType: !211)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !196, !194, !59, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !197, file: !62, line: 1317, baseType: !59, size: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !197, file: !62, line: 1318, baseType: !59, size: 32, offset: 416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !197, file: !62, line: 1319, baseType: !59, size: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !197, file: !62, line: 1320, baseType: !142, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !197, file: !62, line: 1320, baseType: !142, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !63, file: !62, line: 737, baseType: !196, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !63, file: !62, line: 738, baseType: !59, size: 32, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !63, file: !62, line: 739, baseType: !59, size: 32, offset: 800)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !63, file: !62, line: 740, baseType: !124, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !63, file: !62, line: 741, baseType: !144, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !63, file: !62, line: 742, baseType: !225, size: 64, offset: 960)
!225 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !63, file: !62, line: 743, baseType: !186, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !63, file: !62, line: 745, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !229, line: 34, baseType: !124)
!229 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !63, file: !62, line: 746, baseType: !228, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !63, file: !62, line: 747, baseType: !228, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !62, line: 748, baseType: !59, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !63, file: !62, line: 749, baseType: !59, size: 32, offset: 1312)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !63, file: !62, line: 750, baseType: !59, size: 32, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !63, file: !62, line: 751, baseType: !59, size: 32, offset: 1376)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !63, file: !62, line: 752, baseType: !59, size: 32, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !63, file: !62, line: 753, baseType: !238, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !239, line: 173, baseType: !240)
!239 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !189, line: 100, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !189, line: 44, baseType: !124)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !63, file: !62, line: 754, baseType: !238, size: 64, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !63, file: !62, line: 755, baseType: !183, size: 64, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !63, file: !62, line: 756, baseType: !142, size: 64, offset: 1664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !63, file: !62, line: 757, baseType: !142, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !63, file: !62, line: 758, baseType: !142, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !63, file: !62, line: 759, baseType: !142, size: 64, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !63, file: !62, line: 760, baseType: !142, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !63, file: !62, line: 763, baseType: !250, size: 328, offset: 1984)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 328, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 41)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !63, file: !62, line: 764, baseType: !59, size: 32, offset: 2336)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !63, file: !62, line: 765, baseType: !255, size: 368, offset: 2368)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 368, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 46)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !63, file: !62, line: 766, baseType: !59, size: 32, offset: 2752)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !63, file: !62, line: 767, baseType: !260, size: 256, offset: 2816)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !62, line: 673, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !62, line: 665, size: 256, elements: !262)
!262 = !{!263, !271, !272, !273, !274}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !261, file: !62, line: 666, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !62, line: 663, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !62, line: 659, size: 192, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !266, file: !62, line: 660, baseType: !194, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !266, file: !62, line: 661, baseType: !59, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !266, file: !62, line: 662, baseType: !196, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !62, line: 667, baseType: !59, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !261, file: !62, line: 668, baseType: !59, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !261, file: !62, line: 671, baseType: !59, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !261, file: !62, line: 672, baseType: !228, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !63, file: !62, line: 768, baseType: !59, size: 32, offset: 3072)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !63, file: !62, line: 769, baseType: !277, size: 704, offset: 3136)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !62, line: 703, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !62, line: 677, size: 704, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !278, file: !62, line: 679, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !62, line: 52, baseType: !142)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !278, file: !62, line: 683, baseType: !73, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !278, file: !62, line: 685, baseType: !173, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !278, file: !62, line: 689, baseType: !186, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !278, file: !62, line: 690, baseType: !173, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !278, file: !62, line: 691, baseType: !173, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !278, file: !62, line: 692, baseType: !281, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !278, file: !62, line: 692, baseType: !281, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !278, file: !62, line: 693, baseType: !59, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !278, file: !62, line: 696, baseType: !59, size: 32, offset: 544)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !278, file: !62, line: 697, baseType: !142, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !278, file: !62, line: 700, baseType: !4, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !63, file: !62, line: 770, baseType: !142, size: 64, offset: 3840)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !63, file: !62, line: 771, baseType: !144, size: 64, offset: 3904)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !63, file: !62, line: 772, baseType: !73, size: 64, offset: 3968)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !63, file: !62, line: 773, baseType: !144, size: 64, offset: 4032)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !63, file: !62, line: 774, baseType: !183, size: 64, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !63, file: !62, line: 775, baseType: !150, size: 64, offset: 4160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !63, file: !62, line: 778, baseType: !59, size: 32, offset: 4224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !63, file: !62, line: 779, baseType: !301, size: 131072, offset: 4256)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 131072, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 16384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DILocalVariable(name: "c", arg: 1, scope: !56, file: !1, line: 78, type: !60)
!307 = !DILocalVariable(name: "object", arg: 2, scope: !56, file: !1, line: 78, type: !173)
!308 = !DILocalVariable(name: "timeout", arg: 3, scope: !56, file: !1, line: 78, type: !304)
!309 = !DILocalVariable(name: "unit", arg: 4, scope: !56, file: !1, line: 78, type: !59)
!310 = !DILocalVariable(name: "tval", scope: !56, file: !1, line: 79, type: !142)
!311 = !DILocation(line: 78, column: 41, scope: !56)
!312 = !DILocation(line: 78, column: 50, scope: !56)
!313 = !DILocation(line: 78, column: 68, scope: !56)
!314 = !DILocation(line: 78, column: 81, scope: !56)
!315 = !DILocation(line: 79, column: 5, scope: !56)
!316 = !DILocation(line: 79, column: 15, scope: !56)
!317 = !DILocation(line: 81, column: 9, scope: !318)
!318 = distinct !DILexicalBlock(scope: !56, file: !1, line: 81, column: 9)
!319 = !DILocation(line: 82, column: 54, scope: !318)
!320 = !DILocation(line: 81, column: 9, scope: !56)
!321 = !DILocation(line: 85, column: 9, scope: !322)
!322 = distinct !DILexicalBlock(scope: !56, file: !1, line: 85, column: 9)
!323 = !{!324, !324, i64 0}
!324 = !{!"long long", !325, i64 0}
!325 = !{!"omnipotent char", !326, i64 0}
!326 = !{!"Simple C/C++ TBAA"}
!327 = !DILocation(line: 85, column: 14, scope: !322)
!328 = !DILocation(line: 85, column: 9, scope: !56)
!329 = !DILocation(line: 86, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !322, file: !1, line: 85, column: 19)
!331 = !DILocation(line: 87, column: 9, scope: !330)
!332 = !DILocation(line: 90, column: 14, scope: !333)
!333 = distinct !DILexicalBlock(scope: !56, file: !1, line: 90, column: 9)
!334 = !DILocation(line: 90, column: 9, scope: !56)
!335 = !DILocation(line: 91, column: 18, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !1, line: 91, column: 13)
!337 = distinct !DILexicalBlock(scope: !333, file: !1, line: 90, column: 19)
!338 = !DILocation(line: 91, column: 13, scope: !337)
!339 = !DILocation(line: 91, column: 40, scope: !336)
!340 = !DILocation(line: 91, column: 35, scope: !336)
!341 = !DILocation(line: 92, column: 17, scope: !337)
!342 = !DILocation(line: 92, column: 14, scope: !337)
!343 = !DILocation(line: 93, column: 5, scope: !337)
!344 = !DILocation(line: 94, column: 16, scope: !56)
!345 = !DILocation(line: 94, column: 14, scope: !56)
!346 = !DILocation(line: 96, column: 5, scope: !56)
!347 = !DILocation(line: 0, scope: !56)
!348 = !DILocation(line: 0, scope: !318)
!349 = !DILocation(line: 97, column: 1, scope: !56)
!350 = distinct !DISubprogram(name: "blockClient", scope: !1, file: !1, line: 102, type: !351, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !353)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !60, !59}
!353 = !{!354, !355}
!354 = !DILocalVariable(name: "c", arg: 1, scope: !350, file: !1, line: 102, type: !60)
!355 = !DILocalVariable(name: "btype", arg: 2, scope: !350, file: !1, line: 102, type: !59)
!356 = !DILocation(line: 102, column: 26, scope: !350)
!357 = !DILocation(line: 102, column: 33, scope: !350)
!358 = !DILocation(line: 103, column: 8, scope: !350)
!359 = !DILocation(line: 103, column: 14, scope: !350)
!360 = !{!361, !363, i64 160}
!361 = !{!"client", !362, i64 0, !363, i64 8, !364, i64 16, !364, i64 24, !364, i64 32, !362, i64 40, !364, i64 48, !362, i64 56, !363, i64 64, !364, i64 72, !364, i64 80, !364, i64 88, !363, i64 96, !363, i64 100, !362, i64 104, !364, i64 112, !324, i64 120, !362, i64 128, !362, i64 136, !362, i64 144, !362, i64 152, !363, i64 160, !363, i64 164, !363, i64 168, !363, i64 172, !363, i64 176, !362, i64 184, !362, i64 192, !364, i64 200, !324, i64 208, !324, i64 216, !324, i64 224, !324, i64 232, !324, i64 240, !325, i64 248, !363, i64 292, !325, i64 296, !363, i64 344, !365, i64 352, !363, i64 384, !366, i64 392, !324, i64 480, !364, i64 488, !364, i64 496, !364, i64 504, !364, i64 512, !364, i64 520, !363, i64 528, !325, i64 532}
!362 = !{!"long", !325, i64 0}
!363 = !{!"int", !325, i64 0}
!364 = !{!"any pointer", !325, i64 0}
!365 = !{!"multiState", !364, i64 0, !363, i64 8, !363, i64 12, !363, i64 16, !362, i64 24}
!366 = !{!"blockingState", !324, i64 0, !364, i64 8, !364, i64 16, !362, i64 24, !364, i64 32, !364, i64 40, !324, i64 48, !324, i64 56, !363, i64 64, !363, i64 68, !324, i64 72, !364, i64 80}
!367 = !DILocation(line: 104, column: 8, scope: !350)
!368 = !DILocation(line: 104, column: 14, scope: !350)
!369 = !{!361, !363, i64 384}
!370 = !DILocation(line: 105, column: 27, scope: !350)
!371 = !{!372, !363, i64 2736}
!372 = !{!"redisServer", !363, i64 0, !364, i64 8, !364, i64 16, !364, i64 24, !363, i64 32, !363, i64 36, !363, i64 40, !364, i64 48, !364, i64 56, !364, i64 64, !364, i64 72, !363, i64 80, !363, i64 84, !363, i64 88, !363, i64 92, !364, i64 96, !364, i64 104, !363, i64 112, !363, i64 116, !325, i64 120, !363, i64 164, !362, i64 168, !363, i64 176, !364, i64 184, !364, i64 192, !364, i64 200, !325, i64 208, !363, i64 216, !363, i64 220, !325, i64 224, !363, i64 352, !364, i64 360, !363, i64 368, !325, i64 372, !363, i64 436, !363, i64 440, !325, i64 444, !363, i64 508, !364, i64 512, !364, i64 520, !364, i64 528, !364, i64 536, !364, i64 544, !364, i64 552, !364, i64 560, !363, i64 568, !324, i64 576, !325, i64 584, !364, i64 840, !362, i64 848, !363, i64 856, !363, i64 860, !362, i64 864, !362, i64 872, !362, i64 880, !362, i64 888, !364, i64 896, !364, i64 904, !364, i64 912, !364, i64 920, !364, i64 928, !364, i64 936, !364, i64 944, !364, i64 952, !364, i64 960, !364, i64 968, !364, i64 976, !364, i64 984, !364, i64 992, !362, i64 1000, !324, i64 1008, !324, i64 1016, !324, i64 1024, !373, i64 1032, !324, i64 1040, !324, i64 1048, !324, i64 1056, !324, i64 1064, !324, i64 1072, !324, i64 1080, !324, i64 1088, !324, i64 1096, !324, i64 1104, !362, i64 1112, !324, i64 1120, !373, i64 1128, !324, i64 1136, !324, i64 1144, !324, i64 1152, !324, i64 1160, !364, i64 1168, !324, i64 1176, !324, i64 1184, !362, i64 1192, !374, i64 1200, !324, i64 1240, !324, i64 1248, !362, i64 1256, !362, i64 1264, !325, i64 1272, !363, i64 1728, !363, i64 1732, !363, i64 1736, !363, i64 1740, !363, i64 1744, !362, i64 1752, !363, i64 1760, !363, i64 1764, !363, i64 1768, !363, i64 1772, !362, i64 1776, !362, i64 1784, !363, i64 1792, !363, i64 1796, !363, i64 1800, !363, i64 1804, !325, i64 1808, !363, i64 1880, !363, i64 1884, !364, i64 1888, !363, i64 1896, !363, i64 1900, !362, i64 1904, !362, i64 1912, !362, i64 1920, !362, i64 1928, !363, i64 1936, !363, i64 1940, !364, i64 1944, !364, i64 1952, !363, i64 1960, !363, i64 1964, !362, i64 1968, !362, i64 1976, !362, i64 1984, !362, i64 1992, !363, i64 2000, !362, i64 2008, !363, i64 2016, !363, i64 2020, !363, i64 2024, !363, i64 2028, !363, i64 2032, !363, i64 2036, !363, i64 2040, !363, i64 2044, !363, i64 2048, !363, i64 2052, !363, i64 2056, !363, i64 2060, !363, i64 2064, !364, i64 2072, !324, i64 2080, !324, i64 2088, !363, i64 2096, !364, i64 2104, !363, i64 2112, !364, i64 2120, !363, i64 2128, !363, i64 2132, !362, i64 2136, !362, i64 2144, !362, i64 2152, !362, i64 2160, !363, i64 2168, !363, i64 2172, !363, i64 2176, !363, i64 2180, !363, i64 2184, !363, i64 2188, !325, i64 2192, !375, i64 2200, !376, i64 2224, !364, i64 2240, !363, i64 2248, !364, i64 2256, !363, i64 2264, !325, i64 2268, !325, i64 2309, !324, i64 2352, !324, i64 2360, !363, i64 2368, !363, i64 2372, !364, i64 2376, !324, i64 2384, !324, i64 2392, !324, i64 2400, !324, i64 2408, !362, i64 2416, !362, i64 2424, !363, i64 2432, !363, i64 2436, !363, i64 2440, !363, i64 2444, !363, i64 2448, !364, i64 2456, !364, i64 2464, !363, i64 2472, !363, i64 2476, !364, i64 2480, !364, i64 2488, !363, i64 2496, !363, i64 2500, !362, i64 2504, !362, i64 2512, !362, i64 2520, !363, i64 2528, !363, i64 2532, !364, i64 2536, !362, i64 2544, !363, i64 2552, !363, i64 2556, !363, i64 2560, !362, i64 2568, !363, i64 2576, !363, i64 2580, !363, i64 2584, !364, i64 2592, !325, i64 2600, !324, i64 2648, !363, i64 2656, !364, i64 2664, !364, i64 2672, !363, i64 2680, !364, i64 2688, !363, i64 2696, !363, i64 2700, !324, i64 2704, !363, i64 2712, !363, i64 2716, !363, i64 2720, !363, i64 2724, !324, i64 2728, !363, i64 2736, !325, i64 2740, !364, i64 2768, !364, i64 2776, !363, i64 2784, !363, i64 2788, !363, i64 2792, !363, i64 2796, !362, i64 2800, !362, i64 2808, !362, i64 2816, !362, i64 2824, !362, i64 2832, !362, i64 2840, !362, i64 2848, !362, i64 2856, !363, i64 2864, !363, i64 2868, !362, i64 2872, !362, i64 2880, !363, i64 2888, !324, i64 2896, !364, i64 2904, !364, i64 2912, !363, i64 2920, !363, i64 2924, !324, i64 2928, !364, i64 2936, !364, i64 2944, !363, i64 2952, !363, i64 2956, !363, i64 2960, !363, i64 2964, !364, i64 2968, !363, i64 2976, !363, i64 2980, !363, i64 2984, !364, i64 2992, !364, i64 3000, !364, i64 3008, !364, i64 3016, !324, i64 3024, !324, i64 3032, !324, i64 3040, !363, i64 3048, !363, i64 3052, !363, i64 3056, !363, i64 3060, !363, i64 3064, !363, i64 3068, !363, i64 3072, !363, i64 3076, !363, i64 3080, !363, i64 3084, !363, i64 3088, !324, i64 3096, !364, i64 3104, !364, i64 3112, !364, i64 3120, !363, i64 3128, !363, i64 3132, !363, i64 3136, !362, i64 3144, !364, i64 3152, !364, i64 3160, !364, i64 3168}
!373 = !{!"double", !325, i64 0}
!374 = !{!"malloc_stats", !362, i64 0, !362, i64 8, !362, i64 16, !362, i64 24, !362, i64 32}
!375 = !{!"", !363, i64 0, !362, i64 8, !324, i64 16}
!376 = !{!"redisOpArray", !364, i64 0, !363, i64 8}
!377 = !DILocation(line: 106, column: 5, scope: !350)
!378 = !DILocation(line: 106, column: 42, scope: !350)
!379 = !{!363, !363, i64 0}
!380 = !DILocation(line: 107, column: 1, scope: !350)
!381 = distinct !DISubprogram(name: "processUnblockedClients", scope: !1, file: !1, line: 112, type: !382, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !{!385, !386}
!385 = !DILocalVariable(name: "ln", scope: !381, file: !1, line: 113, type: !150)
!386 = !DILocalVariable(name: "c", scope: !381, file: !1, line: 114, type: !60)
!387 = !DILocation(line: 116, column: 5, scope: !381)
!388 = !DILocation(line: 116, column: 12, scope: !381)
!389 = !{!372, !364, i64 2768}
!390 = !{!391, !362, i64 40}
!391 = !{!"list", !364, i64 0, !364, i64 8, !364, i64 16, !364, i64 24, !364, i64 32, !362, i64 40}
!392 = !DILocation(line: 117, column: 14, scope: !393)
!393 = distinct !DILexicalBlock(scope: !381, file: !1, line: 116, column: 50)
!394 = !{!391, !364, i64 0}
!395 = !DILocation(line: 113, column: 15, scope: !381)
!396 = !DILocation(line: 118, column: 9, scope: !393)
!397 = !DILocation(line: 119, column: 17, scope: !393)
!398 = !{!399, !364, i64 16}
!399 = !{!"listNode", !364, i64 0, !364, i64 8, !364, i64 16}
!400 = !DILocation(line: 114, column: 13, scope: !381)
!401 = !DILocation(line: 120, column: 9, scope: !393)
!402 = !DILocation(line: 121, column: 12, scope: !393)
!403 = !DILocation(line: 121, column: 18, scope: !393)
!404 = !DILocation(line: 127, column: 24, scope: !405)
!405 = distinct !DILexicalBlock(scope: !393, file: !1, line: 127, column: 13)
!406 = !DILocation(line: 127, column: 13, scope: !393)
!407 = !DILocation(line: 128, column: 20, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !1, line: 128, column: 17)
!409 = distinct !DILexicalBlock(scope: !405, file: !1, line: 127, column: 43)
!410 = !{!361, !364, i64 32}
!411 = !DILocation(line: 128, column: 17, scope: !408)
!412 = !DILocation(line: 128, column: 29, scope: !408)
!413 = !DILocalVariable(name: "s", arg: 1, scope: !414, file: !7, line: 87, type: !419)
!414 = distinct !DISubprogram(name: "sdslen", scope: !7, file: !7, line: 87, type: !415, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !420)
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !419}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 58, baseType: !48)
!418 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!420 = !{!413, !421}
!421 = !DILocalVariable(name: "flags", scope: !414, file: !7, line: 88, type: !14)
!422 = !DILocation(line: 87, column: 39, scope: !414, inlinedAt: !423)
!423 = distinct !DILocation(line: 128, column: 32, scope: !408)
!424 = !DILocation(line: 88, column: 27, scope: !414, inlinedAt: !423)
!425 = !{!325, !325, i64 0}
!426 = !DILocation(line: 88, column: 19, scope: !414, inlinedAt: !423)
!427 = !DILocation(line: 89, column: 5, scope: !414, inlinedAt: !423)
!428 = !DILocation(line: 91, column: 20, scope: !429, inlinedAt: !423)
!429 = distinct !DILexicalBlock(scope: !414, file: !7, line: 89, column: 33)
!430 = !DILocation(line: 91, column: 13, scope: !429, inlinedAt: !423)
!431 = !DILocation(line: 93, column: 20, scope: !429, inlinedAt: !423)
!432 = !DILocation(line: 93, column: 34, scope: !429, inlinedAt: !423)
!433 = !DILocation(line: 93, column: 13, scope: !429, inlinedAt: !423)
!434 = !DILocation(line: 95, column: 20, scope: !429, inlinedAt: !423)
!435 = !DILocation(line: 95, column: 35, scope: !429, inlinedAt: !423)
!436 = !{!437, !437, i64 0}
!437 = !{!"short", !325, i64 0}
!438 = !DILocation(line: 95, column: 13, scope: !429, inlinedAt: !423)
!439 = !DILocation(line: 97, column: 20, scope: !429, inlinedAt: !423)
!440 = !DILocation(line: 97, column: 35, scope: !429, inlinedAt: !423)
!441 = !DILocation(line: 97, column: 13, scope: !429, inlinedAt: !423)
!442 = !DILocation(line: 99, column: 20, scope: !429, inlinedAt: !423)
!443 = !DILocation(line: 99, column: 35, scope: !429, inlinedAt: !423)
!444 = !{!362, !362, i64 0}
!445 = !DILocation(line: 99, column: 13, scope: !429, inlinedAt: !423)
!446 = !DILocation(line: 101, column: 5, scope: !414, inlinedAt: !423)
!447 = !DILocation(line: 102, column: 1, scope: !414, inlinedAt: !423)
!448 = !DILocation(line: 128, column: 17, scope: !409)
!449 = !DILocation(line: 0, scope: !429, inlinedAt: !423)
!450 = !DILocation(line: 0, scope: !408)
!451 = !DILocation(line: 128, column: 52, scope: !408)
!452 = !DILocation(line: 129, column: 17, scope: !453)
!453 = distinct !DILexicalBlock(scope: !408, file: !1, line: 128, column: 57)
!454 = !DILocation(line: 130, column: 13, scope: !453)
!455 = distinct !{!455, !387, !456}
!456 = !DILocation(line: 132, column: 5, scope: !381)
!457 = !DILocation(line: 133, column: 1, scope: !381)
!458 = distinct !DISubprogram(name: "queueClientForReprocessing", scope: !1, file: !1, line: 151, type: !203, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !459)
!459 = !{!460}
!460 = !DILocalVariable(name: "c", arg: 1, scope: !458, file: !1, line: 151, type: !60)
!461 = !DILocation(line: 151, column: 41, scope: !458)
!462 = !DILocation(line: 154, column: 14, scope: !463)
!463 = distinct !DILexicalBlock(scope: !458, file: !1, line: 154, column: 9)
!464 = !DILocation(line: 154, column: 20, scope: !463)
!465 = !DILocation(line: 154, column: 9, scope: !458)
!466 = !DILocation(line: 155, column: 18, scope: !467)
!467 = distinct !DILexicalBlock(scope: !463, file: !1, line: 154, column: 41)
!468 = !DILocation(line: 156, column: 32, scope: !467)
!469 = !DILocation(line: 156, column: 50, scope: !467)
!470 = !DILocation(line: 156, column: 9, scope: !467)
!471 = !DILocation(line: 157, column: 5, scope: !467)
!472 = !DILocation(line: 158, column: 1, scope: !458)
!473 = distinct !DISubprogram(name: "unblockClient", scope: !1, file: !1, line: 162, type: !203, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !474)
!474 = !{!475}
!475 = !DILocalVariable(name: "c", arg: 1, scope: !473, file: !1, line: 162, type: !60)
!476 = !DILocation(line: 162, column: 28, scope: !473)
!477 = !DILocation(line: 163, column: 12, scope: !478)
!478 = distinct !DILexicalBlock(scope: !473, file: !1, line: 163, column: 9)
!479 = !DILocation(line: 163, column: 18, scope: !478)
!480 = !DILocation(line: 163, column: 34, scope: !478)
!481 = !DILocation(line: 164, column: 18, scope: !478)
!482 = !DILocation(line: 164, column: 34, scope: !478)
!483 = !DILocation(line: 165, column: 18, scope: !478)
!484 = !DILocation(line: 163, column: 9, scope: !473)
!485 = !DILocation(line: 166, column: 9, scope: !486)
!486 = distinct !DILexicalBlock(scope: !478, file: !1, line: 165, column: 37)
!487 = !DILocation(line: 167, column: 5, scope: !486)
!488 = !DILocation(line: 167, column: 25, scope: !489)
!489 = distinct !DILexicalBlock(scope: !478, file: !1, line: 167, column: 16)
!490 = !DILocation(line: 167, column: 16, scope: !478)
!491 = !DILocation(line: 168, column: 9, scope: !492)
!492 = distinct !DILexicalBlock(scope: !489, file: !1, line: 167, column: 42)
!493 = !DILocation(line: 169, column: 5, scope: !492)
!494 = !DILocation(line: 169, column: 25, scope: !495)
!495 = distinct !DILexicalBlock(scope: !489, file: !1, line: 169, column: 16)
!496 = !DILocation(line: 169, column: 16, scope: !489)
!497 = !DILocation(line: 170, column: 9, scope: !498)
!498 = distinct !DILexicalBlock(scope: !495, file: !1, line: 169, column: 44)
!499 = !DILocation(line: 172, column: 9, scope: !500)
!500 = distinct !DILexicalBlock(scope: !495, file: !1, line: 171, column: 12)
!501 = !DILocation(line: 176, column: 27, scope: !473)
!502 = !DILocation(line: 177, column: 39, scope: !473)
!503 = !DILocation(line: 177, column: 5, scope: !473)
!504 = !DILocation(line: 177, column: 45, scope: !473)
!505 = !DILocation(line: 178, column: 8, scope: !473)
!506 = !DILocation(line: 178, column: 14, scope: !473)
!507 = !DILocation(line: 179, column: 14, scope: !473)
!508 = !DILocation(line: 151, column: 41, scope: !458, inlinedAt: !509)
!509 = distinct !DILocation(line: 180, column: 5, scope: !473)
!510 = !DILocation(line: 154, column: 20, scope: !463, inlinedAt: !509)
!511 = !DILocation(line: 154, column: 9, scope: !458, inlinedAt: !509)
!512 = !DILocation(line: 155, column: 18, scope: !467, inlinedAt: !509)
!513 = !DILocation(line: 156, column: 32, scope: !467, inlinedAt: !509)
!514 = !DILocation(line: 156, column: 50, scope: !467, inlinedAt: !509)
!515 = !DILocation(line: 156, column: 9, scope: !467, inlinedAt: !509)
!516 = !DILocation(line: 157, column: 5, scope: !467, inlinedAt: !509)
!517 = !DILocation(line: 158, column: 1, scope: !458, inlinedAt: !509)
!518 = !DILocation(line: 181, column: 1, scope: !473)
!519 = distinct !DISubprogram(name: "unblockClientWaitingData", scope: !1, file: !1, line: 543, type: !203, isLocal: false, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !520)
!520 = !{!521, !522, !523, !535, !536}
!521 = !DILocalVariable(name: "c", arg: 1, scope: !519, file: !1, line: 543, type: !60)
!522 = !DILocalVariable(name: "de", scope: !519, file: !1, line: 544, type: !111)
!523 = !DILocalVariable(name: "di", scope: !519, file: !1, line: 545, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !75, line: 95, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !75, line: 88, size: 384, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !526, file: !75, line: 89, baseType: !73, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !526, file: !75, line: 90, baseType: !124, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !526, file: !75, line: 91, baseType: !59, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !526, file: !75, line: 91, baseType: !59, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !526, file: !75, line: 92, baseType: !111, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !526, file: !75, line: 92, baseType: !111, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !526, file: !75, line: 94, baseType: !142, size: 64, offset: 320)
!535 = !DILocalVariable(name: "l", scope: !519, file: !1, line: 546, type: !144)
!536 = !DILocalVariable(name: "key", scope: !537, file: !1, line: 552, type: !173)
!537 = distinct !DILexicalBlock(scope: !519, file: !1, line: 551, column: 40)
!538 = !DILocation(line: 543, column: 39, scope: !519)
!539 = !DILocation(line: 548, column: 5, scope: !519)
!540 = !{!361, !364, i64 400}
!541 = !{!542, !362, i64 24}
!542 = !{!"dictht", !364, i64 0, !362, i64 8, !362, i64 16, !362, i64 24}
!543 = !DILocation(line: 549, column: 10, scope: !519)
!544 = !DILocation(line: 545, column: 19, scope: !519)
!545 = !DILocation(line: 551, column: 5, scope: !519)
!546 = !DILocation(line: 551, column: 17, scope: !519)
!547 = !DILocation(line: 544, column: 16, scope: !519)
!548 = !DILocation(line: 551, column: 31, scope: !519)
!549 = !DILocation(line: 552, column: 21, scope: !537)
!550 = !{!551, !364, i64 0}
!551 = !{!"dictEntry", !364, i64 0, !325, i64 8, !364, i64 16}
!552 = !DILocation(line: 555, column: 31, scope: !537)
!553 = !{!361, !364, i64 16}
!554 = !DILocation(line: 555, column: 35, scope: !537)
!555 = !{!556, !364, i64 16}
!556 = !{!"redisDb", !364, i64 0, !364, i64 8, !364, i64 16, !364, i64 24, !364, i64 32, !363, i64 40, !324, i64 48, !364, i64 56}
!557 = !DILocation(line: 555, column: 13, scope: !537)
!558 = !DILocation(line: 546, column: 11, scope: !519)
!559 = !DILocation(line: 556, column: 9, scope: !537)
!560 = !DILocation(line: 552, column: 15, scope: !537)
!561 = !DILocation(line: 557, column: 23, scope: !537)
!562 = !DILocation(line: 557, column: 9, scope: !537)
!563 = !DILocation(line: 559, column: 13, scope: !564)
!564 = distinct !DILexicalBlock(scope: !537, file: !1, line: 559, column: 13)
!565 = !DILocation(line: 559, column: 27, scope: !564)
!566 = !DILocation(line: 559, column: 13, scope: !537)
!567 = !DILocation(line: 560, column: 27, scope: !564)
!568 = !DILocation(line: 560, column: 31, scope: !564)
!569 = !DILocation(line: 560, column: 13, scope: !564)
!570 = distinct !{!570, !545, !571}
!571 = !DILocation(line: 561, column: 5, scope: !519)
!572 = !DILocation(line: 562, column: 5, scope: !519)
!573 = !DILocation(line: 565, column: 23, scope: !519)
!574 = !DILocation(line: 565, column: 5, scope: !519)
!575 = !DILocation(line: 566, column: 17, scope: !576)
!576 = distinct !DILexicalBlock(scope: !519, file: !1, line: 566, column: 9)
!577 = !{!361, !364, i64 408}
!578 = !DILocation(line: 566, column: 9, scope: !576)
!579 = !DILocation(line: 566, column: 9, scope: !519)
!580 = !DILocation(line: 567, column: 9, scope: !581)
!581 = distinct !DILexicalBlock(scope: !576, file: !1, line: 566, column: 25)
!582 = !DILocation(line: 568, column: 24, scope: !581)
!583 = !DILocation(line: 569, column: 5, scope: !581)
!584 = !DILocation(line: 570, column: 17, scope: !585)
!585 = distinct !DILexicalBlock(scope: !519, file: !1, line: 570, column: 9)
!586 = !{!361, !364, i64 424}
!587 = !DILocation(line: 570, column: 9, scope: !585)
!588 = !DILocation(line: 570, column: 9, scope: !519)
!589 = !DILocation(line: 571, column: 9, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !1, line: 570, column: 30)
!591 = !DILocation(line: 572, column: 30, scope: !590)
!592 = !{!361, !364, i64 432}
!593 = !DILocation(line: 572, column: 9, scope: !590)
!594 = !DILocation(line: 573, column: 29, scope: !590)
!595 = !{!364, !364, i64 0}
!596 = !DILocation(line: 575, column: 5, scope: !590)
!597 = !DILocation(line: 576, column: 1, scope: !519)
!598 = distinct !DISubprogram(name: "replyToBlockedClientTimedOut", scope: !1, file: !1, line: 186, type: !203, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !599)
!599 = !{!600}
!600 = !DILocalVariable(name: "c", arg: 1, scope: !598, file: !1, line: 186, type: !60)
!601 = !DILocation(line: 186, column: 43, scope: !598)
!602 = !DILocation(line: 187, column: 12, scope: !603)
!603 = distinct !DILexicalBlock(scope: !598, file: !1, line: 187, column: 9)
!604 = !DILocation(line: 187, column: 18, scope: !603)
!605 = !DILocation(line: 187, column: 34, scope: !603)
!606 = !DILocation(line: 188, column: 18, scope: !603)
!607 = !DILocation(line: 188, column: 34, scope: !603)
!608 = !DILocation(line: 189, column: 18, scope: !603)
!609 = !DILocation(line: 187, column: 9, scope: !598)
!610 = !DILocation(line: 190, column: 27, scope: !611)
!611 = distinct !DILexicalBlock(scope: !603, file: !1, line: 189, column: 37)
!612 = !{!613, !364, i64 88}
!613 = !{!"sharedObjectsStruct", !364, i64 0, !364, i64 8, !364, i64 16, !364, i64 24, !364, i64 32, !364, i64 40, !364, i64 48, !364, i64 56, !364, i64 64, !364, i64 72, !364, i64 80, !364, i64 88, !364, i64 96, !364, i64 104, !364, i64 112, !364, i64 120, !364, i64 128, !364, i64 136, !364, i64 144, !364, i64 152, !364, i64 160, !364, i64 168, !364, i64 176, !364, i64 184, !364, i64 192, !364, i64 200, !364, i64 208, !364, i64 216, !364, i64 224, !364, i64 232, !364, i64 240, !364, i64 248, !364, i64 256, !364, i64 264, !364, i64 272, !364, i64 280, !364, i64 288, !364, i64 296, !364, i64 304, !364, i64 312, !364, i64 320, !364, i64 328, !364, i64 336, !364, i64 344, !364, i64 352, !364, i64 360, !325, i64 368, !325, i64 448, !325, i64 80448, !325, i64 80704, !364, i64 80960, !364, i64 80968}
!614 = !DILocation(line: 190, column: 9, scope: !611)
!615 = !DILocation(line: 191, column: 5, scope: !611)
!616 = !DILocation(line: 191, column: 25, scope: !617)
!617 = distinct !DILexicalBlock(scope: !603, file: !1, line: 191, column: 16)
!618 = !DILocation(line: 191, column: 16, scope: !603)
!619 = !DILocation(line: 192, column: 65, scope: !620)
!620 = distinct !DILexicalBlock(scope: !617, file: !1, line: 191, column: 42)
!621 = !{!361, !324, i64 464}
!622 = !DILocation(line: 192, column: 28, scope: !620)
!623 = !DILocation(line: 192, column: 9, scope: !620)
!624 = !DILocation(line: 193, column: 5, scope: !620)
!625 = !DILocation(line: 193, column: 25, scope: !626)
!626 = distinct !DILexicalBlock(scope: !617, file: !1, line: 193, column: 16)
!627 = !DILocation(line: 193, column: 16, scope: !617)
!628 = !DILocation(line: 194, column: 9, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !1, line: 193, column: 44)
!630 = !DILocation(line: 196, column: 9, scope: !631)
!631 = distinct !DILexicalBlock(scope: !626, file: !1, line: 195, column: 12)
!632 = !DILocation(line: 198, column: 1, scope: !598)
!633 = distinct !DISubprogram(name: "disconnectAllBlockedClients", scope: !1, file: !1, line: 207, type: !382, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !634)
!634 = !{!635, !636, !642}
!635 = !DILocalVariable(name: "ln", scope: !633, file: !1, line: 208, type: !150)
!636 = !DILocalVariable(name: "li", scope: !633, file: !1, line: 209, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !146, line: 45, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !146, line: 42, size: 128, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !146, line: 43, baseType: !150, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !638, file: !146, line: 44, baseType: !59, size: 32, offset: 64)
!642 = !DILocalVariable(name: "c", scope: !643, file: !1, line: 213, type: !60)
!643 = distinct !DILexicalBlock(scope: !633, file: !1, line: 212, column: 33)
!644 = !DILocation(line: 209, column: 5, scope: !633)
!645 = !DILocation(line: 211, column: 23, scope: !633)
!646 = !{!372, !364, i64 512}
!647 = !DILocation(line: 209, column: 14, scope: !633)
!648 = !DILocation(line: 211, column: 5, scope: !633)
!649 = !DILocation(line: 212, column: 5, scope: !633)
!650 = !DILocation(line: 212, column: 17, scope: !633)
!651 = !DILocation(line: 208, column: 15, scope: !633)
!652 = !DILocation(line: 213, column: 21, scope: !643)
!653 = !DILocation(line: 213, column: 17, scope: !643)
!654 = !DILocation(line: 215, column: 16, scope: !655)
!655 = distinct !DILexicalBlock(scope: !643, file: !1, line: 215, column: 13)
!656 = !DILocation(line: 215, column: 22, scope: !655)
!657 = !DILocation(line: 215, column: 13, scope: !643)
!658 = !DILocation(line: 216, column: 27, scope: !659)
!659 = distinct !DILexicalBlock(scope: !655, file: !1, line: 215, column: 40)
!660 = !DILocation(line: 216, column: 13, scope: !659)
!661 = !DILocation(line: 219, column: 13, scope: !659)
!662 = !DILocation(line: 220, column: 22, scope: !659)
!663 = !DILocation(line: 221, column: 9, scope: !659)
!664 = distinct !{!664, !649, !665}
!665 = !DILocation(line: 222, column: 5, scope: !633)
!666 = !DILocation(line: 223, column: 1, scope: !633)
!667 = distinct !DISubprogram(name: "handleClientsBlockedOnKeys", scope: !1, file: !1, line: 246, type: !382, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !668)
!668 = !{!669, !671, !673, !680, !681, !684, !687, !688, !690, !691, !692, !693, !694, !697, !700, !701, !702, !704, !705, !706, !708, !709, !712, !745, !748, !749, !750, !752, !754, !762, !765, !773, !774}
!669 = !DILocalVariable(name: "l", scope: !670, file: !1, line: 248, type: !144)
!670 = distinct !DILexicalBlock(scope: !667, file: !1, line: 247, column: 47)
!671 = !DILocalVariable(name: "ln", scope: !672, file: !1, line: 258, type: !150)
!672 = distinct !DILexicalBlock(scope: !670, file: !1, line: 257, column: 35)
!673 = !DILocalVariable(name: "rl", scope: !672, file: !1, line: 259, type: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "readyList", file: !62, line: 719, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "readyList", file: !62, line: 716, size: 128, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !676, file: !62, line: 717, baseType: !68, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !676, file: !62, line: 718, baseType: !173, size: 64, offset: 64)
!680 = !DILocalVariable(name: "o", scope: !672, file: !1, line: 266, type: !173)
!681 = !DILocalVariable(name: "de", scope: !682, file: !1, line: 268, type: !111)
!682 = distinct !DILexicalBlock(scope: !683, file: !1, line: 267, column: 51)
!683 = distinct !DILexicalBlock(scope: !672, file: !1, line: 267, column: 17)
!684 = !DILocalVariable(name: "clients", scope: !685, file: !1, line: 274, type: !144)
!685 = distinct !DILexicalBlock(scope: !686, file: !1, line: 273, column: 25)
!686 = distinct !DILexicalBlock(scope: !682, file: !1, line: 273, column: 21)
!687 = !DILocalVariable(name: "numclients", scope: !685, file: !1, line: 275, type: !59)
!688 = !DILocalVariable(name: "clientnode", scope: !689, file: !1, line: 278, type: !150)
!689 = distinct !DILexicalBlock(scope: !685, file: !1, line: 277, column: 41)
!690 = !DILocalVariable(name: "receiver", scope: !689, file: !1, line: 279, type: !60)
!691 = !DILocalVariable(name: "dstkey", scope: !689, file: !1, line: 289, type: !173)
!692 = !DILocalVariable(name: "where", scope: !689, file: !1, line: 290, type: !59)
!693 = !DILocalVariable(name: "value", scope: !689, file: !1, line: 293, type: !173)
!694 = !DILocalVariable(name: "de", scope: !695, file: !1, line: 329, type: !111)
!695 = distinct !DILexicalBlock(scope: !696, file: !1, line: 328, column: 56)
!696 = distinct !DILexicalBlock(scope: !683, file: !1, line: 328, column: 22)
!697 = !DILocalVariable(name: "clients", scope: !698, file: !1, line: 335, type: !144)
!698 = distinct !DILexicalBlock(scope: !699, file: !1, line: 334, column: 25)
!699 = distinct !DILexicalBlock(scope: !695, file: !1, line: 334, column: 21)
!700 = !DILocalVariable(name: "numclients", scope: !698, file: !1, line: 336, type: !59)
!701 = !DILocalVariable(name: "zcard", scope: !698, file: !1, line: 337, type: !48)
!702 = !DILocalVariable(name: "clientnode", scope: !703, file: !1, line: 340, type: !150)
!703 = distinct !DILexicalBlock(scope: !698, file: !1, line: 339, column: 50)
!704 = !DILocalVariable(name: "receiver", scope: !703, file: !1, line: 341, type: !60)
!705 = !DILocalVariable(name: "where", scope: !703, file: !1, line: 351, type: !59)
!706 = !DILocalVariable(name: "argv", scope: !703, file: !1, line: 359, type: !707)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 128, elements: !132)
!708 = !DILocalVariable(name: "cmd", scope: !703, file: !1, line: 360, type: !196)
!709 = !DILocalVariable(name: "de", scope: !710, file: !1, line: 376, type: !111)
!710 = distinct !DILexicalBlock(scope: !711, file: !1, line: 375, column: 58)
!711 = distinct !DILexicalBlock(scope: !696, file: !1, line: 375, column: 22)
!712 = !DILocalVariable(name: "s", scope: !710, file: !1, line: 377, type: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !715, line: 21, baseType: !716)
!715 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !715, line: 16, size: 320, elements: !717)
!717 = !{!718, !737, !738, !744}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !716, file: !715, line: 17, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !721, line: 137, baseType: !722)
!721 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !721, line: 133, size: 192, elements: !723)
!723 = !{!724, !735, !736}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !722, file: !721, line: 134, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !721, line: 131, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !721, line: 98, size: 32, elements: !728)
!728 = !{!729, !730, !731, !732, !733}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !727, file: !721, line: 99, baseType: !36, size: 1, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !727, file: !721, line: 100, baseType: !36, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !727, file: !721, line: 101, baseType: !36, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !727, file: !721, line: 102, baseType: !36, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !727, file: !721, line: 130, baseType: !734, offset: 32)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, elements: !20)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !722, file: !721, line: 135, baseType: !46, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !722, file: !721, line: 136, baseType: !46, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !716, file: !715, line: 18, baseType: !46, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !716, file: !715, line: 19, baseType: !739, size: 128, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !715, line: 14, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !715, line: 11, size: 128, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !740, file: !715, line: 12, baseType: !46, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !740, file: !715, line: 13, baseType: !46, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !716, file: !715, line: 20, baseType: !719, size: 64, offset: 256)
!745 = !DILocalVariable(name: "clients", scope: !746, file: !1, line: 383, type: !144)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 382, column: 25)
!747 = distinct !DILexicalBlock(scope: !710, file: !1, line: 382, column: 21)
!748 = !DILocalVariable(name: "ln", scope: !746, file: !1, line: 384, type: !150)
!749 = !DILocalVariable(name: "li", scope: !746, file: !1, line: 385, type: !637)
!750 = !DILocalVariable(name: "receiver", scope: !751, file: !1, line: 389, type: !60)
!751 = distinct !DILexicalBlock(scope: !746, file: !1, line: 388, column: 49)
!752 = !DILocalVariable(name: "gt", scope: !751, file: !1, line: 391, type: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!754 = !DILocalVariable(name: "group", scope: !751, file: !1, line: 403, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamCG", file: !715, line: 64, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamCG", file: !715, line: 51, size: 256, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !757, file: !715, line: 52, baseType: !739, size: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pel", scope: !757, file: !715, line: 55, baseType: !719, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "consumers", scope: !757, file: !715, line: 61, baseType: !719, size: 64, offset: 192)
!762 = !DILocalVariable(name: "start", scope: !763, file: !1, line: 421, type: !739)
!763 = distinct !DILexicalBlock(scope: !764, file: !1, line: 420, column: 67)
!764 = distinct !DILexicalBlock(scope: !751, file: !1, line: 420, column: 29)
!765 = !DILocalVariable(name: "consumer", scope: !763, file: !1, line: 425, type: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamConsumer", file: !715, line: 79, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamConsumer", file: !715, line: 67, size: 192, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "seen_time", scope: !768, file: !715, line: 68, baseType: !281, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !715, line: 69, baseType: !183, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pel", scope: !768, file: !715, line: 72, baseType: !719, size: 64, offset: 128)
!773 = !DILocalVariable(name: "noack", scope: !763, file: !1, line: 426, type: !59)
!774 = !DILocalVariable(name: "pi", scope: !763, file: !1, line: 443, type: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamPropInfo", file: !715, line: 94, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sreamPropInfo", file: !715, line: 91, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "keyname", scope: !776, file: !715, line: 92, baseType: !173, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "groupname", scope: !776, file: !715, line: 93, baseType: !173, size: 64, offset: 64)
!780 = !DILocation(line: 247, column: 5, scope: !667)
!781 = !DILocation(line: 247, column: 11, scope: !667)
!782 = !{!372, !364, i64 2776}
!783 = !DILocation(line: 247, column: 41, scope: !667)
!784 = !DILocation(line: 248, column: 15, scope: !670)
!785 = !DILocation(line: 255, column: 29, scope: !670)
!786 = !DILocation(line: 255, column: 27, scope: !670)
!787 = !DILocation(line: 257, column: 9, scope: !670)
!788 = !DILocation(line: 257, column: 15, scope: !670)
!789 = !DILocation(line: 257, column: 29, scope: !670)
!790 = !DILocation(line: 258, column: 28, scope: !672)
!791 = !DILocation(line: 258, column: 23, scope: !672)
!792 = !DILocation(line: 259, column: 33, scope: !672)
!793 = !DILocation(line: 259, column: 24, scope: !672)
!794 = !DILocation(line: 263, column: 28, scope: !672)
!795 = !{!796, !364, i64 0}
!796 = !{!"readyList", !364, i64 0, !364, i64 8}
!797 = !DILocation(line: 263, column: 32, scope: !672)
!798 = !{!556, !364, i64 24}
!799 = !DILocation(line: 263, column: 47, scope: !672)
!800 = !{!796, !364, i64 8}
!801 = !DILocation(line: 263, column: 13, scope: !672)
!802 = !DILocation(line: 266, column: 42, scope: !672)
!803 = !DILocation(line: 266, column: 49, scope: !672)
!804 = !DILocation(line: 266, column: 23, scope: !672)
!805 = !DILocation(line: 266, column: 19, scope: !672)
!806 = !DILocation(line: 267, column: 19, scope: !683)
!807 = !DILocation(line: 267, column: 27, scope: !683)
!808 = !DILocation(line: 267, column: 33, scope: !683)
!809 = !DILocation(line: 267, column: 38, scope: !683)
!810 = !DILocation(line: 267, column: 17, scope: !672)
!811 = !DILocation(line: 272, column: 35, scope: !682)
!812 = !DILocation(line: 272, column: 39, scope: !682)
!813 = !DILocation(line: 272, column: 57, scope: !682)
!814 = !DILocation(line: 272, column: 22, scope: !682)
!815 = !DILocation(line: 268, column: 28, scope: !682)
!816 = !DILocation(line: 273, column: 21, scope: !686)
!817 = !DILocation(line: 273, column: 21, scope: !682)
!818 = !DILocation(line: 274, column: 37, scope: !685)
!819 = !DILocation(line: 274, column: 27, scope: !685)
!820 = !DILocation(line: 275, column: 38, scope: !685)
!821 = !DILocation(line: 275, column: 25, scope: !685)
!822 = !DILocation(line: 277, column: 21, scope: !685)
!823 = !DILocation(line: 0, scope: !685)
!824 = !DILocation(line: 277, column: 37, scope: !685)
!825 = !DILocation(line: 278, column: 48, scope: !689)
!826 = !DILocation(line: 278, column: 35, scope: !689)
!827 = !DILocation(line: 279, column: 56, scope: !689)
!828 = !DILocation(line: 279, column: 44, scope: !689)
!829 = !DILocation(line: 279, column: 33, scope: !689)
!830 = !DILocation(line: 281, column: 39, scope: !831)
!831 = distinct !DILexicalBlock(scope: !689, file: !1, line: 281, column: 29)
!832 = !DILocation(line: 281, column: 45, scope: !831)
!833 = !DILocation(line: 281, column: 29, scope: !689)
!834 = !DILocation(line: 284, column: 29, scope: !835)
!835 = distinct !DILexicalBlock(scope: !831, file: !1, line: 281, column: 62)
!836 = !DILocation(line: 285, column: 29, scope: !835)
!837 = !DILocation(line: 286, column: 29, scope: !835)
!838 = distinct !{!838, !822, !839}
!839 = !DILocation(line: 316, column: 21, scope: !685)
!840 = !DILocation(line: 289, column: 55, scope: !689)
!841 = !DILocation(line: 289, column: 31, scope: !689)
!842 = !DILocation(line: 290, column: 48, scope: !689)
!843 = !{!361, !364, i64 88}
!844 = !DILocation(line: 290, column: 38, scope: !689)
!845 = !DILocation(line: 290, column: 56, scope: !689)
!846 = !DILocation(line: 291, column: 57, scope: !689)
!847 = !{!848, !364, i64 8}
!848 = !{!"redisCommand", !364, i64 0, !364, i64 8, !363, i64 16, !364, i64 24, !363, i64 32, !364, i64 40, !363, i64 48, !363, i64 52, !363, i64 56, !324, i64 64, !324, i64 72}
!849 = !DILocation(line: 291, column: 62, scope: !689)
!850 = !DILocation(line: 0, scope: !689)
