; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/ecvtbuf.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/ecvtbuf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/ecvtbuf.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!11 = distinct !DISubprogram(name: "fcvtbuf", scope: !1, file: !1, line: 229, type: !12, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !17)
!12 = !DISubroutineType(types: !13)
!13 = !{!5, !14, !15, !16, !16, !5}
!14 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!17 = !{!18, !19, !20, !21, !22, !23, !300, !301, !302, !303}
!18 = !DILocalVariable(name: "invalue", arg: 1, scope: !11, file: !1, line: 229, type: !14)
!19 = !DILocalVariable(name: "ndigit", arg: 2, scope: !11, file: !1, line: 229, type: !15)
!20 = !DILocalVariable(name: "decpt", arg: 3, scope: !11, file: !1, line: 229, type: !16)
!21 = !DILocalVariable(name: "sign", arg: 4, scope: !11, file: !1, line: 229, type: !16)
!22 = !DILocalVariable(name: "fcvt_buf", arg: 5, scope: !11, file: !1, line: 229, type: !5)
!23 = !DILocalVariable(name: "reent", scope: !11, file: !1, line: 236, type: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !26, line: 569, size: 14912, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !29, !108, !109, !110, !111, !115, !116, !181, !182, !186, !198, !199, !200, !202, !203, !204, !266, !285, !286, !291, !298}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !25, file: !26, line: 571, baseType: !15, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !25, file: !26, line: 576, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !26, line: 287, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !26, line: 181, size: 1408, elements: !33)
!33 = !{!34, !37, !38, !39, !41, !42, !47, !48, !49, !56, !62, !67, !71, !72, !73, !74, !78, !82, !83, !84, !86, !87, !91, !107}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !32, file: !26, line: 182, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !32, file: !26, line: 183, baseType: !15, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !32, file: !26, line: 184, baseType: !15, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !26, line: 185, baseType: !40, size: 16, offset: 128)
!40 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !32, file: !26, line: 186, baseType: !40, size: 16, offset: 144)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !32, file: !26, line: 187, baseType: !43, size: 128, offset: 192)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !26, line: 117, size: 128, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !43, file: !26, line: 118, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !43, file: !26, line: 119, baseType: !15, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !32, file: !26, line: 188, baseType: !15, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !32, file: !26, line: 195, baseType: !4, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !32, file: !26, line: 197, baseType: !50, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !24, !4, !5, !15}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !54, line: 145, baseType: !55)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !32, file: !26, line: 199, baseType: !57, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!53, !24, !4, !60, !15}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !32, file: !26, line: 202, baseType: !63, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !24, !4, !66, !15}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !54, line: 114, baseType: !55)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !32, file: !26, line: 203, baseType: !68, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!15, !24, !4}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !32, file: !26, line: 206, baseType: !43, size: 128, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !32, file: !26, line: 207, baseType: !35, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !32, file: !26, line: 208, baseType: !15, size: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !32, file: !26, line: 211, baseType: !75, size: 24, offset: 928)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 24, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !32, file: !26, line: 212, baseType: !79, size: 8, offset: 952)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !32, file: !26, line: 215, baseType: !43, size: 128, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !32, file: !26, line: 218, baseType: !15, size: 32, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !26, line: 219, baseType: !85, size: 64, offset: 1152)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !54, line: 44, baseType: !55)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !32, file: !26, line: 222, baseType: !24, size: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !26, line: 226, baseType: !88, size: 32, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !54, line: 175, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !90, line: 12, baseType: !15)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !32, file: !26, line: 228, baseType: !92, size: 64, offset: 1312)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !54, line: 171, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 163, size: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !93, file: !54, line: 165, baseType: !15, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !93, file: !54, line: 170, baseType: !97, size: 32, offset: 32)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !93, file: !54, line: 166, size: 32, elements: !98)
!98 = !{!99, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !97, file: !54, line: 168, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !101, line: 124, baseType: !102)
!101 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !97, file: !54, line: 169, baseType: !104, size: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !26, line: 229, baseType: !15, size: 32, offset: 1376)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !25, file: !26, line: 576, baseType: !30, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !25, file: !26, line: 576, baseType: !30, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !25, file: !26, line: 578, baseType: !15, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !25, file: !26, line: 579, baseType: !112, size: 200, offset: 288)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 200, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !25, file: !26, line: 582, baseType: !15, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !25, file: !26, line: 583, baseType: !117, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !119, line: 178, size: 3392, elements: !120)
!119 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!120 = !{!121, !126, !134, !143, !144, !145, !173, !177, !180}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !118, file: !119, line: 180, baseType: !122, size: 1792)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1792, elements: !123)
!123 = !{!124, !125}
!124 = !DISubrange(count: 7)
!125 = !DISubrange(count: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !118, file: !119, line: 181, baseType: !127, size: 64, offset: 1792)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!15, !24, !5, !130, !131}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !101, line: 83, baseType: !15)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !133, line: 86, baseType: !92)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !118, file: !119, line: 183, baseType: !135, size: 64, offset: 1856)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!15, !24, !138, !60, !139, !131}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !140, line: 40, baseType: !141)
!140 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !54, line: 129, baseType: !142)
!142 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !118, file: !119, line: 185, baseType: !15, size: 32, offset: 1920)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !118, file: !119, line: 186, baseType: !5, size: 64, offset: 1984)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !118, file: !119, line: 187, baseType: !146, size: 768, offset: 2048)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !147, line: 42, size: 768, elements: !148)
!147 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !146, file: !147, line: 44, baseType: !5, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !146, file: !147, line: 45, baseType: !5, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !146, file: !147, line: 46, baseType: !5, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !146, file: !147, line: 47, baseType: !5, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !146, file: !147, line: 48, baseType: !5, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !146, file: !147, line: 49, baseType: !5, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !146, file: !147, line: 50, baseType: !5, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !146, file: !147, line: 51, baseType: !5, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !146, file: !147, line: 52, baseType: !5, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !146, file: !147, line: 53, baseType: !5, size: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !146, file: !147, line: 54, baseType: !6, size: 8, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !146, file: !147, line: 55, baseType: !6, size: 8, offset: 648)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !146, file: !147, line: 56, baseType: !6, size: 8, offset: 656)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !146, file: !147, line: 57, baseType: !6, size: 8, offset: 664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !146, file: !147, line: 58, baseType: !6, size: 8, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !146, file: !147, line: 59, baseType: !6, size: 8, offset: 680)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !146, file: !147, line: 60, baseType: !6, size: 8, offset: 688)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !146, file: !147, line: 61, baseType: !6, size: 8, offset: 696)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !146, file: !147, line: 62, baseType: !6, size: 8, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !146, file: !147, line: 63, baseType: !6, size: 8, offset: 712)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !146, file: !147, line: 64, baseType: !6, size: 8, offset: 720)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !146, file: !147, line: 65, baseType: !6, size: 8, offset: 728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !146, file: !147, line: 66, baseType: !6, size: 8, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !146, file: !147, line: 67, baseType: !6, size: 8, offset: 744)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !118, file: !119, line: 189, baseType: !174, size: 16, offset: 2816)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 16, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !118, file: !119, line: 190, baseType: !178, size: 256, offset: 2832)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !179)
!179 = !{!125}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !118, file: !119, line: 191, baseType: !178, size: 256, offset: 3088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !25, file: !26, line: 585, baseType: !15, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !25, file: !26, line: 587, baseType: !183, size: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !24}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !25, file: !26, line: 590, baseType: !187, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !26, line: 47, size: 256, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !188, file: !26, line: 49, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !188, file: !26, line: 50, baseType: !15, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !188, file: !26, line: 50, baseType: !15, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !188, file: !26, line: 50, baseType: !15, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !188, file: !26, line: 50, baseType: !15, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !188, file: !26, line: 51, baseType: !196, size: 32, offset: 192)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 32, elements: !80)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !26, line: 25, baseType: !102)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !25, file: !26, line: 591, baseType: !15, size: 32, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !25, file: !26, line: 592, baseType: !187, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !25, file: !26, line: 593, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !25, file: !26, line: 596, baseType: !15, size: 32, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !25, file: !26, line: 597, baseType: !5, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !25, file: !26, line: 632, baseType: !205, size: 2880, offset: 1152)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !26, line: 599, size: 2880, elements: !206)
!206 = !{!207, !257}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !205, file: !26, line: 622, baseType: !208, size: 1728)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !205, file: !26, line: 601, size: 1728, elements: !209)
!209 = !{!210, !211, !212, !216, !228, !229, !231, !239, !240, !241, !242, !246, !250, !251, !252, !253, !254, !255, !256}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !208, file: !26, line: 603, baseType: !102, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !208, file: !26, line: 604, baseType: !5, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !208, file: !26, line: 605, baseType: !213, size: 208, offset: 128)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 208, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 26)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !208, file: !26, line: 606, baseType: !217, size: 288, offset: 352)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !26, line: 55, size: 288, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !217, file: !26, line: 57, baseType: !15, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !217, file: !26, line: 58, baseType: !15, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !217, file: !26, line: 59, baseType: !15, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !217, file: !26, line: 60, baseType: !15, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !217, file: !26, line: 61, baseType: !15, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !217, file: !26, line: 62, baseType: !15, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !217, file: !26, line: 63, baseType: !15, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !217, file: !26, line: 64, baseType: !15, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !217, file: !26, line: 65, baseType: !15, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !208, file: !26, line: 607, baseType: !15, size: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !208, file: !26, line: 608, baseType: !230, size: 64, offset: 704)
!230 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !208, file: !26, line: 609, baseType: !232, size: 112, offset: 768)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !26, line: 319, size: 112, elements: !233)
!233 = !{!234, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !232, file: !26, line: 320, baseType: !235, size: 48)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 48, elements: !76)
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !232, file: !26, line: 321, baseType: !235, size: 48, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !232, file: !26, line: 322, baseType: !236, size: 16, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !208, file: !26, line: 610, baseType: !92, size: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !208, file: !26, line: 611, baseType: !92, size: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !208, file: !26, line: 612, baseType: !92, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !208, file: !26, line: 613, baseType: !243, size: 64, offset: 1088)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !208, file: !26, line: 614, baseType: !247, size: 192, offset: 1152)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 24)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !208, file: !26, line: 615, baseType: !15, size: 32, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !208, file: !26, line: 616, baseType: !92, size: 64, offset: 1376)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !208, file: !26, line: 617, baseType: !92, size: 64, offset: 1440)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !208, file: !26, line: 618, baseType: !92, size: 64, offset: 1504)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !208, file: !26, line: 619, baseType: !92, size: 64, offset: 1568)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !208, file: !26, line: 620, baseType: !92, size: 64, offset: 1632)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !208, file: !26, line: 621, baseType: !15, size: 32, offset: 1696)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !205, file: !26, line: 631, baseType: !258, size: 2880)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !205, file: !26, line: 626, size: 2880, elements: !259)
!259 = !{!260, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !258, file: !26, line: 629, baseType: !261, size: 1920)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1920, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 30)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !258, file: !26, line: 630, baseType: !265, size: 960, offset: 1920)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 960, elements: !262)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !25, file: !26, line: 636, baseType: !267, size: 64, offset: 4032)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !26, line: 93, size: 6336, elements: !269)
!269 = !{!270, !271, !272, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !268, file: !26, line: 94, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !268, file: !26, line: 95, baseType: !15, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !268, file: !26, line: 97, baseType: !273, size: 2048, offset: 128)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 2048, elements: !179)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !268, file: !26, line: 98, baseType: !278, size: 4160, offset: 2176)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !26, line: 74, size: 4160, elements: !279)
!279 = !{!280, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !278, file: !26, line: 75, baseType: !281, size: 2048)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !179)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !278, file: !26, line: 76, baseType: !281, size: 2048, offset: 2048)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !278, file: !26, line: 78, baseType: !197, size: 32, offset: 4096)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !278, file: !26, line: 81, baseType: !197, size: 32, offset: 4128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !25, file: !26, line: 637, baseType: !268, size: 6336, offset: 4096)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !25, file: !26, line: 641, baseType: !287, size: 64, offset: 10432)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !15}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !25, file: !26, line: 646, baseType: !292, size: 192, offset: 10496)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !26, line: 291, size: 192, elements: !293)
!293 = !{!294, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !292, file: !26, line: 293, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !292, file: !26, line: 294, baseType: !15, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !292, file: !26, line: 295, baseType: !30, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !25, file: !26, line: 648, baseType: !299, size: 4224, offset: 10688)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 4224, elements: !76)
!300 = !DILocalVariable(name: "save", scope: !11, file: !1, line: 237, type: !5)
!301 = !DILocalVariable(name: "p", scope: !11, file: !1, line: 238, type: !5)
!302 = !DILocalVariable(name: "end", scope: !11, file: !1, line: 239, type: !5)
!303 = !DILocalVariable(name: "done", scope: !11, file: !1, line: 240, type: !15)
!304 = !DILocation(line: 229, column: 1, scope: !11)
!305 = !DILocation(line: 236, column: 26, scope: !11)
!306 = !DILocation(line: 236, column: 18, scope: !11)
!307 = !DILocation(line: 239, column: 3, scope: !11)
!308 = !DILocation(line: 240, column: 7, scope: !11)
!309 = !DILocation(line: 242, column: 16, scope: !310)
!310 = distinct !DILexicalBlock(scope: !11, file: !1, line: 242, column: 7)
!311 = !DILocation(line: 242, column: 7, scope: !11)
!312 = !DILocation(line: 244, column: 18, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !1, line: 244, column: 11)
!314 = distinct !DILexicalBlock(scope: !310, file: !1, line: 243, column: 5)
!315 = !{!316, !317, i64 128}
!316 = !{!"_reent", !317, i64 0, !320, i64 8, !320, i64 16, !320, i64 24, !317, i64 32, !318, i64 36, !317, i64 64, !320, i64 72, !317, i64 80, !320, i64 88, !320, i64 96, !317, i64 104, !320, i64 112, !320, i64 120, !317, i64 128, !320, i64 136, !318, i64 144, !320, i64 504, !321, i64 512, !320, i64 1304, !323, i64 1312, !318, i64 1336}
!317 = !{!"int", !318, i64 0}
!318 = !{!"omnipotent char", !319, i64 0}
!319 = !{!"Simple C/C++ TBAA"}
!320 = !{!"any pointer", !318, i64 0}
!321 = !{!"_atexit", !320, i64 0, !317, i64 8, !318, i64 16, !322, i64 272}
!322 = !{!"_on_exit_args", !318, i64 0, !318, i64 256, !317, i64 512, !317, i64 516}
!323 = !{!"_glue", !320, i64 0, !317, i64 8, !320, i64 16}
!324 = !DILocation(line: 244, column: 36, scope: !313)
!325 = !DILocation(line: 244, column: 26, scope: !313)
!326 = !DILocation(line: 244, column: 11, scope: !314)
!327 = !DILocation(line: 0, scope: !328)
!328 = distinct !DILexicalBlock(scope: !329, file: !1, line: 246, column: 8)
!329 = distinct !DILexicalBlock(scope: !313, file: !1, line: 245, column: 2)
!330 = !{!316, !320, i64 136}
!331 = !DILocation(line: 246, column: 29, scope: !328)
!332 = !DILocation(line: 247, column: 27, scope: !328)
!333 = !DILocation(line: 246, column: 8, scope: !329)
!334 = !DILocation(line: 249, column: 19, scope: !329)
!335 = !DILocation(line: 250, column: 19, scope: !329)
!336 = !DILocation(line: 251, column: 2, scope: !329)
!337 = !DILocation(line: 253, column: 25, scope: !314)
!338 = !DILocation(line: 254, column: 5, scope: !314)
!339 = !DILocation(line: 237, column: 9, scope: !11)
!340 = !DILocation(line: 258, column: 15, scope: !341)
!341 = distinct !DILexicalBlock(scope: !11, file: !1, line: 258, column: 7)
!342 = !DILocation(line: 258, column: 32, scope: !341)
!343 = !DILocation(line: 258, column: 21, scope: !341)
!344 = !DILocation(line: 239, column: 9, scope: !11)
!345 = !DILocation(line: 238, column: 9, scope: !11)
!346 = !DILocation(line: 0, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !1, line: 259, column: 5)
!348 = !DILocation(line: 269, column: 11, scope: !11)
!349 = !{!317, !317, i64 0}
!350 = !DILocation(line: 269, column: 10, scope: !11)
!351 = !DILocation(line: 270, column: 3, scope: !11)
!352 = !DILocation(line: 270, column: 14, scope: !11)
!353 = !{!320, !320, i64 0}
!354 = !DILocation(line: 270, column: 12, scope: !11)
!355 = !DILocation(line: 0, scope: !356)
!356 = distinct !DILexicalBlock(scope: !11, file: !1, line: 271, column: 5)
!357 = !DILocation(line: 276, column: 15, scope: !11)
!358 = !DILocation(line: 276, column: 3, scope: !11)
!359 = !DILocation(line: 0, scope: !11)
!360 = !DILocation(line: 278, column: 19, scope: !361)
!361 = distinct !DILexicalBlock(scope: !11, file: !1, line: 277, column: 5)
