; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/netif/ethernet.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/netif/ethernet.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.eth_addr = type { [6 x i8] }
%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.netif = type { %struct.netif*, %struct.ip_addr, %struct.ip_addr, %struct.ip_addr, [3 x %struct.ip_addr], [3 x i8], [3 x i32], [3 x i32], {}*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip4_addr*)*, i8 (%struct.netif*, %struct.pbuf*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip6_addr*)*, void (%struct.netif*)*, void (%struct.netif*)*, i8*, [1 x i8*], i16, i16, i16, [6 x i8], i8, i8, [2 x i8], i8, i8, i8, i8 (%struct.netif*, %struct.ip6_addr*, i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ethbroadcast", scope: !2, file: !3, line: 63, type: !67, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !64)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/netif/ethernet.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !11, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !6, line: 156, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 53, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!15 = !DIEnumerator(name: "ERR_OK", value: 0)
!16 = !DIEnumerator(name: "ERR_MEM", value: -1)
!17 = !DIEnumerator(name: "ERR_BUF", value: -2)
!18 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!19 = !DIEnumerator(name: "ERR_RTE", value: -4)
!20 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!21 = !DIEnumerator(name: "ERR_VAL", value: -6)
!22 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!23 = !DIEnumerator(name: "ERR_USE", value: -8)
!24 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!25 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!26 = !DIEnumerator(name: "ERR_CONN", value: -11)
!27 = !DIEnumerator(name: "ERR_IF", value: -12)
!28 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!29 = !DIEnumerator(name: "ERR_RST", value: -14)
!30 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!31 = !DIEnumerator(name: "ERR_ARG", value: -16)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !33, line: 68, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!39 = !{!40, !47}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !41, line: 125, baseType: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 24, baseType: !44)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !45, line: 43, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eth_hdr", file: !49, line: 76, size: 112, elements: !50)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ethernet.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !{!51, !58, !59}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !48, file: !49, line: 80, baseType: !52, size: 48)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eth_addr", file: !49, line: 60, size: 48, elements: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !52, file: !49, line: 61, baseType: !55, size: 48)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 48, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 6)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !48, file: !49, line: 81, baseType: !52, size: 48, offset: 48)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !49, line: 82, baseType: !60, size: 16, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !41, line: 127, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 36, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !45, line: 57, baseType: !63)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !{!0, !65, !68, !96}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "ethzero", scope: !2, file: !3, line: 64, type: !67, isLocal: false, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "__str", scope: !70, file: !71, line: 198, type: !93, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "uk_pr_crit", scope: !71, file: !71, line: 194, type: !72, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !77)
!71 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, null}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !{!78, !79}
!78 = !DILocalVariable(name: "fmt", arg: 1, scope: !70, file: !71, line: 194, type: !74)
!79 = !DILocalVariable(name: "argp", scope: !70, file: !71, line: 196, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !81, line: 32, baseType: !82)
!81 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !91)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !85)
!85 = !{!86, !87, !88, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !84, file: !3, line: 196, baseType: !7, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !84, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !84, file: !3, line: 196, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !84, file: !3, line: 196, baseType: !89, size: 64, offset: 128)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 8)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "__str", scope: !70, file: !71, line: 198, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 88, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 11)
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!105 = distinct !DISubprogram(name: "ethernet_input", scope: !3, file: !3, line: 81, type: !106, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !217)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !113, !125}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !12, line: 96, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !41, line: 126, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !43, line: 20, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !45, line: 41, baseType: !112)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !115, line: 186, size: 192, elements: !116)
!115 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !115, line: 188, baseType: !113, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !114, file: !115, line: 191, baseType: !89, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !114, file: !115, line: 200, baseType: !60, size: 16, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !115, line: 203, baseType: !60, size: 16, offset: 144)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !114, file: !115, line: 208, baseType: !40, size: 8, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !115, line: 211, baseType: !40, size: 8, offset: 168)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !114, file: !115, line: 218, baseType: !40, size: 8, offset: 176)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !114, file: !115, line: 221, baseType: !40, size: 8, offset: 184)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !127)
!127 = !{!128, !129, !157, !158, !159, !163, !165, !167, !168, !171, !178, !183, !190, !195, !196, !197, !199, !200, !201, !202, !203, !204, !205, !209, !210, !211, !212}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !6, line: 263, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !126, file: !6, line: 268, baseType: !130, size: 192, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !131, line: 76, baseType: !132)
!131 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !131, line: 69, size: 192, elements: !133)
!133 = !{!134, !156}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !132, file: !131, line: 73, baseType: !135, size: 160)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !131, line: 70, size: 160, elements: !136)
!136 = !{!137, !150}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !135, file: !131, line: 71, baseType: !138, size: 160)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !139, line: 67, baseType: !140)
!139 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !139, line: 59, size: 160, elements: !141)
!141 = !{!142, !149}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !140, file: !139, line: 60, baseType: !143, size: 128)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, elements: !147)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !41, line: 129, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 48, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !45, line: 79, baseType: !7)
!147 = !{!148}
!148 = !DISubrange(count: 4)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !140, file: !139, line: 62, baseType: !40, size: 8, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !135, file: !131, line: 72, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !152, line: 57, baseType: !153)
!152 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !152, line: 51, size: 32, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !153, file: !152, line: 52, baseType: !144, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !131, line: 75, baseType: !40, size: 8, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !126, file: !6, line: 269, baseType: !130, size: 192, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !126, file: !6, line: 270, baseType: !130, size: 192, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !126, file: !6, line: 274, baseType: !160, size: 576, offset: 640)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 576, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 3)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !126, file: !6, line: 277, baseType: !164, size: 24, offset: 1216)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 24, elements: !161)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !126, file: !6, line: 282, baseType: !166, size: 96, offset: 1248)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !161)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !126, file: !6, line: 283, baseType: !166, size: 96, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !126, file: !6, line: 288, baseType: !169, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !126, file: !6, line: 294, baseType: !172, size: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!108, !125, !113, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !126, file: !6, line: 299, baseType: !179, size: 64, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!108, !125, !113}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !126, file: !6, line: 305, baseType: !184, size: 64, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!108, !125, !113, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !126, file: !6, line: 310, baseType: !191, size: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !125}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !126, file: !6, line: 319, baseType: !191, size: 64, offset: 1792)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !6, line: 323, baseType: !89, size: 64, offset: 1856)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !126, file: !6, line: 325, baseType: !198, size: 64, offset: 1920)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, elements: !91)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !126, file: !6, line: 332, baseType: !60, size: 16, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !126, file: !6, line: 335, baseType: !60, size: 16, offset: 2000)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !126, file: !6, line: 338, baseType: !60, size: 16, offset: 2016)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !126, file: !6, line: 341, baseType: !55, size: 48, offset: 2032)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !126, file: !6, line: 343, baseType: !40, size: 8, offset: 2080)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !6, line: 345, baseType: !40, size: 8, offset: 2088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !6, line: 347, baseType: !206, size: 16, offset: 2096)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 2)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !126, file: !6, line: 350, baseType: !40, size: 8, offset: 2112)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !126, file: !6, line: 353, baseType: !40, size: 8, offset: 2120)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !126, file: !6, line: 357, baseType: !40, size: 8, offset: 2128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !126, file: !6, line: 377, baseType: !213, size: 64, offset: 2176)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!108, !125, !188, !5}
!217 = !{!218, !219, !220, !221, !222}
!218 = !DILocalVariable(name: "p", arg: 1, scope: !105, file: !3, line: 81, type: !113)
!219 = !DILocalVariable(name: "netif", arg: 2, scope: !105, file: !3, line: 81, type: !125)
!220 = !DILocalVariable(name: "ethhdr", scope: !105, file: !3, line: 83, type: !47)
!221 = !DILocalVariable(name: "type", scope: !105, file: !3, line: 84, type: !60)
!222 = !DILocalVariable(name: "next_hdr_offset", scope: !105, file: !3, line: 86, type: !60)
!223 = !DILocation(line: 81, column: 29, scope: !105)
!224 = !DILocation(line: 81, column: 46, scope: !105)
!225 = !DILocation(line: 86, column: 9, scope: !105)
!226 = !DILocation(line: 91, column: 10, scope: !227)
!227 = distinct !DILexicalBlock(scope: !105, file: !3, line: 91, column: 7)
!228 = !{!229, !233, i64 18}
!229 = !{!"pbuf", !230, i64 0, !230, i64 8, !233, i64 16, !233, i64 18, !231, i64 20, !231, i64 21, !231, i64 22, !231, i64 23}
!230 = !{!"any pointer", !231, i64 0}
!231 = !{!"omnipotent char", !232, i64 0}
!232 = !{!"Simple C/C++ TBAA"}
!233 = !{!"short", !231, i64 0}
!234 = !DILocation(line: 91, column: 14, scope: !227)
!235 = !DILocation(line: 91, column: 7, scope: !105)
!236 = !DILocation(line: 93, column: 5, scope: !237)
!237 = distinct !DILexicalBlock(scope: !227, file: !3, line: 91, column: 33)
!238 = !{!239, !233, i64 40}
!239 = !{!"stats_", !240, i64 0, !240, i64 24, !240, i64 48, !240, i64 72, !240, i64 96, !240, i64 120, !240, i64 144, !241, i64 168, !240, i64 186, !240, i64 210, !240, i64 234, !243, i64 258, !240, i64 286}
!240 = !{!"stats_proto", !233, i64 0, !233, i64 2, !233, i64 4, !233, i64 6, !233, i64 8, !233, i64 10, !233, i64 12, !233, i64 14, !233, i64 16, !233, i64 18, !233, i64 20, !233, i64 22}
!241 = !{!"stats_sys", !242, i64 0, !242, i64 6, !242, i64 12}
!242 = !{!"stats_syselem", !233, i64 0, !233, i64 2, !233, i64 4}
!243 = !{!"stats_igmp", !233, i64 0, !233, i64 2, !233, i64 4, !233, i64 6, !233, i64 8, !233, i64 10, !233, i64 12, !233, i64 14, !233, i64 16, !233, i64 18, !233, i64 20, !233, i64 22, !233, i64 24, !233, i64 26}
!244 = !DILocation(line: 94, column: 5, scope: !237)
!245 = !{!239, !233, i64 30}
!246 = !DILocation(line: 96, column: 5, scope: !237)
!247 = !DILocation(line: 99, column: 10, scope: !248)
!248 = distinct !DILexicalBlock(scope: !105, file: !3, line: 99, column: 7)
!249 = !{!229, !231, i64 23}
!250 = !DILocation(line: 99, column: 17, scope: !248)
!251 = !DILocation(line: 99, column: 7, scope: !105)
!252 = !DILocation(line: 100, column: 17, scope: !253)
!253 = distinct !DILexicalBlock(scope: !248, file: !3, line: 99, column: 36)
!254 = !{!255, !231, i64 264}
!255 = !{!"netif", !230, i64 0, !256, i64 8, !256, i64 32, !256, i64 56, !231, i64 80, !231, i64 152, !231, i64 156, !231, i64 168, !230, i64 184, !230, i64 192, !230, i64 200, !230, i64 208, !230, i64 216, !230, i64 224, !230, i64 232, !231, i64 240, !233, i64 248, !233, i64 250, !233, i64 252, !231, i64 254, !231, i64 260, !231, i64 261, !231, i64 262, !231, i64 264, !231, i64 265, !231, i64 266, !230, i64 272}
!256 = !{!"ip_addr", !231, i64 0, !231, i64 20}
!257 = !DILocation(line: 100, column: 15, scope: !253)
!258 = !DILocation(line: 101, column: 3, scope: !253)
!259 = !DILocation(line: 104, column: 33, scope: !105)
!260 = !{!229, !230, i64 8}
!261 = !DILocation(line: 83, column: 19, scope: !105)
!262 = !DILocation(line: 113, column: 18, scope: !105)
!263 = !{!264, !233, i64 12}
!264 = !{!"eth_hdr", !265, i64 0, !265, i64 6, !233, i64 12}
!265 = !{!"eth_addr", !231, i64 0}
!266 = !DILocation(line: 84, column: 9, scope: !105)
