; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EvictionPoolLRU", scope: !2, file: !3, line: 61, type: !196, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !59)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !9, !10, !11, !28, !38, !48, !58}
!6 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !13, line: 51, size: 24, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !21, !22, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !13, line: 52, baseType: !16, size: 8)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 43, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !12, file: !13, line: 53, baseType: !16, size: 8, offset: 8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !13, line: 54, baseType: !20, size: 8, offset: 16)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !12, file: !13, line: 55, baseType: !24, offset: 24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: -1)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !13, line: 57, size: 40, elements: !30)
!30 = !{!31, !35, !36, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !29, file: !13, line: 58, baseType: !32, size: 16)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 36, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 57, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !29, file: !13, line: 59, baseType: !32, size: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !13, line: 60, baseType: !20, size: 8, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !29, file: !13, line: 61, baseType: !24, offset: 40)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !13, line: 63, size: 72, elements: !40)
!40 = !{!41, !45, !46, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !13, line: 64, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 48, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 79, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !39, file: !13, line: 65, baseType: !42, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !39, file: !13, line: 66, baseType: !20, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !13, line: 67, baseType: !24, offset: 72)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !13, line: 69, size: 136, elements: !50)
!50 = !{!51, !55, !56, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !13, line: 70, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 60, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 105, baseType: !54)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !49, file: !13, line: 71, baseType: !52, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !13, line: 72, baseType: !20, size: 8, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !49, file: !13, line: 73, baseType: !24, offset: 136)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!59 = !{!60, !0}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "next_db", scope: !62, file: !3, line: 471, type: !44, isLocal: true, isDefinition: true)
!62 = distinct !DISubprogram(name: "freeMemoryIfNeeded", scope: !3, file: !3, line: 446, type: !63, isLocal: false, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !66)
!63 = !DISubroutineType(types: !64)
!64 = !{!65}
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !{!67, !72, !73, !74, !77, !78, !79, !80, !82, !83, !84, !85, !88, !89, !191, !192, !193, !204, !206, !207}
!67 = !DILocalVariable(name: "mem_reported", scope: !62, file: !3, line: 451, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 40, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !71, line: 129, baseType: !54)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DILocalVariable(name: "mem_tofree", scope: !62, file: !3, line: 451, type: !68)
!73 = !DILocalVariable(name: "mem_freed", scope: !62, file: !3, line: 451, type: !68)
!74 = !DILocalVariable(name: "latency", scope: !62, file: !3, line: 452, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !76, line: 52, baseType: !10)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DILocalVariable(name: "eviction_latency", scope: !62, file: !3, line: 452, type: !75)
!78 = !DILocalVariable(name: "delta", scope: !62, file: !3, line: 453, type: !10)
!79 = !DILocalVariable(name: "slaves", scope: !62, file: !3, line: 454, type: !65)
!80 = !DILocalVariable(name: "j", scope: !81, file: !3, line: 470, type: !65)
!81 = distinct !DILexicalBlock(scope: !62, file: !3, line: 469, column: 36)
!82 = !DILocalVariable(name: "k", scope: !81, file: !3, line: 470, type: !65)
!83 = !DILocalVariable(name: "i", scope: !81, file: !3, line: 470, type: !65)
!84 = !DILocalVariable(name: "keys_freed", scope: !81, file: !3, line: 470, type: !65)
!85 = !DILocalVariable(name: "bestkey", scope: !81, file: !3, line: 472, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !13, line: 43, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!88 = !DILocalVariable(name: "bestdbid", scope: !81, file: !3, line: 473, type: !65)
!89 = !DILocalVariable(name: "db", scope: !81, file: !3, line: 474, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !76, line: 656, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !76, line: 647, size: 512, elements: !93)
!93 = !{!94, !156, !157, !158, !159, !160, !161, !162}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !92, file: !76, line: 648, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !97, line: 82, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !97, line: 76, size: 768, elements: !99)
!99 = !{!100, !125, !126, !154, !155}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !97, line: 77, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !97, line: 65, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !97, line: 58, size: 384, elements: !104)
!104 = !{!105, !111, !115, !116, !120, !124}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !103, file: !97, line: 59, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!52, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !103, file: !97, line: 60, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!7, !7, !109}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !103, file: !97, line: 61, baseType: !112, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !103, file: !97, line: 62, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!65, !7, !109, !109}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !103, file: !97, line: 63, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !7, !7}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !103, file: !97, line: 64, baseType: !121, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !98, file: !97, line: 78, baseType: !7, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !98, file: !97, line: 79, baseType: !127, size: 512, offset: 128)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !152)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !97, line: 74, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !97, line: 69, size: 256, elements: !130)
!130 = !{!131, !149, !150, !151}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !129, file: !97, line: 70, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !97, line: 56, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !97, line: 47, size: 192, elements: !136)
!136 = !{!137, !138, !147}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !135, file: !97, line: 48, baseType: !7, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !135, file: !97, line: 54, baseType: !139, size: 64, offset: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !97, line: 49, size: 64, elements: !140)
!140 = !{!141, !142, !143, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !139, file: !97, line: 50, baseType: !7, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !139, file: !97, line: 51, baseType: !52, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !139, file: !97, line: 52, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !17, line: 56, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !19, line: 103, baseType: !6)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !139, file: !97, line: 53, baseType: !8, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !97, line: 55, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !97, line: 71, baseType: !54, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !129, file: !97, line: 72, baseType: !54, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !129, file: !97, line: 73, baseType: !54, size: 64, offset: 192)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !98, file: !97, line: 80, baseType: !6, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !98, file: !97, line: 81, baseType: !54, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !92, file: !76, line: 649, baseType: !95, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !92, file: !76, line: 650, baseType: !95, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !92, file: !76, line: 651, baseType: !95, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !92, file: !76, line: 652, baseType: !95, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !76, line: 653, baseType: !65, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !92, file: !76, line: 654, baseType: !10, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !92, file: !76, line: 655, baseType: !163, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !165, line: 54, baseType: !166)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !165, line: 47, size: 384, elements: !167)
!167 = !{!168, !177, !178, !182, !186, !190}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !166, file: !165, line: 48, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !165, line: 40, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !165, line: 36, size: 192, elements: !172)
!172 = !{!173, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !165, line: 37, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !165, line: 38, baseType: !174, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !165, line: 39, baseType: !7, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !166, file: !165, line: 49, baseType: !169, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !166, file: !165, line: 50, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!7, !7}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !166, file: !165, line: 51, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !7}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !166, file: !165, line: 52, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!65, !7, !7}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !165, line: 53, baseType: !54, size: 64, offset: 320)
!191 = !DILocalVariable(name: "dict", scope: !81, file: !3, line: 475, type: !95)
!192 = !DILocalVariable(name: "de", scope: !81, file: !3, line: 476, type: !133)
!193 = !DILocalVariable(name: "pool", scope: !194, file: !3, line: 481, type: !196)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 480, column: 9)
!195 = distinct !DILexicalBlock(scope: !81, file: !3, line: 478, column: 13)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evictionPoolEntry", file: !3, line: 54, size: 256, elements: !198)
!198 = !{!199, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !197, file: !3, line: 55, baseType: !200, size: 64)
!200 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !3, line: 56, baseType: !86, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !197, file: !3, line: 57, baseType: !86, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dbid", scope: !197, file: !3, line: 58, baseType: !65, size: 32, offset: 192)
!204 = !DILocalVariable(name: "total_keys", scope: !205, file: !3, line: 484, type: !54)
!205 = distinct !DILexicalBlock(scope: !194, file: !3, line: 483, column: 36)
!206 = !DILocalVariable(name: "keys", scope: !205, file: !3, line: 484, type: !54)
!207 = !DILocalVariable(name: "keyobj", scope: !208, file: !3, line: 555, type: !210)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 553, column: 22)
!209 = distinct !DILexicalBlock(scope: !81, file: !3, line: 553, column: 13)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !76, line: 622, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !76, line: 614, size: 128, elements: !213)
!213 = !{!214, !215, !216, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !76, line: 615, baseType: !44, size: 4, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !212, file: !76, line: 616, baseType: !44, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !212, file: !76, line: 617, baseType: !44, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !212, file: !76, line: 620, baseType: !65, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !212, file: !76, line: 621, baseType: !7, size: 64, offset: 64)
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!223 = distinct !DISubprogram(name: "getLRUClock", scope: !3, file: !3, line: 70, type: !224, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{!44}
!226 = !DILocation(line: 71, column: 13, scope: !223)
!227 = !DILocation(line: 71, column: 21, scope: !223)
!228 = !DILocation(line: 71, column: 12, scope: !223)
!229 = !DILocation(line: 71, column: 5, scope: !223)
!230 = distinct !DISubprogram(name: "LRU_CLOCK", scope: !3, file: !3, line: 78, type: !224, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !231)
!231 = !{!232}
!232 = !DILocalVariable(name: "lruclock", scope: !230, file: !3, line: 79, type: !44)
!233 = !DILocation(line: 80, column: 9, scope: !230)
!234 = !DILocation(line: 81, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 81, column: 9)
!236 = distinct !DILexicalBlock(scope: !237, file: !3, line: 80, column: 49)
!237 = distinct !DILexicalBlock(scope: !230, file: !3, line: 80, column: 9)
!238 = !DILocation(line: 79, column: 18, scope: !230)
!239 = !DILocation(line: 82, column: 5, scope: !236)
!240 = !DILocation(line: 85, column: 5, scope: !230)
!241 = distinct !DISubprogram(name: "estimateObjectIdleTime", scope: !3, file: !3, line: 90, type: !242, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{!200, !210}
!244 = !{!245, !246}
!245 = !DILocalVariable(name: "o", arg: 1, scope: !241, file: !3, line: 90, type: !210)
!246 = !DILocalVariable(name: "lruclock", scope: !241, file: !3, line: 91, type: !200)
!247 = !DILocation(line: 90, column: 49, scope: !241)
!248 = !DILocation(line: 80, column: 9, scope: !230, inlinedAt: !249)
!249 = distinct !DILocation(line: 91, column: 35, scope: !241)
!250 = !DILocation(line: 81, column: 9, scope: !235, inlinedAt: !249)
!251 = !DILocation(line: 79, column: 18, scope: !230, inlinedAt: !249)
!252 = !DILocation(line: 82, column: 5, scope: !236, inlinedAt: !249)
!253 = !DILocation(line: 85, column: 5, scope: !230, inlinedAt: !249)
!254 = !DILocation(line: 91, column: 35, scope: !241)
!255 = !DILocation(line: 91, column: 24, scope: !241)
!256 = !DILocation(line: 92, column: 24, scope: !257)
!257 = distinct !DILexicalBlock(scope: !241, file: !3, line: 92, column: 9)
!258 = !DILocation(line: 92, column: 18, scope: !257)
!259 = !DILocation(line: 92, column: 9, scope: !241)
!260 = !DILocation(line: 92, column: 21, scope: !257)
!261 = !DILocation(line: 95, column: 43, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !3, line: 94, column: 12)
!263 = !DILocation(line: 95, column: 28, scope: !262)
!264 = !DILocation(line: 0, scope: !265)
!265 = distinct !DILexicalBlock(scope: !257, file: !3, line: 92, column: 29)
!266 = !DILocation(line: 0, scope: !262)
!267 = !DILocation(line: 98, column: 1, scope: !241)
!268 = distinct !DISubprogram(name: "evictionPoolAlloc", scope: !3, file: !3, line: 139, type: !269, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !271)
!269 = !DISubroutineType(types: !270)
!270 = !{null}
!271 = !{!272, !273}
!272 = !DILocalVariable(name: "ep", scope: !268, file: !3, line: 140, type: !196)
!273 = !DILocalVariable(name: "j", scope: !268, file: !3, line: 141, type: !65)
!274 = !DILocation(line: 143, column: 10, scope: !268)
!275 = !DILocation(line: 140, column: 31, scope: !268)
!276 = !DILocation(line: 141, column: 9, scope: !268)
!277 = !DILocation(line: 144, column: 10, scope: !278)
!278 = distinct !DILexicalBlock(scope: !268, file: !3, line: 144, column: 5)
!279 = !DILocation(line: 144, column: 5, scope: !278)
!280 = !DILocation(line: 145, column: 15, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 144, column: 39)
!282 = distinct !DILexicalBlock(scope: !278, file: !3, line: 144, column: 5)
!283 = !DILocation(line: 145, column: 20, scope: !281)
!284 = !{!285, !286, i64 0}
!285 = !{!"evictionPoolEntry", !286, i64 0, !289, i64 8, !289, i64 16, !290, i64 24}
!286 = !{!"long long", !287, i64 0}
!287 = !{!"omnipotent char", !288, i64 0}
!288 = !{!"Simple C/C++ TBAA"}
!289 = !{!"any pointer", !287, i64 0}
!290 = !{!"int", !287, i64 0}
!291 = !DILocation(line: 146, column: 15, scope: !281)
!292 = !DILocation(line: 146, column: 19, scope: !281)
!293 = !{!285, !289, i64 8}
!294 = !DILocation(line: 147, column: 24, scope: !281)
!295 = !DILocation(line: 147, column: 15, scope: !281)
!296 = !DILocation(line: 147, column: 22, scope: !281)
!297 = !{!285, !289, i64 16}
!298 = !DILocation(line: 148, column: 15, scope: !281)
!299 = !DILocation(line: 148, column: 20, scope: !281)
!300 = !{!285, !290, i64 24}
!301 = !DILocation(line: 144, column: 35, scope: !282)
!302 = !DILocation(line: 144, column: 5, scope: !282)
!303 = !DILocation(line: 144, column: 19, scope: !282)
!304 = distinct !{!304, !279, !305}
!305 = !DILocation(line: 149, column: 5, scope: !278)
!306 = !DILocation(line: 150, column: 21, scope: !268)
!307 = !{!289, !289, i64 0}
!308 = !DILocation(line: 151, column: 1, scope: !268)
!309 = distinct !DISubprogram(name: "evictionPoolPopulate", scope: !3, file: !3, line: 162, type: !310, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !65, !95, !95, !196}
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !325, !329, !330, !331, !332, !338, !340}
!313 = !DILocalVariable(name: "dbid", arg: 1, scope: !309, file: !3, line: 162, type: !65)
!314 = !DILocalVariable(name: "sampledict", arg: 2, scope: !309, file: !3, line: 162, type: !95)
!315 = !DILocalVariable(name: "keydict", arg: 3, scope: !309, file: !3, line: 162, type: !95)
!316 = !DILocalVariable(name: "pool", arg: 4, scope: !309, file: !3, line: 162, type: !196)
!317 = !DILocalVariable(name: "j", scope: !309, file: !3, line: 163, type: !65)
!318 = !DILocalVariable(name: "k", scope: !309, file: !3, line: 163, type: !65)
!319 = !DILocalVariable(name: "count", scope: !309, file: !3, line: 163, type: !65)
!320 = !DILocalVariable(scope: !309, type: !54, flags: DIFlagArtificial)
!321 = !DILocalVariable(name: "samples", scope: !309, file: !3, line: 164, type: !322)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: !320)
!325 = !DILocalVariable(name: "idle", scope: !326, file: !3, line: 168, type: !200)
!326 = distinct !DILexicalBlock(scope: !327, file: !3, line: 167, column: 33)
!327 = distinct !DILexicalBlock(scope: !328, file: !3, line: 167, column: 5)
!328 = distinct !DILexicalBlock(scope: !309, file: !3, line: 167, column: 5)
!329 = !DILocalVariable(name: "key", scope: !326, file: !3, line: 169, type: !86)
!330 = !DILocalVariable(name: "o", scope: !326, file: !3, line: 170, type: !210)
!331 = !DILocalVariable(name: "de", scope: !326, file: !3, line: 171, type: !133)
!332 = !DILocalVariable(name: "cached", scope: !333, file: !3, line: 226, type: !86)
!333 = distinct !DILexicalBlock(scope: !334, file: !3, line: 221, column: 50)
!334 = distinct !DILexicalBlock(scope: !335, file: !3, line: 221, column: 17)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 218, column: 16)
!336 = distinct !DILexicalBlock(scope: !337, file: !3, line: 216, column: 20)
!337 = distinct !DILexicalBlock(scope: !326, file: !3, line: 212, column: 13)
!338 = !DILocalVariable(name: "cached", scope: !339, file: !3, line: 235, type: !86)
!339 = distinct !DILexicalBlock(scope: !334, file: !3, line: 230, column: 20)
!340 = !DILocalVariable(name: "klen", scope: !326, file: !3, line: 246, type: !65)
!341 = !DILocation(line: 162, column: 31, scope: !309)
!342 = !DILocation(line: 162, column: 43, scope: !309)
!343 = !DILocation(line: 162, column: 61, scope: !309)
!344 = !DILocation(line: 162, column: 96, scope: !309)
!345 = !DILocation(line: 164, column: 31, scope: !309)
!346 = !{!347, !290, i64 2716}
!347 = !{!"redisServer", !290, i64 0, !289, i64 8, !289, i64 16, !289, i64 24, !290, i64 32, !290, i64 36, !290, i64 40, !289, i64 48, !289, i64 56, !289, i64 64, !289, i64 72, !290, i64 80, !290, i64 84, !290, i64 88, !290, i64 92, !289, i64 96, !289, i64 104, !290, i64 112, !290, i64 116, !287, i64 120, !290, i64 164, !348, i64 168, !290, i64 176, !289, i64 184, !289, i64 192, !289, i64 200, !287, i64 208, !290, i64 216, !290, i64 220, !287, i64 224, !290, i64 352, !289, i64 360, !290, i64 368, !287, i64 372, !290, i64 436, !290, i64 440, !287, i64 444, !290, i64 508, !289, i64 512, !289, i64 520, !289, i64 528, !289, i64 536, !289, i64 544, !289, i64 552, !289, i64 560, !290, i64 568, !286, i64 576, !287, i64 584, !289, i64 840, !348, i64 848, !290, i64 856, !290, i64 860, !348, i64 864, !348, i64 872, !348, i64 880, !348, i64 888, !289, i64 896, !289, i64 904, !289, i64 912, !289, i64 920, !289, i64 928, !289, i64 936, !289, i64 944, !289, i64 952, !289, i64 960, !289, i64 968, !289, i64 976, !289, i64 984, !289, i64 992, !348, i64 1000, !286, i64 1008, !286, i64 1016, !286, i64 1024, !349, i64 1032, !286, i64 1040, !286, i64 1048, !286, i64 1056, !286, i64 1064, !286, i64 1072, !286, i64 1080, !286, i64 1088, !286, i64 1096, !286, i64 1104, !348, i64 1112, !286, i64 1120, !349, i64 1128, !286, i64 1136, !286, i64 1144, !286, i64 1152, !286, i64 1160, !289, i64 1168, !286, i64 1176, !286, i64 1184, !348, i64 1192, !350, i64 1200, !286, i64 1240, !286, i64 1248, !348, i64 1256, !348, i64 1264, !287, i64 1272, !290, i64 1728, !290, i64 1732, !290, i64 1736, !290, i64 1740, !290, i64 1744, !348, i64 1752, !290, i64 1760, !290, i64 1764, !290, i64 1768, !290, i64 1772, !348, i64 1776, !348, i64 1784, !290, i64 1792, !290, i64 1796, !290, i64 1800, !290, i64 1804, !287, i64 1808, !290, i64 1880, !290, i64 1884, !289, i64 1888, !290, i64 1896, !290, i64 1900, !348, i64 1904, !348, i64 1912, !348, i64 1920, !348, i64 1928, !290, i64 1936, !290, i64 1940, !289, i64 1944, !289, i64 1952, !290, i64 1960, !290, i64 1964, !348, i64 1968, !348, i64 1976, !348, i64 1984, !348, i64 1992, !290, i64 2000, !348, i64 2008, !290, i64 2016, !290, i64 2020, !290, i64 2024, !290, i64 2028, !290, i64 2032, !290, i64 2036, !290, i64 2040, !290, i64 2044, !290, i64 2048, !290, i64 2052, !290, i64 2056, !290, i64 2060, !290, i64 2064, !289, i64 2072, !286, i64 2080, !286, i64 2088, !290, i64 2096, !289, i64 2104, !290, i64 2112, !289, i64 2120, !290, i64 2128, !290, i64 2132, !348, i64 2136, !348, i64 2144, !348, i64 2152, !348, i64 2160, !290, i64 2168, !290, i64 2172, !290, i64 2176, !290, i64 2180, !290, i64 2184, !290, i64 2188, !287, i64 2192, !351, i64 2200, !352, i64 2224, !289, i64 2240, !290, i64 2248, !289, i64 2256, !290, i64 2264, !287, i64 2268, !287, i64 2309, !286, i64 2352, !286, i64 2360, !290, i64 2368, !290, i64 2372, !289, i64 2376, !286, i64 2384, !286, i64 2392, !286, i64 2400, !286, i64 2408, !348, i64 2416, !348, i64 2424, !290, i64 2432, !290, i64 2436, !290, i64 2440, !290, i64 2444, !290, i64 2448, !289, i64 2456, !289, i64 2464, !290, i64 2472, !290, i64 2476, !289, i64 2480, !289, i64 2488, !290, i64 2496, !290, i64 2500, !348, i64 2504, !348, i64 2512, !348, i64 2520, !290, i64 2528, !290, i64 2532, !289, i64 2536, !348, i64 2544, !290, i64 2552, !290, i64 2556, !290, i64 2560, !348, i64 2568, !290, i64 2576, !290, i64 2580, !290, i64 2584, !289, i64 2592, !287, i64 2600, !286, i64 2648, !290, i64 2656, !289, i64 2664, !289, i64 2672, !290, i64 2680, !289, i64 2688, !290, i64 2696, !290, i64 2700, !286, i64 2704, !290, i64 2712, !290, i64 2716, !290, i64 2720, !290, i64 2724, !286, i64 2728, !290, i64 2736, !287, i64 2740, !289, i64 2768, !289, i64 2776, !290, i64 2784, !290, i64 2788, !290, i64 2792, !290, i64 2796, !348, i64 2800, !348, i64 2808, !348, i64 2816, !348, i64 2824, !348, i64 2832, !348, i64 2840, !348, i64 2848, !348, i64 2856, !290, i64 2864, !290, i64 2868, !348, i64 2872, !348, i64 2880, !290, i64 2888, !286, i64 2896, !289, i64 2904, !289, i64 2912, !290, i64 2920, !290, i64 2924, !286, i64 2928, !289, i64 2936, !289, i64 2944, !290, i64 2952, !290, i64 2956, !290, i64 2960, !290, i64 2964, !289, i64 2968, !290, i64 2976, !290, i64 2980, !290, i64 2984, !289, i64 2992, !289, i64 3000, !289, i64 3008, !289, i64 3016, !286, i64 3024, !286, i64 3032, !286, i64 3040, !290, i64 3048, !290, i64 3052, !290, i64 3056, !290, i64 3060, !290, i64 3064, !290, i64 3068, !290, i64 3072, !290, i64 3076, !290, i64 3080, !290, i64 3084, !290, i64 3088, !286, i64 3096, !289, i64 3104, !289, i64 3112, !289, i64 3120, !290, i64 3128, !290, i64 3132, !290, i64 3136, !348, i64 3144, !289, i64 3152, !289, i64 3160, !289, i64 3168}
!348 = !{!"long", !287, i64 0}
!349 = !{!"double", !287, i64 0}
!350 = !{!"malloc_stats", !348, i64 0, !348, i64 8, !348, i64 16, !348, i64 24, !348, i64 32}
!351 = !{!"", !290, i64 0, !348, i64 8, !286, i64 16}
!352 = !{!"redisOpArray", !289, i64 0, !290, i64 8}
!353 = !DILocation(line: 164, column: 5, scope: !309)
!354 = !DILocation(line: 0, scope: !309)
!355 = !DILocation(line: 164, column: 16, scope: !309)
!356 = !DILocation(line: 166, column: 13, scope: !309)
!357 = !DILocation(line: 163, column: 15, scope: !309)
!358 = !DILocation(line: 163, column: 9, scope: !309)
!359 = !DILocation(line: 167, column: 10, scope: !328)
!360 = !DILocation(line: 170, column: 15, scope: !326)
!361 = !DILocation(line: 167, column: 19, scope: !327)
!362 = !DILocation(line: 167, column: 5, scope: !328)
!363 = !DILocation(line: 173, column: 14, scope: !326)
!364 = !DILocation(line: 171, column: 20, scope: !326)
!365 = !DILocation(line: 174, column: 15, scope: !326)
!366 = !{!367, !289, i64 0}
!367 = !{!"dictEntry", !289, i64 0, !287, i64 8, !289, i64 16}
!368 = !DILocation(line: 169, column: 13, scope: !326)
!369 = !DILocation(line: 179, column: 20, scope: !370)
!370 = distinct !DILexicalBlock(scope: !326, file: !3, line: 179, column: 13)
!371 = !{!347, !290, i64 2712}
!372 = !DILocation(line: 179, column: 37, scope: !370)
!373 = !DILocation(line: 179, column: 13, scope: !326)
!374 = !DILocation(line: 0, scope: !375)
!375 = distinct !DILexicalBlock(scope: !370, file: !3, line: 179, column: 64)
!376 = !DILocation(line: 189, column: 20, scope: !377)
!377 = distinct !DILexicalBlock(scope: !326, file: !3, line: 187, column: 13)
!378 = !DILocation(line: 198, column: 20, scope: !379)
!379 = distinct !DILexicalBlock(scope: !377, file: !3, line: 189, column: 20)
!380 = !DILocation(line: 200, column: 39, scope: !381)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 198, column: 71)
!382 = distinct !DILexicalBlock(scope: !379, file: !3, line: 198, column: 20)
!383 = !DILocation(line: 180, column: 17, scope: !375)
!384 = !DILocation(line: 180, column: 45, scope: !385)
!385 = distinct !DILexicalBlock(scope: !375, file: !3, line: 180, column: 17)
!386 = !DILocation(line: 180, column: 40, scope: !385)
!387 = !DILocation(line: 187, column: 20, scope: !377)
!388 = !DILocation(line: 0, scope: !326)
!389 = !DILocation(line: 181, column: 17, scope: !375)
!390 = !{!287, !287, i64 0}
!391 = !DILocation(line: 182, column: 9, scope: !375)
!392 = !DILocation(line: 187, column: 37, scope: !377)
!393 = !DILocation(line: 187, column: 13, scope: !326)
!394 = !DILocation(line: 90, column: 49, scope: !241, inlinedAt: !395)
!395 = distinct !DILocation(line: 188, column: 20, scope: !396)
!396 = distinct !DILexicalBlock(scope: !377, file: !3, line: 187, column: 59)
!397 = !DILocation(line: 80, column: 9, scope: !230, inlinedAt: !398)
!398 = distinct !DILocation(line: 91, column: 35, scope: !241, inlinedAt: !395)
!399 = !DILocation(line: 81, column: 9, scope: !235, inlinedAt: !398)
!400 = !DILocation(line: 79, column: 18, scope: !230, inlinedAt: !398)
!401 = !DILocation(line: 82, column: 5, scope: !236, inlinedAt: !398)
!402 = !DILocation(line: 85, column: 5, scope: !230, inlinedAt: !398)
!403 = !DILocation(line: 91, column: 35, scope: !241, inlinedAt: !395)
!404 = !DILocation(line: 91, column: 24, scope: !241, inlinedAt: !395)
!405 = !DILocation(line: 92, column: 24, scope: !257, inlinedAt: !395)
!406 = !DILocation(line: 92, column: 18, scope: !257, inlinedAt: !395)
!407 = !DILocation(line: 92, column: 9, scope: !241, inlinedAt: !395)
!408 = !DILocation(line: 92, column: 21, scope: !257, inlinedAt: !395)
!409 = !DILocation(line: 95, column: 43, scope: !262, inlinedAt: !395)
!410 = !DILocation(line: 95, column: 28, scope: !262, inlinedAt: !395)
!411 = !DILocation(line: 0, scope: !396)
!412 = !DILocation(line: 0, scope: !262, inlinedAt: !395)
!413 = !DILocation(line: 98, column: 1, scope: !241, inlinedAt: !395)
!414 = !DILocation(line: 168, column: 28, scope: !326)
!415 = !DILocation(line: 189, column: 9, scope: !396)
!416 = !DILocation(line: 189, column: 44, scope: !379)
!417 = !DILocalVariable(name: "o", arg: 1, scope: !418, file: !3, line: 335, type: !210)
!418 = distinct !DISubprogram(name: "LFUDecrAndReturn", scope: !3, file: !3, line: 335, type: !419, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!54, !210}
!421 = !{!417, !422, !423, !424}
!422 = !DILocalVariable(name: "ldt", scope: !418, file: !3, line: 336, type: !54)
!423 = !DILocalVariable(name: "counter", scope: !418, file: !3, line: 337, type: !54)
!424 = !DILocalVariable(name: "num_periods", scope: !418, file: !3, line: 338, type: !54)
!425 = !DILocation(line: 335, column: 38, scope: !418, inlinedAt: !426)
!426 = distinct !DILocation(line: 197, column: 24, scope: !427)
!427 = distinct !DILexicalBlock(scope: !379, file: !3, line: 189, column: 66)
!428 = !DILocation(line: 336, column: 28, scope: !418, inlinedAt: !426)
!429 = !DILocation(line: 337, column: 36, scope: !418, inlinedAt: !426)
!430 = !DILocation(line: 337, column: 29, scope: !418, inlinedAt: !426)
!431 = !DILocation(line: 337, column: 19, scope: !418, inlinedAt: !426)
!432 = !DILocation(line: 338, column: 40, scope: !418, inlinedAt: !426)
!433 = !{!347, !290, i64 2724}
!434 = !DILocation(line: 338, column: 33, scope: !418, inlinedAt: !426)
!435 = !DILocation(line: 336, column: 32, scope: !418, inlinedAt: !426)
!436 = !DILocation(line: 336, column: 25, scope: !418, inlinedAt: !426)
!437 = !DILocation(line: 336, column: 19, scope: !418, inlinedAt: !426)
!438 = !DILocalVariable(name: "ldt", arg: 1, scope: !439, file: !3, line: 307, type: !54)
!439 = distinct !DISubprogram(name: "LFUTimeElapsed", scope: !3, file: !3, line: 307, type: !440, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!54, !54}
!442 = !{!438, !443}
!443 = !DILocalVariable(name: "now", scope: !439, file: !3, line: 308, type: !54)
!444 = !DILocation(line: 307, column: 44, scope: !439, inlinedAt: !445)
!445 = distinct !DILocation(line: 338, column: 57, scope: !418, inlinedAt: !426)
!446 = !DILocation(line: 300, column: 20, scope: !447, inlinedAt: !450)
!447 = distinct !DISubprogram(name: "LFUGetTimeInMinutes", scope: !3, file: !3, line: 299, type: !448, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!448 = !DISubroutineType(types: !449)
!449 = !{!54}
!450 = distinct !DILocation(line: 308, column: 25, scope: !439, inlinedAt: !445)
!451 = !{!347, !348, i64 2872}
!452 = !DILocation(line: 300, column: 28, scope: !447, inlinedAt: !450)
!453 = !DILocation(line: 300, column: 33, scope: !447, inlinedAt: !450)
!454 = !DILocation(line: 300, column: 5, scope: !447, inlinedAt: !450)
!455 = !DILocation(line: 308, column: 19, scope: !439, inlinedAt: !445)
!456 = !DILocation(line: 309, column: 13, scope: !457, inlinedAt: !445)
!457 = distinct !DILexicalBlock(scope: !439, file: !3, line: 309, column: 9)
!458 = !DILocation(line: 309, column: 9, scope: !439, inlinedAt: !445)
!459 = !DILocation(line: 310, column: 17, scope: !439, inlinedAt: !445)
!460 = !DILocation(line: 0, scope: !418, inlinedAt: !426)
!461 = !DILocation(line: 311, column: 1, scope: !439, inlinedAt: !445)
!462 = !DILocation(line: 338, column: 79, scope: !418, inlinedAt: !426)
!463 = !DILocation(line: 338, column: 77, scope: !418, inlinedAt: !426)
!464 = !DILocation(line: 338, column: 19, scope: !418, inlinedAt: !426)
!465 = !DILocation(line: 339, column: 9, scope: !466, inlinedAt: !426)
!466 = distinct !DILexicalBlock(scope: !418, file: !3, line: 339, column: 9)
!467 = !DILocation(line: 339, column: 9, scope: !418, inlinedAt: !426)
!468 = !DILocation(line: 340, column: 32, scope: !466, inlinedAt: !426)
!469 = !DILocation(line: 340, column: 19, scope: !466, inlinedAt: !426)
!470 = !DILocation(line: 340, column: 57, scope: !466, inlinedAt: !426)
!471 = !DILocation(line: 0, scope: !427)
!472 = !DILocation(line: 341, column: 5, scope: !418, inlinedAt: !426)
!473 = !DILocation(line: 197, column: 23, scope: !427)
!474 = !DILocation(line: 198, column: 9, scope: !427)
!475 = !DILocation(line: 198, column: 44, scope: !382)
!476 = !DILocation(line: 200, column: 31, scope: !381)
!477 = !DILocation(line: 202, column: 13, scope: !478)
!478 = distinct !DILexicalBlock(scope: !382, file: !3, line: 201, column: 16)
!479 = !DILocation(line: 0, scope: !381)
!480 = !DILocation(line: 163, column: 12, scope: !309)
!481 = !DILocation(line: 209, column: 9, scope: !326)
!482 = !DILocation(line: 209, column: 32, scope: !326)
!483 = !DILocation(line: 210, column: 24, scope: !326)
!484 = !DILocation(line: 210, column: 16, scope: !326)
!485 = !DILocation(line: 210, column: 28, scope: !326)
!486 = !DILocation(line: 211, column: 24, scope: !326)
!487 = !DILocation(line: 211, column: 29, scope: !326)
!488 = !DILocation(line: 211, column: 38, scope: !326)
!489 = !DILocation(line: 209, column: 18, scope: !326)
!490 = distinct !{!490, !481, !488}
!491 = !DILocation(line: 212, column: 15, scope: !337)
!492 = !DILocation(line: 212, column: 20, scope: !337)
!493 = !DILocation(line: 212, column: 43, scope: !337)
!494 = !DILocation(line: 212, column: 47, scope: !337)
!495 = !DILocation(line: 212, column: 13, scope: !326)
!496 = !DILocation(line: 216, column: 36, scope: !336)
!497 = !DILocation(line: 216, column: 39, scope: !336)
!498 = !DILocation(line: 216, column: 47, scope: !336)
!499 = !DILocation(line: 216, column: 51, scope: !336)
!500 = !DILocation(line: 216, column: 20, scope: !337)
!501 = !DILocation(line: 221, column: 37, scope: !334)
!502 = !DILocation(line: 221, column: 41, scope: !334)
!503 = !DILocation(line: 221, column: 17, scope: !335)
!504 = !DILocation(line: 226, column: 50, scope: !333)
!505 = !DILocation(line: 226, column: 21, scope: !333)
!506 = !DILocation(line: 227, column: 29, scope: !333)
!507 = !DILocation(line: 227, column: 31, scope: !333)
!508 = !DILocation(line: 227, column: 25, scope: !333)
!509 = !DILocation(line: 227, column: 34, scope: !333)
!510 = !DILocation(line: 228, column: 51, scope: !333)
!511 = !DILocation(line: 228, column: 37, scope: !333)
!512 = !DILocation(line: 228, column: 36, scope: !333)
!513 = !DILocation(line: 227, column: 17, scope: !333)
!514 = !DILocation(line: 229, column: 25, scope: !333)
!515 = !DILocation(line: 229, column: 32, scope: !333)
!516 = !DILocation(line: 230, column: 13, scope: !333)
!517 = !DILocation(line: 232, column: 18, scope: !339)
!518 = !DILocation(line: 235, column: 38, scope: !339)
!519 = !DILocation(line: 235, column: 21, scope: !339)
!520 = !DILocation(line: 236, column: 29, scope: !521)
!521 = distinct !DILexicalBlock(scope: !339, file: !3, line: 236, column: 21)
!522 = !DILocation(line: 236, column: 33, scope: !521)
!523 = !DILocation(line: 236, column: 21, scope: !339)
!524 = !DILocation(line: 236, column: 52, scope: !521)
!525 = !DILocation(line: 237, column: 53, scope: !339)
!526 = !DILocation(line: 237, column: 52, scope: !339)
!527 = !DILocation(line: 237, column: 17, scope: !339)
!528 = !DILocation(line: 238, column: 25, scope: !339)
!529 = !DILocation(line: 238, column: 32, scope: !339)
!530 = !DILocation(line: 88, column: 27, scope: !531, inlinedAt: !540)
!531 = distinct !DISubprogram(name: "sdslen", scope: !13, file: !13, line: 87, type: !532, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !537)
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !536}
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !535, line: 58, baseType: !54)
!535 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!537 = !{!538, !539}
!538 = !DILocalVariable(name: "s", arg: 1, scope: !531, file: !13, line: 87, type: !536)
!539 = !DILocalVariable(name: "flags", scope: !531, file: !13, line: 88, type: !20)
!540 = distinct !DILocation(line: 246, column: 20, scope: !326)
!541 = !DILocation(line: 0, scope: !339)
!542 = !DILocation(line: 87, column: 39, scope: !531, inlinedAt: !540)
!543 = !DILocation(line: 88, column: 19, scope: !531, inlinedAt: !540)
!544 = !DILocation(line: 89, column: 5, scope: !531, inlinedAt: !540)
!545 = !DILocation(line: 91, column: 20, scope: !546, inlinedAt: !540)
!546 = distinct !DILexicalBlock(scope: !531, file: !13, line: 89, column: 33)
!547 = !DILocation(line: 91, column: 13, scope: !546, inlinedAt: !540)
!548 = !DILocation(line: 93, column: 20, scope: !546, inlinedAt: !540)
!549 = !DILocation(line: 93, column: 34, scope: !546, inlinedAt: !540)
!550 = !DILocation(line: 93, column: 13, scope: !546, inlinedAt: !540)
!551 = !DILocation(line: 95, column: 20, scope: !546, inlinedAt: !540)
!552 = !DILocation(line: 95, column: 35, scope: !546, inlinedAt: !540)
!553 = !{!554, !554, i64 0}
!554 = !{!"short", !287, i64 0}
!555 = !DILocation(line: 95, column: 13, scope: !546, inlinedAt: !540)
!556 = !DILocation(line: 97, column: 20, scope: !546, inlinedAt: !540)
!557 = !DILocation(line: 97, column: 35, scope: !546, inlinedAt: !540)
!558 = !{!290, !290, i64 0}
!559 = !DILocation(line: 97, column: 13, scope: !546, inlinedAt: !540)
!560 = !DILocation(line: 99, column: 20, scope: !546, inlinedAt: !540)
!561 = !DILocation(line: 99, column: 35, scope: !546, inlinedAt: !540)
!562 = !{!348, !348, i64 0}
!563 = !DILocation(line: 99, column: 13, scope: !546, inlinedAt: !540)
!564 = !DILocation(line: 101, column: 5, scope: !531, inlinedAt: !540)
!565 = !DILocation(line: 102, column: 1, scope: !531, inlinedAt: !540)
!566 = !DILocation(line: 246, column: 13, scope: !326)
!567 = !DILocation(line: 247, column: 13, scope: !326)
!568 = !DILocation(line: 0, scope: !546, inlinedAt: !540)
!569 = !DILocation(line: 246, column: 20, scope: !326)
!570 = !DILocation(line: 247, column: 18, scope: !571)
!571 = distinct !DILexicalBlock(scope: !326, file: !3, line: 247, column: 13)
!572 = !DILocation(line: 248, column: 27, scope: !573)
!573 = distinct !DILexicalBlock(scope: !571, file: !3, line: 247, column: 44)
!574 = !DILocation(line: 248, column: 13, scope: !573)
!575 = !DILocation(line: 248, column: 21, scope: !573)
!576 = !DILocation(line: 248, column: 25, scope: !573)
!577 = !DILocation(line: 249, column: 9, scope: !573)
!578 = !DILocation(line: 250, column: 20, scope: !579)
!579 = distinct !DILexicalBlock(scope: !571, file: !3, line: 249, column: 16)
!580 = !DILocation(line: 250, column: 28, scope: !579)
!581 = !DILocation(line: 250, column: 39, scope: !579)
!582 = !DILocation(line: 250, column: 13, scope: !579)
!583 = !DILocation(line: 251, column: 31, scope: !579)
!584 = !DILocation(line: 251, column: 38, scope: !579)
!585 = !DILocalVariable(name: "s", arg: 1, scope: !586, file: !13, line: 130, type: !86)
!586 = distinct !DISubprogram(name: "sdssetlen", scope: !13, file: !13, line: 130, type: !587, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !86, !534}
!589 = !{!585, !590, !591, !592}
!590 = !DILocalVariable(name: "newlen", arg: 2, scope: !586, file: !13, line: 130, type: !534)
!591 = !DILocalVariable(name: "flags", scope: !586, file: !13, line: 131, type: !20)
!592 = !DILocalVariable(name: "fp", scope: !593, file: !13, line: 135, type: !58)
!593 = distinct !DILexicalBlock(scope: !594, file: !13, line: 134, column: 13)
!594 = distinct !DILexicalBlock(scope: !586, file: !13, line: 132, column: 33)
!595 = !DILocation(line: 130, column: 34, scope: !586, inlinedAt: !596)
!596 = distinct !DILocation(line: 251, column: 13, scope: !579)
!597 = !DILocation(line: 130, column: 44, scope: !586, inlinedAt: !596)
!598 = !DILocation(line: 131, column: 27, scope: !586, inlinedAt: !596)
!599 = !DILocation(line: 131, column: 19, scope: !586, inlinedAt: !596)
!600 = !DILocation(line: 132, column: 5, scope: !586, inlinedAt: !596)
!601 = !DILocation(line: 135, column: 32, scope: !593, inlinedAt: !596)
!602 = !DILocation(line: 136, column: 23, scope: !593, inlinedAt: !596)
!603 = !DILocation(line: 136, column: 21, scope: !593, inlinedAt: !596)
!604 = !DILocation(line: 138, column: 13, scope: !594, inlinedAt: !596)
!605 = !DILocation(line: 140, column: 33, scope: !594, inlinedAt: !596)
!606 = !DILocation(line: 140, column: 13, scope: !594, inlinedAt: !596)
!607 = !DILocation(line: 140, column: 31, scope: !594, inlinedAt: !596)
!608 = !DILocation(line: 141, column: 13, scope: !594, inlinedAt: !596)
!609 = !DILocation(line: 143, column: 34, scope: !594, inlinedAt: !596)
!610 = !DILocation(line: 143, column: 13, scope: !594, inlinedAt: !596)
!611 = !DILocation(line: 143, column: 28, scope: !594, inlinedAt: !596)
!612 = !DILocation(line: 143, column: 32, scope: !594, inlinedAt: !596)
!613 = !DILocation(line: 144, column: 13, scope: !594, inlinedAt: !596)
!614 = !DILocation(line: 146, column: 34, scope: !594, inlinedAt: !596)
!615 = !DILocation(line: 146, column: 13, scope: !594, inlinedAt: !596)
!616 = !DILocation(line: 146, column: 28, scope: !594, inlinedAt: !596)
!617 = !DILocation(line: 146, column: 32, scope: !594, inlinedAt: !596)
!618 = !DILocation(line: 147, column: 13, scope: !594, inlinedAt: !596)
!619 = !DILocation(line: 149, column: 13, scope: !594, inlinedAt: !596)
!620 = !DILocation(line: 149, column: 28, scope: !594, inlinedAt: !596)
!621 = !DILocation(line: 149, column: 32, scope: !594, inlinedAt: !596)
!622 = !DILocation(line: 150, column: 13, scope: !594, inlinedAt: !596)
!623 = !DILocation(line: 0, scope: !579)
!624 = !DILocation(line: 152, column: 1, scope: !586, inlinedAt: !596)
!625 = !DILocation(line: 252, column: 35, scope: !579)
!626 = !DILocation(line: 252, column: 21, scope: !579)
!627 = !DILocation(line: 252, column: 25, scope: !579)
!628 = !DILocation(line: 254, column: 9, scope: !326)
!629 = !DILocation(line: 254, column: 17, scope: !326)
!630 = !DILocation(line: 254, column: 22, scope: !326)
!631 = !DILocation(line: 255, column: 17, scope: !326)
!632 = !DILocation(line: 255, column: 22, scope: !326)
!633 = !DILocation(line: 256, column: 5, scope: !327)
!634 = !DILocation(line: 0, scope: !635)
!635 = distinct !DILexicalBlock(scope: !337, file: !3, line: 212, column: 56)
!636 = !DILocation(line: 167, column: 29, scope: !327)
!637 = !DILocation(line: 167, column: 5, scope: !327)
!638 = distinct !{!638, !362, !639}
!639 = !DILocation(line: 256, column: 5, scope: !328)
!640 = !DILocation(line: 257, column: 1, scope: !309)
!641 = !DILocation(line: 335, column: 38, scope: !418)
!642 = !DILocation(line: 336, column: 28, scope: !418)
!643 = !DILocation(line: 337, column: 36, scope: !418)
!644 = !DILocation(line: 337, column: 29, scope: !418)
!645 = !DILocation(line: 337, column: 19, scope: !418)
!646 = !DILocation(line: 338, column: 40, scope: !418)
!647 = !DILocation(line: 338, column: 33, scope: !418)
!648 = !DILocation(line: 336, column: 32, scope: !418)
!649 = !DILocation(line: 336, column: 25, scope: !418)
!650 = !DILocation(line: 336, column: 19, scope: !418)
!651 = !DILocation(line: 307, column: 44, scope: !439, inlinedAt: !652)
!652 = distinct !DILocation(line: 338, column: 57, scope: !418)
!653 = !DILocation(line: 300, column: 20, scope: !447, inlinedAt: !654)
!654 = distinct !DILocation(line: 308, column: 25, scope: !439, inlinedAt: !652)
!655 = !DILocation(line: 300, column: 28, scope: !447, inlinedAt: !654)
!656 = !DILocation(line: 300, column: 33, scope: !447, inlinedAt: !654)
!657 = !DILocation(line: 300, column: 5, scope: !447, inlinedAt: !654)
!658 = !DILocation(line: 308, column: 19, scope: !439, inlinedAt: !652)
!659 = !DILocation(line: 309, column: 13, scope: !457, inlinedAt: !652)
!660 = !DILocation(line: 309, column: 9, scope: !439, inlinedAt: !652)
!661 = !DILocation(line: 310, column: 17, scope: !439, inlinedAt: !652)
!662 = !DILocation(line: 0, scope: !418)
!663 = !DILocation(line: 311, column: 1, scope: !439, inlinedAt: !652)
!664 = !DILocation(line: 338, column: 79, scope: !418)
!665 = !DILocation(line: 338, column: 77, scope: !418)
!666 = !DILocation(line: 338, column: 19, scope: !418)
!667 = !DILocation(line: 339, column: 9, scope: !466)
!668 = !DILocation(line: 339, column: 9, scope: !418)
!669 = !DILocation(line: 340, column: 32, scope: !466)
!670 = !DILocation(line: 340, column: 19, scope: !466)
!671 = !DILocation(line: 340, column: 57, scope: !466)
!672 = !DILocation(line: 0, scope: !466)
!673 = !DILocation(line: 341, column: 5, scope: !418)
!674 = !DILocation(line: 300, column: 20, scope: !447)
!675 = !DILocation(line: 300, column: 28, scope: !447)
!676 = !DILocation(line: 300, column: 33, scope: !447)
!677 = !DILocation(line: 300, column: 5, scope: !447)
!678 = !DILocation(line: 307, column: 44, scope: !439)
!679 = !DILocation(line: 300, column: 20, scope: !447, inlinedAt: !680)
!680 = distinct !DILocation(line: 308, column: 25, scope: !439)
!681 = !DILocation(line: 300, column: 28, scope: !447, inlinedAt: !680)
!682 = !DILocation(line: 300, column: 33, scope: !447, inlinedAt: !680)
!683 = !DILocation(line: 300, column: 5, scope: !447, inlinedAt: !680)
!684 = !DILocation(line: 308, column: 19, scope: !439)
!685 = !DILocation(line: 309, column: 13, scope: !457)
!686 = !DILocation(line: 309, column: 9, scope: !439)
!687 = !DILocation(line: 0, scope: !457)
!688 = !DILocation(line: 311, column: 1, scope: !439)
!689 = distinct !DISubprogram(name: "LFULogIncr", scope: !3, file: !3, line: 315, type: !690, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!16, !16}
!692 = !{!693, !694, !695, !696}
!693 = !DILocalVariable(name: "counter", arg: 1, scope: !689, file: !3, line: 315, type: !16)
!694 = !DILocalVariable(name: "r", scope: !689, file: !3, line: 317, type: !8)
!695 = !DILocalVariable(name: "baseval", scope: !689, file: !3, line: 318, type: !8)
!696 = !DILocalVariable(name: "p", scope: !689, file: !3, line: 320, type: !8)
!697 = !DILocation(line: 315, column: 28, scope: !689)
!698 = !DILocation(line: 316, column: 17, scope: !699)
!699 = distinct !DILexicalBlock(scope: !689, file: !3, line: 316, column: 9)
!700 = !DILocation(line: 316, column: 9, scope: !689)
!701 = !DILocation(line: 316, column: 9, scope: !699)
!702 = !DILocation(line: 317, column: 24, scope: !689)
!703 = !DILocation(line: 317, column: 16, scope: !689)
!704 = !DILocation(line: 317, column: 30, scope: !689)
!705 = !DILocation(line: 317, column: 12, scope: !689)
!706 = !DILocation(line: 318, column: 30, scope: !689)
!707 = !DILocation(line: 318, column: 22, scope: !689)
!708 = !DILocation(line: 318, column: 12, scope: !689)
!709 = !DILocation(line: 319, column: 17, scope: !710)
!710 = distinct !DILexicalBlock(scope: !689, file: !3, line: 319, column: 9)
!711 = !DILocation(line: 319, column: 9, scope: !689)
!712 = !DILocation(line: 319, column: 22, scope: !710)
!713 = !DILocation(line: 0, scope: !689)
!714 = !DILocation(line: 320, column: 36, scope: !689)
!715 = !{!347, !290, i64 2720}
!716 = !DILocation(line: 320, column: 29, scope: !689)
!717 = !DILocation(line: 320, column: 28, scope: !689)
!718 = !DILocation(line: 320, column: 50, scope: !689)
!719 = !DILocation(line: 320, column: 19, scope: !689)
!720 = !DILocation(line: 320, column: 12, scope: !689)
!721 = !DILocation(line: 321, column: 11, scope: !722)
!722 = distinct !DILexicalBlock(scope: !689, file: !3, line: 321, column: 9)
!723 = !DILocation(line: 321, column: 9, scope: !689)
!724 = !DILocation(line: 321, column: 23, scope: !722)
!725 = !DILocation(line: 321, column: 16, scope: !722)
!726 = !DILocation(line: 323, column: 1, scope: !689)
!727 = distinct !DISubprogram(name: "freeMemoryGetNotCountedMemory", scope: !3, file: !3, line: 352, type: !728, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !730)
!728 = !DISubroutineType(types: !729)
!729 = !{!68}
!730 = !{!731, !732, !733, !741, !742}
!731 = !DILocalVariable(name: "overhead", scope: !727, file: !3, line: 353, type: !68)
!732 = !DILocalVariable(name: "slaves", scope: !727, file: !3, line: 354, type: !65)
!733 = !DILocalVariable(name: "li", scope: !734, file: !3, line: 357, type: !736)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 356, column: 17)
!735 = distinct !DILexicalBlock(scope: !727, file: !3, line: 356, column: 9)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !165, line: 45, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !165, line: 42, size: 128, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !165, line: 43, baseType: !169, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !737, file: !165, line: 44, baseType: !65, size: 32, offset: 64)
!741 = !DILocalVariable(name: "ln", scope: !734, file: !3, line: 358, type: !169)
!742 = !DILocalVariable(name: "slave", scope: !743, file: !3, line: 362, type: !744)
!743 = distinct !DILexicalBlock(scope: !734, file: !3, line: 361, column: 37)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !76, line: 780, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !76, line: 723, size: 135360, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !759, !783, !784, !785, !786, !787, !788, !789, !790, !793, !794, !795, !796, !797, !798, !799, !800, !805, !806, !807, !808, !809, !810, !811, !812, !816, !817, !821, !822, !838, !839, !855, !856, !857, !858, !859, !860, !861, !862}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !746, file: !76, line: 724, baseType: !52, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !746, file: !76, line: 725, baseType: !65, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !746, file: !76, line: 726, baseType: !90, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !76, line: 727, baseType: !210, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !746, file: !76, line: 728, baseType: !86, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !746, file: !76, line: 729, baseType: !68, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !746, file: !76, line: 730, baseType: !86, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !746, file: !76, line: 734, baseType: !68, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !746, file: !76, line: 735, baseType: !65, size: 32, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !746, file: !76, line: 736, baseType: !758, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !746, file: !76, line: 737, baseType: !760, size: 64, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !76, line: 1307, size: 640, elements: !762)
!762 = !{!763, !764, !769, !770, !771, !772, !778, !779, !780, !781, !782}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !76, line: 1308, baseType: !87, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !761, file: !76, line: 1309, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !76, line: 1305, baseType: !767)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !744}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !761, file: !76, line: 1310, baseType: !65, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !761, file: !76, line: 1311, baseType: !87, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !76, line: 1312, baseType: !65, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !761, file: !76, line: 1315, baseType: !773, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !76, line: 1306, baseType: !775)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !760, !758, !65, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !761, file: !76, line: 1317, baseType: !65, size: 32, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !761, file: !76, line: 1318, baseType: !65, size: 32, offset: 416)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !761, file: !76, line: 1319, baseType: !65, size: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !761, file: !76, line: 1320, baseType: !10, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !761, file: !76, line: 1320, baseType: !10, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !746, file: !76, line: 737, baseType: !760, size: 64, offset: 704)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !746, file: !76, line: 738, baseType: !65, size: 32, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !746, file: !76, line: 739, baseType: !65, size: 32, offset: 800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !746, file: !76, line: 740, baseType: !6, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !746, file: !76, line: 741, baseType: !163, size: 64, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !746, file: !76, line: 742, baseType: !200, size: 64, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !746, file: !76, line: 743, baseType: !68, size: 64, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !746, file: !76, line: 745, baseType: !791, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !792, line: 34, baseType: !6)
!792 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !746, file: !76, line: 746, baseType: !791, size: 64, offset: 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !746, file: !76, line: 747, baseType: !791, size: 64, offset: 1216)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !76, line: 748, baseType: !65, size: 32, offset: 1280)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !746, file: !76, line: 749, baseType: !65, size: 32, offset: 1312)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !746, file: !76, line: 750, baseType: !65, size: 32, offset: 1344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !746, file: !76, line: 751, baseType: !65, size: 32, offset: 1376)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !746, file: !76, line: 752, baseType: !65, size: 32, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !746, file: !76, line: 753, baseType: !801, size: 64, offset: 1472)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !802, line: 173, baseType: !803)
!802 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 100, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !71, line: 44, baseType: !6)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !746, file: !76, line: 754, baseType: !801, size: 64, offset: 1536)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !746, file: !76, line: 755, baseType: !86, size: 64, offset: 1600)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !746, file: !76, line: 756, baseType: !10, size: 64, offset: 1664)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !746, file: !76, line: 757, baseType: !10, size: 64, offset: 1728)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !746, file: !76, line: 758, baseType: !10, size: 64, offset: 1792)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !746, file: !76, line: 759, baseType: !10, size: 64, offset: 1856)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !746, file: !76, line: 760, baseType: !10, size: 64, offset: 1920)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !746, file: !76, line: 763, baseType: !813, size: 328, offset: 1984)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 328, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 41)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !746, file: !76, line: 764, baseType: !65, size: 32, offset: 2336)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !746, file: !76, line: 765, baseType: !818, size: 368, offset: 2368)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 368, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 46)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !746, file: !76, line: 766, baseType: !65, size: 32, offset: 2752)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !746, file: !76, line: 767, baseType: !823, size: 256, offset: 2816)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !76, line: 673, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !76, line: 665, size: 256, elements: !825)
!825 = !{!826, !834, !835, !836, !837}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !824, file: !76, line: 666, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !76, line: 663, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !76, line: 659, size: 192, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !829, file: !76, line: 660, baseType: !758, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !829, file: !76, line: 661, baseType: !65, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !829, file: !76, line: 662, baseType: !760, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !824, file: !76, line: 667, baseType: !65, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !824, file: !76, line: 668, baseType: !65, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !824, file: !76, line: 671, baseType: !65, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !824, file: !76, line: 672, baseType: !791, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !746, file: !76, line: 768, baseType: !65, size: 32, offset: 3072)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !746, file: !76, line: 769, baseType: !840, size: 704, offset: 3136)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !76, line: 703, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !76, line: 677, size: 704, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !841, file: !76, line: 679, baseType: !75, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !841, file: !76, line: 683, baseType: !95, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !841, file: !76, line: 685, baseType: !210, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !841, file: !76, line: 689, baseType: !68, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !841, file: !76, line: 690, baseType: !210, size: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !841, file: !76, line: 691, baseType: !210, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !841, file: !76, line: 692, baseType: !75, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !841, file: !76, line: 692, baseType: !75, size: 64, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !841, file: !76, line: 693, baseType: !65, size: 32, offset: 512)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !841, file: !76, line: 696, baseType: !65, size: 32, offset: 544)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !841, file: !76, line: 697, baseType: !10, size: 64, offset: 576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !841, file: !76, line: 700, baseType: !7, size: 64, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !746, file: !76, line: 770, baseType: !10, size: 64, offset: 3840)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !746, file: !76, line: 771, baseType: !163, size: 64, offset: 3904)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !746, file: !76, line: 772, baseType: !95, size: 64, offset: 3968)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !746, file: !76, line: 773, baseType: !163, size: 64, offset: 4032)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !746, file: !76, line: 774, baseType: !86, size: 64, offset: 4096)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !746, file: !76, line: 775, baseType: !169, size: 64, offset: 4160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !746, file: !76, line: 778, baseType: !65, size: 32, offset: 4224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !746, file: !76, line: 779, baseType: !863, size: 131072, offset: 4256)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 131072, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 16384)
!866 = !DILocation(line: 353, column: 12, scope: !727)
!867 = !DILocation(line: 354, column: 18, scope: !727)
!868 = !{!347, !289, i64 536}
!869 = !{!870, !348, i64 40}
!870 = !{!"list", !289, i64 0, !289, i64 8, !289, i64 16, !289, i64 24, !289, i64 32, !348, i64 40}
!871 = !DILocation(line: 354, column: 9, scope: !727)
!872 = !DILocation(line: 356, column: 9, scope: !735)
!873 = !DILocation(line: 356, column: 9, scope: !727)
!874 = !DILocation(line: 357, column: 9, scope: !734)
!875 = !DILocation(line: 357, column: 18, scope: !734)
!876 = !DILocation(line: 360, column: 9, scope: !734)
!877 = !DILocation(line: 361, column: 9, scope: !734)
!878 = !DILocation(line: 361, column: 21, scope: !734)
!879 = !DILocation(line: 358, column: 19, scope: !734)
!880 = !DILocation(line: 362, column: 29, scope: !743)
!881 = !{!882, !289, i64 16}
!882 = !{!"listNode", !289, i64 0, !289, i64 8, !289, i64 16}
!883 = !DILocation(line: 362, column: 21, scope: !743)
!884 = !DILocation(line: 363, column: 25, scope: !743)
!885 = !DILocation(line: 363, column: 22, scope: !743)
!886 = distinct !{!886, !877, !887}
!887 = !DILocation(line: 364, column: 9, scope: !734)
!888 = !DILocation(line: 0, scope: !743)
!889 = !DILocation(line: 365, column: 5, scope: !735)
!890 = !DILocation(line: 365, column: 5, scope: !734)
!891 = !DILocation(line: 366, column: 16, scope: !892)
!892 = distinct !DILexicalBlock(scope: !727, file: !3, line: 366, column: 9)
!893 = !{!347, !290, i64 1880}
!894 = !DILocation(line: 366, column: 26, scope: !892)
!895 = !DILocation(line: 366, column: 9, scope: !727)
!896 = !DILocation(line: 367, column: 37, scope: !897)
!897 = distinct !DILexicalBlock(scope: !892, file: !3, line: 366, column: 38)
!898 = !{!347, !289, i64 1952}
!899 = !DILocalVariable(name: "s", arg: 1, scope: !900, file: !13, line: 180, type: !536)
!900 = distinct !DISubprogram(name: "sdsalloc", scope: !13, file: !13, line: 180, type: !532, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !901)
!901 = !{!899, !902}
!902 = !DILocalVariable(name: "flags", scope: !900, file: !13, line: 181, type: !20)
!903 = !DILocation(line: 180, column: 41, scope: !900, inlinedAt: !904)
!904 = distinct !DILocation(line: 367, column: 21, scope: !897)
!905 = !DILocation(line: 181, column: 27, scope: !900, inlinedAt: !904)
!906 = !DILocation(line: 181, column: 19, scope: !900, inlinedAt: !904)
!907 = !DILocation(line: 182, column: 5, scope: !900, inlinedAt: !904)
!908 = !DILocation(line: 184, column: 20, scope: !909, inlinedAt: !904)
!909 = distinct !DILexicalBlock(scope: !900, file: !13, line: 182, column: 33)
!910 = !DILocation(line: 184, column: 13, scope: !909, inlinedAt: !904)
!911 = !DILocation(line: 186, column: 34, scope: !909, inlinedAt: !904)
!912 = !DILocation(line: 186, column: 20, scope: !909, inlinedAt: !904)
!913 = !DILocation(line: 186, column: 13, scope: !909, inlinedAt: !904)
!914 = !DILocation(line: 188, column: 35, scope: !909, inlinedAt: !904)
!915 = !DILocation(line: 188, column: 20, scope: !909, inlinedAt: !904)
!916 = !DILocation(line: 188, column: 13, scope: !909, inlinedAt: !904)
!917 = !DILocation(line: 190, column: 35, scope: !909, inlinedAt: !904)
!918 = !DILocation(line: 190, column: 20, scope: !909, inlinedAt: !904)
!919 = !DILocation(line: 190, column: 13, scope: !909, inlinedAt: !904)
!920 = !DILocation(line: 192, column: 35, scope: !909, inlinedAt: !904)
!921 = !DILocation(line: 192, column: 13, scope: !909, inlinedAt: !904)
!922 = !DILocation(line: 0, scope: !909, inlinedAt: !904)
!923 = !DILocation(line: 0, scope: !897)
!924 = !DILocation(line: 195, column: 1, scope: !900, inlinedAt: !904)
!925 = !DILocation(line: 367, column: 46, scope: !897)
