; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sharedObjectsStruct = type { %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, [10 x %struct.redisObject*], [10000 x %struct.redisObject*], [32 x %struct.redisObject*], [32 x %struct.redisObject*], i8*, i8* }
%struct.redisObject = type { i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !9, !10, !25, !35, !45}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !5, line: 60, baseType: !6)
!5 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !7, line: 105, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !12, line: 51, size: 24, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !18, !19, !20}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !12, line: 52, baseType: !15, size: 8)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5, line: 24, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !7, line: 43, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !11, file: !12, line: 53, baseType: !15, size: 8, offset: 8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !11, file: !12, line: 54, baseType: !17, size: 8, offset: 16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !11, file: !12, line: 55, baseType: !21, offset: 24)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !23)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: -1)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !12, line: 57, size: 40, elements: !27)
!27 = !{!28, !32, !33, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !12, line: 58, baseType: !29, size: 16)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !5, line: 36, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 57, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !26, file: !12, line: 59, baseType: !29, size: 16, offset: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !12, line: 60, baseType: !17, size: 8, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !26, file: !12, line: 61, baseType: !21, offset: 40)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !12, line: 63, size: 72, elements: !37)
!37 = !{!38, !42, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !12, line: 64, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5, line: 48, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !7, line: 79, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !36, file: !12, line: 65, baseType: !39, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !12, line: 66, baseType: !17, size: 8, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !36, file: !12, line: 67, baseType: !21, offset: 72)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !12, line: 69, size: 136, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !12, line: 70, baseType: !4, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !12, line: 71, baseType: !4, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !12, line: 72, baseType: !17, size: 8, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !12, line: 73, baseType: !21, offset: 136)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "geoArrayCreate", scope: !1, file: !1, line: 53, type: !57, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !81)
!57 = !DISubroutineType(types: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "geoArray", file: !61, line: 20, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.h", directory: "/root/.unikraft/apps/redis/build")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "geoArray", file: !61, line: 16, size: 192, elements: !63)
!63 = !{!64, !75, !80}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !62, file: !61, line: 17, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "geoPoint", file: !61, line: 8, size: 320, elements: !67)
!67 = !{!68, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !66, file: !61, line: 9, baseType: !69, size: 64)
!69 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !66, file: !61, line: 10, baseType: !69, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !66, file: !61, line: 11, baseType: !69, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !66, file: !61, line: 12, baseType: !69, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "member", scope: !66, file: !61, line: 13, baseType: !74, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !62, file: !61, line: 18, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 40, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !79, line: 129, baseType: !8)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !62, file: !61, line: 19, baseType: !76, size: 64, offset: 128)
!81 = !{!82}
!82 = !DILocalVariable(name: "ga", scope: !56, file: !1, line: 54, type: !59)
!83 = !DILocation(line: 54, column: 20, scope: !56)
!84 = !DILocation(line: 54, column: 15, scope: !56)
!85 = !DILocation(line: 56, column: 9, scope: !56)
!86 = !DILocation(line: 56, column: 15, scope: !56)
!87 = !{!88, !89, i64 0}
!88 = !{!"geoArray", !89, i64 0, !92, i64 8, !92, i64 16}
!89 = !{!"any pointer", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !{!"long", !90, i64 0}
!93 = !DILocation(line: 57, column: 9, scope: !56)
!94 = !DILocation(line: 57, column: 17, scope: !56)
!95 = !{!92, !92, i64 0}
!96 = !DILocation(line: 59, column: 5, scope: !56)
!97 = distinct !DISubprogram(name: "geoArrayAppend", scope: !1, file: !1, line: 64, type: !98, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !102)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !59}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "geoPoint", file: !61, line: 14, baseType: !66)
!102 = !{!103, !104}
!103 = !DILocalVariable(name: "ga", arg: 1, scope: !97, file: !1, line: 64, type: !59)
!104 = !DILocalVariable(name: "gp", scope: !97, file: !1, line: 69, type: !100)
!105 = !DILocation(line: 64, column: 36, scope: !97)
!106 = !DILocation(line: 65, column: 13, scope: !107)
!107 = distinct !DILexicalBlock(scope: !97, file: !1, line: 65, column: 9)
!108 = !{!88, !92, i64 16}
!109 = !DILocation(line: 65, column: 25, scope: !107)
!110 = !{!88, !92, i64 8}
!111 = !DILocation(line: 65, column: 18, scope: !107)
!112 = !DILocation(line: 65, column: 9, scope: !97)
!113 = !DILocation(line: 69, column: 24, scope: !97)
!114 = !DILocation(line: 66, column: 36, scope: !115)
!115 = distinct !DILexicalBlock(scope: !107, file: !1, line: 65, column: 34)
!116 = !DILocation(line: 66, column: 23, scope: !115)
!117 = !DILocation(line: 66, column: 59, scope: !115)
!118 = !DILocation(line: 66, column: 21, scope: !115)
!119 = !DILocation(line: 67, column: 34, scope: !115)
!120 = !DILocation(line: 67, column: 56, scope: !115)
!121 = !DILocation(line: 67, column: 21, scope: !115)
!122 = !DILocation(line: 67, column: 19, scope: !115)
!123 = !DILocation(line: 68, column: 5, scope: !115)
!124 = !DILocation(line: 69, column: 34, scope: !97)
!125 = !DILocation(line: 69, column: 29, scope: !97)
!126 = !DILocation(line: 69, column: 15, scope: !97)
!127 = !DILocation(line: 70, column: 13, scope: !97)
!128 = !DILocation(line: 71, column: 5, scope: !97)
!129 = distinct !DISubprogram(name: "geoArrayFree", scope: !1, file: !1, line: 75, type: !130, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !59}
!132 = !{!133, !134}
!133 = !DILocalVariable(name: "ga", arg: 1, scope: !129, file: !1, line: 75, type: !59)
!134 = !DILocalVariable(name: "i", scope: !129, file: !1, line: 76, type: !76)
!135 = !DILocation(line: 75, column: 29, scope: !129)
!136 = !DILocation(line: 76, column: 12, scope: !129)
!137 = !DILocation(line: 77, column: 10, scope: !138)
!138 = distinct !DILexicalBlock(scope: !129, file: !1, line: 77, column: 5)
!139 = !DILocation(line: 77, column: 25, scope: !140)
!140 = distinct !DILexicalBlock(scope: !138, file: !1, line: 77, column: 5)
!141 = !DILocation(line: 77, column: 19, scope: !140)
!142 = !DILocation(line: 0, scope: !129)
!143 = !DILocation(line: 77, column: 5, scope: !138)
!144 = !DILocation(line: 77, column: 57, scope: !140)
!145 = !{!146, !89, i64 32}
!146 = !{!"geoPoint", !147, i64 0, !147, i64 8, !147, i64 16, !147, i64 24, !89, i64 32}
!147 = !{!"double", !90, i64 0}
!148 = !DILocation(line: 77, column: 36, scope: !140)
!149 = !DILocation(line: 77, column: 32, scope: !140)
!150 = !DILocation(line: 77, column: 5, scope: !140)
!151 = distinct !{!151, !143, !152}
!152 = !DILocation(line: 77, column: 63, scope: !138)
!153 = !DILocation(line: 78, column: 11, scope: !129)
!154 = !DILocation(line: 78, column: 5, scope: !129)
!155 = !DILocation(line: 79, column: 11, scope: !129)
!156 = !DILocation(line: 79, column: 5, scope: !129)
!157 = !DILocation(line: 80, column: 1, scope: !129)
!158 = distinct !DISubprogram(name: "decodeGeohash", scope: !1, file: !1, line: 85, type: !159, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !163)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !69, !162}
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!163 = !{!164, !165, !166}
!164 = !DILocalVariable(name: "bits", arg: 1, scope: !158, file: !1, line: 85, type: !69)
!165 = !DILocalVariable(name: "xy", arg: 2, scope: !158, file: !1, line: 85, type: !162)
!166 = !DILocalVariable(name: "hash", scope: !158, file: !1, line: 86, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashBits", file: !168, line: 69, baseType: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash.h", directory: "/root/.unikraft/apps/redis/build")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 66, size: 128, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !169, file: !168, line: 67, baseType: !4, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !169, file: !168, line: 68, baseType: !15, size: 8, offset: 64)
!173 = !DILocation(line: 85, column: 26, scope: !158)
!174 = !DILocation(line: 85, column: 40, scope: !158)
!175 = !DILocation(line: 86, column: 34, scope: !158)
!176 = !DILocation(line: 86, column: 17, scope: !158)
!177 = !DILocation(line: 87, column: 12, scope: !158)
!178 = !DILocation(line: 87, column: 5, scope: !158)
!179 = distinct !DISubprogram(name: "extractLongLatOrReply", scope: !1, file: !1, line: 93, type: !180, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !420)
!180 = !DISubroutineType(types: !181)
!181 = !{!161, !182, !310, !162}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !184, line: 780, baseType: !185)
!184 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !184, line: 723, size: 135360, elements: !186)
!186 = !{!187, !188, !189, !293, !303, !305, !306, !307, !308, !309, !311, !335, !336, !337, !338, !339, !340, !342, !343, !346, !347, !348, !349, !350, !351, !352, !353, !358, !359, !360, !361, !362, !363, !364, !365, !369, !370, !374, !375, !391, !392, !409, !410, !411, !412, !413, !414, !415, !416}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !185, file: !184, line: 724, baseType: !4, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !185, file: !184, line: 725, baseType: !161, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !185, file: !184, line: 726, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !184, line: 656, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !184, line: 647, size: 512, elements: !193)
!193 = !{!194, !257, !258, !259, !260, !261, !262, !264}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !192, file: !184, line: 648, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !197, line: 82, baseType: !198)
!197 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !197, line: 76, size: 768, elements: !199)
!199 = !{!200, !225, !226, !255, !256}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !197, line: 77, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !197, line: 65, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !197, line: 58, size: 384, elements: !204)
!204 = !{!205, !211, !215, !216, !220, !224}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !203, file: !197, line: 59, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!4, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !203, file: !197, line: 60, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!9, !9, !209}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !203, file: !197, line: 61, baseType: !212, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !203, file: !197, line: 62, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!161, !9, !209, !209}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !203, file: !197, line: 63, baseType: !221, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !9, !9}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !203, file: !197, line: 64, baseType: !221, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !198, file: !197, line: 78, baseType: !9, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !198, file: !197, line: 79, baseType: !227, size: 512, offset: 128)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 512, elements: !253)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !197, line: 74, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !197, line: 69, size: 256, elements: !230)
!230 = !{!231, !250, !251, !252}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !229, file: !197, line: 70, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !197, line: 56, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !197, line: 47, size: 192, elements: !236)
!236 = !{!237, !238, !248}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !235, file: !197, line: 48, baseType: !9, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !235, file: !197, line: 54, baseType: !239, size: 64, offset: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !197, line: 49, size: 64, elements: !240)
!240 = !{!241, !242, !243, !247}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !239, file: !197, line: 50, baseType: !9, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !239, file: !197, line: 51, baseType: !4, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !239, file: !197, line: 52, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !5, line: 56, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !7, line: 103, baseType: !246)
!246 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !239, file: !197, line: 53, baseType: !69, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !197, line: 55, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !197, line: 71, baseType: !8, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !229, file: !197, line: 72, baseType: !8, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !229, file: !197, line: 73, baseType: !8, size: 64, offset: 192)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !198, file: !197, line: 80, baseType: !246, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !198, file: !197, line: 81, baseType: !8, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !192, file: !184, line: 649, baseType: !195, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !192, file: !184, line: 650, baseType: !195, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !192, file: !184, line: 651, baseType: !195, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !192, file: !184, line: 652, baseType: !195, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !192, file: !184, line: 653, baseType: !161, size: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !192, file: !184, line: 654, baseType: !263, size: 64, offset: 384)
!263 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !192, file: !184, line: 655, baseType: !265, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !267, line: 54, baseType: !268)
!267 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !267, line: 47, size: 384, elements: !269)
!269 = !{!270, !279, !280, !284, !288, !292}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !268, file: !267, line: 48, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !267, line: 40, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !267, line: 36, size: 192, elements: !274)
!274 = !{!275, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !273, file: !267, line: 37, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !267, line: 38, baseType: !276, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !267, line: 39, baseType: !9, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !268, file: !267, line: 49, baseType: !271, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !268, file: !267, line: 50, baseType: !281, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!9, !9}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !268, file: !267, line: 51, baseType: !285, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !9}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !268, file: !267, line: 52, baseType: !289, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!161, !9, !9}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !268, file: !267, line: 53, baseType: !8, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !184, line: 727, baseType: !294, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !184, line: 622, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !184, line: 614, size: 128, elements: !297)
!297 = !{!298, !299, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !184, line: 615, baseType: !41, size: 4, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !296, file: !184, line: 616, baseType: !41, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !296, file: !184, line: 617, baseType: !41, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !296, file: !184, line: 620, baseType: !161, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !296, file: !184, line: 621, baseType: !9, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !185, file: !184, line: 728, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !12, line: 43, baseType: !74)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !185, file: !184, line: 729, baseType: !76, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !185, file: !184, line: 730, baseType: !304, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !185, file: !184, line: 734, baseType: !76, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !185, file: !184, line: 735, baseType: !161, size: 32, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !185, file: !184, line: 736, baseType: !310, size: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !185, file: !184, line: 737, baseType: !312, size: 64, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !184, line: 1307, size: 640, elements: !314)
!314 = !{!315, !316, !321, !322, !323, !324, !330, !331, !332, !333, !334}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !184, line: 1308, baseType: !74, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !313, file: !184, line: 1309, baseType: !317, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !184, line: 1305, baseType: !319)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !182}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !313, file: !184, line: 1310, baseType: !161, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !313, file: !184, line: 1311, baseType: !74, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !184, line: 1312, baseType: !161, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !313, file: !184, line: 1315, baseType: !325, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !184, line: 1306, baseType: !327)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !312, !310, !161, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !313, file: !184, line: 1317, baseType: !161, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !313, file: !184, line: 1318, baseType: !161, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !313, file: !184, line: 1319, baseType: !161, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !313, file: !184, line: 1320, baseType: !263, size: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !313, file: !184, line: 1320, baseType: !263, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !185, file: !184, line: 737, baseType: !312, size: 64, offset: 704)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !185, file: !184, line: 738, baseType: !161, size: 32, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !185, file: !184, line: 739, baseType: !161, size: 32, offset: 800)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !185, file: !184, line: 740, baseType: !246, size: 64, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !185, file: !184, line: 741, baseType: !265, size: 64, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !185, file: !184, line: 742, baseType: !341, size: 64, offset: 960)
!341 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !185, file: !184, line: 743, baseType: !76, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !185, file: !184, line: 745, baseType: !344, size: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !345, line: 34, baseType: !246)
!345 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !185, file: !184, line: 746, baseType: !344, size: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !185, file: !184, line: 747, baseType: !344, size: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !184, line: 748, baseType: !161, size: 32, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !185, file: !184, line: 749, baseType: !161, size: 32, offset: 1312)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !185, file: !184, line: 750, baseType: !161, size: 32, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !185, file: !184, line: 751, baseType: !161, size: 32, offset: 1376)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !185, file: !184, line: 752, baseType: !161, size: 32, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !185, file: !184, line: 753, baseType: !354, size: 64, offset: 1472)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !355, line: 173, baseType: !356)
!355 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 100, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !79, line: 44, baseType: !246)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !185, file: !184, line: 754, baseType: !354, size: 64, offset: 1536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !185, file: !184, line: 755, baseType: !304, size: 64, offset: 1600)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !185, file: !184, line: 756, baseType: !263, size: 64, offset: 1664)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !185, file: !184, line: 757, baseType: !263, size: 64, offset: 1728)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !185, file: !184, line: 758, baseType: !263, size: 64, offset: 1792)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !185, file: !184, line: 759, baseType: !263, size: 64, offset: 1856)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !185, file: !184, line: 760, baseType: !263, size: 64, offset: 1920)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !185, file: !184, line: 763, baseType: !366, size: 328, offset: 1984)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 328, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 41)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !185, file: !184, line: 764, baseType: !161, size: 32, offset: 2336)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !185, file: !184, line: 765, baseType: !371, size: 368, offset: 2368)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 368, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 46)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !185, file: !184, line: 766, baseType: !161, size: 32, offset: 2752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !185, file: !184, line: 767, baseType: !376, size: 256, offset: 2816)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !184, line: 673, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !184, line: 665, size: 256, elements: !378)
!378 = !{!379, !387, !388, !389, !390}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !377, file: !184, line: 666, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !184, line: 663, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !184, line: 659, size: 192, elements: !383)
!383 = !{!384, !385, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !382, file: !184, line: 660, baseType: !310, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !382, file: !184, line: 661, baseType: !161, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !382, file: !184, line: 662, baseType: !312, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !377, file: !184, line: 667, baseType: !161, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !377, file: !184, line: 668, baseType: !161, size: 32, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !377, file: !184, line: 671, baseType: !161, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !377, file: !184, line: 672, baseType: !344, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !185, file: !184, line: 768, baseType: !161, size: 32, offset: 3072)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !185, file: !184, line: 769, baseType: !393, size: 704, offset: 3136)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !184, line: 703, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !184, line: 677, size: 704, elements: !395)
!395 = !{!396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !394, file: !184, line: 679, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !184, line: 52, baseType: !263)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !394, file: !184, line: 683, baseType: !195, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !394, file: !184, line: 685, baseType: !294, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !394, file: !184, line: 689, baseType: !76, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !394, file: !184, line: 690, baseType: !294, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !394, file: !184, line: 691, baseType: !294, size: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !394, file: !184, line: 692, baseType: !397, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !394, file: !184, line: 692, baseType: !397, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !394, file: !184, line: 693, baseType: !161, size: 32, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !394, file: !184, line: 696, baseType: !161, size: 32, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !394, file: !184, line: 697, baseType: !263, size: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !394, file: !184, line: 700, baseType: !9, size: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !185, file: !184, line: 770, baseType: !263, size: 64, offset: 3840)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !185, file: !184, line: 771, baseType: !265, size: 64, offset: 3904)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !185, file: !184, line: 772, baseType: !195, size: 64, offset: 3968)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !185, file: !184, line: 773, baseType: !265, size: 64, offset: 4032)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !185, file: !184, line: 774, baseType: !304, size: 64, offset: 4096)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !185, file: !184, line: 775, baseType: !271, size: 64, offset: 4160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !185, file: !184, line: 778, baseType: !161, size: 32, offset: 4224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !185, file: !184, line: 779, baseType: !417, size: 131072, offset: 4256)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 131072, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 16384)
!420 = !{!421, !422, !423, !424}
!421 = !DILocalVariable(name: "c", arg: 1, scope: !179, file: !1, line: 93, type: !182)
!422 = !DILocalVariable(name: "argv", arg: 2, scope: !179, file: !1, line: 93, type: !310)
!423 = !DILocalVariable(name: "xy", arg: 3, scope: !179, file: !1, line: 93, type: !162)
!424 = !DILocalVariable(name: "i", scope: !179, file: !1, line: 94, type: !161)
!425 = !DILocation(line: 93, column: 35, scope: !179)
!426 = !DILocation(line: 93, column: 45, scope: !179)
!427 = !DILocation(line: 93, column: 59, scope: !179)
!428 = !DILocation(line: 94, column: 9, scope: !179)
!429 = !DILocation(line: 95, column: 10, scope: !430)
!430 = distinct !DILexicalBlock(scope: !179, file: !1, line: 95, column: 5)
!431 = !DILocation(line: 95, column: 5, scope: !430)
!432 = !DILocation(line: 96, column: 43, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 96, column: 13)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 95, column: 29)
!435 = distinct !DILexicalBlock(scope: !430, file: !1, line: 95, column: 5)
!436 = !{!89, !89, i64 0}
!437 = !DILocation(line: 96, column: 13, scope: !433)
!438 = !DILocation(line: 96, column: 66, scope: !433)
!439 = !DILocation(line: 96, column: 13, scope: !434)
!440 = !DILocation(line: 95, column: 5, scope: !435)
!441 = !DILocation(line: 96, column: 55, scope: !433)
!442 = !DILocation(line: 101, column: 39, scope: !443)
!443 = distinct !DILexicalBlock(scope: !179, file: !1, line: 101, column: 9)
!444 = !DILocation(line: 101, column: 54, scope: !443)
!445 = !DILocation(line: 102, column: 9, scope: !443)
!446 = !{!147, !147, i64 0}
!447 = !DILocation(line: 102, column: 15, scope: !443)
!448 = !DILocation(line: 102, column: 30, scope: !443)
!449 = !DILocation(line: 102, column: 39, scope: !443)
!450 = !DILocation(line: 101, column: 9, scope: !179)
!451 = !DILocation(line: 103, column: 37, scope: !452)
!452 = distinct !DILexicalBlock(scope: !443, file: !1, line: 102, column: 54)
!453 = !DILocation(line: 104, column: 62, scope: !452)
!454 = !DILocation(line: 104, column: 68, scope: !452)
!455 = !DILocation(line: 103, column: 24, scope: !452)
!456 = !DILocation(line: 103, column: 9, scope: !452)
!457 = !DILocation(line: 105, column: 9, scope: !452)
!458 = !DILocation(line: 0, scope: !179)
!459 = !DILocation(line: 0, scope: !460)
!460 = distinct !DILexicalBlock(scope: !433, file: !1, line: 97, column: 19)
!461 = !DILocation(line: 108, column: 1, scope: !179)
!462 = !DILocation(line: 101, column: 9, scope: !443)
!463 = !DILocation(line: 101, column: 15, scope: !443)
!464 = !DILocation(line: 101, column: 30, scope: !443)
!465 = distinct !DISubprogram(name: "longLatFromMember", scope: !1, file: !1, line: 113, type: !466, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!161, !294, !294, !162}
!468 = !{!469, !470, !471, !472}
!469 = !DILocalVariable(name: "zobj", arg: 1, scope: !465, file: !1, line: 113, type: !294)
!470 = !DILocalVariable(name: "member", arg: 2, scope: !465, file: !1, line: 113, type: !294)
!471 = !DILocalVariable(name: "xy", arg: 3, scope: !465, file: !1, line: 113, type: !162)
!472 = !DILocalVariable(name: "score", scope: !465, file: !1, line: 114, type: !69)
!473 = !DILocation(line: 113, column: 29, scope: !465)
!474 = !DILocation(line: 113, column: 41, scope: !465)
!475 = !DILocation(line: 113, column: 57, scope: !465)
!476 = !DILocation(line: 114, column: 5, scope: !465)
!477 = !DILocation(line: 114, column: 12, scope: !465)
!478 = !DILocation(line: 116, column: 33, scope: !479)
!479 = distinct !DILexicalBlock(scope: !465, file: !1, line: 116, column: 9)
!480 = !{!481, !89, i64 8}
!481 = !{!"redisObject", !482, i64 0, !482, i64 0, !482, i64 1, !482, i64 4, !89, i64 8}
!482 = !{!"int", !90, i64 0}
!483 = !DILocation(line: 116, column: 9, scope: !479)
!484 = !DILocation(line: 116, column: 46, scope: !479)
!485 = !DILocation(line: 116, column: 9, scope: !465)
!486 = !DILocation(line: 116, column: 56, scope: !479)
!487 = !DILocation(line: 117, column: 24, scope: !488)
!488 = distinct !DILexicalBlock(scope: !465, file: !1, line: 117, column: 9)
!489 = !DILocation(line: 85, column: 26, scope: !158, inlinedAt: !490)
!490 = distinct !DILocation(line: 117, column: 10, scope: !488)
!491 = !DILocation(line: 85, column: 40, scope: !158, inlinedAt: !490)
!492 = !DILocation(line: 86, column: 34, scope: !158, inlinedAt: !490)
!493 = !DILocation(line: 86, column: 17, scope: !158, inlinedAt: !490)
!494 = !DILocation(line: 87, column: 12, scope: !158, inlinedAt: !490)
!495 = !DILocation(line: 87, column: 5, scope: !158, inlinedAt: !490)
!496 = !DILocation(line: 117, column: 10, scope: !488)
!497 = !DILocation(line: 117, column: 9, scope: !465)
!498 = !DILocation(line: 0, scope: !465)
!499 = !DILocation(line: 117, column: 36, scope: !488)
!500 = !DILocation(line: 0, scope: !488)
!501 = !DILocation(line: 119, column: 1, scope: !465)
!502 = distinct !DISubprogram(name: "extractUnitOrReply", scope: !1, file: !1, line: 127, type: !503, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{!69, !182, !294}
!505 = !{!506, !507, !508}
!506 = !DILocalVariable(name: "c", arg: 1, scope: !502, file: !1, line: 127, type: !182)
!507 = !DILocalVariable(name: "unit", arg: 2, scope: !502, file: !1, line: 127, type: !294)
!508 = !DILocalVariable(name: "u", scope: !502, file: !1, line: 128, type: !74)
!509 = !DILocation(line: 127, column: 35, scope: !502)
!510 = !DILocation(line: 127, column: 44, scope: !502)
!511 = !DILocation(line: 128, column: 21, scope: !502)
!512 = !DILocation(line: 128, column: 11, scope: !502)
!513 = !DILocation(line: 130, column: 10, scope: !514)
!514 = distinct !DILexicalBlock(scope: !502, file: !1, line: 130, column: 9)
!515 = !DILocation(line: 130, column: 9, scope: !502)
!516 = !DILocation(line: 132, column: 17, scope: !517)
!517 = distinct !DILexicalBlock(scope: !514, file: !1, line: 132, column: 16)
!518 = !DILocation(line: 132, column: 16, scope: !514)
!519 = !DILocation(line: 134, column: 17, scope: !520)
!520 = distinct !DILexicalBlock(scope: !517, file: !1, line: 134, column: 16)
!521 = !DILocation(line: 134, column: 16, scope: !517)
!522 = !DILocation(line: 136, column: 17, scope: !523)
!523 = distinct !DILexicalBlock(scope: !520, file: !1, line: 136, column: 16)
!524 = !DILocation(line: 136, column: 16, scope: !520)
!525 = !DILocation(line: 139, column: 9, scope: !526)
!526 = distinct !DILexicalBlock(scope: !523, file: !1, line: 138, column: 12)
!527 = !DILocation(line: 141, column: 9, scope: !526)
!528 = !DILocation(line: 0, scope: !529)
!529 = distinct !DILexicalBlock(scope: !514, file: !1, line: 130, column: 26)
!530 = !DILocation(line: 143, column: 1, scope: !502)
!531 = distinct !DISubprogram(name: "extractDistanceOrReply", scope: !1, file: !1, line: 152, type: !532, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!69, !182, !310, !162}
!534 = !{!535, !536, !537, !538, !539}
!535 = !DILocalVariable(name: "c", arg: 1, scope: !531, file: !1, line: 152, type: !182)
!536 = !DILocalVariable(name: "argv", arg: 2, scope: !531, file: !1, line: 152, type: !310)
!537 = !DILocalVariable(name: "conversion", arg: 3, scope: !531, file: !1, line: 153, type: !162)
!538 = !DILocalVariable(name: "distance", scope: !531, file: !1, line: 154, type: !69)
!539 = !DILocalVariable(name: "to_meters", scope: !531, file: !1, line: 165, type: !69)
!540 = !DILocation(line: 152, column: 39, scope: !531)
!541 = !DILocation(line: 152, column: 49, scope: !531)
!542 = !DILocation(line: 153, column: 46, scope: !531)
!543 = !DILocation(line: 154, column: 5, scope: !531)
!544 = !DILocation(line: 155, column: 39, scope: !545)
!545 = distinct !DILexicalBlock(scope: !531, file: !1, line: 155, column: 9)
!546 = !DILocation(line: 154, column: 12, scope: !531)
!547 = !DILocation(line: 155, column: 9, scope: !545)
!548 = !DILocation(line: 156, column: 59, scope: !545)
!549 = !DILocation(line: 155, column: 9, scope: !531)
!550 = !DILocation(line: 160, column: 9, scope: !551)
!551 = distinct !DILexicalBlock(scope: !531, file: !1, line: 160, column: 9)
!552 = !DILocation(line: 160, column: 18, scope: !551)
!553 = !DILocation(line: 160, column: 9, scope: !531)
!554 = !DILocation(line: 161, column: 9, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !1, line: 160, column: 23)
!556 = !DILocation(line: 162, column: 9, scope: !555)
!557 = !DILocation(line: 165, column: 45, scope: !531)
!558 = !DILocation(line: 165, column: 24, scope: !531)
!559 = !DILocation(line: 165, column: 12, scope: !531)
!560 = !DILocation(line: 166, column: 19, scope: !561)
!561 = distinct !DILexicalBlock(scope: !531, file: !1, line: 166, column: 9)
!562 = !DILocation(line: 166, column: 9, scope: !531)
!563 = !DILocation(line: 170, column: 9, scope: !564)
!564 = distinct !DILexicalBlock(scope: !531, file: !1, line: 170, column: 9)
!565 = !DILocation(line: 170, column: 9, scope: !531)
!566 = !DILocation(line: 170, column: 33, scope: !564)
!567 = !DILocation(line: 170, column: 21, scope: !564)
!568 = !DILocation(line: 171, column: 12, scope: !531)
!569 = !DILocation(line: 171, column: 21, scope: !531)
!570 = !DILocation(line: 171, column: 5, scope: !531)
!571 = !DILocation(line: 0, scope: !531)
!572 = !DILocation(line: 0, scope: !573)
!573 = distinct !DILexicalBlock(scope: !561, file: !1, line: 166, column: 24)
!574 = !DILocation(line: 172, column: 1, scope: !531)
!575 = distinct !DISubprogram(name: "addReplyDoubleDistance", scope: !1, file: !1, line: 179, type: !576, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !182, !69}
!578 = !{!579, !580, !581, !585}
!579 = !DILocalVariable(name: "c", arg: 1, scope: !575, file: !1, line: 179, type: !182)
!580 = !DILocalVariable(name: "d", arg: 2, scope: !575, file: !1, line: 179, type: !69)
!581 = !DILocalVariable(name: "dbuf", scope: !575, file: !1, line: 180, type: !582)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 128)
!585 = !DILocalVariable(name: "dlen", scope: !575, file: !1, line: 181, type: !161)
!586 = !DILocation(line: 179, column: 37, scope: !575)
!587 = !DILocation(line: 179, column: 47, scope: !575)
!588 = !DILocation(line: 180, column: 5, scope: !575)
!589 = !DILocation(line: 180, column: 10, scope: !575)
!590 = !DILocation(line: 181, column: 16, scope: !575)
!591 = !DILocation(line: 181, column: 9, scope: !575)
!592 = !DILocation(line: 182, column: 34, scope: !575)
!593 = !DILocation(line: 182, column: 5, scope: !575)
!594 = !DILocation(line: 183, column: 1, scope: !575)
!595 = distinct !DISubprogram(name: "geoAppendIfWithinRadius", scope: !1, file: !1, line: 191, type: !596, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!161, !59, !69, !69, !69, !69, !304}
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !608}
!599 = !DILocalVariable(name: "ga", arg: 1, scope: !595, file: !1, line: 191, type: !59)
!600 = !DILocalVariable(name: "lon", arg: 2, scope: !595, file: !1, line: 191, type: !69)
!601 = !DILocalVariable(name: "lat", arg: 3, scope: !595, file: !1, line: 191, type: !69)
!602 = !DILocalVariable(name: "radius", arg: 4, scope: !595, file: !1, line: 191, type: !69)
!603 = !DILocalVariable(name: "score", arg: 5, scope: !595, file: !1, line: 191, type: !69)
!604 = !DILocalVariable(name: "member", arg: 6, scope: !595, file: !1, line: 191, type: !304)
!605 = !DILocalVariable(name: "distance", scope: !595, file: !1, line: 192, type: !69)
!606 = !DILocalVariable(name: "xy", scope: !595, file: !1, line: 192, type: !607)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !253)
!608 = !DILocalVariable(name: "gp", scope: !595, file: !1, line: 204, type: !100)
!609 = !DILocation(line: 191, column: 39, scope: !595)
!610 = !DILocation(line: 191, column: 50, scope: !595)
!611 = !DILocation(line: 191, column: 62, scope: !595)
!612 = !DILocation(line: 191, column: 74, scope: !595)
!613 = !DILocation(line: 191, column: 89, scope: !595)
!614 = !DILocation(line: 191, column: 100, scope: !595)
!615 = !DILocation(line: 192, column: 5, scope: !595)
!616 = !DILocation(line: 192, column: 22, scope: !595)
!617 = !DILocation(line: 194, column: 30, scope: !618)
!618 = distinct !DILexicalBlock(scope: !595, file: !1, line: 194, column: 9)
!619 = !DILocation(line: 85, column: 26, scope: !158, inlinedAt: !620)
!620 = distinct !DILocation(line: 194, column: 10, scope: !618)
!621 = !DILocation(line: 85, column: 40, scope: !158, inlinedAt: !620)
!622 = !DILocation(line: 86, column: 34, scope: !158, inlinedAt: !620)
!623 = !DILocation(line: 86, column: 17, scope: !158, inlinedAt: !620)
!624 = !DILocation(line: 87, column: 12, scope: !158, inlinedAt: !620)
!625 = !DILocation(line: 87, column: 5, scope: !158, inlinedAt: !620)
!626 = !DILocation(line: 194, column: 10, scope: !618)
!627 = !DILocation(line: 194, column: 9, scope: !595)
!628 = !DILocation(line: 197, column: 53, scope: !629)
!629 = distinct !DILexicalBlock(scope: !595, file: !1, line: 197, column: 9)
!630 = !DILocation(line: 197, column: 60, scope: !629)
!631 = !DILocation(line: 192, column: 12, scope: !595)
!632 = !DILocation(line: 197, column: 10, scope: !629)
!633 = !DILocation(line: 197, column: 9, scope: !595)
!634 = !DILocation(line: 64, column: 36, scope: !97, inlinedAt: !635)
!635 = distinct !DILocation(line: 204, column: 20, scope: !595)
!636 = !DILocation(line: 65, column: 13, scope: !107, inlinedAt: !635)
!637 = !DILocation(line: 65, column: 25, scope: !107, inlinedAt: !635)
!638 = !DILocation(line: 65, column: 18, scope: !107, inlinedAt: !635)
!639 = !DILocation(line: 65, column: 9, scope: !97, inlinedAt: !635)
!640 = !DILocation(line: 69, column: 24, scope: !97, inlinedAt: !635)
!641 = !DILocation(line: 66, column: 36, scope: !115, inlinedAt: !635)
!642 = !DILocation(line: 66, column: 23, scope: !115, inlinedAt: !635)
!643 = !DILocation(line: 66, column: 59, scope: !115, inlinedAt: !635)
!644 = !DILocation(line: 66, column: 21, scope: !115, inlinedAt: !635)
!645 = !DILocation(line: 67, column: 34, scope: !115, inlinedAt: !635)
!646 = !DILocation(line: 67, column: 56, scope: !115, inlinedAt: !635)
!647 = !DILocation(line: 67, column: 21, scope: !115, inlinedAt: !635)
!648 = !DILocation(line: 67, column: 19, scope: !115, inlinedAt: !635)
!649 = !DILocation(line: 68, column: 5, scope: !115, inlinedAt: !635)
!650 = !DILocation(line: 69, column: 34, scope: !97, inlinedAt: !635)
!651 = !DILocation(line: 69, column: 29, scope: !97, inlinedAt: !635)
!652 = !DILocation(line: 69, column: 15, scope: !97, inlinedAt: !635)
!653 = !DILocation(line: 70, column: 13, scope: !97, inlinedAt: !635)
!654 = !DILocation(line: 71, column: 5, scope: !97, inlinedAt: !635)
!655 = !DILocation(line: 204, column: 15, scope: !595)
!656 = !DILocation(line: 205, column: 21, scope: !595)
!657 = !DILocation(line: 205, column: 19, scope: !595)
!658 = !{!146, !147, i64 0}
!659 = !DILocation(line: 206, column: 20, scope: !595)
!660 = !DILocation(line: 206, column: 9, scope: !595)
!661 = !DILocation(line: 206, column: 18, scope: !595)
!662 = !{!146, !147, i64 8}
!663 = !DILocation(line: 207, column: 16, scope: !595)
!664 = !DILocation(line: 207, column: 9, scope: !595)
!665 = !DILocation(line: 207, column: 14, scope: !595)
!666 = !{!146, !147, i64 16}
!667 = !DILocation(line: 208, column: 9, scope: !595)
!668 = !DILocation(line: 208, column: 16, scope: !595)
!669 = !DILocation(line: 209, column: 9, scope: !595)
!670 = !DILocation(line: 209, column: 15, scope: !595)
!671 = !{!146, !147, i64 24}
!672 = !DILocation(line: 0, scope: !618)
!673 = !DILocation(line: 211, column: 1, scope: !595)
!674 = distinct !DISubprogram(name: "geoGetPointsInRange", scope: !1, file: !1, line: 225, type: !675, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !677)
!675 = !DISubroutineType(types: !676)
!676 = !{!161, !294, !69, !69, !69, !69, !69, !59}
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !693, !694, !695, !699, !700, !701, !702, !703, !704, !705, !734, !735, !738}
!678 = !DILocalVariable(name: "zobj", arg: 1, scope: !674, file: !1, line: 225, type: !294)
!679 = !DILocalVariable(name: "min", arg: 2, scope: !674, file: !1, line: 225, type: !69)
!680 = !DILocalVariable(name: "max", arg: 3, scope: !674, file: !1, line: 225, type: !69)
!681 = !DILocalVariable(name: "lon", arg: 4, scope: !674, file: !1, line: 225, type: !69)
!682 = !DILocalVariable(name: "lat", arg: 5, scope: !674, file: !1, line: 225, type: !69)
!683 = !DILocalVariable(name: "radius", arg: 6, scope: !674, file: !1, line: 225, type: !69)
!684 = !DILocalVariable(name: "ga", arg: 7, scope: !674, file: !1, line: 225, type: !59)
!685 = !DILocalVariable(name: "range", scope: !674, file: !1, line: 228, type: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "zrangespec", file: !184, line: 1675, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !184, line: 1672, size: 192, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !687, file: !184, line: 1673, baseType: !69, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !687, file: !184, line: 1673, baseType: !69, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "minex", scope: !687, file: !184, line: 1674, baseType: !161, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "maxex", scope: !687, file: !184, line: 1674, baseType: !161, size: 32, offset: 160)
!693 = !DILocalVariable(name: "origincount", scope: !674, file: !1, line: 229, type: !76)
!694 = !DILocalVariable(name: "member", scope: !674, file: !1, line: 230, type: !304)
!695 = !DILocalVariable(name: "zl", scope: !696, file: !1, line: 233, type: !698)
!696 = distinct !DILexicalBlock(scope: !697, file: !1, line: 232, column: 49)
!697 = distinct !DILexicalBlock(scope: !674, file: !1, line: 232, column: 9)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!699 = !DILocalVariable(name: "eptr", scope: !696, file: !1, line: 234, type: !698)
!700 = !DILocalVariable(name: "sptr", scope: !696, file: !1, line: 234, type: !698)
!701 = !DILocalVariable(name: "vstr", scope: !696, file: !1, line: 235, type: !698)
!702 = !DILocalVariable(name: "vlen", scope: !696, file: !1, line: 236, type: !41)
!703 = !DILocalVariable(name: "vlong", scope: !696, file: !1, line: 237, type: !263)
!704 = !DILocalVariable(name: "score", scope: !696, file: !1, line: 238, type: !69)
!705 = !DILocalVariable(name: "zs", scope: !706, file: !1, line: 262, type: !708)
!706 = distinct !DILexicalBlock(scope: !707, file: !1, line: 261, column: 57)
!707 = distinct !DILexicalBlock(scope: !697, file: !1, line: 261, column: 16)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !184, line: 829, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !184, line: 826, size: 128, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !710, file: !184, line: 827, baseType: !195, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !710, file: !184, line: 828, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !184, line: 824, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !184, line: 820, size: 256, elements: !717)
!717 = !{!718, !731, !732, !733}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !716, file: !184, line: 821, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !184, line: 810, size: 192, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !720, file: !184, line: 811, baseType: !304, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !720, file: !184, line: 812, baseType: !69, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !720, file: !184, line: 813, baseType: !719, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !720, file: !184, line: 817, baseType: !726, offset: 192)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, elements: !23)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !184, line: 814, size: 128, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !727, file: !184, line: 815, baseType: !719, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !727, file: !184, line: 816, baseType: !8, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !716, file: !184, line: 821, baseType: !719, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !716, file: !184, line: 822, baseType: !8, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !716, file: !184, line: 823, baseType: !161, size: 32, offset: 192)
!734 = !DILocalVariable(name: "zsl", scope: !706, file: !1, line: 263, type: !714)
!735 = !DILocalVariable(name: "ln", scope: !706, file: !1, line: 264, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplistNode", file: !184, line: 818, baseType: !720)
!738 = !DILocalVariable(name: "ele", scope: !739, file: !1, line: 272, type: !304)
!739 = distinct !DILexicalBlock(scope: !706, file: !1, line: 271, column: 20)
!740 = !DILocation(line: 225, column: 31, scope: !674)
!741 = !DILocation(line: 225, column: 44, scope: !674)
!742 = !DILocation(line: 225, column: 56, scope: !674)
!743 = !DILocation(line: 225, column: 68, scope: !674)
!744 = !DILocation(line: 225, column: 80, scope: !674)
!745 = !DILocation(line: 225, column: 92, scope: !674)
!746 = !DILocation(line: 225, column: 110, scope: !674)
!747 = !DILocation(line: 228, column: 5, scope: !674)
!748 = !DILocation(line: 228, column: 24, scope: !674)
!749 = !{!750, !147, i64 0}
!750 = !{!"", !147, i64 0, !147, i64 8, !482, i64 16, !482, i64 20}
!751 = !{!750, !147, i64 8}
!752 = !{!750, !482, i64 16}
!753 = !{!750, !482, i64 20}
!754 = !DILocation(line: 229, column: 30, scope: !674)
!755 = !DILocation(line: 229, column: 12, scope: !674)
!756 = !DILocation(line: 232, column: 15, scope: !697)
!757 = !DILocation(line: 232, column: 24, scope: !697)
!758 = !DILocation(line: 232, column: 9, scope: !674)
!759 = !DILocation(line: 233, column: 35, scope: !696)
!760 = !DILocation(line: 233, column: 24, scope: !696)
!761 = !DILocation(line: 234, column: 9, scope: !696)
!762 = !DILocation(line: 235, column: 9, scope: !696)
!763 = !DILocation(line: 235, column: 24, scope: !696)
!764 = !DILocation(line: 236, column: 9, scope: !696)
!765 = !DILocation(line: 236, column: 22, scope: !696)
!766 = !{!482, !482, i64 0}
!767 = !DILocation(line: 237, column: 9, scope: !696)
!768 = !DILocation(line: 237, column: 19, scope: !696)
!769 = !{!770, !770, i64 0}
!770 = !{!"long long", !90, i64 0}
!771 = !DILocation(line: 238, column: 16, scope: !696)
!772 = !DILocation(line: 228, column: 16, scope: !674)
!773 = !DILocation(line: 240, column: 21, scope: !774)
!774 = distinct !DILexicalBlock(scope: !696, file: !1, line: 240, column: 13)
!775 = !DILocation(line: 234, column: 24, scope: !696)
!776 = !DILocation(line: 240, column: 19, scope: !774)
!777 = !DILocation(line: 240, column: 50, scope: !774)
!778 = !DILocation(line: 240, column: 13, scope: !696)
!779 = !DILocation(line: 242, column: 13, scope: !780)
!780 = distinct !DILexicalBlock(scope: !774, file: !1, line: 240, column: 59)
!781 = !DILocation(line: 261, column: 5, scope: !697)
!782 = !DILocation(line: 245, column: 16, scope: !696)
!783 = !DILocation(line: 234, column: 31, scope: !696)
!784 = !DILocation(line: 245, column: 14, scope: !696)
!785 = !DILocation(line: 246, column: 9, scope: !696)
!786 = !DILocation(line: 247, column: 21, scope: !787)
!787 = distinct !DILexicalBlock(scope: !696, file: !1, line: 246, column: 22)
!788 = !DILocation(line: 250, column: 18, scope: !789)
!789 = distinct !DILexicalBlock(scope: !787, file: !1, line: 250, column: 17)
!790 = !DILocation(line: 250, column: 17, scope: !787)
!791 = !DILocation(line: 254, column: 24, scope: !787)
!792 = !DILocation(line: 254, column: 13, scope: !787)
!793 = !DILocation(line: 255, column: 23, scope: !787)
!794 = !DILocation(line: 255, column: 28, scope: !787)
!795 = !DILocation(line: 255, column: 22, scope: !787)
!796 = !DILocation(line: 255, column: 55, scope: !787)
!797 = !DILocation(line: 255, column: 39, scope: !787)
!798 = !DILocation(line: 256, column: 54, scope: !787)
!799 = !DILocation(line: 256, column: 39, scope: !787)
!800 = !DILocation(line: 230, column: 9, scope: !674)
!801 = !DILocation(line: 257, column: 17, scope: !802)
!802 = distinct !DILexicalBlock(scope: !787, file: !1, line: 257, column: 17)
!803 = !DILocation(line: 258, column: 17, scope: !802)
!804 = !DILocation(line: 257, column: 17, scope: !787)
!805 = !DILocation(line: 258, column: 27, scope: !802)
!806 = !DILocation(line: 259, column: 13, scope: !787)
!807 = !DILocation(line: 246, column: 16, scope: !696)
!808 = distinct !{!808, !785, !809}
!809 = !DILocation(line: 260, column: 9, scope: !696)
!810 = !DILocation(line: 247, column: 33, scope: !787)
!811 = !DILocation(line: 261, column: 31, scope: !707)
!812 = !DILocation(line: 261, column: 16, scope: !697)
!813 = !DILocation(line: 262, column: 26, scope: !706)
!814 = !DILocation(line: 262, column: 15, scope: !706)
!815 = !DILocation(line: 263, column: 30, scope: !706)
!816 = !{!817, !89, i64 8}
!817 = !{!"zset", !89, i64 0, !89, i64 8}
!818 = !DILocation(line: 263, column: 20, scope: !706)
!819 = !DILocation(line: 266, column: 19, scope: !820)
!820 = distinct !DILexicalBlock(scope: !706, file: !1, line: 266, column: 13)
!821 = !DILocation(line: 264, column: 24, scope: !706)
!822 = !DILocation(line: 266, column: 49, scope: !820)
!823 = !DILocation(line: 266, column: 13, scope: !706)
!824 = !DILocation(line: 0, scope: !706)
!825 = !DILocation(line: 0, scope: !739)
!826 = !DILocation(line: 272, column: 27, scope: !739)
!827 = !DILocation(line: 272, column: 17, scope: !739)
!828 = !DILocation(line: 274, column: 37, scope: !829)
!829 = distinct !DILexicalBlock(scope: !739, file: !1, line: 274, column: 17)
!830 = !DILocation(line: 274, column: 18, scope: !829)
!831 = !DILocation(line: 274, column: 17, scope: !739)
!832 = !DILocation(line: 275, column: 17, scope: !829)
!833 = !DILocation(line: 277, column: 19, scope: !739)
!834 = !DILocation(line: 278, column: 63, scope: !835)
!835 = distinct !DILexicalBlock(scope: !739, file: !1, line: 278, column: 17)
!836 = !DILocation(line: 278, column: 17, scope: !835)
!837 = !DILocation(line: 279, column: 17, scope: !835)
!838 = !DILocation(line: 278, column: 17, scope: !739)
!839 = !DILocation(line: 279, column: 27, scope: !835)
!840 = !DILocation(line: 280, column: 31, scope: !739)
!841 = !{!842, !89, i64 0}
!842 = !{!"zskiplistLevel", !89, i64 0, !92, i64 8}
!843 = !DILocation(line: 281, column: 9, scope: !706)
!844 = !DILocation(line: 271, column: 9, scope: !706)
!845 = distinct !{!845, !844, !843}
!846 = !DILocation(line: 282, column: 5, scope: !707)
!847 = !DILocation(line: 283, column: 16, scope: !674)
!848 = !DILocation(line: 283, column: 21, scope: !674)
!849 = !DILocation(line: 283, column: 12, scope: !674)
!850 = !DILocation(line: 283, column: 5, scope: !674)
!851 = !DILocation(line: 0, scope: !852)
!852 = distinct !DILexicalBlock(scope: !820, file: !1, line: 266, column: 58)
!853 = !DILocation(line: 284, column: 1, scope: !674)
!854 = distinct !DISubprogram(name: "scoresOfGeoHashBox", scope: !1, file: !1, line: 289, type: !855, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !860)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !167, !857, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashFix52Bits", file: !859, line: 41, baseType: !4)
!859 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.h", directory: "/root/.unikraft/apps/redis/build")
!860 = !{!861, !862, !863}
!861 = !DILocalVariable(name: "hash", arg: 1, scope: !854, file: !1, line: 289, type: !167)
!862 = !DILocalVariable(name: "min", arg: 2, scope: !854, file: !1, line: 289, type: !857)
!863 = !DILocalVariable(name: "max", arg: 3, scope: !854, file: !1, line: 289, type: !857)
!864 = !DILocation(line: 289, column: 37, scope: !854)
!865 = !DILocation(line: 289, column: 61, scope: !854)
!866 = !DILocation(line: 289, column: 84, scope: !854)
!867 = !DILocation(line: 310, column: 12, scope: !854)
!868 = !DILocation(line: 310, column: 10, scope: !854)
!869 = !DILocation(line: 311, column: 14, scope: !854)
!870 = !DILocation(line: 312, column: 12, scope: !854)
!871 = !DILocation(line: 312, column: 10, scope: !854)
!872 = !DILocation(line: 313, column: 1, scope: !854)
!873 = distinct !DISubprogram(name: "membersOfGeoHashBox", scope: !1, file: !1, line: 318, type: !874, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !876)
!874 = !DISubroutineType(types: !875)
!875 = !{!161, !294, !167, !59, !69, !69, !69}
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884}
!877 = !DILocalVariable(name: "zobj", arg: 1, scope: !873, file: !1, line: 318, type: !294)
!878 = !DILocalVariable(name: "hash", arg: 2, scope: !873, file: !1, line: 318, type: !167)
!879 = !DILocalVariable(name: "ga", arg: 3, scope: !873, file: !1, line: 318, type: !59)
!880 = !DILocalVariable(name: "lon", arg: 4, scope: !873, file: !1, line: 318, type: !69)
!881 = !DILocalVariable(name: "lat", arg: 5, scope: !873, file: !1, line: 318, type: !69)
!882 = !DILocalVariable(name: "radius", arg: 6, scope: !873, file: !1, line: 318, type: !69)
!883 = !DILocalVariable(name: "min", scope: !873, file: !1, line: 319, type: !858)
!884 = !DILocalVariable(name: "max", scope: !873, file: !1, line: 319, type: !858)
!885 = !DILocation(line: 318, column: 49, scope: !873)
!886 = !DILocation(line: 318, column: 31, scope: !873)
!887 = !DILocation(line: 318, column: 65, scope: !873)
!888 = !DILocation(line: 318, column: 76, scope: !873)
!889 = !DILocation(line: 318, column: 88, scope: !873)
!890 = !DILocation(line: 318, column: 100, scope: !873)
!891 = !DILocation(line: 289, column: 37, scope: !854, inlinedAt: !892)
!892 = distinct !DILocation(line: 321, column: 5, scope: !873)
!893 = !DILocation(line: 310, column: 12, scope: !854, inlinedAt: !892)
!894 = !DILocation(line: 311, column: 14, scope: !854, inlinedAt: !892)
!895 = !DILocation(line: 312, column: 12, scope: !854, inlinedAt: !892)
!896 = !DILocation(line: 313, column: 1, scope: !854, inlinedAt: !892)
!897 = !DILocation(line: 319, column: 22, scope: !873)
!898 = !DILocation(line: 322, column: 38, scope: !873)
!899 = !DILocation(line: 319, column: 27, scope: !873)
!900 = !DILocation(line: 322, column: 43, scope: !873)
!901 = !DILocation(line: 322, column: 12, scope: !873)
!902 = !DILocation(line: 322, column: 5, scope: !873)
!903 = distinct !DISubprogram(name: "membersOfAllNeighbors", scope: !1, file: !1, line: 326, type: !904, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !934)
!904 = !DISubroutineType(types: !905)
!905 = !{!161, !294, !906, !69, !69, !69, !59}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRadius", file: !859, line: 48, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !859, line: 44, size: 1536, elements: !908)
!908 = !{!909, !910, !922}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !907, file: !859, line: 45, baseType: !167, size: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !907, file: !859, line: 46, baseType: !911, size: 384, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashArea", file: !168, line: 80, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 76, size: 384, elements: !913)
!913 = !{!914, !915, !921}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !912, file: !168, line: 77, baseType: !167, size: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !912, file: !168, line: 78, baseType: !916, size: 128, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRange", file: !168, line: 74, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 71, size: 128, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !917, file: !168, line: 72, baseType: !69, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !917, file: !168, line: 73, baseType: !69, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !912, file: !168, line: 79, baseType: !916, size: 128, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !907, file: !859, line: 47, baseType: !923, size: 1024, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashNeighbors", file: !168, line: 91, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 82, size: 1024, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "north", scope: !924, file: !168, line: 83, baseType: !167, size: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "east", scope: !924, file: !168, line: 84, baseType: !167, size: 128, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "west", scope: !924, file: !168, line: 85, baseType: !167, size: 128, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "south", scope: !924, file: !168, line: 86, baseType: !167, size: 128, offset: 384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "north_east", scope: !924, file: !168, line: 87, baseType: !167, size: 128, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "south_east", scope: !924, file: !168, line: 88, baseType: !167, size: 128, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "north_west", scope: !924, file: !168, line: 89, baseType: !167, size: 128, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "south_west", scope: !924, file: !168, line: 90, baseType: !167, size: 128, offset: 896)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !945, !946, !947, !948, !949, !1168, !1171, !1172, !1173, !1175, !1177, !1179, !1181, !1183, !1185}
!935 = !DILocalVariable(name: "zobj", arg: 1, scope: !903, file: !1, line: 326, type: !294)
!936 = !DILocalVariable(name: "n", arg: 2, scope: !903, file: !1, line: 326, type: !906)
!937 = !DILocalVariable(name: "lon", arg: 3, scope: !903, file: !1, line: 326, type: !69)
!938 = !DILocalVariable(name: "lat", arg: 4, scope: !903, file: !1, line: 326, type: !69)
!939 = !DILocalVariable(name: "radius", arg: 5, scope: !903, file: !1, line: 326, type: !69)
!940 = !DILocalVariable(name: "ga", arg: 6, scope: !903, file: !1, line: 326, type: !59)
!941 = !DILocalVariable(name: "neighbors", scope: !903, file: !1, line: 327, type: !942)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1152, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 9)
!945 = !DILocalVariable(name: "i", scope: !903, file: !1, line: 328, type: !41)
!946 = !DILocalVariable(name: "count", scope: !903, file: !1, line: 328, type: !41)
!947 = !DILocalVariable(name: "last_processed", scope: !903, file: !1, line: 328, type: !41)
!948 = !DILocalVariable(name: "debugmsg", scope: !903, file: !1, line: 329, type: !161)
!949 = !DILocalVariable(name: "fp", scope: !950, file: !1, line: 345, type: !957)
!950 = distinct !DILexicalBlock(scope: !951, file: !1, line: 345, column: 27)
!951 = distinct !DILexicalBlock(scope: !952, file: !1, line: 345, column: 17)
!952 = distinct !DILexicalBlock(scope: !953, file: !1, line: 344, column: 39)
!953 = distinct !DILexicalBlock(scope: !954, file: !1, line: 344, column: 13)
!954 = distinct !DILexicalBlock(scope: !955, file: !1, line: 343, column: 66)
!955 = distinct !DILexicalBlock(scope: !956, file: !1, line: 343, column: 5)
!956 = distinct !DILexicalBlock(scope: !903, file: !1, line: 343, column: 5)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !959, line: 66, baseType: !960)
!959 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !961, line: 287, baseType: !962)
!961 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !961, line: 181, size: 1408, elements: !963)
!963 = !{!964, !965, !966, !967, !969, !970, !975, !976, !977, !1136, !1142, !1147, !1151, !1152, !1153, !1154, !1156, !1158, !1159, !1160, !1161, !1162, !1166, !1167}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !962, file: !961, line: 182, baseType: !698, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !962, file: !961, line: 183, baseType: !161, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !962, file: !961, line: 184, baseType: !161, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !962, file: !961, line: 185, baseType: !968, size: 16, offset: 128)
!968 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !962, file: !961, line: 186, baseType: !968, size: 16, offset: 144)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !962, file: !961, line: 187, baseType: !971, size: 128, offset: 192)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !961, line: 117, size: 128, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !971, file: !961, line: 118, baseType: !698, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !971, file: !961, line: 119, baseType: !161, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !962, file: !961, line: 188, baseType: !161, size: 32, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !962, file: !961, line: 195, baseType: !9, size: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !962, file: !961, line: 197, baseType: !978, size: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !982, !9, !74, !161}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !79, line: 145, baseType: !246)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !961, line: 569, size: 14912, elements: !984)
!984 = !{!985, !986, !988, !989, !990, !991, !995, !996, !999, !1000, !1004, !1018, !1019, !1020, !1022, !1023, !1024, !1100, !1121, !1122, !1127, !1134}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !983, file: !961, line: 571, baseType: !161, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !983, file: !961, line: 576, baseType: !987, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !983, file: !961, line: 576, baseType: !987, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !983, file: !961, line: 576, baseType: !987, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !983, file: !961, line: 578, baseType: !161, size: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !983, file: !961, line: 579, baseType: !992, size: 200, offset: 288)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 200, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 25)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !983, file: !961, line: 582, baseType: !161, size: 32, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !983, file: !961, line: 583, baseType: !997, size: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !961, line: 40, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !983, file: !961, line: 585, baseType: !161, size: 32, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !983, file: !961, line: 587, baseType: !1001, size: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !982}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !983, file: !961, line: 590, baseType: !1005, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !961, line: 47, size: 256, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1006, file: !961, line: 49, baseType: !1005, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !1006, file: !961, line: 50, baseType: !161, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !1006, file: !961, line: 50, baseType: !161, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !1006, file: !961, line: 50, baseType: !161, size: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !1006, file: !961, line: 50, baseType: !161, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !1006, file: !961, line: 51, baseType: !1014, size: 32, offset: 192)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 32, elements: !1016)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !961, line: 25, baseType: !41)
!1016 = !{!1017}
!1017 = !DISubrange(count: 1)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !983, file: !961, line: 591, baseType: !161, size: 32, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !983, file: !961, line: 592, baseType: !1005, size: 64, offset: 896)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !983, file: !961, line: 593, baseType: !1021, size: 64, offset: 960)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !983, file: !961, line: 596, baseType: !161, size: 32, offset: 1024)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !983, file: !961, line: 597, baseType: !74, size: 64, offset: 1088)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !983, file: !961, line: 632, baseType: !1025, size: 2880, offset: 1152)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !961, line: 599, size: 2880, elements: !1026)
!1026 = !{!1027, !1091}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !1025, file: !961, line: 622, baseType: !1028, size: 1728)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1025, file: !961, line: 601, size: 1728, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1036, !1048, !1049, !1050, !1059, !1074, !1075, !1076, !1080, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !1028, file: !961, line: 603, baseType: !41, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1028, file: !961, line: 604, baseType: !74, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !1028, file: !961, line: 605, baseType: !1033, size: 208, offset: 128)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 208, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 26)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !1028, file: !961, line: 606, baseType: !1037, size: 288, offset: 352)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !961, line: 55, size: 288, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1037, file: !961, line: 57, baseType: !161, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1037, file: !961, line: 58, baseType: !161, size: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1037, file: !961, line: 59, baseType: !161, size: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1037, file: !961, line: 60, baseType: !161, size: 32, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1037, file: !961, line: 61, baseType: !161, size: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1037, file: !961, line: 62, baseType: !161, size: 32, offset: 160)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1037, file: !961, line: 63, baseType: !161, size: 32, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1037, file: !961, line: 64, baseType: !161, size: 32, offset: 224)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1037, file: !961, line: 65, baseType: !161, size: 32, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !1028, file: !961, line: 607, baseType: !161, size: 32, offset: 640)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1028, file: !961, line: 608, baseType: !341, size: 64, offset: 704)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !1028, file: !961, line: 609, baseType: !1051, size: 112, offset: 768)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !961, line: 319, size: 112, elements: !1052)
!1052 = !{!1053, !1057, !1058}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1051, file: !961, line: 320, baseType: !1054, size: 48)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 3)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1051, file: !961, line: 321, baseType: !1054, size: 48, offset: 48)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1051, file: !961, line: 322, baseType: !31, size: 16, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1028, file: !961, line: 610, baseType: !1060, size: 64, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !79, line: 171, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 163, size: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1061, file: !79, line: 165, baseType: !161, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1061, file: !79, line: 170, baseType: !1065, size: 32, offset: 32)
!1065 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1061, file: !79, line: 166, size: 32, elements: !1066)
!1066 = !{!1067, !1070}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1065, file: !79, line: 168, baseType: !1068, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1069, line: 124, baseType: !41)
!1069 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1065, file: !79, line: 169, baseType: !1071, size: 32)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 4)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1028, file: !961, line: 611, baseType: !1060, size: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1028, file: !961, line: 612, baseType: !1060, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1028, file: !961, line: 613, baseType: !1077, size: 64, offset: 1088)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 8)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !1028, file: !961, line: 614, baseType: !1081, size: 192, offset: 1152)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 24)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1028, file: !961, line: 615, baseType: !161, size: 32, offset: 1344)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1028, file: !961, line: 616, baseType: !1060, size: 64, offset: 1376)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1028, file: !961, line: 617, baseType: !1060, size: 64, offset: 1440)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1028, file: !961, line: 618, baseType: !1060, size: 64, offset: 1504)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1028, file: !961, line: 619, baseType: !1060, size: 64, offset: 1568)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1028, file: !961, line: 620, baseType: !1060, size: 64, offset: 1632)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !1028, file: !961, line: 621, baseType: !161, size: 32, offset: 1696)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !1025, file: !961, line: 631, baseType: !1092, size: 2880)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1025, file: !961, line: 626, size: 2880, elements: !1093)
!1093 = !{!1094, !1098}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !1092, file: !961, line: 629, baseType: !1095, size: 1920)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 1920, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 30)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !1092, file: !961, line: 630, baseType: !1099, size: 960, offset: 1920)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 960, elements: !1096)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !983, file: !961, line: 636, baseType: !1101, size: 64, offset: 4032)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !961, line: 93, size: 6336, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1113}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1102, file: !961, line: 94, baseType: !1101, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1102, file: !961, line: 95, baseType: !161, size: 32, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1102, file: !961, line: 97, baseType: !1107, size: 2048, offset: 128)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 2048, elements: !1111)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null}
!1111 = !{!1112}
!1112 = !DISubrange(count: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !1102, file: !961, line: 98, baseType: !1114, size: 4160, offset: 2176)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !961, line: 74, size: 4160, elements: !1115)
!1115 = !{!1116, !1118, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1114, file: !961, line: 75, baseType: !1117, size: 2048)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !1111)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1114, file: !961, line: 76, baseType: !1117, size: 2048, offset: 2048)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1114, file: !961, line: 78, baseType: !1015, size: 32, offset: 4096)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1114, file: !961, line: 81, baseType: !1015, size: 32, offset: 4128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !983, file: !961, line: 637, baseType: !1102, size: 6336, offset: 4096)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !983, file: !961, line: 641, baseType: !1123, size: 64, offset: 10432)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{null, !161}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !983, file: !961, line: 646, baseType: !1128, size: 192, offset: 10496)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !961, line: 291, size: 192, elements: !1129)
!1129 = !{!1130, !1132, !1133}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1128, file: !961, line: 293, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !1128, file: !961, line: 294, baseType: !161, size: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !1128, file: !961, line: 295, baseType: !987, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !983, file: !961, line: 648, baseType: !1135, size: 4224, offset: 10688)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 4224, elements: !1055)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !962, file: !961, line: 199, baseType: !1137, size: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!981, !982, !9, !1140, !161}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !962, file: !961, line: 202, baseType: !1143, size: 64, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!1146, !982, !9, !1146, !161}
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !79, line: 114, baseType: !246)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !962, file: !961, line: 203, baseType: !1148, size: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!161, !982, !9}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !962, file: !961, line: 206, baseType: !971, size: 128, offset: 704)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !962, file: !961, line: 207, baseType: !698, size: 64, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !962, file: !961, line: 208, baseType: !161, size: 32, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !962, file: !961, line: 211, baseType: !1155, size: 24, offset: 928)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !1055)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !962, file: !961, line: 212, baseType: !1157, size: 8, offset: 952)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !1016)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !962, file: !961, line: 215, baseType: !971, size: 128, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !962, file: !961, line: 218, baseType: !161, size: 32, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !962, file: !961, line: 219, baseType: !357, size: 64, offset: 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !962, file: !961, line: 222, baseType: !982, size: 64, offset: 1216)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !962, file: !961, line: 226, baseType: !1163, size: 32, offset: 1280)
