; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GeoHashRadius = type { %struct.GeoHashBits, %struct.GeoHashArea, %struct.GeoHashNeighbors }
%struct.GeoHashBits = type { i64, i8 }
%struct.GeoHashArea = type { %struct.GeoHashBits, %struct.GeoHashRange, %struct.GeoHashRange }
%struct.GeoHashRange = type { double, double }
%struct.GeoHashNeighbors = type { %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits }

@DEG_TO_RAD = dso_local local_unnamed_addr constant double 0x3F91DF46A2529D39, align 8, !dbg !0
@EARTH_RADIUS_IN_METERS = dso_local local_unnamed_addr constant double 0x41584F6F63E51090, align 8, !dbg !6
@MERCATOR_MAX = dso_local local_unnamed_addr constant double 0x41731C05E5EB851F, align 8, !dbg !10
@MERCATOR_MIN = dso_local local_unnamed_addr constant double 0xC1731C05E5EB851F, align 8, !dbg !12
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local zeroext i8 @geohashEstimateStepsByRadius(double, double) local_unnamed_addr #0 !dbg !18 {
  %3 = fcmp oeq double %0, 0.000000e+00, !dbg !33
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !35

!70 = distinct !DISubprogram(name: "geohashBoundingBox", scope: !3, file: !3, line: 103, type: !71, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !74)
!71 = !DISubroutineType(types: !72)
!72 = !{!30, !9, !9, !9, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!74 = !{!75, !76, !77, !78}
!75 = !DILocalVariable(name: "longitude", arg: 1, scope: !70, file: !3, line: 103, type: !9)
!76 = !DILocalVariable(name: "latitude", arg: 2, scope: !70, file: !3, line: 103, type: !9)
!77 = !DILocalVariable(name: "radius_meters", arg: 3, scope: !70, file: !3, line: 103, type: !9)
!78 = !DILocalVariable(name: "bounds", arg: 4, scope: !70, file: !3, line: 104, type: !73)
!79 = !DILocation(line: 103, column: 31, scope: !70)
!80 = !DILocation(line: 103, column: 49, scope: !70)
!81 = !DILocation(line: 103, column: 66, scope: !70)
!82 = !DILocation(line: 104, column: 32, scope: !70)
!83 = !DILocation(line: 105, column: 10, scope: !84)
!84 = distinct !DILexicalBlock(scope: !70, file: !3, line: 105, column: 9)
!85 = !DILocation(line: 105, column: 9, scope: !70)
!86 = !DILocation(line: 107, column: 50, scope: !70)
!87 = !DILocalVariable(name: "ang", arg: 1, scope: !88, file: !3, line: 57, type: !9)
!88 = distinct !DISubprogram(name: "deg_rad", scope: !3, file: !3, line: 57, type: !89, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!9, !9}
!91 = !{!87}
!92 = !DILocation(line: 57, column: 37, scope: !88, inlinedAt: !93)
!93 = distinct !DILocation(line: 107, column: 78, scope: !70)
!94 = !DILocation(line: 57, column: 55, scope: !88, inlinedAt: !93)
!95 = !DILocation(line: 57, column: 44, scope: !88, inlinedAt: !93)
!96 = !DILocation(line: 107, column: 74, scope: !70)
!97 = !DILocation(line: 107, column: 73, scope: !70)
!98 = !DILocalVariable(name: "ang", arg: 1, scope: !99, file: !3, line: 58, type: !9)
!99 = distinct !DISubprogram(name: "rad_deg", scope: !3, file: !3, line: 58, type: !89, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !100)
!100 = !{!98}
!101 = !DILocation(line: 58, column: 37, scope: !99, inlinedAt: !102)
!102 = distinct !DILocation(line: 107, column: 29, scope: !70)
!103 = !DILocation(line: 58, column: 55, scope: !99, inlinedAt: !102)
!104 = !DILocation(line: 58, column: 44, scope: !99, inlinedAt: !102)
!105 = !DILocation(line: 107, column: 27, scope: !70)
!106 = !DILocation(line: 107, column: 15, scope: !70)
!107 = !{!108, !108, i64 0}
!108 = !{!"double", !109, i64 0}
!109 = !{!"omnipotent char", !110, i64 0}
!110 = !{!"Simple C/C++ TBAA"}
!111 = !DILocation(line: 57, column: 37, scope: !88, inlinedAt: !112)
!112 = distinct !DILocation(line: 108, column: 78, scope: !70)
!113 = !DILocation(line: 57, column: 44, scope: !88, inlinedAt: !112)
!114 = !DILocation(line: 108, column: 74, scope: !70)
!115 = !DILocation(line: 108, column: 73, scope: !70)
!116 = !DILocation(line: 58, column: 37, scope: !99, inlinedAt: !117)
!117 = distinct !DILocation(line: 108, column: 29, scope: !70)
!118 = !DILocation(line: 58, column: 55, scope: !99, inlinedAt: !117)
!119 = !DILocation(line: 58, column: 44, scope: !99, inlinedAt: !117)
!120 = !DILocation(line: 108, column: 27, scope: !70)
!121 = !DILocation(line: 108, column: 5, scope: !70)
!122 = !DILocation(line: 108, column: 15, scope: !70)
!123 = !DILocation(line: 58, column: 37, scope: !99, inlinedAt: !124)
!124 = distinct !DILocation(line: 109, column: 28, scope: !70)
!125 = !DILocation(line: 58, column: 55, scope: !99, inlinedAt: !124)
!126 = !DILocation(line: 58, column: 44, scope: !99, inlinedAt: !124)
!127 = !DILocation(line: 109, column: 26, scope: !70)
!128 = !DILocation(line: 109, column: 5, scope: !70)
!129 = !DILocation(line: 109, column: 15, scope: !70)
!130 = !DILocation(line: 58, column: 37, scope: !99, inlinedAt: !131)
!131 = distinct !DILocation(line: 110, column: 28, scope: !70)
!132 = !DILocation(line: 58, column: 44, scope: !99, inlinedAt: !131)
!133 = !DILocation(line: 110, column: 26, scope: !70)
!134 = !DILocation(line: 110, column: 5, scope: !70)
!135 = !DILocation(line: 110, column: 15, scope: !70)
!136 = !DILocation(line: 111, column: 5, scope: !70)
!137 = !DILocation(line: 0, scope: !84)
!138 = !DILocation(line: 112, column: 1, scope: !70)
!139 = distinct !DISubprogram(name: "geohashGetAreasByRadius", scope: !3, file: !3, line: 116, type: !140, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !180)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !9, !9, !9}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRadius", file: !143, line: 48, baseType: !144)
!143 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.h", directory: "/root/.unikraft/apps/redis/build")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 44, size: 1536, elements: !145)
!145 = !{!146, !156, !168}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !144, file: !143, line: 45, baseType: !147, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashBits", file: !148, line: 69, baseType: !149)
!148 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash.h", directory: "/root/.unikraft/apps/redis/build")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 66, size: 128, elements: !150)
!150 = !{!151, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !149, file: !148, line: 67, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 60, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 105, baseType: !154)
!154 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !149, file: !148, line: 68, baseType: !21, size: 8, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !144, file: !143, line: 46, baseType: !157, size: 384, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashArea", file: !148, line: 80, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 76, size: 384, elements: !159)
!159 = !{!160, !161, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !158, file: !148, line: 77, baseType: !147, size: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !158, file: !148, line: 78, baseType: !162, size: 128, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRange", file: !148, line: 74, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 71, size: 128, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !163, file: !148, line: 72, baseType: !9, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !163, file: !148, line: 73, baseType: !9, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !158, file: !148, line: 79, baseType: !162, size: 128, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !144, file: !143, line: 47, baseType: !169, size: 1024, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashNeighbors", file: !148, line: 91, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 82, size: 1024, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "north", scope: !170, file: !148, line: 83, baseType: !147, size: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "east", scope: !170, file: !148, line: 84, baseType: !147, size: 128, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "west", scope: !170, file: !148, line: 85, baseType: !147, size: 128, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "south", scope: !170, file: !148, line: 86, baseType: !147, size: 128, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "north_east", scope: !170, file: !148, line: 87, baseType: !147, size: 128, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "south_east", scope: !170, file: !148, line: 88, baseType: !147, size: 128, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "north_west", scope: !170, file: !148, line: 89, baseType: !147, size: 128, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "south_west", scope: !170, file: !148, line: 90, baseType: !147, size: 128, offset: 896)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !198, !199, !200, !202, !203, !204}
!181 = !DILocalVariable(name: "longitude", arg: 1, scope: !139, file: !3, line: 116, type: !9)
!182 = !DILocalVariable(name: "latitude", arg: 2, scope: !139, file: !3, line: 116, type: !9)
!183 = !DILocalVariable(name: "radius_meters", arg: 3, scope: !139, file: !3, line: 116, type: !9)
!184 = !DILocalVariable(name: "long_range", scope: !139, file: !3, line: 117, type: !162)
!185 = !DILocalVariable(name: "lat_range", scope: !139, file: !3, line: 117, type: !162)
!186 = !DILocalVariable(name: "radius", scope: !139, file: !3, line: 118, type: !142)
!187 = !DILocalVariable(name: "hash", scope: !139, file: !3, line: 119, type: !147)
!188 = !DILocalVariable(name: "neighbors", scope: !139, file: !3, line: 120, type: !169)
!189 = !DILocalVariable(name: "area", scope: !139, file: !3, line: 121, type: !157)
!190 = !DILocalVariable(name: "min_lon", scope: !139, file: !3, line: 122, type: !9)
!191 = !DILocalVariable(name: "max_lon", scope: !139, file: !3, line: 122, type: !9)
!192 = !DILocalVariable(name: "min_lat", scope: !139, file: !3, line: 122, type: !9)
!193 = !DILocalVariable(name: "max_lat", scope: !139, file: !3, line: 122, type: !9)
!194 = !DILocalVariable(name: "bounds", scope: !139, file: !3, line: 123, type: !195)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 4)
!198 = !DILocalVariable(name: "steps", scope: !139, file: !3, line: 124, type: !30)
!199 = !DILocalVariable(name: "decrease_step", scope: !139, file: !3, line: 144, type: !30)
!200 = !DILocalVariable(name: "north", scope: !201, file: !3, line: 146, type: !157)
!201 = distinct !DILexicalBlock(scope: !139, file: !3, line: 145, column: 5)
!202 = !DILocalVariable(name: "south", scope: !201, file: !3, line: 146, type: !157)
!203 = !DILocalVariable(name: "east", scope: !201, file: !3, line: 146, type: !157)
!204 = !DILocalVariable(name: "west", scope: !201, file: !3, line: 146, type: !157)
!205 = !DILocation(line: 116, column: 46, scope: !139)
!206 = !DILocation(line: 116, column: 64, scope: !139)
!207 = !DILocation(line: 116, column: 81, scope: !139)
!208 = !DILocation(line: 117, column: 5, scope: !139)
!209 = !DILocation(line: 118, column: 19, scope: !139)
!210 = !DILocation(line: 119, column: 5, scope: !139)
!211 = !DILocation(line: 120, column: 5, scope: !139)
!212 = !DILocation(line: 121, column: 5, scope: !139)
!213 = !DILocation(line: 103, column: 31, scope: !70, inlinedAt: !214)
!214 = distinct !DILocation(line: 126, column: 5, scope: !139)
!215 = !DILocation(line: 103, column: 49, scope: !70, inlinedAt: !214)
!216 = !DILocation(line: 103, column: 66, scope: !70, inlinedAt: !214)
!217 = !DILocation(line: 104, column: 32, scope: !70, inlinedAt: !214)
!218 = !DILocation(line: 105, column: 9, scope: !70, inlinedAt: !214)
!219 = !DILocation(line: 107, column: 50, scope: !70, inlinedAt: !214)
!220 = !DILocation(line: 57, column: 37, scope: !88, inlinedAt: !221)
!221 = distinct !DILocation(line: 107, column: 78, scope: !70, inlinedAt: !214)
!222 = !DILocation(line: 57, column: 55, scope: !88, inlinedAt: !221)
!223 = !DILocation(line: 57, column: 44, scope: !88, inlinedAt: !221)
!224 = !DILocation(line: 107, column: 74, scope: !70, inlinedAt: !214)
!225 = !DILocation(line: 107, column: 73, scope: !70, inlinedAt: !214)
!226 = !DILocation(line: 58, column: 37, scope: !99, inlinedAt: !227)
!227 = distinct !DILocation(line: 107, column: 29, scope: !70, inlinedAt: !214)
!228 = !DILocation(line: 58, column: 55, scope: !99, inlinedAt: !227)
!229 = !DILocation(line: 58, column: 44, scope: !99, inlinedAt: !227)
!230 = !DILocation(line: 107, column: 27, scope: !70, inlinedAt: !214)
!231 = !DILocation(line: 123, column: 12, scope: !139)
