; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/glob.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/glob.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.glob_t = type { i32, i32, i32, i32, i8**, i32 (i8*, i32)*, void (i8*)*, %struct.dirent* (i8*)*, i8* (i8*)*, i32 (i8*, %struct.stat*)*, i32 (i8*, %struct.stat*)* }
%struct.dirent = type { i16, i64, i16, i8, [256 x i8] }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.passwd = type { i8*, i8*, i16, i16, i8*, i8*, i8*, i8* }
%struct.__dirstream = type opaque

@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c".\00", align 1
@__collate_load_error = external dso_local local_unnamed_addr global i32, align 4
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @glob(i8* noalias nocapture readonly, i32, i32 (i8*, i32)*, %struct.glob_t* noalias nocapture) local_unnamed_addr #0 !dbg !27 {
  %5 = alloca i32, align 4
  %6 = alloca [1024 x i16], align 16
  %7 = bitcast i32* %5 to i8*, !dbg !145
  call void @llvm.lifetime.start.p0i8(i64 4, i8* nonnull %7) #4, !dbg !145
  %8 = bitcast [1024 x i16]* %6 to i8*, !dbg !146

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/glob.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !8, !9, !14, !11, !15, !17, !22}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !6, line: 87, baseType: !7)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !1, line: 111, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !6, line: 91, baseType: !13)
!13 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 40, baseType: !19)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !20, line: 129, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!27 = distinct !DISubprogram(name: "glob", scope: !1, file: !1, line: 160, type: !28, isLocal: false, isDefinition: true, scopeLine: 164, isOptimized: true, unit: !0, retainedNodes: !125)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !31, !30, !34, !37}
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!30, !32, !30}
!37 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "glob_t", file: !40, line: 61, baseType: !41)
!40 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/glob.h", directory: "/root/.unikraft/apps/redis/build")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 42, size: 576, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !53, !75, !79, !124}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathc", scope: !41, file: !40, line: 43, baseType: !30, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "gl_matchc", scope: !41, file: !40, line: 44, baseType: !30, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "gl_offs", scope: !41, file: !40, line: 45, baseType: !30, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "gl_flags", scope: !41, file: !40, line: 46, baseType: !30, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathv", scope: !41, file: !40, line: 47, baseType: !22, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gl_errfunc", scope: !41, file: !40, line: 49, baseType: !34, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "gl_closedir", scope: !41, file: !40, line: 56, baseType: !50, size: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !8}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "gl_readdir", scope: !41, file: !40, line: 57, baseType: !54, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !8}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !59, line: 55, size: 2240, elements: !60)
!59 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/dirent.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !{!61, !64, !69, !70, !71}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !58, file: !59, line: 56, baseType: !62, size: 16)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 155, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !20, line: 73, baseType: !13)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !58, file: !59, line: 57, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 173, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 100, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !20, line: 44, baseType: !68)
!68 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !58, file: !59, line: 58, baseType: !13, size: 16, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !58, file: !59, line: 59, baseType: !7, size: 8, offset: 144)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !58, file: !59, line: 60, baseType: !72, size: 2048, offset: 152)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gl_opendir", scope: !41, file: !40, line: 58, baseType: !76, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!8, !32}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gl_lstat", scope: !41, file: !40, line: 59, baseType: !80, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!30, !32, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !85, line: 27, size: 704, elements: !86)
!85 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/stat.h", directory: "/root/.unikraft/apps/redis/build")
!86 = !{!87, !91, !92, !98, !101, !104, !107, !108, !109, !116, !117, !118, !121}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !84, file: !85, line: 29, baseType: !88, size: 16)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 177, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !20, line: 54, baseType: !90)
!90 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !84, file: !85, line: 30, baseType: !62, size: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !84, file: !85, line: 31, baseType: !93, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 205, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !20, line: 88, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !96, line: 79, baseType: !97)
!96 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !84, file: !85, line: 32, baseType: !99, size: 16, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 210, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !20, line: 210, baseType: !13)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !84, file: !85, line: 33, baseType: !102, size: 16, offset: 80)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 181, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !20, line: 58, baseType: !13)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !84, file: !85, line: 34, baseType: !105, size: 16, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 185, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !20, line: 61, baseType: !13)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !84, file: !85, line: 35, baseType: !88, size: 16, offset: 112)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !84, file: !85, line: 36, baseType: !65, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !84, file: !85, line: 37, baseType: !110, size: 128, offset: 192)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !111, line: 52, size: 128, elements: !112)
!111 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !110, file: !111, line: 53, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !111, line: 34, baseType: !68)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !110, file: !111, line: 54, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !84, file: !85, line: 38, baseType: !110, size: 128, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !84, file: !85, line: 39, baseType: !110, size: 128, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !84, file: !85, line: 40, baseType: !119, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 118, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !20, line: 32, baseType: !68)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !84, file: !85, line: 41, baseType: !122, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 113, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !20, line: 28, baseType: !68)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gl_stat", scope: !41, file: !40, line: 60, baseType: !80, size: 64, offset: 512)
!125 = !{!126, !127, !128, !129, !130, !133, !134, !135, !136, !137}
!126 = !DILocalVariable(name: "pattern", arg: 1, scope: !27, file: !1, line: 161, type: !31)
!127 = !DILocalVariable(name: "flags", arg: 2, scope: !27, file: !1, line: 162, type: !30)
!128 = !DILocalVariable(name: "errfunc", arg: 3, scope: !27, file: !1, line: 162, type: !34)
!129 = !DILocalVariable(name: "pglob", arg: 4, scope: !27, file: !1, line: 163, type: !37)
!130 = !DILocalVariable(name: "patnext", scope: !27, file: !1, line: 165, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!133 = !DILocalVariable(name: "c", scope: !27, file: !1, line: 166, type: !30)
!134 = !DILocalVariable(name: "limit", scope: !27, file: !1, line: 166, type: !30)
!135 = !DILocalVariable(name: "bufnext", scope: !27, file: !1, line: 167, type: !14)
!136 = !DILocalVariable(name: "bufend", scope: !27, file: !1, line: 167, type: !14)
!137 = !DILocalVariable(name: "patbuf", scope: !27, file: !1, line: 167, type: !138)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 16384, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 1024)
!141 = !DILocation(line: 161, column: 25, scope: !27)
!142 = !DILocation(line: 162, column: 6, scope: !27)
!143 = !DILocation(line: 162, column: 15, scope: !27)
!144 = !DILocation(line: 163, column: 21, scope: !27)
!145 = !DILocation(line: 166, column: 2, scope: !27)
!146 = !DILocation(line: 167, column: 2, scope: !27)
!147 = !DILocation(line: 167, column: 26, scope: !27)
!148 = !DILocation(line: 165, column: 16, scope: !27)
!149 = !DILocation(line: 170, column: 14, scope: !150)
!150 = distinct !DILexicalBlock(scope: !27, file: !1, line: 170, column: 6)
!151 = !DILocation(line: 170, column: 6, scope: !27)
!152 = !DILocation(line: 171, column: 10, scope: !153)
!153 = distinct !DILexicalBlock(scope: !150, file: !1, line: 170, column: 30)
!154 = !DILocation(line: 171, column: 19, scope: !153)
!155 = !{!156, !157, i64 0}
!156 = !{!"", !157, i64 0, !157, i64 4, !157, i64 8, !157, i64 12, !160, i64 16, !160, i64 24, !160, i64 32, !160, i64 40, !160, i64 48, !160, i64 56, !160, i64 64}
!157 = !{!"int", !158, i64 0}
!158 = !{!"omnipotent char", !159, i64 0}
!159 = !{!"Simple C/C++ TBAA"}
!160 = !{!"any pointer", !158, i64 0}
!161 = !DILocation(line: 172, column: 10, scope: !153)
!162 = !DILocation(line: 172, column: 19, scope: !153)
!163 = !{!156, !160, i64 16}
!164 = !DILocation(line: 173, column: 15, scope: !165)
!165 = distinct !DILexicalBlock(scope: !153, file: !1, line: 173, column: 7)
!166 = !DILocation(line: 173, column: 7, scope: !153)
!167 = !DILocation(line: 174, column: 11, scope: !165)
!168 = !DILocation(line: 174, column: 19, scope: !165)
!169 = !{!156, !157, i64 8}
!170 = !DILocation(line: 174, column: 4, scope: !165)
!171 = !DILocation(line: 176, column: 12, scope: !172)
!172 = distinct !DILexicalBlock(scope: !27, file: !1, line: 176, column: 6)
!173 = !DILocation(line: 176, column: 6, scope: !27)
!174 = !DILocation(line: 177, column: 18, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !1, line: 176, column: 26)
!176 = !{!156, !157, i64 4}
!177 = !DILocation(line: 178, column: 13, scope: !178)
!178 = distinct !DILexicalBlock(scope: !175, file: !1, line: 178, column: 7)
!179 = !DILocation(line: 178, column: 7, scope: !175)
!180 = !DILocation(line: 166, column: 9, scope: !27)
!181 = !DILocation(line: 0, scope: !178)
!182 = !DILocation(line: 180, column: 2, scope: !175)
!183 = !DILocation(line: 181, column: 9, scope: !172)
!184 = !{!157, !157, i64 0}
!185 = !DILocation(line: 184, column: 9, scope: !27)
!186 = !DILocation(line: 182, column: 26, scope: !27)
!187 = !DILocation(line: 182, column: 9, scope: !27)
!188 = !DILocation(line: 182, column: 18, scope: !27)
!189 = !{!156, !157, i64 12}
!190 = !DILocation(line: 183, column: 9, scope: !27)
!191 = !DILocation(line: 183, column: 20, scope: !27)
!192 = !{!156, !160, i64 24}
!193 = !DILocation(line: 184, column: 19, scope: !27)
!194 = !DILocation(line: 186, column: 12, scope: !27)
!195 = !DILocation(line: 167, column: 8, scope: !27)
!196 = !DILocation(line: 187, column: 32, scope: !27)
!197 = !DILocation(line: 167, column: 18, scope: !27)
!198 = !DILocation(line: 188, column: 12, scope: !199)
!199 = distinct !DILexicalBlock(scope: !27, file: !1, line: 188, column: 6)
!200 = !DILocation(line: 188, column: 6, scope: !27)
!201 = !DILocation(line: 0, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !1, line: 188, column: 26)
!203 = !DILocation(line: 190, column: 43, scope: !202)
!204 = !DILocation(line: 190, column: 35, scope: !202)
!205 = !{!158, !158, i64 0}
!206 = !DILocation(line: 190, column: 47, scope: !202)
!207 = !DILocation(line: 190, column: 3, scope: !202)
!208 = !DILocation(line: 191, column: 10, scope: !209)
!209 = distinct !DILexicalBlock(scope: !202, file: !1, line: 191, column: 8)
!210 = !DILocation(line: 191, column: 8, scope: !202)
!211 = !DILocation(line: 192, column: 22, scope: !212)
!212 = distinct !DILexicalBlock(scope: !213, file: !1, line: 192, column: 9)
!213 = distinct !DILexicalBlock(scope: !209, file: !1, line: 191, column: 20)
!214 = !DILocation(line: 192, column: 14, scope: !212)
!215 = !DILocation(line: 192, column: 26, scope: !212)
!216 = !DILocation(line: 192, column: 9, scope: !213)
!217 = !DILocation(line: 166, column: 6, scope: !27)
!218 = !DILocation(line: 195, column: 5, scope: !219)
!219 = distinct !DILexicalBlock(scope: !212, file: !1, line: 192, column: 34)
!220 = !DILocation(line: 0, scope: !212)
!221 = !DILocation(line: 196, column: 20, scope: !213)
!222 = !DILocation(line: 197, column: 4, scope: !213)
!223 = !DILocation(line: 199, column: 18, scope: !209)
!224 = !DILocation(line: 0, scope: !213)
!225 = !{!226, !226, i64 0}
!226 = !{!"short", !158, i64 0}
!227 = !DILocation(line: 0, scope: !209)
!228 = !DILocation(line: 190, column: 18, scope: !202)
!229 = !DILocation(line: 190, column: 27, scope: !202)
!230 = distinct !{!230, !207, !231}
!231 = !DILocation(line: 199, column: 18, scope: !202)
!232 = !DILocation(line: 202, column: 38, scope: !199)
!233 = !DILocation(line: 202, column: 50, scope: !199)
!234 = !DILocation(line: 202, column: 6, scope: !199)
!235 = !DILocation(line: 202, column: 46, scope: !199)
!236 = !DILocation(line: 203, column: 20, scope: !199)
!237 = !DILocation(line: 203, column: 15, scope: !199)
!238 = !DILocation(line: 203, column: 18, scope: !199)
!239 = !DILocation(line: 202, column: 21, scope: !199)
!240 = !DILocation(line: 202, column: 30, scope: !199)
!241 = distinct !{!241, !234, !236}
!242 = !DILocation(line: 186, column: 10, scope: !27)
!243 = !DILocation(line: 204, column: 11, scope: !27)
!244 = !DILocation(line: 206, column: 12, scope: !245)
!245 = distinct !DILexicalBlock(scope: !27, file: !1, line: 206, column: 6)
!246 = !DILocation(line: 206, column: 6, scope: !27)
!247 = !DILocation(line: 207, column: 13, scope: !245)
!248 = !DILocation(line: 207, column: 6, scope: !245)
!249 = !DILocation(line: 209, column: 13, scope: !245)
!250 = !DILocation(line: 209, column: 6, scope: !245)
!251 = !DILocation(line: 0, scope: !245)
!252 = !DILocation(line: 210, column: 1, scope: !27)
!253 = distinct !DISubprogram(name: "globexp1", scope: !1, file: !1, line: 218, type: !254, isLocal: true, isDefinition: true, scopeLine: 222, isOptimized: true, unit: !0, retainedNodes: !257)
!254 = !DISubroutineType(types: !255)
!255 = !{!30, !9, !38, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DILocalVariable(name: "pattern", arg: 1, scope: !253, file: !1, line: 219, type: !9)
!259 = !DILocalVariable(name: "pglob", arg: 2, scope: !253, file: !1, line: 220, type: !38)
!260 = !DILocalVariable(name: "limit", arg: 3, scope: !253, file: !1, line: 221, type: !256)
!261 = !DILocalVariable(name: "ptr", scope: !253, file: !1, line: 223, type: !9)
!262 = !DILocalVariable(name: "rv", scope: !253, file: !1, line: 224, type: !30)
!263 = !DILocalVariable(name: "patbuf", scope: !264, file: !1, line: 252, type: !138)
!264 = distinct !DISubprogram(name: "globexp2", scope: !1, file: !1, line: 244, type: !265, isLocal: true, isDefinition: true, scopeLine: 248, isOptimized: true, unit: !0, retainedNodes: !267)
!265 = !DISubroutineType(types: !266)
!266 = !{!30, !9, !9, !38, !256, !256}
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !263}
!268 = !DILocalVariable(name: "ptr", arg: 1, scope: !264, file: !1, line: 245, type: !9)
!269 = !DILocalVariable(name: "pattern", arg: 2, scope: !264, file: !1, line: 245, type: !9)
!270 = !DILocalVariable(name: "pglob", arg: 3, scope: !264, file: !1, line: 246, type: !38)
!271 = !DILocalVariable(name: "rv", arg: 4, scope: !264, file: !1, line: 247, type: !256)
!272 = !DILocalVariable(name: "limit", arg: 5, scope: !264, file: !1, line: 247, type: !256)
!273 = !DILocalVariable(name: "i", scope: !264, file: !1, line: 249, type: !30)
!274 = !DILocalVariable(name: "lm", scope: !264, file: !1, line: 250, type: !14)
!275 = !DILocalVariable(name: "ls", scope: !264, file: !1, line: 250, type: !14)
!276 = !DILocalVariable(name: "pe", scope: !264, file: !1, line: 251, type: !9)
!277 = !DILocalVariable(name: "pm", scope: !264, file: !1, line: 251, type: !9)
!278 = !DILocalVariable(name: "pl", scope: !264, file: !1, line: 251, type: !9)
!279 = !DILocation(line: 252, column: 10, scope: !264, inlinedAt: !280)
!280 = distinct !DILocation(line: 231, column: 8, scope: !281)
!281 = distinct !DILexicalBlock(scope: !253, file: !1, line: 231, column: 7)
!282 = !DILocation(line: 219, column: 14, scope: !253)
!283 = !DILocation(line: 220, column: 10, scope: !253)
!284 = !DILocation(line: 221, column: 7, scope: !253)
!285 = !DILocation(line: 223, column: 14, scope: !253)
!286 = !DILocation(line: 227, column: 6, scope: !287)
!287 = distinct !DILexicalBlock(scope: !253, file: !1, line: 227, column: 6)
!288 = !DILocation(line: 227, column: 17, scope: !287)
!289 = !DILocation(line: 227, column: 27, scope: !287)
!290 = !DILocation(line: 227, column: 30, scope: !287)
!291 = !DILocation(line: 227, column: 41, scope: !287)
!292 = !DILocation(line: 227, column: 51, scope: !287)
!293 = !DILocation(line: 227, column: 54, scope: !287)
!294 = !DILocation(line: 227, column: 65, scope: !287)
!295 = !DILocation(line: 227, column: 6, scope: !253)
!296 = !DILocation(line: 228, column: 10, scope: !287)
!297 = !DILocation(line: 228, column: 3, scope: !287)
!298 = !DILocation(line: 230, column: 2, scope: !253)
!299 = !DILocalVariable(name: "str", arg: 1, scope: !300, file: !1, line: 869, type: !14)
!300 = distinct !DISubprogram(name: "g_strchr", scope: !1, file: !1, line: 868, type: !301, isLocal: true, isDefinition: true, scopeLine: 871, isOptimized: true, unit: !0, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{!14, !14, !30}
!303 = !{!299, !304}
!304 = !DILocalVariable(name: "ch", arg: 2, scope: !300, file: !1, line: 870, type: !30)
!305 = !DILocation(line: 869, column: 8, scope: !300, inlinedAt: !306)
!306 = distinct !DILocation(line: 230, column: 31, scope: !253)
!307 = !DILocation(line: 870, column: 6, scope: !300, inlinedAt: !306)
!308 = !DILocation(line: 872, column: 2, scope: !300, inlinedAt: !306)
!309 = !DILocation(line: 873, column: 12, scope: !310, inlinedAt: !306)
!310 = distinct !DILexicalBlock(scope: !311, file: !1, line: 873, column: 7)
!311 = distinct !DILexicalBlock(scope: !300, file: !1, line: 872, column: 5)
!312 = !DILocation(line: 873, column: 7, scope: !311, inlinedAt: !306)
!313 = !DILocation(line: 875, column: 15, scope: !300, inlinedAt: !306)
!314 = !DILocation(line: 875, column: 2, scope: !311, inlinedAt: !306)
!315 = distinct !{!315, !316, !317}
!316 = !DILocation(line: 872, column: 2, scope: !300)
!317 = !DILocation(line: 875, column: 17, scope: !300)
!318 = !DILocation(line: 873, column: 7, scope: !310, inlinedAt: !306)
!319 = !DILocation(line: 874, column: 4, scope: !310, inlinedAt: !306)
!320 = !DILocation(line: 877, column: 1, scope: !300, inlinedAt: !306)
!321 = !DILocation(line: 245, column: 14, scope: !264, inlinedAt: !280)
!322 = !DILocation(line: 245, column: 20, scope: !264, inlinedAt: !280)
!323 = !DILocation(line: 246, column: 10, scope: !264, inlinedAt: !280)
!324 = !DILocation(line: 247, column: 12, scope: !264, inlinedAt: !280)
!325 = !DILocation(line: 252, column: 2, scope: !264, inlinedAt: !280)
!326 = !DILocation(line: 255, column: 12, scope: !327, inlinedAt: !280)
!327 = distinct !DILexicalBlock(scope: !264, file: !1, line: 255, column: 2)
!328 = !DILocation(line: 250, column: 10, scope: !264, inlinedAt: !280)
!329 = !DILocation(line: 251, column: 19, scope: !264, inlinedAt: !280)
!330 = !DILocation(line: 255, column: 7, scope: !327, inlinedAt: !280)
!331 = !DILocation(line: 255, column: 37, scope: !332, inlinedAt: !280)
!332 = distinct !DILexicalBlock(scope: !327, file: !1, line: 255, column: 2)
!333 = !DILocation(line: 255, column: 2, scope: !327, inlinedAt: !280)
!334 = !DILocation(line: 255, column: 48, scope: !332, inlinedAt: !280)
!335 = !DILocation(line: 255, column: 51, scope: !332, inlinedAt: !280)
!336 = !DILocation(line: 255, column: 2, scope: !332, inlinedAt: !280)
!337 = distinct !{!337, !338, !339}
!338 = !DILocation(line: 255, column: 2, scope: !327)
!339 = !DILocation(line: 256, column: 3, scope: !327)
!340 = !DILocation(line: 255, column: 56, scope: !332, inlinedAt: !280)
!341 = !DILocation(line: 255, column: 53, scope: !332, inlinedAt: !280)
!342 = distinct !{!342, !343}
!343 = !{!"llvm.loop.unroll.disable"}
!344 = !DILocation(line: 0, scope: !332, inlinedAt: !280)
!345 = !DILocation(line: 257, column: 6, scope: !264, inlinedAt: !280)
!346 = !DILocation(line: 250, column: 15, scope: !264, inlinedAt: !280)
!347 = !DILocation(line: 249, column: 10, scope: !264, inlinedAt: !280)
!348 = !DILocation(line: 251, column: 14, scope: !264, inlinedAt: !280)
!349 = !DILocation(line: 261, column: 7, scope: !350, inlinedAt: !280)
!350 = distinct !DILexicalBlock(scope: !264, file: !1, line: 261, column: 2)
!351 = !DILocation(line: 261, column: 26, scope: !352, inlinedAt: !280)
!352 = distinct !DILexicalBlock(scope: !350, file: !1, line: 261, column: 2)
!353 = !DILocation(line: 261, column: 2, scope: !350, inlinedAt: !280)
!354 = !DILocation(line: 262, column: 11, scope: !355, inlinedAt: !280)
!355 = distinct !DILexicalBlock(scope: !352, file: !1, line: 262, column: 7)
!356 = !DILocation(line: 262, column: 7, scope: !352, inlinedAt: !280)
!357 = !DILocation(line: 264, column: 9, scope: !358, inlinedAt: !280)
!358 = distinct !DILexicalBlock(scope: !359, file: !1, line: 264, column: 4)
!359 = distinct !DILexicalBlock(scope: !355, file: !1, line: 262, column: 24)
!360 = !DILocation(line: 0, scope: !361, inlinedAt: !280)
!361 = distinct !DILexicalBlock(scope: !358, file: !1, line: 264, column: 4)
!362 = !DILocation(line: 264, column: 20, scope: !361, inlinedAt: !280)
!363 = !DILocation(line: 264, column: 24, scope: !361, inlinedAt: !280)
!364 = !DILocation(line: 264, column: 36, scope: !361, inlinedAt: !280)
!365 = !DILocation(line: 264, column: 43, scope: !361, inlinedAt: !280)
!366 = !DILocation(line: 264, column: 4, scope: !358, inlinedAt: !280)
!367 = !DILocation(line: 0, scope: !281)
!368 = distinct !{!368, !369, !370}
!369 = !DILocation(line: 264, column: 4, scope: !358)
!370 = !DILocation(line: 265, column: 5, scope: !358)
!371 = !DILocation(line: 274, column: 16, scope: !372, inlinedAt: !280)
!372 = distinct !DILexicalBlock(scope: !355, file: !1, line: 274, column: 12)
!373 = !DILocation(line: 274, column: 12, scope: !355, inlinedAt: !280)
!374 = !DILocation(line: 275, column: 5, scope: !372, inlinedAt: !280)
!375 = !DILocation(line: 275, column: 4, scope: !372, inlinedAt: !280)
!376 = !DILocation(line: 276, column: 16, scope: !377, inlinedAt: !280)
!377 = distinct !DILexicalBlock(scope: !372, file: !1, line: 276, column: 12)
!378 = !DILocation(line: 276, column: 12, scope: !372, inlinedAt: !280)
!379 = !DILocation(line: 277, column: 10, scope: !380, inlinedAt: !280)
!380 = distinct !DILexicalBlock(scope: !381, file: !1, line: 277, column: 8)
!381 = distinct !DILexicalBlock(scope: !377, file: !1, line: 276, column: 27)
!382 = !DILocation(line: 277, column: 8, scope: !381, inlinedAt: !280)
!383 = !DILocation(line: 279, column: 5, scope: !381, inlinedAt: !280)
!384 = !DILocation(line: 280, column: 3, scope: !381, inlinedAt: !280)
!385 = !DILocation(line: 261, column: 33, scope: !352, inlinedAt: !280)
!386 = !DILocation(line: 0, scope: !350, inlinedAt: !280)
!387 = !DILocation(line: 261, column: 2, scope: !352, inlinedAt: !280)
!388 = distinct !{!388, !389, !390}
!389 = !DILocation(line: 261, column: 2, scope: !350)
!390 = !DILocation(line: 280, column: 3, scope: !350)
!391 = !DILocation(line: 283, column: 8, scope: !392, inlinedAt: !280)
!392 = distinct !DILexicalBlock(scope: !264, file: !1, line: 283, column: 6)
!393 = !DILocation(line: 283, column: 13, scope: !392, inlinedAt: !280)
!394 = !DILocation(line: 283, column: 16, scope: !392, inlinedAt: !280)
!395 = !DILocation(line: 283, column: 20, scope: !392, inlinedAt: !280)
!396 = !DILocation(line: 283, column: 6, scope: !264, inlinedAt: !280)
!397 = !DILocation(line: 284, column: 9, scope: !398, inlinedAt: !280)
!398 = distinct !DILexicalBlock(scope: !392, file: !1, line: 283, column: 28)
!399 = !DILocation(line: 285, column: 3, scope: !398, inlinedAt: !280)
!400 = !DILocation(line: 251, column: 24, scope: !264, inlinedAt: !280)
!401 = !DILocation(line: 288, column: 7, scope: !402, inlinedAt: !280)
!402 = distinct !DILexicalBlock(scope: !264, file: !1, line: 288, column: 2)
!403 = !DILocation(line: 288, column: 32, scope: !404, inlinedAt: !280)
!404 = distinct !DILexicalBlock(scope: !402, file: !1, line: 288, column: 2)
!405 = !DILocation(line: 288, column: 2, scope: !402, inlinedAt: !280)
!406 = !DILocation(line: 289, column: 11, scope: !404, inlinedAt: !280)
!407 = !DILocation(line: 289, column: 3, scope: !404, inlinedAt: !280)
!408 = !DILocation(line: 292, column: 9, scope: !409, inlinedAt: !280)
!409 = distinct !DILexicalBlock(scope: !410, file: !1, line: 292, column: 4)
!410 = distinct !DILexicalBlock(scope: !404, file: !1, line: 289, column: 16)
!411 = !DILocation(line: 0, scope: !412, inlinedAt: !280)
!412 = distinct !DILexicalBlock(scope: !409, file: !1, line: 292, column: 4)
!413 = !DILocation(line: 292, column: 20, scope: !412, inlinedAt: !280)
!414 = !DILocation(line: 292, column: 24, scope: !412, inlinedAt: !280)
!415 = !DILocation(line: 292, column: 36, scope: !412, inlinedAt: !280)
!416 = !DILocation(line: 294, column: 8, scope: !410, inlinedAt: !280)
!417 = !DILocation(line: 292, column: 43, scope: !412, inlinedAt: !280)
!418 = !DILocation(line: 292, column: 4, scope: !409, inlinedAt: !280)
!419 = !DILocation(line: 292, column: 4, scope: !412, inlinedAt: !280)
!420 = distinct !{!420, !421, !422}
!421 = !DILocation(line: 292, column: 4, scope: !409)
!422 = !DILocation(line: 293, column: 5, scope: !409)
!423 = !DILocation(line: 294, column: 8, scope: !424, inlinedAt: !280)
!424 = distinct !DILexicalBlock(scope: !410, file: !1, line: 294, column: 8)
!425 = !DILocation(line: 294, column: 12, scope: !424, inlinedAt: !280)
!426 = !DILocation(line: 300, column: 4, scope: !427, inlinedAt: !280)
!427 = distinct !DILexicalBlock(scope: !424, file: !1, line: 294, column: 20)
!428 = !DILocation(line: 304, column: 5, scope: !410, inlinedAt: !280)
!429 = !DILocation(line: 305, column: 4, scope: !410, inlinedAt: !280)
!430 = !DILocation(line: 308, column: 8, scope: !431, inlinedAt: !280)
!431 = distinct !DILexicalBlock(scope: !410, file: !1, line: 308, column: 8)
!432 = !DILocation(line: 308, column: 8, scope: !410, inlinedAt: !280)
!433 = !DILocation(line: 314, column: 10, scope: !434, inlinedAt: !280)
!434 = distinct !DILexicalBlock(scope: !410, file: !1, line: 314, column: 8)
!435 = !DILocation(line: 309, column: 9, scope: !436, inlinedAt: !280)
!436 = distinct !DILexicalBlock(scope: !431, file: !1, line: 308, column: 11)
!437 = !DILocation(line: 310, column: 8, scope: !436, inlinedAt: !280)
!438 = !DILocation(line: 314, column: 8, scope: !434, inlinedAt: !280)
!439 = !DILocation(line: 314, column: 13, scope: !434, inlinedAt: !280)
!440 = !DILocation(line: 314, column: 17, scope: !434, inlinedAt: !280)
!441 = !DILocation(line: 314, column: 8, scope: !410, inlinedAt: !280)
!442 = !DILocation(line: 318, column: 10, scope: !443, inlinedAt: !280)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 318, column: 5)
!444 = distinct !DILexicalBlock(scope: !434, file: !1, line: 316, column: 9)
!445 = !DILocation(line: 318, column: 23, scope: !446, inlinedAt: !280)
!446 = distinct !DILexicalBlock(scope: !443, file: !1, line: 318, column: 5)
!447 = !DILocation(line: 318, column: 5, scope: !443, inlinedAt: !280)
!448 = !DILocation(line: 318, column: 41, scope: !446, inlinedAt: !280)
!449 = !DILocation(line: 318, column: 38, scope: !446, inlinedAt: !280)
!450 = !DILocation(line: 318, column: 33, scope: !446, inlinedAt: !280)
!451 = !DILocation(line: 318, column: 36, scope: !446, inlinedAt: !280)
!452 = !DILocation(line: 318, column: 5, scope: !446, inlinedAt: !280)
!453 = distinct !{!453, !454, !455}
!454 = !DILocation(line: 318, column: 5, scope: !443)
!455 = !DILocation(line: 319, column: 6, scope: !443)
!456 = !DILocation(line: 0, scope: !446, inlinedAt: !280)
!457 = !DILocation(line: 324, column: 10, scope: !458, inlinedAt: !280)
!458 = distinct !DILexicalBlock(scope: !444, file: !1, line: 324, column: 5)
!459 = !DILocation(line: 0, scope: !460, inlinedAt: !280)
!460 = distinct !DILexicalBlock(scope: !458, file: !1, line: 324, column: 5)
!461 = !DILocation(line: 324, column: 32, scope: !460, inlinedAt: !280)
!462 = !DILocation(line: 324, column: 27, scope: !460, inlinedAt: !280)
!463 = !DILocation(line: 324, column: 30, scope: !460, inlinedAt: !280)
!464 = !DILocation(line: 324, column: 39, scope: !460, inlinedAt: !280)
!465 = !DILocation(line: 324, column: 5, scope: !458, inlinedAt: !280)
!466 = distinct !{!466, !467, !468}
!467 = !DILocation(line: 324, column: 5, scope: !458)
!468 = !DILocation(line: 325, column: 6, scope: !458)
!469 = !DILocation(line: 331, column: 11, scope: !444, inlinedAt: !280)
!470 = !DILocation(line: 334, column: 13, scope: !444, inlinedAt: !280)
!471 = !DILocation(line: 336, column: 4, scope: !410, inlinedAt: !280)
!472 = !DILocation(line: 0, scope: !402, inlinedAt: !280)
!473 = !DILocation(line: 0, scope: !409, inlinedAt: !280)
!474 = !DILocation(line: 288, column: 41, scope: !404, inlinedAt: !280)
!475 = !DILocation(line: 288, column: 2, scope: !404, inlinedAt: !280)
!476 = distinct !{!476, !477, !478}
!477 = !DILocation(line: 288, column: 2, scope: !402)
!478 = !DILocation(line: 340, column: 3, scope: !402)
!479 = !DILocation(line: 343, column: 1, scope: !264, inlinedAt: !280)
!480 = !DILocation(line: 231, column: 7, scope: !253)
!481 = !DILocation(line: 224, column: 6, scope: !253)
!482 = !DILocation(line: 232, column: 4, scope: !281)
!483 = !DILocation(line: 876, column: 2, scope: !300, inlinedAt: !306)
!484 = !DILocation(line: 234, column: 9, scope: !253)
!485 = !DILocation(line: 234, column: 2, scope: !253)
!486 = !DILocation(line: 0, scope: !253)
!487 = !DILocation(line: 0, scope: !287)
!488 = !DILocation(line: 235, column: 1, scope: !253)
!489 = distinct !DISubprogram(name: "glob0", scope: !1, file: !1, line: 431, type: !254, isLocal: true, isDefinition: true, scopeLine: 435, isOptimized: true, unit: !0, retainedNodes: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499}
!491 = !DILocalVariable(name: "pattern", arg: 1, scope: !489, file: !1, line: 432, type: !9)
!492 = !DILocalVariable(name: "pglob", arg: 2, scope: !489, file: !1, line: 433, type: !38)
!493 = !DILocalVariable(name: "limit", arg: 3, scope: !489, file: !1, line: 434, type: !256)
!494 = !DILocalVariable(name: "qpatnext", scope: !489, file: !1, line: 436, type: !9)
!495 = !DILocalVariable(name: "c", scope: !489, file: !1, line: 437, type: !30)
!496 = !DILocalVariable(name: "err", scope: !489, file: !1, line: 437, type: !30)
!497 = !DILocalVariable(name: "oldpathc", scope: !489, file: !1, line: 437, type: !30)
!498 = !DILocalVariable(name: "bufnext", scope: !489, file: !1, line: 438, type: !14)
!499 = !DILocalVariable(name: "patbuf", scope: !489, file: !1, line: 438, type: !138)
!500 = !DILocalVariable(name: "pathbuf", scope: !501, file: !1, line: 529, type: !138)
!501 = distinct !DISubprogram(name: "glob1", scope: !1, file: !1, line: 524, type: !502, isLocal: true, isDefinition: true, scopeLine: 528, isOptimized: true, unit: !0, retainedNodes: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{!30, !14, !38, !256}
!504 = !{!505, !506, !507, !500}
!505 = !DILocalVariable(name: "pattern", arg: 1, scope: !501, file: !1, line: 525, type: !14)
!506 = !DILocalVariable(name: "pglob", arg: 2, scope: !501, file: !1, line: 526, type: !38)
!507 = !DILocalVariable(name: "limit", arg: 3, scope: !501, file: !1, line: 527, type: !256)
!508 = !DILocation(line: 529, column: 7, scope: !501, inlinedAt: !509)
!509 = distinct !DILocation(line: 496, column: 13, scope: !510)
!510 = distinct !DILexicalBlock(scope: !489, file: !1, line: 496, column: 6)
!511 = !DILocation(line: 432, column: 14, scope: !489)
!512 = !DILocation(line: 433, column: 10, scope: !489)
!513 = !DILocation(line: 434, column: 7, scope: !489)
!514 = !DILocation(line: 438, column: 2, scope: !489)
!515 = !DILocation(line: 438, column: 17, scope: !489)
!516 = !DILocation(line: 440, column: 32, scope: !489)
!517 = !DILocalVariable(name: "pattern", arg: 1, scope: !518, file: !1, line: 352, type: !9)
!518 = distinct !DISubprogram(name: "globtilde", scope: !1, file: !1, line: 351, type: !519, isLocal: true, isDefinition: true, scopeLine: 356, isOptimized: true, unit: !0, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!9, !9, !14, !17, !38}
!521 = !{!517, !522, !523, !524, !525, !538, !539, !540, !541}
!522 = !DILocalVariable(name: "patbuf", arg: 2, scope: !518, file: !1, line: 353, type: !14)
!523 = !DILocalVariable(name: "patbuf_len", arg: 3, scope: !518, file: !1, line: 354, type: !17)
!524 = !DILocalVariable(name: "pglob", arg: 4, scope: !518, file: !1, line: 355, type: !38)
!525 = !DILocalVariable(name: "pwd", scope: !518, file: !1, line: 357, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !528, line: 51, size: 448, elements: !529)
!528 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/pwd.h", directory: "/root/.unikraft/apps/redis/build")
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !527, file: !528, line: 52, baseType: !15, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !527, file: !528, line: 53, baseType: !15, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !527, file: !528, line: 54, baseType: !102, size: 16, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !527, file: !528, line: 55, baseType: !105, size: 16, offset: 144)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pw_comment", scope: !527, file: !528, line: 56, baseType: !15, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !527, file: !528, line: 57, baseType: !15, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !527, file: !528, line: 58, baseType: !15, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !527, file: !528, line: 59, baseType: !15, size: 64, offset: 384)
!538 = !DILocalVariable(name: "h", scope: !518, file: !1, line: 358, type: !15)
!539 = !DILocalVariable(name: "p", scope: !518, file: !1, line: 359, type: !9)
!540 = !DILocalVariable(name: "b", scope: !518, file: !1, line: 360, type: !14)
!541 = !DILocalVariable(name: "eb", scope: !518, file: !1, line: 360, type: !14)
!542 = !DILocation(line: 352, column: 14, scope: !518, inlinedAt: !543)
!543 = distinct !DILocation(line: 440, column: 13, scope: !489)
!544 = !DILocation(line: 353, column: 8, scope: !518, inlinedAt: !543)
!545 = !DILocation(line: 354, column: 9, scope: !518, inlinedAt: !543)
!546 = !DILocation(line: 355, column: 10, scope: !518, inlinedAt: !543)
!547 = !DILocation(line: 362, column: 6, scope: !548, inlinedAt: !543)
!548 = distinct !DILexicalBlock(scope: !518, file: !1, line: 362, column: 6)
!549 = !DILocation(line: 362, column: 15, scope: !548, inlinedAt: !543)
!550 = !DILocation(line: 362, column: 24, scope: !548, inlinedAt: !543)
!551 = !DILocation(line: 362, column: 36, scope: !548, inlinedAt: !543)
!552 = !DILocation(line: 362, column: 45, scope: !548, inlinedAt: !543)
!553 = !DILocation(line: 362, column: 6, scope: !518, inlinedAt: !543)
!554 = !DILocation(line: 368, column: 8, scope: !518, inlinedAt: !543)
!555 = !DILocation(line: 360, column: 12, scope: !518, inlinedAt: !543)
!556 = !DILocation(line: 359, column: 14, scope: !518, inlinedAt: !543)
!557 = !DILocation(line: 358, column: 8, scope: !518, inlinedAt: !543)
!558 = !DILocation(line: 369, column: 7, scope: !559, inlinedAt: !543)
!559 = distinct !DILexicalBlock(scope: !518, file: !1, line: 369, column: 2)
!560 = !DILocation(line: 0, scope: !561, inlinedAt: !543)
!561 = distinct !DILexicalBlock(scope: !559, file: !1, line: 369, column: 2)
!562 = !DILocation(line: 370, column: 10, scope: !561, inlinedAt: !543)
!563 = !DILocation(line: 370, column: 21, scope: !561, inlinedAt: !543)
!564 = !DILocation(line: 370, column: 24, scope: !561, inlinedAt: !543)
!565 = !DILocation(line: 370, column: 27, scope: !561, inlinedAt: !543)
!566 = !DILocation(line: 370, column: 33, scope: !561, inlinedAt: !543)
!567 = !DILocation(line: 369, column: 2, scope: !559, inlinedAt: !543)
!568 = !DILocation(line: 370, column: 50, scope: !561, inlinedAt: !543)
!569 = !DILocation(line: 370, column: 45, scope: !561, inlinedAt: !543)
!570 = !DILocation(line: 370, column: 48, scope: !561, inlinedAt: !543)
!571 = !DILocation(line: 369, column: 2, scope: !561, inlinedAt: !543)
!572 = !DILocation(line: 370, column: 8, scope: !561, inlinedAt: !543)
!573 = distinct !{!573, !574, !575}
!574 = !DILocation(line: 369, column: 2, scope: !559)
!575 = !DILocation(line: 371, column: 3, scope: !559)
!576 = !DILocation(line: 373, column: 5, scope: !518, inlinedAt: !543)
!577 = !DILocation(line: 375, column: 6, scope: !578, inlinedAt: !543)
!578 = distinct !DILexicalBlock(scope: !518, file: !1, line: 375, column: 6)
!579 = !DILocation(line: 375, column: 27, scope: !578, inlinedAt: !543)
!580 = !DILocation(line: 375, column: 6, scope: !518, inlinedAt: !543)
!581 = !DILocation(line: 383, column: 7, scope: !582, inlinedAt: !543)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 383, column: 7)
!583 = distinct !DILexicalBlock(scope: !578, file: !1, line: 375, column: 35)
!584 = !DILocation(line: 383, column: 19, scope: !582, inlinedAt: !543)
!585 = !DILocation(line: 383, column: 24, scope: !582, inlinedAt: !543)
!586 = !DILocation(line: 385, column: 12, scope: !582, inlinedAt: !543)
!587 = !DILocation(line: 385, column: 28, scope: !582, inlinedAt: !543)
!588 = !DILocation(line: 383, column: 7, scope: !583, inlinedAt: !543)
!589 = !DILocation(line: 388, column: 14, scope: !590, inlinedAt: !543)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 388, column: 8)
!591 = distinct !DILexicalBlock(scope: !582, file: !1, line: 385, column: 37)
