; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_bigkey.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_bigkey.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.htab = type { %struct.hashhdr, i32, i32, i32 (i8*, i64)*, i32, i32, i8*, i8*, %struct._bufhead*, i32, i32, i32, i32, i32, [32 x i32*], i32, i32, %struct._bufhead, %struct._bufhead*** }
%struct.hashhdr = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [32 x i32], [32 x i16] }
%struct._bufhead = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i32, i8*, i8 }
%struct.DBT = type { i8*, i64 }
%struct.SPLIT_RETURN = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i16 }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @__big_insert(%struct.htab*, %struct._bufhead*, %struct.DBT* nocapture readonly, %struct.DBT* nocapture readonly) local_unnamed_addr #0 !dbg !20 {
  %5 = getelementptr inbounds %struct._bufhead, %struct._bufhead* %1, i64 0, i32 4, !dbg !127
  %6 = load i8*, i8** %5, align 8, !dbg !127, !tbaa !128
  %7 = bitcast i8* %6 to i16*, !dbg !135
  %8 = getelementptr inbounds %struct.DBT, %struct.DBT* %2, i64 0, i32 0, !dbg !137
  %9 = load i8*, i8** %8, align 8, !dbg !137, !tbaa !138

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_bigkey.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !8, !10, !14, !5, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !6, line: 57, baseType: !7)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !12, line: 87, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!20 = distinct !DISubprogram(name: "__big_insert", scope: !1, file: !1, line: 90, type: !21, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: true, unit: !0, retainedNodes: !108)
!21 = !DISubroutineType(types: !22)
!22 = !{!14, !23, !75, !100, !100}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTAB", file: !25, line: 138, baseType: !26)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.h", directory: "/root/.unikraft/apps/redis/build")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !25, line: 111, size: 5248, elements: !27)
!27 = !{!28, !57, !58, !59, !70, !71, !72, !73, !74, !85, !86, !87, !88, !89, !90, !93, !94, !95, !96}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !26, file: !25, line: 112, baseType: !29, size: 2080)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASHHDR", file: !25, line: 109, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashhdr", file: !25, line: 84, size: 2080, elements: !31)
!31 = !{!32, !33, !34, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !55}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !30, file: !25, line: 85, baseType: !14, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !30, file: !25, line: 86, baseType: !14, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "lorder", scope: !30, file: !25, line: 87, baseType: !35, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !6, line: 79, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !30, file: !25, line: 88, baseType: !14, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !30, file: !25, line: 89, baseType: !14, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !30, file: !25, line: 90, baseType: !14, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ssize", scope: !30, file: !25, line: 91, baseType: !14, size: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sshift", scope: !30, file: !25, line: 92, baseType: !14, size: 32, offset: 224)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl_point", scope: !30, file: !25, line: 93, baseType: !14, size: 32, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "last_freed", scope: !30, file: !25, line: 95, baseType: !14, size: 32, offset: 288)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "max_bucket", scope: !30, file: !25, line: 96, baseType: !14, size: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "high_mask", scope: !30, file: !25, line: 97, baseType: !14, size: 32, offset: 352)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "low_mask", scope: !30, file: !25, line: 98, baseType: !14, size: 32, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ffactor", scope: !30, file: !25, line: 100, baseType: !14, size: 32, offset: 416)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !30, file: !25, line: 101, baseType: !14, size: 32, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hdrpages", scope: !30, file: !25, line: 102, baseType: !14, size: 32, offset: 480)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "h_charkey", scope: !30, file: !25, line: 103, baseType: !14, size: 32, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "spares", scope: !30, file: !25, line: 106, baseType: !52, size: 1024, offset: 544)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bitmaps", scope: !30, file: !25, line: 107, baseType: !56, size: 512, offset: 1568)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, elements: !53)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nsegs", scope: !26, file: !25, line: 113, baseType: !14, size: 32, offset: 2080)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "exsegs", scope: !26, file: !25, line: 114, baseType: !14, size: 32, offset: 2112)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !26, file: !25, line: 117, baseType: !60, size: 64, offset: 2176)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!35, !63, !65}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 40, baseType: !67)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !68, line: 129, baseType: !69)
!68 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !25, line: 118, baseType: !14, size: 32, offset: 2240)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !26, file: !25, line: 119, baseType: !14, size: 32, offset: 2272)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !26, file: !25, line: 120, baseType: !8, size: 64, offset: 2304)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_key", scope: !26, file: !25, line: 121, baseType: !8, size: 64, offset: 2368)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cpage", scope: !26, file: !25, line: 122, baseType: !75, size: 64, offset: 2432)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUFHEAD", file: !25, line: 64, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bufhead", file: !25, line: 66, size: 384, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !25, line: 67, baseType: !75, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !25, line: 68, baseType: !75, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl", scope: !77, file: !25, line: 69, baseType: !75, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !77, file: !25, line: 70, baseType: !35, size: 32, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !77, file: !25, line: 71, baseType: !8, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !25, line: 72, baseType: !9, size: 8, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cbucket", scope: !26, file: !25, line: 123, baseType: !14, size: 32, offset: 2496)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cndx", scope: !26, file: !25, line: 124, baseType: !14, size: 32, offset: 2528)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !26, file: !25, line: 125, baseType: !14, size: 32, offset: 2560)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "new_file", scope: !26, file: !25, line: 127, baseType: !14, size: 32, offset: 2592)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "save_file", scope: !26, file: !25, line: 129, baseType: !14, size: 32, offset: 2624)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !26, file: !25, line: 132, baseType: !91, size: 2048, offset: 2688)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2048, elements: !53)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nmaps", scope: !26, file: !25, line: 133, baseType: !14, size: 32, offset: 4736)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !26, file: !25, line: 134, baseType: !14, size: 32, offset: 4768)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bufhead", scope: !26, file: !25, line: 136, baseType: !76, size: 384, offset: 4800)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !26, file: !25, line: 137, baseType: !97, size: 64, offset: 5184)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEGMENT", file: !25, line: 81, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBT", file: !103, line: 61, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/db_local.h", directory: "/root/.unikraft/apps/redis/build")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 58, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !103, line: 59, baseType: !15, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !103, line: 60, baseType: !65, size: 64, offset: 64)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!109 = !DILocalVariable(name: "hashp", arg: 1, scope: !20, file: !1, line: 91, type: !23)
!110 = !DILocalVariable(name: "bufp", arg: 2, scope: !20, file: !1, line: 92, type: !75)
!111 = !DILocalVariable(name: "key", arg: 3, scope: !20, file: !1, line: 93, type: !100)
!112 = !DILocalVariable(name: "val", arg: 4, scope: !20, file: !1, line: 93, type: !100)
!113 = !DILocalVariable(name: "p", scope: !20, file: !1, line: 95, type: !4)
!114 = !DILocalVariable(name: "key_size", scope: !20, file: !1, line: 96, type: !14)
!115 = !DILocalVariable(name: "n", scope: !20, file: !1, line: 96, type: !14)
!116 = !DILocalVariable(name: "val_size", scope: !20, file: !1, line: 96, type: !14)
!117 = !DILocalVariable(name: "space", scope: !20, file: !1, line: 97, type: !5)
!118 = !DILocalVariable(name: "move_bytes", scope: !20, file: !1, line: 97, type: !5)
!119 = !DILocalVariable(name: "off", scope: !20, file: !1, line: 97, type: !5)
!120 = !DILocalVariable(name: "cp", scope: !20, file: !1, line: 98, type: !8)
!121 = !DILocalVariable(name: "key_data", scope: !20, file: !1, line: 98, type: !8)
!122 = !DILocalVariable(name: "val_data", scope: !20, file: !1, line: 98, type: !8)
!123 = !DILocation(line: 91, column: 8, scope: !20)
!124 = !DILocation(line: 92, column: 11, scope: !20)
!125 = !DILocation(line: 93, column: 13, scope: !20)
!126 = !DILocation(line: 93, column: 19, scope: !20)
!127 = !DILocation(line: 100, column: 13, scope: !20)
!128 = !{!129, !130, i64 32}
!129 = !{!"_bufhead", !130, i64 0, !130, i64 8, !130, i64 16, !133, i64 24, !130, i64 32, !131, i64 40}
!130 = !{!"any pointer", !131, i64 0}
!131 = !{!"omnipotent char", !132, i64 0}
!132 = !{!"Simple C/C++ TBAA"}
!133 = !{!"int", !131, i64 0}
!134 = !DILocation(line: 98, column: 8, scope: !20)
!135 = !DILocation(line: 101, column: 6, scope: !20)
!136 = !DILocation(line: 95, column: 14, scope: !20)
!137 = !DILocation(line: 103, column: 26, scope: !20)
!138 = !{!139, !130, i64 0}
!139 = !{!"", !130, i64 0, !140, i64 8}
!140 = !{!"long", !131, i64 0}
!141 = !DILocation(line: 98, column: 13, scope: !20)
!142 = !DILocation(line: 104, column: 18, scope: !20)
!143 = !{!139, !140, i64 8}
!144 = !DILocation(line: 104, column: 13, scope: !20)
!145 = !DILocation(line: 96, column: 6, scope: !20)
!146 = !DILocation(line: 105, column: 26, scope: !20)
!147 = !DILocation(line: 98, column: 24, scope: !20)
!148 = !DILocation(line: 106, column: 18, scope: !20)
!149 = !DILocation(line: 106, column: 13, scope: !20)
!150 = !DILocation(line: 96, column: 19, scope: !20)
!151 = !DILocation(line: 109, column: 15, scope: !152)
!152 = distinct !DILexicalBlock(scope: !20, file: !1, line: 109, column: 2)
!153 = !{!154, !154, i64 0}
!154 = !{!"short", !131, i64 0}
!155 = !DILocation(line: 97, column: 13, scope: !20)
!156 = !DILocation(line: 109, column: 7, scope: !152)
!157 = !DILocation(line: 109, column: 2, scope: !152)
!158 = !DILocation(line: 112, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !1, line: 110, column: 42)
!160 = distinct !DILexicalBlock(scope: !152, file: !1, line: 109, column: 2)
!161 = !DILocation(line: 0, scope: !160)
!162 = !DILocation(line: 111, column: 16, scope: !159)
!163 = !DILocation(line: 112, column: 21, scope: !159)
!164 = !DILocation(line: 97, column: 32, scope: !20)
!165 = !DILocation(line: 113, column: 14, scope: !159)
!166 = !DILocation(line: 113, column: 31, scope: !159)
!167 = !DILocation(line: 113, column: 3, scope: !159)
!168 = !DILocation(line: 114, column: 12, scope: !159)
!169 = !DILocation(line: 115, column: 12, scope: !159)
!170 = !DILocation(line: 116, column: 7, scope: !159)
!171 = !DILocation(line: 96, column: 16, scope: !20)
!172 = !DILocation(line: 117, column: 5, scope: !159)
!173 = !DILocation(line: 117, column: 3, scope: !159)
!174 = !DILocation(line: 117, column: 10, scope: !159)
!175 = !DILocation(line: 118, column: 10, scope: !159)
!176 = !DILocation(line: 118, column: 8, scope: !159)
!177 = !DILocation(line: 119, column: 24, scope: !159)
!178 = !DILocation(line: 119, column: 22, scope: !159)
!179 = !DILocation(line: 119, column: 3, scope: !159)
!180 = !DILocation(line: 119, column: 16, scope: !159)
!181 = !DILocation(line: 120, column: 3, scope: !159)
!182 = !DILocation(line: 120, column: 13, scope: !159)
!183 = !DILocation(line: 121, column: 3, scope: !159)
!184 = !DILocation(line: 121, column: 8, scope: !159)
!185 = !DILocation(line: 122, column: 10, scope: !159)
!186 = !DILocation(line: 123, column: 8, scope: !187)
!187 = distinct !DILexicalBlock(scope: !159, file: !1, line: 123, column: 7)
!188 = !DILocation(line: 123, column: 7, scope: !159)
!189 = !DILocation(line: 125, column: 7, scope: !159)
!190 = !DILocation(line: 126, column: 8, scope: !191)
!191 = distinct !DILexicalBlock(scope: !159, file: !1, line: 126, column: 7)
!192 = !DILocation(line: 126, column: 7, scope: !159)
!193 = !DILocation(line: 127, column: 8, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !1, line: 127, column: 8)
!195 = distinct !DILexicalBlock(scope: !191, file: !1, line: 126, column: 18)
!196 = !DILocation(line: 127, column: 8, scope: !195)
!197 = !DILocation(line: 128, column: 18, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !1, line: 127, column: 22)
!199 = !DILocation(line: 129, column: 11, scope: !198)
!200 = !DILocation(line: 129, column: 23, scope: !198)
!201 = !DILocation(line: 130, column: 5, scope: !198)
!202 = !DILocation(line: 130, column: 10, scope: !198)
!203 = !DILocation(line: 131, column: 16, scope: !198)
!204 = !DILocation(line: 131, column: 33, scope: !198)
!205 = !DILocation(line: 131, column: 5, scope: !198)
!206 = !DILocation(line: 132, column: 14, scope: !198)
!207 = !DILocation(line: 133, column: 14, scope: !198)
!208 = !DILocation(line: 134, column: 9, scope: !198)
!209 = !DILocation(line: 134, column: 5, scope: !198)
!210 = !DILocation(line: 134, column: 14, scope: !198)
!211 = !DILocation(line: 135, column: 20, scope: !198)
!212 = !DILocation(line: 135, column: 18, scope: !198)
!213 = !DILocation(line: 136, column: 5, scope: !198)
!214 = !DILocation(line: 137, column: 4, scope: !198)
!215 = !DILocation(line: 138, column: 9, scope: !194)
!216 = !DILocation(line: 138, column: 5, scope: !194)
!217 = !DILocation(line: 0, scope: !194)
!218 = !DILocation(line: 140, column: 27, scope: !159)
!219 = !DILocation(line: 0, scope: !20)
!220 = !DILocation(line: 140, column: 7, scope: !159)
!221 = !DILocation(line: 142, column: 9, scope: !159)
!222 = !DILocation(line: 142, column: 15, scope: !159)
!223 = !{!129, !131, i64 40}
!224 = !DILocation(line: 110, column: 14, scope: !160)
!225 = !DILocation(line: 109, column: 2, scope: !160)
!226 = distinct !{!226, !157, !227}
!227 = !DILocation(line: 143, column: 2, scope: !152)
!228 = !DILocation(line: 146, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !20, file: !1, line: 146, column: 2)
!230 = !DILocation(line: 146, column: 15, scope: !229)
!231 = !DILocation(line: 0, scope: !159)
!232 = !DILocation(line: 106, column: 11, scope: !20)
!233 = !DILocation(line: 105, column: 11, scope: !20)
!234 = !DILocation(line: 146, column: 2, scope: !229)
!235 = !DILocation(line: 0, scope: !236)
!236 = distinct !DILexicalBlock(scope: !229, file: !1, line: 146, column: 2)
!237 = !DILocation(line: 148, column: 16, scope: !238)
!238 = distinct !DILexicalBlock(scope: !236, file: !1, line: 147, column: 42)
!239 = !DILocation(line: 97, column: 20, scope: !20)
!240 = !DILocation(line: 153, column: 13, scope: !241)
!241 = distinct !DILexicalBlock(scope: !238, file: !1, line: 153, column: 7)
!242 = !DILocation(line: 153, column: 25, scope: !241)
!243 = !DILocation(line: 153, column: 28, scope: !241)
!244 = !DILocation(line: 153, column: 45, scope: !241)
!245 = !DILocation(line: 153, column: 37, scope: !241)
!246 = !DILocation(line: 153, column: 7, scope: !238)
!247 = !DILocation(line: 154, column: 14, scope: !241)
!248 = !DILocation(line: 154, column: 4, scope: !241)
!249 = !DILocation(line: 0, scope: !238)
!250 = !DILocation(line: 155, column: 9, scope: !238)
!251 = !DILocation(line: 155, column: 21, scope: !238)
!252 = !DILocation(line: 155, column: 19, scope: !238)
!253 = !DILocation(line: 156, column: 14, scope: !238)
!254 = !DILocation(line: 156, column: 31, scope: !238)
!255 = !DILocation(line: 156, column: 3, scope: !238)
!256 = !DILocation(line: 157, column: 12, scope: !238)
!257 = !DILocation(line: 158, column: 12, scope: !238)
!258 = !DILocation(line: 159, column: 7, scope: !238)
!259 = !DILocation(line: 160, column: 5, scope: !238)
!260 = !DILocation(line: 160, column: 3, scope: !238)
!261 = !DILocation(line: 160, column: 10, scope: !238)
!262 = !DILocation(line: 161, column: 10, scope: !238)
!263 = !DILocation(line: 161, column: 8, scope: !238)
!264 = !DILocation(line: 162, column: 24, scope: !238)
!265 = !DILocation(line: 162, column: 22, scope: !238)
!266 = !DILocation(line: 162, column: 3, scope: !238)
!267 = !DILocation(line: 162, column: 16, scope: !238)
!268 = !DILocation(line: 163, column: 3, scope: !238)
!269 = !DILocation(line: 163, column: 13, scope: !238)
!270 = !DILocation(line: 164, column: 7, scope: !271)
!271 = distinct !DILexicalBlock(scope: !238, file: !1, line: 164, column: 7)
!272 = !DILocation(line: 0, scope: !271)
!273 = !DILocation(line: 164, column: 7, scope: !238)
!274 = !DILocation(line: 165, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !1, line: 164, column: 17)
!276 = !DILocation(line: 166, column: 11, scope: !275)
!277 = !DILocation(line: 167, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !1, line: 167, column: 8)
!279 = !DILocation(line: 167, column: 8, scope: !275)
!280 = !DILocation(line: 169, column: 15, scope: !275)
!281 = !DILocation(line: 170, column: 8, scope: !275)
!282 = !DILocation(line: 171, column: 3, scope: !275)
!283 = !DILocation(line: 147, column: 14, scope: !236)
!284 = !DILocation(line: 172, column: 9, scope: !271)
!285 = !DILocation(line: 173, column: 9, scope: !238)
!286 = !DILocation(line: 173, column: 15, scope: !238)
!287 = !DILocation(line: 146, column: 2, scope: !236)
!288 = distinct !{!288, !234, !289}
!289 = !DILocation(line: 174, column: 2, scope: !229)
!290 = !DILocation(line: 0, scope: !187)
!291 = !DILocation(line: 176, column: 1, scope: !20)
!292 = distinct !DISubprogram(name: "__big_delete", scope: !1, file: !1, line: 190, type: !293, isLocal: false, isDefinition: true, scopeLine: 193, isOptimized: true, unit: !0, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!14, !23, !75}
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303}
!296 = !DILocalVariable(name: "hashp", arg: 1, scope: !292, file: !1, line: 191, type: !23)
!297 = !DILocalVariable(name: "bufp", arg: 2, scope: !292, file: !1, line: 192, type: !75)
!298 = !DILocalVariable(name: "last_bfp", scope: !292, file: !1, line: 194, type: !75)
!299 = !DILocalVariable(name: "rbufp", scope: !292, file: !1, line: 194, type: !75)
!300 = !DILocalVariable(name: "bp", scope: !292, file: !1, line: 195, type: !4)
!301 = !DILocalVariable(name: "pageno", scope: !292, file: !1, line: 195, type: !5)
!302 = !DILocalVariable(name: "key_done", scope: !292, file: !1, line: 196, type: !14)
!303 = !DILocalVariable(name: "n", scope: !292, file: !1, line: 196, type: !14)
!304 = !DILocation(line: 191, column: 8, scope: !292)
!305 = !DILocation(line: 192, column: 11, scope: !292)
!306 = !DILocation(line: 194, column: 22, scope: !292)
!307 = !DILocation(line: 194, column: 11, scope: !292)
!308 = !DILocation(line: 200, column: 27, scope: !292)
!309 = !DILocation(line: 195, column: 18, scope: !292)
!310 = !DILocation(line: 196, column: 6, scope: !292)
!311 = !DILocation(line: 204, column: 2, scope: !292)
!312 = !DILocation(line: 0, scope: !313)
!313 = distinct !DILexicalBlock(scope: !292, file: !1, line: 204, column: 48)
!314 = !DILocation(line: 0, scope: !315)
!315 = distinct !DILexicalBlock(scope: !313, file: !1, line: 205, column: 7)
!316 = !DILocation(line: 0, scope: !292)
!317 = !DILocation(line: 195, column: 14, scope: !292)
!318 = !DILocation(line: 204, column: 10, scope: !292)
!319 = !DILocation(line: 204, column: 19, scope: !292)
!320 = !DILocation(line: 204, column: 29, scope: !292)
!321 = !DILocation(line: 234, column: 6, scope: !292)
!322 = !DILocation(line: 205, column: 13, scope: !315)
!323 = !DILocation(line: 205, column: 25, scope: !315)
!324 = !DILocation(line: 205, column: 34, scope: !315)
!325 = !DILocation(line: 205, column: 7, scope: !313)
!326 = !DILocation(line: 0, scope: !327)
!327 = distinct !DILexicalBlock(scope: !313, file: !1, line: 213, column: 7)
!328 = !DILocation(line: 206, column: 4, scope: !315)
!329 = !DILocation(line: 213, column: 30, scope: !327)
!330 = !DILocation(line: 213, column: 33, scope: !327)
!331 = !DILocation(line: 213, column: 7, scope: !313)
!332 = !DILocation(line: 215, column: 15, scope: !313)
!333 = !DILocation(line: 215, column: 21, scope: !313)
!334 = !DILocation(line: 215, column: 12, scope: !313)
!335 = !DILocation(line: 216, column: 10, scope: !313)
!336 = !DILocation(line: 216, column: 16, scope: !313)
!337 = !DILocation(line: 217, column: 28, scope: !313)
!338 = !DILocation(line: 217, column: 11, scope: !313)
!339 = !DILocation(line: 218, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !313, file: !1, line: 218, column: 7)
!341 = !DILocation(line: 218, column: 7, scope: !313)
!342 = !DILocation(line: 219, column: 4, scope: !340)
!343 = !DILocation(line: 221, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !313, file: !1, line: 221, column: 7)
!345 = !DILocation(line: 221, column: 7, scope: !313)
!346 = !DILocation(line: 223, column: 29, scope: !313)
!347 = distinct !{!347, !311, !348}
!348 = !DILocation(line: 224, column: 2, scope: !292)
!349 = !DILocation(line: 235, column: 16, scope: !292)
!350 = !DILocation(line: 235, column: 11, scope: !292)
!351 = !DILocation(line: 238, column: 27, scope: !292)
!352 = !DILocation(line: 239, column: 8, scope: !353)
!353 = distinct !DILexicalBlock(scope: !292, file: !1, line: 239, column: 6)
!354 = !DILocation(line: 239, column: 6, scope: !292)
!355 = !DILocation(line: 241, column: 3, scope: !356)
!356 = distinct !DILexicalBlock(scope: !353, file: !1, line: 239, column: 13)
!357 = !DILocation(line: 241, column: 9, scope: !356)
!358 = !DILocation(line: 242, column: 3, scope: !356)
!359 = !DILocation(line: 242, column: 9, scope: !356)
!360 = !DILocation(line: 243, column: 23, scope: !356)
!361 = !{!129, !130, i64 16}
!362 = !DILocation(line: 243, column: 9, scope: !356)
!363 = !DILocation(line: 243, column: 14, scope: !356)
!364 = !DILocation(line: 244, column: 2, scope: !356)
!365 = !DILocation(line: 246, column: 9, scope: !353)
!366 = !DILocation(line: 246, column: 14, scope: !353)
!367 = !DILocation(line: 247, column: 4, scope: !292)
!368 = !DILocation(line: 248, column: 8, scope: !292)
!369 = !DILocation(line: 249, column: 25, scope: !292)
!370 = !{!371, !133, i64 12}
!371 = !{!"htab", !372, i64 0, !133, i64 260, !133, i64 264, !130, i64 272, !133, i64 280, !133, i64 284, !130, i64 288, !130, i64 296, !130, i64 304, !133, i64 312, !133, i64 316, !133, i64 320, !133, i64 324, !133, i64 328, !131, i64 336, !133, i64 592, !133, i64 596, !129, i64 600, !130, i64 648}
!372 = !{!"hashhdr", !133, i64 0, !133, i64 4, !133, i64 8, !133, i64 12, !133, i64 16, !133, i64 20, !133, i64 24, !133, i64 28, !133, i64 32, !133, i64 36, !133, i64 40, !133, i64 44, !133, i64 48, !133, i64 52, !133, i64 56, !133, i64 60, !133, i64 64, !131, i64 68, !131, i64 196}
!373 = !DILocation(line: 249, column: 18, scope: !292)
!374 = !DILocation(line: 249, column: 33, scope: !292)
!375 = !DILocation(line: 249, column: 31, scope: !292)
!376 = !DILocation(line: 249, column: 2, scope: !292)
!377 = !DILocation(line: 249, column: 16, scope: !292)
!378 = !DILocation(line: 250, column: 15, scope: !292)
!379 = !DILocation(line: 250, column: 2, scope: !292)
!380 = !DILocation(line: 250, column: 13, scope: !292)
!381 = !DILocation(line: 252, column: 8, scope: !292)
!382 = !DILocation(line: 252, column: 14, scope: !292)
!383 = !DILocation(line: 253, column: 6, scope: !292)
!384 = !DILocation(line: 254, column: 3, scope: !385)
!385 = distinct !DILexicalBlock(scope: !292, file: !1, line: 253, column: 6)
!386 = !DILocation(line: 255, column: 15, scope: !387)
!387 = distinct !DILexicalBlock(scope: !292, file: !1, line: 255, column: 6)
!388 = !DILocation(line: 255, column: 6, scope: !292)
!389 = !DILocation(line: 256, column: 3, scope: !387)
!390 = !DILocation(line: 258, column: 9, scope: !292)
!391 = !DILocation(line: 258, column: 14, scope: !292)
!392 = !{!371, !133, i64 56}
!393 = !DILocation(line: 259, column: 2, scope: !292)
!394 = !DILocation(line: 0, scope: !344)
!395 = !DILocation(line: 260, column: 1, scope: !292)
!396 = distinct !DISubprogram(name: "__find_bigpair", scope: !1, file: !1, line: 269, type: !397, isLocal: false, isDefinition: true, scopeLine: 275, isOptimized: true, unit: !0, retainedNodes: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!14, !23, !75, !14, !8, !14}
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!400 = !DILocalVariable(name: "hashp", arg: 1, scope: !396, file: !1, line: 270, type: !23)
!401 = !DILocalVariable(name: "bufp", arg: 2, scope: !396, file: !1, line: 271, type: !75)
!402 = !DILocalVariable(name: "ndx", arg: 3, scope: !396, file: !1, line: 272, type: !14)
!403 = !DILocalVariable(name: "key", arg: 4, scope: !396, file: !1, line: 273, type: !8)
!404 = !DILocalVariable(name: "size", arg: 5, scope: !396, file: !1, line: 274, type: !14)
!405 = !DILocalVariable(name: "bp", scope: !396, file: !1, line: 276, type: !4)
!406 = !DILocalVariable(name: "p", scope: !396, file: !1, line: 277, type: !8)
!407 = !DILocalVariable(name: "ksize", scope: !396, file: !1, line: 278, type: !14)
!408 = !DILocalVariable(name: "bytes", scope: !396, file: !1, line: 279, type: !5)
!409 = !DILocalVariable(name: "kkey", scope: !396, file: !1, line: 280, type: !8)
!410 = !DILocation(line: 270, column: 8, scope: !396)
!411 = !DILocation(line: 271, column: 11, scope: !396)
!412 = !DILocation(line: 272, column: 6, scope: !396)
!413 = !DILocation(line: 273, column: 8, scope: !396)
!414 = !DILocation(line: 274, column: 6, scope: !396)
!415 = !DILocation(line: 282, column: 27, scope: !396)
!416 = !DILocation(line: 282, column: 7, scope: !396)
!417 = !DILocation(line: 276, column: 14, scope: !396)
!418 = !DILocation(line: 277, column: 8, scope: !396)
!419 = !DILocation(line: 278, column: 6, scope: !396)
!420 = !DILocation(line: 280, column: 8, scope: !396)
!421 = !DILocation(line: 287, column: 22, scope: !422)
!422 = distinct !DILexicalBlock(scope: !396, file: !1, line: 287, column: 2)
!423 = !DILocation(line: 287, column: 30, scope: !422)
!424 = !DILocation(line: 287, column: 15, scope: !422)
!425 = !DILocation(line: 279, column: 13, scope: !396)
!426 = !DILocation(line: 287, column: 7, scope: !422)
!427 = !DILocation(line: 288, column: 6, scope: !428)
!428 = distinct !DILexicalBlock(scope: !422, file: !1, line: 287, column: 2)
!429 = !DILocation(line: 288, column: 12, scope: !428)
!430 = !DILocation(line: 288, column: 20, scope: !428)
!431 = !DILocation(line: 288, column: 30, scope: !428)
!432 = !DILocation(line: 288, column: 23, scope: !428)
!433 = !DILocation(line: 288, column: 35, scope: !428)
!434 = !DILocation(line: 287, column: 2, scope: !422)
!435 = !DILocation(line: 290, column: 18, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 290, column: 7)
!437 = distinct !DILexicalBlock(scope: !428, file: !1, line: 289, column: 38)
!438 = !DILocation(line: 290, column: 16, scope: !436)
!439 = !DILocation(line: 290, column: 33, scope: !436)
!440 = !DILocation(line: 290, column: 7, scope: !436)
!441 = !DILocation(line: 290, column: 7, scope: !437)
!442 = !DILocation(line: 294, column: 34, scope: !437)
!443 = !DILocation(line: 294, column: 27, scope: !437)
!444 = !DILocation(line: 294, column: 10, scope: !437)
!445 = !DILocation(line: 295, column: 8, scope: !446)
!446 = distinct !DILexicalBlock(scope: !437, file: !1, line: 295, column: 7)
!447 = !DILocation(line: 295, column: 7, scope: !437)
!448 = !DILocation(line: 293, column: 9, scope: !437)
!449 = !DILocation(line: 292, column: 8, scope: !437)
!450 = !DILocation(line: 297, column: 13, scope: !437)
!451 = !DILocation(line: 298, column: 8, scope: !437)
!452 = !DILocation(line: 289, column: 21, scope: !428)
!453 = !DILocation(line: 289, column: 29, scope: !428)
!454 = !DILocation(line: 289, column: 14, scope: !428)
!455 = !DILocation(line: 287, column: 2, scope: !428)
!456 = distinct !{!456, !434, !457}
!457 = !DILocation(line: 300, column: 2, scope: !422)
!458 = !DILocation(line: 302, column: 12, scope: !459)
!459 = distinct !DILexicalBlock(scope: !396, file: !1, line: 302, column: 6)
!460 = !DILocation(line: 0, scope: !437)
!461 = !DILocation(line: 0, scope: !428)
!462 = !DILocation(line: 302, column: 21, scope: !459)
!463 = !DILocation(line: 302, column: 35, scope: !459)
!464 = !DILocation(line: 302, column: 33, scope: !459)
!465 = !DILocation(line: 302, column: 50, scope: !459)
!466 = !DILocation(line: 302, column: 24, scope: !459)
!467 = !DILocation(line: 302, column: 6, scope: !396)
!468 = !DILocation(line: 0, scope: !459)
!469 = !DILocation(line: 0, scope: !436)
!470 = !DILocation(line: 309, column: 1, scope: !396)
!471 = distinct !DISubprogram(name: "__find_last_page", scope: !1, file: !1, line: 321, type: !472, isLocal: false, isDefinition: true, scopeLine: 324, isOptimized: true, unit: !0, retainedNodes: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!5, !23, !99}
!474 = !{!475, !476, !477, !478, !479, !480}
!475 = !DILocalVariable(name: "hashp", arg: 1, scope: !471, file: !1, line: 322, type: !23)
!476 = !DILocalVariable(name: "bpp", arg: 2, scope: !471, file: !1, line: 323, type: !99)
!477 = !DILocalVariable(name: "bufp", scope: !471, file: !1, line: 325, type: !75)
!478 = !DILocalVariable(name: "bp", scope: !471, file: !1, line: 326, type: !4)
!479 = !DILocalVariable(name: "pageno", scope: !471, file: !1, line: 326, type: !5)
!480 = !DILocalVariable(name: "n", scope: !471, file: !1, line: 327, type: !14)
!481 = !DILocation(line: 322, column: 8, scope: !471)
!482 = !DILocation(line: 323, column: 12, scope: !471)
!483 = !DILocation(line: 329, column: 9, scope: !471)
!484 = !{!130, !130, i64 0}
!485 = !DILocation(line: 325, column: 11, scope: !471)
!486 = !DILocation(line: 331, column: 2, scope: !471)
!487 = !DILocation(line: 0, scope: !471)
!488 = !DILocation(line: 331, column: 2, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !1, line: 331, column: 2)
!490 = distinct !DILexicalBlock(scope: !471, file: !1, line: 331, column: 2)
!491 = !DILocation(line: 326, column: 14, scope: !471)
!492 = !DILocation(line: 332, column: 7, scope: !493)
!493 = distinct !DILexicalBlock(scope: !489, file: !1, line: 331, column: 11)
!494 = !DILocation(line: 327, column: 6, scope: !471)
!495 = !DILocation(line: 339, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !1, line: 339, column: 7)
!497 = !DILocation(line: 339, column: 13, scope: !496)
!498 = !DILocation(line: 339, column: 30, scope: !496)
!499 = !DILocation(line: 340, column: 11, scope: !496)
!500 = !DILocation(line: 340, column: 17, scope: !496)
!501 = !DILocation(line: 350, column: 7, scope: !471)
!502 = !DILocation(line: 351, column: 6, scope: !471)
!503 = !DILocation(line: 340, column: 21, scope: !496)
!504 = !DILocation(line: 340, column: 27, scope: !496)
!505 = !DILocation(line: 340, column: 40, scope: !496)
!506 = !DILocation(line: 340, column: 44, scope: !496)
!507 = !DILocation(line: 340, column: 43, scope: !496)
!508 = !DILocation(line: 339, column: 7, scope: !493)
!509 = !DILocation(line: 343, column: 17, scope: !493)
!510 = !DILocation(line: 343, column: 12, scope: !493)
!511 = !DILocation(line: 326, column: 18, scope: !471)
!512 = !DILocation(line: 344, column: 27, scope: !493)
!513 = !DILocation(line: 344, column: 10, scope: !493)
!514 = !DILocation(line: 345, column: 8, scope: !515)
!515 = distinct !DILexicalBlock(scope: !493, file: !1, line: 345, column: 7)
!516 = !DILocation(line: 345, column: 7, scope: !493)
!517 = distinct !{!517, !518, !519}
!518 = !DILocation(line: 331, column: 2, scope: !490)
!519 = !DILocation(line: 348, column: 2, scope: !490)
!520 = !DILocation(line: 351, column: 12, scope: !521)
!521 = distinct !DILexicalBlock(scope: !471, file: !1, line: 351, column: 6)
!522 = !DILocation(line: 352, column: 11, scope: !521)
!523 = !DILocation(line: 352, column: 3, scope: !521)
!524 = !DILocation(line: 0, scope: !515)
!525 = !DILocation(line: 355, column: 1, scope: !471)
!526 = distinct !DISubprogram(name: "__big_return", scope: !1, file: !1, line: 362, type: !527, isLocal: false, isDefinition: true, scopeLine: 368, isOptimized: true, unit: !0, retainedNodes: !530)
!527 = !DISubroutineType(types: !528)
!528 = !{!14, !23, !75, !14, !529, !14}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!531 = !DILocalVariable(name: "hashp", arg: 1, scope: !526, file: !1, line: 363, type: !23)
!532 = !DILocalVariable(name: "bufp", arg: 2, scope: !526, file: !1, line: 364, type: !75)
!533 = !DILocalVariable(name: "ndx", arg: 3, scope: !526, file: !1, line: 365, type: !14)
!534 = !DILocalVariable(name: "val", arg: 4, scope: !526, file: !1, line: 366, type: !529)
!535 = !DILocalVariable(name: "set_current", arg: 5, scope: !526, file: !1, line: 367, type: !14)
!536 = !DILocalVariable(name: "save_p", scope: !526, file: !1, line: 369, type: !75)
!537 = !DILocalVariable(name: "bp", scope: !526, file: !1, line: 370, type: !4)
!538 = !DILocalVariable(name: "len", scope: !526, file: !1, line: 370, type: !5)
!539 = !DILocalVariable(name: "off", scope: !526, file: !1, line: 370, type: !5)
!540 = !DILocalVariable(name: "save_addr", scope: !526, file: !1, line: 370, type: !5)
!541 = !DILocalVariable(name: "tp", scope: !526, file: !1, line: 371, type: !8)
!542 = !DILocation(line: 363, column: 8, scope: !526)
!543 = !DILocation(line: 364, column: 11, scope: !526)
!544 = !DILocation(line: 365, column: 6, scope: !526)
!545 = !DILocation(line: 366, column: 7, scope: !526)
!546 = !DILocation(line: 367, column: 6, scope: !526)
!547 = !DILocation(line: 373, column: 27, scope: !526)
!548 = !DILocation(line: 370, column: 14, scope: !526)
!549 = !DILocation(line: 374, column: 2, scope: !526)
!550 = !DILocation(line: 374, column: 9, scope: !526)
!551 = !DILocation(line: 374, column: 21, scope: !526)
!552 = !DILocation(line: 375, column: 30, scope: !553)
!553 = distinct !DILexicalBlock(scope: !526, file: !1, line: 374, column: 37)
!554 = !DILocation(line: 375, column: 36, scope: !553)
!555 = !DILocation(line: 375, column: 27, scope: !553)
!556 = !DILocation(line: 375, column: 10, scope: !553)
!557 = !DILocation(line: 376, column: 8, scope: !558)
!558 = distinct !DILexicalBlock(scope: !553, file: !1, line: 376, column: 7)
!559 = !DILocation(line: 376, column: 7, scope: !553)
!560 = !DILocation(line: 378, column: 28, scope: !553)
!561 = !DILocation(line: 378, column: 8, scope: !553)
!562 = distinct !{!562, !549, !563}
!563 = !DILocation(line: 380, column: 2, scope: !526)
!564 = !DILocation(line: 382, column: 18, scope: !565)
!565 = distinct !DILexicalBlock(scope: !526, file: !1, line: 382, column: 6)
!566 = !DILocation(line: 0, scope: !553)
!567 = !DILocation(line: 382, column: 6, scope: !526)
!568 = !DILocation(line: 0, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !1, line: 392, column: 7)
!570 = !DILocation(line: 383, column: 30, scope: !571)
!571 = distinct !DILexicalBlock(scope: !565, file: !1, line: 382, column: 31)
!572 = !DILocation(line: 383, column: 36, scope: !571)
!573 = !DILocation(line: 383, column: 27, scope: !571)
!574 = !DILocation(line: 383, column: 10, scope: !571)
!575 = !DILocation(line: 384, column: 8, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !1, line: 384, column: 7)
!577 = !DILocation(line: 384, column: 7, scope: !571)
!578 = !DILocation(line: 386, column: 28, scope: !571)
!579 = !DILocation(line: 369, column: 11, scope: !526)
!580 = !DILocation(line: 388, column: 23, scope: !571)
!581 = !{!129, !133, i64 24}
!582 = !DILocation(line: 389, column: 9, scope: !571)
!583 = !DILocation(line: 370, column: 23, scope: !526)
!584 = !DILocation(line: 370, column: 18, scope: !526)
!585 = !DILocation(line: 391, column: 2, scope: !571)
!586 = !DILocation(line: 392, column: 8, scope: !569)
!587 = !DILocation(line: 392, column: 7, scope: !565)
!588 = !DILocation(line: 0, scope: !589)
!589 = distinct !DILexicalBlock(scope: !569, file: !1, line: 408, column: 10)
!590 = !DILocation(line: 401, column: 10, scope: !591)
!591 = distinct !DILexicalBlock(scope: !569, file: !1, line: 392, column: 23)
!592 = !DILocation(line: 403, column: 22, scope: !591)
!593 = !DILocation(line: 404, column: 37, scope: !591)
!594 = !DILocation(line: 404, column: 28, scope: !591)
!595 = !DILocation(line: 404, column: 11, scope: !591)
!596 = !DILocation(line: 405, column: 9, scope: !597)
!597 = distinct !DILexicalBlock(scope: !591, file: !1, line: 405, column: 8)
!598 = !DILocation(line: 405, column: 8, scope: !591)
!599 = !DILocation(line: 401, column: 16, scope: !591)
!600 = !DILocation(line: 371, column: 8, scope: !526)
!601 = !DILocation(line: 412, column: 31, scope: !589)
!602 = !DILocation(line: 412, column: 29, scope: !589)
!603 = !DILocation(line: 412, column: 9, scope: !589)
!604 = !DILocation(line: 412, column: 14, scope: !589)
!605 = !DILocation(line: 413, column: 16, scope: !589)
!606 = !DILocation(line: 413, column: 22, scope: !589)
!607 = !DILocation(line: 413, column: 9, scope: !589)
!608 = !DILocation(line: 413, column: 14, scope: !589)
!609 = !DILocation(line: 414, column: 8, scope: !610)
!610 = distinct !DILexicalBlock(scope: !589, file: !1, line: 414, column: 8)
!611 = !DILocation(line: 414, column: 8, scope: !589)
!612 = !DILocation(line: 415, column: 15, scope: !613)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 415, column: 9)
!614 = distinct !DILexicalBlock(scope: !610, file: !1, line: 414, column: 21)
!615 = !DILocation(line: 415, column: 9, scope: !614)
!616 = !DILocation(line: 417, column: 13, scope: !617)
!617 = distinct !DILexicalBlock(scope: !613, file: !1, line: 415, column: 21)
!618 = !DILocation(line: 417, column: 19, scope: !617)
!619 = !{!371, !130, i64 304}
!620 = !DILocation(line: 418, column: 13, scope: !617)
!621 = !DILocation(line: 418, column: 20, scope: !617)
!622 = !{!371, !133, i64 312}
!623 = !DILocation(line: 419, column: 13, scope: !617)
!624 = !DILocation(line: 419, column: 18, scope: !617)
!625 = !{!371, !133, i64 316}
!626 = !DILocation(line: 420, column: 5, scope: !617)
!627 = !DILocation(line: 422, column: 19, scope: !628)
!628 = distinct !DILexicalBlock(scope: !613, file: !1, line: 420, column: 12)
!629 = !DILocation(line: 422, column: 10, scope: !628)
!630 = !DILocation(line: 421, column: 21, scope: !628)
!631 = !DILocation(line: 421, column: 13, scope: !628)
!632 = !DILocation(line: 421, column: 19, scope: !628)
!633 = !DILocation(line: 423, column: 11, scope: !634)
!634 = distinct !DILexicalBlock(scope: !628, file: !1, line: 423, column: 10)
!635 = !DILocation(line: 423, column: 10, scope: !628)
!636 = !DILocation(line: 425, column: 13, scope: !628)
!637 = !DILocation(line: 425, column: 18, scope: !628)
!638 = !DILocation(line: 427, column: 24, scope: !639)
!639 = distinct !DILexicalBlock(scope: !628, file: !1, line: 426, column: 10)
!640 = !DILocation(line: 426, column: 11, scope: !639)
!641 = !DILocation(line: 426, column: 10, scope: !628)
!642 = !DILocation(line: 428, column: 14, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !1, line: 427, column: 34)
!644 = !DILocation(line: 428, column: 21, scope: !643)
!645 = !DILocation(line: 429, column: 20, scope: !643)
!646 = !DILocation(line: 430, column: 6, scope: !643)
!647 = !DILocation(line: 0, scope: !591)
!648 = !DILocation(line: 436, column: 40, scope: !526)
!649 = !DILocation(line: 436, column: 14, scope: !526)
!650 = !DILocation(line: 436, column: 7, scope: !526)
!651 = !DILocation(line: 436, column: 12, scope: !526)
!652 = !DILocation(line: 437, column: 16, scope: !653)
!653 = distinct !DILexicalBlock(scope: !526, file: !1, line: 437, column: 6)
!654 = !DILocation(line: 437, column: 6, scope: !526)
!655 = !DILocation(line: 439, column: 14, scope: !656)
!656 = distinct !DILexicalBlock(scope: !526, file: !1, line: 439, column: 6)
!657 = !DILocation(line: 439, column: 22, scope: !656)
!658 = !DILocation(line: 439, column: 19, scope: !656)
!659 = !DILocation(line: 439, column: 6, scope: !526)
!660 = !DILocation(line: 441, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !656, file: !1, line: 439, column: 33)
!662 = !DILocation(line: 441, column: 9, scope: !661)
!663 = !{!133, !133, i64 0}
!664 = !DILocation(line: 442, column: 3, scope: !661)
!665 = !DILocation(line: 444, column: 17, scope: !526)
!666 = !{!371, !130, i64 288}
!667 = !DILocation(line: 444, column: 35, scope: !526)
!668 = !DILocation(line: 444, column: 41, scope: !526)
!669 = !DILocation(line: 444, column: 48, scope: !526)
!670 = !DILocation(line: 444, column: 2, scope: !526)
!671 = !DILocation(line: 445, column: 31, scope: !526)
!672 = !DILocation(line: 445, column: 12, scope: !526)
!673 = !DILocation(line: 446, column: 2, scope: !526)
!674 = !DILocation(line: 0, scope: !597)
!675 = !DILocation(line: 0, scope: !558)
!676 = !DILocation(line: 447, column: 1, scope: !526)
!677 = distinct !DISubprogram(name: "collect_data", scope: !1, file: !1, line: 453, type: !678, isLocal: true, isDefinition: true, scopeLine: 457, isOptimized: true, unit: !0, retainedNodes: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!14, !23, !75, !14, !14}
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!681 = !DILocalVariable(name: "hashp", arg: 1, scope: !677, file: !1, line: 454, type: !23)
!682 = !DILocalVariable(name: "bufp", arg: 2, scope: !677, file: !1, line: 455, type: !75)
!683 = !DILocalVariable(name: "len", arg: 3, scope: !677, file: !1, line: 456, type: !14)
!684 = !DILocalVariable(name: "set", arg: 4, scope: !677, file: !1, line: 456, type: !14)
!685 = !DILocalVariable(name: "bp", scope: !677, file: !1, line: 458, type: !4)
!686 = !DILocalVariable(name: "p", scope: !677, file: !1, line: 459, type: !8)
!687 = !DILocalVariable(name: "xbp", scope: !677, file: !1, line: 460, type: !75)
!688 = !DILocalVariable(name: "save_addr", scope: !677, file: !1, line: 461, type: !5)
!689 = !DILocalVariable(name: "mylen", scope: !677, file: !1, line: 462, type: !14)
!690 = !DILocalVariable(name: "totlen", scope: !677, file: !1, line: 462, type: !14)
!691 = !DILocation(line: 454, column: 8, scope: !677)
!692 = !DILocation(line: 455, column: 11, scope: !677)
!693 = !DILocation(line: 456, column: 6, scope: !677)
!694 = !DILocation(line: 456, column: 11, scope: !677)
!695 = !DILocation(line: 464, column: 12, scope: !677)
!696 = !DILocation(line: 459, column: 8, scope: !677)
!697 = !DILocation(line: 458, column: 14, scope: !677)
!698 = !DILocation(line: 466, column: 17, scope: !677)
!699 = !DILocation(line: 466, column: 25, scope: !677)
!700 = !DILocation(line: 466, column: 23, scope: !677)
!701 = !DILocation(line: 462, column: 6, scope: !677)
!702 = !DILocation(line: 467, column: 20, scope: !677)
!703 = !DILocation(line: 469, column: 6, scope: !704)
!704 = distinct !DILexicalBlock(scope: !677, file: !1, line: 469, column: 6)
!705 = !DILocation(line: 469, column: 12, scope: !704)
!706 = !DILocation(line: 469, column: 6, scope: !677)
!707 = !DILocation(line: 470, column: 16, scope: !708)
!708 = distinct !DILexicalBlock(scope: !704, file: !1, line: 469, column: 30)
!709 = !DILocation(line: 462, column: 13, scope: !677)
!710 = !DILocation(line: 471, column: 14, scope: !711)
!711 = distinct !DILexicalBlock(scope: !708, file: !1, line: 471, column: 7)
!712 = !DILocation(line: 471, column: 7, scope: !711)
!713 = !DILocation(line: 471, column: 7, scope: !708)
!714 = !DILocation(line: 472, column: 4, scope: !711)
!715 = !DILocation(line: 473, column: 40, scope: !716)
!716 = distinct !DILexicalBlock(scope: !708, file: !1, line: 473, column: 7)
!717 = !DILocation(line: 473, column: 33, scope: !716)
!718 = !DILocation(line: 473, column: 23, scope: !716)
!719 = !DILocation(line: 473, column: 49, scope: !716)
!720 = !DILocation(line: 473, column: 7, scope: !708)
!721 = !DILocation(line: 475, column: 7, scope: !722)
!722 = distinct !DILexicalBlock(scope: !708, file: !1, line: 475, column: 7)
!723 = !DILocation(line: 475, column: 7, scope: !708)
!724 = !DILocation(line: 476, column: 11, scope: !725)
!725 = distinct !DILexicalBlock(scope: !722, file: !1, line: 475, column: 12)
!726 = !DILocation(line: 476, column: 16, scope: !725)
!727 = !DILocation(line: 477, column: 8, scope: !728)
!728 = distinct !DILexicalBlock(scope: !725, file: !1, line: 477, column: 8)
!729 = !DILocation(line: 477, column: 14, scope: !728)
!730 = !DILocation(line: 477, column: 8, scope: !725)
!731 = !DILocation(line: 478, column: 12, scope: !732)
!732 = distinct !DILexicalBlock(scope: !728, file: !1, line: 477, column: 20)
!733 = !DILocation(line: 478, column: 18, scope: !732)
!734 = !DILocation(line: 479, column: 12, scope: !732)
!735 = !DILocation(line: 479, column: 19, scope: !732)
!736 = !DILocation(line: 480, column: 4, scope: !732)
!737 = !DILocation(line: 482, column: 35, scope: !738)
!738 = distinct !DILexicalBlock(scope: !728, file: !1, line: 480, column: 11)
!739 = !DILocation(line: 482, column: 26, scope: !738)
!740 = !DILocation(line: 482, column: 9, scope: !738)
!741 = !DILocation(line: 481, column: 12, scope: !738)
!742 = !DILocation(line: 481, column: 18, scope: !738)
!743 = !DILocation(line: 483, column: 10, scope: !744)
!744 = distinct !DILexicalBlock(scope: !738, file: !1, line: 483, column: 9)
!745 = !DILocation(line: 483, column: 9, scope: !738)
!746 = !DILocation(line: 485, column: 44, scope: !747)
!747 = distinct !DILexicalBlock(scope: !744, file: !1, line: 485, column: 14)
!748 = !DILocation(line: 485, column: 15, scope: !747)
!749 = !DILocation(line: 485, column: 14, scope: !744)
!750 = !DILocation(line: 486, column: 13, scope: !751)
!751 = distinct !DILexicalBlock(scope: !747, file: !1, line: 485, column: 54)
!752 = !DILocation(line: 486, column: 20, scope: !751)
!753 = !DILocation(line: 487, column: 19, scope: !751)
!754 = !DILocation(line: 488, column: 5, scope: !751)
!755 = !DILocation(line: 492, column: 29, scope: !756)
!756 = distinct !DILexicalBlock(scope: !704, file: !1, line: 491, column: 9)
!757 = !DILocation(line: 492, column: 35, scope: !756)
!758 = !DILocation(line: 492, column: 26, scope: !756)
!759 = !DILocation(line: 492, column: 9, scope: !756)
!760 = !DILocation(line: 460, column: 11, scope: !677)
!761 = !DILocation(line: 493, column: 8, scope: !762)
!762 = distinct !DILexicalBlock(scope: !756, file: !1, line: 493, column: 7)
!763 = !DILocation(line: 493, column: 12, scope: !762)
!764 = !DILocation(line: 494, column: 36, scope: !762)
!765 = !DILocation(line: 494, column: 7, scope: !762)
!766 = !DILocation(line: 494, column: 51, scope: !762)
!767 = !DILocation(line: 493, column: 7, scope: !756)
!768 = !DILocation(line: 0, scope: !762)
!769 = !DILocation(line: 497, column: 12, scope: !770)
!770 = distinct !DILexicalBlock(scope: !677, file: !1, line: 497, column: 6)
!771 = !DILocation(line: 497, column: 20, scope: !770)
!772 = !DILocation(line: 497, column: 17, scope: !770)
!773 = !DILocation(line: 497, column: 6, scope: !677)
!774 = !DILocation(line: 498, column: 3, scope: !775)
!775 = distinct !DILexicalBlock(scope: !770, file: !1, line: 497, column: 31)
!776 = !DILocation(line: 498, column: 9, scope: !775)
!777 = !DILocation(line: 499, column: 3, scope: !775)
!778 = !DILocation(line: 501, column: 18, scope: !677)
!779 = !DILocation(line: 501, column: 11, scope: !677)
!780 = !DILocation(line: 501, column: 39, scope: !677)
!781 = !DILocation(line: 501, column: 47, scope: !677)
!782 = !DILocation(line: 501, column: 45, scope: !677)
!783 = !DILocation(line: 501, column: 54, scope: !677)
!784 = !DILocation(line: 501, column: 2, scope: !677)
!785 = !DILocation(line: 502, column: 2, scope: !677)
!786 = !DILocation(line: 0, scope: !716)
!787 = !DILocation(line: 503, column: 1, scope: !677)
!788 = distinct !DISubprogram(name: "__big_keydata", scope: !1, file: !1, line: 509, type: !789, isLocal: false, isDefinition: true, scopeLine: 514, isOptimized: true, unit: !0, retainedNodes: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!14, !23, !75, !529, !529, !14}
!791 = !{!792, !793, !794, !795, !796}
!792 = !DILocalVariable(name: "hashp", arg: 1, scope: !788, file: !1, line: 510, type: !23)
!793 = !DILocalVariable(name: "bufp", arg: 2, scope: !788, file: !1, line: 511, type: !75)
!794 = !DILocalVariable(name: "key", arg: 3, scope: !788, file: !1, line: 512, type: !529)
!795 = !DILocalVariable(name: "val", arg: 4, scope: !788, file: !1, line: 512, type: !529)
!796 = !DILocalVariable(name: "set", arg: 5, scope: !788, file: !1, line: 513, type: !14)
!797 = !DILocation(line: 510, column: 8, scope: !788)
!798 = !DILocation(line: 511, column: 11, scope: !788)
!799 = !DILocation(line: 512, column: 7, scope: !788)
!800 = !DILocation(line: 512, column: 13, scope: !788)
!801 = !DILocation(line: 513, column: 6, scope: !788)
!802 = !DILocation(line: 515, column: 14, scope: !788)
!803 = !DILocation(line: 515, column: 7, scope: !788)
!804 = !DILocation(line: 515, column: 12, scope: !788)
!805 = !DILocation(line: 516, column: 16, scope: !806)
!806 = distinct !DILexicalBlock(scope: !788, file: !1, line: 516, column: 6)
!807 = !DILocation(line: 516, column: 6, scope: !788)
!808 = !DILocation(line: 518, column: 31, scope: !788)
!809 = !{!371, !130, i64 296}
!810 = !DILocation(line: 518, column: 12, scope: !788)
!811 = !DILocation(line: 519, column: 2, scope: !788)
!812 = !DILocation(line: 0, scope: !788)
!813 = !DILocation(line: 0, scope: !806)
!814 = !DILocation(line: 520, column: 1, scope: !788)
!815 = distinct !DISubprogram(name: "collect_key", scope: !1, file: !1, line: 527, type: !527, isLocal: true, isDefinition: true, scopeLine: 533, isOptimized: true, unit: !0, retainedNodes: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!817 = !DILocalVariable(name: "hashp", arg: 1, scope: !815, file: !1, line: 528, type: !23)
!818 = !DILocalVariable(name: "bufp", arg: 2, scope: !815, file: !1, line: 529, type: !75)
!819 = !DILocalVariable(name: "len", arg: 3, scope: !815, file: !1, line: 530, type: !14)
!820 = !DILocalVariable(name: "val", arg: 4, scope: !815, file: !1, line: 531, type: !529)
!821 = !DILocalVariable(name: "set", arg: 5, scope: !815, file: !1, line: 532, type: !14)
!822 = !DILocalVariable(name: "xbp", scope: !815, file: !1, line: 534, type: !75)
!823 = !DILocalVariable(name: "p", scope: !815, file: !1, line: 535, type: !8)
!824 = !DILocalVariable(name: "mylen", scope: !815, file: !1, line: 536, type: !14)
!825 = !DILocalVariable(name: "totlen", scope: !815, file: !1, line: 536, type: !14)
!826 = !DILocalVariable(name: "bp", scope: !815, file: !1, line: 537, type: !4)
!827 = !DILocalVariable(name: "save_addr", scope: !815, file: !1, line: 537, type: !5)
!828 = !DILocation(line: 528, column: 8, scope: !815)
!829 = !DILocation(line: 529, column: 11, scope: !815)
!830 = !DILocation(line: 530, column: 6, scope: !815)
!831 = !DILocation(line: 531, column: 7, scope: !815)
!832 = !DILocation(line: 532, column: 6, scope: !815)
!833 = !DILocation(line: 539, column: 12, scope: !815)
!834 = !DILocation(line: 535, column: 8, scope: !815)
!835 = !DILocation(line: 537, column: 14, scope: !815)
!836 = !DILocation(line: 541, column: 17, scope: !815)
!837 = !DILocation(line: 541, column: 25, scope: !815)
!838 = !DILocation(line: 541, column: 23, scope: !815)
!839 = !DILocation(line: 536, column: 6, scope: !815)
!840 = !DILocation(line: 543, column: 20, scope: !815)
!841 = !DILocation(line: 544, column: 15, scope: !815)
!842 = !DILocation(line: 536, column: 13, scope: !815)
!843 = !DILocation(line: 545, column: 6, scope: !844)
!844 = distinct !DILexicalBlock(scope: !815, file: !1, line: 545, column: 6)
!845 = !DILocation(line: 545, column: 12, scope: !844)
!846 = !DILocation(line: 545, column: 24, scope: !844)
!847 = !DILocation(line: 545, column: 33, scope: !844)
!848 = !DILocation(line: 545, column: 6, scope: !815)
!849 = !DILocation(line: 546, column: 14, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !1, line: 546, column: 7)
!851 = distinct !DILexicalBlock(scope: !844, file: !1, line: 545, column: 51)
!852 = !DILocation(line: 546, column: 22, scope: !850)
!853 = !DILocation(line: 546, column: 7, scope: !851)
!854 = !DILocation(line: 547, column: 4, scope: !850)
!855 = !DILocation(line: 548, column: 40, scope: !856)
!856 = distinct !DILexicalBlock(scope: !851, file: !1, line: 548, column: 7)
!857 = !DILocation(line: 548, column: 33, scope: !856)
!858 = !DILocation(line: 548, column: 23, scope: !856)
!859 = !DILocation(line: 548, column: 49, scope: !856)
!860 = !DILocation(line: 548, column: 7, scope: !851)
!861 = !DILocation(line: 550, column: 7, scope: !862)
!862 = distinct !DILexicalBlock(scope: !851, file: !1, line: 550, column: 7)
!863 = !DILocation(line: 550, column: 7, scope: !851)
!864 = !DILocation(line: 553, column: 29, scope: !865)
!865 = distinct !DILexicalBlock(scope: !844, file: !1, line: 552, column: 9)
!866 = !DILocation(line: 553, column: 35, scope: !865)
!867 = !DILocation(line: 553, column: 26, scope: !865)
!868 = !DILocation(line: 553, column: 9, scope: !865)
!869 = !DILocation(line: 534, column: 11, scope: !815)
!870 = !DILocation(line: 554, column: 8, scope: !871)
!871 = distinct !DILexicalBlock(scope: !865, file: !1, line: 554, column: 7)
!872 = !DILocation(line: 554, column: 12, scope: !871)
!873 = !DILocation(line: 555, column: 7, scope: !871)
!874 = !DILocation(line: 555, column: 50, scope: !871)
!875 = !DILocation(line: 554, column: 7, scope: !865)
!876 = !DILocation(line: 0, scope: !871)
!877 = !DILocation(line: 558, column: 12, scope: !878)
!878 = distinct !DILexicalBlock(scope: !815, file: !1, line: 558, column: 6)
!879 = !DILocation(line: 558, column: 20, scope: !878)
!880 = !DILocation(line: 558, column: 17, scope: !878)
!881 = !DILocation(line: 558, column: 6, scope: !815)
!882 = !DILocation(line: 559, column: 3, scope: !883)
!883 = distinct !DILexicalBlock(scope: !878, file: !1, line: 558, column: 31)
!884 = !DILocation(line: 559, column: 9, scope: !883)
!885 = !DILocation(line: 560, column: 3, scope: !883)
!886 = !DILocation(line: 562, column: 18, scope: !815)
!887 = !DILocation(line: 562, column: 11, scope: !815)
!888 = !DILocation(line: 562, column: 39, scope: !815)
!889 = !DILocation(line: 562, column: 47, scope: !815)
!890 = !DILocation(line: 562, column: 45, scope: !815)
!891 = !DILocation(line: 562, column: 54, scope: !815)
!892 = !DILocation(line: 562, column: 2, scope: !815)
!893 = !DILocation(line: 563, column: 2, scope: !815)
!894 = !DILocation(line: 0, scope: !856)
!895 = !DILocation(line: 564, column: 1, scope: !815)
!896 = distinct !DISubprogram(name: "__big_split", scope: !1, file: !1, line: 572, type: !897, isLocal: false, isDefinition: true, scopeLine: 581, isOptimized: true, unit: !0, retainedNodes: !908)
!897 = !DISubroutineType(types: !898)
!898 = !{!14, !23, !75, !75, !75, !14, !35, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLIT_RETURN", file: !901, line: 93, baseType: !902)
!901 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/page.h", directory: "/root/.unikraft/apps/redis/build")
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 88, size: 256, elements: !903)
!903 = !{!904, !905, !906, !907}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "newp", scope: !902, file: !901, line: 89, baseType: !75, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", scope: !902, file: !901, line: 90, baseType: !75, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", scope: !902, file: !901, line: 91, baseType: !75, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !902, file: !901, line: 92, baseType: !5, size: 16, offset: 192)
!908 = !{!909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!909 = !DILocalVariable(name: "hashp", arg: 1, scope: !896, file: !1, line: 573, type: !23)
!910 = !DILocalVariable(name: "op", arg: 2, scope: !896, file: !1, line: 574, type: !75)
!911 = !DILocalVariable(name: "np", arg: 3, scope: !896, file: !1, line: 575, type: !75)
!912 = !DILocalVariable(name: "big_keyp", arg: 4, scope: !896, file: !1, line: 577, type: !75)
!913 = !DILocalVariable(name: "addr", arg: 5, scope: !896, file: !1, line: 578, type: !14)
!914 = !DILocalVariable(name: "obucket", arg: 6, scope: !896, file: !1, line: 579, type: !35)
!915 = !DILocalVariable(name: "ret", arg: 7, scope: !896, file: !1, line: 580, type: !899)
!916 = !DILocalVariable(name: "tmpp", scope: !896, file: !1, line: 582, type: !75)
!917 = !DILocalVariable(name: "tp", scope: !896, file: !1, line: 583, type: !4)
!918 = !DILocalVariable(name: "bp", scope: !896, file: !1, line: 584, type: !75)
!919 = !DILocalVariable(name: "key", scope: !896, file: !1, line: 585, type: !102)
!920 = !DILocalVariable(name: "val", scope: !896, file: !1, line: 585, type: !102)
!921 = !DILocalVariable(name: "change", scope: !896, file: !1, line: 586, type: !35)
!922 = !DILocalVariable(name: "free_space", scope: !896, file: !1, line: 587, type: !5)
!923 = !DILocalVariable(name: "n", scope: !896, file: !1, line: 587, type: !5)
!924 = !DILocalVariable(name: "off", scope: !896, file: !1, line: 587, type: !5)
!925 = !DILocation(line: 573, column: 8, scope: !896)
!926 = !DILocation(line: 574, column: 11, scope: !896)
!927 = !DILocation(line: 575, column: 11, scope: !896)
!928 = !DILocation(line: 577, column: 11, scope: !896)
!929 = !DILocation(line: 578, column: 6, scope: !896)
!930 = !DILocation(line: 579, column: 15, scope: !896)
!931 = !DILocation(line: 580, column: 16, scope: !896)
!932 = !DILocation(line: 585, column: 2, scope: !896)
!933 = !DILocation(line: 584, column: 11, scope: !896)
!934 = !DILocation(line: 585, column: 6, scope: !896)
!935 = !DILocation(line: 585, column: 11, scope: !896)
!936 = !DILocation(line: 510, column: 8, scope: !788, inlinedAt: !937)
!937 = distinct !DILocation(line: 592, column: 6, scope: !938)
!938 = distinct !DILexicalBlock(scope: !896, file: !1, line: 592, column: 6)
!939 = !DILocation(line: 511, column: 11, scope: !788, inlinedAt: !937)
!940 = !DILocation(line: 512, column: 7, scope: !788, inlinedAt: !937)
!941 = !DILocation(line: 512, column: 13, scope: !788, inlinedAt: !937)
!942 = !DILocation(line: 513, column: 6, scope: !788, inlinedAt: !937)
!943 = !DILocation(line: 515, column: 14, scope: !788, inlinedAt: !937)
!944 = !DILocation(line: 516, column: 16, scope: !806, inlinedAt: !937)
!945 = !DILocation(line: 516, column: 6, scope: !788, inlinedAt: !937)
!946 = !DILocation(line: 517, column: 3, scope: !806, inlinedAt: !937)
!947 = !DILocation(line: 520, column: 1, scope: !788, inlinedAt: !937)
!948 = !DILocation(line: 592, column: 6, scope: !896)
!949 = !DILocation(line: 593, column: 3, scope: !938)
!950 = !DILocation(line: 518, column: 31, scope: !788, inlinedAt: !937)
!951 = !DILocation(line: 519, column: 2, scope: !788, inlinedAt: !937)
!952 = !DILocation(line: 594, column: 12, scope: !896)
!953 = !DILocation(line: 594, column: 51, scope: !896)
!954 = !DILocation(line: 322, column: 8, scope: !471, inlinedAt: !955)
!955 = distinct !DILocation(line: 596, column: 25, scope: !956)
!956 = distinct !DILexicalBlock(scope: !896, file: !1, line: 596, column: 7)
!957 = !DILocation(line: 325, column: 11, scope: !471, inlinedAt: !955)
!958 = !DILocation(line: 331, column: 2, scope: !471, inlinedAt: !955)
!959 = !DILocation(line: 0, scope: !956)
!960 = !DILocation(line: 331, column: 2, scope: !489, inlinedAt: !955)
!961 = !DILocation(line: 326, column: 14, scope: !471, inlinedAt: !955)
