; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/icmp.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/icmp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !{!21, !22, !23, !24, !25}
!21 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!22 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!23 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 145, baseType: !14, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!29 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !33, line: 68, baseType: !14, size: 32, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 53, baseType: !41, size: 32, elements: !42)
!40 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!43 = !DIEnumerator(name: "ERR_OK", value: 0)
!44 = !DIEnumerator(name: "ERR_MEM", value: -1)
!45 = !DIEnumerator(name: "ERR_BUF", value: -2)
!46 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!47 = !DIEnumerator(name: "ERR_RTE", value: -4)
!48 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!49 = !DIEnumerator(name: "ERR_VAL", value: -6)
!50 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!51 = !DIEnumerator(name: "ERR_USE", value: -8)
!52 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!53 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!54 = !DIEnumerator(name: "ERR_CONN", value: -11)
!55 = !DIEnumerator(name: "ERR_IF", value: -12)
!56 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!57 = !DIEnumerator(name: "ERR_RST", value: -14)
!58 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!59 = !DIEnumerator(name: "ERR_ARG", value: -16)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp_dur_type", file: !61, line: 55, baseType: !14, size: 32, elements: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/icmp.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "ICMP_DUR_NET", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "ICMP_DUR_HOST", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "ICMP_DUR_PROTO", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "ICMP_DUR_PORT", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "ICMP_DUR_FRAG", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "ICMP_DUR_SR", value: 5, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp_te_type", file: !61, line: 71, baseType: !14, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "ICMP_TE_TTL", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "ICMP_TE_FRAG", value: 1, isUnsigned: true)
!73 = !{!74, !81, !82, !85, !86, !90, !99}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !75, line: 125, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !77, line: 24, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !79, line: 43, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !75, line: 129, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !77, line: 48, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !79, line: 79, baseType: !14)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !75, line: 127, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !77, line: 36, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !79, line: 57, baseType: !89)
!89 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp_echo_hdr", file: !92, line: 69, size: 64, elements: !93)
!92 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/icmp.h", directory: "/root/.unikraft/apps/redis/build")
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !92, line: 70, baseType: !74, size: 8)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !91, file: !92, line: 71, baseType: !74, size: 8, offset: 8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !91, file: !92, line: 72, baseType: !86, size: 16, offset: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !91, file: !92, line: 73, baseType: !86, size: 16, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !91, file: !92, line: 74, baseType: !86, size: 16, offset: 48)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_hdr", file: !101, line: 73, size: 160, elements: !102)
!101 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip4.h", directory: "/root/.unikraft/apps/redis/build")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !116}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_v_hl", scope: !100, file: !101, line: 75, baseType: !74, size: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_tos", scope: !100, file: !101, line: 77, baseType: !74, size: 8, offset: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_len", scope: !100, file: !101, line: 79, baseType: !86, size: 16, offset: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_id", scope: !100, file: !101, line: 81, baseType: !86, size: 16, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !100, file: !101, line: 83, baseType: !86, size: 16, offset: 48)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_ttl", scope: !100, file: !101, line: 89, baseType: !74, size: 8, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_proto", scope: !100, file: !101, line: 91, baseType: !74, size: 8, offset: 72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_chksum", scope: !100, file: !101, line: 93, baseType: !86, size: 16, offset: 80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !100, file: !101, line: 95, baseType: !112, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_p_t", file: !101, line: 61, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr_packed", file: !101, line: 53, size: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !113, file: !101, line: 54, baseType: !82, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !100, file: !101, line: 96, baseType: !112, size: 32, offset: 128)
!117 = !{!0, !118}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 56, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 7)
!123 = !{!124, !125}
!124 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!125 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !127, line: 32, baseType: !128)
!127 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 192, elements: !136)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !131)
!131 = !{!132, !133, !134, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !130, file: !10, line: 196, baseType: !14, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !130, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !130, file: !10, line: 196, baseType: !85, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !130, file: !10, line: 196, baseType: !85, size: 64, offset: 128)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 8)
!141 = !{i32 2, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{i32 1, !"wchar_size", i32 4}
!144 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!145 = distinct !DISubprogram(name: "icmp_input", scope: !10, file: !10, line: 80, type: !146, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !258)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !159}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !19, line: 186, size: 192, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !19, line: 188, baseType: !148, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !149, file: !19, line: 191, baseType: !85, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !149, file: !19, line: 200, baseType: !86, size: 16, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !19, line: 203, baseType: !86, size: 16, offset: 144)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !149, file: !19, line: 208, baseType: !74, size: 8, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !149, file: !19, line: 211, baseType: !74, size: 8, offset: 168)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !149, file: !19, line: 218, baseType: !74, size: 8, offset: 176)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !149, file: !19, line: 221, baseType: !74, size: 8, offset: 184)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !13, line: 260, size: 2240, elements: !161)
!161 = !{!162, !163, !188, !189, !190, !194, !196, !198, !199, !209, !216, !221, !228, !233, !234, !235, !237, !238, !239, !240, !244, !245, !246, !250, !251, !252, !253}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !13, line: 263, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !160, file: !13, line: 268, baseType: !164, size: 192, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !165, line: 76, baseType: !166)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !165, line: 69, size: 192, elements: !167)
!167 = !{!168, !187}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !166, file: !165, line: 73, baseType: !169, size: 160)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !165, line: 70, size: 160, elements: !170)
!170 = !{!171, !181}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !169, file: !165, line: 71, baseType: !172, size: 160)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !173, line: 67, baseType: !174)
!173 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !173, line: 59, size: 160, elements: !175)
!175 = !{!176, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !174, file: !173, line: 60, baseType: !177, size: 128)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 4)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !174, file: !173, line: 62, baseType: !74, size: 8, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !169, file: !165, line: 72, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !183, line: 57, baseType: !184)
!183 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !183, line: 51, size: 32, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !184, file: !183, line: 52, baseType: !82, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !165, line: 75, baseType: !74, size: 8, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !160, file: !13, line: 269, baseType: !164, size: 192, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !160, file: !13, line: 270, baseType: !164, size: 192, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !160, file: !13, line: 274, baseType: !191, size: 576, offset: 640)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 576, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !160, file: !13, line: 277, baseType: !195, size: 24, offset: 1216)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 24, elements: !192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !160, file: !13, line: 282, baseType: !197, size: 96, offset: 1248)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 96, elements: !192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !160, file: !13, line: 283, baseType: !197, size: 96, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !160, file: !13, line: 288, baseType: !200, size: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !13, line: 178, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !148, !159}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !40, line: 96, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !75, line: 126, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !77, line: 20, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !79, line: 41, baseType: !208)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !160, file: !13, line: 294, baseType: !210, size: 64, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !13, line: 189, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!204, !159, !148, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !160, file: !13, line: 299, baseType: !217, size: 64, offset: 1600)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !13, line: 212, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!204, !159, !148}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !160, file: !13, line: 305, baseType: !222, size: 64, offset: 1664)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !13, line: 202, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !159, !148, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !160, file: !13, line: 310, baseType: !229, size: 64, offset: 1728)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !13, line: 214, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !159}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !160, file: !13, line: 319, baseType: !229, size: 64, offset: 1792)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !160, file: !13, line: 323, baseType: !85, size: 64, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !160, file: !13, line: 325, baseType: !236, size: 64, offset: 1920)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !136)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !160, file: !13, line: 332, baseType: !86, size: 16, offset: 1984)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !160, file: !13, line: 335, baseType: !86, size: 16, offset: 2000)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !160, file: !13, line: 338, baseType: !86, size: 16, offset: 2016)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !160, file: !13, line: 341, baseType: !241, size: 48, offset: 2032)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 48, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 6)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !160, file: !13, line: 343, baseType: !74, size: 8, offset: 2080)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !160, file: !13, line: 345, baseType: !74, size: 8, offset: 2088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !13, line: 347, baseType: !247, size: 16, offset: 2096)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 2)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !160, file: !13, line: 350, baseType: !74, size: 8, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !160, file: !13, line: 353, baseType: !74, size: 8, offset: 2120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !160, file: !13, line: 357, baseType: !74, size: 8, offset: 2128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !160, file: !13, line: 377, baseType: !254, size: 64, offset: 2176)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !13, line: 222, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!204, !159, !226, !12}
!258 = !{!259, !260, !261, !262, !263, !266, !267, !268, !272, !273, !276}
!259 = !DILocalVariable(name: "p", arg: 1, scope: !145, file: !10, line: 80, type: !148)
!260 = !DILocalVariable(name: "inp", arg: 2, scope: !145, file: !10, line: 80, type: !159)
!261 = !DILocalVariable(name: "type", scope: !145, file: !10, line: 82, type: !74)
!262 = !DILocalVariable(name: "iecho", scope: !145, file: !10, line: 86, type: !90)
!263 = !DILocalVariable(name: "iphdr_in", scope: !145, file: !10, line: 87, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!266 = !DILocalVariable(name: "hlen", scope: !145, file: !10, line: 88, type: !86)
!267 = !DILocalVariable(name: "src", scope: !145, file: !10, line: 89, type: !214)
!268 = !DILocalVariable(name: "r", scope: !269, file: !10, line: 161, type: !148)
!269 = distinct !DILexicalBlock(scope: !270, file: !10, line: 157, column: 85)
!270 = distinct !DILexicalBlock(scope: !271, file: !10, line: 157, column: 11)
!271 = distinct !DILexicalBlock(scope: !145, file: !10, line: 111, column: 17)
!272 = !DILocalVariable(name: "alloc_len", scope: !269, file: !10, line: 162, type: !86)
!273 = !DILocalVariable(name: "ret", scope: !274, file: !10, line: 211, type: !204)
!274 = distinct !DILexicalBlock(scope: !275, file: !10, line: 210, column: 14)
!275 = distinct !DILexicalBlock(scope: !271, file: !10, line: 208, column: 11)
!276 = !DILocalVariable(name: "iphdr", scope: !274, file: !10, line: 212, type: !99)
!277 = !DILocation(line: 80, column: 25, scope: !145)
!278 = !DILocation(line: 80, column: 42, scope: !145)
!279 = !DILocation(line: 91, column: 3, scope: !145)
!280 = !{!281, !283, i64 98}
!281 = !{!"stats_", !282, i64 0, !282, i64 24, !282, i64 48, !282, i64 72, !282, i64 96, !282, i64 120, !282, i64 144, !286, i64 168, !282, i64 186, !282, i64 210, !282, i64 234, !288, i64 258, !282, i64 286}
!282 = !{!"stats_proto", !283, i64 0, !283, i64 2, !283, i64 4, !283, i64 6, !283, i64 8, !283, i64 10, !283, i64 12, !283, i64 14, !283, i64 16, !283, i64 18, !283, i64 20, !283, i64 22}
!283 = !{!"short", !284, i64 0}
!284 = !{!"omnipotent char", !285, i64 0}
!285 = !{!"Simple C/C++ TBAA"}
!286 = !{!"stats_sys", !287, i64 0, !287, i64 6, !287, i64 12}
!287 = !{!"stats_syselem", !283, i64 0, !283, i64 2, !283, i64 4}
!288 = !{!"stats_igmp", !283, i64 0, !283, i64 2, !283, i64 4, !283, i64 6, !283, i64 8, !283, i64 10, !283, i64 12, !283, i64 14, !283, i64 16, !283, i64 18, !283, i64 20, !283, i64 22, !283, i64 24, !283, i64 26}
!289 = !DILocation(line: 94, column: 14, scope: !145)
!290 = !{!291, !292, i64 16}
!291 = !{!"ip_globals", !292, i64 0, !292, i64 8, !292, i64 16, !292, i64 24, !283, i64 32, !293, i64 36, !293, i64 60}
!292 = !{!"any pointer", !284, i64 0}
!293 = !{!"ip_addr", !284, i64 0, !284, i64 20}
!294 = !DILocation(line: 87, column: 24, scope: !145)
!295 = !DILocation(line: 95, column: 10, scope: !145)
!296 = !{!297, !284, i64 0}
!297 = !{!"ip_hdr", !284, i64 0, !284, i64 1, !283, i64 2, !283, i64 4, !283, i64 6, !284, i64 8, !284, i64 9, !283, i64 10, !298, i64 12, !298, i64 16}
!298 = !{!"ip4_addr_packed", !299, i64 0}
!299 = !{!"int", !284, i64 0}
!300 = !DILocation(line: 88, column: 9, scope: !145)
!301 = !DILocation(line: 96, column: 12, scope: !302)
!302 = distinct !DILexicalBlock(scope: !145, file: !10, line: 96, column: 7)
!303 = !DILocation(line: 96, column: 7, scope: !145)
!304 = !DILocation(line: 100, column: 10, scope: !305)
!305 = distinct !DILexicalBlock(scope: !145, file: !10, line: 100, column: 7)
