; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.netif = type { %struct.netif*, %struct.ip_addr, %struct.ip_addr, %struct.ip_addr, [3 x %struct.ip_addr], [3 x i8], [3 x i32], [3 x i32], i8 (%struct.pbuf*, %struct.netif*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip4_addr*)*, i8 (%struct.netif*, %struct.pbuf*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip6_addr*)*, {}*, {}*, i8*, [1 x i8*], i16, i16, i16, [6 x i8], i8, i8, [2 x i8], i8, i8, i8, i8 (%struct.netif*, %struct.ip6_addr*, i32)* }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip4_addr = type { i32 }
%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }

!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 53, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!15 = !DIEnumerator(name: "ERR_OK", value: 0)
!16 = !DIEnumerator(name: "ERR_MEM", value: -1)
!17 = !DIEnumerator(name: "ERR_BUF", value: -2)
!18 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!19 = !DIEnumerator(name: "ERR_RTE", value: -4)
!20 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!21 = !DIEnumerator(name: "ERR_VAL", value: -6)
!22 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!23 = !DIEnumerator(name: "ERR_USE", value: -8)
!24 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!25 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!26 = !DIEnumerator(name: "ERR_CONN", value: -11)
!27 = !DIEnumerator(name: "ERR_IF", value: -12)
!28 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!29 = !DIEnumerator(name: "ERR_RST", value: -14)
!30 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!31 = !DIEnumerator(name: "ERR_ARG", value: -16)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !33, line: 54, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!37 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp_dur_type", file: !39, line: 55, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/icmp.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !{!41, !42, !43, !44, !45, !46}
!41 = !DIEnumerator(name: "ICMP_DUR_NET", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "ICMP_DUR_HOST", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "ICMP_DUR_PROTO", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "ICMP_DUR_PORT", value: 3, isUnsigned: true)
!45 = !DIEnumerator(name: "ICMP_DUR_FRAG", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "ICMP_DUR_SR", value: 5, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !48, line: 68, baseType: !7, size: 32, elements: !49)
!48 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!54 = !{!55, !61, !62, !66, !73, !80, !95, !97}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !56, line: 129, baseType: !57)
!56 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !58, line: 48, baseType: !59)
!58 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !60, line: 79, baseType: !7)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !56, line: 125, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !58, line: 24, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !60, line: 43, baseType: !65)
!65 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !69, line: 57, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !69, line: 51, size: 32, elements: !71)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !70, file: !69, line: 52, baseType: !55, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_hdr", file: !75, line: 73, size: 160, elements: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip4.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !{!77, !78, !79, !84, !85, !86, !87, !88, !89, !94}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_v_hl", scope: !74, file: !75, line: 75, baseType: !62, size: 8)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_tos", scope: !74, file: !75, line: 77, baseType: !62, size: 8, offset: 8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_len", scope: !74, file: !75, line: 79, baseType: !80, size: 16, offset: 16)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !56, line: 127, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !58, line: 36, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !60, line: 57, baseType: !83)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_id", scope: !74, file: !75, line: 81, baseType: !80, size: 16, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 83, baseType: !80, size: 16, offset: 48)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ttl", scope: !74, file: !75, line: 89, baseType: !62, size: 8, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_proto", scope: !74, file: !75, line: 91, baseType: !62, size: 8, offset: 72)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chksum", scope: !74, file: !75, line: 93, baseType: !80, size: 16, offset: 80)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !74, file: !75, line: 95, baseType: !90, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_p_t", file: !75, line: 61, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr_packed", file: !75, line: 53, size: 32, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !91, file: !75, line: 54, baseType: !55, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !74, file: !75, line: 96, baseType: !90, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !56, line: 128, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !58, line: 32, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !60, line: 55, baseType: !100)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !{!102, !0, !104, !131}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "ip_id", scope: !2, file: !3, line: 107, type: !80, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "__str", scope: !106, file: !107, line: 198, type: !128, isLocal: true, isDefinition: true)
!106 = distinct !DISubprogram(name: "uk_pr_crit", scope: !107, file: !107, line: 194, type: !108, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !113)
!107 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, null}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !{!114, !115}
!114 = !DILocalVariable(name: "fmt", arg: 1, scope: !106, file: !107, line: 194, type: !110)
!115 = !DILocalVariable(name: "argp", scope: !106, file: !107, line: 196, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !117, line: 32, baseType: !118)
!117 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 192, elements: !126)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !120, file: !3, line: 196, baseType: !7, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !120, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !120, file: !3, line: 196, baseType: !61, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !120, file: !3, line: 196, baseType: !61, size: 64, offset: 128)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 8)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "__str", scope: !106, file: !107, line: 198, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 48, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 6)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !138)
!138 = !{!139, !140, !159, !160, !161, !165, !167, !169, !170, !192, !197, !202, !209, !214, !215, !216, !218, !219, !220, !221, !223, !224, !225, !229, !230, !231, !232}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !6, line: 263, baseType: !136, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !137, file: !6, line: 268, baseType: !141, size: 192, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !33, line: 76, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !33, line: 69, size: 192, elements: !143)
!143 = !{!144, !158}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !142, file: !33, line: 73, baseType: !145, size: 160)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !33, line: 70, size: 160, elements: !146)
!146 = !{!147, !157}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !145, file: !33, line: 71, baseType: !148, size: 160)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !149, line: 67, baseType: !150)
!149 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !149, line: 59, size: 160, elements: !151)
!151 = !{!152, !156}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !150, file: !149, line: 60, baseType: !153, size: 128)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 4)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !150, file: !149, line: 62, baseType: !62, size: 8, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !145, file: !33, line: 72, baseType: !68, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !33, line: 75, baseType: !62, size: 8, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !137, file: !6, line: 269, baseType: !141, size: 192, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !137, file: !6, line: 270, baseType: !141, size: 192, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !137, file: !6, line: 274, baseType: !162, size: 576, offset: 640)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 576, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 3)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !137, file: !6, line: 277, baseType: !166, size: 24, offset: 1216)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, elements: !163)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !137, file: !6, line: 282, baseType: !168, size: 96, offset: 1248)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 96, elements: !163)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !137, file: !6, line: 283, baseType: !168, size: 96, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !137, file: !6, line: 288, baseType: !171, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !180, !136}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !12, line: 96, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !56, line: 126, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !58, line: 20, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !60, line: 41, baseType: !179)
!179 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !182, line: 186, size: 192, elements: !183)
!182 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !182, line: 188, baseType: !180, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !181, file: !182, line: 191, baseType: !61, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !181, file: !182, line: 200, baseType: !80, size: 16, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !181, file: !182, line: 203, baseType: !80, size: 16, offset: 144)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !181, file: !182, line: 208, baseType: !62, size: 8, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !182, line: 211, baseType: !62, size: 8, offset: 168)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !181, file: !182, line: 218, baseType: !62, size: 8, offset: 176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !181, file: !182, line: 221, baseType: !62, size: 8, offset: 184)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !137, file: !6, line: 294, baseType: !193, size: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!175, !136, !180, !66}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !137, file: !6, line: 299, baseType: !198, size: 64, offset: 1600)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!175, !136, !180}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !137, file: !6, line: 305, baseType: !203, size: 64, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!175, !136, !180, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !137, file: !6, line: 310, baseType: !210, size: 64, offset: 1728)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !136}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !137, file: !6, line: 319, baseType: !210, size: 64, offset: 1792)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !137, file: !6, line: 323, baseType: !61, size: 64, offset: 1856)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !137, file: !6, line: 325, baseType: !217, size: 64, offset: 1920)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !126)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !137, file: !6, line: 332, baseType: !80, size: 16, offset: 1984)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !137, file: !6, line: 335, baseType: !80, size: 16, offset: 2000)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !137, file: !6, line: 338, baseType: !80, size: 16, offset: 2016)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !137, file: !6, line: 341, baseType: !222, size: 48, offset: 2032)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 48, elements: !134)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !137, file: !6, line: 343, baseType: !62, size: 8, offset: 2080)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !6, line: 345, baseType: !62, size: 8, offset: 2088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !6, line: 347, baseType: !226, size: 16, offset: 2096)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 16, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 2)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !137, file: !6, line: 350, baseType: !62, size: 8, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !137, file: !6, line: 353, baseType: !62, size: 8, offset: 2120)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !137, file: !6, line: 357, baseType: !62, size: 8, offset: 2128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !137, file: !6, line: 377, baseType: !233, size: 64, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!175, !136, !207, !5}
!237 = !{i32 2, !"Dwarf Version", i32 4}
!238 = !{i32 2, !"Debug Info Version", i32 3}
!239 = !{i32 1, !"wchar_size", i32 4}
!240 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!241 = distinct !DISubprogram(name: "ip4_set_default_multicast_netif", scope: !3, file: !3, line: 117, type: !212, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !242)
!242 = !{!243}
!243 = !DILocalVariable(name: "default_multicast_netif", arg: 1, scope: !241, file: !3, line: 117, type: !136)
!244 = !DILocation(line: 117, column: 47, scope: !241)
!245 = !DILocation(line: 119, column: 31, scope: !241)
!246 = !{!247, !247, i64 0}
!247 = !{!"any pointer", !248, i64 0}
!248 = !{!"omnipotent char", !249, i64 0}
!249 = !{!"Simple C/C++ TBAA"}
!250 = !DILocation(line: 120, column: 1, scope: !241)
!251 = distinct !DISubprogram(name: "ip4_route", scope: !3, file: !3, line: 152, type: !252, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{!136, !66}
!254 = !{!255, !256}
!255 = !DILocalVariable(name: "dest", arg: 1, scope: !251, file: !3, line: 152, type: !66)
!256 = !DILocalVariable(name: "netif", scope: !251, file: !3, line: 155, type: !136)
!257 = !DILocation(line: 152, column: 29, scope: !251)
!258 = !DILocation(line: 161, column: 7, scope: !259)
!259 = distinct !DILexicalBlock(scope: !251, file: !3, line: 161, column: 7)
!260 = !{!261, !262, i64 0}
!261 = !{!"ip4_addr", !262, i64 0}
!262 = !{!"int", !248, i64 0}
!263 = !DILocation(line: 161, column: 37, scope: !259)
!264 = !DILocation(line: 161, column: 34, scope: !259)
!265 = !DILocation(line: 170, column: 3, scope: !266)
!266 = distinct !DILexicalBlock(scope: !251, file: !3, line: 170, column: 3)
!267 = !DILocation(line: 155, column: 17, scope: !251)
!268 = !DILocation(line: 170, column: 3, scope: !269)
!269 = distinct !DILexicalBlock(scope: !266, file: !3, line: 170, column: 3)
!270 = !DILocation(line: 172, column: 9, scope: !271)
!271 = distinct !DILexicalBlock(scope: !272, file: !3, line: 172, column: 9)
!272 = distinct !DILexicalBlock(scope: !269, file: !3, line: 170, column: 24)
!273 = !{!274, !248, i64 261}
!274 = !{!"netif", !247, i64 0, !275, i64 8, !275, i64 32, !275, i64 56, !248, i64 80, !248, i64 152, !248, i64 156, !248, i64 168, !247, i64 184, !247, i64 192, !247, i64 200, !247, i64 208, !247, i64 216, !247, i64 224, !247, i64 232, !248, i64 240, !276, i64 248, !276, i64 250, !276, i64 252, !248, i64 254, !248, i64 260, !248, i64 261, !248, i64 262, !248, i64 264, !248, i64 265, !248, i64 266, !247, i64 272}
!275 = !{!"ip_addr", !248, i64 0, !248, i64 20}
!276 = !{!"short", !248, i64 0}
!277 = !DILocation(line: 172, column: 28, scope: !271)
!278 = !DILocation(line: 172, column: 31, scope: !271)
!279 = !DILocation(line: 172, column: 55, scope: !271)
!280 = !DILocation(line: 172, column: 59, scope: !271)
!281 = !{!248, !248, i64 0}
!282 = !DILocation(line: 172, column: 9, scope: !272)
!283 = !DILocation(line: 174, column: 11, scope: !284)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 174, column: 11)
!285 = distinct !DILexicalBlock(scope: !271, file: !3, line: 172, column: 103)
!286 = !DILocation(line: 174, column: 11, scope: !285)
!287 = !DILocation(line: 179, column: 26, scope: !288)
!288 = distinct !DILexicalBlock(scope: !285, file: !3, line: 179, column: 11)
!289 = !DILocation(line: 179, column: 50, scope: !288)
!290 = !DILocation(line: 179, column: 56, scope: !288)
