; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/ip6_frag.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/ip6_frag.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ip6_reassdata = type { %struct.ip6_reassdata*, %struct.pbuf*, %struct.ip6_hdr*, %struct.ip6_addr_packed, %struct.ip6_addr_packed, [16 x i8], i32, i16, i8, i8, i8, i8 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip6_hdr = type { i32, i16, i8, i8, %struct.ip6_addr_packed, %struct.ip6_addr_packed }
%struct.ip6_addr_packed = type { [4 x i32] }
%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!18 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!27 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!28 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!29 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!30 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!31 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!32 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!33 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !35, line: 156, baseType: !7, size: 32, elements: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 89, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!43 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!44 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!45 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 145, baseType: !7, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!50 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!52 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 53, baseType: !55, size: 32, elements: !56)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!57 = !DIEnumerator(name: "ERR_OK", value: 0)
!58 = !DIEnumerator(name: "ERR_MEM", value: -1)
!59 = !DIEnumerator(name: "ERR_BUF", value: -2)
!60 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!61 = !DIEnumerator(name: "ERR_RTE", value: -4)
!62 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!63 = !DIEnumerator(name: "ERR_VAL", value: -6)
!64 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!65 = !DIEnumerator(name: "ERR_USE", value: -8)
!66 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!67 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!68 = !DIEnumerator(name: "ERR_CONN", value: -11)
!69 = !DIEnumerator(name: "ERR_IF", value: -12)
!70 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!71 = !DIEnumerator(name: "ERR_RST", value: -14)
!72 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!73 = !DIEnumerator(name: "ERR_ARG", value: -16)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_te_code", file: !75, line: 116, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/icmp6.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !{!77, !78}
!77 = !DIEnumerator(name: "ICMP6_TE_HL", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "ICMP6_TE_FRAG", value: 1, isUnsigned: true)
!79 = !{!80, !81, !103, !120, !121, !95, !123, !154, !158, !164, !141, !169}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_frag_hdr", file: !83, line: 211, size: 64, elements: !84)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !{!85, !93, !94, !99}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !82, file: !83, line: 213, baseType: !86, size: 8)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !87, line: 125, baseType: !88)
!87 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !89, line: 24, baseType: !90)
!89 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !91, line: 43, baseType: !92)
!91 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!92 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !82, file: !83, line: 215, baseType: !86, size: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fragment_offset", scope: !82, file: !83, line: 217, baseType: !95, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !87, line: 127, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !89, line: 36, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !91, line: 57, baseType: !98)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_identification", scope: !82, file: !83, line: 219, baseType: !100, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !87, line: 129, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !89, line: 48, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !91, line: 79, baseType: !7)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !83, line: 80, size: 320, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !119}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_v_tc_fl", scope: !105, file: !83, line: 82, baseType: !100, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_plen", scope: !105, file: !83, line: 84, baseType: !95, size: 16, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !105, file: !83, line: 86, baseType: !86, size: 8, offset: 48)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_hoplim", scope: !105, file: !83, line: 88, baseType: !86, size: 8, offset: 56)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !105, file: !83, line: 90, baseType: !112, size: 128, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !83, line: 60, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !83, line: 53, size: 128, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !113, file: !83, line: 54, baseType: !116, size: 128)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 4)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !105, file: !83, line: 91, baseType: !112, size: 128, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_reassdata", file: !125, line: 90, size: 704, elements: !126)
!125 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_frag.h", directory: "/root/.unikraft/apps/redis/build")
!126 = !{!127, !128, !140, !142, !143, !144, !148, !149, !150, !151, !152, !153}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !125, line: 91, baseType: !123, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !124, file: !125, line: 92, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !40, line: 186, size: 192, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !40, line: 188, baseType: !129, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !130, file: !40, line: 191, baseType: !80, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !130, file: !40, line: 200, baseType: !95, size: 16, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !130, file: !40, line: 203, baseType: !95, size: 16, offset: 144)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !130, file: !40, line: 208, baseType: !86, size: 8, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !40, line: 211, baseType: !86, size: 8, offset: 168)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !130, file: !40, line: 218, baseType: !86, size: 8, offset: 176)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !130, file: !40, line: 221, baseType: !86, size: 8, offset: 184)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "iphdr", scope: !124, file: !125, line: 93, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !124, file: !125, line: 95, baseType: !112, size: 128, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !124, file: !125, line: 96, baseType: !112, size: 128, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "orig_hdr", scope: !124, file: !125, line: 99, baseType: !145, size: 128, offset: 448)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "identification", scope: !124, file: !125, line: 104, baseType: !100, size: 32, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "datagram_len", scope: !124, file: !125, line: 105, baseType: !95, size: 16, offset: 608)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nexth", scope: !124, file: !125, line: 106, baseType: !86, size: 8, offset: 624)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !124, file: !125, line: 107, baseType: !86, size: 8, offset: 632)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "src_zone", scope: !124, file: !125, line: 109, baseType: !86, size: 8, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dest_zone", scope: !124, file: !125, line: 110, baseType: !86, size: 8, offset: 648)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !87, line: 128, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !89, line: 32, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !91, line: 55, baseType: !157)
!157 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_reass_helper", file: !3, line: 92, size: 96, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next_pbuf", scope: !159, file: !3, line: 93, baseType: !129, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !159, file: !3, line: 94, baseType: !95, size: 16, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !159, file: !3, line: 95, baseType: !95, size: 16, offset: 80)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 40, baseType: !166)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !167, line: 129, baseType: !168)
!167 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!168 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf_custom_ref", file: !125, line: 127, size: 320, elements: !171)
!171 = !{!172, !181}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !170, file: !125, line: 129, baseType: !173, size: 256)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf_custom", file: !40, line: 242, size: 256, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf", scope: !173, file: !40, line: 244, baseType: !130, size: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "custom_free_function", scope: !173, file: !40, line: 246, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "pbuf_free_custom_fn", file: !40, line: 239, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !129}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !170, file: !125, line: 131, baseType: !129, size: 64, offset: 256)
!182 = !{!183, !0, !309, !311, !335}
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "identification", scope: !185, file: !3, line: 731, type: !100, isLocal: true, isDefinition: true)
!185 = distinct !DISubprogram(name: "ip6_frag", scope: !3, file: !3, line: 720, type: !186, isLocal: false, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !287)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !129, !193, !252}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !54, line: 96, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !87, line: 126, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !89, line: 20, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !91, line: 41, baseType: !192)
!192 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !35, line: 260, size: 2240, elements: !195)
!195 = !{!196, !197, !219, !220, !221, !225, !227, !229, !230, !235, !242, !247, !254, !259, !260, !261, !265, !266, !267, !268, !272, !273, !274, !279, !280, !281, !282}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !35, line: 263, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !194, file: !35, line: 268, baseType: !198, size: 192, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !199, line: 76, baseType: !200)
!199 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !199, line: 69, size: 192, elements: !201)
!201 = !{!202, !218}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !200, file: !199, line: 73, baseType: !203, size: 160)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !200, file: !199, line: 70, size: 160, elements: !204)
!204 = !{!205, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !203, file: !199, line: 71, baseType: !206, size: 160)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !207, line: 67, baseType: !208)
!207 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !207, line: 59, size: 160, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !208, file: !207, line: 60, baseType: !116, size: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !208, file: !207, line: 62, baseType: !86, size: 8, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !203, file: !199, line: 72, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !214, line: 57, baseType: !215)
!214 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !214, line: 51, size: 32, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !215, file: !214, line: 52, baseType: !100, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !199, line: 75, baseType: !86, size: 8, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !194, file: !35, line: 269, baseType: !198, size: 192, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !194, file: !35, line: 270, baseType: !198, size: 192, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !194, file: !35, line: 274, baseType: !222, size: 576, offset: 640)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 576, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 3)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !194, file: !35, line: 277, baseType: !226, size: 24, offset: 1216)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 24, elements: !223)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !194, file: !35, line: 282, baseType: !228, size: 96, offset: 1248)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 96, elements: !223)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !194, file: !35, line: 283, baseType: !228, size: 96, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !194, file: !35, line: 288, baseType: !231, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !35, line: 178, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!188, !129, !193}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !194, file: !35, line: 294, baseType: !236, size: 64, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !35, line: 189, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!188, !193, !129, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !194, file: !35, line: 299, baseType: !243, size: 64, offset: 1600)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !35, line: 212, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!188, !193, !129}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !194, file: !35, line: 305, baseType: !248, size: 64, offset: 1664)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !35, line: 202, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!188, !193, !129, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !194, file: !35, line: 310, baseType: !255, size: 64, offset: 1728)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !35, line: 214, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !193}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !194, file: !35, line: 319, baseType: !255, size: 64, offset: 1792)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !35, line: 323, baseType: !80, size: 64, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !194, file: !35, line: 325, baseType: !262, size: 64, offset: 1920)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 1)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !194, file: !35, line: 332, baseType: !95, size: 16, offset: 1984)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !194, file: !35, line: 335, baseType: !95, size: 16, offset: 2000)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !194, file: !35, line: 338, baseType: !95, size: 16, offset: 2016)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !194, file: !35, line: 341, baseType: !269, size: 48, offset: 2032)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 48, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 6)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !194, file: !35, line: 343, baseType: !86, size: 8, offset: 2080)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !35, line: 345, baseType: !86, size: 8, offset: 2088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !35, line: 347, baseType: !275, size: 16, offset: 2096)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 16, elements: !277)
!276 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !194, file: !35, line: 350, baseType: !86, size: 8, offset: 2112)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !194, file: !35, line: 353, baseType: !86, size: 8, offset: 2120)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !194, file: !35, line: 357, baseType: !86, size: 8, offset: 2128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !194, file: !35, line: 377, baseType: !283, size: 64, offset: 2176)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !35, line: 222, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!188, !193, !252, !34}
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !302, !303, !304, !305, !306}
!288 = !DILocalVariable(name: "p", arg: 1, scope: !185, file: !3, line: 720, type: !129)
!289 = !DILocalVariable(name: "netif", arg: 2, scope: !185, file: !3, line: 720, type: !193)
!290 = !DILocalVariable(name: "dest", arg: 3, scope: !185, file: !3, line: 720, type: !252)
!291 = !DILocalVariable(name: "original_ip6hdr", scope: !185, file: !3, line: 722, type: !141)
!292 = !DILocalVariable(name: "ip6hdr", scope: !185, file: !3, line: 723, type: !141)
!293 = !DILocalVariable(name: "frag_hdr", scope: !185, file: !3, line: 724, type: !81)
!294 = !DILocalVariable(name: "rambuf", scope: !185, file: !3, line: 725, type: !129)
!295 = !DILocalVariable(name: "newpbuf", scope: !185, file: !3, line: 727, type: !129)
!296 = !DILocalVariable(name: "newpbuflen", scope: !185, file: !3, line: 728, type: !95)
!297 = !DILocalVariable(name: "left_to_copy", scope: !185, file: !3, line: 729, type: !95)
!298 = !DILocalVariable(name: "left", scope: !185, file: !3, line: 732, type: !95)
!299 = !DILocalVariable(name: "cop", scope: !185, file: !3, line: 732, type: !95)
!300 = !DILocalVariable(name: "mtu", scope: !185, file: !3, line: 733, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!302 = !DILocalVariable(name: "nfb", scope: !185, file: !3, line: 734, type: !301)
!303 = !DILocalVariable(name: "fragment_offset", scope: !185, file: !3, line: 735, type: !95)
!304 = !DILocalVariable(name: "last", scope: !185, file: !3, line: 736, type: !95)
!305 = !DILocalVariable(name: "poff", scope: !185, file: !3, line: 737, type: !95)
!306 = !DILocalVariable(name: "pcr", scope: !307, file: !3, line: 796, type: !169)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 795, column: 26)
!308 = distinct !DILexicalBlock(scope: !185, file: !3, line: 747, column: 16)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "ip6_reass_pbufcount", scope: !2, file: !3, line: 104, type: !95, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "__str", scope: !313, file: !314, line: 198, type: !332, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "uk_pr_crit", scope: !314, file: !314, line: 194, type: !315, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !319)
!314 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!315 = !DISubroutineType(types: !316)
!316 = !{null, !317, null}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!319 = !{!320, !321}
!320 = !DILocalVariable(name: "fmt", arg: 1, scope: !313, file: !314, line: 194, type: !317)
!321 = !DILocalVariable(name: "argp", scope: !313, file: !314, line: 196, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !323, line: 32, baseType: !324)
!323 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !325)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 192, elements: !263)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !326, file: !3, line: 196, baseType: !7, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !326, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !326, file: !3, line: 196, baseType: !80, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !326, file: !3, line: 196, baseType: !80, size: 64, offset: 128)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 8)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "__str", scope: !313, file: !314, line: 198, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 88, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 11)
!340 = !{i32 2, !"Dwarf Version", i32 4}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = !{i32 1, !"wchar_size", i32 4}
!343 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!344 = distinct !DISubprogram(name: "ip6_reass_tmr", scope: !3, file: !3, line: 113, type: !345, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{null}
!347 = !{!348, !349}
!348 = !DILocalVariable(name: "r", scope: !344, file: !3, line: 115, type: !123)
!349 = !DILocalVariable(name: "tmp", scope: !344, file: !3, line: 115, type: !123)
!350 = !DILocation(line: 122, column: 7, scope: !344)
!351 = !{!352, !352, i64 0}
!352 = !{!"any pointer", !353, i64 0}
!353 = !{!"omnipotent char", !354, i64 0}
!354 = !{!"Simple C/C++ TBAA"}
!355 = !DILocation(line: 115, column: 25, scope: !344)
!356 = !DILocation(line: 123, column: 3, scope: !344)
!357 = !DILocation(line: 123, column: 12, scope: !344)
!358 = !DILocation(line: 126, column: 12, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 126, column: 9)
!360 = distinct !DILexicalBlock(scope: !344, file: !3, line: 123, column: 21)
!361 = !{!362, !353, i64 79}
!362 = !{!"ip6_reassdata", !352, i64 0, !352, i64 8, !352, i64 16, !363, i64 24, !363, i64 40, !353, i64 56, !364, i64 72, !365, i64 76, !353, i64 78, !353, i64 79, !353, i64 80, !353, i64 81}
!363 = !{!"ip6_addr_packed", !353, i64 0}
!364 = !{!"int", !353, i64 0}
!365 = !{!"short", !353, i64 0}
!366 = !DILocation(line: 126, column: 18, scope: !359)
!367 = !DILocation(line: 126, column: 9, scope: !360)
!368 = !DILocation(line: 127, column: 15, scope: !369)
!369 = distinct !DILexicalBlock(scope: !359, file: !3, line: 126, column: 23)
!370 = !DILocation(line: 128, column: 14, scope: !369)
!371 = !{!362, !352, i64 0}
!372 = !DILocation(line: 129, column: 5, scope: !369)
!373 = !DILocation(line: 115, column: 29, scope: !344)
!374 = !DILocation(line: 133, column: 14, scope: !375)
!375 = distinct !DILexicalBlock(scope: !359, file: !3, line: 129, column: 12)
!376 = !DILocation(line: 135, column: 7, scope: !375)
!377 = !DILocation(line: 0, scope: !375)
!378 = distinct !{!378, !356, !379}
!379 = !DILocation(line: 137, column: 4, scope: !344)
!380 = !DILocation(line: 138, column: 1, scope: !344)
!381 = distinct !DISubprogram(name: "ip6_reass_free_complete_datagram", scope: !3, file: !3, line: 148, type: !382, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !123}
!384 = !{!385, !386, !387, !388, !389, !390, !391, !396, !397}
!385 = !DILocalVariable(name: "ipr", arg: 1, scope: !381, file: !3, line: 148, type: !123)
!386 = !DILocalVariable(name: "prev", scope: !381, file: !3, line: 150, type: !123)
!387 = !DILocalVariable(name: "pbufs_freed", scope: !381, file: !3, line: 151, type: !95)
!388 = !DILocalVariable(name: "clen", scope: !381, file: !3, line: 152, type: !95)
!389 = !DILocalVariable(name: "p", scope: !381, file: !3, line: 153, type: !129)
!390 = !DILocalVariable(name: "iprh", scope: !381, file: !3, line: 154, type: !158)
!391 = !DILocalVariable(name: "src_addr", scope: !392, file: !3, line: 174, type: !206)
!392 = distinct !DILexicalBlock(scope: !393, file: !3, line: 171, column: 10)
