; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.dictType = type { i64 (i8*)*, i8* (i8*, i8*)*, i8* (i8*, i8*)*, i32 (i8*, i8*, i8*)*, void (i8*, i8*)*, void (i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "latencyTimeSeriesDictType", scope: !2, file: !3, line: 50, type: !61, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !60)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !12, !13, !14, !15, !17, !31, !41, !51}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 56, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 103, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!14 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !19, line: 51, size: 24, elements: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !{!21, !25, !26, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !18, file: !19, line: 52, baseType: !22, size: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 43, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !18, file: !19, line: 53, baseType: !22, size: 8, offset: 8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 54, baseType: !24, size: 8, offset: 16)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !18, file: !19, line: 55, baseType: !28, offset: 24)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: -1)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !19, line: 57, size: 40, elements: !33)
!33 = !{!34, !38, !39, !40}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, file: !19, line: 58, baseType: !35, size: 16)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 36, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 57, baseType: !37)
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !32, file: !19, line: 59, baseType: !35, size: 16, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !19, line: 60, baseType: !24, size: 8, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !32, file: !19, line: 61, baseType: !28, offset: 40)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !19, line: 63, size: 72, elements: !43)
!43 = !{!44, !48, !49, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, file: !19, line: 64, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 48, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 79, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !42, file: !19, line: 65, baseType: !45, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !19, line: 66, baseType: !24, size: 8, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !42, file: !19, line: 67, baseType: !28, offset: 72)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !19, line: 69, size: 136, elements: !53)
!53 = !{!54, !57, !58, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, file: !19, line: 70, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 60, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 105, baseType: !12)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !52, file: !19, line: 71, baseType: !55, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !19, line: 72, baseType: !24, size: 8, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !52, file: !19, line: 73, baseType: !28, offset: 136)
!60 = !{!0}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !62, line: 65, baseType: !63)
!62 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !62, line: 58, size: 384, elements: !64)
!64 = !{!65, !71, !75, !76, !81, !85}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !63, file: !62, line: 59, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!55, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !63, file: !62, line: 60, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!6, !6, !69}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !63, file: !62, line: 61, baseType: !72, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !63, file: !62, line: 62, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !6, !69, !69}
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !63, file: !62, line: 63, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !6, !6}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !63, file: !62, line: 64, baseType: !82, size: 64, offset: 320)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!90 = distinct !DISubprogram(name: "dictStringKeyCompare", scope: !3, file: !3, line: 39, type: !78, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !91)
!91 = !{!92, !93, !94}
!92 = !DILocalVariable(name: "privdata", arg: 1, scope: !90, file: !3, line: 39, type: !6)
!93 = !DILocalVariable(name: "key1", arg: 2, scope: !90, file: !3, line: 39, type: !69)
!94 = !DILocalVariable(name: "key2", arg: 3, scope: !90, file: !3, line: 39, type: !69)
!95 = !DILocation(line: 39, column: 32, scope: !90)
!96 = !DILocation(line: 39, column: 54, scope: !90)
!97 = !DILocation(line: 39, column: 72, scope: !90)
!98 = !DILocation(line: 41, column: 12, scope: !90)
!99 = !DILocation(line: 41, column: 30, scope: !90)
!100 = !DILocation(line: 41, column: 5, scope: !90)
!101 = distinct !DISubprogram(name: "dictStringHash", scope: !3, file: !3, line: 44, type: !67, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !102)
!102 = !{!103}
!103 = !DILocalVariable(name: "key", arg: 1, scope: !101, file: !3, line: 44, type: !69)
!104 = !DILocation(line: 44, column: 37, scope: !101)
!105 = !DILocation(line: 45, column: 37, scope: !101)
!106 = !DILocation(line: 45, column: 12, scope: !101)
!107 = !DILocation(line: 45, column: 5, scope: !101)
!108 = distinct !DISubprogram(name: "THPGetAnonHugePagesSize", scope: !3, file: !3, line: 81, type: !109, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!109 = !DISubroutineType(types: !110)
!110 = !{!80}
!111 = !DILocation(line: 82, column: 12, scope: !108)
!112 = !DILocation(line: 82, column: 5, scope: !108)
!113 = distinct !DISubprogram(name: "latencyMonitorInit", scope: !3, file: !3, line: 90, type: !114, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!114 = !DISubroutineType(types: !115)
!115 = !{null}
!116 = !DILocation(line: 91, column: 29, scope: !113)
!117 = !DILocation(line: 91, column: 27, scope: !113)
!118 = !{!119, !123, i64 3104}
!119 = !{!"redisServer", !120, i64 0, !123, i64 8, !123, i64 16, !123, i64 24, !120, i64 32, !120, i64 36, !120, i64 40, !123, i64 48, !123, i64 56, !123, i64 64, !123, i64 72, !120, i64 80, !120, i64 84, !120, i64 88, !120, i64 92, !123, i64 96, !123, i64 104, !120, i64 112, !120, i64 116, !121, i64 120, !120, i64 164, !124, i64 168, !120, i64 176, !123, i64 184, !123, i64 192, !123, i64 200, !121, i64 208, !120, i64 216, !120, i64 220, !121, i64 224, !120, i64 352, !123, i64 360, !120, i64 368, !121, i64 372, !120, i64 436, !120, i64 440, !121, i64 444, !120, i64 508, !123, i64 512, !123, i64 520, !123, i64 528, !123, i64 536, !123, i64 544, !123, i64 552, !123, i64 560, !120, i64 568, !125, i64 576, !121, i64 584, !123, i64 840, !124, i64 848, !120, i64 856, !120, i64 860, !124, i64 864, !124, i64 872, !124, i64 880, !124, i64 888, !123, i64 896, !123, i64 904, !123, i64 912, !123, i64 920, !123, i64 928, !123, i64 936, !123, i64 944, !123, i64 952, !123, i64 960, !123, i64 968, !123, i64 976, !123, i64 984, !123, i64 992, !124, i64 1000, !125, i64 1008, !125, i64 1016, !125, i64 1024, !126, i64 1032, !125, i64 1040, !125, i64 1048, !125, i64 1056, !125, i64 1064, !125, i64 1072, !125, i64 1080, !125, i64 1088, !125, i64 1096, !125, i64 1104, !124, i64 1112, !125, i64 1120, !126, i64 1128, !125, i64 1136, !125, i64 1144, !125, i64 1152, !125, i64 1160, !123, i64 1168, !125, i64 1176, !125, i64 1184, !124, i64 1192, !127, i64 1200, !125, i64 1240, !125, i64 1248, !124, i64 1256, !124, i64 1264, !121, i64 1272, !120, i64 1728, !120, i64 1732, !120, i64 1736, !120, i64 1740, !120, i64 1744, !124, i64 1752, !120, i64 1760, !120, i64 1764, !120, i64 1768, !120, i64 1772, !124, i64 1776, !124, i64 1784, !120, i64 1792, !120, i64 1796, !120, i64 1800, !120, i64 1804, !121, i64 1808, !120, i64 1880, !120, i64 1884, !123, i64 1888, !120, i64 1896, !120, i64 1900, !124, i64 1904, !124, i64 1912, !124, i64 1920, !124, i64 1928, !120, i64 1936, !120, i64 1940, !123, i64 1944, !123, i64 1952, !120, i64 1960, !120, i64 1964, !124, i64 1968, !124, i64 1976, !124, i64 1984, !124, i64 1992, !120, i64 2000, !124, i64 2008, !120, i64 2016, !120, i64 2020, !120, i64 2024, !120, i64 2028, !120, i64 2032, !120, i64 2036, !120, i64 2040, !120, i64 2044, !120, i64 2048, !120, i64 2052, !120, i64 2056, !120, i64 2060, !120, i64 2064, !123, i64 2072, !125, i64 2080, !125, i64 2088, !120, i64 2096, !123, i64 2104, !120, i64 2112, !123, i64 2120, !120, i64 2128, !120, i64 2132, !124, i64 2136, !124, i64 2144, !124, i64 2152, !124, i64 2160, !120, i64 2168, !120, i64 2172, !120, i64 2176, !120, i64 2180, !120, i64 2184, !120, i64 2188, !121, i64 2192, !128, i64 2200, !129, i64 2224, !123, i64 2240, !120, i64 2248, !123, i64 2256, !120, i64 2264, !121, i64 2268, !121, i64 2309, !125, i64 2352, !125, i64 2360, !120, i64 2368, !120, i64 2372, !123, i64 2376, !125, i64 2384, !125, i64 2392, !125, i64 2400, !125, i64 2408, !124, i64 2416, !124, i64 2424, !120, i64 2432, !120, i64 2436, !120, i64 2440, !120, i64 2444, !120, i64 2448, !123, i64 2456, !123, i64 2464, !120, i64 2472, !120, i64 2476, !123, i64 2480, !123, i64 2488, !120, i64 2496, !120, i64 2500, !124, i64 2504, !124, i64 2512, !124, i64 2520, !120, i64 2528, !120, i64 2532, !123, i64 2536, !124, i64 2544, !120, i64 2552, !120, i64 2556, !120, i64 2560, !124, i64 2568, !120, i64 2576, !120, i64 2580, !120, i64 2584, !123, i64 2592, !121, i64 2600, !125, i64 2648, !120, i64 2656, !123, i64 2664, !123, i64 2672, !120, i64 2680, !123, i64 2688, !120, i64 2696, !120, i64 2700, !125, i64 2704, !120, i64 2712, !120, i64 2716, !120, i64 2720, !120, i64 2724, !125, i64 2728, !120, i64 2736, !121, i64 2740, !123, i64 2768, !123, i64 2776, !120, i64 2784, !120, i64 2788, !120, i64 2792, !120, i64 2796, !124, i64 2800, !124, i64 2808, !124, i64 2816, !124, i64 2824, !124, i64 2832, !124, i64 2840, !124, i64 2848, !124, i64 2856, !120, i64 2864, !120, i64 2868, !124, i64 2872, !124, i64 2880, !120, i64 2888, !125, i64 2896, !123, i64 2904, !123, i64 2912, !120, i64 2920, !120, i64 2924, !125, i64 2928, !123, i64 2936, !123, i64 2944, !120, i64 2952, !120, i64 2956, !120, i64 2960, !120, i64 2964, !123, i64 2968, !120, i64 2976, !120, i64 2980, !120, i64 2984, !123, i64 2992, !123, i64 3000, !123, i64 3008, !123, i64 3016, !125, i64 3024, !125, i64 3032, !125, i64 3040, !120, i64 3048, !120, i64 3052, !120, i64 3056, !120, i64 3060, !120, i64 3064, !120, i64 3068, !120, i64 3072, !120, i64 3076, !120, i64 3080, !120, i64 3084, !120, i64 3088, !125, i64 3096, !123, i64 3104, !123, i64 3112, !123, i64 3120, !120, i64 3128, !120, i64 3132, !120, i64 3136, !124, i64 3144, !123, i64 3152, !123, i64 3160, !123, i64 3168}
!120 = !{!"int", !121, i64 0}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C/C++ TBAA"}
!123 = !{!"any pointer", !121, i64 0}
!124 = !{!"long", !121, i64 0}
!125 = !{!"long long", !121, i64 0}
!126 = !{!"double", !121, i64 0}
!127 = !{!"malloc_stats", !124, i64 0, !124, i64 8, !124, i64 16, !124, i64 24, !124, i64 32}
!128 = !{!"", !120, i64 0, !124, i64 8, !125, i64 16}
!129 = !{!"redisOpArray", !123, i64 0, !120, i64 8}
!130 = !DILocation(line: 92, column: 1, scope: !113)
!131 = distinct !DISubprogram(name: "latencyAddSample", scope: !3, file: !3, line: 98, type: !132, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !137)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !15, !134}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !135, line: 52, baseType: !136)
!135 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!136 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!137 = !{!138, !139, !140, !157, !160}
!138 = !DILocalVariable(name: "event", arg: 1, scope: !131, file: !3, line: 98, type: !15)
!139 = !DILocalVariable(name: "latency", arg: 2, scope: !131, file: !3, line: 98, type: !134)
!140 = !DILocalVariable(name: "ts", scope: !131, file: !3, line: 99, type: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latencyTimeSeries", file: !143, line: 47, size: 10304, elements: !144)
!143 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.h", directory: "/root/.unikraft/apps/redis/build")
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !142, file: !143, line: 48, baseType: !80, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !142, file: !143, line: 49, baseType: !45, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !142, file: !143, line: 50, baseType: !148, size: 10240, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 10240, elements: !155)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latencySample", file: !143, line: 41, size: 64, elements: !150)
!150 = !{!151, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !149, file: !143, line: 42, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 44, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !10, line: 77, baseType: !80)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !149, file: !143, line: 43, baseType: !45, size: 32, offset: 32)
!155 = !{!156}
!156 = !DISubrange(count: 160)
!157 = !DILocalVariable(name: "now", scope: !131, file: !3, line: 100, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !159, line: 34, baseType: !11)
!159 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!160 = !DILocalVariable(name: "prev", scope: !131, file: !3, line: 101, type: !80)
!161 = !DILocation(line: 98, column: 29, scope: !131)
!162 = !DILocation(line: 98, column: 45, scope: !131)
!163 = !DILocation(line: 99, column: 58, scope: !131)
!164 = !DILocation(line: 99, column: 36, scope: !131)
!165 = !DILocation(line: 99, column: 31, scope: !131)
!166 = !DILocation(line: 100, column: 18, scope: !131)
!167 = !DILocation(line: 100, column: 12, scope: !131)
!168 = !DILocation(line: 104, column: 12, scope: !169)
!169 = distinct !DILexicalBlock(scope: !131, file: !3, line: 104, column: 9)
!170 = !DILocation(line: 104, column: 9, scope: !131)
!171 = !DILocation(line: 112, column: 23, scope: !172)
!172 = distinct !DILexicalBlock(scope: !131, file: !3, line: 112, column: 9)
!173 = !DILocation(line: 105, column: 14, scope: !174)
!174 = distinct !DILexicalBlock(scope: !169, file: !3, line: 104, column: 21)
!175 = !DILocation(line: 106, column: 13, scope: !174)
!176 = !DILocation(line: 106, column: 17, scope: !174)
!177 = !{!178, !120, i64 0}
!178 = !{!"latencyTimeSeries", !120, i64 0, !120, i64 4, !121, i64 8}
!179 = !DILocation(line: 107, column: 13, scope: !174)
!180 = !DILocation(line: 107, column: 17, scope: !174)
!181 = !{!178, !120, i64 4}
!182 = !DILocation(line: 108, column: 20, scope: !174)
!183 = !DILocation(line: 108, column: 9, scope: !174)
!184 = !DILocation(line: 109, column: 24, scope: !174)
!185 = !DILocation(line: 109, column: 39, scope: !174)
!186 = !DILocation(line: 109, column: 9, scope: !174)
!187 = !DILocation(line: 110, column: 5, scope: !174)
!188 = !DILocation(line: 0, scope: !131)
!189 = !DILocation(line: 112, column: 19, scope: !172)
!190 = !DILocation(line: 112, column: 17, scope: !172)
!191 = !DILocation(line: 112, column: 9, scope: !131)
!192 = !DILocation(line: 112, column: 38, scope: !172)
!193 = !DILocation(line: 112, column: 36, scope: !172)
!194 = !DILocation(line: 112, column: 28, scope: !172)
!195 = !DILocation(line: 116, column: 17, scope: !131)
!196 = !DILocation(line: 116, column: 38, scope: !131)
!197 = !DILocation(line: 116, column: 43, scope: !131)
!198 = !DILocation(line: 101, column: 9, scope: !131)
!199 = !DILocation(line: 117, column: 9, scope: !200)
!200 = distinct !DILexicalBlock(scope: !131, file: !3, line: 117, column: 9)
!201 = !DILocation(line: 117, column: 27, scope: !200)
!202 = !{!203, !120, i64 0}
!203 = !{!"latencySample", !120, i64 0, !120, i64 4}
!204 = !DILocation(line: 117, column: 32, scope: !200)
!205 = !DILocation(line: 117, column: 9, scope: !131)
!206 = !DILocation(line: 118, column: 41, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 118, column: 13)
!208 = distinct !DILexicalBlock(scope: !200, file: !3, line: 117, column: 40)
!209 = !{!203, !120, i64 4}
!210 = !DILocation(line: 118, column: 23, scope: !207)
!211 = !DILocation(line: 118, column: 21, scope: !207)
!212 = !DILocation(line: 118, column: 13, scope: !208)
!213 = !DILocation(line: 119, column: 41, scope: !207)
!214 = !DILocation(line: 119, column: 39, scope: !207)
!215 = !DILocation(line: 119, column: 13, scope: !207)
!216 = !DILocation(line: 123, column: 33, scope: !131)
!217 = !DILocation(line: 123, column: 21, scope: !131)
!218 = !DILocation(line: 123, column: 5, scope: !131)
!219 = !DILocation(line: 123, column: 26, scope: !131)
!220 = !DILocation(line: 123, column: 31, scope: !131)
!221 = !DILocation(line: 124, column: 36, scope: !131)
!222 = !DILocation(line: 124, column: 26, scope: !131)
!223 = !DILocation(line: 124, column: 34, scope: !131)
!224 = !DILocation(line: 126, column: 12, scope: !131)
!225 = !DILocation(line: 127, column: 17, scope: !226)
!226 = distinct !DILexicalBlock(scope: !131, file: !3, line: 127, column: 9)
!227 = !DILocation(line: 127, column: 9, scope: !131)
!228 = !DILocation(line: 127, column: 44, scope: !226)
!229 = !DILocation(line: 127, column: 36, scope: !226)
!230 = !DILocation(line: 0, scope: !208)
!231 = !DILocation(line: 128, column: 1, scope: !131)
!232 = distinct !DISubprogram(name: "latencyResetEvent", scope: !3, file: !3, line: 135, type: !233, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !235)
!233 = !DISubroutineType(types: !234)
!234 = !{!80, !15}
!235 = !{!236, !237, !284, !285, !286}
!236 = !DILocalVariable(name: "event_to_reset", arg: 1, scope: !232, file: !3, line: 135, type: !15)
!237 = !DILocalVariable(name: "di", scope: !232, file: !3, line: 136, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !62, line: 95, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !62, line: 88, size: 384, elements: !241)
!241 = !{!242, !278, !279, !280, !281, !282, !283}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !240, file: !62, line: 89, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !62, line: 82, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !62, line: 76, size: 768, elements: !246)
!246 = !{!247, !249, !250, !276, !277}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !62, line: 77, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !245, file: !62, line: 78, baseType: !6, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !245, file: !62, line: 79, baseType: !251, size: 512, offset: 128)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 512, elements: !274)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !62, line: 74, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !62, line: 69, size: 256, elements: !254)
!254 = !{!255, !271, !272, !273}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !253, file: !62, line: 70, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !62, line: 56, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !62, line: 47, size: 192, elements: !260)
!260 = !{!261, !262, !269}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !259, file: !62, line: 48, baseType: !6, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !259, file: !62, line: 54, baseType: !263, size: 64, offset: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !259, file: !62, line: 49, size: 64, elements: !264)
!264 = !{!265, !266, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !263, file: !62, line: 50, baseType: !6, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !263, file: !62, line: 51, baseType: !55, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !263, file: !62, line: 52, baseType: !7, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !263, file: !62, line: 53, baseType: !13, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !62, line: 55, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !62, line: 71, baseType: !12, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !253, file: !62, line: 72, baseType: !12, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !253, file: !62, line: 73, baseType: !12, size: 64, offset: 192)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !245, file: !62, line: 80, baseType: !11, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !245, file: !62, line: 81, baseType: !12, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !240, file: !62, line: 90, baseType: !11, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !240, file: !62, line: 91, baseType: !80, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !240, file: !62, line: 91, baseType: !80, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !240, file: !62, line: 92, baseType: !257, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !240, file: !62, line: 92, baseType: !257, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !240, file: !62, line: 94, baseType: !136, size: 64, offset: 320)
!284 = !DILocalVariable(name: "de", scope: !232, file: !3, line: 137, type: !257)
!285 = !DILocalVariable(name: "resets", scope: !232, file: !3, line: 138, type: !80)
!286 = !DILocalVariable(name: "event", scope: !287, file: !3, line: 142, type: !15)
!287 = distinct !DILexicalBlock(scope: !232, file: !3, line: 141, column: 40)
!288 = !DILocation(line: 135, column: 29, scope: !232)
!289 = !DILocation(line: 138, column: 9, scope: !232)
!290 = !DILocation(line: 140, column: 37, scope: !232)
!291 = !DILocation(line: 140, column: 10, scope: !232)
!292 = !DILocation(line: 136, column: 19, scope: !232)
!293 = !DILocation(line: 141, column: 5, scope: !232)
!294 = !DILocation(line: 141, column: 17, scope: !232)
!295 = !DILocation(line: 137, column: 16, scope: !232)
!296 = !DILocation(line: 141, column: 31, scope: !232)
!297 = !DILocation(line: 142, column: 23, scope: !287)
!298 = !{!299, !123, i64 0}
!299 = !{!"dictEntry", !123, i64 0, !121, i64 8, !123, i64 16}
!300 = !DILocation(line: 142, column: 15, scope: !287)
!301 = !DILocation(line: 144, column: 36, scope: !302)
!302 = distinct !DILexicalBlock(scope: !287, file: !3, line: 144, column: 13)
!303 = !DILocation(line: 144, column: 39, scope: !302)
!304 = !DILocation(line: 144, column: 72, scope: !302)
!305 = !DILocation(line: 144, column: 13, scope: !287)
!306 = !DILocation(line: 145, column: 31, scope: !307)
!307 = distinct !DILexicalBlock(scope: !302, file: !3, line: 144, column: 78)
!308 = !DILocation(line: 145, column: 13, scope: !307)
!309 = !DILocation(line: 146, column: 19, scope: !307)
!310 = !DILocation(line: 147, column: 9, scope: !307)
!311 = !DILocation(line: 0, scope: !232)
!312 = distinct !{!312, !293, !313}
!313 = !DILocation(line: 148, column: 5, scope: !232)
!314 = !DILocation(line: 0, scope: !307)
!315 = !DILocation(line: 149, column: 5, scope: !232)
!316 = !DILocation(line: 150, column: 5, scope: !232)
!317 = distinct !DISubprogram(name: "analyzeLatencyForEvent", scope: !3, file: !3, line: 160, type: !318, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !330)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !15, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latencyStats", file: !143, line: 54, size: 256, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "all_time_high", scope: !321, file: !143, line: 55, baseType: !45, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !321, file: !143, line: 56, baseType: !45, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !321, file: !143, line: 57, baseType: !45, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !321, file: !143, line: 58, baseType: !45, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mad", scope: !321, file: !143, line: 59, baseType: !45, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !321, file: !143, line: 60, baseType: !45, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !321, file: !143, line: 61, baseType: !158, size: 64, offset: 192)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DILocalVariable(name: "event", arg: 1, scope: !317, file: !3, line: 160, type: !15)
!332 = !DILocalVariable(name: "ls", arg: 2, scope: !317, file: !3, line: 160, type: !320)
!333 = !DILocalVariable(name: "ts", scope: !317, file: !3, line: 161, type: !141)
!334 = !DILocalVariable(name: "j", scope: !317, file: !3, line: 162, type: !80)
!335 = !DILocalVariable(name: "sum", scope: !317, file: !3, line: 163, type: !55)
!336 = !DILocalVariable(name: "delta", scope: !337, file: !3, line: 206, type: !7)
!337 = distinct !DILexicalBlock(scope: !338, file: !3, line: 205, column: 42)
!338 = distinct !DILexicalBlock(scope: !339, file: !3, line: 205, column: 5)
!339 = distinct !DILexicalBlock(scope: !317, file: !3, line: 205, column: 5)
!340 = !DILocation(line: 160, column: 35, scope: !317)
!341 = !DILocation(line: 160, column: 63, scope: !317)
!342 = !DILocation(line: 161, column: 58, scope: !317)
!343 = !DILocation(line: 161, column: 36, scope: !317)
!344 = !DILocation(line: 165, column: 25, scope: !317)
!345 = !DILocation(line: 161, column: 31, scope: !317)
!346 = !DILocation(line: 165, column: 34, scope: !317)
!347 = !DILocation(line: 165, column: 9, scope: !317)
!348 = !DILocation(line: 165, column: 23, scope: !317)
!349 = !{!350, !120, i64 0}
!350 = !{!"latencyStats", !120, i64 0, !120, i64 4, !120, i64 8, !120, i64 12, !120, i64 16, !120, i64 20, !124, i64 24}
!351 = !DILocation(line: 166, column: 9, scope: !317)
!352 = !DILocation(line: 167, column: 9, scope: !317)
!353 = !DILocation(line: 168, column: 9, scope: !317)
!354 = !DILocation(line: 169, column: 9, scope: !317)
!355 = !DILocation(line: 166, column: 13, scope: !317)
!356 = !{!120, !120, i64 0}
!357 = !DILocation(line: 170, column: 9, scope: !317)
!358 = !DILocation(line: 170, column: 17, scope: !317)
!359 = !{!350, !120, i64 20}
!360 = !DILocation(line: 171, column: 9, scope: !317)
!361 = !DILocation(line: 171, column: 16, scope: !317)
!362 = !{!350, !124, i64 24}
!363 = !DILocation(line: 172, column: 9, scope: !317)
!364 = !DILocation(line: 0, scope: !365)
!365 = distinct !DILexicalBlock(scope: !317, file: !3, line: 172, column: 9)
!366 = !DILocation(line: 163, column: 14, scope: !317)
!367 = !DILocation(line: 162, column: 9, scope: !317)
!368 = !DILocation(line: 176, column: 5, scope: !369)
!369 = distinct !DILexicalBlock(scope: !317, file: !3, line: 176, column: 5)
!370 = !DILocation(line: 177, column: 28, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 177, column: 13)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 176, column: 42)
!373 = distinct !DILexicalBlock(scope: !369, file: !3, line: 176, column: 5)
!374 = !DILocation(line: 177, column: 33, scope: !371)
!375 = !DILocation(line: 177, column: 13, scope: !372)
!376 = !DILocation(line: 178, column: 20, scope: !372)
!377 = !DILocation(line: 179, column: 25, scope: !378)
!378 = distinct !DILexicalBlock(scope: !372, file: !3, line: 179, column: 13)
!379 = !DILocation(line: 179, column: 13, scope: !372)
!380 = !DILocation(line: 0, scope: !381)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 182, column: 17)
!382 = distinct !DILexicalBlock(scope: !378, file: !3, line: 181, column: 16)
!383 = !DILocation(line: 180, column: 31, scope: !384)
!384 = distinct !DILexicalBlock(scope: !378, file: !3, line: 179, column: 31)
!385 = !{!350, !120, i64 12}
!386 = !DILocation(line: 180, column: 21, scope: !384)
!387 = !{!350, !120, i64 8}
!388 = !DILocation(line: 181, column: 9, scope: !384)
!389 = !DILocation(line: 182, column: 25, scope: !381)
!390 = !DILocation(line: 182, column: 17, scope: !382)
!391 = !DILocation(line: 183, column: 25, scope: !381)
!392 = !DILocation(line: 183, column: 17, scope: !381)
!393 = !DILocation(line: 184, column: 25, scope: !394)
!394 = distinct !DILexicalBlock(scope: !382, file: !3, line: 184, column: 17)
!395 = !DILocation(line: 184, column: 17, scope: !382)
!396 = !DILocation(line: 185, column: 25, scope: !394)
!397 = !DILocation(line: 185, column: 17, scope: !394)
!398 = !DILocation(line: 0, scope: !384)
!399 = !DILocation(line: 187, column: 16, scope: !372)
!400 = !DILocation(line: 187, column: 13, scope: !372)
!401 = !DILocation(line: 190, column: 24, scope: !402)
!402 = distinct !DILexicalBlock(scope: !372, file: !3, line: 190, column: 13)
!403 = !DILocation(line: 190, column: 29, scope: !402)
!404 = !DILocation(line: 0, scope: !402)
!405 = !DILocation(line: 190, column: 52, scope: !402)
!406 = !DILocation(line: 190, column: 13, scope: !372)
!407 = !DILocation(line: 191, column: 24, scope: !402)
!408 = !DILocation(line: 191, column: 13, scope: !402)
!409 = !DILocation(line: 0, scope: !372)
!410 = !DILocation(line: 176, column: 38, scope: !373)
!411 = !DILocation(line: 176, column: 5, scope: !373)
!412 = !DILocation(line: 176, column: 19, scope: !373)
!413 = distinct !{!413, !368, !414}
!414 = !DILocation(line: 192, column: 5, scope: !369)
!415 = !DILocation(line: 197, column: 9, scope: !416)
!416 = distinct !DILexicalBlock(scope: !317, file: !3, line: 197, column: 9)
!417 = !DILocation(line: 197, column: 9, scope: !317)
!418 = !DILocation(line: 198, column: 25, scope: !419)
!419 = distinct !DILexicalBlock(scope: !416, file: !3, line: 197, column: 22)
!420 = !DILocation(line: 198, column: 23, scope: !419)
!421 = !DILocation(line: 198, column: 19, scope: !419)
!422 = !DILocation(line: 198, column: 17, scope: !419)
!423 = !{!350, !120, i64 4}
!424 = !DILocation(line: 199, column: 22, scope: !419)
!425 = !DILocation(line: 199, column: 39, scope: !419)
!426 = !DILocation(line: 199, column: 33, scope: !419)
!427 = !DILocation(line: 199, column: 20, scope: !419)
!428 = !DILocation(line: 200, column: 24, scope: !429)
!429 = distinct !DILexicalBlock(scope: !419, file: !3, line: 200, column: 13)
!430 = !DILocation(line: 200, column: 13, scope: !419)
!431 = !DILocation(line: 200, column: 41, scope: !429)
!432 = !DILocation(line: 200, column: 30, scope: !429)
!433 = !DILocation(line: 205, column: 10, scope: !339)
!434 = !DILocation(line: 205, column: 5, scope: !339)
!435 = !DILocation(line: 208, column: 28, scope: !436)
!436 = distinct !DILexicalBlock(scope: !337, file: !3, line: 208, column: 13)
!437 = !DILocation(line: 208, column: 33, scope: !436)
!438 = !DILocation(line: 208, column: 13, scope: !337)
!439 = !DILocation(line: 209, column: 30, scope: !337)
!440 = !DILocation(line: 209, column: 17, scope: !337)
!441 = !DILocation(line: 209, column: 51, scope: !337)
!442 = !DILocation(line: 209, column: 36, scope: !337)
!443 = !DILocation(line: 209, column: 34, scope: !337)
!444 = !DILocation(line: 206, column: 17, scope: !337)
!445 = !DILocation(line: 210, column: 19, scope: !446)
!446 = distinct !DILexicalBlock(scope: !337, file: !3, line: 210, column: 13)
!447 = !DILocation(line: 210, column: 13, scope: !337)
!448 = !DILocation(line: 210, column: 32, scope: !446)
!449 = !DILocation(line: 210, column: 24, scope: !446)
!450 = !DILocation(line: 0, scope: !337)
!451 = !DILocation(line: 211, column: 13, scope: !337)
!452 = !DILocation(line: 212, column: 5, scope: !338)
!453 = !DILocation(line: 0, scope: !436)
!454 = !DILocation(line: 205, column: 38, scope: !338)
!455 = !DILocation(line: 205, column: 5, scope: !338)
!456 = !DILocation(line: 205, column: 19, scope: !338)
!457 = distinct !{!457, !434, !458}
!458 = !DILocation(line: 212, column: 5, scope: !339)
!459 = !DILocation(line: 213, column: 13, scope: !460)
!460 = distinct !DILexicalBlock(scope: !317, file: !3, line: 213, column: 9)
!461 = !DILocation(line: 213, column: 9, scope: !460)
!462 = !DILocation(line: 213, column: 9, scope: !317)
!463 = !DILocation(line: 213, column: 38, scope: !460)
!464 = !DILocation(line: 213, column: 36, scope: !460)
!465 = !DILocation(line: 213, column: 32, scope: !460)
!466 = !DILocation(line: 213, column: 30, scope: !460)
!467 = !{!350, !120, i64 16}
!468 = !DILocation(line: 213, column: 22, scope: !460)
!469 = !DILocation(line: 214, column: 1, scope: !317)
!470 = distinct !DISubprogram(name: "createLatencyReport", scope: !3, file: !3, line: 217, type: !471, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !474)
!471 = !DISubroutineType(types: !472)
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !19, line: 43, baseType: !15)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500}
!475 = !DILocalVariable(name: "report", scope: !470, file: !3, line: 218, type: !473)
!476 = !DILocalVariable(name: "advise_better_vm", scope: !470, file: !3, line: 219, type: !80)
!477 = !DILocalVariable(name: "advise_slowlog_enabled", scope: !470, file: !3, line: 220, type: !80)
!478 = !DILocalVariable(name: "advise_slowlog_tuning", scope: !470, file: !3, line: 221, type: !80)
!479 = !DILocalVariable(name: "advise_slowlog_inspect", scope: !470, file: !3, line: 222, type: !80)
!480 = !DILocalVariable(name: "advise_disk_contention", scope: !470, file: !3, line: 223, type: !80)
!481 = !DILocalVariable(name: "advise_scheduler", scope: !470, file: !3, line: 224, type: !80)
!482 = !DILocalVariable(name: "advise_data_writeback", scope: !470, file: !3, line: 225, type: !80)
!483 = !DILocalVariable(name: "advise_no_appendfsync", scope: !470, file: !3, line: 226, type: !80)
!484 = !DILocalVariable(name: "advise_local_disk", scope: !470, file: !3, line: 227, type: !80)
!485 = !DILocalVariable(name: "advise_ssd", scope: !470, file: !3, line: 228, type: !80)
!486 = !DILocalVariable(name: "advise_write_load_info", scope: !470, file: !3, line: 229, type: !80)
!487 = !DILocalVariable(name: "advise_hz", scope: !470, file: !3, line: 230, type: !80)
!488 = !DILocalVariable(name: "advise_large_objects", scope: !470, file: !3, line: 231, type: !80)
!489 = !DILocalVariable(name: "advise_mass_eviction", scope: !470, file: !3, line: 232, type: !80)
!490 = !DILocalVariable(name: "advise_relax_fsync_policy", scope: !470, file: !3, line: 233, type: !80)
!491 = !DILocalVariable(name: "advise_disable_thp", scope: !470, file: !3, line: 234, type: !80)
!492 = !DILocalVariable(name: "advices", scope: !470, file: !3, line: 235, type: !80)
!493 = !DILocalVariable(name: "di", scope: !470, file: !3, line: 248, type: !238)
!494 = !DILocalVariable(name: "de", scope: !470, file: !3, line: 249, type: !257)
!495 = !DILocalVariable(name: "eventnum", scope: !470, file: !3, line: 250, type: !80)
!496 = !DILocalVariable(name: "event", scope: !497, file: !3, line: 254, type: !15)
!497 = distinct !DILexicalBlock(scope: !470, file: !3, line: 253, column: 40)
!498 = !DILocalVariable(name: "ts", scope: !497, file: !3, line: 255, type: !141)
!499 = !DILocalVariable(name: "ls", scope: !497, file: !3, line: 256, type: !321)
!500 = !DILocalVariable(name: "fork_quality", scope: !501, file: !3, line: 276, type: !15)
!501 = distinct !DILexicalBlock(scope: !502, file: !3, line: 275, column: 40)
!502 = distinct !DILexicalBlock(scope: !497, file: !3, line: 275, column: 13)
!503 = !DILocation(line: 218, column: 18, scope: !470)
!504 = !DILocation(line: 218, column: 9, scope: !470)
!505 = !DILocation(line: 219, column: 9, scope: !470)
!506 = !DILocation(line: 220, column: 9, scope: !470)
!507 = !DILocation(line: 221, column: 9, scope: !470)
!508 = !DILocation(line: 222, column: 9, scope: !470)
!509 = !DILocation(line: 223, column: 9, scope: !470)
!510 = !DILocation(line: 224, column: 9, scope: !470)
!511 = !DILocation(line: 225, column: 9, scope: !470)
!512 = !DILocation(line: 226, column: 9, scope: !470)
!513 = !DILocation(line: 227, column: 9, scope: !470)
!514 = !DILocation(line: 228, column: 9, scope: !470)
!515 = !DILocation(line: 229, column: 9, scope: !470)
!516 = !DILocation(line: 230, column: 9, scope: !470)
!517 = !DILocation(line: 231, column: 9, scope: !470)
!518 = !DILocation(line: 232, column: 9, scope: !470)
!519 = !DILocation(line: 233, column: 9, scope: !470)
!520 = !DILocation(line: 234, column: 9, scope: !470)
!521 = !DILocation(line: 235, column: 9, scope: !470)
!522 = !DILocation(line: 239, column: 9, scope: !523)
!523 = distinct !DILexicalBlock(scope: !470, file: !3, line: 239, column: 9)
!524 = !{!525, !124, i64 24}
!525 = !{!"dictht", !123, i64 0, !124, i64 8, !124, i64 16, !124, i64 24}
!526 = !DILocation(line: 239, column: 41, scope: !523)
!527 = !DILocation(line: 240, column: 16, scope: !523)
!528 = !DILocation(line: 240, column: 42, scope: !523)
!529 = !DILocation(line: 239, column: 46, scope: !523)
!530 = !DILocation(line: 242, column: 18, scope: !531)
!531 = distinct !DILexicalBlock(scope: !523, file: !3, line: 241, column: 5)
!532 = !DILocation(line: 243, column: 9, scope: !531)
!533 = !DILocation(line: 250, column: 9, scope: !470)
!534 = !DILocation(line: 252, column: 10, scope: !470)
!535 = !DILocation(line: 248, column: 19, scope: !470)
!536 = !DILocation(line: 253, column: 5, scope: !470)
!537 = !DILocation(line: 253, column: 17, scope: !470)
!538 = !DILocation(line: 249, column: 16, scope: !470)
!539 = !DILocation(line: 253, column: 31, scope: !470)
!540 = !DILocation(line: 254, column: 23, scope: !497)
!541 = !DILocation(line: 254, column: 15, scope: !497)
!542 = !DILocation(line: 255, column: 40, scope: !497)
!543 = !{!121, !121, i64 0}
!544 = !DILocation(line: 255, column: 35, scope: !497)
!545 = !DILocation(line: 256, column: 9, scope: !497)
!546 = !DILocation(line: 258, column: 16, scope: !547)
!547 = distinct !DILexicalBlock(scope: !497, file: !3, line: 258, column: 13)
!548 = !DILocation(line: 258, column: 13, scope: !497)
!549 = distinct !{!549, !536, !550}
!550 = !DILocation(line: 380, column: 5, scope: !470)
!551 = !DILocation(line: 259, column: 17, scope: !497)
!552 = !DILocation(line: 260, column: 22, scope: !553)
!553 = distinct !DILexicalBlock(scope: !497, file: !3, line: 260, column: 13)
!554 = !DILocation(line: 260, column: 13, scope: !497)
!555 = !DILocation(line: 261, column: 22, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !3, line: 260, column: 28)
!557 = !DILocation(line: 262, column: 9, scope: !556)
!558 = !DILocation(line: 0, scope: !470)
!559 = !DILocation(line: 256, column: 29, scope: !497)
!560 = !DILocation(line: 263, column: 9, scope: !497)
!561 = !DILocation(line: 268, column: 16, scope: !497)
!562 = !DILocation(line: 269, column: 32, scope: !497)
!563 = !DILocation(line: 269, column: 13, scope: !497)
!564 = !DILocation(line: 270, column: 32, scope: !497)
!565 = !DILocation(line: 270, column: 13, scope: !497)
!566 = !DILocation(line: 271, column: 25, scope: !497)
!567 = !DILocation(line: 271, column: 13, scope: !497)
!568 = !DILocation(line: 271, column: 32, scope: !497)
!569 = !DILocation(line: 271, column: 31, scope: !497)
!570 = !DILocation(line: 272, column: 33, scope: !497)
!571 = !DILocation(line: 272, column: 13, scope: !497)
!572 = !DILocation(line: 265, column: 18, scope: !497)
!573 = !DILocation(line: 275, column: 14, scope: !502)
!574 = !DILocation(line: 275, column: 13, scope: !497)
!575 = !DILocation(line: 277, column: 24, scope: !576)
!576 = distinct !DILexicalBlock(scope: !501, file: !3, line: 277, column: 17)
!577 = !{!119, !126, i64 1128}
!578 = !DILocation(line: 277, column: 39, scope: !576)
!579 = !DILocation(line: 277, column: 17, scope: !501)
!580 = !DILocation(line: 280, column: 24, scope: !581)
!581 = distinct !DILexicalBlock(scope: !576, file: !3, line: 277, column: 45)
!582 = !DILocation(line: 281, column: 13, scope: !581)
!583 = !DILocation(line: 281, column: 46, scope: !584)
!584 = distinct !DILexicalBlock(scope: !576, file: !3, line: 281, column: 24)
!585 = !DILocation(line: 281, column: 24, scope: !576)
!586 = !DILocation(line: 284, column: 24, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !3, line: 281, column: 52)
!588 = !DILocation(line: 285, column: 13, scope: !587)
!589 = !DILocation(line: 285, column: 46, scope: !590)
!590 = distinct !DILexicalBlock(scope: !584, file: !3, line: 285, column: 24)
!591 = !DILocation(line: 285, column: 24, scope: !584)
!592 = !DILocation(line: 287, column: 13, scope: !593)
!593 = distinct !DILexicalBlock(scope: !590, file: !3, line: 285, column: 53)
!594 = !DILocation(line: 0, scope: !595)
!595 = distinct !DILexicalBlock(scope: !590, file: !3, line: 287, column: 20)
!596 = !DILocation(line: 276, column: 19, scope: !501)
!597 = !DILocation(line: 290, column: 22, scope: !501)
!598 = !DILocation(line: 293, column: 9, scope: !501)
!599 = !DILocation(line: 0, scope: !581)
!600 = !DILocation(line: 0, scope: !501)
!601 = !DILocation(line: 296, column: 14, scope: !602)
!602 = distinct !DILexicalBlock(scope: !497, file: !3, line: 296, column: 13)
!603 = !DILocation(line: 296, column: 13, scope: !497)
!604 = !DILocation(line: 297, column: 24, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !3, line: 297, column: 17)
!606 = distinct !DILexicalBlock(scope: !602, file: !3, line: 296, column: 43)
!607 = !{!119, !125, i64 1184}
!608 = !DILocation(line: 297, column: 48, scope: !605)
!609 = !DILocation(line: 297, column: 17, scope: !606)
!610 = !DILocation(line: 301, column: 31, scope: !611)
!611 = distinct !DILexicalBlock(scope: !605, file: !3, line: 300, column: 24)
!612 = !{!119, !125, i64 3096}
!613 = !DILocation(line: 300, column: 60, scope: !611)
!614 = !DILocation(line: 300, column: 24, scope: !605)
!615 = !DILocation(line: 0, scope: !616)
!616 = distinct !DILexicalBlock(scope: !605, file: !3, line: 297, column: 53)
!617 = !DILocation(line: 308, column: 21, scope: !606)
!618 = !DILocation(line: 309, column: 9, scope: !606)
!619 = !DILocation(line: 0, scope: !606)
!620 = !DILocation(line: 312, column: 14, scope: !621)
!621 = distinct !DILexicalBlock(scope: !497, file: !3, line: 312, column: 13)
!622 = !DILocation(line: 312, column: 13, scope: !497)
!623 = !DILocation(line: 314, column: 20, scope: !624)
!624 = distinct !DILexicalBlock(scope: !621, file: !3, line: 312, column: 48)
!625 = !DILocation(line: 315, column: 9, scope: !624)
!626 = !DILocation(line: 0, scope: !624)
!627 = !DILocation(line: 318, column: 14, scope: !628)
!628 = distinct !DILexicalBlock(scope: !497, file: !3, line: 318, column: 13)
!629 = !DILocation(line: 318, column: 13, scope: !497)
!630 = !DILocation(line: 323, column: 21, scope: !631)
!631 = distinct !DILexicalBlock(scope: !628, file: !3, line: 318, column: 59)
!632 = !DILocation(line: 324, column: 9, scope: !631)
!633 = !DILocation(line: 0, scope: !631)
!634 = !DILocation(line: 326, column: 14, scope: !635)
!635 = distinct !DILexicalBlock(scope: !497, file: !3, line: 326, column: 13)
!636 = !DILocation(line: 326, column: 13, scope: !497)
!637 = !DILocation(line: 330, column: 21, scope: !638)
!638 = distinct !DILexicalBlock(scope: !635, file: !3, line: 326, column: 58)
!639 = !DILocation(line: 331, column: 9, scope: !638)
!640 = !DILocation(line: 0, scope: !638)
!641 = !DILocation(line: 333, column: 14, scope: !642)
!642 = distinct !DILexicalBlock(scope: !497, file: !3, line: 333, column: 13)
!643 = !DILocation(line: 333, column: 13, scope: !497)
!644 = !DILocation(line: 337, column: 21, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !3, line: 333, column: 51)
!646 = !DILocation(line: 338, column: 9, scope: !645)
!647 = !DILocation(line: 0, scope: !645)
!648 = !DILocation(line: 340, column: 14, scope: !649)
!649 = distinct !DILexicalBlock(scope: !497, file: !3, line: 340, column: 13)
!650 = !DILocation(line: 340, column: 13, scope: !497)
!651 = !DILocation(line: 342, column: 20, scope: !652)
!652 = distinct !DILexicalBlock(scope: !649, file: !3, line: 340, column: 52)
!653 = !DILocation(line: 343, column: 9, scope: !652)
!654 = !DILocation(line: 0, scope: !652)
!655 = !DILocation(line: 345, column: 14, scope: !656)
!656 = distinct !DILexicalBlock(scope: !497, file: !3, line: 345, column: 13)
!657 = !DILocation(line: 345, column: 44, scope: !656)
!658 = !DILocation(line: 346, column: 14, scope: !656)
!659 = !DILocation(line: 345, column: 13, scope: !497)
!660 = !DILocation(line: 349, column: 21, scope: !661)
!661 = distinct !DILexicalBlock(scope: !656, file: !3, line: 346, column: 55)
!662 = !DILocation(line: 350, column: 9, scope: !661)
!663 = !DILocation(line: 0, scope: !661)
!664 = !DILocation(line: 352, column: 14, scope: !665)
!665 = distinct !DILexicalBlock(scope: !497, file: !3, line: 352, column: 13)
!666 = !DILocation(line: 352, column: 57, scope: !665)
!667 = !DILocation(line: 353, column: 14, scope: !665)
!668 = !DILocation(line: 352, column: 13, scope: !497)
!669 = !DILocation(line: 358, column: 21, scope: !670)
!670 = distinct !DILexicalBlock(scope: !665, file: !3, line: 353, column: 46)
!671 = !DILocation(line: 359, column: 9, scope: !670)
!672 = !DILocation(line: 0, scope: !670)
!673 = !DILocation(line: 362, column: 14, scope: !674)
!674 = distinct !DILexicalBlock(scope: !497, file: !3, line: 362, column: 13)
!675 = !DILocation(line: 362, column: 13, scope: !497)
!676 = !DILocation(line: 365, column: 21, scope: !677)
!677 = distinct !DILexicalBlock(scope: !674, file: !3, line: 362, column: 48)
!678 = !DILocation(line: 366, column: 9, scope: !677)
!679 = !DILocation(line: 0, scope: !677)
!680 = !DILocation(line: 369, column: 14, scope: !681)
!681 = distinct !DILexicalBlock(scope: !497, file: !3, line: 369, column: 13)
!682 = !DILocation(line: 369, column: 13, scope: !497)
!683 = !DILocation(line: 371, column: 20, scope: !684)
!684 = distinct !DILexicalBlock(scope: !681, file: !3, line: 369, column: 48)
!685 = !DILocation(line: 372, column: 9, scope: !684)
!686 = !DILocation(line: 0, scope: !684)
!687 = !DILocation(line: 374, column: 14, scope: !688)
!688 = distinct !DILexicalBlock(scope: !497, file: !3, line: 374, column: 13)
!689 = !DILocation(line: 374, column: 13, scope: !497)
!690 = !DILocation(line: 376, column: 20, scope: !691)
!691 = distinct !DILexicalBlock(scope: !688, file: !3, line: 374, column: 50)
!692 = !DILocation(line: 377, column: 9, scope: !691)
!693 = !DILocation(line: 0, scope: !691)
!694 = !DILocation(line: 379, column: 18, scope: !497)
!695 = !DILocation(line: 0, scope: !497)
!696 = !DILocation(line: 0, scope: !547)
!697 = !DILocation(line: 381, column: 5, scope: !470)
!698 = !DILocation(line: 82, column: 12, scope: !108, inlinedAt: !699)
!699 = distinct !DILocation(line: 384, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !470, file: !3, line: 384, column: 9)
!701 = !DILocation(line: 82, column: 5, scope: !108, inlinedAt: !699)
!702 = !DILocation(line: 384, column: 35, scope: !700)
!703 = !DILocation(line: 384, column: 9, scope: !470)
!704 = !DILocation(line: 386, column: 16, scope: !705)
!705 = distinct !DILexicalBlock(scope: !700, file: !3, line: 384, column: 40)
!706 = !DILocation(line: 387, column: 5, scope: !705)
!707 = !DILocation(line: 389, column: 23, scope: !708)
!708 = distinct !DILexicalBlock(scope: !470, file: !3, line: 389, column: 9)
!709 = !DILocation(line: 390, column: 18, scope: !710)
!710 = distinct !DILexicalBlock(scope: !708, file: !3, line: 389, column: 40)
!711 = !DILocation(line: 391, column: 5, scope: !710)
!712 = !DILocation(line: 389, column: 34, scope: !708)
!713 = !DILocation(line: 391, column: 25, scope: !714)
!714 = distinct !DILexicalBlock(scope: !708, file: !3, line: 391, column: 16)
!715 = !DILocation(line: 391, column: 29, scope: !714)
!716 = !DILocation(line: 392, column: 18, scope: !717)
!717 = distinct !DILexicalBlock(scope: !714, file: !3, line: 391, column: 46)
!718 = !DILocation(line: 393, column: 5, scope: !717)
!719 = !DILocation(line: 397, column: 18, scope: !720)
!720 = distinct !DILexicalBlock(scope: !714, file: !3, line: 393, column: 12)
!721 = !DILocation(line: 398, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !720, file: !3, line: 398, column: 13)
!723 = !DILocation(line: 398, column: 13, scope: !720)
!724 = !DILocation(line: 399, column: 22, scope: !725)
!725 = distinct !DILexicalBlock(scope: !722, file: !3, line: 398, column: 31)
!726 = !DILocation(line: 400, column: 9, scope: !725)
!727 = !DILocation(line: 0, scope: !720)
!728 = !DILocation(line: 403, column: 13, scope: !729)
!729 = distinct !DILexicalBlock(scope: !720, file: !3, line: 403, column: 13)
!730 = !DILocation(line: 403, column: 13, scope: !720)
!731 = !DILocation(line: 404, column: 335, scope: !732)
!732 = distinct !DILexicalBlock(scope: !729, file: !3, line: 403, column: 37)
!733 = !DILocation(line: 404, column: 360, scope: !732)
!734 = !DILocation(line: 404, column: 22, scope: !732)
!735 = !DILocation(line: 405, column: 9, scope: !732)
!736 = !DILocation(line: 0, scope: !725)
!737 = !DILocation(line: 407, column: 13, scope: !738)
!738 = distinct !DILexicalBlock(scope: !720, file: !3, line: 407, column: 13)
!739 = !DILocation(line: 407, column: 13, scope: !720)
!740 = !DILocation(line: 408, column: 247, scope: !741)
!741 = distinct !DILexicalBlock(scope: !738, file: !3, line: 407, column: 36)
!742 = !DILocation(line: 408, column: 272, scope: !741)
!743 = !DILocation(line: 408, column: 22, scope: !741)
!744 = !DILocation(line: 409, column: 9, scope: !741)
!745 = !DILocation(line: 0, scope: !732)
!746 = !DILocation(line: 411, column: 13, scope: !747)
!747 = distinct !DILexicalBlock(scope: !720, file: !3, line: 411, column: 13)
!748 = !DILocation(line: 411, column: 13, scope: !720)
!749 = !DILocation(line: 412, column: 22, scope: !750)
!750 = distinct !DILexicalBlock(scope: !747, file: !3, line: 411, column: 37)
!751 = !DILocation(line: 413, column: 9, scope: !750)
!752 = !DILocation(line: 0, scope: !741)
!753 = !DILocation(line: 416, column: 13, scope: !754)
!754 = distinct !DILexicalBlock(scope: !720, file: !3, line: 416, column: 13)
!755 = !DILocation(line: 416, column: 13, scope: !720)
!756 = !DILocation(line: 417, column: 22, scope: !757)
!757 = distinct !DILexicalBlock(scope: !754, file: !3, line: 416, column: 31)
!758 = !DILocation(line: 423, column: 9, scope: !757)
!759 = !DILocation(line: 0, scope: !750)
!760 = !DILocation(line: 426, column: 13, scope: !761)
!761 = distinct !DILexicalBlock(scope: !720, file: !3, line: 426, column: 13)
!762 = !DILocation(line: 426, column: 13, scope: !720)
!763 = !DILocation(line: 427, column: 22, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !3, line: 426, column: 32)
!765 = !DILocation(line: 428, column: 9, scope: !764)
!766 = !DILocation(line: 0, scope: !757)
!767 = !DILocation(line: 430, column: 13, scope: !768)
!768 = distinct !DILexicalBlock(scope: !720, file: !3, line: 430, column: 13)
!769 = !DILocation(line: 430, column: 13, scope: !720)
!770 = !DILocation(line: 431, column: 22, scope: !771)
!771 = distinct !DILexicalBlock(scope: !768, file: !3, line: 430, column: 25)
!772 = !DILocation(line: 432, column: 9, scope: !771)
!773 = !DILocation(line: 0, scope: !764)
!774 = !DILocation(line: 434, column: 13, scope: !775)
!775 = distinct !DILexicalBlock(scope: !720, file: !3, line: 434, column: 13)
!776 = !DILocation(line: 434, column: 13, scope: !720)
!777 = !DILocation(line: 435, column: 22, scope: !778)
!778 = distinct !DILexicalBlock(scope: !775, file: !3, line: 434, column: 36)
!779 = !DILocation(line: 436, column: 9, scope: !778)
!780 = !DILocation(line: 0, scope: !771)
!781 = !DILocation(line: 438, column: 13, scope: !782)
!782 = distinct !DILexicalBlock(scope: !720, file: !3, line: 438, column: 13)
!783 = !DILocation(line: 438, column: 13, scope: !720)
!784 = !DILocation(line: 439, column: 22, scope: !785)
!785 = distinct !DILexicalBlock(scope: !782, file: !3, line: 438, column: 37)
!786 = !DILocation(line: 440, column: 9, scope: !785)
!787 = !DILocation(line: 0, scope: !778)
!788 = !DILocation(line: 442, column: 13, scope: !789)
!789 = distinct !DILexicalBlock(scope: !720, file: !3, line: 442, column: 13)
!790 = !DILocation(line: 442, column: 13, scope: !720)
!791 = !DILocation(line: 443, column: 22, scope: !792)
!792 = distinct !DILexicalBlock(scope: !789, file: !3, line: 442, column: 36)
!793 = !DILocation(line: 444, column: 9, scope: !792)
!794 = !DILocation(line: 0, scope: !785)
!795 = !DILocation(line: 446, column: 13, scope: !796)
!796 = distinct !DILexicalBlock(scope: !720, file: !3, line: 446, column: 13)
!797 = !DILocation(line: 446, column: 49, scope: !796)
!798 = !DILocation(line: 446, column: 59, scope: !796)
!799 = !DILocation(line: 446, column: 39, scope: !796)
!800 = !DILocation(line: 447, column: 22, scope: !801)
!801 = distinct !DILexicalBlock(scope: !796, file: !3, line: 446, column: 80)
!802 = !DILocation(line: 448, column: 9, scope: !801)
!803 = !DILocation(line: 0, scope: !792)
!804 = !DILocation(line: 450, column: 13, scope: !805)
!805 = distinct !DILexicalBlock(scope: !720, file: !3, line: 450, column: 13)
!806 = !DILocation(line: 450, column: 13, scope: !720)
!807 = !DILocation(line: 451, column: 22, scope: !808)
!808 = distinct !DILexicalBlock(scope: !805, file: !3, line: 450, column: 37)
!809 = !DILocation(line: 452, column: 9, scope: !808)
!810 = !DILocation(line: 0, scope: !801)
!811 = !DILocation(line: 454, column: 13, scope: !812)
!812 = distinct !DILexicalBlock(scope: !720, file: !3, line: 454, column: 13)
!813 = !DILocation(line: 454, column: 33, scope: !812)
!814 = !DILocation(line: 454, column: 36, scope: !812)
!815 = !DILocation(line: 454, column: 23, scope: !812)
!816 = !DILocation(line: 455, column: 22, scope: !817)
!817 = distinct !DILexicalBlock(scope: !812, file: !3, line: 454, column: 43)
!818 = !DILocation(line: 456, column: 9, scope: !817)
!819 = !DILocation(line: 0, scope: !808)
!820 = !DILocation(line: 458, column: 13, scope: !821)
!821 = distinct !DILexicalBlock(scope: !720, file: !3, line: 458, column: 13)
!822 = !DILocation(line: 458, column: 13, scope: !720)
!823 = !DILocation(line: 459, column: 22, scope: !824)
!824 = distinct !DILexicalBlock(scope: !821, file: !3, line: 458, column: 35)
!825 = !DILocation(line: 460, column: 9, scope: !824)
!826 = !DILocation(line: 0, scope: !817)
!827 = !DILocation(line: 462, column: 13, scope: !828)
!828 = distinct !DILexicalBlock(scope: !720, file: !3, line: 462, column: 13)
!829 = !DILocation(line: 462, column: 13, scope: !720)
!830 = !DILocation(line: 463, column: 22, scope: !831)
!831 = distinct !DILexicalBlock(scope: !828, file: !3, line: 462, column: 35)
!832 = !DILocation(line: 464, column: 9, scope: !831)
!833 = !DILocation(line: 0, scope: !824)
!834 = !DILocation(line: 466, column: 13, scope: !835)
!835 = distinct !DILexicalBlock(scope: !720, file: !3, line: 466, column: 13)
!836 = !DILocation(line: 466, column: 13, scope: !720)
!837 = !DILocation(line: 467, column: 22, scope: !838)
!838 = distinct !DILexicalBlock(scope: !835, file: !3, line: 466, column: 33)
!839 = !DILocation(line: 468, column: 9, scope: !838)
!840 = !DILocation(line: 0, scope: !710)
!841 = !DILocation(line: 472, column: 1, scope: !470)
!842 = distinct !DISubprogram(name: "latencyCommandReplyWithSamples", scope: !3, file: !3, line: 478, type: !843, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1018)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !845, !141}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !135, line: 780, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !135, line: 723, size: 135360, elements: !848)
!848 = !{!849, !850, !851, !892, !902, !903, !908, !909, !910, !911, !913, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !957, !958, !959, !960, !961, !962, !963, !964, !968, !969, !973, !974, !990, !991, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !847, file: !135, line: 724, baseType: !55, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !847, file: !135, line: 725, baseType: !80, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !847, file: !135, line: 726, baseType: !852, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !135, line: 656, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !135, line: 647, size: 512, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !854, file: !135, line: 648, baseType: !243, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !854, file: !135, line: 649, baseType: !243, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !854, file: !135, line: 650, baseType: !243, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !854, file: !135, line: 651, baseType: !243, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !854, file: !135, line: 652, baseType: !243, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !854, file: !135, line: 653, baseType: !80, size: 32, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !854, file: !135, line: 654, baseType: !136, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !854, file: !135, line: 655, baseType: !864, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !866, line: 54, baseType: !867)
!866 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !866, line: 47, size: 384, elements: !868)
!868 = !{!869, !878, !879, !883, !887, !891}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !867, file: !866, line: 48, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !866, line: 40, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !866, line: 36, size: 192, elements: !873)
!873 = !{!874, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !872, file: !866, line: 37, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !866, line: 38, baseType: !875, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !872, file: !866, line: 39, baseType: !6, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !867, file: !866, line: 49, baseType: !870, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !867, file: !866, line: 50, baseType: !880, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!6, !6}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !867, file: !866, line: 51, baseType: !884, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !6}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !867, file: !866, line: 52, baseType: !888, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!80, !6, !6}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !867, file: !866, line: 53, baseType: !12, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !847, file: !135, line: 727, baseType: !893, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !135, line: 622, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !135, line: 614, size: 128, elements: !896)
!896 = !{!897, !898, !899, !900, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !895, file: !135, line: 615, baseType: !47, size: 4, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !895, file: !135, line: 616, baseType: !47, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !895, file: !135, line: 617, baseType: !47, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !895, file: !135, line: 620, baseType: !80, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !895, file: !135, line: 621, baseType: !6, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !847, file: !135, line: 728, baseType: !473, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !847, file: !135, line: 729, baseType: !904, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !905, line: 40, baseType: !906)
!905 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !907, line: 129, baseType: !12)
!907 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !847, file: !135, line: 730, baseType: !473, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !847, file: !135, line: 734, baseType: !904, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !847, file: !135, line: 735, baseType: !80, size: 32, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !847, file: !135, line: 736, baseType: !912, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !847, file: !135, line: 737, baseType: !914, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !135, line: 1307, size: 640, elements: !916)
!916 = !{!917, !918, !923, !924, !925, !926, !932, !933, !934, !935, !936}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !915, file: !135, line: 1308, baseType: !15, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !915, file: !135, line: 1309, baseType: !919, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !135, line: 1305, baseType: !921)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !845}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !915, file: !135, line: 1310, baseType: !80, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !915, file: !135, line: 1311, baseType: !15, size: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !915, file: !135, line: 1312, baseType: !80, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !915, file: !135, line: 1315, baseType: !927, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !135, line: 1306, baseType: !929)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !914, !912, !80, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !915, file: !135, line: 1317, baseType: !80, size: 32, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !915, file: !135, line: 1318, baseType: !80, size: 32, offset: 416)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !915, file: !135, line: 1319, baseType: !80, size: 32, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !915, file: !135, line: 1320, baseType: !136, size: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !915, file: !135, line: 1320, baseType: !136, size: 64, offset: 576)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !847, file: !135, line: 737, baseType: !914, size: 64, offset: 704)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !847, file: !135, line: 738, baseType: !80, size: 32, offset: 768)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !847, file: !135, line: 739, baseType: !80, size: 32, offset: 800)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !847, file: !135, line: 740, baseType: !11, size: 64, offset: 832)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !847, file: !135, line: 741, baseType: !864, size: 64, offset: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !847, file: !135, line: 742, baseType: !14, size: 64, offset: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !847, file: !135, line: 743, baseType: !904, size: 64, offset: 1024)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !847, file: !135, line: 745, baseType: !158, size: 64, offset: 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !847, file: !135, line: 746, baseType: !158, size: 64, offset: 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !847, file: !135, line: 747, baseType: !158, size: 64, offset: 1216)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !847, file: !135, line: 748, baseType: !80, size: 32, offset: 1280)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !847, file: !135, line: 749, baseType: !80, size: 32, offset: 1312)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !847, file: !135, line: 750, baseType: !80, size: 32, offset: 1344)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !847, file: !135, line: 751, baseType: !80, size: 32, offset: 1376)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !847, file: !135, line: 752, baseType: !80, size: 32, offset: 1408)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !847, file: !135, line: 753, baseType: !953, size: 64, offset: 1472)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !954, line: 173, baseType: !955)
!954 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !907, line: 100, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !907, line: 44, baseType: !11)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !847, file: !135, line: 754, baseType: !953, size: 64, offset: 1536)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !847, file: !135, line: 755, baseType: !473, size: 64, offset: 1600)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !847, file: !135, line: 756, baseType: !136, size: 64, offset: 1664)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !847, file: !135, line: 757, baseType: !136, size: 64, offset: 1728)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !847, file: !135, line: 758, baseType: !136, size: 64, offset: 1792)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !847, file: !135, line: 759, baseType: !136, size: 64, offset: 1856)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !847, file: !135, line: 760, baseType: !136, size: 64, offset: 1920)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !847, file: !135, line: 763, baseType: !965, size: 328, offset: 1984)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 328, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 41)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !847, file: !135, line: 764, baseType: !80, size: 32, offset: 2336)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !847, file: !135, line: 765, baseType: !970, size: 368, offset: 2368)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 368, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 46)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !847, file: !135, line: 766, baseType: !80, size: 32, offset: 2752)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !847, file: !135, line: 767, baseType: !975, size: 256, offset: 2816)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !135, line: 673, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !135, line: 665, size: 256, elements: !977)
!977 = !{!978, !986, !987, !988, !989}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !976, file: !135, line: 666, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !135, line: 663, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !135, line: 659, size: 192, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !981, file: !135, line: 660, baseType: !912, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !981, file: !135, line: 661, baseType: !80, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !981, file: !135, line: 662, baseType: !914, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !976, file: !135, line: 667, baseType: !80, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !976, file: !135, line: 668, baseType: !80, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !976, file: !135, line: 671, baseType: !80, size: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !976, file: !135, line: 672, baseType: !158, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !847, file: !135, line: 768, baseType: !80, size: 32, offset: 3072)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !847, file: !135, line: 769, baseType: !992, size: 704, offset: 3136)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !135, line: 703, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !135, line: 677, size: 704, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !993, file: !135, line: 679, baseType: !134, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !993, file: !135, line: 683, baseType: !243, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !993, file: !135, line: 685, baseType: !893, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !993, file: !135, line: 689, baseType: !904, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !993, file: !135, line: 690, baseType: !893, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !993, file: !135, line: 691, baseType: !893, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !993, file: !135, line: 692, baseType: !134, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !993, file: !135, line: 692, baseType: !134, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !993, file: !135, line: 693, baseType: !80, size: 32, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !993, file: !135, line: 696, baseType: !80, size: 32, offset: 544)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !993, file: !135, line: 697, baseType: !136, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !993, file: !135, line: 700, baseType: !6, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !847, file: !135, line: 770, baseType: !136, size: 64, offset: 3840)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !847, file: !135, line: 771, baseType: !864, size: 64, offset: 3904)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !847, file: !135, line: 772, baseType: !243, size: 64, offset: 3968)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !847, file: !135, line: 773, baseType: !864, size: 64, offset: 4032)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !847, file: !135, line: 774, baseType: !473, size: 64, offset: 4096)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !847, file: !135, line: 775, baseType: !870, size: 64, offset: 4160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !847, file: !135, line: 778, baseType: !80, size: 32, offset: 4224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !847, file: !135, line: 779, baseType: !1015, size: 131072, offset: 4256)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 131072, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 16384)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024}
!1019 = !DILocalVariable(name: "c", arg: 1, scope: !842, file: !3, line: 478, type: !845)
!1020 = !DILocalVariable(name: "ts", arg: 2, scope: !842, file: !3, line: 478, type: !141)
!1021 = !DILocalVariable(name: "replylen", scope: !842, file: !3, line: 479, type: !6)
!1022 = !DILocalVariable(name: "samples", scope: !842, file: !3, line: 480, type: !80)
!1023 = !DILocalVariable(name: "j", scope: !842, file: !3, line: 480, type: !80)
!1024 = !DILocalVariable(name: "i", scope: !1025, file: !3, line: 483, type: !80)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 482, column: 42)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 482, column: 5)
!1027 = distinct !DILexicalBlock(scope: !842, file: !3, line: 482, column: 5)
!1028 = !DILocation(line: 478, column: 45, scope: !842)
!1029 = !DILocation(line: 478, column: 74, scope: !842)
!1030 = !DILocation(line: 479, column: 22, scope: !842)
!1031 = !DILocation(line: 479, column: 11, scope: !842)
!1032 = !DILocation(line: 480, column: 9, scope: !842)
!1033 = !DILocation(line: 480, column: 22, scope: !842)
!1034 = !DILocation(line: 482, column: 10, scope: !1027)
!1035 = !DILocation(line: 482, column: 5, scope: !1027)
!1036 = !DILocation(line: 483, column: 22, scope: !1025)
!1037 = !DILocation(line: 483, column: 26, scope: !1025)
!1038 = !DILocation(line: 483, column: 31, scope: !1025)
!1039 = !DILocation(line: 483, column: 13, scope: !1025)
!1040 = !DILocation(line: 485, column: 13, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 485, column: 13)
!1042 = !DILocation(line: 485, column: 28, scope: !1041)
!1043 = !DILocation(line: 485, column: 33, scope: !1041)
!1044 = !DILocation(line: 485, column: 13, scope: !1025)
!1045 = !DILocation(line: 486, column: 9, scope: !1025)
!1046 = !DILocation(line: 487, column: 43, scope: !1025)
!1047 = !DILocation(line: 487, column: 28, scope: !1025)
!1048 = !DILocation(line: 487, column: 9, scope: !1025)
!1049 = !DILocation(line: 488, column: 43, scope: !1025)
!1050 = !DILocation(line: 488, column: 28, scope: !1025)
!1051 = !DILocation(line: 488, column: 9, scope: !1025)
!1052 = !DILocation(line: 489, column: 16, scope: !1025)
!1053 = !DILocation(line: 490, column: 5, scope: !1026)
!1054 = !DILocation(line: 0, scope: !1025)
!1055 = !DILocation(line: 0, scope: !1041)
!1056 = !DILocation(line: 482, column: 38, scope: !1026)
!1057 = !DILocation(line: 482, column: 5, scope: !1026)
!1058 = !DILocation(line: 482, column: 19, scope: !1026)
!1059 = distinct !{!1059, !1035, !1060}
!1060 = !DILocation(line: 490, column: 5, scope: !1027)
!1061 = !DILocation(line: 491, column: 43, scope: !842)
!1062 = !DILocation(line: 491, column: 5, scope: !842)
!1063 = !DILocation(line: 492, column: 1, scope: !842)
!1064 = distinct !DISubprogram(name: "latencyCommandReplyWithLatestEvents", scope: !3, file: !3, line: 496, type: !921, isLocal: false, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1071, !1072}
!1066 = !DILocalVariable(name: "c", arg: 1, scope: !1064, file: !3, line: 496, type: !845)
!1067 = !DILocalVariable(name: "di", scope: !1064, file: !3, line: 497, type: !238)
!1068 = !DILocalVariable(name: "de", scope: !1064, file: !3, line: 498, type: !257)
!1069 = !DILocalVariable(name: "event", scope: !1070, file: !3, line: 503, type: !15)
!1070 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 502, column: 40)
!1071 = !DILocalVariable(name: "ts", scope: !1070, file: !3, line: 504, type: !141)
!1072 = !DILocalVariable(name: "last", scope: !1070, file: !3, line: 505, type: !80)
!1073 = !DILocation(line: 496, column: 50, scope: !1064)
!1074 = !DILocation(line: 500, column: 28, scope: !1064)
!1075 = !DILocation(line: 500, column: 5, scope: !1064)
!1076 = !DILocation(line: 501, column: 33, scope: !1064)
!1077 = !DILocation(line: 501, column: 10, scope: !1064)
!1078 = !DILocation(line: 497, column: 19, scope: !1064)
!1079 = !DILocation(line: 502, column: 5, scope: !1064)
!1080 = !DILocation(line: 502, column: 17, scope: !1064)
!1081 = !DILocation(line: 498, column: 16, scope: !1064)
!1082 = !DILocation(line: 502, column: 31, scope: !1064)
!1083 = !DILocation(line: 503, column: 23, scope: !1070)
!1084 = !DILocation(line: 503, column: 15, scope: !1070)
!1085 = !DILocation(line: 504, column: 40, scope: !1070)
!1086 = !DILocation(line: 504, column: 35, scope: !1070)
!1087 = !DILocation(line: 505, column: 25, scope: !1070)
!1088 = !DILocation(line: 505, column: 46, scope: !1070)
!1089 = !DILocation(line: 505, column: 51, scope: !1070)
!1090 = !DILocation(line: 505, column: 13, scope: !1070)
!1091 = !DILocation(line: 507, column: 9, scope: !1070)
!1092 = !DILocation(line: 508, column: 9, scope: !1070)
!1093 = !DILocation(line: 509, column: 28, scope: !1070)
!1094 = !DILocation(line: 509, column: 46, scope: !1070)
!1095 = !DILocation(line: 509, column: 9, scope: !1070)
!1096 = !DILocation(line: 510, column: 46, scope: !1070)
!1097 = !DILocation(line: 510, column: 28, scope: !1070)
!1098 = !DILocation(line: 510, column: 9, scope: !1070)
!1099 = !DILocation(line: 511, column: 32, scope: !1070)
!1100 = !DILocation(line: 511, column: 28, scope: !1070)
!1101 = !DILocation(line: 511, column: 9, scope: !1070)
!1102 = distinct !{!1102, !1079, !1103}
!1103 = !DILocation(line: 512, column: 5, scope: !1064)
!1104 = !DILocation(line: 513, column: 5, scope: !1064)
!1105 = !DILocation(line: 514, column: 1, scope: !1064)
!1106 = distinct !DISubprogram(name: "latencyCommandGenSparkeline", scope: !3, file: !3, line: 517, type: !1107, isLocal: false, isDefinition: true, scopeLine: 517, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1109)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!473, !15, !141}
!1109 = !{!1110, !1111, !1112, !1113, !1128, !1129, !1130, !1131, !1135, !1136}
!1110 = !DILocalVariable(name: "event", arg: 1, scope: !1106, file: !3, line: 517, type: !15)
!1111 = !DILocalVariable(name: "ts", arg: 2, scope: !1106, file: !3, line: 517, type: !141)
!1112 = !DILocalVariable(name: "j", scope: !1106, file: !3, line: 518, type: !80)
!1113 = !DILocalVariable(name: "seq", scope: !1106, file: !3, line: 519, type: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sequence", file: !1116, line: 39, size: 256, elements: !1117)
!1116 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sparkline.h", directory: "/root/.unikraft/apps/redis/build")
!1117 = !{!1118, !1119, !1120, !1126, !1127}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1115, file: !1116, line: 40, baseType: !80, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !1115, file: !1116, line: 41, baseType: !80, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1115, file: !1116, line: 42, baseType: !1121, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sample", file: !1116, line: 34, size: 128, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1122, file: !1116, line: 35, baseType: !13, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1122, file: !1116, line: 36, baseType: !15, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1115, file: !1116, line: 43, baseType: !13, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1115, file: !1116, line: 43, baseType: !13, size: 64, offset: 192)
!1128 = !DILocalVariable(name: "graph", scope: !1106, file: !3, line: 520, type: !473)
!1129 = !DILocalVariable(name: "min", scope: !1106, file: !3, line: 521, type: !45)
!1130 = !DILocalVariable(name: "max", scope: !1106, file: !3, line: 521, type: !45)
!1131 = !DILocalVariable(name: "i", scope: !1132, file: !3, line: 524, type: !80)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 523, column: 42)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 523, column: 5)
!1134 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 523, column: 5)
!1135 = !DILocalVariable(name: "elapsed", scope: !1132, file: !3, line: 525, type: !80)
!1136 = !DILocalVariable(name: "buf", scope: !1132, file: !3, line: 526, type: !1137)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !1138)
!1138 = !{!1139}
!1139 = !DISubrange(count: 64)
!1140 = !DILocation(line: 517, column: 39, scope: !1106)
!1141 = !DILocation(line: 517, column: 72, scope: !1106)
!1142 = !DILocation(line: 519, column: 28, scope: !1106)
!1143 = !DILocation(line: 519, column: 22, scope: !1106)
!1144 = !DILocation(line: 520, column: 17, scope: !1106)
!1145 = !DILocation(line: 520, column: 9, scope: !1106)
!1146 = !DILocation(line: 521, column: 14, scope: !1106)
!1147 = !DILocation(line: 521, column: 23, scope: !1106)
!1148 = !DILocation(line: 518, column: 9, scope: !1106)
!1149 = !DILocation(line: 523, column: 10, scope: !1134)
!1150 = !DILocation(line: 523, column: 5, scope: !1134)
!1151 = !DILocation(line: 524, column: 22, scope: !1132)
!1152 = !DILocation(line: 524, column: 26, scope: !1132)
!1153 = !DILocation(line: 524, column: 31, scope: !1132)
!1154 = !DILocation(line: 524, column: 13, scope: !1132)
!1155 = !DILocation(line: 526, column: 9, scope: !1132)
!1156 = !DILocation(line: 526, column: 14, scope: !1132)
!1157 = !DILocation(line: 528, column: 13, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 528, column: 13)
!1159 = !DILocation(line: 528, column: 28, scope: !1158)
!1160 = !DILocation(line: 528, column: 33, scope: !1158)
!1161 = !DILocation(line: 528, column: 13, scope: !1132)
!1162 = !DILocation(line: 530, column: 18, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 530, column: 13)
!1164 = !{!1165, !120, i64 0}
!1165 = !{!"sequence", !120, i64 0, !120, i64 4, !123, i64 8, !126, i64 16, !126, i64 24}
!1166 = !DILocation(line: 530, column: 25, scope: !1163)
!1167 = !DILocation(line: 0, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 533, column: 17)
!1169 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 532, column: 16)
!1170 = !DILocation(line: 530, column: 13, scope: !1132)
!1171 = !DILocation(line: 533, column: 40, scope: !1168)
!1172 = !DILocation(line: 533, column: 17, scope: !1169)
!1173 = !DILocation(line: 533, column: 47, scope: !1168)
!1174 = !DILocation(line: 0, scope: !1106)
!1175 = !DILocation(line: 534, column: 40, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 534, column: 17)
!1177 = !DILocation(line: 534, column: 17, scope: !1169)
!1178 = !DILocation(line: 0, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 530, column: 31)
!1180 = !DILocation(line: 538, column: 19, scope: !1132)
!1181 = !DILocation(line: 538, column: 47, scope: !1132)
!1182 = !DILocation(line: 525, column: 13, scope: !1132)
!1183 = !DILocation(line: 539, column: 21, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 539, column: 13)
!1185 = !DILocation(line: 539, column: 13, scope: !1132)
!1186 = !DILocation(line: 540, column: 13, scope: !1184)
!1187 = !DILocation(line: 541, column: 26, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 541, column: 18)
!1189 = !DILocation(line: 541, column: 18, scope: !1184)
