; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type opaque
%struct.lua_Debug = type { i32, i8*, i8*, i8*, i8*, i32, i32, i32, i32, [60 x i8], i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.luaL_Buffer = type { i8*, i32, %struct.lua_State*, [1024 x i8] }
%struct.LoadF = type { i32, %struct.__sFILE*, [1024 x i8] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !11, !12, !242}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !9, line: 129, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadF", file: !1, line: 526, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoadF", file: !1, line: 522, size: 8320, elements: !15)
!15 = !{!16, !17, !238}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "extraline", scope: !14, file: !1, line: 523, baseType: !11, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !1, line: 524, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 66, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !22, line: 287, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 181, size: 1408, elements: !24)
!24 = !{!25, !28, !29, !30, !32, !33, !38, !39, !40, !205, !211, !216, !220, !221, !222, !223, !225, !227, !228, !229, !231, !232, !236, !237}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !23, file: !22, line: 182, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !23, file: !22, line: 183, baseType: !11, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !23, file: !22, line: 184, baseType: !11, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !23, file: !22, line: 185, baseType: !31, size: 16, offset: 128)
!31 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !23, file: !22, line: 186, baseType: !31, size: 16, offset: 144)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !23, file: !22, line: 187, baseType: !34, size: 128, offset: 192)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 117, size: 128, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !34, file: !22, line: 118, baseType: !26, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !34, file: !22, line: 119, baseType: !11, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !23, file: !22, line: 188, baseType: !11, size: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !23, file: !22, line: 195, baseType: !4, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !23, file: !22, line: 197, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !46, !4, !90, !11}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !9, line: 145, baseType: !45)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !22, line: 569, size: 14912, elements: !48)
!48 = !{!49, !50, !52, !53, !54, !55, !59, !60, !64, !65, !69, !84, !85, !86, !88, !89, !91, !169, !190, !191, !196, !203}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !47, file: !22, line: 571, baseType: !11, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !47, file: !22, line: 578, baseType: !11, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !47, file: !22, line: 579, baseType: !56, size: 200, offset: 288)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 200, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 25)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !47, file: !22, line: 582, baseType: !11, size: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !47, file: !22, line: 583, baseType: !61, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !63, line: 9, flags: DIFlagFwdDecl)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !47, file: !22, line: 585, baseType: !11, size: 32, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !47, file: !22, line: 587, baseType: !66, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !46}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !47, file: !22, line: 590, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !22, line: 47, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !22, line: 49, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !71, file: !22, line: 51, baseType: !79, size: 32, offset: 192)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !82)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !22, line: 25, baseType: !81)
!81 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !47, file: !22, line: 591, baseType: !11, size: 32, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !47, file: !22, line: 592, baseType: !70, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !47, file: !22, line: 593, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !47, file: !22, line: 596, baseType: !11, size: 32, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !47, file: !22, line: 597, baseType: !90, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !47, file: !22, line: 632, baseType: !92, size: 2880, offset: 1152)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !47, file: !22, line: 599, size: 2880, elements: !93)
!93 = !{!94, !160}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !92, file: !22, line: 622, baseType: !95, size: 1728)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !22, line: 601, size: 1728, elements: !96)
!96 = !{!97, !98, !99, !103, !115, !116, !118, !128, !143, !144, !145, !149, !153, !154, !155, !156, !157, !158, !159}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !95, file: !22, line: 603, baseType: !81, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !95, file: !22, line: 604, baseType: !90, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !95, file: !22, line: 605, baseType: !100, size: 208, offset: 128)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 208, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 26)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !95, file: !22, line: 606, baseType: !104, size: 288, offset: 352)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !22, line: 55, size: 288, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !104, file: !22, line: 57, baseType: !11, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !104, file: !22, line: 58, baseType: !11, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !104, file: !22, line: 59, baseType: !11, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !104, file: !22, line: 60, baseType: !11, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !104, file: !22, line: 61, baseType: !11, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !104, file: !22, line: 62, baseType: !11, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !104, file: !22, line: 63, baseType: !11, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !104, file: !22, line: 64, baseType: !11, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !104, file: !22, line: 65, baseType: !11, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !95, file: !22, line: 607, baseType: !11, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !95, file: !22, line: 608, baseType: !117, size: 64, offset: 704)
!117 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !95, file: !22, line: 609, baseType: !119, size: 112, offset: 768)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !22, line: 319, size: 112, elements: !120)
!120 = !{!121, !126, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !119, file: !22, line: 320, baseType: !122, size: 48)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !124)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !119, file: !22, line: 321, baseType: !122, size: 48, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !119, file: !22, line: 322, baseType: !123, size: 16, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !95, file: !22, line: 610, baseType: !129, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !9, line: 171, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 163, size: 64, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !130, file: !9, line: 165, baseType: !11, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !130, file: !9, line: 170, baseType: !134, size: 32, offset: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !9, line: 166, size: 32, elements: !135)
!135 = !{!136, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !134, file: !9, line: 168, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !138, line: 124, baseType: !81)
!138 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !134, file: !9, line: 169, baseType: !140, size: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 4)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !95, file: !22, line: 611, baseType: !129, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !95, file: !22, line: 612, baseType: !129, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !95, file: !22, line: 613, baseType: !146, size: 64, offset: 1088)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !95, file: !22, line: 614, baseType: !150, size: 192, offset: 1152)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 24)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !95, file: !22, line: 615, baseType: !11, size: 32, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !95, file: !22, line: 616, baseType: !129, size: 64, offset: 1376)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !95, file: !22, line: 617, baseType: !129, size: 64, offset: 1440)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !95, file: !22, line: 618, baseType: !129, size: 64, offset: 1504)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !95, file: !22, line: 619, baseType: !129, size: 64, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !95, file: !22, line: 620, baseType: !129, size: 64, offset: 1632)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !95, file: !22, line: 621, baseType: !11, size: 32, offset: 1696)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !92, file: !22, line: 631, baseType: !161, size: 2880)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !22, line: 626, size: 2880, elements: !162)
!162 = !{!163, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !161, file: !22, line: 629, baseType: !164, size: 1920)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1920, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 30)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !161, file: !22, line: 630, baseType: !168, size: 960, offset: 1920)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 960, elements: !165)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !47, file: !22, line: 636, baseType: !170, size: 64, offset: 4032)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !22, line: 93, size: 6336, elements: !172)
!172 = !{!173, !174, !175, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !171, file: !22, line: 94, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !171, file: !22, line: 95, baseType: !11, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !171, file: !22, line: 97, baseType: !176, size: 2048, offset: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 2048, elements: !180)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null}
!180 = !{!181}
!181 = !DISubrange(count: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !171, file: !22, line: 98, baseType: !183, size: 4160, offset: 2176)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !22, line: 74, size: 4160, elements: !184)
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !183, file: !22, line: 75, baseType: !186, size: 2048)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !180)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !183, file: !22, line: 76, baseType: !186, size: 2048, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !183, file: !22, line: 78, baseType: !80, size: 32, offset: 4096)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !183, file: !22, line: 81, baseType: !80, size: 32, offset: 4128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !47, file: !22, line: 637, baseType: !171, size: 6336, offset: 4096)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !47, file: !22, line: 641, baseType: !192, size: 64, offset: 10432)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !11}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !47, file: !22, line: 646, baseType: !197, size: 192, offset: 10496)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !22, line: 291, size: 192, elements: !198)
!198 = !{!199, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !197, file: !22, line: 293, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !197, file: !22, line: 294, baseType: !11, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !197, file: !22, line: 295, baseType: !51, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !47, file: !22, line: 648, baseType: !204, size: 4224, offset: 10688)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 4224, elements: !124)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !23, file: !22, line: 199, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!44, !46, !4, !209, !11}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !23, file: !22, line: 202, baseType: !212, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !46, !4, !215, !11}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !9, line: 114, baseType: !45)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !23, file: !22, line: 203, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!11, !46, !4}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !23, file: !22, line: 206, baseType: !34, size: 128, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !23, file: !22, line: 207, baseType: !26, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !23, file: !22, line: 208, baseType: !11, size: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !23, file: !22, line: 211, baseType: !224, size: 24, offset: 928)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !124)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !23, file: !22, line: 212, baseType: !226, size: 8, offset: 952)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !82)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !23, file: !22, line: 215, baseType: !34, size: 128, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !23, file: !22, line: 218, baseType: !11, size: 32, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !23, file: !22, line: 219, baseType: !230, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !9, line: 44, baseType: !45)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !23, file: !22, line: 222, baseType: !46, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !23, file: !22, line: 226, baseType: !233, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !9, line: 175, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !235, line: 12, baseType: !11)
!235 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !23, file: !22, line: 228, baseType: !129, size: 64, offset: 1312)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !23, file: !22, line: 229, baseType: !11, size: 32, offset: 1376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !14, file: !1, line: 525, baseType: !239, size: 8192, offset: 128)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1024)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadS", file: !1, line: 596, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoadS", file: !1, line: 593, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !244, file: !1, line: 594, baseType: !209, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !244, file: !1, line: 595, baseType: !6, size: 64, offset: 64)
!248 = !{i32 2, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!252 = distinct !DISubprogram(name: "luaL_argerror", scope: !1, file: !1, line: 43, type: !253, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !259)
!253 = !DISubroutineType(types: !254)
!254 = !{!11, !255, !11, !209}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !257, line: 50, baseType: !258)
!257 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !257, line: 50, flags: DIFlagFwdDecl)
!259 = !{!260, !261, !262, !263}
!260 = !DILocalVariable(name: "L", arg: 1, scope: !252, file: !1, line: 43, type: !255)
!261 = !DILocalVariable(name: "narg", arg: 2, scope: !252, file: !1, line: 43, type: !11)
!262 = !DILocalVariable(name: "extramsg", arg: 3, scope: !252, file: !1, line: 43, type: !209)
!263 = !DILocalVariable(name: "ar", scope: !252, file: !1, line: 44, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !257, line: 326, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !257, line: 346, size: 960, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !280}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !265, file: !257, line: 347, baseType: !11, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !257, line: 348, baseType: !209, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !265, file: !257, line: 349, baseType: !209, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !265, file: !257, line: 350, baseType: !209, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !265, file: !257, line: 351, baseType: !209, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !265, file: !257, line: 352, baseType: !11, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !265, file: !257, line: 353, baseType: !11, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !265, file: !257, line: 354, baseType: !11, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !265, file: !257, line: 355, baseType: !11, size: 32, offset: 416)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !265, file: !257, line: 356, baseType: !277, size: 480, offset: 448)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 480, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 60)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !265, file: !257, line: 358, baseType: !11, size: 32, offset: 928)
!281 = !DILocation(line: 43, column: 42, scope: !252)
!282 = !DILocation(line: 43, column: 49, scope: !252)
!283 = !DILocation(line: 43, column: 67, scope: !252)
!284 = !DILocation(line: 44, column: 3, scope: !252)
!285 = !DILocation(line: 44, column: 13, scope: !252)
!286 = !DILocation(line: 45, column: 8, scope: !287)
!287 = distinct !DILexicalBlock(scope: !252, file: !1, line: 45, column: 7)
!288 = !DILocation(line: 45, column: 7, scope: !252)
!289 = !DILocation(line: 46, column: 12, scope: !287)
!290 = !DILocation(line: 46, column: 5, scope: !287)
!291 = !DILocation(line: 47, column: 3, scope: !252)
!292 = !DILocation(line: 48, column: 17, scope: !293)
!293 = distinct !DILexicalBlock(scope: !252, file: !1, line: 48, column: 7)
!294 = !{!295, !299, i64 16}
!295 = !{!"lua_Debug", !296, i64 0, !299, i64 8, !299, i64 16, !299, i64 24, !299, i64 32, !296, i64 40, !296, i64 44, !296, i64 48, !296, i64 52, !297, i64 56, !296, i64 116}
!296 = !{!"int", !297, i64 0}
!297 = !{!"omnipotent char", !298, i64 0}
!298 = !{!"Simple C/C++ TBAA"}
!299 = !{!"any pointer", !297, i64 0}
!300 = !DILocation(line: 48, column: 7, scope: !293)
!301 = !DILocation(line: 48, column: 37, scope: !293)
!302 = !DILocation(line: 48, column: 7, scope: !252)
!303 = !DILocation(line: 49, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !293, file: !1, line: 48, column: 43)
!305 = !DILocation(line: 50, column: 14, scope: !306)
!306 = distinct !DILexicalBlock(scope: !304, file: !1, line: 50, column: 9)
!307 = !DILocation(line: 50, column: 9, scope: !304)
!308 = !DILocation(line: 52, column: 31, scope: !306)
!309 = !{!295, !299, i64 8}
!310 = !DILocation(line: 51, column: 14, scope: !306)
!311 = !DILocation(line: 51, column: 7, scope: !306)
!312 = !DILocation(line: 54, column: 10, scope: !313)
!313 = distinct !DILexicalBlock(scope: !252, file: !1, line: 54, column: 7)
!314 = !DILocation(line: 54, column: 15, scope: !313)
!315 = !DILocation(line: 54, column: 7, scope: !252)
!316 = !DILocation(line: 55, column: 13, scope: !313)
!317 = !DILocation(line: 55, column: 5, scope: !313)
!318 = !DILocation(line: 57, column: 34, scope: !252)
!319 = !DILocation(line: 56, column: 10, scope: !252)
!320 = !DILocation(line: 56, column: 3, scope: !252)
!321 = !DILocation(line: 0, scope: !287)
!322 = !DILocation(line: 58, column: 1, scope: !252)
!323 = distinct !DISubprogram(name: "luaL_error", scope: !1, file: !1, line: 86, type: !324, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!11, !255, !209, null}
!326 = !{!327, !328, !329}
!327 = !DILocalVariable(name: "L", arg: 1, scope: !323, file: !1, line: 86, type: !255)
!328 = !DILocalVariable(name: "fmt", arg: 2, scope: !323, file: !1, line: 86, type: !209)
!329 = !DILocalVariable(name: "argp", scope: !323, file: !1, line: 87, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !20, line: 46, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !332, line: 51, baseType: !333)
!332 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 87, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 192, elements: !82)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 87, size: 192, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !335, file: !1, line: 87, baseType: !81, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !335, file: !1, line: 87, baseType: !81, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !335, file: !1, line: 87, baseType: !4, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !335, file: !1, line: 87, baseType: !4, size: 64, offset: 128)
!341 = !DILocation(line: 86, column: 39, scope: !323)
!342 = !DILocation(line: 86, column: 54, scope: !323)
!343 = !DILocation(line: 87, column: 3, scope: !323)
!344 = !DILocation(line: 87, column: 11, scope: !323)
!345 = !DILocation(line: 88, column: 3, scope: !323)
!346 = !DILocalVariable(name: "L", arg: 1, scope: !347, file: !1, line: 73, type: !255)
!347 = distinct !DISubprogram(name: "luaL_where", scope: !1, file: !1, line: 73, type: !348, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !255, !11}
!350 = !{!346, !351, !352}
!351 = !DILocalVariable(name: "level", arg: 2, scope: !347, file: !1, line: 73, type: !11)
!352 = !DILocalVariable(name: "ar", scope: !347, file: !1, line: 74, type: !264)
!353 = !DILocation(line: 73, column: 40, scope: !347, inlinedAt: !354)
!354 = distinct !DILocation(line: 89, column: 3, scope: !323)
!355 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !354)
!356 = !DILocation(line: 74, column: 3, scope: !347, inlinedAt: !354)
!357 = !DILocation(line: 74, column: 13, scope: !347, inlinedAt: !354)
!358 = !DILocation(line: 75, column: 7, scope: !359, inlinedAt: !354)
!359 = distinct !DILexicalBlock(scope: !347, file: !1, line: 75, column: 7)
!360 = !DILocation(line: 75, column: 7, scope: !347, inlinedAt: !354)
!361 = !DILocation(line: 76, column: 5, scope: !362, inlinedAt: !354)
!362 = distinct !DILexicalBlock(scope: !359, file: !1, line: 75, column: 36)
!363 = !DILocation(line: 77, column: 12, scope: !364, inlinedAt: !354)
!364 = distinct !DILexicalBlock(scope: !362, file: !1, line: 77, column: 9)
!365 = !{!295, !296, i64 40}
!366 = !DILocation(line: 77, column: 24, scope: !364, inlinedAt: !354)
!367 = !DILocation(line: 77, column: 9, scope: !362, inlinedAt: !354)
!368 = !DILocation(line: 78, column: 37, scope: !369, inlinedAt: !354)
!369 = distinct !DILexicalBlock(scope: !364, file: !1, line: 77, column: 29)
!370 = !DILocation(line: 78, column: 7, scope: !369, inlinedAt: !354)
!371 = !DILocation(line: 79, column: 7, scope: !369, inlinedAt: !354)
!372 = !DILocation(line: 82, column: 3, scope: !347, inlinedAt: !354)
!373 = !DILocation(line: 83, column: 1, scope: !347, inlinedAt: !354)
!374 = !DILocation(line: 0, scope: !323)
!375 = !DILocation(line: 90, column: 3, scope: !323)
!376 = !DILocation(line: 91, column: 3, scope: !323)
!377 = !DILocation(line: 92, column: 3, scope: !323)
!378 = !DILocation(line: 93, column: 10, scope: !323)
!379 = !DILocation(line: 94, column: 1, scope: !323)
!380 = !DILocation(line: 93, column: 3, scope: !323)
!381 = distinct !DISubprogram(name: "luaL_typerror", scope: !1, file: !1, line: 61, type: !253, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !382)
!382 = !{!383, !384, !385, !386}
!383 = !DILocalVariable(name: "L", arg: 1, scope: !381, file: !1, line: 61, type: !255)
!384 = !DILocalVariable(name: "narg", arg: 2, scope: !381, file: !1, line: 61, type: !11)
!385 = !DILocalVariable(name: "tname", arg: 3, scope: !381, file: !1, line: 61, type: !209)
!386 = !DILocalVariable(name: "msg", scope: !381, file: !1, line: 62, type: !209)
!387 = !DILocation(line: 61, column: 42, scope: !381)
!388 = !DILocation(line: 61, column: 49, scope: !381)
!389 = !DILocation(line: 61, column: 67, scope: !381)
!390 = !DILocation(line: 63, column: 44, scope: !381)
!391 = !DILocation(line: 62, column: 21, scope: !381)
!392 = !DILocation(line: 62, column: 15, scope: !381)
!393 = !DILocation(line: 64, column: 10, scope: !381)
!394 = !DILocation(line: 64, column: 3, scope: !381)
!395 = !DILocation(line: 73, column: 40, scope: !347)
!396 = !DILocation(line: 73, column: 47, scope: !347)
!397 = !DILocation(line: 74, column: 3, scope: !347)
!398 = !DILocation(line: 74, column: 13, scope: !347)
!399 = !DILocation(line: 75, column: 7, scope: !359)
!400 = !DILocation(line: 75, column: 7, scope: !347)
!401 = !DILocation(line: 76, column: 5, scope: !362)
!402 = !DILocation(line: 77, column: 12, scope: !364)
!403 = !DILocation(line: 77, column: 24, scope: !364)
!404 = !DILocation(line: 77, column: 9, scope: !362)
!405 = !DILocation(line: 78, column: 37, scope: !369)
!406 = !DILocation(line: 78, column: 7, scope: !369)
!407 = !DILocation(line: 79, column: 7, scope: !369)
!408 = !DILocation(line: 82, column: 3, scope: !347)
!409 = !DILocation(line: 83, column: 1, scope: !347)
!410 = !DILocation(line: 0, scope: !369)
!411 = distinct !DISubprogram(name: "luaL_checkoption", scope: !1, file: !1, line: 99, type: !412, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !416)
!412 = !DISubroutineType(types: !413)
!413 = !{!11, !255, !11, !209, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!416 = !{!417, !418, !419, !420, !421, !422}
!417 = !DILocalVariable(name: "L", arg: 1, scope: !411, file: !1, line: 99, type: !255)
!418 = !DILocalVariable(name: "narg", arg: 2, scope: !411, file: !1, line: 99, type: !11)
!419 = !DILocalVariable(name: "def", arg: 3, scope: !411, file: !1, line: 99, type: !209)
!420 = !DILocalVariable(name: "lst", arg: 4, scope: !411, file: !1, line: 100, type: !414)
!421 = !DILocalVariable(name: "name", scope: !411, file: !1, line: 101, type: !209)
!422 = !DILocalVariable(name: "i", scope: !411, file: !1, line: 103, type: !11)
!423 = !DILocation(line: 99, column: 45, scope: !411)
!424 = !DILocation(line: 99, column: 52, scope: !411)
!425 = !DILocation(line: 99, column: 70, scope: !411)
!426 = !DILocation(line: 100, column: 52, scope: !411)
!427 = !DILocation(line: 101, column: 22, scope: !411)
!428 = !DILocalVariable(name: "L", arg: 1, scope: !429, file: !1, line: 165, type: !255)
!429 = distinct !DISubprogram(name: "luaL_optlstring", scope: !1, file: !1, line: 165, type: !430, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !433)
!430 = !DISubroutineType(types: !431)
!431 = !{!209, !255, !11, !209, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!433 = !{!428, !434, !435, !436}
!434 = !DILocalVariable(name: "narg", arg: 2, scope: !429, file: !1, line: 165, type: !11)
!435 = !DILocalVariable(name: "def", arg: 3, scope: !429, file: !1, line: 166, type: !209)
!436 = !DILocalVariable(name: "len", arg: 4, scope: !429, file: !1, line: 166, type: !432)
!437 = !DILocation(line: 165, column: 52, scope: !429, inlinedAt: !438)
!438 = distinct !DILocation(line: 101, column: 30, scope: !411)
!439 = !DILocation(line: 165, column: 59, scope: !429, inlinedAt: !438)
!440 = !DILocation(line: 166, column: 53, scope: !429, inlinedAt: !438)
!441 = !DILocation(line: 166, column: 66, scope: !429, inlinedAt: !438)
!442 = !DILocation(line: 167, column: 7, scope: !443, inlinedAt: !438)
!443 = distinct !DILexicalBlock(scope: !429, file: !1, line: 167, column: 7)
!444 = !DILocation(line: 167, column: 7, scope: !429, inlinedAt: !438)
!445 = !DILocation(line: 168, column: 9, scope: !446, inlinedAt: !438)
!446 = distinct !DILexicalBlock(scope: !443, file: !1, line: 167, column: 33)
!447 = !DILocation(line: 170, column: 5, scope: !446, inlinedAt: !438)
!448 = !DILocation(line: 172, column: 15, scope: !443, inlinedAt: !438)
!449 = !DILocation(line: 172, column: 8, scope: !443, inlinedAt: !438)
!450 = !DILocation(line: 0, scope: !443, inlinedAt: !438)
!451 = !DILocation(line: 0, scope: !411)
!452 = !DILocation(line: 173, column: 1, scope: !429, inlinedAt: !438)
!453 = !DILocation(line: 102, column: 30, scope: !411)
!454 = !DILocation(line: 101, column: 15, scope: !411)
!455 = !DILocation(line: 103, column: 7, scope: !411)
!456 = !DILocation(line: 104, column: 8, scope: !457)
!457 = distinct !DILexicalBlock(scope: !411, file: !1, line: 104, column: 3)
!458 = !DILocation(line: 104, column: 13, scope: !459)
!459 = distinct !DILexicalBlock(scope: !457, file: !1, line: 104, column: 3)
!460 = !{!299, !299, i64 0}
!461 = !DILocation(line: 104, column: 3, scope: !457)
!462 = !DILocation(line: 105, column: 9, scope: !463)
!463 = distinct !DILexicalBlock(scope: !459, file: !1, line: 105, column: 9)
!464 = !DILocation(line: 105, column: 30, scope: !463)
!465 = !DILocation(line: 105, column: 9, scope: !459)
!466 = !DILocation(line: 106, column: 7, scope: !463)
!467 = !DILocation(line: 104, column: 22, scope: !459)
!468 = !DILocation(line: 104, column: 3, scope: !459)
!469 = distinct !{!469, !461, !470}
!470 = !DILocation(line: 106, column: 14, scope: !457)
!471 = !DILocation(line: 108, column: 24, scope: !411)
!472 = !DILocation(line: 107, column: 10, scope: !411)
!473 = !DILocation(line: 107, column: 3, scope: !411)
!474 = !DILocation(line: 0, scope: !463)
!475 = !DILocation(line: 109, column: 1, scope: !411)
!476 = !DILocation(line: 165, column: 52, scope: !429)
!477 = !DILocation(line: 165, column: 59, scope: !429)
!478 = !DILocation(line: 166, column: 53, scope: !429)
!479 = !DILocation(line: 166, column: 66, scope: !429)
!480 = !DILocation(line: 167, column: 7, scope: !443)
!481 = !DILocation(line: 167, column: 7, scope: !429)
!482 = !DILocation(line: 168, column: 9, scope: !483)
!483 = distinct !DILexicalBlock(scope: !446, file: !1, line: 168, column: 9)
!484 = !DILocation(line: 168, column: 9, scope: !446)
!485 = !DILocation(line: 169, column: 15, scope: !483)
!486 = !DILocation(line: 169, column: 21, scope: !483)
!487 = !DILocation(line: 169, column: 12, scope: !483)
!488 = !{!489, !489, i64 0}
!489 = !{!"long", !297, i64 0}
!490 = !DILocation(line: 169, column: 7, scope: !483)
!491 = !DILocation(line: 172, column: 15, scope: !443)
!492 = !DILocation(line: 172, column: 8, scope: !443)
!493 = !DILocation(line: 0, scope: !443)
!494 = !DILocation(line: 0, scope: !446)
!495 = !DILocation(line: 173, column: 1, scope: !429)
!496 = distinct !DISubprogram(name: "luaL_checklstring", scope: !1, file: !1, line: 158, type: !497, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!209, !255, !11, !432}
!499 = !{!500, !501, !502, !503}
!500 = !DILocalVariable(name: "L", arg: 1, scope: !496, file: !1, line: 158, type: !255)
!501 = !DILocalVariable(name: "narg", arg: 2, scope: !496, file: !1, line: 158, type: !11)
!502 = !DILocalVariable(name: "len", arg: 3, scope: !496, file: !1, line: 158, type: !432)
!503 = !DILocalVariable(name: "s", scope: !496, file: !1, line: 159, type: !209)
!504 = !DILocation(line: 158, column: 54, scope: !496)
!505 = !DILocation(line: 158, column: 61, scope: !496)
!506 = !DILocation(line: 158, column: 75, scope: !496)
!507 = !DILocation(line: 159, column: 19, scope: !496)
!508 = !DILocation(line: 159, column: 15, scope: !496)
!509 = !DILocation(line: 160, column: 8, scope: !510)
!510 = distinct !DILexicalBlock(scope: !496, file: !1, line: 160, column: 7)
!511 = !DILocation(line: 160, column: 7, scope: !496)
!512 = !DILocalVariable(name: "L", arg: 1, scope: !513, file: !1, line: 68, type: !255)
!513 = distinct !DISubprogram(name: "tag_error", scope: !1, file: !1, line: 68, type: !514, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !516)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !255, !11, !11}
!516 = !{!512, !517, !518}
!517 = !DILocalVariable(name: "narg", arg: 2, scope: !513, file: !1, line: 68, type: !11)
!518 = !DILocalVariable(name: "tag", arg: 3, scope: !513, file: !1, line: 68, type: !11)
!519 = !DILocation(line: 68, column: 35, scope: !513, inlinedAt: !520)
!520 = distinct !DILocation(line: 160, column: 11, scope: !510)
!521 = !DILocation(line: 68, column: 42, scope: !513, inlinedAt: !520)
!522 = !DILocation(line: 68, column: 52, scope: !513, inlinedAt: !520)
!523 = !DILocation(line: 69, column: 26, scope: !513, inlinedAt: !520)
!524 = !DILocation(line: 61, column: 42, scope: !381, inlinedAt: !525)
!525 = distinct !DILocation(line: 69, column: 3, scope: !513, inlinedAt: !520)
!526 = !DILocation(line: 61, column: 49, scope: !381, inlinedAt: !525)
!527 = !DILocation(line: 61, column: 67, scope: !381, inlinedAt: !525)
!528 = !DILocation(line: 63, column: 44, scope: !381, inlinedAt: !525)
!529 = !DILocation(line: 62, column: 21, scope: !381, inlinedAt: !525)
!530 = !DILocation(line: 62, column: 15, scope: !381, inlinedAt: !525)
!531 = !DILocation(line: 64, column: 10, scope: !381, inlinedAt: !525)
!532 = !DILocation(line: 64, column: 3, scope: !381, inlinedAt: !525)
!533 = !DILocation(line: 70, column: 1, scope: !513, inlinedAt: !520)
!534 = !DILocation(line: 160, column: 11, scope: !510)
!535 = !DILocation(line: 161, column: 3, scope: !496)
!536 = distinct !DISubprogram(name: "luaL_newmetatable", scope: !1, file: !1, line: 112, type: !537, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!11, !255, !209}
!539 = !{!540, !541}
!540 = !DILocalVariable(name: "L", arg: 1, scope: !536, file: !1, line: 112, type: !255)
!541 = !DILocalVariable(name: "tname", arg: 2, scope: !536, file: !1, line: 112, type: !209)
!542 = !DILocation(line: 112, column: 46, scope: !536)
!543 = !DILocation(line: 112, column: 61, scope: !536)
!544 = !DILocation(line: 113, column: 3, scope: !536)
!545 = !DILocation(line: 114, column: 8, scope: !546)
!546 = distinct !DILexicalBlock(scope: !536, file: !1, line: 114, column: 7)
!547 = !DILocation(line: 114, column: 7, scope: !536)
!548 = !DILocation(line: 116, column: 3, scope: !536)
!549 = !DILocation(line: 117, column: 3, scope: !536)
!550 = !DILocation(line: 118, column: 3, scope: !536)
!551 = !DILocation(line: 119, column: 3, scope: !536)
!552 = !DILocation(line: 120, column: 3, scope: !536)
!553 = !DILocation(line: 0, scope: !546)
!554 = !DILocation(line: 121, column: 1, scope: !536)
!555 = distinct !DISubprogram(name: "luaL_checkudata", scope: !1, file: !1, line: 124, type: !556, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{!4, !255, !11, !209}
!558 = !{!559, !560, !561, !562}
!559 = !DILocalVariable(name: "L", arg: 1, scope: !555, file: !1, line: 124, type: !255)
!560 = !DILocalVariable(name: "ud", arg: 2, scope: !555, file: !1, line: 124, type: !11)
!561 = !DILocalVariable(name: "tname", arg: 3, scope: !555, file: !1, line: 124, type: !209)
!562 = !DILocalVariable(name: "p", scope: !555, file: !1, line: 125, type: !4)
!563 = !DILocation(line: 124, column: 46, scope: !555)
!564 = !DILocation(line: 124, column: 53, scope: !555)
!565 = !DILocation(line: 124, column: 69, scope: !555)
!566 = !DILocation(line: 125, column: 13, scope: !555)
!567 = !DILocation(line: 125, column: 9, scope: !555)
!568 = !DILocation(line: 126, column: 9, scope: !569)
!569 = distinct !DILexicalBlock(scope: !555, file: !1, line: 126, column: 7)
!570 = !DILocation(line: 126, column: 7, scope: !555)
!571 = !DILocation(line: 127, column: 9, scope: !572)
!572 = distinct !DILexicalBlock(scope: !573, file: !1, line: 127, column: 9)
!573 = distinct !DILexicalBlock(scope: !569, file: !1, line: 126, column: 18)
!574 = !DILocation(line: 127, column: 9, scope: !573)
!575 = !DILocation(line: 128, column: 7, scope: !576)
!576 = distinct !DILexicalBlock(scope: !572, file: !1, line: 127, column: 34)
!577 = !DILocation(line: 129, column: 11, scope: !578)
!578 = distinct !DILexicalBlock(scope: !576, file: !1, line: 129, column: 11)
!579 = !DILocation(line: 129, column: 11, scope: !576)
!580 = !DILocation(line: 130, column: 9, scope: !581)
!581 = distinct !DILexicalBlock(scope: !578, file: !1, line: 129, column: 36)
!582 = !DILocation(line: 131, column: 9, scope: !581)
!583 = !DILocation(line: 61, column: 42, scope: !381, inlinedAt: !584)
!584 = distinct !DILocation(line: 135, column: 3, scope: !555)
!585 = !DILocation(line: 61, column: 49, scope: !381, inlinedAt: !584)
!586 = !DILocation(line: 61, column: 67, scope: !381, inlinedAt: !584)
!587 = !DILocation(line: 63, column: 44, scope: !381, inlinedAt: !584)
!588 = !DILocation(line: 62, column: 21, scope: !381, inlinedAt: !584)
!589 = !DILocation(line: 62, column: 15, scope: !381, inlinedAt: !584)
!590 = !DILocation(line: 64, column: 10, scope: !381, inlinedAt: !584)
!591 = !DILocation(line: 64, column: 3, scope: !381, inlinedAt: !584)
!592 = !DILocation(line: 136, column: 3, scope: !555)
!593 = !DILocation(line: 0, scope: !555)
!594 = !DILocation(line: 0, scope: !581)
!595 = !DILocation(line: 137, column: 1, scope: !555)
!596 = distinct !DISubprogram(name: "luaL_checkstack", scope: !1, file: !1, line: 140, type: !597, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !255, !11, !209}
!599 = !{!600, !601, !602}
!600 = !DILocalVariable(name: "L", arg: 1, scope: !596, file: !1, line: 140, type: !255)
!601 = !DILocalVariable(name: "space", arg: 2, scope: !596, file: !1, line: 140, type: !11)
!602 = !DILocalVariable(name: "mes", arg: 3, scope: !596, file: !1, line: 140, type: !209)
!603 = !DILocation(line: 140, column: 45, scope: !596)
!604 = !DILocation(line: 140, column: 52, scope: !596)
!605 = !DILocation(line: 140, column: 71, scope: !596)
!606 = !DILocation(line: 141, column: 8, scope: !607)
!607 = distinct !DILexicalBlock(scope: !596, file: !1, line: 141, column: 7)
!608 = !DILocation(line: 141, column: 7, scope: !596)
!609 = !DILocation(line: 142, column: 5, scope: !607)
!610 = !DILocation(line: 143, column: 1, scope: !596)
!611 = distinct !DISubprogram(name: "luaL_checktype", scope: !1, file: !1, line: 146, type: !514, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !612)
!612 = !{!613, !614, !615}
!613 = !DILocalVariable(name: "L", arg: 1, scope: !611, file: !1, line: 146, type: !255)
!614 = !DILocalVariable(name: "narg", arg: 2, scope: !611, file: !1, line: 146, type: !11)
!615 = !DILocalVariable(name: "t", arg: 3, scope: !611, file: !1, line: 146, type: !11)
!616 = !DILocation(line: 146, column: 44, scope: !611)
!617 = !DILocation(line: 146, column: 51, scope: !611)
!618 = !DILocation(line: 146, column: 61, scope: !611)
!619 = !DILocation(line: 147, column: 7, scope: !620)
!620 = distinct !DILexicalBlock(scope: !611, file: !1, line: 147, column: 7)
!621 = !DILocation(line: 147, column: 25, scope: !620)
!622 = !DILocation(line: 147, column: 7, scope: !611)
!623 = !DILocation(line: 68, column: 35, scope: !513, inlinedAt: !624)
!624 = distinct !DILocation(line: 148, column: 5, scope: !620)
!625 = !DILocation(line: 68, column: 42, scope: !513, inlinedAt: !624)
!626 = !DILocation(line: 68, column: 52, scope: !513, inlinedAt: !624)
!627 = !DILocation(line: 69, column: 26, scope: !513, inlinedAt: !624)
!628 = !DILocation(line: 61, column: 42, scope: !381, inlinedAt: !629)
!629 = distinct !DILocation(line: 69, column: 3, scope: !513, inlinedAt: !624)
!630 = !DILocation(line: 61, column: 49, scope: !381, inlinedAt: !629)
!631 = !DILocation(line: 61, column: 67, scope: !381, inlinedAt: !629)
!632 = !DILocation(line: 63, column: 44, scope: !381, inlinedAt: !629)
!633 = !DILocation(line: 62, column: 21, scope: !381, inlinedAt: !629)
!634 = !DILocation(line: 62, column: 15, scope: !381, inlinedAt: !629)
!635 = !DILocation(line: 64, column: 10, scope: !381, inlinedAt: !629)
!636 = !DILocation(line: 64, column: 3, scope: !381, inlinedAt: !629)
!637 = !DILocation(line: 70, column: 1, scope: !513, inlinedAt: !624)
!638 = !DILocation(line: 148, column: 5, scope: !620)
!639 = !DILocation(line: 149, column: 1, scope: !611)
!640 = distinct !DISubprogram(name: "luaL_checkany", scope: !1, file: !1, line: 152, type: !348, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !641)
!641 = !{!642, !643}
!642 = !DILocalVariable(name: "L", arg: 1, scope: !640, file: !1, line: 152, type: !255)
!643 = !DILocalVariable(name: "narg", arg: 2, scope: !640, file: !1, line: 152, type: !11)
!644 = !DILocation(line: 152, column: 43, scope: !640)
!645 = !DILocation(line: 152, column: 50, scope: !640)
!646 = !DILocation(line: 153, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !640, file: !1, line: 153, column: 7)
!648 = !DILocation(line: 153, column: 25, scope: !647)
!649 = !DILocation(line: 153, column: 7, scope: !640)
!650 = !DILocation(line: 154, column: 5, scope: !647)
!651 = !DILocation(line: 155, column: 1, scope: !640)
!652 = distinct !DISubprogram(name: "luaL_checknumber", scope: !1, file: !1, line: 176, type: !653, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !657)
!653 = !DISubroutineType(types: !654)
!654 = !{!655, !255, !11}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !257, line: 99, baseType: !656)
!656 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!657 = !{!658, !659, !660}
!658 = !DILocalVariable(name: "L", arg: 1, scope: !652, file: !1, line: 176, type: !255)
!659 = !DILocalVariable(name: "narg", arg: 2, scope: !652, file: !1, line: 176, type: !11)
!660 = !DILocalVariable(name: "d", scope: !652, file: !1, line: 177, type: !655)
!661 = !DILocation(line: 176, column: 52, scope: !652)
!662 = !DILocation(line: 176, column: 59, scope: !652)
!663 = !DILocation(line: 177, column: 18, scope: !652)
!664 = !DILocation(line: 177, column: 14, scope: !652)
!665 = !DILocation(line: 178, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !652, file: !1, line: 178, column: 7)
!667 = !DILocation(line: 178, column: 14, scope: !666)
!668 = !DILocation(line: 178, column: 18, scope: !666)
!669 = !DILocation(line: 178, column: 7, scope: !652)
!670 = !DILocation(line: 68, column: 35, scope: !513, inlinedAt: !671)
!671 = distinct !DILocation(line: 179, column: 5, scope: !666)
!672 = !DILocation(line: 68, column: 42, scope: !513, inlinedAt: !671)
!673 = !DILocation(line: 68, column: 52, scope: !513, inlinedAt: !671)
!674 = !DILocation(line: 69, column: 26, scope: !513, inlinedAt: !671)
!675 = !DILocation(line: 61, column: 42, scope: !381, inlinedAt: !676)
!676 = distinct !DILocation(line: 69, column: 3, scope: !513, inlinedAt: !671)
!677 = !DILocation(line: 61, column: 49, scope: !381, inlinedAt: !676)
!678 = !DILocation(line: 61, column: 67, scope: !381, inlinedAt: !676)
!679 = !DILocation(line: 63, column: 44, scope: !381, inlinedAt: !676)
!680 = !DILocation(line: 62, column: 21, scope: !381, inlinedAt: !676)
!681 = !DILocation(line: 62, column: 15, scope: !381, inlinedAt: !676)
!682 = !DILocation(line: 64, column: 10, scope: !381, inlinedAt: !676)
!683 = !DILocation(line: 64, column: 3, scope: !381, inlinedAt: !676)
!684 = !DILocation(line: 70, column: 1, scope: !513, inlinedAt: !671)
!685 = !DILocation(line: 179, column: 5, scope: !666)
!686 = !DILocation(line: 180, column: 3, scope: !652)
!687 = distinct !DISubprogram(name: "luaL_optnumber", scope: !1, file: !1, line: 184, type: !688, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!655, !255, !11, !655}
!690 = !{!691, !692, !693}
!691 = !DILocalVariable(name: "L", arg: 1, scope: !687, file: !1, line: 184, type: !255)
!692 = !DILocalVariable(name: "narg", arg: 2, scope: !687, file: !1, line: 184, type: !11)
!693 = !DILocalVariable(name: "def", arg: 3, scope: !687, file: !1, line: 184, type: !655)
!694 = !DILocation(line: 184, column: 50, scope: !687)
!695 = !DILocation(line: 184, column: 57, scope: !687)
!696 = !DILocation(line: 184, column: 74, scope: !687)
!697 = !DILocation(line: 185, column: 10, scope: !687)
!698 = !DILocation(line: 185, column: 3, scope: !687)
!699 = distinct !DISubprogram(name: "luaL_checkinteger", scope: !1, file: !1, line: 189, type: !700, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !704)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !255, !11}
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Integer", file: !257, line: 103, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !138, line: 49, baseType: !45)
!704 = !{!705, !706, !707}
!705 = !DILocalVariable(name: "L", arg: 1, scope: !699, file: !1, line: 189, type: !255)
!706 = !DILocalVariable(name: "narg", arg: 2, scope: !699, file: !1, line: 189, type: !11)
!707 = !DILocalVariable(name: "d", scope: !699, file: !1, line: 190, type: !702)
!708 = !DILocation(line: 189, column: 54, scope: !699)
!709 = !DILocation(line: 189, column: 61, scope: !699)
!710 = !DILocation(line: 190, column: 19, scope: !699)
!711 = !DILocation(line: 190, column: 15, scope: !699)
!712 = !DILocation(line: 191, column: 9, scope: !713)
!713 = distinct !DILexicalBlock(scope: !699, file: !1, line: 191, column: 7)
!714 = !DILocation(line: 191, column: 14, scope: !713)
!715 = !DILocation(line: 191, column: 18, scope: !713)
!716 = !DILocation(line: 191, column: 7, scope: !699)
!717 = !DILocation(line: 68, column: 35, scope: !513, inlinedAt: !718)
!718 = distinct !DILocation(line: 192, column: 5, scope: !713)
!719 = !DILocation(line: 68, column: 42, scope: !513, inlinedAt: !718)
!720 = !DILocation(line: 68, column: 52, scope: !513, inlinedAt: !718)
!721 = !DILocation(line: 69, column: 26, scope: !513, inlinedAt: !718)
!722 = !DILocation(line: 61, column: 42, scope: !381, inlinedAt: !723)
!723 = distinct !DILocation(line: 69, column: 3, scope: !513, inlinedAt: !718)
!724 = !DILocation(line: 61, column: 49, scope: !381, inlinedAt: !723)
!725 = !DILocation(line: 61, column: 67, scope: !381, inlinedAt: !723)
!726 = !DILocation(line: 63, column: 44, scope: !381, inlinedAt: !723)
!727 = !DILocation(line: 62, column: 21, scope: !381, inlinedAt: !723)
!728 = !DILocation(line: 62, column: 15, scope: !381, inlinedAt: !723)
!729 = !DILocation(line: 64, column: 10, scope: !381, inlinedAt: !723)
!730 = !DILocation(line: 64, column: 3, scope: !381, inlinedAt: !723)
!731 = !DILocation(line: 70, column: 1, scope: !513, inlinedAt: !718)
!732 = !DILocation(line: 192, column: 5, scope: !713)
!733 = !DILocation(line: 193, column: 3, scope: !699)
!734 = distinct !DISubprogram(name: "luaL_optinteger", scope: !1, file: !1, line: 197, type: !735, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!702, !255, !11, !702}
!737 = !{!738, !739, !740}
!738 = !DILocalVariable(name: "L", arg: 1, scope: !734, file: !1, line: 197, type: !255)
!739 = !DILocalVariable(name: "narg", arg: 2, scope: !734, file: !1, line: 197, type: !11)
!740 = !DILocalVariable(name: "def", arg: 3, scope: !734, file: !1, line: 198, type: !702)
!741 = !DILocation(line: 197, column: 52, scope: !734)
!742 = !DILocation(line: 197, column: 59, scope: !734)
!743 = !DILocation(line: 198, column: 67, scope: !734)
!744 = !DILocation(line: 199, column: 10, scope: !734)
!745 = !DILocation(line: 199, column: 3, scope: !734)
!746 = distinct !DISubprogram(name: "luaL_getmetafield", scope: !1, file: !1, line: 203, type: !253, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !747)
!747 = !{!748, !749, !750}
!748 = !DILocalVariable(name: "L", arg: 1, scope: !746, file: !1, line: 203, type: !255)
!749 = !DILocalVariable(name: "obj", arg: 2, scope: !746, file: !1, line: 203, type: !11)
!750 = !DILocalVariable(name: "event", arg: 3, scope: !746, file: !1, line: 203, type: !209)
!751 = !DILocation(line: 203, column: 46, scope: !746)
!752 = !DILocation(line: 203, column: 53, scope: !746)
!753 = !DILocation(line: 203, column: 70, scope: !746)
!754 = !DILocation(line: 204, column: 8, scope: !755)
!755 = distinct !DILexicalBlock(scope: !746, file: !1, line: 204, column: 7)
!756 = !DILocation(line: 204, column: 7, scope: !746)
!757 = !DILocation(line: 206, column: 3, scope: !746)
!758 = !DILocation(line: 207, column: 3, scope: !746)
!759 = !DILocation(line: 208, column: 7, scope: !760)
!760 = distinct !DILexicalBlock(scope: !746, file: !1, line: 208, column: 7)
!761 = !DILocation(line: 208, column: 7, scope: !746)
!762 = !DILocation(line: 209, column: 5, scope: !763)
!763 = distinct !DILexicalBlock(scope: !760, file: !1, line: 208, column: 25)
!764 = !DILocation(line: 210, column: 5, scope: !763)
!765 = !DILocation(line: 213, column: 5, scope: !766)
!766 = distinct !DILexicalBlock(scope: !760, file: !1, line: 212, column: 8)
!767 = !DILocation(line: 214, column: 5, scope: !766)
!768 = !DILocation(line: 0, scope: !755)
!769 = !DILocation(line: 216, column: 1, scope: !746)
!770 = distinct !DISubprogram(name: "luaL_callmeta", scope: !1, file: !1, line: 219, type: !253, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !771)
!771 = !{!772, !773, !774}
!772 = !DILocalVariable(name: "L", arg: 1, scope: !770, file: !1, line: 219, type: !255)
!773 = !DILocalVariable(name: "obj", arg: 2, scope: !770, file: !1, line: 219, type: !11)
!774 = !DILocalVariable(name: "event", arg: 3, scope: !770, file: !1, line: 219, type: !209)
!775 = !DILocation(line: 219, column: 42, scope: !770)
!776 = !DILocation(line: 219, column: 49, scope: !770)
!777 = !DILocation(line: 219, column: 66, scope: !770)
!778 = !DILocation(line: 220, column: 9, scope: !770)
!779 = !DILocation(line: 221, column: 8, scope: !780)
!780 = distinct !DILexicalBlock(scope: !770, file: !1, line: 221, column: 7)
!781 = !DILocation(line: 221, column: 7, scope: !770)
!782 = !DILocation(line: 223, column: 3, scope: !770)
!783 = !DILocation(line: 224, column: 3, scope: !770)
!784 = !DILocation(line: 225, column: 3, scope: !770)
!785 = !DILocation(line: 0, scope: !780)
!786 = !DILocation(line: 226, column: 1, scope: !770)
!787 = distinct !DISubprogram(name: "luaL_register", scope: !1, file: !1, line: 229, type: !788, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !802)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !255, !209, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !793, line: 38, baseType: !794)
!793 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !793, line: 35, size: 128, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !793, line: 36, baseType: !209, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !794, file: !793, line: 37, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !257, line: 52, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!11, !255}
!802 = !{!803, !804, !805}
!803 = !DILocalVariable(name: "L", arg: 1, scope: !787, file: !1, line: 229, type: !255)
!804 = !DILocalVariable(name: "libname", arg: 2, scope: !787, file: !1, line: 229, type: !209)
!805 = !DILocalVariable(name: "l", arg: 3, scope: !787, file: !1, line: 230, type: !790)
!806 = !DILocation(line: 229, column: 45, scope: !787)
!807 = !DILocation(line: 229, column: 60, scope: !787)
!808 = !DILocation(line: 230, column: 49, scope: !787)
!809 = !DILocation(line: 231, column: 3, scope: !787)
!810 = !DILocation(line: 232, column: 1, scope: !787)
!811 = distinct !DISubprogram(name: "luaL_openlib", scope: !1, file: !1, line: 242, type: !812, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !255, !209, !790, !11}
!814 = !{!815, !816, !817, !818, !819, !822}
!815 = !DILocalVariable(name: "L", arg: 1, scope: !811, file: !1, line: 242, type: !255)
!816 = !DILocalVariable(name: "libname", arg: 2, scope: !811, file: !1, line: 242, type: !209)
!817 = !DILocalVariable(name: "l", arg: 3, scope: !811, file: !1, line: 243, type: !790)
!818 = !DILocalVariable(name: "nup", arg: 4, scope: !811, file: !1, line: 243, type: !11)
!819 = !DILocalVariable(name: "size", scope: !820, file: !1, line: 245, type: !11)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 244, column: 16)
!821 = distinct !DILexicalBlock(scope: !811, file: !1, line: 244, column: 7)
!822 = !DILocalVariable(name: "i", scope: !823, file: !1, line: 261, type: !11)
!823 = distinct !DILexicalBlock(scope: !824, file: !1, line: 260, column: 24)
!824 = distinct !DILexicalBlock(scope: !825, file: !1, line: 260, column: 3)
!825 = distinct !DILexicalBlock(scope: !811, file: !1, line: 260, column: 3)
!826 = !DILocation(line: 242, column: 42, scope: !811)
!827 = !DILocation(line: 242, column: 57, scope: !811)
!828 = !DILocation(line: 243, column: 47, scope: !811)
!829 = !DILocation(line: 243, column: 54, scope: !811)
!830 = !DILocation(line: 244, column: 7, scope: !821)
!831 = !DILocation(line: 244, column: 7, scope: !811)
!832 = !DILocation(line: 260, column: 13, scope: !824)
!833 = !DILocalVariable(name: "l", arg: 1, scope: !834, file: !1, line: 235, type: !790)
!834 = distinct !DISubprogram(name: "libsize", scope: !1, file: !1, line: 235, type: !835, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!11, !790}
!837 = !{!833, !838}
!838 = !DILocalVariable(name: "size", scope: !834, file: !1, line: 236, type: !11)
!839 = !DILocation(line: 235, column: 37, scope: !834, inlinedAt: !840)
!840 = distinct !DILocation(line: 245, column: 16, scope: !820)
!841 = !DILocation(line: 236, column: 7, scope: !834, inlinedAt: !840)
!842 = !DILocation(line: 237, column: 3, scope: !834, inlinedAt: !840)
!843 = !DILocation(line: 237, column: 13, scope: !844, inlinedAt: !840)
!844 = distinct !DILexicalBlock(scope: !845, file: !1, line: 237, column: 3)
!845 = distinct !DILexicalBlock(scope: !834, file: !1, line: 237, column: 3)
!846 = !{!847, !299, i64 0}
!847 = !{!"luaL_Reg", !299, i64 0, !299, i64 8}
!848 = !DILocation(line: 237, column: 3, scope: !845, inlinedAt: !840)
!849 = !DILocation(line: 237, column: 28, scope: !844, inlinedAt: !840)
!850 = !DILocation(line: 237, column: 20, scope: !844, inlinedAt: !840)
!851 = !DILocation(line: 237, column: 3, scope: !844, inlinedAt: !840)
!852 = distinct !{!852, !853, !854}
!853 = !DILocation(line: 237, column: 3, scope: !845)
!854 = !DILocation(line: 237, column: 28, scope: !845)
!855 = !DILocation(line: 0, scope: !844, inlinedAt: !840)
!856 = !DILocation(line: 238, column: 3, scope: !834, inlinedAt: !840)
!857 = !DILocation(line: 245, column: 9, scope: !820)
!858 = !DILocation(line: 247, column: 5, scope: !820)
!859 = !DILocation(line: 248, column: 5, scope: !820)
!860 = !DILocation(line: 249, column: 10, scope: !861)
!861 = distinct !DILexicalBlock(scope: !820, file: !1, line: 249, column: 9)
!862 = !DILocation(line: 249, column: 9, scope: !820)
!863 = !DILocation(line: 250, column: 7, scope: !864)
!864 = distinct !DILexicalBlock(scope: !861, file: !1, line: 249, column: 30)
!865 = !DILocation(line: 252, column: 11, scope: !866)
!866 = distinct !DILexicalBlock(scope: !864, file: !1, line: 252, column: 11)
!867 = !DILocation(line: 252, column: 62, scope: !866)
!868 = !DILocation(line: 252, column: 11, scope: !864)
!869 = !DILocation(line: 253, column: 9, scope: !866)
!870 = !DILocation(line: 254, column: 7, scope: !864)
!871 = !DILocation(line: 255, column: 7, scope: !864)
!872 = !DILocation(line: 256, column: 5, scope: !864)
!873 = !DILocation(line: 257, column: 5, scope: !820)
!874 = !DILocation(line: 258, column: 19, scope: !820)
!875 = !DILocation(line: 258, column: 5, scope: !820)
!876 = !DILocation(line: 259, column: 3, scope: !820)
!877 = !DILocation(line: 260, column: 3, scope: !811)
!878 = !DILocation(line: 260, column: 3, scope: !825)
!879 = !DILocation(line: 261, column: 9, scope: !823)
!880 = !DILocation(line: 262, column: 10, scope: !881)
!881 = distinct !DILexicalBlock(scope: !823, file: !1, line: 262, column: 5)
!882 = !DILocation(line: 262, column: 5, scope: !881)
!883 = !DILocation(line: 263, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !881, file: !1, line: 262, column: 5)
!885 = !DILocation(line: 262, column: 23, scope: !884)
!886 = !DILocation(line: 262, column: 5, scope: !884)
!887 = !DILocation(line: 262, column: 16, scope: !884)
!888 = distinct !{!888, !882, !889}
!889 = !DILocation(line: 263, column: 28, scope: !881)
!890 = !DILocation(line: 264, column: 28, scope: !823)
!891 = !{!847, !299, i64 8}
!892 = !DILocation(line: 264, column: 5, scope: !823)
!893 = !DILocation(line: 265, column: 34, scope: !823)
!894 = !DILocation(line: 265, column: 5, scope: !823)
!895 = !DILocation(line: 260, column: 20, scope: !824)
!896 = !DILocation(line: 260, column: 3, scope: !824)
!897 = distinct !{!897, !878, !898}
!898 = !DILocation(line: 266, column: 3, scope: !825)
!899 = !DILocation(line: 267, column: 3, scope: !811)
!900 = !DILocation(line: 268, column: 1, scope: !811)
!901 = distinct !DISubprogram(name: "luaL_findtable", scope: !1, file: !1, line: 357, type: !902, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{!209, !255, !11, !209, !11}
!904 = !{!905, !906, !907, !908, !909}
!905 = !DILocalVariable(name: "L", arg: 1, scope: !901, file: !1, line: 357, type: !255)
!906 = !DILocalVariable(name: "idx", arg: 2, scope: !901, file: !1, line: 357, type: !11)
!907 = !DILocalVariable(name: "fname", arg: 3, scope: !901, file: !1, line: 358, type: !209)
!908 = !DILocalVariable(name: "szhint", arg: 4, scope: !901, file: !1, line: 358, type: !11)
!909 = !DILocalVariable(name: "e", scope: !901, file: !1, line: 359, type: !209)
!910 = !DILocation(line: 357, column: 51, scope: !901)
!911 = !DILocation(line: 357, column: 58, scope: !901)
!912 = !DILocation(line: 358, column: 52, scope: !901)
!913 = !DILocation(line: 358, column: 63, scope: !901)
!914 = !DILocation(line: 360, column: 3, scope: !901)
!915 = !DILocation(line: 361, column: 3, scope: !901)
!916 = !DILocation(line: 362, column: 9, scope: !917)
!917 = distinct !DILexicalBlock(scope: !901, file: !1, line: 361, column: 6)
!918 = !DILocation(line: 359, column: 15, scope: !901)
!919 = !DILocation(line: 363, column: 11, scope: !920)
!920 = distinct !DILexicalBlock(scope: !917, file: !1, line: 363, column: 9)
!921 = !DILocation(line: 363, column: 9, scope: !917)
!922 = !DILocation(line: 363, column: 32, scope: !920)
!923 = !DILocation(line: 363, column: 30, scope: !920)
!924 = !DILocation(line: 363, column: 20, scope: !920)
!925 = !DILocation(line: 0, scope: !917)
!926 = !DILocation(line: 364, column: 33, scope: !917)
!927 = !DILocation(line: 364, column: 5, scope: !917)
!928 = !DILocation(line: 365, column: 5, scope: !917)
!929 = !DILocation(line: 366, column: 9, scope: !930)
!930 = distinct !DILexicalBlock(scope: !917, file: !1, line: 366, column: 9)
!931 = !DILocation(line: 366, column: 9, scope: !917)
!932 = !DILocation(line: 367, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !930, file: !1, line: 366, column: 27)
!934 = !DILocation(line: 368, column: 30, scope: !933)
!935 = !{!297, !297, i64 0}
!936 = !DILocation(line: 368, column: 33, scope: !933)
!937 = !DILocation(line: 368, column: 7, scope: !933)
!938 = !DILocation(line: 369, column: 7, scope: !933)
!939 = !DILocation(line: 370, column: 7, scope: !933)
!940 = !DILocation(line: 371, column: 7, scope: !933)
!941 = !DILocation(line: 372, column: 5, scope: !933)
!942 = !DILocation(line: 373, column: 15, scope: !943)
!943 = distinct !DILexicalBlock(scope: !930, file: !1, line: 373, column: 14)
!944 = !DILocation(line: 373, column: 14, scope: !930)
!945 = !DILocation(line: 374, column: 7, scope: !946)
!946 = distinct !DILexicalBlock(scope: !943, file: !1, line: 373, column: 35)
!947 = !DILocation(line: 375, column: 7, scope: !946)
!948 = !DILocation(line: 377, column: 5, scope: !917)
!949 = !DILocation(line: 378, column: 15, scope: !917)
!950 = !DILocation(line: 379, column: 12, scope: !901)
!951 = !DILocation(line: 379, column: 15, scope: !901)
!952 = !DILocation(line: 379, column: 3, scope: !917)
!953 = distinct !{!953, !915, !954}
!954 = !DILocation(line: 379, column: 21, scope: !901)
!955 = !DILocation(line: 0, scope: !946)
!956 = !DILocation(line: 381, column: 1, scope: !901)
!957 = distinct !DISubprogram(name: "luaL_gsub", scope: !1, file: !1, line: 340, type: !958, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{!209, !255, !209, !209, !209}
!960 = !{!961, !962, !963, !964, !965, !966, !967}
!961 = !DILocalVariable(name: "L", arg: 1, scope: !957, file: !1, line: 340, type: !255)
!962 = !DILocalVariable(name: "s", arg: 2, scope: !957, file: !1, line: 340, type: !209)
!963 = !DILocalVariable(name: "p", arg: 3, scope: !957, file: !1, line: 340, type: !209)
!964 = !DILocalVariable(name: "r", arg: 4, scope: !957, file: !1, line: 341, type: !209)
!965 = !DILocalVariable(name: "wild", scope: !957, file: !1, line: 342, type: !209)
!966 = !DILocalVariable(name: "l", scope: !957, file: !1, line: 343, type: !6)
!967 = !DILocalVariable(name: "b", scope: !957, file: !1, line: 344, type: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Buffer", file: !793, line: 134, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Buffer", file: !793, line: 129, size: 8384, elements: !970)
!970 = !{!971, !972, !973, !974}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !969, file: !793, line: 130, baseType: !90, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !969, file: !793, line: 131, baseType: !11, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !969, file: !793, line: 132, baseType: !255, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !969, file: !793, line: 133, baseType: !239, size: 8192, offset: 192)
!975 = !DILocation(line: 340, column: 46, scope: !957)
!976 = !DILocation(line: 340, column: 61, scope: !957)
!977 = !DILocation(line: 340, column: 76, scope: !957)
!978 = !DILocation(line: 341, column: 76, scope: !957)
!979 = !DILocation(line: 343, column: 14, scope: !957)
!980 = !DILocation(line: 343, column: 10, scope: !957)
!981 = !DILocation(line: 344, column: 3, scope: !957)
!982 = !DILocation(line: 344, column: 15, scope: !957)
!983 = !DILocalVariable(name: "L", arg: 1, scope: !984, file: !1, line: 472, type: !255)
!984 = distinct !DISubprogram(name: "luaL_buffinit", scope: !1, file: !1, line: 472, type: !985, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !988)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !255, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!988 = !{!983, !989}
!989 = !DILocalVariable(name: "B", arg: 2, scope: !984, file: !1, line: 472, type: !987)
!990 = !DILocation(line: 472, column: 43, scope: !984, inlinedAt: !991)
!991 = distinct !DILocation(line: 345, column: 3, scope: !957)
!992 = !DILocation(line: 472, column: 59, scope: !984, inlinedAt: !991)
!993 = !DILocation(line: 473, column: 6, scope: !984, inlinedAt: !991)
!994 = !DILocation(line: 473, column: 8, scope: !984, inlinedAt: !991)
!995 = !{!996, !299, i64 16}
!996 = !{!"luaL_Buffer", !299, i64 0, !296, i64 8, !299, i64 16, !297, i64 24}
!997 = !DILocation(line: 474, column: 10, scope: !984, inlinedAt: !991)
!998 = !DILocation(line: 474, column: 6, scope: !984, inlinedAt: !991)
!999 = !DILocation(line: 474, column: 8, scope: !984, inlinedAt: !991)
!1000 = !{!996, !299, i64 0}
!1001 = !DILocation(line: 475, column: 6, scope: !984, inlinedAt: !991)
!1002 = !DILocation(line: 475, column: 10, scope: !984, inlinedAt: !991)
!1003 = !{!996, !296, i64 8}
!1004 = !DILocation(line: 476, column: 1, scope: !984, inlinedAt: !991)
!1005 = !DILocation(line: 346, column: 3, scope: !957)
!1006 = !DILocation(line: 346, column: 18, scope: !957)
!1007 = !DILocation(line: 342, column: 15, scope: !957)
!1008 = !DILocation(line: 346, column: 32, scope: !957)
!1009 = !DILocation(line: 399, column: 14, scope: !1010, inlinedAt: !1016)
!1010 = distinct !DISubprogram(name: "emptybuffer", scope: !1, file: !1, line: 398, type: !1011, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!11, !987}
!1013 = !{!1014, !1015}
!1014 = !DILocalVariable(name: "B", arg: 1, scope: !1010, file: !1, line: 398, type: !987)
!1015 = !DILocalVariable(name: "l", scope: !1010, file: !1, line: 399, type: !6)
!1016 = distinct !DILocation(line: 448, column: 3, scope: !1017, inlinedAt: !1022)
!1017 = distinct !DISubprogram(name: "luaL_pushresult", scope: !1, file: !1, line: 447, type: !1018, isLocal: false, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !987}
!1020 = !{!1021}
!1021 = !DILocalVariable(name: "B", arg: 1, scope: !1017, file: !1, line: 447, type: !987)
!1022 = distinct !DILocation(line: 352, column: 3, scope: !957)
!1023 = !DILocation(line: 347, column: 33, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !957, file: !1, line: 346, column: 41)
!1025 = !DILocalVariable(name: "B", arg: 1, scope: !1026, file: !1, line: 436, type: !987)
!1026 = distinct !DISubprogram(name: "luaL_addlstring", scope: !1, file: !1, line: 436, type: !1027, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1029)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !987, !209, !6}
!1029 = !{!1025, !1030, !1031}
