; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lcode.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lcode.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.FuncState = type { %struct.Proto*, %struct.Table*, %struct.FuncState*, %struct.LexState*, %struct.lua_State*, %struct.BlockCnt*, i32, i32, i32, i32, i32, i32, i16, i8, [60 x %struct.upvaldesc], [200 x i16] }
%struct.Proto = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, i32*, %struct.Proto**, i32*, %struct.LocVar*, %union.TString**, %union.TString*, i32, i32, i32, i32, i32, i32, i32, i32, %union.GCObject*, i8, i8, i8, i8 }
%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%struct.LocVar = type { %union.TString*, i32, i32 }
%union.TString = type { %struct.anon }
%struct.anon = type { %union.GCObject*, i8, i8, i8, i32, i64 }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }

!31 = !DIEnumerator(name: "OP_LT", value: 24, isUnsigned: true)
!32 = !DIEnumerator(name: "OP_LE", value: 25, isUnsigned: true)
!33 = !DIEnumerator(name: "OP_TEST", value: 26, isUnsigned: true)
!34 = !DIEnumerator(name: "OP_TESTSET", value: 27, isUnsigned: true)
!35 = !DIEnumerator(name: "OP_CALL", value: 28, isUnsigned: true)
!36 = !DIEnumerator(name: "OP_TAILCALL", value: 29, isUnsigned: true)
!37 = !DIEnumerator(name: "OP_RETURN", value: 30, isUnsigned: true)
!38 = !DIEnumerator(name: "OP_FORLOOP", value: 31, isUnsigned: true)
!39 = !DIEnumerator(name: "OP_FORPREP", value: 32, isUnsigned: true)
!40 = !DIEnumerator(name: "OP_TFORLOOP", value: 33, isUnsigned: true)
!41 = !DIEnumerator(name: "OP_SETLIST", value: 34, isUnsigned: true)
!42 = !DIEnumerator(name: "OP_CLOSE", value: 35, isUnsigned: true)
!43 = !DIEnumerator(name: "OP_CLOSURE", value: 36, isUnsigned: true)
!44 = !DIEnumerator(name: "OP_VARARG", value: 37, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 19, baseType: !5, size: 32, elements: !47)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lparser.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!48 = !DIEnumerator(name: "VVOID", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "VNIL", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "VTRUE", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "VFALSE", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "VK", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "VKNUM", value: 5, isUnsigned: true)
!54 = !DIEnumerator(name: "VLOCAL", value: 6, isUnsigned: true)
!55 = !DIEnumerator(name: "VUPVAL", value: 7, isUnsigned: true)
!56 = !DIEnumerator(name: "VGLOBAL", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "VINDEXED", value: 9, isUnsigned: true)
!58 = !DIEnumerator(name: "VJMP", value: 10, isUnsigned: true)
!59 = !DIEnumerator(name: "VRELOCABLE", value: 11, isUnsigned: true)
!60 = !DIEnumerator(name: "VNONRELOC", value: 12, isUnsigned: true)
!61 = !DIEnumerator(name: "VCALL", value: 13, isUnsigned: true)
!62 = !DIEnumerator(name: "VVARARG", value: 14, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UnOpr", file: !64, line: 36, baseType: !5, size: 32, elements: !65)
!64 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lcode.h", directory: "/root/.unikraft/apps/redis/build")
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "OPR_MINUS", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "OPR_NOT", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "OPR_LEN", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "OPR_NOUNOPR", value: 3, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BinOpr", file: !64, line: 26, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!72 = !DIEnumerator(name: "OPR_ADD", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "OPR_SUB", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "OPR_MUL", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "OPR_DIV", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "OPR_MOD", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "OPR_POW", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "OPR_CONCAT", value: 6, isUnsigned: true)
!79 = !DIEnumerator(name: "OPR_NE", value: 7, isUnsigned: true)
!80 = !DIEnumerator(name: "OPR_EQ", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "OPR_LT", value: 9, isUnsigned: true)
!82 = !DIEnumerator(name: "OPR_LE", value: 10, isUnsigned: true)
!83 = !DIEnumerator(name: "OPR_GT", value: 11, isUnsigned: true)
!84 = !DIEnumerator(name: "OPR_GE", value: 12, isUnsigned: true)
!85 = !DIEnumerator(name: "OPR_AND", value: 13, isUnsigned: true)
!86 = !DIEnumerator(name: "OPR_OR", value: 14, isUnsigned: true)
!87 = !DIEnumerator(name: "OPR_NOBINOPR", value: 15, isUnsigned: true)
!88 = !{!89, !90, !93, !94, !96, !5, !166, !155, !385, !389}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpCode", file: !4, line: 208, baseType: !3)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !91, line: 88, baseType: !92)
!91 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !91, line: 18, baseType: !5)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !91, line: 27, baseType: !95)
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !98, line: 36, baseType: !99)
!98 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !100, line: 136, size: 1472, elements: !101)
!100 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!101 = !{!102, !109, !134, !193, !416, !417, !418, !419}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !99, file: !100, line: 137, baseType: !103, size: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !98, line: 51, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !98, line: 49, size: 128, elements: !105)
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !98, line: 50, baseType: !96, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !104, file: !98, line: 50, baseType: !94, size: 8, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !104, file: !98, line: 50, baseType: !94, size: 8, offset: 72)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !99, file: !100, line: 138, baseType: !110, size: 192)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !98, line: 199, size: 192, elements: !111)
!111 = !{!112, !122}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !110, file: !98, line: 200, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !91, line: 47, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !91, line: 47, size: 64, elements: !115)
!115 = !{!116, !118, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !114, file: !91, line: 47, baseType: !117, size: 64)
!117 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !114, file: !91, line: 47, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !114, file: !91, line: 47, baseType: !121, size: 64)
!121 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !110, file: !98, line: 206, baseType: !123, size: 192)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !98, line: 201, size: 192, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !98, line: 202, baseType: !96, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !123, file: !98, line: 202, baseType: !94, size: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !123, file: !98, line: 202, baseType: !94, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !123, file: !98, line: 203, baseType: !94, size: 8, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !123, file: !98, line: 204, baseType: !5, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !123, file: !98, line: 205, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !132, line: 58, baseType: !133)
!132 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!133 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !99, file: !100, line: 139, baseType: !135, size: 320)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !98, line: 215, size: 320, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !135, file: !98, line: 216, baseType: !113, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !135, file: !98, line: 222, baseType: !139, size: 320)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !135, file: !98, line: 217, size: 320, elements: !140)
!140 = !{!141, !142, !143, !144, !191, !192}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !98, line: 218, baseType: !96, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !139, file: !98, line: 218, baseType: !94, size: 8, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !139, file: !98, line: 218, baseType: !94, size: 8, offset: 72)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !139, file: !98, line: 219, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !98, line: 338, size: 512, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !170, !188, !189, !190}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !98, line: 339, baseType: !96, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !146, file: !98, line: 339, baseType: !94, size: 8, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !146, file: !98, line: 339, baseType: !94, size: 8, offset: 72)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !98, line: 340, baseType: !94, size: 8, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !146, file: !98, line: 341, baseType: !94, size: 8, offset: 88)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !146, file: !98, line: 342, baseType: !145, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !146, file: !98, line: 343, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !98, line: 75, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !98, line: 73, size: 128, elements: !158)
!158 = !{!159, !169}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !157, file: !98, line: 74, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !98, line: 64, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !98, line: 59, size: 64, elements: !162)
!162 = !{!163, !164, !165, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !161, file: !98, line: 60, baseType: !96, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !161, file: !98, line: 61, baseType: !119, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !161, file: !98, line: 62, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !167, line: 99, baseType: !117)
!167 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !161, file: !98, line: 63, baseType: !93, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !157, file: !98, line: 74, baseType: !93, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !146, file: !98, line: 344, baseType: !171, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !98, line: 335, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !98, line: 332, size: 320, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !173, file: !98, line: 333, baseType: !156, size: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !173, file: !98, line: 334, baseType: !177, size: 192, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !98, line: 329, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !98, line: 323, size: 192, elements: !179)
!179 = !{!180, !187}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !178, file: !98, line: 327, baseType: !181, size: 192)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !178, file: !98, line: 324, size: 192, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !181, file: !98, line: 325, baseType: !160, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !181, file: !98, line: 325, baseType: !93, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !98, line: 326, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !178, file: !98, line: 328, baseType: !156, size: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !146, file: !98, line: 345, baseType: !171, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !146, file: !98, line: 346, baseType: !96, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !146, file: !98, line: 347, baseType: !93, size: 32, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !139, file: !98, line: 220, baseType: !145, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !139, file: !98, line: 221, baseType: !131, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !99, file: !100, line: 140, baseType: !194, size: 448)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !98, line: 309, size: 448, elements: !195)
!195 = !{!196, !365}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !194, file: !98, line: 310, baseType: !197, size: 448)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !98, line: 299, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !98, line: 295, size: 448, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !361}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !98, line: 296, baseType: !96, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !198, file: !98, line: 296, baseType: !94, size: 8, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !198, file: !98, line: 296, baseType: !94, size: 8, offset: 72)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !198, file: !98, line: 296, baseType: !94, size: 8, offset: 80)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !198, file: !98, line: 296, baseType: !94, size: 8, offset: 88)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !198, file: !98, line: 296, baseType: !96, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !198, file: !98, line: 296, baseType: !145, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !198, file: !98, line: 297, baseType: !208, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !167, line: 52, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!93, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !167, line: 50, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !100, line: 100, size: 1472, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !222, !223, !300, !313, !314, !315, !316, !317, !318, !319, !320, !322, !323, !324, !325, !326, !327, !352, !353, !354, !355, !356, !359}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !100, line: 101, baseType: !96, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !214, file: !100, line: 101, baseType: !94, size: 8, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !214, file: !100, line: 101, baseType: !94, size: 8, offset: 72)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !214, file: !100, line: 102, baseType: !94, size: 8, offset: 80)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !214, file: !100, line: 103, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !98, line: 193, baseType: !155)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !214, file: !100, line: 104, baseType: !221, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !214, file: !100, line: 105, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !100, line: 94, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !100, line: 68, size: 3456, elements: !227)
!227 = !{!228, !236, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !261, !263, !264, !265, !266, !267, !268, !269, !270, !272, !290, !294}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !226, file: !100, line: 69, baseType: !229, size: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !100, line: 42, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !100, line: 38, size: 128, elements: !231)
!231 = !{!232, !234, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !230, file: !100, line: 39, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !230, file: !100, line: 40, baseType: !92, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !100, line: 41, baseType: !93, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !226, file: !100, line: 70, baseType: !237, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !167, line: 66, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!119, !119, !119, !131, !131}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !226, file: !100, line: 71, baseType: !119, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !226, file: !100, line: 72, baseType: !94, size: 8, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !226, file: !100, line: 73, baseType: !94, size: 8, offset: 264)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !226, file: !100, line: 74, baseType: !93, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !226, file: !100, line: 75, baseType: !96, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !226, file: !100, line: 76, baseType: !233, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !226, file: !100, line: 77, baseType: !96, size: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !226, file: !100, line: 78, baseType: !96, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !226, file: !100, line: 79, baseType: !96, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !226, file: !100, line: 80, baseType: !96, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !226, file: !100, line: 81, baseType: !252, size: 192, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !253, line: 28, baseType: !254)
!253 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !253, line: 24, size: 192, elements: !255)
!255 = !{!256, !259, !260}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !254, file: !253, line: 25, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !254, file: !253, line: 26, baseType: !131, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !254, file: !253, line: 27, baseType: !131, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !226, file: !100, line: 82, baseType: !262, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !91, line: 20, baseType: !131)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !226, file: !100, line: 83, baseType: !262, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !226, file: !100, line: 84, baseType: !262, size: 64, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !226, file: !100, line: 85, baseType: !262, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !226, file: !100, line: 86, baseType: !93, size: 32, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !226, file: !100, line: 87, baseType: !93, size: 32, offset: 1184)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !226, file: !100, line: 88, baseType: !208, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !226, file: !100, line: 89, baseType: !156, size: 128, offset: 1280)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !226, file: !100, line: 90, baseType: !271, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !226, file: !100, line: 91, baseType: !273, size: 320, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !98, line: 284, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !98, line: 274, size: 320, elements: !275)
!275 = !{!276, !277, !278, !279, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !98, line: 275, baseType: !96, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !274, file: !98, line: 275, baseType: !94, size: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !274, file: !98, line: 275, baseType: !94, size: 8, offset: 72)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !274, file: !98, line: 276, baseType: !155, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !274, file: !98, line: 283, baseType: !281, size: 128, offset: 192)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !98, line: 277, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !98, line: 278, baseType: !156, size: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !281, file: !98, line: 282, baseType: !285, size: 128)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !98, line: 279, size: 128, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !285, file: !98, line: 280, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !98, line: 281, baseType: !288, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !226, file: !100, line: 92, baseType: !291, size: 576, offset: 1792)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 576, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 9)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !226, file: !100, line: 93, baseType: !295, size: 1088, offset: 2368)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 1088, elements: !298)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !98, line: 207, baseType: !110)
!298 = !{!299}
!299 = !DISubrange(count: 17)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !214, file: !100, line: 106, baseType: !301, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !100, line: 55, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !100, line: 48, size: 320, elements: !304)
!304 = !{!305, !306, !307, !308, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !303, file: !100, line: 49, baseType: !221, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !303, file: !100, line: 50, baseType: !221, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !303, file: !100, line: 51, baseType: !221, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !303, file: !100, line: 52, baseType: !309, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !303, file: !100, line: 53, baseType: !93, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !303, file: !100, line: 54, baseType: !93, size: 32, offset: 288)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !214, file: !100, line: 107, baseType: !309, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !214, file: !100, line: 108, baseType: !221, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !214, file: !100, line: 109, baseType: !221, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !214, file: !100, line: 110, baseType: !301, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !214, file: !100, line: 111, baseType: !301, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !214, file: !100, line: 112, baseType: !93, size: 32, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !214, file: !100, line: 113, baseType: !93, size: 32, offset: 736)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !214, file: !100, line: 114, baseType: !321, size: 16, offset: 768)
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !214, file: !100, line: 115, baseType: !321, size: 16, offset: 784)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !214, file: !100, line: 116, baseType: !94, size: 8, offset: 800)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !214, file: !100, line: 117, baseType: !94, size: 8, offset: 808)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !214, file: !100, line: 118, baseType: !93, size: 32, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !214, file: !100, line: 119, baseType: !93, size: 32, offset: 864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !214, file: !100, line: 120, baseType: !328, size: 64, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !167, line: 330, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !212, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !167, line: 326, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !167, line: 346, size: 960, elements: !335)
!335 = !{!336, !337, !340, !341, !342, !343, !344, !345, !346, !347, !351}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !334, file: !167, line: 347, baseType: !93, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !167, line: 348, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !334, file: !167, line: 349, baseType: !338, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !334, file: !167, line: 350, baseType: !338, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !334, file: !167, line: 351, baseType: !338, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !334, file: !167, line: 352, baseType: !93, size: 32, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !334, file: !167, line: 353, baseType: !93, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !334, file: !167, line: 354, baseType: !93, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !334, file: !167, line: 355, baseType: !93, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !334, file: !167, line: 356, baseType: !348, size: 480, offset: 448)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 480, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 60)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !334, file: !167, line: 358, baseType: !93, size: 32, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !214, file: !100, line: 121, baseType: !156, size: 128, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !214, file: !100, line: 122, baseType: !156, size: 128, offset: 1088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !214, file: !100, line: 123, baseType: !96, size: 64, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !214, file: !100, line: 124, baseType: !96, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !214, file: !100, line: 125, baseType: !357, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !100, line: 18, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !214, file: !100, line: 126, baseType: !360, size: 64, offset: 1408)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !132, line: 49, baseType: !121)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !198, file: !98, line: 298, baseType: !362, size: 128, offset: 320)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 1)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !194, file: !98, line: 311, baseType: !366, size: 384)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !98, line: 306, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !98, line: 302, size: 384, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !413}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !98, line: 303, baseType: !96, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !367, file: !98, line: 303, baseType: !94, size: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !367, file: !98, line: 303, baseType: !94, size: 8, offset: 72)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !367, file: !98, line: 303, baseType: !94, size: 8, offset: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !367, file: !98, line: 303, baseType: !94, size: 8, offset: 88)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !367, file: !98, line: 303, baseType: !96, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !367, file: !98, line: 303, baseType: !145, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !367, file: !98, line: 304, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !98, line: 231, size: 960, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !386, !388, !390, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !98, line: 232, baseType: !96, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !378, file: !98, line: 232, baseType: !94, size: 8, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !378, file: !98, line: 232, baseType: !94, size: 8, offset: 72)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !378, file: !98, line: 233, baseType: !155, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !378, file: !98, line: 234, baseType: !385, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !378, file: !98, line: 235, baseType: !387, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !378, file: !98, line: 236, baseType: !389, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !378, file: !98, line: 237, baseType: !391, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !98, line: 262, size: 128, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !392, file: !98, line: 263, baseType: !296, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !392, file: !98, line: 264, baseType: !93, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !392, file: !98, line: 265, baseType: !93, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !378, file: !98, line: 238, baseType: !398, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !378, file: !98, line: 239, baseType: !296, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !378, file: !98, line: 240, baseType: !93, size: 32, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !378, file: !98, line: 241, baseType: !93, size: 32, offset: 608)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !378, file: !98, line: 242, baseType: !93, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !378, file: !98, line: 243, baseType: !93, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !378, file: !98, line: 244, baseType: !93, size: 32, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !378, file: !98, line: 245, baseType: !93, size: 32, offset: 736)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !378, file: !98, line: 246, baseType: !93, size: 32, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !378, file: !98, line: 247, baseType: !93, size: 32, offset: 800)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !378, file: !98, line: 248, baseType: !96, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !378, file: !98, line: 249, baseType: !94, size: 8, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !378, file: !98, line: 250, baseType: !94, size: 8, offset: 904)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !378, file: !98, line: 251, baseType: !94, size: 8, offset: 912)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !378, file: !98, line: 252, baseType: !94, size: 8, offset: 920)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !367, file: !98, line: 305, baseType: !414, size: 64, offset: 320)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 64, elements: !363)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !99, file: !100, line: 141, baseType: !146, size: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !99, file: !100, line: 142, baseType: !378, size: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !99, file: !100, line: 143, baseType: !274, size: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !99, file: !100, line: 144, baseType: !214, size: 1472)
!420 = !{i32 2, !"Dwarf Version", i32 4}
!421 = !{i32 2, !"Debug Info Version", i32 3}
!422 = !{i32 1, !"wchar_size", i32 4}
!423 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!424 = distinct !DISubprogram(name: "luaK_nil", scope: !1, file: !1, line: 35, type: !425, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !504)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427, !93, !93}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "FuncState", file: !46, line: 75, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FuncState", file: !46, line: 58, size: 4800, elements: !430)
!430 = !{!431, !434, !437, !439, !480, !481, !484, !485, !486, !487, !488, !489, !490, !492, !493, !500}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !429, file: !46, line: 59, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Proto", file: !98, line: 253, baseType: !378)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !429, file: !46, line: 60, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !98, line: 348, baseType: !146)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !46, line: 61, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ls", scope: !429, file: !46, line: 62, baseType: !440, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LexState", file: !442, line: 55, size: 768, elements: !443)
!442 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llex.h", directory: "/root/.unikraft/apps/redis/build")
!443 = !{!444, !445, !446, !447, !458, !459, !460, !461, !476, !478, !479}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !441, file: !442, line: 56, baseType: !93, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !441, file: !442, line: 57, baseType: !93, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lastline", scope: !441, file: !442, line: 58, baseType: !93, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !441, file: !442, line: 59, baseType: !448, size: 128, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "Token", file: !442, line: 52, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !442, line: 49, size: 128, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !449, file: !442, line: 50, baseType: !93, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "seminfo", scope: !449, file: !442, line: 51, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemInfo", file: !442, line: 46, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 43, size: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !454, file: !442, line: 44, baseType: !166, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !454, file: !442, line: 45, baseType: !296, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead", scope: !441, file: !442, line: 60, baseType: !448, size: 128, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !441, file: !442, line: 61, baseType: !438, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !441, file: !442, line: 62, baseType: !271, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !441, file: !442, line: 63, baseType: !462, size: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZIO", file: !253, line: 18, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Zio", file: !253, line: 56, size: 320, elements: !465)
!465 = !{!466, !467, !468, !474, !475}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !464, file: !253, line: 57, baseType: !131, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !464, file: !253, line: 58, baseType: !338, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !464, file: !253, line: 59, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Reader", file: !167, line: 58, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!338, !212, !119, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !253, line: 60, baseType: !119, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !464, file: !253, line: 61, baseType: !212, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !441, file: !442, line: 64, baseType: !477, size: 64, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !441, file: !442, line: 65, baseType: !296, size: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "decpoint", scope: !441, file: !442, line: 66, baseType: !258, size: 8, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !429, file: !46, line: 63, baseType: !271, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bl", scope: !429, file: !46, line: 64, baseType: !482, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockCnt", file: !46, line: 54, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !429, file: !46, line: 65, baseType: !93, size: 32, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lasttarget", scope: !429, file: !46, line: 66, baseType: !93, size: 32, offset: 416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "jpc", scope: !429, file: !46, line: 67, baseType: !93, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "freereg", scope: !429, file: !46, line: 68, baseType: !93, size: 32, offset: 480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !429, file: !46, line: 69, baseType: !93, size: 32, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "np", scope: !429, file: !46, line: 70, baseType: !93, size: 32, offset: 544)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nlocvars", scope: !429, file: !46, line: 71, baseType: !491, size: 16, offset: 576)
!491 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nactvar", scope: !429, file: !46, line: 72, baseType: !94, size: 8, offset: 592)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !429, file: !46, line: 73, baseType: !494, size: 960, offset: 600)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 960, elements: !349)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "upvaldesc", file: !46, line: 51, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upvaldesc", file: !46, line: 48, size: 16, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !496, file: !46, line: 49, baseType: !94, size: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !496, file: !46, line: 50, baseType: !94, size: 8, offset: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "actvar", scope: !429, file: !46, line: 74, baseType: !501, size: 3200, offset: 1568)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 3200, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 200)
!504 = !{!505, !506, !507, !508, !509, !516}
!505 = !DILocalVariable(name: "fs", arg: 1, scope: !424, file: !1, line: 35, type: !427)
!506 = !DILocalVariable(name: "from", arg: 2, scope: !424, file: !1, line: 35, type: !93)
!507 = !DILocalVariable(name: "n", arg: 3, scope: !424, file: !1, line: 35, type: !93)
!508 = !DILocalVariable(name: "previous", scope: !424, file: !1, line: 36, type: !385)
!509 = !DILocalVariable(name: "pfrom", scope: !510, file: !1, line: 45, type: !93)
!510 = distinct !DILexicalBlock(scope: !511, file: !1, line: 44, column: 48)
!511 = distinct !DILexicalBlock(scope: !512, file: !1, line: 44, column: 11)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 42, column: 10)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 38, column: 9)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 37, column: 32)
!515 = distinct !DILexicalBlock(scope: !424, file: !1, line: 37, column: 7)
!516 = !DILocalVariable(name: "pto", scope: !510, file: !1, line: 46, type: !93)
!517 = !DILocation(line: 35, column: 27, scope: !424)
!518 = !DILocation(line: 35, column: 35, scope: !424)
!519 = !DILocation(line: 35, column: 45, scope: !424)
!520 = !DILocation(line: 37, column: 11, scope: !515)
!521 = !{!522, !526, i64 48}
!522 = !{!"FuncState", !523, i64 0, !523, i64 8, !523, i64 16, !523, i64 24, !523, i64 32, !523, i64 40, !526, i64 48, !526, i64 52, !526, i64 56, !526, i64 60, !526, i64 64, !526, i64 68, !527, i64 72, !524, i64 74, !524, i64 75, !524, i64 196}
!523 = !{!"any pointer", !524, i64 0}
!524 = !{!"omnipotent char", !525, i64 0}
!525 = !{!"Simple C/C++ TBAA"}
!526 = !{!"int", !524, i64 0}
!527 = !{!"short", !524, i64 0}
!528 = !DILocation(line: 37, column: 20, scope: !515)
!529 = !{!522, !526, i64 52}
!530 = !DILocation(line: 37, column: 14, scope: !515)
!531 = !DILocation(line: 37, column: 7, scope: !424)
!532 = !DILocation(line: 38, column: 16, scope: !513)
!533 = !DILocation(line: 38, column: 9, scope: !514)
!534 = !DILocation(line: 39, column: 23, scope: !535)
!535 = distinct !DILexicalBlock(scope: !536, file: !1, line: 39, column: 11)
!536 = distinct !DILexicalBlock(scope: !513, file: !1, line: 38, column: 22)
!537 = !{!522, !524, i64 74}
!538 = !DILocation(line: 39, column: 19, scope: !535)
!539 = !DILocation(line: 39, column: 16, scope: !535)
!540 = !DILocation(line: 39, column: 11, scope: !536)
!541 = !DILocation(line: 43, column: 23, scope: !512)
!542 = !{!522, !523, i64 0}
!543 = !DILocation(line: 43, column: 26, scope: !512)
!544 = !{!545, !523, i64 24}
!545 = !{!"Proto", !523, i64 0, !524, i64 8, !524, i64 9, !523, i64 16, !523, i64 24, !523, i64 32, !523, i64 40, !523, i64 48, !523, i64 56, !523, i64 64, !526, i64 72, !526, i64 76, !526, i64 80, !526, i64 84, !526, i64 88, !526, i64 92, !526, i64 96, !526, i64 100, !523, i64 104, !524, i64 112, !524, i64 113, !524, i64 114, !524, i64 115}
!546 = !DILocation(line: 43, column: 37, scope: !512)
!547 = !DILocation(line: 43, column: 19, scope: !512)
!548 = !DILocation(line: 36, column: 16, scope: !424)
!549 = !DILocation(line: 44, column: 11, scope: !511)
!550 = !{!526, !526, i64 0}
!551 = !DILocation(line: 44, column: 33, scope: !511)
!552 = !DILocation(line: 44, column: 11, scope: !512)
!553 = !DILocation(line: 45, column: 21, scope: !510)
!554 = !DILocation(line: 45, column: 13, scope: !510)
!555 = !DILocation(line: 46, column: 19, scope: !510)
!556 = !DILocation(line: 46, column: 13, scope: !510)
!557 = !DILocation(line: 47, column: 19, scope: !558)
!558 = distinct !DILexicalBlock(scope: !510, file: !1, line: 47, column: 13)
!559 = !DILocation(line: 47, column: 27, scope: !558)
!560 = !DILocation(line: 47, column: 41, scope: !558)
!561 = !DILocation(line: 47, column: 35, scope: !558)
!562 = !DILocation(line: 47, column: 13, scope: !510)
!563 = !DILocation(line: 48, column: 19, scope: !564)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 48, column: 15)
!565 = distinct !DILexicalBlock(scope: !558, file: !1, line: 47, column: 45)
!566 = !DILocation(line: 48, column: 21, scope: !564)
!567 = !DILocation(line: 48, column: 24, scope: !564)
!568 = !DILocation(line: 48, column: 15, scope: !565)
!569 = !DILocation(line: 49, column: 13, scope: !564)
!570 = !DILocation(line: 52, column: 7, scope: !511)
!571 = !DILocation(line: 55, column: 42, scope: !424)
!572 = !DILocalVariable(name: "fs", arg: 1, scope: !573, file: !1, line: 804, type: !427)
!573 = distinct !DISubprogram(name: "luaK_codeABC", scope: !1, file: !1, line: 804, type: !574, isLocal: false, isDefinition: true, scopeLine: 804, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!93, !427, !89, !93, !93, !93}
!576 = !{!572, !577, !578, !579, !580}
!577 = !DILocalVariable(name: "o", arg: 2, scope: !573, file: !1, line: 804, type: !89)
!578 = !DILocalVariable(name: "a", arg: 3, scope: !573, file: !1, line: 804, type: !93)
!579 = !DILocalVariable(name: "b", arg: 4, scope: !573, file: !1, line: 804, type: !93)
!580 = !DILocalVariable(name: "c", arg: 5, scope: !573, file: !1, line: 804, type: !93)
!581 = !DILocation(line: 804, column: 30, scope: !573, inlinedAt: !582)
!582 = distinct !DILocation(line: 55, column: 3, scope: !424)
!583 = !DILocation(line: 804, column: 41, scope: !573, inlinedAt: !582)
!584 = !DILocation(line: 804, column: 48, scope: !573, inlinedAt: !582)
!585 = !DILocation(line: 804, column: 55, scope: !573, inlinedAt: !582)
!586 = !DILocation(line: 804, column: 62, scope: !573, inlinedAt: !582)
!587 = !DILocation(line: 808, column: 24, scope: !573, inlinedAt: !582)
!588 = !DILocation(line: 808, column: 52, scope: !573, inlinedAt: !582)
!589 = !{!522, !523, i64 24}
!590 = !DILocation(line: 808, column: 56, scope: !573, inlinedAt: !582)
!591 = !{!592, !526, i64 8}
!592 = !{!"LexState", !526, i64 0, !526, i64 4, !526, i64 8, !593, i64 16, !593, i64 32, !523, i64 48, !523, i64 56, !523, i64 64, !523, i64 72, !523, i64 80, !524, i64 88}
!593 = !{!"Token", !526, i64 0, !524, i64 8}
!594 = !DILocation(line: 808, column: 10, scope: !573, inlinedAt: !582)
!595 = !DILocation(line: 56, column: 1, scope: !424)
!596 = !DILocation(line: 0, scope: !424)
!597 = !DILocation(line: 804, column: 30, scope: !573)
!598 = !DILocation(line: 804, column: 41, scope: !573)
!599 = !DILocation(line: 804, column: 48, scope: !573)
!600 = !DILocation(line: 804, column: 55, scope: !573)
!601 = !DILocation(line: 804, column: 62, scope: !573)
!602 = !DILocation(line: 808, column: 24, scope: !573)
!603 = !DILocation(line: 808, column: 52, scope: !573)
!604 = !DILocation(line: 808, column: 56, scope: !573)
!605 = !DILocation(line: 808, column: 10, scope: !573)
!606 = !DILocation(line: 808, column: 3, scope: !573)
!607 = distinct !DISubprogram(name: "luaK_jump", scope: !1, file: !1, line: 59, type: !608, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !610)
!608 = !DISubroutineType(types: !609)
!609 = !{!93, !427}
!610 = !{!611, !612, !613}
!611 = !DILocalVariable(name: "fs", arg: 1, scope: !607, file: !1, line: 59, type: !427)
!612 = !DILocalVariable(name: "jpc", scope: !607, file: !1, line: 60, type: !93)
!613 = !DILocalVariable(name: "j", scope: !607, file: !1, line: 61, type: !93)
!614 = !DILocation(line: 59, column: 27, scope: !607)
!615 = !DILocation(line: 60, column: 17, scope: !607)
!616 = !{!522, !526, i64 56}
!617 = !DILocation(line: 60, column: 7, scope: !607)
!618 = !DILocation(line: 61, column: 3, scope: !607)
!619 = !DILocation(line: 62, column: 11, scope: !607)
!620 = !DILocalVariable(name: "fs", arg: 1, scope: !621, file: !1, line: 812, type: !427)
!621 = distinct !DISubprogram(name: "luaK_codeABx", scope: !1, file: !1, line: 812, type: !622, isLocal: false, isDefinition: true, scopeLine: 812, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{!93, !427, !89, !93, !5}
!624 = !{!620, !625, !626, !627}
!625 = !DILocalVariable(name: "o", arg: 2, scope: !621, file: !1, line: 812, type: !89)
!626 = !DILocalVariable(name: "a", arg: 3, scope: !621, file: !1, line: 812, type: !93)
!627 = !DILocalVariable(name: "bc", arg: 4, scope: !621, file: !1, line: 812, type: !5)
!628 = !DILocation(line: 812, column: 30, scope: !621, inlinedAt: !629)
!629 = distinct !DILocation(line: 63, column: 7, scope: !607)
!630 = !DILocation(line: 812, column: 41, scope: !621, inlinedAt: !629)
!631 = !DILocation(line: 812, column: 48, scope: !621, inlinedAt: !629)
!632 = !DILocation(line: 812, column: 64, scope: !621, inlinedAt: !629)
!633 = !DILocation(line: 815, column: 50, scope: !621, inlinedAt: !629)
!634 = !DILocation(line: 815, column: 54, scope: !621, inlinedAt: !629)
!635 = !DILocation(line: 815, column: 10, scope: !621, inlinedAt: !629)
!636 = !DILocation(line: 815, column: 3, scope: !621, inlinedAt: !629)
!637 = !DILocation(line: 61, column: 7, scope: !607)
!638 = !DILocation(line: 63, column: 5, scope: !607)
!639 = !DILocation(line: 64, column: 3, scope: !607)
!640 = !DILocation(line: 65, column: 10, scope: !607)
!641 = !DILocation(line: 66, column: 1, scope: !607)
!642 = !DILocation(line: 65, column: 3, scope: !607)
!643 = !DILocation(line: 812, column: 30, scope: !621)
!644 = !DILocation(line: 812, column: 41, scope: !621)
!645 = !DILocation(line: 812, column: 48, scope: !621)
!646 = !DILocation(line: 812, column: 64, scope: !621)
!647 = !DILocation(line: 815, column: 24, scope: !621)
!648 = !DILocation(line: 815, column: 50, scope: !621)
!649 = !DILocation(line: 815, column: 54, scope: !621)
!650 = !DILocation(line: 815, column: 10, scope: !621)
!651 = !DILocation(line: 815, column: 3, scope: !621)
!652 = distinct !DISubprogram(name: "luaK_concat", scope: !1, file: !1, line: 185, type: !653, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !427, !389, !93}
!655 = !{!656, !657, !658, !659, !663}
!656 = !DILocalVariable(name: "fs", arg: 1, scope: !652, file: !1, line: 185, type: !427)
!657 = !DILocalVariable(name: "l1", arg: 2, scope: !652, file: !1, line: 185, type: !389)
!658 = !DILocalVariable(name: "l2", arg: 3, scope: !652, file: !1, line: 185, type: !93)
!659 = !DILocalVariable(name: "list", scope: !660, file: !1, line: 190, type: !93)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 189, column: 8)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 187, column: 12)
!662 = distinct !DILexicalBlock(scope: !652, file: !1, line: 186, column: 7)
!663 = !DILocalVariable(name: "next", scope: !660, file: !1, line: 191, type: !93)
!664 = !DILocation(line: 185, column: 30, scope: !652)
!665 = !DILocation(line: 185, column: 39, scope: !652)
!666 = !DILocation(line: 185, column: 47, scope: !652)
!667 = !DILocation(line: 186, column: 10, scope: !662)
!668 = !DILocation(line: 186, column: 7, scope: !652)
!669 = !DILocation(line: 187, column: 12, scope: !661)
!670 = !DILocation(line: 187, column: 16, scope: !661)
!671 = !DILocation(line: 187, column: 12, scope: !662)
!672 = !DILocation(line: 188, column: 9, scope: !661)
!673 = !DILocation(line: 188, column: 5, scope: !661)
!674 = !DILocation(line: 190, column: 9, scope: !660)
!675 = !DILocation(line: 192, column: 5, scope: !660)
!676 = !DILocalVariable(name: "fs", arg: 1, scope: !677, file: !1, line: 100, type: !427)
!677 = distinct !DISubprogram(name: "getjump", scope: !1, file: !1, line: 100, type: !678, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!93, !427, !93}
!680 = !{!676, !681, !682}
!681 = !DILocalVariable(name: "pc", arg: 2, scope: !677, file: !1, line: 100, type: !93)
!682 = !DILocalVariable(name: "offset", scope: !677, file: !1, line: 101, type: !93)
!683 = !DILocation(line: 100, column: 32, scope: !677, inlinedAt: !684)
!684 = distinct !DILocation(line: 192, column: 20, scope: !660)
!685 = !DILocation(line: 100, column: 40, scope: !677, inlinedAt: !684)
!686 = !DILocation(line: 101, column: 16, scope: !677, inlinedAt: !684)
!687 = !DILocation(line: 101, column: 7, scope: !677, inlinedAt: !684)
!688 = !DILocation(line: 102, column: 14, scope: !689, inlinedAt: !684)
!689 = distinct !DILexicalBlock(scope: !677, file: !1, line: 102, column: 7)
!690 = !DILocation(line: 102, column: 7, scope: !677, inlinedAt: !684)
!691 = !DILocation(line: 105, column: 15, scope: !689, inlinedAt: !684)
!692 = !DILocation(line: 105, column: 18, scope: !689, inlinedAt: !684)
!693 = !DILocation(line: 105, column: 5, scope: !689, inlinedAt: !684)
!694 = !DILocation(line: 106, column: 1, scope: !677, inlinedAt: !684)
!695 = !DILocation(line: 192, column: 39, scope: !660)
!696 = !DILocation(line: 103, column: 5, scope: !689, inlinedAt: !684)
!697 = !DILocation(line: 0, scope: !660)
!698 = !DILocation(line: 191, column: 9, scope: !660)
!699 = distinct !{!699, !675, !700}
!700 = !DILocation(line: 193, column: 14, scope: !660)
!701 = !DILocation(line: 82, column: 20, scope: !702, inlinedAt: !709)
!702 = distinct !DISubprogram(name: "fixjump", scope: !1, file: !1, line: 80, type: !425, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !703)
!703 = !{!704, !705, !706, !707, !708}
!704 = !DILocalVariable(name: "fs", arg: 1, scope: !702, file: !1, line: 80, type: !427)
!705 = !DILocalVariable(name: "pc", arg: 2, scope: !702, file: !1, line: 80, type: !93)
!706 = !DILocalVariable(name: "dest", arg: 3, scope: !702, file: !1, line: 80, type: !93)
!707 = !DILocalVariable(name: "jmp", scope: !702, file: !1, line: 81, type: !385)
!708 = !DILocalVariable(name: "offset", scope: !702, file: !1, line: 82, type: !93)
!709 = distinct !DILocation(line: 194, column: 5, scope: !660)
!710 = !DILocation(line: 80, column: 33, scope: !702, inlinedAt: !709)
!711 = !DILocation(line: 80, column: 41, scope: !702, inlinedAt: !709)
!712 = !DILocation(line: 80, column: 49, scope: !702, inlinedAt: !709)
!713 = !DILocation(line: 81, column: 16, scope: !702, inlinedAt: !709)
!714 = !DILocation(line: 82, column: 7, scope: !702, inlinedAt: !709)
!715 = !DILocation(line: 84, column: 7, scope: !716, inlinedAt: !709)
!716 = distinct !DILexicalBlock(scope: !702, file: !1, line: 84, column: 7)
!717 = !DILocation(line: 84, column: 19, scope: !716, inlinedAt: !709)
!718 = !DILocation(line: 84, column: 7, scope: !702, inlinedAt: !709)
!719 = !DILocation(line: 85, column: 26, scope: !716, inlinedAt: !709)
!720 = !DILocation(line: 85, column: 5, scope: !716, inlinedAt: !709)
!721 = !DILocation(line: 86, column: 3, scope: !702, inlinedAt: !709)
!722 = !DILocation(line: 87, column: 1, scope: !702, inlinedAt: !709)
!723 = !DILocation(line: 196, column: 1, scope: !652)
!724 = distinct !DISubprogram(name: "luaK_ret", scope: !1, file: !1, line: 69, type: !425, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !725)
!725 = !{!726, !727, !728}
!726 = !DILocalVariable(name: "fs", arg: 1, scope: !724, file: !1, line: 69, type: !427)
!727 = !DILocalVariable(name: "first", arg: 2, scope: !724, file: !1, line: 69, type: !93)
!728 = !DILocalVariable(name: "nret", arg: 3, scope: !724, file: !1, line: 69, type: !93)
!729 = !DILocation(line: 69, column: 27, scope: !724)
!730 = !DILocation(line: 69, column: 35, scope: !724)
!731 = !DILocation(line: 69, column: 46, scope: !724)
!732 = !DILocation(line: 804, column: 30, scope: !573, inlinedAt: !733)
!733 = distinct !DILocation(line: 70, column: 3, scope: !724)
!734 = !DILocation(line: 804, column: 41, scope: !573, inlinedAt: !733)
!735 = !DILocation(line: 804, column: 48, scope: !573, inlinedAt: !733)
!736 = !DILocation(line: 804, column: 55, scope: !573, inlinedAt: !733)
!737 = !DILocation(line: 804, column: 62, scope: !573, inlinedAt: !733)
!738 = !DILocation(line: 808, column: 24, scope: !573, inlinedAt: !733)
!739 = !DILocation(line: 808, column: 52, scope: !573, inlinedAt: !733)
!740 = !DILocation(line: 808, column: 56, scope: !573, inlinedAt: !733)
!741 = !DILocation(line: 808, column: 10, scope: !573, inlinedAt: !733)
!742 = !DILocation(line: 808, column: 3, scope: !573, inlinedAt: !733)
!743 = !DILocation(line: 71, column: 1, scope: !724)
!744 = distinct !DISubprogram(name: "luaK_getlabel", scope: !1, file: !1, line: 94, type: !608, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !745)
!745 = !{!746}
!746 = !DILocalVariable(name: "fs", arg: 1, scope: !744, file: !1, line: 94, type: !427)
!747 = !DILocation(line: 94, column: 31, scope: !744)
!748 = !DILocation(line: 95, column: 24, scope: !744)
!749 = !DILocation(line: 95, column: 7, scope: !744)
!750 = !DILocation(line: 95, column: 18, scope: !744)
!751 = !DILocation(line: 96, column: 3, scope: !744)
!752 = distinct !DISubprogram(name: "luaK_patchlist", scope: !1, file: !1, line: 169, type: !425, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !753)
!753 = !{!754, !755, !756}
!754 = !DILocalVariable(name: "fs", arg: 1, scope: !752, file: !1, line: 169, type: !427)
!755 = !DILocalVariable(name: "list", arg: 2, scope: !752, file: !1, line: 169, type: !93)
!756 = !DILocalVariable(name: "target", arg: 3, scope: !752, file: !1, line: 169, type: !93)
!757 = !DILocation(line: 169, column: 33, scope: !752)
!758 = !DILocation(line: 169, column: 41, scope: !752)
!759 = !DILocation(line: 169, column: 51, scope: !752)
!760 = !DILocation(line: 170, column: 21, scope: !761)
!761 = distinct !DILexicalBlock(scope: !752, file: !1, line: 170, column: 7)
!762 = !DILocation(line: 170, column: 14, scope: !761)
!763 = !DILocation(line: 170, column: 7, scope: !752)
!764 = !DILocalVariable(name: "fs", arg: 1, scope: !765, file: !1, line: 179, type: !427)
!765 = distinct !DISubprogram(name: "luaK_patchtohere", scope: !1, file: !1, line: 179, type: !766, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !427, !93}
!768 = !{!764, !769}
!769 = !DILocalVariable(name: "list", arg: 2, scope: !765, file: !1, line: 179, type: !93)
!770 = !DILocation(line: 179, column: 35, scope: !765, inlinedAt: !771)
!771 = distinct !DILocation(line: 171, column: 5, scope: !761)
!772 = !DILocation(line: 179, column: 43, scope: !765, inlinedAt: !771)
!773 = !DILocation(line: 94, column: 31, scope: !744, inlinedAt: !774)
!774 = distinct !DILocation(line: 180, column: 3, scope: !765, inlinedAt: !771)
!775 = !DILocation(line: 95, column: 7, scope: !744, inlinedAt: !774)
!776 = !DILocation(line: 95, column: 18, scope: !744, inlinedAt: !774)
!777 = !DILocation(line: 96, column: 3, scope: !744, inlinedAt: !774)
!778 = !DILocation(line: 181, column: 24, scope: !765, inlinedAt: !771)
!779 = !DILocation(line: 181, column: 3, scope: !765, inlinedAt: !771)
!780 = !DILocation(line: 171, column: 5, scope: !761)
!781 = !DILocalVariable(name: "fs", arg: 1, scope: !782, file: !1, line: 150, type: !427)
!782 = distinct !DISubprogram(name: "patchlistaux", scope: !1, file: !1, line: 150, type: !783, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !427, !93, !93, !93, !93}
!785 = !{!781, !786, !787, !788, !789, !790}
!786 = !DILocalVariable(name: "list", arg: 2, scope: !782, file: !1, line: 150, type: !93)
!787 = !DILocalVariable(name: "vtarget", arg: 3, scope: !782, file: !1, line: 150, type: !93)
!788 = !DILocalVariable(name: "reg", arg: 4, scope: !782, file: !1, line: 150, type: !93)
!789 = !DILocalVariable(name: "dtarget", arg: 5, scope: !782, file: !1, line: 151, type: !93)
!790 = !DILocalVariable(name: "next", scope: !791, file: !1, line: 153, type: !93)
!791 = distinct !DILexicalBlock(scope: !782, file: !1, line: 152, column: 27)
!792 = !DILocation(line: 150, column: 38, scope: !782, inlinedAt: !793)
!793 = distinct !DILocation(line: 174, column: 5, scope: !794)
!794 = distinct !DILexicalBlock(scope: !761, file: !1, line: 172, column: 8)
!795 = !DILocation(line: 150, column: 46, scope: !782, inlinedAt: !793)
!796 = !DILocation(line: 150, column: 56, scope: !782, inlinedAt: !793)
!797 = !DILocation(line: 150, column: 69, scope: !782, inlinedAt: !793)
!798 = !DILocation(line: 151, column: 31, scope: !782, inlinedAt: !793)
!799 = !DILocation(line: 152, column: 3, scope: !782, inlinedAt: !793)
!800 = !DILocation(line: 152, column: 15, scope: !782, inlinedAt: !793)
!801 = !DILocation(line: 100, column: 32, scope: !677, inlinedAt: !802)
!802 = distinct !DILocation(line: 153, column: 16, scope: !791, inlinedAt: !793)
!803 = !DILocation(line: 100, column: 40, scope: !677, inlinedAt: !802)
!804 = !DILocation(line: 101, column: 16, scope: !677, inlinedAt: !802)
!805 = !DILocation(line: 101, column: 7, scope: !677, inlinedAt: !802)
!806 = !DILocation(line: 102, column: 14, scope: !689, inlinedAt: !802)
!807 = !DILocation(line: 102, column: 7, scope: !677, inlinedAt: !802)
!808 = !DILocation(line: 105, column: 15, scope: !689, inlinedAt: !802)
!809 = !DILocation(line: 105, column: 18, scope: !689, inlinedAt: !802)
!810 = !DILocation(line: 0, scope: !791, inlinedAt: !793)
!811 = !DILocation(line: 106, column: 1, scope: !677, inlinedAt: !802)
!812 = !DILocation(line: 153, column: 9, scope: !791, inlinedAt: !793)
!813 = !DILocalVariable(name: "fs", arg: 1, scope: !814, file: !1, line: 131, type: !427)
!814 = distinct !DISubprogram(name: "patchtestreg", scope: !1, file: !1, line: 131, type: !815, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!93, !427, !93, !93}
!817 = !{!813, !818, !819, !820}
!818 = !DILocalVariable(name: "node", arg: 2, scope: !814, file: !1, line: 131, type: !93)
!819 = !DILocalVariable(name: "reg", arg: 3, scope: !814, file: !1, line: 131, type: !93)
!820 = !DILocalVariable(name: "i", scope: !814, file: !1, line: 132, type: !385)
!821 = !DILocation(line: 131, column: 37, scope: !814, inlinedAt: !822)
!822 = distinct !DILocation(line: 154, column: 9, scope: !823, inlinedAt: !793)
!823 = distinct !DILexicalBlock(scope: !791, file: !1, line: 154, column: 9)
!824 = !DILocation(line: 131, column: 45, scope: !814, inlinedAt: !822)
!825 = !DILocation(line: 131, column: 55, scope: !814, inlinedAt: !822)
!826 = !DILocalVariable(name: "fs", arg: 1, scope: !827, file: !1, line: 109, type: !427)
!827 = distinct !DISubprogram(name: "getjumpcontrol", scope: !1, file: !1, line: 109, type: !828, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!385, !427, !93}
!830 = !{!826, !831, !832}
!831 = !DILocalVariable(name: "pc", arg: 2, scope: !827, file: !1, line: 109, type: !93)
!832 = !DILocalVariable(name: "pi", scope: !827, file: !1, line: 110, type: !385)
!833 = !DILocation(line: 109, column: 48, scope: !827, inlinedAt: !834)
!834 = distinct !DILocation(line: 132, column: 20, scope: !814, inlinedAt: !822)
!835 = !DILocation(line: 109, column: 56, scope: !827, inlinedAt: !834)
!836 = !DILocation(line: 110, column: 16, scope: !827, inlinedAt: !834)
!837 = !DILocation(line: 111, column: 10, scope: !838, inlinedAt: !834)
!838 = distinct !DILexicalBlock(scope: !827, file: !1, line: 111, column: 7)
!839 = !DILocation(line: 111, column: 15, scope: !838, inlinedAt: !834)
!840 = !DILocation(line: 111, column: 18, scope: !838, inlinedAt: !834)
!841 = !{!524, !524, i64 0}
!842 = !DILocation(line: 111, column: 7, scope: !827, inlinedAt: !834)
!843 = !DILocation(line: 114, column: 5, scope: !838, inlinedAt: !834)
!844 = !DILocation(line: 133, column: 7, scope: !845, inlinedAt: !822)
!845 = distinct !DILexicalBlock(scope: !814, file: !1, line: 133, column: 7)
!846 = !DILocation(line: 0, scope: !838, inlinedAt: !834)
!847 = !DILocation(line: 0, scope: !814, inlinedAt: !822)
!848 = !DILocation(line: 115, column: 1, scope: !827, inlinedAt: !834)
!849 = !DILocation(line: 132, column: 16, scope: !814, inlinedAt: !822)
!850 = !DILocation(line: 133, column: 22, scope: !845, inlinedAt: !822)
!851 = !DILocation(line: 133, column: 7, scope: !814, inlinedAt: !822)
!852 = !DILocation(line: 0, scope: !823, inlinedAt: !793)
!853 = !DILocation(line: 0, scope: !854, inlinedAt: !822)
!854 = distinct !DILexicalBlock(scope: !814, file: !1, line: 135, column: 7)
!855 = !DILocation(line: 138, column: 10, scope: !854, inlinedAt: !822)
!856 = !DILocation(line: 138, column: 8, scope: !854, inlinedAt: !822)
!857 = !DILocation(line: 140, column: 3, scope: !814, inlinedAt: !822)
!858 = !DILocation(line: 141, column: 1, scope: !814, inlinedAt: !822)
!859 = !DILocation(line: 154, column: 9, scope: !791, inlinedAt: !793)
!860 = !DILocation(line: 80, column: 33, scope: !702, inlinedAt: !861)
!861 = distinct !DILocation(line: 155, column: 7, scope: !823, inlinedAt: !793)
!862 = !DILocation(line: 80, column: 41, scope: !702, inlinedAt: !861)
!863 = !DILocation(line: 80, column: 49, scope: !702, inlinedAt: !861)
!864 = !DILocation(line: 81, column: 16, scope: !702, inlinedAt: !861)
!865 = !DILocation(line: 82, column: 20, scope: !702, inlinedAt: !861)
!866 = !DILocation(line: 82, column: 7, scope: !702, inlinedAt: !861)
!867 = !DILocation(line: 84, column: 7, scope: !716, inlinedAt: !861)
!868 = !DILocation(line: 84, column: 19, scope: !716, inlinedAt: !861)
!869 = !DILocation(line: 84, column: 7, scope: !702, inlinedAt: !861)
!870 = !DILocation(line: 85, column: 26, scope: !716, inlinedAt: !861)
!871 = !DILocation(line: 85, column: 5, scope: !716, inlinedAt: !861)
!872 = !DILocation(line: 80, column: 33, scope: !702, inlinedAt: !873)
!873 = distinct !DILocation(line: 157, column: 7, scope: !823, inlinedAt: !793)
!874 = !DILocation(line: 80, column: 41, scope: !702, inlinedAt: !873)
!875 = !DILocation(line: 80, column: 49, scope: !702, inlinedAt: !873)
!876 = !DILocation(line: 81, column: 16, scope: !702, inlinedAt: !873)
!877 = !DILocation(line: 82, column: 20, scope: !702, inlinedAt: !873)
!878 = !DILocation(line: 82, column: 7, scope: !702, inlinedAt: !873)
!879 = !DILocation(line: 84, column: 7, scope: !716, inlinedAt: !873)
!880 = !DILocation(line: 84, column: 19, scope: !716, inlinedAt: !873)
!881 = !DILocation(line: 84, column: 7, scope: !702, inlinedAt: !873)
!882 = !DILocation(line: 85, column: 26, scope: !716, inlinedAt: !873)
!883 = !DILocation(line: 85, column: 5, scope: !716, inlinedAt: !873)
!884 = !DILocation(line: 86, column: 3, scope: !702, inlinedAt: !873)
!885 = !DILocation(line: 87, column: 1, scope: !702, inlinedAt: !873)
!886 = distinct !{!886, !887, !888}
!887 = !DILocation(line: 152, column: 3, scope: !782)
!888 = !DILocation(line: 159, column: 3, scope: !782)
!889 = !DILocation(line: 0, scope: !761)
!890 = !DILocation(line: 176, column: 1, scope: !752)
!891 = !DILocation(line: 179, column: 35, scope: !765)
!892 = !DILocation(line: 179, column: 43, scope: !765)
!893 = !DILocation(line: 94, column: 31, scope: !744, inlinedAt: !894)
!894 = distinct !DILocation(line: 180, column: 3, scope: !765)
!895 = !DILocation(line: 95, column: 24, scope: !744, inlinedAt: !894)
!896 = !DILocation(line: 95, column: 7, scope: !744, inlinedAt: !894)
!897 = !DILocation(line: 95, column: 18, scope: !744, inlinedAt: !894)
!898 = !DILocation(line: 96, column: 3, scope: !744, inlinedAt: !894)
!899 = !DILocation(line: 181, column: 24, scope: !765)
!900 = !DILocation(line: 181, column: 3, scope: !765)
!901 = !DILocation(line: 182, column: 1, scope: !765)
!902 = distinct !DISubprogram(name: "luaK_checkstack", scope: !1, file: !1, line: 199, type: !766, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !903)
!903 = !{!904, !905, !906}
!904 = !DILocalVariable(name: "fs", arg: 1, scope: !902, file: !1, line: 199, type: !427)
!905 = !DILocalVariable(name: "n", arg: 2, scope: !902, file: !1, line: 199, type: !93)
!906 = !DILocalVariable(name: "newstack", scope: !902, file: !1, line: 200, type: !93)
!907 = !DILocation(line: 199, column: 34, scope: !902)
!908 = !DILocation(line: 199, column: 42, scope: !902)
!909 = !DILocation(line: 200, column: 22, scope: !902)
!910 = !{!522, !526, i64 60}
!911 = !DILocation(line: 200, column: 30, scope: !902)
!912 = !DILocation(line: 200, column: 7, scope: !902)
!913 = !DILocation(line: 201, column: 22, scope: !914)
!914 = distinct !DILexicalBlock(scope: !902, file: !1, line: 201, column: 7)
!915 = !DILocation(line: 201, column: 25, scope: !914)
!916 = !{!545, !524, i64 115}
!917 = !DILocation(line: 201, column: 18, scope: !914)
!918 = !DILocation(line: 201, column: 16, scope: !914)
!919 = !DILocation(line: 201, column: 7, scope: !902)
!920 = !DILocation(line: 202, column: 18, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !1, line: 202, column: 9)
!922 = distinct !DILexicalBlock(scope: !914, file: !1, line: 201, column: 39)
!923 = !DILocation(line: 202, column: 9, scope: !922)
!924 = !DILocation(line: 203, column: 28, scope: !921)
!925 = !DILocation(line: 203, column: 7, scope: !921)
!926 = !DILocation(line: 204, column: 9, scope: !922)
!927 = !DILocation(line: 204, column: 12, scope: !922)
!928 = !DILocation(line: 204, column: 27, scope: !922)
!929 = !DILocation(line: 204, column: 25, scope: !922)
!930 = !DILocation(line: 205, column: 3, scope: !922)
!931 = !DILocation(line: 206, column: 1, scope: !902)
!932 = distinct !DISubprogram(name: "luaK_reserveregs", scope: !1, file: !1, line: 209, type: !766, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !933)
!933 = !{!934, !935}
!934 = !DILocalVariable(name: "fs", arg: 1, scope: !932, file: !1, line: 209, type: !427)
!935 = !DILocalVariable(name: "n", arg: 2, scope: !932, file: !1, line: 209, type: !93)
!936 = !DILocation(line: 209, column: 35, scope: !932)
!937 = !DILocation(line: 209, column: 43, scope: !932)
!938 = !DILocation(line: 199, column: 34, scope: !902, inlinedAt: !939)
!939 = distinct !DILocation(line: 210, column: 3, scope: !932)
!940 = !DILocation(line: 199, column: 42, scope: !902, inlinedAt: !939)
!941 = !DILocation(line: 200, column: 22, scope: !902, inlinedAt: !939)
!942 = !DILocation(line: 200, column: 30, scope: !902, inlinedAt: !939)
!943 = !DILocation(line: 200, column: 7, scope: !902, inlinedAt: !939)
!944 = !DILocation(line: 201, column: 22, scope: !914, inlinedAt: !939)
!945 = !DILocation(line: 201, column: 25, scope: !914, inlinedAt: !939)
!946 = !DILocation(line: 201, column: 18, scope: !914, inlinedAt: !939)
!947 = !DILocation(line: 201, column: 16, scope: !914, inlinedAt: !939)
!948 = !DILocation(line: 201, column: 7, scope: !902, inlinedAt: !939)
!949 = !DILocation(line: 202, column: 18, scope: !921, inlinedAt: !939)
!950 = !DILocation(line: 202, column: 9, scope: !922, inlinedAt: !939)
!951 = !DILocation(line: 203, column: 28, scope: !921, inlinedAt: !939)
!952 = !DILocation(line: 203, column: 7, scope: !921, inlinedAt: !939)
!953 = !DILocation(line: 204, column: 9, scope: !922, inlinedAt: !939)
!954 = !DILocation(line: 204, column: 12, scope: !922, inlinedAt: !939)
!955 = !DILocation(line: 211, column: 15, scope: !932)
!956 = !DILocation(line: 204, column: 27, scope: !922, inlinedAt: !939)
!957 = !DILocation(line: 204, column: 25, scope: !922, inlinedAt: !939)
!958 = !DILocation(line: 205, column: 3, scope: !922, inlinedAt: !939)
!959 = !DILocation(line: 206, column: 1, scope: !902, inlinedAt: !939)
!960 = !DILocation(line: 212, column: 1, scope: !932)
!961 = distinct !DISubprogram(name: "luaK_stringK", scope: !1, file: !1, line: 250, type: !962, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{!93, !427, !296}
!964 = !{!965, !966, !967, !968}
!965 = !DILocalVariable(name: "fs", arg: 1, scope: !961, file: !1, line: 250, type: !427)
!966 = !DILocalVariable(name: "s", arg: 2, scope: !961, file: !1, line: 250, type: !296)
!967 = !DILocalVariable(name: "o", scope: !961, file: !1, line: 251, type: !156)
!968 = !DILocalVariable(name: "i_o", scope: !969, file: !1, line: 252, type: !155)
!969 = distinct !DILexicalBlock(scope: !961, file: !1, line: 252, column: 3)
!970 = !DILocation(line: 250, column: 30, scope: !961)
!971 = !DILocation(line: 250, column: 43, scope: !961)
!972 = !DILocation(line: 251, column: 3, scope: !961)
!973 = !DILocation(line: 252, column: 3, scope: !969)
!974 = !{!975, !526, i64 8}
!975 = !{!"lua_TValue", !524, i64 0, !526, i64 8}
!976 = !DILocation(line: 251, column: 10, scope: !961)
!977 = !DILocation(line: 253, column: 10, scope: !961)
!978 = !DILocation(line: 254, column: 1, scope: !961)
!979 = !DILocation(line: 253, column: 3, scope: !961)
!980 = distinct !DISubprogram(name: "addk", scope: !1, file: !1, line: 229, type: !981, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{!93, !427, !155, !155}
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !995, !999}
!984 = !DILocalVariable(name: "fs", arg: 1, scope: !980, file: !1, line: 229, type: !427)
!985 = !DILocalVariable(name: "k", arg: 2, scope: !980, file: !1, line: 229, type: !155)
!986 = !DILocalVariable(name: "v", arg: 3, scope: !980, file: !1, line: 229, type: !155)
!987 = !DILocalVariable(name: "L", scope: !980, file: !1, line: 230, type: !212)
!988 = !DILocalVariable(name: "idx", scope: !980, file: !1, line: 231, type: !155)
!989 = !DILocalVariable(name: "f", scope: !980, file: !1, line: 232, type: !432)
!990 = !DILocalVariable(name: "oldsize", scope: !980, file: !1, line: 233, type: !93)
!991 = !DILocalVariable(name: "i_o", scope: !992, file: !1, line: 239, type: !155)
!992 = distinct !DILexicalBlock(scope: !993, file: !1, line: 239, column: 5)
!993 = distinct !DILexicalBlock(scope: !994, file: !1, line: 238, column: 8)
!994 = distinct !DILexicalBlock(scope: !980, file: !1, line: 234, column: 7)
!995 = !DILocalVariable(name: "o2", scope: !996, file: !1, line: 243, type: !997)
!996 = distinct !DILexicalBlock(scope: !993, file: !1, line: 243, column: 5)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!999 = !DILocalVariable(name: "o1", scope: !996, file: !1, line: 243, type: !155)
!1000 = !DILocation(line: 229, column: 29, scope: !980)
!1001 = !DILocation(line: 229, column: 41, scope: !980)
!1002 = !DILocation(line: 229, column: 52, scope: !980)
!1003 = !DILocation(line: 230, column: 22, scope: !980)
!1004 = !{!522, !523, i64 32}
!1005 = !DILocation(line: 230, column: 14, scope: !980)
!1006 = !DILocation(line: 231, column: 33, scope: !980)
!1007 = !{!522, !523, i64 8}
!1008 = !DILocation(line: 231, column: 17, scope: !980)
!1009 = !DILocation(line: 231, column: 11, scope: !980)
!1010 = !DILocation(line: 232, column: 18, scope: !980)
!1011 = !DILocation(line: 232, column: 10, scope: !980)
!1012 = !DILocation(line: 233, column: 20, scope: !980)
!1013 = !{!545, !526, i64 76}
!1014 = !DILocation(line: 233, column: 7, scope: !980)
!1015 = !DILocation(line: 234, column: 7, scope: !994)
!1016 = !DILocation(line: 234, column: 7, scope: !980)
!1017 = !DILocation(line: 236, column: 12, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !994, file: !1, line: 234, column: 24)
!1019 = !DILocation(line: 236, column: 5, scope: !1018)
!1020 = !DILocation(line: 239, column: 5, scope: !992)
!1021 = !{!522, !526, i64 64}
!1022 = !DILocation(line: 240, column: 5, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !993, file: !1, line: 240, column: 5)
!1024 = !DILocation(line: 240, column: 5, scope: !993)
!1025 = !DILocation(line: 0, scope: !996)
!1026 = !{!545, !523, i64 16}
!1027 = !DILocation(line: 242, column: 25, scope: !993)
!1028 = !DILocation(line: 242, column: 5, scope: !993)
!1029 = !DILocation(line: 242, column: 20, scope: !993)
!1030 = !DILocation(line: 242, column: 32, scope: !993)
!1031 = distinct !{!1031, !1032}
!1032 = !{!"llvm.loop.unroll.disable"}
!1033 = distinct !{!1033, !1028, !1030}
!1034 = !DILocation(line: 243, column: 5, scope: !996)
!1035 = !DILocation(line: 244, column: 5, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !1, line: 244, column: 5)
!1037 = distinct !DILexicalBlock(scope: !993, file: !1, line: 244, column: 5)
!1038 = !DILocation(line: 244, column: 5, scope: !1037)
!1039 = !DILocation(line: 245, column: 18, scope: !993)
!1040 = !DILocation(line: 245, column: 5, scope: !993)
!1041 = !DILocation(line: 0, scope: !993)
!1042 = !DILocation(line: 0, scope: !1018)
!1043 = !DILocation(line: 247, column: 1, scope: !980)
!1044 = distinct !DISubprogram(name: "luaK_numberK", scope: !1, file: !1, line: 257, type: !1045, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1047)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!93, !427, !166}
!1047 = !{!1048, !1049, !1050, !1051}
!1048 = !DILocalVariable(name: "fs", arg: 1, scope: !1044, file: !1, line: 257, type: !427)
!1049 = !DILocalVariable(name: "r", arg: 2, scope: !1044, file: !1, line: 257, type: !166)
!1050 = !DILocalVariable(name: "o", scope: !1044, file: !1, line: 258, type: !156)
!1051 = !DILocalVariable(name: "i_o", scope: !1052, file: !1, line: 259, type: !155)
!1052 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 259, column: 3)
!1053 = !DILocation(line: 257, column: 30, scope: !1044)
!1054 = !DILocation(line: 257, column: 45, scope: !1044)
!1055 = !DILocation(line: 258, column: 3, scope: !1044)
!1056 = !DILocation(line: 259, column: 3, scope: !1052)
!1057 = !DILocation(line: 258, column: 10, scope: !1044)
!1058 = !DILocation(line: 260, column: 10, scope: !1044)
!1059 = !DILocation(line: 261, column: 1, scope: !1044)
!1060 = !DILocation(line: 260, column: 3, scope: !1044)
!1061 = distinct !DISubprogram(name: "luaK_setreturns", scope: !1, file: !1, line: 280, type: !1062, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1081)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !427, !1064, !93}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "expdesc", file: !46, line: 45, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "expdesc", file: !46, line: 37, size: 192, elements: !1067)
!1067 = !{!1068, !1070, !1079, !1080}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1066, file: !46, line: 38, baseType: !1069, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "expkind", file: !46, line: 35, baseType: !45)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1066, file: !46, line: 42, baseType: !1071, size: 64, offset: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1066, file: !46, line: 39, size: 64, elements: !1072)
!1072 = !{!1073, !1078}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1071, file: !46, line: 40, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1071, file: !46, line: 40, size: 64, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1074, file: !46, line: 40, baseType: !93, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1074, file: !46, line: 40, baseType: !93, size: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nval", scope: !1071, file: !46, line: 41, baseType: !166, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1066, file: !46, line: 43, baseType: !93, size: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1066, file: !46, line: 44, baseType: !93, size: 32, offset: 160)
!1081 = !{!1082, !1083, !1084}
!1082 = !DILocalVariable(name: "fs", arg: 1, scope: !1061, file: !1, line: 280, type: !427)
!1083 = !DILocalVariable(name: "e", arg: 2, scope: !1061, file: !1, line: 280, type: !1064)
!1084 = !DILocalVariable(name: "nresults", arg: 3, scope: !1061, file: !1, line: 280, type: !93)
!1085 = !DILocation(line: 280, column: 34, scope: !1061)
!1086 = !DILocation(line: 280, column: 47, scope: !1061)
!1087 = !DILocation(line: 280, column: 54, scope: !1061)
!1088 = !DILocation(line: 281, column: 10, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 281, column: 7)
!1090 = !{!1091, !524, i64 0}
!1091 = !{!"expdesc", !524, i64 0, !524, i64 8, !526, i64 16, !526, i64 20}
!1092 = !DILocation(line: 281, column: 12, scope: !1089)
!1093 = !DILocation(line: 281, column: 7, scope: !1061)
!1094 = !DILocation(line: 282, column: 5, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1089, file: !1, line: 281, column: 22)
!1096 = !DILocation(line: 283, column: 3, scope: !1095)
!1097 = !DILocation(line: 284, column: 17, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1089, file: !1, line: 284, column: 12)
!1099 = !DILocation(line: 284, column: 12, scope: !1089)
!1100 = !DILocation(line: 285, column: 5, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1098, file: !1, line: 284, column: 29)
!1102 = !DILocation(line: 286, column: 5, scope: !1101)
!1103 = !DILocation(line: 209, column: 35, scope: !932, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 287, column: 5, scope: !1101)
!1105 = !DILocation(line: 209, column: 43, scope: !932, inlinedAt: !1104)
!1106 = !DILocation(line: 199, column: 34, scope: !902, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 210, column: 3, scope: !932, inlinedAt: !1104)
!1108 = !DILocation(line: 199, column: 42, scope: !902, inlinedAt: !1107)
!1109 = !DILocation(line: 200, column: 22, scope: !902, inlinedAt: !1107)
!1110 = !DILocation(line: 200, column: 30, scope: !902, inlinedAt: !1107)
!1111 = !DILocation(line: 200, column: 7, scope: !902, inlinedAt: !1107)
!1112 = !DILocation(line: 201, column: 25, scope: !914, inlinedAt: !1107)
!1113 = !DILocation(line: 201, column: 18, scope: !914, inlinedAt: !1107)
!1114 = !DILocation(line: 201, column: 16, scope: !914, inlinedAt: !1107)
!1115 = !DILocation(line: 201, column: 7, scope: !902, inlinedAt: !1107)
!1116 = !DILocation(line: 202, column: 18, scope: !921, inlinedAt: !1107)
!1117 = !DILocation(line: 202, column: 9, scope: !922, inlinedAt: !1107)
!1118 = !DILocation(line: 203, column: 28, scope: !921, inlinedAt: !1107)
!1119 = !DILocation(line: 203, column: 7, scope: !921, inlinedAt: !1107)
!1120 = !DILocation(line: 204, column: 9, scope: !922, inlinedAt: !1107)
!1121 = !DILocation(line: 204, column: 12, scope: !922, inlinedAt: !1107)
!1122 = !DILocation(line: 211, column: 15, scope: !932, inlinedAt: !1104)
!1123 = !DILocation(line: 204, column: 27, scope: !922, inlinedAt: !1107)
!1124 = !DILocation(line: 204, column: 25, scope: !922, inlinedAt: !1107)
!1125 = !DILocation(line: 205, column: 3, scope: !922, inlinedAt: !1107)
!1126 = !DILocation(line: 206, column: 1, scope: !902, inlinedAt: !1107)
!1127 = !DILocation(line: 212, column: 1, scope: !932, inlinedAt: !1104)
!1128 = !DILocation(line: 288, column: 3, scope: !1101)
!1129 = !DILocation(line: 0, scope: !1095)
!1130 = !DILocation(line: 289, column: 1, scope: !1061)
!1131 = distinct !DISubprogram(name: "luaK_setoneret", scope: !1, file: !1, line: 292, type: !1132, isLocal: false, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1134)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !427, !1064}
!1134 = !{!1135, !1136}
!1135 = !DILocalVariable(name: "fs", arg: 1, scope: !1131, file: !1, line: 292, type: !427)
