; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldblib.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldblib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.lua_State = type opaque
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dblib", scope: !2, file: !3, line: 375, type: !48, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldblib.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !46}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "hooknames", scope: !11, file: !3, line: 208, type: !42, isLocal: true, isDefinition: true)
!11 = distinct !DISubprogram(name: "hookf", scope: !3, file: !3, line: 207, type: !12, isLocal: true, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !39)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14, !18}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !16, line: 50, baseType: !17)
!16 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !16, line: 50, flags: DIFlagFwdDecl)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !16, line: 326, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !16, line: 346, size: 960, elements: !21)
!21 = !{!22, !23, !27, !28, !29, !30, !31, !32, !33, !34, !38}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !20, file: !16, line: 347, baseType: !7, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !16, line: 348, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !20, file: !16, line: 349, baseType: !24, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !20, file: !16, line: 350, baseType: !24, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !20, file: !16, line: 351, baseType: !24, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !20, file: !16, line: 352, baseType: !7, size: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !20, file: !16, line: 353, baseType: !7, size: 32, offset: 352)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !20, file: !16, line: 354, baseType: !7, size: 32, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !20, file: !16, line: 355, baseType: !7, size: 32, offset: 416)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !20, file: !16, line: 356, baseType: !35, size: 480, offset: 448)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 480, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 60)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !20, file: !16, line: 358, baseType: !7, size: 32, offset: 928)
!39 = !{!40, !41}
!40 = !DILocalVariable(name: "L", arg: 1, scope: !11, file: !3, line: 207, type: !14)
!41 = !DILocalVariable(name: "ar", arg: 2, scope: !11, file: !3, line: 207, type: !18)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 320, elements: !44)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!44 = !{!45}
!45 = !DISubrange(count: 5)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "KEY_HOOK", scope: !2, file: !3, line: 204, type: !25, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1920, elements: !60)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !51, line: 38, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !51, line: 35, size: 128, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !51, line: 36, baseType: !24, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !52, file: !51, line: 37, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !16, line: 52, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!7, !14}
!60 = !{!61}
!61 = !DISubrange(count: 15)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{i32 1, !"wchar_size", i32 4}
!65 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!66 = distinct !DISubprogram(name: "luaopen_debug", scope: !3, file: !3, line: 394, type: !58, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !67)
!67 = !{!68}
!68 = !DILocalVariable(name: "L", arg: 1, scope: !66, file: !3, line: 394, type: !14)
!69 = !DILocation(line: 394, column: 42, scope: !66)
!70 = !DILocation(line: 395, column: 3, scope: !66)
!71 = !DILocation(line: 396, column: 3, scope: !66)
!72 = distinct !DISubprogram(name: "db_debug", scope: !3, file: !3, line: 302, type: !58, isLocal: true, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !73)
!73 = !{!74, !75}
!74 = !DILocalVariable(name: "L", arg: 1, scope: !72, file: !3, line: 302, type: !14)
!75 = !DILocalVariable(name: "buffer", scope: !76, file: !3, line: 304, type: !79)
!76 = distinct !DILexicalBlock(scope: !77, file: !3, line: 303, column: 12)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 303, column: 3)
!78 = distinct !DILexicalBlock(scope: !72, file: !3, line: 303, column: 3)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2000, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 250)
!82 = !DILocation(line: 302, column: 33, scope: !72)
!83 = !DILocation(line: 303, column: 3, scope: !72)
!84 = !DILocation(line: 304, column: 5, scope: !76)
!85 = !DILocation(line: 304, column: 10, scope: !76)
!86 = !DILocation(line: 305, column: 26, scope: !76)
!87 = !{!88, !92, i64 24}
!88 = !{!"_reent", !89, i64 0, !92, i64 8, !92, i64 16, !92, i64 24, !89, i64 32, !90, i64 36, !89, i64 64, !92, i64 72, !89, i64 80, !92, i64 88, !92, i64 96, !89, i64 104, !92, i64 112, !92, i64 120, !89, i64 128, !92, i64 136, !90, i64 144, !92, i64 504, !93, i64 512, !92, i64 1304, !95, i64 1312, !90, i64 1336}
!89 = !{!"int", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !{!"any pointer", !90, i64 0}
!93 = !{!"_atexit", !92, i64 0, !89, i64 8, !90, i64 16, !94, i64 272}
!94 = !{!"_on_exit_args", !90, i64 0, !90, i64 256, !89, i64 512, !89, i64 516}
!95 = !{!"_glue", !92, i64 0, !89, i64 8, !92, i64 16}
!96 = !DILocation(line: 305, column: 5, scope: !76)
!97 = !DILocation(line: 306, column: 39, scope: !98)
!98 = distinct !DILexicalBlock(scope: !76, file: !3, line: 306, column: 9)
!99 = !{!88, !92, i64 8}
!100 = !DILocation(line: 306, column: 9, scope: !98)
!101 = !DILocation(line: 306, column: 46, scope: !98)
!102 = !DILocation(line: 306, column: 51, scope: !98)
!103 = !DILocation(line: 307, column: 9, scope: !98)
!104 = !DILocation(line: 307, column: 34, scope: !98)
!105 = !DILocation(line: 306, column: 9, scope: !76)
!106 = !DILocation(line: 308, column: 7, scope: !98)
!107 = !DILocation(line: 315, column: 3, scope: !77)
!108 = !DILocation(line: 316, column: 1, scope: !72)
!109 = !DILocation(line: 309, column: 36, scope: !110)
!110 = distinct !DILexicalBlock(scope: !76, file: !3, line: 309, column: 9)
!111 = !DILocation(line: 309, column: 9, scope: !110)
!112 = !DILocation(line: 309, column: 72, scope: !110)
!113 = !DILocation(line: 310, column: 9, scope: !110)
!114 = !DILocation(line: 309, column: 9, scope: !76)
!115 = !DILocation(line: 311, column: 13, scope: !116)
!116 = distinct !DILexicalBlock(scope: !110, file: !3, line: 310, column: 32)
!117 = !DILocation(line: 311, column: 34, scope: !116)
