; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldebug.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldebug.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }
%struct.Table = type { %union.GCObject*, i8, i8, i8, i8, %struct.Table*, %struct.lua_TValue*, %struct.Node*, %struct.Node*, %union.GCObject*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !56)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldebug.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !45, !50}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 150, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lopcodes.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!7 = !DIEnumerator(name: "OP_MOVE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "OP_LOADK", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "OP_LOADBOOL", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "OP_LOADNIL", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "OP_GETUPVAL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OP_GETGLOBAL", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "OP_GETTABLE", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "OP_SETGLOBAL", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "OP_SETUPVAL", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "OP_SETTABLE", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "OP_NEWTABLE", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "OP_SELF", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "OP_ADD", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "OP_SUB", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "OP_MUL", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "OP_DIV", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "OP_MOD", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "OP_POW", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "OP_UNM", value: 18, isUnsigned: true)
!26 = !DIEnumerator(name: "OP_NOT", value: 19, isUnsigned: true)
!27 = !DIEnumerator(name: "OP_LEN", value: 20, isUnsigned: true)
!28 = !DIEnumerator(name: "OP_CONCAT", value: 21, isUnsigned: true)
!29 = !DIEnumerator(name: "OP_JMP", value: 22, isUnsigned: true)
!30 = !DIEnumerator(name: "OP_EQ", value: 23, isUnsigned: true)
!31 = !DIEnumerator(name: "OP_LT", value: 24, isUnsigned: true)
!32 = !DIEnumerator(name: "OP_LE", value: 25, isUnsigned: true)
!33 = !DIEnumerator(name: "OP_TEST", value: 26, isUnsigned: true)
!34 = !DIEnumerator(name: "OP_TESTSET", value: 27, isUnsigned: true)
!35 = !DIEnumerator(name: "OP_CALL", value: 28, isUnsigned: true)
!36 = !DIEnumerator(name: "OP_TAILCALL", value: 29, isUnsigned: true)
!37 = !DIEnumerator(name: "OP_RETURN", value: 30, isUnsigned: true)
!38 = !DIEnumerator(name: "OP_FORLOOP", value: 31, isUnsigned: true)
!39 = !DIEnumerator(name: "OP_FORPREP", value: 32, isUnsigned: true)
!40 = !DIEnumerator(name: "OP_TFORLOOP", value: 33, isUnsigned: true)
!41 = !DIEnumerator(name: "OP_SETLIST", value: 34, isUnsigned: true)
!42 = !DIEnumerator(name: "OP_CLOSE", value: 35, isUnsigned: true)
!43 = !DIEnumerator(name: "OP_CLOSURE", value: 36, isUnsigned: true)
!44 = !DIEnumerator(name: "OP_VARARG", value: 37, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpMode", file: !4, line: 31, baseType: !5, size: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "iABC", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "iABx", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "iAsBx", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpArgMask", file: !4, line: 245, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "OpArgN", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "OpArgU", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "OpArgR", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "OpArgK", value: 3, isUnsigned: true)
!56 = !{!57, !58, !61, !62, !225, !390, !279, !122, !307, !45, !50}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !59, line: 27, baseType: !60)
!59 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !64, line: 36, baseType: !65)
!64 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !66, line: 136, size: 1472, elements: !67)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !{!68, !75, !101, !160, !386, !387, !388, !389}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !65, file: !66, line: 137, baseType: !69, size: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !64, line: 51, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !64, line: 49, size: 128, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !64, line: 50, baseType: !62, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !70, file: !64, line: 50, baseType: !58, size: 8, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !70, file: !64, line: 50, baseType: !58, size: 8, offset: 72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !65, file: !66, line: 138, baseType: !76, size: 192)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !64, line: 199, size: 192, elements: !77)
!77 = !{!78, !87}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !76, file: !64, line: 200, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !59, line: 47, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !59, line: 47, size: 64, elements: !81)
!81 = !{!82, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !59, line: 47, baseType: !83, size: 64)
!83 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !80, file: !59, line: 47, baseType: !57, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !80, file: !59, line: 47, baseType: !86, size: 64)
!86 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !76, file: !64, line: 206, baseType: !88, size: 192)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !64, line: 201, size: 192, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !64, line: 202, baseType: !62, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !88, file: !64, line: 202, baseType: !58, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !88, file: !64, line: 202, baseType: !58, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !88, file: !64, line: 203, baseType: !58, size: 8, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !88, file: !64, line: 204, baseType: !5, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !64, line: 205, baseType: !96, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 40, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !99, line: 129, baseType: !100)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !65, file: !66, line: 139, baseType: !102, size: 320)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !64, line: 215, size: 320, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !102, file: !64, line: 216, baseType: !79, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !102, file: !64, line: 222, baseType: !106, size: 320)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !102, file: !64, line: 217, size: 320, elements: !107)
!107 = !{!108, !109, !110, !111, !158, !159}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !64, line: 218, baseType: !62, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !106, file: !64, line: 218, baseType: !58, size: 8, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !106, file: !64, line: 218, baseType: !58, size: 8, offset: 72)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !106, file: !64, line: 219, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !64, line: 338, size: 512, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !137, !155, !156, !157}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !64, line: 339, baseType: !62, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !113, file: !64, line: 339, baseType: !58, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !113, file: !64, line: 339, baseType: !58, size: 8, offset: 72)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !64, line: 340, baseType: !58, size: 8, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !113, file: !64, line: 341, baseType: !58, size: 8, offset: 88)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !113, file: !64, line: 342, baseType: !112, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !113, file: !64, line: 343, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !64, line: 75, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !64, line: 73, size: 128, elements: !125)
!125 = !{!126, !136}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !124, file: !64, line: 74, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !64, line: 64, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 59, size: 64, elements: !129)
!129 = !{!130, !131, !132, !135}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !128, file: !64, line: 60, baseType: !62, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !128, file: !64, line: 61, baseType: !57, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !128, file: !64, line: 62, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !134, line: 99, baseType: !83)
!134 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !128, file: !64, line: 63, baseType: !61, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !124, file: !64, line: 74, baseType: !61, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !113, file: !64, line: 344, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !64, line: 335, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !64, line: 332, size: 320, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !140, file: !64, line: 333, baseType: !123, size: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !140, file: !64, line: 334, baseType: !144, size: 192, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !64, line: 329, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !64, line: 323, size: 192, elements: !146)
!146 = !{!147, !154}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !145, file: !64, line: 327, baseType: !148, size: 192)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !64, line: 324, size: 192, elements: !149)
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !148, file: !64, line: 325, baseType: !127, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !148, file: !64, line: 325, baseType: !61, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !64, line: 326, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !145, file: !64, line: 328, baseType: !123, size: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !113, file: !64, line: 345, baseType: !138, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !113, file: !64, line: 346, baseType: !62, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !113, file: !64, line: 347, baseType: !61, size: 32, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !106, file: !64, line: 220, baseType: !112, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !64, line: 221, baseType: !96, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !65, file: !66, line: 140, baseType: !161, size: 448)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !64, line: 309, size: 448, elements: !162)
!162 = !{!163, !335}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !161, file: !64, line: 310, baseType: !164, size: 448)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !64, line: 299, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !64, line: 295, size: 448, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !331}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !64, line: 296, baseType: !62, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 72)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 80)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 88)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !165, file: !64, line: 296, baseType: !62, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !165, file: !64, line: 296, baseType: !112, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !165, file: !64, line: 297, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !134, line: 52, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!61, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !134, line: 50, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !66, line: 100, size: 1472, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !189, !190, !268, !282, !283, !284, !285, !286, !287, !288, !289, !291, !292, !293, !294, !295, !296, !321, !322, !323, !324, !325, !328}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !66, line: 101, baseType: !62, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !181, file: !66, line: 101, baseType: !58, size: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !181, file: !66, line: 101, baseType: !58, size: 8, offset: 72)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !181, file: !66, line: 102, baseType: !58, size: 8, offset: 80)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !181, file: !66, line: 103, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !64, line: 193, baseType: !122)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !181, file: !66, line: 104, baseType: !188, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !181, file: !66, line: 105, baseType: !191, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !66, line: 94, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !66, line: 68, size: 3456, elements: !194)
!194 = !{!195, !204, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !229, !231, !232, !233, !234, !235, !236, !237, !238, !240, !258, !262}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !193, file: !66, line: 69, baseType: !196, size: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !66, line: 42, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !66, line: 38, size: 128, elements: !198)
!198 = !{!199, !201, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !197, file: !66, line: 39, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !197, file: !66, line: 40, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !59, line: 18, baseType: !5)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !66, line: 41, baseType: !61, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !193, file: !66, line: 70, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !134, line: 66, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!57, !57, !57, !96, !96}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !193, file: !66, line: 71, baseType: !57, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !193, file: !66, line: 72, baseType: !58, size: 8, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !193, file: !66, line: 73, baseType: !58, size: 8, offset: 264)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !193, file: !66, line: 74, baseType: !61, size: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !193, file: !66, line: 75, baseType: !62, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !193, file: !66, line: 76, baseType: !200, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !193, file: !66, line: 77, baseType: !62, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !193, file: !66, line: 78, baseType: !62, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !193, file: !66, line: 79, baseType: !62, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !193, file: !66, line: 80, baseType: !62, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !193, file: !66, line: 81, baseType: !220, size: 192, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !221, line: 28, baseType: !222)
!221 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !221, line: 24, size: 192, elements: !223)
!223 = !{!224, !227, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !222, file: !221, line: 25, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !222, file: !221, line: 26, baseType: !96, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !222, file: !221, line: 27, baseType: !96, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !193, file: !66, line: 82, baseType: !230, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !59, line: 20, baseType: !96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !193, file: !66, line: 83, baseType: !230, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !193, file: !66, line: 84, baseType: !230, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !193, file: !66, line: 85, baseType: !230, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !193, file: !66, line: 86, baseType: !61, size: 32, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !193, file: !66, line: 87, baseType: !61, size: 32, offset: 1184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !193, file: !66, line: 88, baseType: !175, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !193, file: !66, line: 89, baseType: !123, size: 128, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !193, file: !66, line: 90, baseType: !239, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !193, file: !66, line: 91, baseType: !241, size: 320, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !64, line: 284, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !64, line: 274, size: 320, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !64, line: 275, baseType: !62, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !242, file: !64, line: 275, baseType: !58, size: 8, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !242, file: !64, line: 275, baseType: !58, size: 8, offset: 72)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !242, file: !64, line: 276, baseType: !122, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !242, file: !64, line: 283, baseType: !249, size: 128, offset: 192)
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !64, line: 277, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !249, file: !64, line: 278, baseType: !123, size: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !249, file: !64, line: 282, baseType: !253, size: 128)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !249, file: !64, line: 279, size: 128, elements: !254)
!254 = !{!255, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !64, line: 280, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !64, line: 281, baseType: !256, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !193, file: !66, line: 92, baseType: !259, size: 576, offset: 1792)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 576, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 9)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !193, file: !66, line: 93, baseType: !263, size: 1088, offset: 2368)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1088, elements: !266)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !64, line: 207, baseType: !76)
!266 = !{!267}
!267 = !DISubrange(count: 17)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !181, file: !66, line: 106, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !66, line: 55, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !66, line: 48, size: 320, elements: !272)
!272 = !{!273, !274, !275, !276, !280, !281}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !271, file: !66, line: 49, baseType: !188, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !271, file: !66, line: 50, baseType: !188, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !271, file: !66, line: 51, baseType: !188, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !271, file: !66, line: 52, baseType: !277, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !59, line: 88, baseType: !202)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !271, file: !66, line: 53, baseType: !61, size: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !271, file: !66, line: 54, baseType: !61, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !181, file: !66, line: 107, baseType: !277, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !181, file: !66, line: 108, baseType: !188, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !181, file: !66, line: 109, baseType: !188, size: 64, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !181, file: !66, line: 110, baseType: !269, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !181, file: !66, line: 111, baseType: !269, size: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !181, file: !66, line: 112, baseType: !61, size: 32, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !181, file: !66, line: 113, baseType: !61, size: 32, offset: 736)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !181, file: !66, line: 114, baseType: !290, size: 16, offset: 768)
!290 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !181, file: !66, line: 115, baseType: !290, size: 16, offset: 784)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !181, file: !66, line: 116, baseType: !58, size: 8, offset: 800)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !181, file: !66, line: 117, baseType: !58, size: 8, offset: 808)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !181, file: !66, line: 118, baseType: !61, size: 32, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !181, file: !66, line: 119, baseType: !61, size: 32, offset: 864)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !181, file: !66, line: 120, baseType: !297, size: 64, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !134, line: 330, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !179, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !134, line: 326, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !134, line: 346, size: 960, elements: !304)
!304 = !{!305, !306, !309, !310, !311, !312, !313, !314, !315, !316, !320}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !303, file: !134, line: 347, baseType: !61, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !134, line: 348, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !303, file: !134, line: 349, baseType: !307, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !303, file: !134, line: 350, baseType: !307, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !303, file: !134, line: 351, baseType: !307, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !303, file: !134, line: 352, baseType: !61, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !303, file: !134, line: 353, baseType: !61, size: 32, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !303, file: !134, line: 354, baseType: !61, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !303, file: !134, line: 355, baseType: !61, size: 32, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !303, file: !134, line: 356, baseType: !317, size: 480, offset: 448)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 480, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 60)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !303, file: !134, line: 358, baseType: !61, size: 32, offset: 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !181, file: !66, line: 121, baseType: !123, size: 128, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !181, file: !66, line: 122, baseType: !123, size: 128, offset: 1088)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !181, file: !66, line: 123, baseType: !62, size: 64, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !181, file: !66, line: 124, baseType: !62, size: 64, offset: 1280)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !181, file: !66, line: 125, baseType: !326, size: 64, offset: 1344)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !66, line: 18, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !181, file: !66, line: 126, baseType: !329, size: 64, offset: 1408)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !330, line: 49, baseType: !86)
!330 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !165, file: !64, line: 298, baseType: !332, size: 128, offset: 320)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !161, file: !64, line: 311, baseType: !336, size: 384)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !64, line: 306, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !64, line: 302, size: 384, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !383}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !64, line: 303, baseType: !62, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 72)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 80)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 88)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !337, file: !64, line: 303, baseType: !62, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !337, file: !64, line: 303, baseType: !112, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !337, file: !64, line: 304, baseType: !347, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !64, line: 231, size: 960, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !356, !358, !360, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !64, line: 232, baseType: !62, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !348, file: !64, line: 232, baseType: !58, size: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !348, file: !64, line: 232, baseType: !58, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !348, file: !64, line: 233, baseType: !122, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !348, file: !64, line: 234, baseType: !355, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !348, file: !64, line: 235, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !348, file: !64, line: 236, baseType: !359, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !348, file: !64, line: 237, baseType: !361, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !64, line: 262, size: 128, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !362, file: !64, line: 263, baseType: !264, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !362, file: !64, line: 264, baseType: !61, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !362, file: !64, line: 265, baseType: !61, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !348, file: !64, line: 238, baseType: !368, size: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !348, file: !64, line: 239, baseType: !264, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !348, file: !64, line: 240, baseType: !61, size: 32, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !348, file: !64, line: 241, baseType: !61, size: 32, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !348, file: !64, line: 242, baseType: !61, size: 32, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !348, file: !64, line: 243, baseType: !61, size: 32, offset: 672)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !348, file: !64, line: 244, baseType: !61, size: 32, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !348, file: !64, line: 245, baseType: !61, size: 32, offset: 736)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !348, file: !64, line: 246, baseType: !61, size: 32, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !348, file: !64, line: 247, baseType: !61, size: 32, offset: 800)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !348, file: !64, line: 248, baseType: !62, size: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !348, file: !64, line: 249, baseType: !58, size: 8, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !348, file: !64, line: 250, baseType: !58, size: 8, offset: 904)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !348, file: !64, line: 251, baseType: !58, size: 8, offset: 912)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !348, file: !64, line: 252, baseType: !58, size: 8, offset: 920)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !337, file: !64, line: 305, baseType: !384, size: 64, offset: 320)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !333)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !65, file: !66, line: 141, baseType: !113, size: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !65, file: !66, line: 142, baseType: !348, size: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !65, file: !66, line: 143, baseType: !242, size: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !65, file: !66, line: 144, baseType: !181, size: 1472)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpCode", file: !4, line: 208, baseType: !3)
!391 = !{i32 2, !"Dwarf Version", i32 4}
!392 = !{i32 2, !"Debug Info Version", i32 3}
!393 = !{i32 1, !"wchar_size", i32 4}
!394 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!395 = distinct !DISubprogram(name: "lua_sethook", scope: !1, file: !1, line: 56, type: !396, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!61, !179, !297, !61, !61}
!398 = !{!399, !400, !401, !402}
!399 = !DILocalVariable(name: "L", arg: 1, scope: !395, file: !1, line: 56, type: !179)
!400 = !DILocalVariable(name: "func", arg: 2, scope: !395, file: !1, line: 56, type: !297)
!401 = !DILocalVariable(name: "mask", arg: 3, scope: !395, file: !1, line: 56, type: !61)
!402 = !DILocalVariable(name: "count", arg: 4, scope: !395, file: !1, line: 56, type: !61)
!403 = !DILocation(line: 56, column: 37, scope: !395)
!404 = !DILocation(line: 56, column: 49, scope: !395)
!405 = !DILocation(line: 56, column: 59, scope: !395)
!406 = !DILocation(line: 56, column: 69, scope: !395)
!407 = !DILocation(line: 57, column: 12, scope: !408)
!408 = distinct !DILexicalBlock(scope: !395, file: !1, line: 57, column: 7)
!409 = !DILocation(line: 57, column: 28, scope: !408)
!410 = !DILocation(line: 57, column: 20, scope: !408)
!411 = !DILocation(line: 60, column: 3, scope: !412)
!412 = distinct !DILexicalBlock(scope: !408, file: !1, line: 57, column: 34)
!413 = !DILocation(line: 61, column: 6, scope: !395)
!414 = !DILocation(line: 61, column: 11, scope: !395)
!415 = !{!416, !417, i64 112}
!416 = !{!"lua_State", !417, i64 0, !418, i64 8, !418, i64 9, !418, i64 10, !417, i64 16, !417, i64 24, !417, i64 32, !417, i64 40, !417, i64 48, !417, i64 56, !417, i64 64, !417, i64 72, !417, i64 80, !420, i64 88, !420, i64 92, !421, i64 96, !421, i64 98, !418, i64 100, !418, i64 101, !420, i64 104, !420, i64 108, !417, i64 112, !422, i64 120, !422, i64 136, !417, i64 152, !417, i64 160, !417, i64 168, !423, i64 176}
!417 = !{!"any pointer", !418, i64 0}
!418 = !{!"omnipotent char", !419, i64 0}
!419 = !{!"Simple C/C++ TBAA"}
!420 = !{!"int", !418, i64 0}
!421 = !{!"short", !418, i64 0}
!422 = !{!"lua_TValue", !418, i64 0, !420, i64 8}
!423 = !{!"long", !418, i64 0}
!424 = !DILocation(line: 62, column: 6, scope: !395)
!425 = !DILocation(line: 62, column: 20, scope: !395)
!426 = !{!416, !420, i64 104}
!427 = !DILocation(line: 63, column: 3, scope: !395)
!428 = !{!416, !420, i64 108}
!429 = !DILocation(line: 64, column: 17, scope: !395)
!430 = !DILocation(line: 64, column: 6, scope: !395)
!431 = !DILocation(line: 64, column: 15, scope: !395)
!432 = !{!416, !418, i64 100}
!433 = !DILocation(line: 65, column: 3, scope: !395)
!434 = distinct !DISubprogram(name: "lua_gethook", scope: !1, file: !1, line: 69, type: !435, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{!297, !179}
!437 = !{!438}
!438 = !DILocalVariable(name: "L", arg: 1, scope: !434, file: !1, line: 69, type: !179)
!439 = !DILocation(line: 69, column: 42, scope: !434)
!440 = !DILocation(line: 70, column: 13, scope: !434)
!441 = !DILocation(line: 70, column: 3, scope: !434)
!442 = distinct !DISubprogram(name: "lua_gethookmask", scope: !1, file: !1, line: 74, type: !177, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !443)
!443 = !{!444}
!444 = !DILocalVariable(name: "L", arg: 1, scope: !442, file: !1, line: 74, type: !179)
!445 = !DILocation(line: 74, column: 41, scope: !442)
!446 = !DILocation(line: 75, column: 13, scope: !442)
!447 = !DILocation(line: 75, column: 10, scope: !442)
!448 = !DILocation(line: 75, column: 3, scope: !442)
!449 = distinct !DISubprogram(name: "lua_gethookcount", scope: !1, file: !1, line: 79, type: !177, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !450)
!450 = !{!451}
!451 = !DILocalVariable(name: "L", arg: 1, scope: !449, file: !1, line: 79, type: !179)
!452 = !DILocation(line: 79, column: 42, scope: !449)
!453 = !DILocation(line: 80, column: 13, scope: !449)
!454 = !DILocation(line: 80, column: 3, scope: !449)
!455 = distinct !DISubprogram(name: "lua_getstack", scope: !1, file: !1, line: 84, type: !456, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!61, !179, !61, !301}
!458 = !{!459, !460, !461, !462, !463}
!459 = !DILocalVariable(name: "L", arg: 1, scope: !455, file: !1, line: 84, type: !179)
!460 = !DILocalVariable(name: "level", arg: 2, scope: !455, file: !1, line: 84, type: !61)
!461 = !DILocalVariable(name: "ar", arg: 3, scope: !455, file: !1, line: 84, type: !301)
!462 = !DILocalVariable(name: "status", scope: !455, file: !1, line: 85, type: !61)
!463 = !DILocalVariable(name: "ci", scope: !455, file: !1, line: 86, type: !269)
!464 = !DILocation(line: 84, column: 38, scope: !455)
!465 = !DILocation(line: 84, column: 45, scope: !455)
!466 = !DILocation(line: 84, column: 63, scope: !455)
!467 = !DILocation(line: 88, column: 16, scope: !468)
!468 = distinct !DILexicalBlock(scope: !455, file: !1, line: 88, column: 3)
!469 = !{!416, !417, i64 40}
!470 = !DILocation(line: 86, column: 13, scope: !455)
!471 = !DILocation(line: 88, column: 8, scope: !468)
!472 = !DILocation(line: 88, column: 26, scope: !473)
!473 = distinct !DILexicalBlock(scope: !468, file: !1, line: 88, column: 3)
!474 = !DILocation(line: 88, column: 30, scope: !473)
!475 = !{!416, !417, i64 80}
!476 = !DILocation(line: 88, column: 36, scope: !473)
!477 = !DILocation(line: 88, column: 3, scope: !468)
!478 = !DILocation(line: 93, column: 18, scope: !479)
!479 = distinct !DILexicalBlock(scope: !455, file: !1, line: 93, column: 7)
!480 = !DILocation(line: 89, column: 10, scope: !481)
!481 = distinct !DILexicalBlock(scope: !473, file: !1, line: 88, column: 56)
!482 = !DILocation(line: 90, column: 9, scope: !483)
!483 = distinct !DILexicalBlock(scope: !481, file: !1, line: 90, column: 9)
!484 = !{!485, !417, i64 8}
!485 = !{!"CallInfo", !417, i64 0, !417, i64 8, !417, i64 16, !417, i64 24, !420, i64 32, !420, i64 36}
!486 = !{!418, !418, i64 0}
!487 = !DILocation(line: 90, column: 9, scope: !481)
!488 = !DILocation(line: 91, column: 20, scope: !483)
!489 = !{!485, !420, i64 36}
!490 = !DILocation(line: 91, column: 13, scope: !483)
!491 = !DILocation(line: 91, column: 7, scope: !483)
!492 = !DILocation(line: 0, scope: !483)
!493 = !DILocation(line: 88, column: 52, scope: !473)
!494 = !DILocation(line: 88, column: 3, scope: !473)
!495 = distinct !{!495, !477, !496}
!496 = !DILocation(line: 92, column: 3, scope: !468)
!497 = !DILocation(line: 0, scope: !473)
!498 = !DILocation(line: 93, column: 13, scope: !479)
!499 = !DILocation(line: 93, column: 29, scope: !479)
!500 = !DILocation(line: 93, column: 24, scope: !479)
!501 = !DILocation(line: 93, column: 7, scope: !455)
!502 = !DILocation(line: 85, column: 7, scope: !455)
!503 = !DILocation(line: 95, column: 16, scope: !504)
!504 = distinct !DILexicalBlock(scope: !479, file: !1, line: 93, column: 38)
!505 = !DILocation(line: 95, column: 9, scope: !504)
!506 = !DILocation(line: 95, column: 14, scope: !504)
!507 = !{!508, !420, i64 116}
!508 = !{!"lua_Debug", !420, i64 0, !417, i64 8, !417, i64 16, !417, i64 24, !417, i64 32, !420, i64 40, !420, i64 44, !420, i64 48, !420, i64 52, !418, i64 56, !420, i64 116}
!509 = !DILocation(line: 96, column: 3, scope: !504)
!510 = !DILocation(line: 97, column: 12, scope: !479)
!511 = !DILocation(line: 99, column: 9, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 97, column: 23)
!513 = distinct !DILexicalBlock(scope: !479, file: !1, line: 97, column: 12)
!514 = !DILocation(line: 99, column: 14, scope: !512)
!515 = !DILocation(line: 100, column: 3, scope: !512)
!516 = !DILocation(line: 0, scope: !513)
!517 = !DILocation(line: 103, column: 3, scope: !455)
!518 = distinct !DISubprogram(name: "lua_getlocal", scope: !1, file: !1, line: 127, type: !519, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !523)
!519 = !DISubroutineType(types: !520)
!520 = !{!307, !179, !521, !61}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!523 = !{!524, !525, !526, !527, !528}
!524 = !DILocalVariable(name: "L", arg: 1, scope: !518, file: !1, line: 127, type: !179)
!525 = !DILocalVariable(name: "ar", arg: 2, scope: !518, file: !1, line: 127, type: !521)
!526 = !DILocalVariable(name: "n", arg: 3, scope: !518, file: !1, line: 127, type: !61)
!527 = !DILocalVariable(name: "ci", scope: !518, file: !1, line: 128, type: !269)
!528 = !DILocalVariable(name: "name", scope: !518, file: !1, line: 129, type: !307)
!529 = !DILocation(line: 127, column: 46, scope: !518)
!530 = !DILocation(line: 127, column: 66, scope: !518)
!531 = !DILocation(line: 127, column: 74, scope: !518)
!532 = !DILocation(line: 128, column: 21, scope: !518)
!533 = !DILocation(line: 128, column: 35, scope: !518)
!534 = !DILocation(line: 128, column: 29, scope: !518)
!535 = !DILocation(line: 128, column: 13, scope: !518)
!536 = !DILocalVariable(name: "L", arg: 1, scope: !537, file: !1, line: 112, type: !179)
!537 = distinct !DISubprogram(name: "findlocal", scope: !1, file: !1, line: 112, type: !538, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!307, !179, !269, !61}
!540 = !{!536, !541, !542, !543, !544, !547}
!541 = !DILocalVariable(name: "ci", arg: 2, scope: !537, file: !1, line: 112, type: !269)
!542 = !DILocalVariable(name: "n", arg: 3, scope: !537, file: !1, line: 112, type: !61)
!543 = !DILocalVariable(name: "name", scope: !537, file: !1, line: 113, type: !307)
!544 = !DILocalVariable(name: "fp", scope: !537, file: !1, line: 114, type: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "Proto", file: !64, line: 253, baseType: !348)
!547 = !DILocalVariable(name: "limit", scope: !548, file: !1, line: 118, type: !188)
!548 = distinct !DILexicalBlock(scope: !549, file: !1, line: 117, column: 8)
!549 = distinct !DILexicalBlock(scope: !537, file: !1, line: 115, column: 7)
!550 = !DILocation(line: 112, column: 42, scope: !537, inlinedAt: !551)
!551 = distinct !DILocation(line: 129, column: 22, scope: !518)
!552 = !DILocation(line: 112, column: 55, scope: !537, inlinedAt: !551)
!553 = !DILocation(line: 112, column: 63, scope: !537, inlinedAt: !551)
!554 = !DILocalVariable(name: "ci", arg: 1, scope: !555, file: !1, line: 107, type: !269)
!555 = distinct !DISubprogram(name: "getluaproto", scope: !1, file: !1, line: 107, type: !556, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{!545, !269}
!558 = !{!554}
!559 = !DILocation(line: 107, column: 38, scope: !555, inlinedAt: !560)
!560 = distinct !DILocation(line: 114, column: 15, scope: !537, inlinedAt: !551)
!561 = !DILocation(line: 108, column: 11, scope: !555, inlinedAt: !560)
!562 = !{!422, !420, i64 8}
!563 = !DILocation(line: 108, column: 3, scope: !555, inlinedAt: !560)
!564 = !DILocation(line: 114, column: 10, scope: !537, inlinedAt: !551)
!565 = !DILocation(line: 115, column: 10, scope: !549, inlinedAt: !551)
!566 = !DILocation(line: 108, column: 38, scope: !555, inlinedAt: !560)
!567 = !DILocation(line: 115, column: 7, scope: !549, inlinedAt: !551)
!568 = !DILocalVariable(name: "L", arg: 1, scope: !569, file: !1, line: 36, type: !179)
!569 = distinct !DISubprogram(name: "currentpc", scope: !1, file: !1, line: 36, type: !570, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{!61, !179, !269}
!572 = !{!568, !573}
!573 = !DILocalVariable(name: "ci", arg: 2, scope: !569, file: !1, line: 36, type: !269)
!574 = !DILocation(line: 36, column: 34, scope: !569, inlinedAt: !575)
!575 = distinct !DILocation(line: 115, column: 46, scope: !549, inlinedAt: !551)
!576 = !DILocation(line: 36, column: 47, scope: !569, inlinedAt: !575)
!577 = !DILocation(line: 37, column: 8, scope: !578, inlinedAt: !575)
!578 = distinct !DILexicalBlock(scope: !569, file: !1, line: 37, column: 7)
!579 = !DILocation(line: 37, column: 7, scope: !569, inlinedAt: !575)
!580 = !DILocation(line: 38, column: 16, scope: !581, inlinedAt: !575)
!581 = distinct !DILexicalBlock(scope: !569, file: !1, line: 38, column: 7)
!582 = !DILocation(line: 38, column: 10, scope: !581, inlinedAt: !575)
!583 = !DILocation(line: 38, column: 7, scope: !569, inlinedAt: !575)
!584 = !DILocation(line: 40, column: 10, scope: !569, inlinedAt: !575)
!585 = !{!485, !417, i64 24}
!586 = !DILocation(line: 39, column: 22, scope: !581, inlinedAt: !575)
!587 = !{!416, !417, i64 48}
!588 = !DILocation(line: 39, column: 9, scope: !581, inlinedAt: !575)
!589 = !DILocation(line: 39, column: 17, scope: !581, inlinedAt: !575)
!590 = !DILocation(line: 39, column: 5, scope: !581, inlinedAt: !575)
!591 = !{!592, !417, i64 24}
!592 = !{!"Proto", !417, i64 0, !418, i64 8, !418, i64 9, !417, i64 16, !417, i64 24, !417, i64 32, !417, i64 40, !417, i64 48, !417, i64 56, !417, i64 64, !420, i64 72, !420, i64 76, !420, i64 80, !420, i64 84, !420, i64 88, !420, i64 92, !420, i64 96, !420, i64 100, !417, i64 104, !418, i64 112, !418, i64 113, !418, i64 114, !418, i64 115}
!593 = !DILocation(line: 40, column: 3, scope: !569, inlinedAt: !575)
!594 = !DILocation(line: 41, column: 1, scope: !569, inlinedAt: !575)
!595 = !DILocation(line: 115, column: 21, scope: !549, inlinedAt: !551)
!596 = !DILocation(line: 113, column: 15, scope: !537, inlinedAt: !551)
!597 = !DILocation(line: 115, column: 65, scope: !549, inlinedAt: !551)
!598 = !DILocation(line: 115, column: 7, scope: !537, inlinedAt: !551)
!599 = !DILocation(line: 116, column: 5, scope: !549, inlinedAt: !551)
!600 = !DILocation(line: 132, column: 30, scope: !601)
!601 = distinct !DILexicalBlock(scope: !518, file: !1, line: 131, column: 7)
!602 = !{!485, !417, i64 0}
!603 = !DILocation(line: 118, column: 29, scope: !548, inlinedAt: !551)
!604 = !DILocation(line: 118, column: 23, scope: !548, inlinedAt: !551)
!605 = !DILocation(line: 118, column: 19, scope: !548, inlinedAt: !551)
!606 = !DILocation(line: 118, column: 52, scope: !548, inlinedAt: !551)
!607 = !DILocation(line: 118, column: 38, scope: !548, inlinedAt: !551)
!608 = !DILocation(line: 0, scope: !518)
!609 = !{!417, !417, i64 0}
!610 = !DILocation(line: 118, column: 11, scope: !548, inlinedAt: !551)
!611 = !DILocation(line: 119, column: 21, scope: !612, inlinedAt: !551)
!612 = distinct !DILexicalBlock(scope: !548, file: !1, line: 119, column: 9)
!613 = !DILocation(line: 119, column: 15, scope: !612, inlinedAt: !551)
!614 = !DILocation(line: 119, column: 29, scope: !612, inlinedAt: !551)
!615 = !DILocation(line: 119, column: 26, scope: !612, inlinedAt: !551)
!616 = !DILocation(line: 119, column: 36, scope: !612, inlinedAt: !551)
!617 = !DILocation(line: 119, column: 31, scope: !612, inlinedAt: !551)
!618 = !DILocation(line: 0, scope: !612, inlinedAt: !551)
!619 = !DILocation(line: 124, column: 1, scope: !537, inlinedAt: !551)
!620 = !DILocation(line: 129, column: 15, scope: !518)
!621 = !DILocation(line: 131, column: 7, scope: !518)
!622 = !DILocation(line: 132, column: 40, scope: !601)
!623 = !DILocation(line: 132, column: 35, scope: !601)
!624 = !DILocation(line: 132, column: 7, scope: !601)
!625 = !DILocation(line: 0, scope: !601)
!626 = !DILocation(line: 134, column: 3, scope: !518)
!627 = distinct !DISubprogram(name: "lua_setlocal", scope: !1, file: !1, line: 138, type: !519, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !639}
!629 = !DILocalVariable(name: "L", arg: 1, scope: !627, file: !1, line: 138, type: !179)
!630 = !DILocalVariable(name: "ar", arg: 2, scope: !627, file: !1, line: 138, type: !521)
!631 = !DILocalVariable(name: "n", arg: 3, scope: !627, file: !1, line: 138, type: !61)
!632 = !DILocalVariable(name: "ci", scope: !627, file: !1, line: 139, type: !269)
!633 = !DILocalVariable(name: "name", scope: !627, file: !1, line: 140, type: !307)
!634 = !DILocalVariable(name: "o2", scope: !635, file: !1, line: 143, type: !637)
!635 = distinct !DILexicalBlock(scope: !636, file: !1, line: 143, column: 7)
!636 = distinct !DILexicalBlock(scope: !627, file: !1, line: 142, column: 7)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!639 = !DILocalVariable(name: "o1", scope: !635, file: !1, line: 143, type: !122)
!640 = !DILocation(line: 138, column: 46, scope: !627)
!641 = !DILocation(line: 138, column: 66, scope: !627)
!642 = !DILocation(line: 138, column: 74, scope: !627)
!643 = !DILocation(line: 139, column: 21, scope: !627)
!644 = !DILocation(line: 139, column: 35, scope: !627)
!645 = !DILocation(line: 139, column: 29, scope: !627)
!646 = !DILocation(line: 139, column: 13, scope: !627)
!647 = !DILocation(line: 112, column: 42, scope: !537, inlinedAt: !648)
!648 = distinct !DILocation(line: 140, column: 22, scope: !627)
!649 = !DILocation(line: 112, column: 55, scope: !537, inlinedAt: !648)
!650 = !DILocation(line: 112, column: 63, scope: !537, inlinedAt: !648)
!651 = !DILocation(line: 107, column: 38, scope: !555, inlinedAt: !652)
!652 = distinct !DILocation(line: 114, column: 15, scope: !537, inlinedAt: !648)
!653 = !DILocation(line: 108, column: 11, scope: !555, inlinedAt: !652)
!654 = !DILocation(line: 108, column: 3, scope: !555, inlinedAt: !652)
!655 = !DILocation(line: 114, column: 10, scope: !537, inlinedAt: !648)
!656 = !DILocation(line: 115, column: 10, scope: !549, inlinedAt: !648)
!657 = !DILocation(line: 108, column: 38, scope: !555, inlinedAt: !652)
!658 = !DILocation(line: 115, column: 7, scope: !549, inlinedAt: !648)
!659 = !DILocation(line: 36, column: 34, scope: !569, inlinedAt: !660)
!660 = distinct !DILocation(line: 115, column: 46, scope: !549, inlinedAt: !648)
!661 = !DILocation(line: 36, column: 47, scope: !569, inlinedAt: !660)
!662 = !DILocation(line: 37, column: 8, scope: !578, inlinedAt: !660)
!663 = !DILocation(line: 37, column: 7, scope: !569, inlinedAt: !660)
!664 = !DILocation(line: 38, column: 16, scope: !581, inlinedAt: !660)
!665 = !DILocation(line: 38, column: 10, scope: !581, inlinedAt: !660)
!666 = !DILocation(line: 38, column: 7, scope: !569, inlinedAt: !660)
!667 = !DILocation(line: 40, column: 10, scope: !569, inlinedAt: !660)
!668 = !DILocation(line: 39, column: 22, scope: !581, inlinedAt: !660)
!669 = !DILocation(line: 39, column: 9, scope: !581, inlinedAt: !660)
!670 = !DILocation(line: 39, column: 17, scope: !581, inlinedAt: !660)
!671 = !DILocation(line: 39, column: 5, scope: !581, inlinedAt: !660)
!672 = !DILocation(line: 40, column: 3, scope: !569, inlinedAt: !660)
!673 = !DILocation(line: 41, column: 1, scope: !569, inlinedAt: !660)
!674 = !DILocation(line: 115, column: 21, scope: !549, inlinedAt: !648)
!675 = !DILocation(line: 113, column: 15, scope: !537, inlinedAt: !648)
!676 = !DILocation(line: 115, column: 65, scope: !549, inlinedAt: !648)
!677 = !DILocation(line: 115, column: 7, scope: !537, inlinedAt: !648)
!678 = !DILocation(line: 116, column: 5, scope: !549, inlinedAt: !648)
!679 = !DILocation(line: 143, column: 7, scope: !635)
!680 = !DILocation(line: 118, column: 29, scope: !548, inlinedAt: !648)
!681 = !DILocation(line: 118, column: 23, scope: !548, inlinedAt: !648)
!682 = !DILocation(line: 118, column: 19, scope: !548, inlinedAt: !648)
!683 = !DILocation(line: 118, column: 52, scope: !548, inlinedAt: !648)
!684 = !DILocation(line: 118, column: 38, scope: !548, inlinedAt: !648)
!685 = !DILocation(line: 0, scope: !627)
!686 = !DILocation(line: 118, column: 11, scope: !548, inlinedAt: !648)
!687 = !DILocation(line: 119, column: 21, scope: !612, inlinedAt: !648)
!688 = !DILocation(line: 119, column: 15, scope: !612, inlinedAt: !648)
!689 = !DILocation(line: 119, column: 29, scope: !612, inlinedAt: !648)
!690 = !DILocation(line: 119, column: 26, scope: !612, inlinedAt: !648)
!691 = !DILocation(line: 119, column: 36, scope: !612, inlinedAt: !648)
!692 = !DILocation(line: 119, column: 31, scope: !612, inlinedAt: !648)
!693 = !DILocation(line: 0, scope: !612, inlinedAt: !648)
!694 = !DILocation(line: 124, column: 1, scope: !537, inlinedAt: !648)
!695 = !DILocation(line: 140, column: 15, scope: !627)
!696 = !DILocation(line: 142, column: 7, scope: !627)
!697 = !DILocation(line: 144, column: 6, scope: !627)
!698 = !{!416, !417, i64 16}
!699 = !DILocation(line: 144, column: 9, scope: !627)
!700 = !DILocation(line: 146, column: 3, scope: !627)
!701 = distinct !DISubprogram(name: "lua_getinfo", scope: !1, file: !1, line: 232, type: !702, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !704)
!702 = !DISubroutineType(types: !703)
!703 = !{!61, !179, !307, !301}
!704 = !{!705, !706, !707, !708, !709, !712, !713, !716}
!705 = !DILocalVariable(name: "L", arg: 1, scope: !701, file: !1, line: 232, type: !179)
!706 = !DILocalVariable(name: "what", arg: 2, scope: !701, file: !1, line: 232, type: !307)
!707 = !DILocalVariable(name: "ar", arg: 3, scope: !701, file: !1, line: 232, type: !301)
!708 = !DILocalVariable(name: "status", scope: !701, file: !1, line: 233, type: !61)
!709 = !DILocalVariable(name: "f", scope: !701, file: !1, line: 234, type: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "Closure", file: !64, line: 312, baseType: !161)
!712 = !DILocalVariable(name: "ci", scope: !701, file: !1, line: 235, type: !269)
!713 = !DILocalVariable(name: "func", scope: !714, file: !1, line: 238, type: !188)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 237, column: 21)
!715 = distinct !DILexicalBlock(scope: !701, file: !1, line: 237, column: 7)
!716 = !DILocalVariable(name: "i_o", scope: !717, file: !1, line: 252, type: !122)
!717 = distinct !DILexicalBlock(scope: !718, file: !1, line: 252, column: 10)
!718 = distinct !DILexicalBlock(scope: !719, file: !1, line: 251, column: 9)
!719 = distinct !DILexicalBlock(scope: !720, file: !1, line: 250, column: 26)
!720 = distinct !DILexicalBlock(scope: !701, file: !1, line: 250, column: 7)
!721 = !DILocation(line: 232, column: 37, scope: !701)
!722 = !DILocation(line: 232, column: 52, scope: !701)
!723 = !DILocation(line: 232, column: 69, scope: !701)
!724 = !DILocation(line: 234, column: 12, scope: !701)
!725 = !DILocation(line: 235, column: 13, scope: !701)
!726 = !DILocation(line: 237, column: 7, scope: !715)
!727 = !DILocation(line: 237, column: 13, scope: !715)
!728 = !DILocation(line: 237, column: 7, scope: !701)
!729 = !DILocation(line: 238, column: 21, scope: !714)
!730 = !DILocation(line: 238, column: 11, scope: !714)
!731 = !DILocation(line: 240, column: 9, scope: !714)
!732 = !DILocation(line: 241, column: 9, scope: !714)
!733 = !DILocation(line: 242, column: 11, scope: !714)
!734 = !DILocation(line: 243, column: 3, scope: !714)
!735 = !DILocation(line: 244, column: 16, scope: !736)
!736 = distinct !DILexicalBlock(scope: !715, file: !1, line: 244, column: 12)
!737 = !DILocation(line: 244, column: 21, scope: !736)
!738 = !DILocation(line: 244, column: 12, scope: !715)
!739 = !DILocalVariable(name: "L", arg: 1, scope: !740, file: !1, line: 193, type: !179)
!740 = distinct !DISubprogram(name: "auxgetinfo", scope: !1, file: !1, line: 193, type: !741, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!61, !179, !307, !301, !710, !269}
!743 = !{!739, !744, !745, !746, !747, !748}
!744 = !DILocalVariable(name: "what", arg: 2, scope: !740, file: !1, line: 193, type: !307)
!745 = !DILocalVariable(name: "ar", arg: 3, scope: !740, file: !1, line: 193, type: !301)
!746 = !DILocalVariable(name: "f", arg: 4, scope: !740, file: !1, line: 194, type: !710)
!747 = !DILocalVariable(name: "ci", arg: 5, scope: !740, file: !1, line: 194, type: !269)
!748 = !DILocalVariable(name: "status", scope: !740, file: !1, line: 195, type: !61)
!749 = !DILocation(line: 193, column: 35, scope: !740, inlinedAt: !750)
!750 = distinct !DILocation(line: 249, column: 12, scope: !701)
!751 = !DILocation(line: 193, column: 50, scope: !740, inlinedAt: !750)
!752 = !DILocation(line: 193, column: 67, scope: !740, inlinedAt: !750)
!753 = !DILocation(line: 194, column: 30, scope: !740, inlinedAt: !750)
!754 = !DILocation(line: 194, column: 43, scope: !740, inlinedAt: !750)
!755 = !DILocation(line: 195, column: 7, scope: !740, inlinedAt: !750)
!756 = !DILocation(line: 196, column: 7, scope: !740, inlinedAt: !750)
!757 = !DILocation(line: 245, column: 13, scope: !758)
!758 = distinct !DILexicalBlock(scope: !736, file: !1, line: 244, column: 27)
!759 = !DILocation(line: 245, column: 21, scope: !758)
!760 = !DILocation(line: 247, column: 9, scope: !758)
!761 = !DILocation(line: 248, column: 3, scope: !758)
!762 = !DILocation(line: 0, scope: !701)
!763 = !DILocation(line: 0, scope: !714)
!764 = !DILocation(line: 196, column: 9, scope: !765, inlinedAt: !750)
!765 = distinct !DILexicalBlock(scope: !740, file: !1, line: 196, column: 7)
!766 = !DILocation(line: 200, column: 10, scope: !767, inlinedAt: !750)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 200, column: 3)
!768 = distinct !DILexicalBlock(scope: !740, file: !1, line: 200, column: 3)
!769 = !DILocation(line: 200, column: 3, scope: !768, inlinedAt: !750)
!770 = !DILocalVariable(name: "ar", arg: 1, scope: !771, file: !1, line: 167, type: !301)
!771 = distinct !DISubprogram(name: "info_tailcall", scope: !1, file: !1, line: 167, type: !772, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !301}
!774 = !{!770}
!775 = !DILocation(line: 167, column: 39, scope: !771, inlinedAt: !776)
!776 = distinct !DILocation(line: 197, column: 5, scope: !777, inlinedAt: !750)
!777 = distinct !DILexicalBlock(scope: !765, file: !1, line: 196, column: 18)
!778 = !DILocation(line: 168, column: 7, scope: !771, inlinedAt: !776)
!779 = !DILocation(line: 168, column: 12, scope: !771, inlinedAt: !776)
!780 = !DILocation(line: 169, column: 7, scope: !771, inlinedAt: !776)
!781 = !DILocation(line: 170, column: 47, scope: !771, inlinedAt: !776)
!782 = !DILocation(line: 170, column: 59, scope: !771, inlinedAt: !776)
!783 = !{!508, !420, i64 40}
!784 = !DILocation(line: 170, column: 29, scope: !771, inlinedAt: !776)
!785 = !DILocation(line: 170, column: 41, scope: !771, inlinedAt: !776)
!786 = !{!508, !420, i64 48}
!787 = !DILocation(line: 170, column: 7, scope: !771, inlinedAt: !776)
!788 = !DILocation(line: 170, column: 23, scope: !771, inlinedAt: !776)
!789 = !{!508, !420, i64 52}
!790 = !DILocation(line: 169, column: 12, scope: !771, inlinedAt: !776)
!791 = !DILocation(line: 172, column: 16, scope: !771, inlinedAt: !776)
!792 = !DILocation(line: 172, column: 3, scope: !771, inlinedAt: !776)
!793 = !DILocation(line: 173, column: 7, scope: !771, inlinedAt: !776)
!794 = !DILocation(line: 173, column: 12, scope: !771, inlinedAt: !776)
!795 = !{!508, !420, i64 44}
!796 = !DILocation(line: 174, column: 1, scope: !771, inlinedAt: !776)
!797 = !DILocation(line: 198, column: 5, scope: !777, inlinedAt: !750)
!798 = !DILocation(line: 201, column: 13, scope: !799, inlinedAt: !750)
!799 = distinct !DILexicalBlock(scope: !767, file: !1, line: 200, column: 25)
!800 = !DILocation(line: 201, column: 5, scope: !799, inlinedAt: !750)
!801 = !DILocalVariable(name: "ar", arg: 1, scope: !802, file: !1, line: 150, type: !301)
!802 = distinct !DISubprogram(name: "funcinfo", scope: !1, file: !1, line: 150, type: !803, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !301, !710}
!805 = !{!801, !806}
!806 = !DILocalVariable(name: "cl", arg: 2, scope: !802, file: !1, line: 150, type: !710)
!807 = !DILocation(line: 150, column: 34, scope: !802, inlinedAt: !808)
!808 = distinct !DILocation(line: 203, column: 9, scope: !809, inlinedAt: !750)
!809 = distinct !DILexicalBlock(scope: !810, file: !1, line: 202, column: 17)
!810 = distinct !DILexicalBlock(scope: !799, file: !1, line: 201, column: 20)
!811 = !DILocation(line: 150, column: 47, scope: !802, inlinedAt: !808)
!812 = !DILocation(line: 151, column: 13, scope: !813, inlinedAt: !808)
!813 = distinct !DILexicalBlock(scope: !802, file: !1, line: 151, column: 7)
!814 = !DILocation(line: 151, column: 7, scope: !813, inlinedAt: !808)
!815 = !DILocation(line: 151, column: 7, scope: !802, inlinedAt: !808)
!816 = !DILocation(line: 152, column: 16, scope: !817, inlinedAt: !808)
!817 = distinct !DILexicalBlock(scope: !813, file: !1, line: 151, column: 18)
!818 = !{!508, !417, i64 32}
!819 = !DILocation(line: 153, column: 21, scope: !817, inlinedAt: !808)
!820 = !DILocation(line: 156, column: 3, scope: !817, inlinedAt: !808)
!821 = !DILocation(line: 158, column: 18, scope: !822, inlinedAt: !808)
!822 = distinct !DILexicalBlock(scope: !813, file: !1, line: 157, column: 8)
!823 = !{!592, !417, i64 64}
!824 = !DILocation(line: 158, column: 16, scope: !822, inlinedAt: !808)
!825 = !DILocation(line: 159, column: 29, scope: !822, inlinedAt: !808)
!826 = !DILocation(line: 159, column: 32, scope: !822, inlinedAt: !808)
!827 = !{!592, !420, i64 96}
!828 = !DILocation(line: 159, column: 21, scope: !822, inlinedAt: !808)
!829 = !DILocation(line: 160, column: 33, scope: !822, inlinedAt: !808)
!830 = !DILocation(line: 160, column: 36, scope: !822, inlinedAt: !808)
!831 = !{!592, !420, i64 100}
!832 = !DILocation(line: 161, column: 33, scope: !822, inlinedAt: !808)
!833 = !DILocation(line: 161, column: 16, scope: !822, inlinedAt: !808)
!834 = !DILocation(line: 163, column: 35, scope: !802, inlinedAt: !808)
!835 = !DILocation(line: 160, column: 25, scope: !822, inlinedAt: !808)
!836 = !DILocation(line: 161, column: 14, scope: !822, inlinedAt: !808)
!837 = !DILocation(line: 163, column: 3, scope: !802, inlinedAt: !808)
!838 = !DILocation(line: 164, column: 1, scope: !802, inlinedAt: !808)
!839 = !DILocation(line: 204, column: 9, scope: !809, inlinedAt: !750)
!840 = !DILocation(line: 207, column: 27, scope: !841, inlinedAt: !750)
!841 = distinct !DILexicalBlock(scope: !810, file: !1, line: 206, column: 17)
!842 = !DILocalVariable(name: "L", arg: 1, scope: !843, file: !1, line: 44, type: !179)
!843 = distinct !DISubprogram(name: "currentline", scope: !1, file: !1, line: 44, type: !570, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !844)
!844 = !{!842, !845, !846}
!845 = !DILocalVariable(name: "ci", arg: 2, scope: !843, file: !1, line: 44, type: !269)
!846 = !DILocalVariable(name: "pc", scope: !843, file: !1, line: 45, type: !61)
!847 = !DILocation(line: 44, column: 36, scope: !843, inlinedAt: !848)
!848 = distinct !DILocation(line: 207, column: 34, scope: !841, inlinedAt: !750)
!849 = !DILocation(line: 44, column: 49, scope: !843, inlinedAt: !848)
!850 = !DILocation(line: 36, column: 34, scope: !569, inlinedAt: !851)
!851 = distinct !DILocation(line: 45, column: 12, scope: !843, inlinedAt: !848)
!852 = !DILocation(line: 36, column: 47, scope: !569, inlinedAt: !851)
!853 = !DILocation(line: 37, column: 8, scope: !578, inlinedAt: !851)
!854 = !DILocation(line: 37, column: 7, scope: !569, inlinedAt: !851)
!855 = !DILocation(line: 37, column: 19, scope: !578, inlinedAt: !851)
!856 = !DILocation(line: 41, column: 1, scope: !569, inlinedAt: !851)
!857 = !DILocation(line: 46, column: 7, scope: !843, inlinedAt: !848)
!858 = !DILocation(line: 38, column: 16, scope: !581, inlinedAt: !851)
!859 = !DILocation(line: 38, column: 10, scope: !581, inlinedAt: !851)
!860 = !DILocation(line: 38, column: 7, scope: !569, inlinedAt: !851)
!861 = !DILocation(line: 40, column: 10, scope: !569, inlinedAt: !851)
!862 = !DILocation(line: 39, column: 22, scope: !581, inlinedAt: !851)
!863 = !DILocation(line: 39, column: 17, scope: !581, inlinedAt: !851)
!864 = !DILocation(line: 39, column: 5, scope: !581, inlinedAt: !851)
!865 = !DILocation(line: 40, column: 3, scope: !569, inlinedAt: !851)
!866 = !DILocation(line: 45, column: 7, scope: !843, inlinedAt: !848)
!867 = !DILocation(line: 46, column: 10, scope: !868, inlinedAt: !848)
!868 = distinct !DILexicalBlock(scope: !843, file: !1, line: 46, column: 7)
!869 = !DILocation(line: 49, column: 12, scope: !868, inlinedAt: !848)
!870 = !{!592, !417, i64 40}
!871 = !{!420, !420, i64 0}
!872 = !DILocation(line: 0, scope: !868, inlinedAt: !848)
!873 = !DILocation(line: 0, scope: !841, inlinedAt: !750)
!874 = !DILocation(line: 50, column: 1, scope: !843, inlinedAt: !848)
!875 = !DILocation(line: 207, column: 25, scope: !841, inlinedAt: !750)
!876 = !DILocation(line: 208, column: 9, scope: !841, inlinedAt: !750)
!877 = !DILocation(line: 211, column: 25, scope: !878, inlinedAt: !750)
!878 = distinct !DILexicalBlock(scope: !810, file: !1, line: 210, column: 17)
!879 = !DILocation(line: 211, column: 20, scope: !878, inlinedAt: !750)
!880 = !DILocation(line: 211, column: 18, scope: !878, inlinedAt: !750)
!881 = !DILocation(line: 212, column: 9, scope: !878, inlinedAt: !750)
!882 = !DILocation(line: 215, column: 24, scope: !883, inlinedAt: !750)
!883 = distinct !DILexicalBlock(scope: !810, file: !1, line: 214, column: 17)
!884 = !DILocalVariable(name: "L", arg: 1, scope: !885, file: !1, line: 544, type: !179)
!885 = distinct !DISubprogram(name: "getfuncname", scope: !1, file: !1, line: 544, type: !886, isLocal: true, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !889)
!886 = !DISubroutineType(types: !887)
!887 = !{!307, !179, !269, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!889 = !{!884, !890, !891, !892}
!890 = !DILocalVariable(name: "ci", arg: 2, scope: !885, file: !1, line: 544, type: !269)
!891 = !DILocalVariable(name: "name", arg: 3, scope: !885, file: !1, line: 544, type: !888)
!892 = !DILocalVariable(name: "i", scope: !885, file: !1, line: 545, type: !279)
!893 = !DILocation(line: 544, column: 44, scope: !885, inlinedAt: !894)
!894 = distinct !DILocation(line: 215, column: 31, scope: !883, inlinedAt: !750)
!895 = !DILocation(line: 544, column: 57, scope: !885, inlinedAt: !894)
!896 = !DILocation(line: 544, column: 74, scope: !885, inlinedAt: !894)
!897 = !DILocation(line: 546, column: 8, scope: !898, inlinedAt: !894)
!898 = distinct !DILexicalBlock(scope: !885, file: !1, line: 546, column: 7)
!899 = !DILocation(line: 546, column: 18, scope: !898, inlinedAt: !894)
!900 = !DILocation(line: 546, column: 25, scope: !898, inlinedAt: !894)
!901 = !DILocation(line: 546, column: 35, scope: !898, inlinedAt: !894)
!902 = !DILocation(line: 546, column: 40, scope: !898, inlinedAt: !894)
!903 = !DILocation(line: 546, column: 44, scope: !898, inlinedAt: !894)
!904 = !DILocation(line: 546, column: 7, scope: !885, inlinedAt: !894)
!905 = !DILocation(line: 549, column: 22, scope: !885, inlinedAt: !894)
!906 = !DILocation(line: 549, column: 25, scope: !885, inlinedAt: !894)
!907 = !DILocation(line: 36, column: 34, scope: !569, inlinedAt: !908)
!908 = distinct !DILocation(line: 549, column: 30, scope: !885, inlinedAt: !894)
!909 = !DILocation(line: 36, column: 47, scope: !569, inlinedAt: !908)
!910 = !DILocation(line: 37, column: 8, scope: !578, inlinedAt: !908)
!911 = !DILocation(line: 37, column: 7, scope: !569, inlinedAt: !908)
!912 = !DILocation(line: 38, column: 16, scope: !581, inlinedAt: !908)
!913 = !DILocation(line: 38, column: 10, scope: !581, inlinedAt: !908)
!914 = !DILocation(line: 38, column: 7, scope: !569, inlinedAt: !908)
!915 = !DILocation(line: 40, column: 10, scope: !569, inlinedAt: !908)
!916 = !DILocation(line: 39, column: 22, scope: !581, inlinedAt: !908)
!917 = !DILocation(line: 39, column: 17, scope: !581, inlinedAt: !908)
!918 = !DILocation(line: 39, column: 5, scope: !581, inlinedAt: !908)
!919 = !DILocation(line: 40, column: 3, scope: !569, inlinedAt: !908)
!920 = !DILocation(line: 549, column: 7, scope: !885, inlinedAt: !894)
!921 = !DILocation(line: 41, column: 1, scope: !569, inlinedAt: !908)
!922 = !DILocation(line: 545, column: 15, scope: !885, inlinedAt: !894)
!923 = !DILocation(line: 550, column: 7, scope: !924, inlinedAt: !894)
!924 = distinct !DILexicalBlock(scope: !885, file: !1, line: 550, column: 7)
!925 = !DILocation(line: 550, column: 21, scope: !924, inlinedAt: !894)
!926 = !DILocation(line: 550, column: 32, scope: !924, inlinedAt: !894)
!927 = !DILocation(line: 550, column: 49, scope: !924, inlinedAt: !894)
!928 = !DILocation(line: 550, column: 64, scope: !924, inlinedAt: !894)
!929 = !DILocation(line: 551, column: 21, scope: !924, inlinedAt: !894)
!930 = !DILocation(line: 550, column: 7, scope: !885, inlinedAt: !894)
!931 = !DILocation(line: 0, scope: !883, inlinedAt: !750)
!932 = !DILocation(line: 555, column: 1, scope: !885, inlinedAt: !894)
!933 = !DILocation(line: 216, column: 13, scope: !883, inlinedAt: !750)
!934 = !DILocation(line: 552, column: 30, scope: !924, inlinedAt: !894)
!935 = !DILocation(line: 552, column: 12, scope: !924, inlinedAt: !894)
!936 = !DILocation(line: 552, column: 5, scope: !924, inlinedAt: !894)
!937 = !DILocation(line: 215, column: 22, scope: !883, inlinedAt: !750)
!938 = !{!508, !417, i64 16}
!939 = !DILocation(line: 216, column: 26, scope: !940, inlinedAt: !750)
!940 = distinct !DILexicalBlock(scope: !883, file: !1, line: 216, column: 13)
!941 = !DILocation(line: 217, column: 24, scope: !942, inlinedAt: !750)
!942 = distinct !DILexicalBlock(scope: !940, file: !1, line: 216, column: 35)
!943 = !DILocation(line: 218, column: 20, scope: !942, inlinedAt: !750)
!944 = !DILocation(line: 219, column: 9, scope: !942, inlinedAt: !750)
!945 = !DILocation(line: 226, column: 5, scope: !810, inlinedAt: !750)
!946 = !DILocation(line: 0, scope: !740, inlinedAt: !750)
!947 = !DILocation(line: 200, column: 21, scope: !767, inlinedAt: !750)
!948 = !DILocation(line: 200, column: 3, scope: !767, inlinedAt: !750)
!949 = distinct !{!949, !950, !951}
!950 = !DILocation(line: 200, column: 3, scope: !768)
!951 = !DILocation(line: 227, column: 3, scope: !768)
!952 = !DILocation(line: 229, column: 1, scope: !740, inlinedAt: !750)
!953 = !DILocation(line: 233, column: 7, scope: !701)
!954 = !DILocation(line: 250, column: 7, scope: !720)
!955 = !DILocation(line: 250, column: 7, scope: !701)
!956 = !DILocation(line: 251, column: 9, scope: !719)
!957 = !DILocation(line: 0, scope: !717)
!958 = !DILocation(line: 252, column: 10, scope: !717)
!959 = !DILocation(line: 253, column: 5, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !1, line: 253, column: 5)
!961 = distinct !DILexicalBlock(scope: !719, file: !1, line: 253, column: 5)
!962 = !{!416, !417, i64 56}
!963 = !DILocation(line: 253, column: 5, scope: !961)
!964 = !DILocation(line: 254, column: 3, scope: !719)
!965 = !DILocation(line: 255, column: 7, scope: !966)
!966 = distinct !DILexicalBlock(scope: !701, file: !1, line: 255, column: 7)
!967 = !DILocation(line: 255, column: 7, scope: !701)
!968 = !DILocalVariable(name: "L", arg: 1, scope: !969, file: !1, line: 177, type: !179)
!969 = distinct !DISubprogram(name: "collectvalidlines", scope: !1, file: !1, line: 177, type: !970, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !972)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !179, !710}
!972 = !{!968, !973, !974, !979, !980, !981, !985}
!973 = !DILocalVariable(name: "f", arg: 2, scope: !969, file: !1, line: 177, type: !710)
!974 = !DILocalVariable(name: "t", scope: !975, file: !1, line: 182, type: !977)
!975 = distinct !DILexicalBlock(scope: !976, file: !1, line: 181, column: 8)
!976 = distinct !DILexicalBlock(scope: !969, file: !1, line: 178, column: 7)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !64, line: 348, baseType: !113)
!979 = !DILocalVariable(name: "lineinfo", scope: !975, file: !1, line: 183, type: !359)
!980 = !DILocalVariable(name: "i", scope: !975, file: !1, line: 184, type: !61)
!981 = !DILocalVariable(name: "i_o", scope: !982, file: !1, line: 186, type: !122)
!982 = distinct !DILexicalBlock(scope: !983, file: !1, line: 186, column: 7)
!983 = distinct !DILexicalBlock(scope: !984, file: !1, line: 185, column: 5)
!984 = distinct !DILexicalBlock(scope: !975, file: !1, line: 185, column: 5)
!985 = !DILocalVariable(name: "i_o", scope: !986, file: !1, line: 187, type: !122)
!986 = distinct !DILexicalBlock(scope: !975, file: !1, line: 187, column: 5)
!987 = !DILocation(line: 177, column: 43, scope: !969, inlinedAt: !988)
!988 = distinct !DILocation(line: 256, column: 5, scope: !966)
!989 = !DILocation(line: 177, column: 55, scope: !969, inlinedAt: !988)
!990 = !DILocation(line: 178, column: 17, scope: !976, inlinedAt: !988)
!991 = !DILocation(line: 178, column: 25, scope: !976, inlinedAt: !988)
!992 = !DILocation(line: 178, column: 20, scope: !976, inlinedAt: !988)
!993 = !DILocation(line: 178, column: 7, scope: !969, inlinedAt: !988)
!994 = !DILocation(line: 179, column: 5, scope: !995, inlinedAt: !988)
!995 = distinct !DILexicalBlock(scope: !976, file: !1, line: 178, column: 30)
!996 = !DILocation(line: 180, column: 3, scope: !995, inlinedAt: !988)
!997 = !DILocation(line: 182, column: 16, scope: !975, inlinedAt: !988)
!998 = !DILocation(line: 182, column: 12, scope: !975, inlinedAt: !988)
!999 = !DILocation(line: 183, column: 26, scope: !975, inlinedAt: !988)
!1000 = !DILocation(line: 183, column: 29, scope: !975, inlinedAt: !988)
!1001 = !DILocation(line: 183, column: 10, scope: !975, inlinedAt: !988)
!1002 = !DILocation(line: 184, column: 9, scope: !975, inlinedAt: !988)
!1003 = !DILocation(line: 185, column: 10, scope: !984, inlinedAt: !988)
!1004 = !DILocation(line: 185, column: 25, scope: !983, inlinedAt: !988)
!1005 = !{!592, !420, i64 84}
!1006 = !DILocation(line: 185, column: 16, scope: !983, inlinedAt: !988)
!1007 = !DILocation(line: 185, column: 5, scope: !984, inlinedAt: !988)
!1008 = !DILocation(line: 186, column: 7, scope: !982, inlinedAt: !988)
!1009 = !DILocation(line: 185, column: 40, scope: !983, inlinedAt: !988)
!1010 = !DILocation(line: 185, column: 5, scope: !983, inlinedAt: !988)
!1011 = !DILocation(line: 185, column: 22, scope: !983, inlinedAt: !988)
!1012 = distinct !{!1012, !1013, !1014}
!1013 = !DILocation(line: 185, column: 5, scope: !984)
!1014 = !DILocation(line: 186, column: 7, scope: !984)
!1015 = !DILocation(line: 187, column: 5, scope: !986, inlinedAt: !988)
!1016 = !DILocation(line: 189, column: 3, scope: !1017, inlinedAt: !988)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !1, line: 189, column: 3)
!1018 = distinct !DILexicalBlock(scope: !969, file: !1, line: 189, column: 3)
!1019 = !DILocation(line: 189, column: 3, scope: !1018, inlinedAt: !988)
!1020 = !DILocation(line: 190, column: 1, scope: !969, inlinedAt: !988)
!1021 = !DILocation(line: 256, column: 5, scope: !966)
!1022 = !DILocation(line: 258, column: 3, scope: !701)
!1023 = distinct !DISubprogram(name: "luaG_checkopenop", scope: !1, file: !1, line: 290, type: !1024, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!61, !279}
!1026 = !{!1027}
!1027 = !DILocalVariable(name: "i", arg: 1, scope: !1023, file: !1, line: 290, type: !279)
!1028 = !DILocation(line: 290, column: 35, scope: !1023)
!1029 = !DILocation(line: 291, column: 3, scope: !1023)
!1030 = !DILocation(line: 296, column: 7, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 296, column: 7)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 295, column: 22)
!1033 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 291, column: 26)
!1034 = !DILocation(line: 296, column: 7, scope: !1032)
!1035 = !DILocation(line: 0, scope: !1031)
!1036 = !DILocation(line: 297, column: 7, scope: !1032)
!1037 = !DILocation(line: 299, column: 14, scope: !1033)
!1038 = !DILocation(line: 301, column: 1, scope: !1023)
!1039 = distinct !DISubprogram(name: "luaG_checkcode", scope: !1, file: !1, line: 484, type: !1040, isLocal: false, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1044)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!61, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!1044 = !{!1045}
!1045 = !DILocalVariable(name: "pt", arg: 1, scope: !1039, file: !1, line: 484, type: !1042)
!1046 = !DILocation(line: 484, column: 34, scope: !1039)
!1047 = !DILocation(line: 485, column: 28, scope: !1039)
!1048 = !{!592, !420, i64 80}
!1049 = !DILocation(line: 485, column: 11, scope: !1039)
!1050 = !DILocation(line: 485, column: 46, scope: !1039)
!1051 = !DILocation(line: 485, column: 3, scope: !1039)
!1052 = distinct !DISubprogram(name: "symbexec", scope: !1, file: !1, line: 317, type: !1053, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!279, !1042, !61, !61}
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1065, !1066, !1067, !1068, !1069, !1074, !1077, !1081, !1084, !1086, !1087}
!1056 = !DILocalVariable(name: "pt", arg: 1, scope: !1052, file: !1, line: 317, type: !1042)
!1057 = !DILocalVariable(name: "lastpc", arg: 2, scope: !1052, file: !1, line: 317, type: !61)
!1058 = !DILocalVariable(name: "reg", arg: 3, scope: !1052, file: !1, line: 317, type: !61)
!1059 = !DILocalVariable(name: "pc", scope: !1052, file: !1, line: 318, type: !61)
!1060 = !DILocalVariable(name: "last", scope: !1052, file: !1, line: 319, type: !61)
!1061 = !DILocalVariable(name: "i", scope: !1062, file: !1, line: 323, type: !279)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !1, line: 322, column: 35)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 322, column: 3)
!1064 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 322, column: 3)
!1065 = !DILocalVariable(name: "op", scope: !1062, file: !1, line: 324, type: !390)
!1066 = !DILocalVariable(name: "a", scope: !1062, file: !1, line: 325, type: !61)
!1067 = !DILocalVariable(name: "b", scope: !1062, file: !1, line: 326, type: !61)
!1068 = !DILocalVariable(name: "c", scope: !1062, file: !1, line: 327, type: !61)
!1069 = !DILocalVariable(name: "dest", scope: !1070, file: !1, line: 346, type: !61)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 345, column: 37)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 345, column: 13)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 343, column: 19)
!1073 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 330, column: 28)
!1074 = !DILocalVariable(name: "j", scope: !1075, file: !1, line: 349, type: !61)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !1, line: 348, column: 25)
!1076 = distinct !DILexicalBlock(scope: !1070, file: !1, line: 348, column: 15)
!1077 = !DILocalVariable(name: "d", scope: !1078, file: !1, line: 355, type: !279)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !1, line: 354, column: 40)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !1, line: 354, column: 13)
!1080 = distinct !DILexicalBlock(scope: !1075, file: !1, line: 354, column: 13)
!1081 = !DILocalVariable(name: "dest", scope: !1082, file: !1, line: 417, type: !61)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 416, column: 20)
!1083 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 373, column: 17)
!1084 = !DILocalVariable(name: "nup", scope: !1085, file: !1, line: 451, type: !61)
!1085 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 450, column: 24)
!1086 = !DILocalVariable(name: "j", scope: !1085, file: !1, line: 451, type: !61)
!1087 = !DILocalVariable(name: "op1", scope: !1088, file: !1, line: 456, type: !390)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !1, line: 455, column: 36)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !1, line: 455, column: 9)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !1, line: 455, column: 9)
!1091 = !DILocation(line: 317, column: 43, scope: !1052)
!1092 = !DILocation(line: 317, column: 51, scope: !1052)
!1093 = !DILocation(line: 317, column: 63, scope: !1052)
!1094 = !DILocation(line: 320, column: 14, scope: !1052)
!1095 = !DILocalVariable(name: "pt", arg: 1, scope: !1096, file: !1, line: 276, type: !1042)
!1096 = distinct !DISubprogram(name: "precheck", scope: !1, file: !1, line: 276, type: !1040, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1097)
!1097 = !{!1095}
!1098 = !DILocation(line: 276, column: 35, scope: !1096, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 321, column: 3, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 321, column: 3)
!1101 = !DILocation(line: 277, column: 3, scope: !1102, inlinedAt: !1099)
!1102 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 277, column: 3)
!1103 = !{!592, !418, i64 115}
!1104 = !DILocation(line: 277, column: 3, scope: !1096, inlinedAt: !1099)
!1105 = !DILocation(line: 278, column: 3, scope: !1106, inlinedAt: !1099)
!1106 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 278, column: 3)
!1107 = !{!592, !418, i64 113}
!1108 = !{!592, !418, i64 114}
!1109 = !DILocation(line: 278, column: 3, scope: !1096, inlinedAt: !1099)
!1110 = !DILocation(line: 279, column: 3, scope: !1111, inlinedAt: !1099)
!1111 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 279, column: 3)
!1112 = !DILocation(line: 279, column: 3, scope: !1096, inlinedAt: !1099)
!1113 = !DILocation(line: 281, column: 3, scope: !1114, inlinedAt: !1099)
!1114 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 281, column: 3)
!1115 = !{!592, !420, i64 72}
!1116 = !{!592, !418, i64 112}
!1117 = !DILocation(line: 281, column: 3, scope: !1096, inlinedAt: !1099)
!1118 = !DILocation(line: 282, column: 3, scope: !1119, inlinedAt: !1099)
!1119 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 282, column: 3)
!1120 = !DILocation(line: 282, column: 3, scope: !1096, inlinedAt: !1099)
!1121 = !DILocation(line: 283, column: 3, scope: !1122, inlinedAt: !1099)
!1122 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 283, column: 3)
!1123 = !DILocation(line: 283, column: 3, scope: !1096, inlinedAt: !1099)
!1124 = !DILocation(line: 0, scope: !1100)
!1125 = !DILocation(line: 285, column: 1, scope: !1096, inlinedAt: !1099)
!1126 = !DILocation(line: 321, column: 3, scope: !1052)
!1127 = !DILocation(line: 321, column: 3, scope: !1100)
!1128 = !DILocation(line: 284, column: 3, scope: !1096, inlinedAt: !1099)
!1129 = !DILocation(line: 319, column: 7, scope: !1052)
!1130 = !DILocation(line: 318, column: 7, scope: !1052)
!1131 = !DILocation(line: 322, column: 8, scope: !1064)
!1132 = !DILocation(line: 322, column: 19, scope: !1063)
!1133 = !DILocation(line: 322, column: 3, scope: !1064)
!1134 = !DILocation(line: 323, column: 21, scope: !1062)
!1135 = !DILocation(line: 323, column: 17, scope: !1062)
!1136 = !DILocation(line: 324, column: 17, scope: !1062)
!1137 = !DILocation(line: 324, column: 12, scope: !1062)
!1138 = !DILocation(line: 325, column: 13, scope: !1062)
!1139 = !DILocation(line: 325, column: 9, scope: !1062)
!1140 = !DILocation(line: 326, column: 9, scope: !1062)
!1141 = !DILocation(line: 327, column: 9, scope: !1062)
!1142 = !DILocation(line: 328, column: 5, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 328, column: 5)
!1144 = !DILocation(line: 328, column: 5, scope: !1062)
!1145 = !DILocation(line: 329, column: 5, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 329, column: 5)
!1147 = !DILocation(line: 329, column: 5, scope: !1062)
!1148 = !DILocation(line: 330, column: 13, scope: !1062)
!1149 = !DILocation(line: 330, column: 5, scope: !1062)
!1150 = !DILocation(line: 332, column: 13, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 331, column: 18)
!1152 = !DILocation(line: 333, column: 13, scope: !1151)
!1153 = !DILocalVariable(name: "pt", arg: 1, scope: !1154, file: !1, line: 304, type: !1042)
!1154 = distinct !DISubprogram(name: "checkArgMode", scope: !1, file: !1, line: 304, type: !1155, isLocal: true, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1157)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!61, !1042, !61, !50}
!1157 = !{!1153, !1158, !1159}
!1158 = !DILocalVariable(name: "r", arg: 2, scope: !1154, file: !1, line: 304, type: !61)
!1159 = !DILocalVariable(name: "mode", arg: 3, scope: !1154, file: !1, line: 304, type: !50)
!1160 = !DILocation(line: 304, column: 39, scope: !1154, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 334, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1151, file: !1, line: 334, column: 9)
!1163 = !DILocation(line: 304, column: 47, scope: !1154, inlinedAt: !1161)
!1164 = !DILocation(line: 304, column: 65, scope: !1154, inlinedAt: !1161)
!1165 = !DILocation(line: 305, column: 3, scope: !1154, inlinedAt: !1161)
!1166 = !DILocation(line: 306, column: 18, scope: !1167, inlinedAt: !1161)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 306, column: 18)
!1168 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 305, column: 17)
!1169 = !DILocation(line: 306, column: 18, scope: !1168, inlinedAt: !1161)
!1170 = !DILocation(line: 308, column: 18, scope: !1171, inlinedAt: !1161)
!1171 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 308, column: 18)
!1172 = !DILocation(line: 308, column: 18, scope: !1168, inlinedAt: !1161)
!1173 = !DILocation(line: 310, column: 7, scope: !1174, inlinedAt: !1161)
!1174 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 310, column: 7)
!1175 = !DILocation(line: 310, column: 7, scope: !1168, inlinedAt: !1161)
!1176 = !{!592, !420, i64 76}
!1177 = !DILocation(line: 0, scope: !1162)
!1178 = !DILocation(line: 314, column: 1, scope: !1154, inlinedAt: !1161)
!1179 = !DILocation(line: 334, column: 9, scope: !1151)
!1180 = !DILocation(line: 334, column: 9, scope: !1162)
!1181 = !DILocation(line: 313, column: 3, scope: !1154, inlinedAt: !1161)
!1182 = !DILocation(line: 335, column: 9, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1151, file: !1, line: 335, column: 9)
!1184 = !DILocation(line: 304, column: 39, scope: !1154, inlinedAt: !1185)
!1185 = distinct !DILocation(line: 335, column: 9, scope: !1183)
!1186 = !DILocation(line: 304, column: 47, scope: !1154, inlinedAt: !1185)
!1187 = !DILocation(line: 305, column: 3, scope: !1154, inlinedAt: !1185)
!1188 = !DILocation(line: 306, column: 18, scope: !1167, inlinedAt: !1185)
!1189 = !DILocation(line: 306, column: 18, scope: !1168, inlinedAt: !1185)
!1190 = !DILocation(line: 308, column: 18, scope: !1171, inlinedAt: !1185)
!1191 = !DILocation(line: 308, column: 18, scope: !1168, inlinedAt: !1185)
!1192 = !DILocation(line: 310, column: 7, scope: !1174, inlinedAt: !1185)
!1193 = !DILocation(line: 310, column: 7, scope: !1168, inlinedAt: !1185)
!1194 = !DILocation(line: 313, column: 3, scope: !1154, inlinedAt: !1185)
!1195 = !DILocation(line: 314, column: 1, scope: !1154, inlinedAt: !1185)
!1196 = !DILocation(line: 335, column: 9, scope: !1151)
!1197 = !DILocation(line: 0, scope: !1183)
!1198 = !DILocation(line: 339, column: 13, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 338, column: 18)
!1200 = !DILocation(line: 340, column: 13, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1199, file: !1, line: 340, column: 13)
!1202 = !DILocation(line: 340, column: 26, scope: !1201)
!1203 = !DILocation(line: 340, column: 13, scope: !1199)
!1204 = !DILocation(line: 340, column: 37, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1201, file: !1, line: 340, column: 37)
!1206 = !DILocation(line: 340, column: 37, scope: !1201)
!1207 = !DILocation(line: 344, column: 13, scope: !1072)
!1208 = !DILocation(line: 345, column: 13, scope: !1071)
!1209 = !DILocation(line: 345, column: 26, scope: !1071)
!1210 = !DILocation(line: 345, column: 13, scope: !1072)
!1211 = !DILocation(line: 346, column: 24, scope: !1070)
!1212 = !DILocation(line: 346, column: 26, scope: !1070)
!1213 = !DILocation(line: 346, column: 15, scope: !1070)
!1214 = !DILocation(line: 347, column: 11, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1070, file: !1, line: 347, column: 11)
!1216 = !DILocation(line: 347, column: 11, scope: !1070)
!1217 = !DILocation(line: 348, column: 20, scope: !1076)
!1218 = !DILocation(line: 348, column: 15, scope: !1070)
!1219 = !DILocation(line: 349, column: 17, scope: !1075)
!1220 = !DILocation(line: 354, column: 18, scope: !1080)
!1221 = !DILocation(line: 354, column: 13, scope: !1080)
!1222 = !DILocation(line: 355, column: 46, scope: !1078)
!1223 = !DILocation(line: 355, column: 31, scope: !1078)
