; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/ldtoa.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/ldtoa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "etens", scope: !2, file: !3, line: 2630, type: !47, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !13)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/ldtoa.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !8, !9, !7, !10, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = !{!14, !20, !25, !30, !0, !35, !40, !45, !50}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "nan113", scope: !2, file: !3, line: 3786, type: !16, isLocal: true, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !18)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!18 = !{!19}
!19 = !DISubrange(count: 8)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "nan64", scope: !2, file: !3, line: 3787, type: !22, isLocal: true, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 96, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 6)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "nan53", scope: !2, file: !3, line: 3788, type: !27, isLocal: true, isDefinition: true)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 4)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "nan24", scope: !2, file: !3, line: 3789, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "eone", scope: !2, file: !3, line: 119, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 10)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "bmask", scope: !2, file: !3, line: 3657, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 272, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 17)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "emtens", scope: !2, file: !3, line: 2659, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2080, elements: !48)
!48 = !{!49, !39}
!49 = !DISubrange(count: 13)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "ezero", scope: !2, file: !3, line: 114, type: !37, isLocal: true, isDefinition: true)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "_ldtoa_r", scope: !3, file: !3, line: 2780, type: !57, isLocal: false, isDefinition: true, scopeLine: 2782, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !329)
!57 = !DISubroutineType(types: !58)
!58 = !{!6, !59, !326, !8, !8, !327, !327, !328}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !61, line: 569, size: 14912, elements: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !{!63, !64, !140, !141, !142, !143, !147, !148, !210, !211, !215, !227, !228, !229, !231, !232, !233, !292, !311, !312, !317, !324}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !60, file: !61, line: 571, baseType: !8, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !60, file: !61, line: 576, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !61, line: 287, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !61, line: 181, size: 1408, elements: !68)
!68 = !{!69, !72, !73, !74, !76, !77, !82, !83, !85, !91, !97, !102, !106, !107, !108, !109, !113, !117, !118, !119, !121, !122, !126, !139}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !67, file: !61, line: 182, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !67, file: !61, line: 183, baseType: !8, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !67, file: !61, line: 184, baseType: !8, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !61, line: 185, baseType: !75, size: 16, offset: 128)
!75 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !67, file: !61, line: 186, baseType: !75, size: 16, offset: 144)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !67, file: !61, line: 187, baseType: !78, size: 128, offset: 192)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !61, line: 117, size: 128, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !78, file: !61, line: 118, baseType: !70, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !78, file: !61, line: 119, baseType: !8, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !67, file: !61, line: 188, baseType: !8, size: 32, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !67, file: !61, line: 195, baseType: !84, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !67, file: !61, line: 197, baseType: !86, size: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !59, !84, !6, !8}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !90, line: 145, baseType: !12)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !67, file: !61, line: 199, baseType: !92, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!89, !59, !84, !95, !8}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !67, file: !61, line: 202, baseType: !98, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !59, !84, !101, !8}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !90, line: 114, baseType: !12)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !67, file: !61, line: 203, baseType: !103, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!8, !59, !84}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !67, file: !61, line: 206, baseType: !78, size: 128, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !67, file: !61, line: 207, baseType: !70, size: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !67, file: !61, line: 208, baseType: !8, size: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !67, file: !61, line: 211, baseType: !110, size: 24, offset: 928)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 24, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 3)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !67, file: !61, line: 212, baseType: !114, size: 8, offset: 952)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !67, file: !61, line: 215, baseType: !78, size: 128, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !67, file: !61, line: 218, baseType: !8, size: 32, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !61, line: 219, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !90, line: 44, baseType: !12)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !67, file: !61, line: 222, baseType: !59, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !61, line: 226, baseType: !123, size: 32, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !90, line: 175, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !125, line: 12, baseType: !8)
!125 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !67, file: !61, line: 228, baseType: !127, size: 64, offset: 1312)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !90, line: 171, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 163, size: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !128, file: !90, line: 165, baseType: !8, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !128, file: !90, line: 170, baseType: !132, size: 32, offset: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !90, line: 166, size: 32, elements: !133)
!133 = !{!134, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !132, file: !90, line: 168, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !136, line: 124, baseType: !9)
!136 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !132, file: !90, line: 169, baseType: !138, size: 32)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 32, elements: !28)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !61, line: 229, baseType: !8, size: 32, offset: 1376)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !60, file: !61, line: 576, baseType: !65, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !60, file: !61, line: 576, baseType: !65, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !60, file: !61, line: 578, baseType: !8, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !60, file: !61, line: 579, baseType: !144, size: 200, offset: 288)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 200, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 25)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !60, file: !61, line: 582, baseType: !8, size: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !60, file: !61, line: 583, baseType: !149, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !151, line: 178, size: 3392, elements: !152)
!151 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!152 = !{!153, !158, !166, !174, !175, !176, !204, !206, !209}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !150, file: !151, line: 180, baseType: !154, size: 1792)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1792, elements: !155)
!155 = !{!156, !157}
!156 = !DISubrange(count: 7)
!157 = !DISubrange(count: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !150, file: !151, line: 181, baseType: !159, size: 64, offset: 1792)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!8, !59, !6, !162, !163}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !136, line: 83, baseType: !8)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !165, line: 86, baseType: !127)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !150, file: !151, line: 183, baseType: !167, size: 64, offset: 1856)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!8, !59, !170, !95, !171, !163}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !172, line: 40, baseType: !173)
!172 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !90, line: 129, baseType: !10)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !150, file: !151, line: 185, baseType: !8, size: 32, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !150, file: !151, line: 186, baseType: !6, size: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !150, file: !151, line: 187, baseType: !177, size: 768, offset: 2048)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !178, line: 42, size: 768, elements: !179)
!178 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !177, file: !178, line: 44, baseType: !6, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !177, file: !178, line: 45, baseType: !6, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !177, file: !178, line: 46, baseType: !6, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !177, file: !178, line: 47, baseType: !6, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !177, file: !178, line: 48, baseType: !6, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !177, file: !178, line: 49, baseType: !6, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !177, file: !178, line: 50, baseType: !6, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !177, file: !178, line: 51, baseType: !6, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !177, file: !178, line: 52, baseType: !6, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !177, file: !178, line: 53, baseType: !6, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !177, file: !178, line: 54, baseType: !7, size: 8, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !177, file: !178, line: 55, baseType: !7, size: 8, offset: 648)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !177, file: !178, line: 56, baseType: !7, size: 8, offset: 656)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !177, file: !178, line: 57, baseType: !7, size: 8, offset: 664)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !177, file: !178, line: 58, baseType: !7, size: 8, offset: 672)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !177, file: !178, line: 59, baseType: !7, size: 8, offset: 680)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !177, file: !178, line: 60, baseType: !7, size: 8, offset: 688)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !177, file: !178, line: 61, baseType: !7, size: 8, offset: 696)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !177, file: !178, line: 62, baseType: !7, size: 8, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !177, file: !178, line: 63, baseType: !7, size: 8, offset: 712)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !177, file: !178, line: 64, baseType: !7, size: 8, offset: 720)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !177, file: !178, line: 65, baseType: !7, size: 8, offset: 728)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !177, file: !178, line: 66, baseType: !7, size: 8, offset: 736)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !177, file: !178, line: 67, baseType: !7, size: 8, offset: 744)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !150, file: !151, line: 189, baseType: !205, size: 16, offset: 2816)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !33)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !150, file: !151, line: 190, baseType: !207, size: 256, offset: 2832)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !208)
!208 = !{!157}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !150, file: !151, line: 191, baseType: !207, size: 256, offset: 3088)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !60, file: !61, line: 585, baseType: !8, size: 32, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !60, file: !61, line: 587, baseType: !212, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !59}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !60, file: !61, line: 590, baseType: !216, size: 64, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !61, line: 47, size: 256, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !217, file: !61, line: 49, baseType: !216, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !217, file: !61, line: 50, baseType: !8, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !217, file: !61, line: 50, baseType: !8, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !217, file: !61, line: 50, baseType: !8, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !217, file: !61, line: 50, baseType: !8, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !217, file: !61, line: 51, baseType: !225, size: 32, offset: 192)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32, elements: !115)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !61, line: 25, baseType: !9)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !60, file: !61, line: 591, baseType: !8, size: 32, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !60, file: !61, line: 592, baseType: !216, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !60, file: !61, line: 593, baseType: !230, size: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !60, file: !61, line: 596, baseType: !8, size: 32, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !60, file: !61, line: 597, baseType: !6, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !60, file: !61, line: 632, baseType: !234, size: 2880, offset: 1152)
!234 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !61, line: 599, size: 2880, elements: !235)
!235 = !{!236, !283}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !234, file: !61, line: 622, baseType: !237, size: 1728)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !234, file: !61, line: 601, size: 1728, elements: !238)
!238 = !{!239, !240, !241, !245, !257, !258, !260, !267, !268, !269, !270, !272, !276, !277, !278, !279, !280, !281, !282}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !237, file: !61, line: 603, baseType: !9, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !237, file: !61, line: 604, baseType: !6, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !237, file: !61, line: 605, baseType: !242, size: 208, offset: 128)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 208, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 26)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !237, file: !61, line: 606, baseType: !246, size: 288, offset: 352)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !61, line: 55, size: 288, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !246, file: !61, line: 57, baseType: !8, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !246, file: !61, line: 58, baseType: !8, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !246, file: !61, line: 59, baseType: !8, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !246, file: !61, line: 60, baseType: !8, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !246, file: !61, line: 61, baseType: !8, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !246, file: !61, line: 62, baseType: !8, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !246, file: !61, line: 63, baseType: !8, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !246, file: !61, line: 64, baseType: !8, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !246, file: !61, line: 65, baseType: !8, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !237, file: !61, line: 607, baseType: !8, size: 32, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !237, file: !61, line: 608, baseType: !259, size: 64, offset: 704)
!259 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !237, file: !61, line: 609, baseType: !261, size: 112, offset: 768)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !61, line: 319, size: 112, elements: !262)
!262 = !{!263, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !261, file: !61, line: 320, baseType: !264, size: 48)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 48, elements: !111)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !261, file: !61, line: 321, baseType: !264, size: 48, offset: 48)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !261, file: !61, line: 322, baseType: !11, size: 16, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !237, file: !61, line: 610, baseType: !127, size: 64, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !237, file: !61, line: 611, baseType: !127, size: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !237, file: !61, line: 612, baseType: !127, size: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !237, file: !61, line: 613, baseType: !271, size: 64, offset: 1088)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !18)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !237, file: !61, line: 614, baseType: !273, size: 192, offset: 1152)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 24)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !237, file: !61, line: 615, baseType: !8, size: 32, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !237, file: !61, line: 616, baseType: !127, size: 64, offset: 1376)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !237, file: !61, line: 617, baseType: !127, size: 64, offset: 1440)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !237, file: !61, line: 618, baseType: !127, size: 64, offset: 1504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !237, file: !61, line: 619, baseType: !127, size: 64, offset: 1568)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !237, file: !61, line: 620, baseType: !127, size: 64, offset: 1632)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !237, file: !61, line: 621, baseType: !8, size: 32, offset: 1696)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !234, file: !61, line: 631, baseType: !284, size: 2880)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !234, file: !61, line: 626, size: 2880, elements: !285)
!285 = !{!286, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !284, file: !61, line: 629, baseType: !287, size: 1920)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1920, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 30)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !284, file: !61, line: 630, baseType: !291, size: 960, offset: 1920)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 960, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !60, file: !61, line: 636, baseType: !293, size: 64, offset: 4032)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !61, line: 93, size: 6336, elements: !295)
!295 = !{!296, !297, !298, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !294, file: !61, line: 94, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !294, file: !61, line: 95, baseType: !8, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !294, file: !61, line: 97, baseType: !299, size: 2048, offset: 128)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 2048, elements: !208)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !294, file: !61, line: 98, baseType: !304, size: 4160, offset: 2176)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !61, line: 74, size: 4160, elements: !305)
!305 = !{!306, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !304, file: !61, line: 75, baseType: !307, size: 2048)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !208)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !304, file: !61, line: 76, baseType: !307, size: 2048, offset: 2048)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !304, file: !61, line: 78, baseType: !226, size: 32, offset: 4096)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !304, file: !61, line: 81, baseType: !226, size: 32, offset: 4128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !60, file: !61, line: 637, baseType: !294, size: 6336, offset: 4096)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !60, file: !61, line: 641, baseType: !313, size: 64, offset: 10432)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !8}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !60, file: !61, line: 646, baseType: !318, size: 192, offset: 10496)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !61, line: 291, size: 192, elements: !319)
!319 = !{!320, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !318, file: !61, line: 293, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !318, file: !61, line: 294, baseType: !8, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !318, file: !61, line: 295, baseType: !65, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !60, file: !61, line: 648, baseType: !325, size: 4224, offset: 10688)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 4224, elements: !111)
!326 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !340, !341, !342, !343, !344, !345, !346, !360, !362, !363, !367}
!330 = !DILocalVariable(name: "ptr", arg: 1, scope: !56, file: !3, line: 2780, type: !59)
!331 = !DILocalVariable(name: "d", arg: 2, scope: !56, file: !3, line: 2780, type: !326)
!332 = !DILocalVariable(name: "mode", arg: 3, scope: !56, file: !3, line: 2780, type: !8)
!333 = !DILocalVariable(name: "ndigits", arg: 4, scope: !56, file: !3, line: 2780, type: !8)
!334 = !DILocalVariable(name: "decpt", arg: 5, scope: !56, file: !3, line: 2781, type: !327)
!335 = !DILocalVariable(name: "sign", arg: 6, scope: !56, file: !3, line: 2781, type: !327)
!336 = !DILocalVariable(name: "rve", arg: 7, scope: !56, file: !3, line: 2781, type: !328)
!337 = !DILocalVariable(name: "e", scope: !56, file: !3, line: 2783, type: !338)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 208, elements: !339)
!339 = !{!49}
!340 = !DILocalVariable(name: "s", scope: !56, file: !3, line: 2784, type: !6)
!341 = !DILocalVariable(name: "p", scope: !56, file: !3, line: 2784, type: !6)
!342 = !DILocalVariable(name: "i", scope: !56, file: !3, line: 2785, type: !8)
!343 = !DILocalVariable(name: "j", scope: !56, file: !3, line: 2785, type: !8)
!344 = !DILocalVariable(name: "k", scope: !56, file: !3, line: 2785, type: !8)
!345 = !DILocalVariable(name: "orig_ndigits", scope: !56, file: !3, line: 2786, type: !8)
!346 = !DILocalVariable(name: "rnd", scope: !56, file: !3, line: 2787, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "LDPARMS", file: !3, line: 62, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 50, size: 640, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rlast", scope: !348, file: !3, line: 52, baseType: !8, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rndprc", scope: !348, file: !3, line: 53, baseType: !8, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rw", scope: !348, file: !3, line: 54, baseType: !8, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !348, file: !3, line: 55, baseType: !8, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "outexpon", scope: !348, file: !3, line: 56, baseType: !8, size: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rmsk", scope: !348, file: !3, line: 57, baseType: !11, size: 16, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rmbit", scope: !348, file: !3, line: 58, baseType: !11, size: 16, offset: 176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rebit", scope: !348, file: !3, line: 59, baseType: !11, size: 16, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rbit", scope: !348, file: !3, line: 60, baseType: !338, size: 208, offset: 208)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "equot", scope: !348, file: !3, line: 61, baseType: !338, size: 208, offset: 416)
!360 = !DILocalVariable(name: "ldp", scope: !56, file: !3, line: 2788, type: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!362 = !DILocalVariable(name: "outstr", scope: !56, file: !3, line: 2789, type: !6)
!363 = !DILocalVariable(name: "outbuf", scope: !56, file: !3, line: 2790, type: !364)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 456, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 57)
!367 = !DILocalVariable(name: "du", scope: !56, file: !3, line: 2791, type: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "uconv", file: !3, line: 89, size: 128, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !368, file: !3, line: 91, baseType: !11, size: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !368, file: !3, line: 92, baseType: !326, size: 128)
!372 = !DILocalVariable(name: "ai", scope: !373, file: !3, line: 1458, type: !338)
!373 = distinct !DISubprogram(name: "eadd1", scope: !3, file: !3, line: 1455, type: !374, isLocal: true, isDefinition: true, scopeLine: 1457, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !378)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !376, !376, !377, !8, !361}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!378 = !{!379, !380, !381, !382, !383, !372, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!379 = !DILocalVariable(name: "a", arg: 1, scope: !373, file: !3, line: 1455, type: !376)
!380 = !DILocalVariable(name: "b", arg: 2, scope: !373, file: !3, line: 1455, type: !376)
!381 = !DILocalVariable(name: "c", arg: 3, scope: !373, file: !3, line: 1456, type: !377)
!382 = !DILocalVariable(name: "subflg", arg: 4, scope: !373, file: !3, line: 1456, type: !8)
!383 = !DILocalVariable(name: "ldp", arg: 5, scope: !373, file: !3, line: 1456, type: !361)
!384 = !DILocalVariable(name: "bi", scope: !373, file: !3, line: 1458, type: !338)
!385 = !DILocalVariable(name: "ci", scope: !373, file: !3, line: 1458, type: !338)
!386 = !DILocalVariable(name: "i", scope: !373, file: !3, line: 1459, type: !8)
!387 = !DILocalVariable(name: "lost", scope: !373, file: !3, line: 1459, type: !8)
!388 = !DILocalVariable(name: "j", scope: !373, file: !3, line: 1459, type: !8)
!389 = !DILocalVariable(name: "k", scope: !373, file: !3, line: 1459, type: !8)
!390 = !DILocalVariable(name: "lt", scope: !373, file: !3, line: 1460, type: !12)
!391 = !DILocalVariable(name: "lta", scope: !373, file: !3, line: 1460, type: !12)
!392 = !DILocalVariable(name: "ltb", scope: !373, file: !3, line: 1460, type: !12)
!393 = !DILocation(line: 1458, column: 18, scope: !373, inlinedAt: !394)
!394 = distinct !DILocation(line: 1449, column: 3, scope: !395, inlinedAt: !403)
!395 = distinct !DISubprogram(name: "esub", scope: !3, file: !3, line: 1424, type: !396, isLocal: true, isDefinition: true, scopeLine: 1426, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !376, !376, !377, !361}
!398 = !{!399, !400, !401, !402}
!399 = !DILocalVariable(name: "a", arg: 1, scope: !395, file: !3, line: 1424, type: !376)
!400 = !DILocalVariable(name: "b", arg: 2, scope: !395, file: !3, line: 1424, type: !376)
!401 = !DILocalVariable(name: "c", arg: 3, scope: !395, file: !3, line: 1425, type: !377)
!402 = !DILocalVariable(name: "ldp", arg: 4, scope: !395, file: !3, line: 1425, type: !361)
!403 = distinct !DILocation(line: 3715, column: 8, scope: !404, inlinedAt: !424)
!404 = distinct !DILexicalBlock(scope: !405, file: !3, line: 3714, column: 6)
!405 = distinct !DILexicalBlock(scope: !406, file: !3, line: 3713, column: 8)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 3712, column: 2)
