; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lfunc.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lfunc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.Closure = type { %struct.CClosure }
%struct.CClosure = type { %union.GCObject*, i8, i8, i8, i8, %union.GCObject*, %struct.Table*, i32 (%struct.lua_State*)*, [1 x %struct.lua_TValue] }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, {}*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lfunc.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !39, !90, !14, !25, !336, !337, !288}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Closure", file: !6, line: 312, baseType: !7)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!7 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !6, line: 309, size: 448, elements: !8)
!8 = !{!9, !322}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !7, file: !6, line: 310, baseType: !10, size: 448)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !6, line: 299, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !6, line: 295, size: 448, elements: !12)
!12 = !{!13, !311, !312, !313, !314, !315, !316, !317, !318}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !6, line: 296, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !6, line: 36, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !17, line: 136, size: 1472, elements: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !{!19, !29, !55, !115, !116, !117, !158, !175}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !16, file: !17, line: 137, baseType: !20, size: 128)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !6, line: 51, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !6, line: 49, size: 128, elements: !22)
!22 = !{!23, !24, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !6, line: 50, baseType: !14, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !21, file: !6, line: 50, baseType: !25, size: 8, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !26, line: 27, baseType: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !21, file: !6, line: 50, baseType: !25, size: 8, offset: 72)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !16, file: !17, line: 138, baseType: !30, size: 192)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !6, line: 199, size: 192, elements: !31)
!31 = !{!32, !42}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !30, file: !6, line: 200, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !26, line: 47, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 47, size: 64, elements: !35)
!35 = !{!36, !38, !40}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !34, file: !26, line: 47, baseType: !37, size: 64)
!37 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !34, file: !26, line: 47, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !34, file: !26, line: 47, baseType: !41, size: 64)
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !30, file: !6, line: 206, baseType: !43, size: 192)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !30, file: !6, line: 201, size: 192, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !6, line: 202, baseType: !14, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !43, file: !6, line: 202, baseType: !25, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !43, file: !6, line: 202, baseType: !25, size: 8, offset: 72)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !43, file: !6, line: 203, baseType: !25, size: 8, offset: 80)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !43, file: !6, line: 204, baseType: !50, size: 32, offset: 96)
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !6, line: 205, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 58, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !16, file: !17, line: 139, baseType: !56, size: 320)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !6, line: 215, size: 320, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !56, file: !6, line: 216, baseType: !33, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !56, file: !6, line: 222, baseType: !60, size: 320)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !6, line: 217, size: 320, elements: !61)
!61 = !{!62, !63, !64, !65, !113, !114}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !6, line: 218, baseType: !14, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !60, file: !6, line: 218, baseType: !25, size: 8, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !60, file: !6, line: 218, baseType: !25, size: 8, offset: 72)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !60, file: !6, line: 219, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !6, line: 338, size: 512, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !92, !110, !111, !112}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !6, line: 339, baseType: !14, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !67, file: !6, line: 339, baseType: !25, size: 8, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !67, file: !6, line: 339, baseType: !25, size: 8, offset: 72)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !6, line: 340, baseType: !25, size: 8, offset: 80)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !67, file: !6, line: 341, baseType: !25, size: 8, offset: 88)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !67, file: !6, line: 342, baseType: !66, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !67, file: !6, line: 343, baseType: !76, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !6, line: 75, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !6, line: 73, size: 128, elements: !79)
!79 = !{!80, !91}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !6, line: 74, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !6, line: 64, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !6, line: 59, size: 64, elements: !83)
!83 = !{!84, !85, !86, !89}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !82, file: !6, line: 60, baseType: !14, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !82, file: !6, line: 61, baseType: !39, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !82, file: !6, line: 62, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !88, line: 99, baseType: !37)
!88 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !82, file: !6, line: 63, baseType: !90, size: 32)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !78, file: !6, line: 74, baseType: !90, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !67, file: !6, line: 344, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !6, line: 335, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !6, line: 332, size: 320, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !95, file: !6, line: 333, baseType: !77, size: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !95, file: !6, line: 334, baseType: !99, size: 192, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !6, line: 329, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !6, line: 323, size: 192, elements: !101)
!101 = !{!102, !109}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !100, file: !6, line: 327, baseType: !103, size: 192)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !6, line: 324, size: 192, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !103, file: !6, line: 325, baseType: !81, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !103, file: !6, line: 325, baseType: !90, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !6, line: 326, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !100, file: !6, line: 328, baseType: !77, size: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !67, file: !6, line: 345, baseType: !93, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !67, file: !6, line: 346, baseType: !14, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !67, file: !6, line: 347, baseType: !90, size: 32, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !60, file: !6, line: 220, baseType: !66, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, file: !6, line: 221, baseType: !52, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !16, file: !17, line: 140, baseType: !7, size: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !16, file: !17, line: 141, baseType: !67, size: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !16, file: !17, line: 142, baseType: !118, size: 960)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !6, line: 231, size: 960, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !128, !131, !133, !142, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !6, line: 232, baseType: !14, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !118, file: !6, line: 232, baseType: !25, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !118, file: !6, line: 232, baseType: !25, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !118, file: !6, line: 233, baseType: !76, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !118, file: !6, line: 234, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !26, line: 88, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !26, line: 18, baseType: !50)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !118, file: !6, line: 235, baseType: !129, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !118, file: !6, line: 236, baseType: !132, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !118, file: !6, line: 237, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !6, line: 262, size: 128, elements: !136)
!136 = !{!137, !140, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !135, file: !6, line: 263, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !6, line: 207, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !135, file: !6, line: 264, baseType: !90, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !135, file: !6, line: 265, baseType: !90, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !118, file: !6, line: 238, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !118, file: !6, line: 239, baseType: !138, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !118, file: !6, line: 240, baseType: !90, size: 32, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !118, file: !6, line: 241, baseType: !90, size: 32, offset: 608)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !118, file: !6, line: 242, baseType: !90, size: 32, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !118, file: !6, line: 243, baseType: !90, size: 32, offset: 672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !118, file: !6, line: 244, baseType: !90, size: 32, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !118, file: !6, line: 245, baseType: !90, size: 32, offset: 736)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !118, file: !6, line: 246, baseType: !90, size: 32, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !118, file: !6, line: 247, baseType: !90, size: 32, offset: 800)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !118, file: !6, line: 248, baseType: !14, size: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !118, file: !6, line: 249, baseType: !25, size: 8, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !118, file: !6, line: 250, baseType: !25, size: 8, offset: 904)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !118, file: !6, line: 251, baseType: !25, size: 8, offset: 912)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !118, file: !6, line: 252, baseType: !25, size: 8, offset: 920)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !16, file: !17, line: 143, baseType: !159, size: 320)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !6, line: 274, size: 320, elements: !160)
!160 = !{!161, !162, !163, !164, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !6, line: 275, baseType: !14, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !159, file: !6, line: 275, baseType: !25, size: 8, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !159, file: !6, line: 275, baseType: !25, size: 8, offset: 72)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !159, file: !6, line: 276, baseType: !76, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !159, file: !6, line: 283, baseType: !166, size: 128, offset: 192)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !6, line: 277, size: 128, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !166, file: !6, line: 278, baseType: !77, size: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !166, file: !6, line: 282, baseType: !170, size: 128)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !6, line: 279, size: 128, elements: !171)
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !6, line: 280, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !6, line: 281, baseType: !173, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !16, file: !17, line: 144, baseType: !176, size: 1472)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !17, line: 100, size: 1472, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !184, !185, !250, !263, !264, !265, !266, !267, !268, !269, !270, !272, !273, !274, !275, !276, !277, !302, !303, !304, !305, !306, !309}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !17, line: 101, baseType: !14, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !176, file: !17, line: 101, baseType: !25, size: 8, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !176, file: !17, line: 101, baseType: !25, size: 8, offset: 72)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !176, file: !17, line: 102, baseType: !25, size: 8, offset: 80)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !176, file: !17, line: 103, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !6, line: 193, baseType: !76)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !176, file: !17, line: 104, baseType: !183, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !176, file: !17, line: 105, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !17, line: 94, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !17, line: 68, size: 3456, elements: !189)
!189 = !{!190, !198, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !223, !225, !226, !227, !228, !229, !230, !237, !238, !240, !242, !246}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !188, file: !17, line: 69, baseType: !191, size: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !17, line: 42, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !17, line: 38, size: 128, elements: !193)
!193 = !{!194, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !192, file: !17, line: 39, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !192, file: !17, line: 40, baseType: !127, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !192, file: !17, line: 41, baseType: !90, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !188, file: !17, line: 70, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !88, line: 66, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!39, !39, !39, !52, !52}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !188, file: !17, line: 71, baseType: !39, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !188, file: !17, line: 72, baseType: !25, size: 8, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !188, file: !17, line: 73, baseType: !25, size: 8, offset: 264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !188, file: !17, line: 74, baseType: !90, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !188, file: !17, line: 75, baseType: !14, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !188, file: !17, line: 76, baseType: !195, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !188, file: !17, line: 77, baseType: !14, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !188, file: !17, line: 78, baseType: !14, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !188, file: !17, line: 79, baseType: !14, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !188, file: !17, line: 80, baseType: !14, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !188, file: !17, line: 81, baseType: !214, size: 192, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !215, line: 28, baseType: !216)
!215 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !215, line: 24, size: 192, elements: !217)
!217 = !{!218, !221, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !216, file: !215, line: 25, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !216, file: !215, line: 26, baseType: !52, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !216, file: !215, line: 27, baseType: !52, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !188, file: !17, line: 82, baseType: !224, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !26, line: 20, baseType: !52)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !188, file: !17, line: 83, baseType: !224, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !188, file: !17, line: 84, baseType: !224, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !188, file: !17, line: 85, baseType: !224, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !188, file: !17, line: 86, baseType: !90, size: 32, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !188, file: !17, line: 87, baseType: !90, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !188, file: !17, line: 88, baseType: !231, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !88, line: 52, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!90, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !88, line: 50, baseType: !176)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !188, file: !17, line: 89, baseType: !77, size: 128, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !188, file: !17, line: 90, baseType: !239, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !188, file: !17, line: 91, baseType: !241, size: 320, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !6, line: 284, baseType: !159)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !188, file: !17, line: 92, baseType: !243, size: 576, offset: 1792)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 576, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 9)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !188, file: !17, line: 93, baseType: !247, size: 1088, offset: 2368)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1088, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 17)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !176, file: !17, line: 106, baseType: !251, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !17, line: 55, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !17, line: 48, size: 320, elements: !254)
!254 = !{!255, !256, !257, !258, !261, !262}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !253, file: !17, line: 49, baseType: !183, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !253, file: !17, line: 50, baseType: !183, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !253, file: !17, line: 51, baseType: !183, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !253, file: !17, line: 52, baseType: !259, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !253, file: !17, line: 53, baseType: !90, size: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !253, file: !17, line: 54, baseType: !90, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !176, file: !17, line: 107, baseType: !259, size: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !176, file: !17, line: 108, baseType: !183, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !176, file: !17, line: 109, baseType: !183, size: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !176, file: !17, line: 110, baseType: !251, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !176, file: !17, line: 111, baseType: !251, size: 64, offset: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !176, file: !17, line: 112, baseType: !90, size: 32, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !176, file: !17, line: 113, baseType: !90, size: 32, offset: 736)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !176, file: !17, line: 114, baseType: !271, size: 16, offset: 768)
!271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !176, file: !17, line: 115, baseType: !271, size: 16, offset: 784)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !176, file: !17, line: 116, baseType: !25, size: 8, offset: 800)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !176, file: !17, line: 117, baseType: !25, size: 8, offset: 808)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !176, file: !17, line: 118, baseType: !90, size: 32, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !176, file: !17, line: 119, baseType: !90, size: 32, offset: 864)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !176, file: !17, line: 120, baseType: !278, size: 64, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !88, line: 330, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !235, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !88, line: 326, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !88, line: 346, size: 960, elements: !285)
!285 = !{!286, !287, !290, !291, !292, !293, !294, !295, !296, !297, !301}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !284, file: !88, line: 347, baseType: !90, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !88, line: 348, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !284, file: !88, line: 349, baseType: !288, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !284, file: !88, line: 350, baseType: !288, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !284, file: !88, line: 351, baseType: !288, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !284, file: !88, line: 352, baseType: !90, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !284, file: !88, line: 353, baseType: !90, size: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !284, file: !88, line: 354, baseType: !90, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !284, file: !88, line: 355, baseType: !90, size: 32, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !284, file: !88, line: 356, baseType: !298, size: 480, offset: 448)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 480, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 60)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !284, file: !88, line: 358, baseType: !90, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !176, file: !17, line: 121, baseType: !77, size: 128, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !176, file: !17, line: 122, baseType: !77, size: 128, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !176, file: !17, line: 123, baseType: !14, size: 64, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !176, file: !17, line: 124, baseType: !14, size: 64, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !176, file: !17, line: 125, baseType: !307, size: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !17, line: 18, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !176, file: !17, line: 126, baseType: !310, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 49, baseType: !41)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !11, file: !6, line: 296, baseType: !25, size: 8, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !11, file: !6, line: 296, baseType: !25, size: 8, offset: 72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !11, file: !6, line: 296, baseType: !25, size: 8, offset: 80)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !11, file: !6, line: 296, baseType: !25, size: 8, offset: 88)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !11, file: !6, line: 296, baseType: !14, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !11, file: !6, line: 296, baseType: !66, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !11, file: !6, line: 297, baseType: !231, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !11, file: !6, line: 298, baseType: !319, size: 128, offset: 320)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 1)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !7, file: !6, line: 311, baseType: !323, size: 384)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !6, line: 306, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !6, line: 302, size: 384, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !6, line: 303, baseType: !14, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !324, file: !6, line: 303, baseType: !25, size: 8, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !324, file: !6, line: 303, baseType: !25, size: 8, offset: 72)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !324, file: !6, line: 303, baseType: !25, size: 8, offset: 80)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !324, file: !6, line: 303, baseType: !25, size: 8, offset: 88)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !324, file: !6, line: 303, baseType: !14, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !324, file: !6, line: 303, baseType: !66, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !324, file: !6, line: 304, baseType: !130, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !324, file: !6, line: 305, baseType: !335, size: 64, offset: 320)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 64, elements: !320)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "Proto", file: !6, line: 253, baseType: !118)
!339 = !{i32 2, !"Dwarf Version", i32 4}
!340 = !{i32 2, !"Debug Info Version", i32 3}
!341 = !{i32 1, !"wchar_size", i32 4}
!342 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!343 = distinct !DISubprogram(name: "luaF_newCclosure", scope: !1, file: !1, line: 23, type: !344, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !348)
!344 = !DISubroutineType(types: !345)
!345 = !{!4, !235, !90, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !6, line: 348, baseType: !67)
!348 = !{!349, !350, !351, !352}
!349 = !DILocalVariable(name: "L", arg: 1, scope: !343, file: !1, line: 23, type: !235)
!350 = !DILocalVariable(name: "nelems", arg: 2, scope: !343, file: !1, line: 23, type: !90)
!351 = !DILocalVariable(name: "e", arg: 3, scope: !343, file: !1, line: 23, type: !346)
!352 = !DILocalVariable(name: "c", scope: !343, file: !1, line: 24, type: !4)
!353 = !DILocation(line: 23, column: 39, scope: !343)
!354 = !DILocation(line: 23, column: 46, scope: !343)
!355 = !DILocation(line: 23, column: 61, scope: !343)
!356 = !DILocation(line: 24, column: 16, scope: !343)
!357 = !DILocation(line: 24, column: 12, scope: !343)
!358 = !DILocation(line: 25, column: 16, scope: !343)
!359 = !DILocation(line: 25, column: 3, scope: !343)
!360 = !DILocation(line: 26, column: 8, scope: !343)
!361 = !DILocation(line: 26, column: 12, scope: !343)
!362 = !{!363, !363, i64 0}
!363 = !{!"omnipotent char", !364, i64 0}
!364 = !{!"Simple C/C++ TBAA"}
!365 = !DILocation(line: 27, column: 8, scope: !343)
!366 = !DILocation(line: 27, column: 12, scope: !343)
!367 = !DILocation(line: 28, column: 20, scope: !343)
!368 = !DILocation(line: 28, column: 8, scope: !343)
!369 = !DILocation(line: 28, column: 18, scope: !343)
!370 = !DILocation(line: 29, column: 3, scope: !343)
!371 = distinct !DISubprogram(name: "luaF_newLclosure", scope: !1, file: !1, line: 33, type: !344, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !372)
!372 = !{!373, !374, !375, !376}
!373 = !DILocalVariable(name: "L", arg: 1, scope: !371, file: !1, line: 33, type: !235)
!374 = !DILocalVariable(name: "nelems", arg: 2, scope: !371, file: !1, line: 33, type: !90)
!375 = !DILocalVariable(name: "e", arg: 3, scope: !371, file: !1, line: 33, type: !346)
!376 = !DILocalVariable(name: "c", scope: !371, file: !1, line: 34, type: !4)
!377 = !DILocation(line: 33, column: 39, scope: !371)
!378 = !DILocation(line: 33, column: 46, scope: !371)
!379 = !DILocation(line: 33, column: 61, scope: !371)
!380 = !DILocation(line: 34, column: 16, scope: !371)
!381 = !DILocation(line: 34, column: 12, scope: !371)
!382 = !DILocation(line: 35, column: 16, scope: !371)
!383 = !DILocation(line: 35, column: 3, scope: !371)
!384 = !DILocation(line: 36, column: 8, scope: !371)
!385 = !DILocation(line: 36, column: 12, scope: !371)
!386 = !DILocation(line: 37, column: 8, scope: !371)
!387 = !DILocation(line: 37, column: 12, scope: !371)
!388 = !DILocation(line: 38, column: 20, scope: !371)
!389 = !DILocation(line: 38, column: 8, scope: !371)
!390 = !DILocation(line: 38, column: 18, scope: !371)
!391 = !DILocation(line: 39, column: 3, scope: !371)
!392 = !DILocation(line: 39, column: 16, scope: !371)
!393 = !DILocation(line: 39, column: 20, scope: !371)
!394 = !DILocation(line: 39, column: 40, scope: !371)
!395 = distinct !{!395, !396}
