; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }
%struct.Table = type { %union.GCObject*, i8, i8, i8, i8, %struct.Table*, %struct.lua_TValue*, %struct.Node*, %struct.Node*, %union.GCObject*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !335, !36, !11, !336, !22, !275, !73, !250}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !6, line: 50, baseType: !7)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !8, line: 100, size: 1472, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !210, !211, !212, !213, !215, !216, !274, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297, !298, !299, !300, !301, !326, !327, !328, !329, !330, !333}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 101, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !13, line: 36, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!14 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !8, line: 136, size: 1472, elements: !15)
!15 = !{!16, !26, !52, !111, !206, !207, !208, !209}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !14, file: !8, line: 137, baseType: !17, size: 128)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !13, line: 51, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !13, line: 49, size: 128, elements: !19)
!19 = !{!20, !21, !25}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !18, file: !13, line: 50, baseType: !11, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !18, file: !13, line: 50, baseType: !22, size: 8, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !23, line: 27, baseType: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !18, file: !13, line: 50, baseType: !22, size: 8, offset: 72)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !14, file: !8, line: 138, baseType: !27, size: 192)
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !13, line: 199, size: 192, elements: !28)
!28 = !{!29, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !27, file: !13, line: 200, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !23, line: 47, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !23, line: 47, size: 64, elements: !32)
!32 = !{!33, !35, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !31, file: !23, line: 47, baseType: !34, size: 64)
!34 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !31, file: !23, line: 47, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !31, file: !23, line: 47, baseType: !38, size: 64)
!38 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !27, file: !13, line: 206, baseType: !40, size: 192)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !27, file: !13, line: 201, size: 192, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !13, line: 202, baseType: !11, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !40, file: !13, line: 202, baseType: !22, size: 8, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !40, file: !13, line: 202, baseType: !22, size: 8, offset: 72)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !40, file: !13, line: 203, baseType: !22, size: 8, offset: 80)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !40, file: !13, line: 204, baseType: !47, size: 32, offset: 96)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !13, line: 205, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 58, baseType: !51)
!50 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !14, file: !8, line: 139, baseType: !53, size: 320)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !13, line: 215, size: 320, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !53, file: !13, line: 216, baseType: !30, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !53, file: !13, line: 222, baseType: !57, size: 320)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !13, line: 217, size: 320, elements: !58)
!58 = !{!59, !60, !61, !62, !109, !110}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !13, line: 218, baseType: !11, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !57, file: !13, line: 218, baseType: !22, size: 8, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !57, file: !13, line: 218, baseType: !22, size: 8, offset: 72)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !57, file: !13, line: 219, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !13, line: 338, size: 512, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !88, !106, !107, !108}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !13, line: 339, baseType: !11, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !64, file: !13, line: 339, baseType: !22, size: 8, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !64, file: !13, line: 339, baseType: !22, size: 8, offset: 72)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !13, line: 340, baseType: !22, size: 8, offset: 80)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !64, file: !13, line: 341, baseType: !22, size: 8, offset: 88)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !64, file: !13, line: 342, baseType: !63, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !64, file: !13, line: 343, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !13, line: 75, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !13, line: 73, size: 128, elements: !76)
!76 = !{!77, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !75, file: !13, line: 74, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !13, line: 64, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 59, size: 64, elements: !80)
!80 = !{!81, !82, !83, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !79, file: !13, line: 60, baseType: !11, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !79, file: !13, line: 61, baseType: !36, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !79, file: !13, line: 62, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !6, line: 99, baseType: !34)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !79, file: !13, line: 63, baseType: !86, size: 32)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !75, file: !13, line: 74, baseType: !86, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !64, file: !13, line: 344, baseType: !89, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !13, line: 335, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !13, line: 332, size: 320, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !91, file: !13, line: 333, baseType: !74, size: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !91, file: !13, line: 334, baseType: !95, size: 192, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !13, line: 329, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !13, line: 323, size: 192, elements: !97)
!97 = !{!98, !105}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !96, file: !13, line: 327, baseType: !99, size: 192)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !13, line: 324, size: 192, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !99, file: !13, line: 325, baseType: !78, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !99, file: !13, line: 325, baseType: !86, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !13, line: 326, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !96, file: !13, line: 328, baseType: !74, size: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !64, file: !13, line: 345, baseType: !89, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !64, file: !13, line: 346, baseType: !11, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !64, file: !13, line: 347, baseType: !86, size: 32, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !57, file: !13, line: 220, baseType: !63, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !57, file: !13, line: 221, baseType: !49, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !14, file: !8, line: 140, baseType: !112, size: 448)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !13, line: 309, size: 448, elements: !113)
!113 = !{!114, !134}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !112, file: !13, line: 310, baseType: !115, size: 448)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !13, line: 299, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !13, line: 295, size: 448, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !130}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !13, line: 296, baseType: !11, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !116, file: !13, line: 296, baseType: !22, size: 8, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !116, file: !13, line: 296, baseType: !22, size: 8, offset: 72)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !116, file: !13, line: 296, baseType: !22, size: 8, offset: 80)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !116, file: !13, line: 296, baseType: !22, size: 8, offset: 88)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !116, file: !13, line: 296, baseType: !11, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !116, file: !13, line: 296, baseType: !63, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !116, file: !13, line: 297, baseType: !126, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !6, line: 52, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!86, !4}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !116, file: !13, line: 298, baseType: !131, size: 128, offset: 320)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !112, file: !13, line: 311, baseType: !135, size: 384)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !13, line: 306, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !13, line: 302, size: 384, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !186}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !13, line: 303, baseType: !11, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !136, file: !13, line: 303, baseType: !22, size: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !136, file: !13, line: 303, baseType: !22, size: 8, offset: 72)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !136, file: !13, line: 303, baseType: !22, size: 8, offset: 80)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !136, file: !13, line: 303, baseType: !22, size: 8, offset: 88)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !136, file: !13, line: 303, baseType: !11, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !136, file: !13, line: 303, baseType: !63, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !136, file: !13, line: 304, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !13, line: 231, size: 960, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !157, !159, !161, !170, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !13, line: 232, baseType: !11, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !147, file: !13, line: 232, baseType: !22, size: 8, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !147, file: !13, line: 232, baseType: !22, size: 8, offset: 72)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !147, file: !13, line: 233, baseType: !73, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !147, file: !13, line: 234, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !23, line: 88, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !23, line: 18, baseType: !47)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !147, file: !13, line: 235, baseType: !158, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !147, file: !13, line: 236, baseType: !160, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !147, file: !13, line: 237, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !13, line: 262, size: 128, elements: !164)
!164 = !{!165, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !163, file: !13, line: 263, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !13, line: 207, baseType: !27)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !163, file: !13, line: 264, baseType: !86, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !163, file: !13, line: 265, baseType: !86, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !147, file: !13, line: 238, baseType: !171, size: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !147, file: !13, line: 239, baseType: !166, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !147, file: !13, line: 240, baseType: !86, size: 32, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !147, file: !13, line: 241, baseType: !86, size: 32, offset: 608)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !147, file: !13, line: 242, baseType: !86, size: 32, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !147, file: !13, line: 243, baseType: !86, size: 32, offset: 672)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !147, file: !13, line: 244, baseType: !86, size: 32, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !147, file: !13, line: 245, baseType: !86, size: 32, offset: 736)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !147, file: !13, line: 246, baseType: !86, size: 32, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !147, file: !13, line: 247, baseType: !86, size: 32, offset: 800)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !147, file: !13, line: 248, baseType: !11, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !147, file: !13, line: 249, baseType: !22, size: 8, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !147, file: !13, line: 250, baseType: !22, size: 8, offset: 904)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !147, file: !13, line: 251, baseType: !22, size: 8, offset: 912)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !147, file: !13, line: 252, baseType: !22, size: 8, offset: 920)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !136, file: !13, line: 305, baseType: !187, size: 64, offset: 320)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 64, elements: !132)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !13, line: 284, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !13, line: 274, size: 320, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !13, line: 275, baseType: !11, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !190, file: !13, line: 275, baseType: !22, size: 8, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !190, file: !13, line: 275, baseType: !22, size: 8, offset: 72)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !190, file: !13, line: 276, baseType: !73, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !190, file: !13, line: 283, baseType: !197, size: 128, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !190, file: !13, line: 277, size: 128, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !13, line: 278, baseType: !74, size: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !197, file: !13, line: 282, baseType: !201, size: 128)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !13, line: 279, size: 128, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !13, line: 280, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !13, line: 281, baseType: !204, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !14, file: !8, line: 141, baseType: !64, size: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !14, file: !8, line: 142, baseType: !147, size: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !14, file: !8, line: 143, baseType: !190, size: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !14, file: !8, line: 144, baseType: !7, size: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !7, file: !8, line: 101, baseType: !22, size: 8, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !7, file: !8, line: 101, baseType: !22, size: 8, offset: 72)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !7, file: !8, line: 102, baseType: !22, size: 8, offset: 80)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !7, file: !8, line: 103, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !13, line: 193, baseType: !73)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !7, file: !8, line: 104, baseType: !214, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !7, file: !8, line: 105, baseType: !217, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !8, line: 94, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !8, line: 68, size: 3456, elements: !220)
!220 = !{!221, !229, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !254, !256, !257, !258, !259, !260, !261, !262, !263, !265, !266, !270}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !219, file: !8, line: 69, baseType: !222, size: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !8, line: 42, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !8, line: 38, size: 128, elements: !224)
!224 = !{!225, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !223, file: !8, line: 39, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !223, file: !8, line: 40, baseType: !156, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !223, file: !8, line: 41, baseType: !86, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !219, file: !8, line: 70, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !6, line: 66, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!36, !36, !36, !49, !49}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !219, file: !8, line: 71, baseType: !36, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !219, file: !8, line: 72, baseType: !22, size: 8, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !219, file: !8, line: 73, baseType: !22, size: 8, offset: 264)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !219, file: !8, line: 74, baseType: !86, size: 32, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !219, file: !8, line: 75, baseType: !11, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !219, file: !8, line: 76, baseType: !226, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !219, file: !8, line: 77, baseType: !11, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !219, file: !8, line: 78, baseType: !11, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !219, file: !8, line: 79, baseType: !11, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !219, file: !8, line: 80, baseType: !11, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !219, file: !8, line: 81, baseType: !245, size: 192, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !246, line: 28, baseType: !247)
!246 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !246, line: 24, size: 192, elements: !248)
!248 = !{!249, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !247, file: !246, line: 25, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !247, file: !246, line: 26, baseType: !49, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !247, file: !246, line: 27, baseType: !49, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !219, file: !8, line: 82, baseType: !255, size: 64, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !23, line: 20, baseType: !49)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !219, file: !8, line: 83, baseType: !255, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !219, file: !8, line: 84, baseType: !255, size: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !219, file: !8, line: 85, baseType: !255, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !219, file: !8, line: 86, baseType: !86, size: 32, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !219, file: !8, line: 87, baseType: !86, size: 32, offset: 1184)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !219, file: !8, line: 88, baseType: !126, size: 64, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !219, file: !8, line: 89, baseType: !74, size: 128, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !219, file: !8, line: 90, baseType: !264, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !219, file: !8, line: 91, baseType: !189, size: 320, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !219, file: !8, line: 92, baseType: !267, size: 576, offset: 1792)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 576, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 9)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !219, file: !8, line: 93, baseType: !271, size: 1088, offset: 2368)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 1088, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 17)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !7, file: !8, line: 106, baseType: !275, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !8, line: 55, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !8, line: 48, size: 320, elements: !278)
!278 = !{!279, !280, !281, !282, !285, !286}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !277, file: !8, line: 49, baseType: !214, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !277, file: !8, line: 50, baseType: !214, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !277, file: !8, line: 51, baseType: !214, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !277, file: !8, line: 52, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !277, file: !8, line: 53, baseType: !86, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !277, file: !8, line: 54, baseType: !86, size: 32, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !7, file: !8, line: 107, baseType: !283, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !7, file: !8, line: 108, baseType: !214, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !7, file: !8, line: 109, baseType: !214, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !7, file: !8, line: 110, baseType: !275, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !7, file: !8, line: 111, baseType: !275, size: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !7, file: !8, line: 112, baseType: !86, size: 32, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !7, file: !8, line: 113, baseType: !86, size: 32, offset: 736)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !7, file: !8, line: 114, baseType: !295, size: 16, offset: 768)
!295 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !7, file: !8, line: 115, baseType: !295, size: 16, offset: 784)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !7, file: !8, line: 116, baseType: !22, size: 8, offset: 800)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !7, file: !8, line: 117, baseType: !22, size: 8, offset: 808)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !7, file: !8, line: 118, baseType: !86, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !7, file: !8, line: 119, baseType: !86, size: 32, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !7, file: !8, line: 120, baseType: !302, size: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !6, line: 330, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !4, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !6, line: 326, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !6, line: 346, size: 960, elements: !309)
!309 = !{!310, !311, !314, !315, !316, !317, !318, !319, !320, !321, !325}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !308, file: !6, line: 347, baseType: !86, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !6, line: 348, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !308, file: !6, line: 349, baseType: !312, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !308, file: !6, line: 350, baseType: !312, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !308, file: !6, line: 351, baseType: !312, size: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !308, file: !6, line: 352, baseType: !86, size: 32, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !308, file: !6, line: 353, baseType: !86, size: 32, offset: 352)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !308, file: !6, line: 354, baseType: !86, size: 32, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !308, file: !6, line: 355, baseType: !86, size: 32, offset: 416)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !308, file: !6, line: 356, baseType: !322, size: 480, offset: 448)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 480, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 60)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !308, file: !6, line: 358, baseType: !86, size: 32, offset: 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !7, file: !8, line: 121, baseType: !74, size: 128, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !7, file: !8, line: 122, baseType: !74, size: 128, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !7, file: !8, line: 123, baseType: !11, size: 64, offset: 1216)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !7, file: !8, line: 124, baseType: !11, size: 64, offset: 1280)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !7, file: !8, line: 125, baseType: !331, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !8, line: 18, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !7, file: !8, line: 126, baseType: !334, size: 64, offset: 1408)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !50, line: 49, baseType: !38)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "LG", file: !1, line: 38, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LG", file: !1, line: 35, size: 4928, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !338, file: !1, line: 36, baseType: !5, size: 1472)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !338, file: !1, line: 37, baseType: !218, size: 3456, offset: 1472)
!342 = !{i32 2, !"Dwarf Version", i32 4}
!343 = !{i32 2, !"Debug Info Version", i32 3}
!344 = !{i32 1, !"wchar_size", i32 4}
!345 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!346 = distinct !DISubprogram(name: "luaE_newthread", scope: !1, file: !1, line: 119, type: !347, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{!4, !4}
!349 = !{!350, !351, !352, !356}
!350 = !DILocalVariable(name: "L", arg: 1, scope: !346, file: !1, line: 119, type: !4)
!351 = !DILocalVariable(name: "L1", scope: !346, file: !1, line: 120, type: !4)
!352 = !DILocalVariable(name: "o2", scope: !353, file: !1, line: 124, type: !354)
!353 = distinct !DILexicalBlock(scope: !346, file: !1, line: 124, column: 3)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!356 = !DILocalVariable(name: "o1", scope: !353, file: !1, line: 124, type: !73)
!357 = !DILocation(line: 119, column: 39, scope: !346)
!358 = !DILocation(line: 120, column: 19, scope: !346)
!359 = !DILocation(line: 120, column: 14, scope: !346)
!360 = !DILocation(line: 121, column: 16, scope: !346)
!361 = !DILocation(line: 121, column: 3, scope: !346)
!362 = !DILocation(line: 122, column: 21, scope: !346)
!363 = !{!364, !365, i64 32}
!364 = !{!"lua_State", !365, i64 0, !366, i64 8, !366, i64 9, !366, i64 10, !365, i64 16, !365, i64 24, !365, i64 32, !365, i64 40, !365, i64 48, !365, i64 56, !365, i64 64, !365, i64 72, !365, i64 80, !368, i64 88, !368, i64 92, !369, i64 96, !369, i64 98, !366, i64 100, !366, i64 101, !368, i64 104, !368, i64 108, !365, i64 112, !370, i64 120, !370, i64 136, !365, i64 152, !365, i64 160, !365, i64 168, !371, i64 176}
!365 = !{!"any pointer", !366, i64 0}
!366 = !{!"omnipotent char", !367, i64 0}
!367 = !{!"Simple C/C++ TBAA"}
!368 = !{!"int", !366, i64 0}
!369 = !{!"short", !366, i64 0}
!370 = !{!"lua_TValue", !366, i64 0, !368, i64 8}
!371 = !{!"long", !366, i64 0}
!372 = !DILocalVariable(name: "L", arg: 1, scope: !373, file: !1, line: 84, type: !4)
!373 = distinct !DISubprogram(name: "preinit_state", scope: !1, file: !1, line: 84, type: !374, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !376)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !4, !217}
!376 = !{!372, !377}
!377 = !DILocalVariable(name: "g", arg: 2, scope: !373, file: !1, line: 84, type: !217)
!378 = !DILocation(line: 84, column: 39, scope: !373, inlinedAt: !379)
!379 = distinct !DILocation(line: 122, column: 3, scope: !346)
!380 = !DILocation(line: 84, column: 56, scope: !373, inlinedAt: !379)
!381 = !DILocation(line: 85, column: 3, scope: !373, inlinedAt: !379)
!382 = !DILocation(line: 85, column: 8, scope: !373, inlinedAt: !379)
!383 = !DILocation(line: 86, column: 6, scope: !373, inlinedAt: !379)
!384 = !DILocation(line: 86, column: 12, scope: !373, inlinedAt: !379)
!385 = !{!364, !365, i64 64}
!386 = !DILocation(line: 87, column: 6, scope: !373, inlinedAt: !379)
!387 = !DILocation(line: 87, column: 16, scope: !373, inlinedAt: !379)
!388 = !{!364, !368, i64 88}
!389 = !DILocation(line: 88, column: 6, scope: !373, inlinedAt: !379)
!390 = !DILocation(line: 88, column: 15, scope: !373, inlinedAt: !379)
!391 = !{!364, !365, i64 168}
!392 = !DILocation(line: 89, column: 6, scope: !373, inlinedAt: !379)
!393 = !DILocation(line: 89, column: 11, scope: !373, inlinedAt: !379)
!394 = !{!364, !365, i64 112}
!395 = !DILocation(line: 90, column: 6, scope: !373, inlinedAt: !379)
!396 = !DILocation(line: 90, column: 15, scope: !373, inlinedAt: !379)
!397 = !{!364, !366, i64 100}
!398 = !DILocation(line: 91, column: 6, scope: !373, inlinedAt: !379)
