; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltable.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltable.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Node = type { %struct.lua_TValue, %union.TKey }
%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dummynode_", scope: !2, file: !3, line: 75, type: !343, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !342)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltable.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !9, !39, !15, !26, !322, !50, !90, !101, !52, !155}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !7, line: 99, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !11, line: 348, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !11, line: 338, size: 512, elements: !13)
!13 = !{!14, !315, !316, !317, !318, !319, !320, !321, !339, !340, !341}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 339, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !11, line: 36, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !18, line: 136, size: 1472, elements: !19)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!19 = !{!20, !30, !57, !71, !311, !312, !313, !314}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !17, file: !18, line: 137, baseType: !21, size: 128)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !11, line: 51, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !11, line: 49, size: 128, elements: !23)
!23 = !{!24, !25, !29}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !11, line: 50, baseType: !15, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !22, file: !11, line: 50, baseType: !26, size: 8, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !27, line: 27, baseType: !28)
!27 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !22, file: !11, line: 50, baseType: !26, size: 8, offset: 72)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !17, file: !18, line: 138, baseType: !31, size: 192)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !11, line: 199, size: 192, elements: !32)
!32 = !{!33, !42}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !31, file: !11, line: 200, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !27, line: 47, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !27, line: 47, size: 64, elements: !36)
!36 = !{!37, !38, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !35, file: !27, line: 47, baseType: !8, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !35, file: !27, line: 47, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !35, file: !27, line: 47, baseType: !41, size: 64)
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !31, file: !11, line: 206, baseType: !43, size: 192)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !31, file: !11, line: 201, size: 192, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !11, line: 202, baseType: !15, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !43, file: !11, line: 202, baseType: !26, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !43, file: !11, line: 202, baseType: !26, size: 8, offset: 72)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !43, file: !11, line: 203, baseType: !26, size: 8, offset: 80)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !43, file: !11, line: 204, baseType: !50, size: 32, offset: 96)
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !11, line: 205, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 40, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !55, line: 129, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !17, file: !18, line: 139, baseType: !58, size: 320)
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !11, line: 215, size: 320, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !58, file: !11, line: 216, baseType: !34, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !58, file: !11, line: 222, baseType: !62, size: 320)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !58, file: !11, line: 217, size: 320, elements: !63)
!63 = !{!64, !65, !66, !67, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !11, line: 218, baseType: !15, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !62, file: !11, line: 218, baseType: !26, size: 8, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !62, file: !11, line: 218, baseType: !26, size: 8, offset: 72)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !62, file: !11, line: 219, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !62, file: !11, line: 220, baseType: !68, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !62, file: !11, line: 221, baseType: !52, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !17, file: !18, line: 140, baseType: !72, size: 448)
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !11, line: 309, size: 448, elements: !73)
!73 = !{!74, !260}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !72, file: !11, line: 310, baseType: !75, size: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !11, line: 299, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !11, line: 295, size: 448, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !256}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !11, line: 296, baseType: !15, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !76, file: !11, line: 296, baseType: !26, size: 8, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !76, file: !11, line: 296, baseType: !26, size: 8, offset: 72)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !76, file: !11, line: 296, baseType: !26, size: 8, offset: 80)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !76, file: !11, line: 296, baseType: !26, size: 8, offset: 88)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !76, file: !11, line: 296, baseType: !15, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !76, file: !11, line: 296, baseType: !68, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !76, file: !11, line: 297, baseType: !86, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !7, line: 52, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !91}
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !7, line: 50, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !18, line: 100, size: 1472, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !114, !115, !193, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217, !218, !219, !220, !221, !246, !247, !248, !249, !250, !253}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !18, line: 101, baseType: !15, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !93, file: !18, line: 101, baseType: !26, size: 8, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !93, file: !18, line: 101, baseType: !26, size: 8, offset: 72)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !93, file: !18, line: 102, baseType: !26, size: 8, offset: 80)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !93, file: !18, line: 103, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !11, line: 193, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !11, line: 75, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !11, line: 73, size: 128, elements: !104)
!104 = !{!105, !113}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !103, file: !11, line: 74, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !11, line: 64, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !11, line: 59, size: 64, elements: !108)
!108 = !{!109, !110, !111, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !107, file: !11, line: 60, baseType: !15, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !107, file: !11, line: 61, baseType: !39, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !107, file: !11, line: 62, baseType: !6, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !107, file: !11, line: 63, baseType: !90, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !103, file: !11, line: 74, baseType: !90, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !93, file: !18, line: 104, baseType: !100, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !93, file: !18, line: 105, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !18, line: 94, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !18, line: 68, size: 3456, elements: !119)
!119 = !{!120, !129, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !154, !156, !157, !158, !159, !160, !161, !162, !163, !165, !183, !187}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !118, file: !18, line: 69, baseType: !121, size: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !18, line: 42, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !18, line: 38, size: 128, elements: !123)
!123 = !{!124, !126, !128}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !122, file: !18, line: 39, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !122, file: !18, line: 40, baseType: !127, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !27, line: 18, baseType: !50)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !122, file: !18, line: 41, baseType: !90, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !118, file: !18, line: 70, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !7, line: 66, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!39, !39, !39, !52, !52}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !118, file: !18, line: 71, baseType: !39, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !118, file: !18, line: 72, baseType: !26, size: 8, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !118, file: !18, line: 73, baseType: !26, size: 8, offset: 264)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !118, file: !18, line: 74, baseType: !90, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !118, file: !18, line: 75, baseType: !15, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !118, file: !18, line: 76, baseType: !125, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !118, file: !18, line: 77, baseType: !15, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !118, file: !18, line: 78, baseType: !15, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !118, file: !18, line: 79, baseType: !15, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !118, file: !18, line: 80, baseType: !15, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !118, file: !18, line: 81, baseType: !145, size: 192, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !146, line: 28, baseType: !147)
!146 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !146, line: 24, size: 192, elements: !148)
!148 = !{!149, !152, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !147, file: !146, line: 25, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !147, file: !146, line: 26, baseType: !52, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !147, file: !146, line: 27, baseType: !52, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !118, file: !18, line: 82, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !27, line: 20, baseType: !52)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !118, file: !18, line: 83, baseType: !155, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !118, file: !18, line: 84, baseType: !155, size: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !118, file: !18, line: 85, baseType: !155, size: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !118, file: !18, line: 86, baseType: !90, size: 32, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !118, file: !18, line: 87, baseType: !90, size: 32, offset: 1184)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !118, file: !18, line: 88, baseType: !86, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !118, file: !18, line: 89, baseType: !102, size: 128, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !118, file: !18, line: 90, baseType: !164, size: 64, offset: 1408)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !118, file: !18, line: 91, baseType: !166, size: 320, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !11, line: 284, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !11, line: 274, size: 320, elements: !168)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !11, line: 275, baseType: !15, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !167, file: !11, line: 275, baseType: !26, size: 8, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !167, file: !11, line: 275, baseType: !26, size: 8, offset: 72)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !167, file: !11, line: 276, baseType: !101, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !167, file: !11, line: 283, baseType: !174, size: 128, offset: 192)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !167, file: !11, line: 277, size: 128, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !174, file: !11, line: 278, baseType: !102, size: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !174, file: !11, line: 282, baseType: !178, size: 128)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !11, line: 279, size: 128, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !11, line: 280, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !11, line: 281, baseType: !181, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !118, file: !18, line: 92, baseType: !184, size: 576, offset: 1792)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 576, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 9)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !118, file: !18, line: 93, baseType: !188, size: 1088, offset: 2368)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 1088, elements: !191)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !11, line: 207, baseType: !31)
!191 = !{!192}
!192 = !DISubrange(count: 17)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !93, file: !18, line: 106, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !18, line: 55, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !18, line: 48, size: 320, elements: !197)
!197 = !{!198, !199, !200, !201, !205, !206}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !196, file: !18, line: 49, baseType: !100, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !196, file: !18, line: 50, baseType: !100, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !196, file: !18, line: 51, baseType: !100, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !196, file: !18, line: 52, baseType: !202, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !27, line: 88, baseType: !127)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !196, file: !18, line: 53, baseType: !90, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !196, file: !18, line: 54, baseType: !90, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !93, file: !18, line: 107, baseType: !202, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !93, file: !18, line: 108, baseType: !100, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !93, file: !18, line: 109, baseType: !100, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !93, file: !18, line: 110, baseType: !194, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !93, file: !18, line: 111, baseType: !194, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !93, file: !18, line: 112, baseType: !90, size: 32, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !93, file: !18, line: 113, baseType: !90, size: 32, offset: 736)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !93, file: !18, line: 114, baseType: !215, size: 16, offset: 768)
!215 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !93, file: !18, line: 115, baseType: !215, size: 16, offset: 784)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !93, file: !18, line: 116, baseType: !26, size: 8, offset: 800)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !93, file: !18, line: 117, baseType: !26, size: 8, offset: 808)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !93, file: !18, line: 118, baseType: !90, size: 32, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !93, file: !18, line: 119, baseType: !90, size: 32, offset: 864)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !93, file: !18, line: 120, baseType: !222, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !7, line: 330, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !91, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !7, line: 326, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !7, line: 346, size: 960, elements: !229)
!229 = !{!230, !231, !234, !235, !236, !237, !238, !239, !240, !241, !245}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !228, file: !7, line: 347, baseType: !90, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !7, line: 348, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !228, file: !7, line: 349, baseType: !232, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !228, file: !7, line: 350, baseType: !232, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !228, file: !7, line: 351, baseType: !232, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !228, file: !7, line: 352, baseType: !90, size: 32, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !228, file: !7, line: 353, baseType: !90, size: 32, offset: 352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !228, file: !7, line: 354, baseType: !90, size: 32, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !228, file: !7, line: 355, baseType: !90, size: 32, offset: 416)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !228, file: !7, line: 356, baseType: !242, size: 480, offset: 448)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 480, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 60)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !228, file: !7, line: 358, baseType: !90, size: 32, offset: 928)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !93, file: !18, line: 121, baseType: !102, size: 128, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !93, file: !18, line: 122, baseType: !102, size: 128, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !93, file: !18, line: 123, baseType: !15, size: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !93, file: !18, line: 124, baseType: !15, size: 64, offset: 1280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !93, file: !18, line: 125, baseType: !251, size: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !18, line: 18, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !93, file: !18, line: 126, baseType: !254, size: 64, offset: 1408)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !255, line: 49, baseType: !41)
!255 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!256 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !76, file: !11, line: 298, baseType: !257, size: 128, offset: 320)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 1)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !72, file: !11, line: 311, baseType: !261, size: 384)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !11, line: 306, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !11, line: 302, size: 384, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !308}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !11, line: 303, baseType: !15, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !262, file: !11, line: 303, baseType: !26, size: 8, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !262, file: !11, line: 303, baseType: !26, size: 8, offset: 72)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !262, file: !11, line: 303, baseType: !26, size: 8, offset: 80)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !262, file: !11, line: 303, baseType: !26, size: 8, offset: 88)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !262, file: !11, line: 303, baseType: !15, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !262, file: !11, line: 303, baseType: !68, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !262, file: !11, line: 304, baseType: !272, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !11, line: 231, size: 960, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !281, !283, !285, !292, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !11, line: 232, baseType: !15, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !273, file: !11, line: 232, baseType: !26, size: 8, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !273, file: !11, line: 232, baseType: !26, size: 8, offset: 72)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !273, file: !11, line: 233, baseType: !101, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !273, file: !11, line: 234, baseType: !280, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !273, file: !11, line: 235, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !273, file: !11, line: 236, baseType: !284, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !273, file: !11, line: 237, baseType: !286, size: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !11, line: 262, size: 128, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !287, file: !11, line: 263, baseType: !189, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !287, file: !11, line: 264, baseType: !90, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !287, file: !11, line: 265, baseType: !90, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !273, file: !11, line: 238, baseType: !293, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !273, file: !11, line: 239, baseType: !189, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !273, file: !11, line: 240, baseType: !90, size: 32, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !273, file: !11, line: 241, baseType: !90, size: 32, offset: 608)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !273, file: !11, line: 242, baseType: !90, size: 32, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !273, file: !11, line: 243, baseType: !90, size: 32, offset: 672)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !273, file: !11, line: 244, baseType: !90, size: 32, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !273, file: !11, line: 245, baseType: !90, size: 32, offset: 736)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !273, file: !11, line: 246, baseType: !90, size: 32, offset: 768)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !273, file: !11, line: 247, baseType: !90, size: 32, offset: 800)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !273, file: !11, line: 248, baseType: !15, size: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !273, file: !11, line: 249, baseType: !26, size: 8, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !273, file: !11, line: 250, baseType: !26, size: 8, offset: 904)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !273, file: !11, line: 251, baseType: !26, size: 8, offset: 912)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !273, file: !11, line: 252, baseType: !26, size: 8, offset: 920)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !262, file: !11, line: 305, baseType: !309, size: 64, offset: 320)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 64, elements: !258)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !17, file: !18, line: 141, baseType: !12, size: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !17, file: !18, line: 142, baseType: !273, size: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !17, file: !18, line: 143, baseType: !167, size: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !17, file: !18, line: 144, baseType: !93, size: 1472)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !12, file: !11, line: 339, baseType: !26, size: 8, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !12, file: !11, line: 339, baseType: !26, size: 8, offset: 72)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !11, line: 340, baseType: !26, size: 8, offset: 80)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !12, file: !11, line: 341, baseType: !26, size: 8, offset: 88)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !12, file: !11, line: 342, baseType: !68, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !12, file: !11, line: 343, baseType: !101, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !12, file: !11, line: 344, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !11, line: 335, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !11, line: 332, size: 320, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !324, file: !11, line: 333, baseType: !102, size: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !324, file: !11, line: 334, baseType: !328, size: 192, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !11, line: 329, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !11, line: 323, size: 192, elements: !330)
!330 = !{!331, !338}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !329, file: !11, line: 327, baseType: !332, size: 192)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !11, line: 324, size: 192, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !11, line: 325, baseType: !106, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !332, file: !11, line: 325, baseType: !90, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !11, line: 326, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !329, file: !11, line: 328, baseType: !102, size: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !12, file: !11, line: 345, baseType: !322, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !12, file: !11, line: 346, baseType: !15, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !12, file: !11, line: 347, baseType: !90, size: 32, offset: 448)
!342 = !{!0}
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = !{i32 1, !"wchar_size", i32 4}
!347 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!348 = distinct !DISubprogram(name: "luaH_next", scope: !3, file: !3, line: 162, type: !349, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !351)
!349 = !DISubroutineType(types: !350)
!350 = !{!90, !91, !9, !100}
!351 = !{!352, !353, !354, !355, !356, !363, !367, !368, !375, !376, !378}
!352 = !DILocalVariable(name: "L", arg: 1, scope: !348, file: !3, line: 162, type: !91)
!353 = !DILocalVariable(name: "t", arg: 2, scope: !348, file: !3, line: 162, type: !9)
!354 = !DILocalVariable(name: "key", arg: 3, scope: !348, file: !3, line: 162, type: !100)
!355 = !DILocalVariable(name: "i", scope: !348, file: !3, line: 163, type: !90)
!356 = !DILocalVariable(name: "i_o", scope: !357, file: !3, line: 166, type: !101)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 166, column: 7)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 165, column: 33)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 165, column: 9)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 164, column: 36)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 164, column: 3)
!362 = distinct !DILexicalBlock(scope: !348, file: !3, line: 164, column: 3)
!363 = !DILocalVariable(name: "o2", scope: !364, file: !3, line: 167, type: !365)
!364 = distinct !DILexicalBlock(scope: !358, file: !3, line: 167, column: 7)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!367 = !DILocalVariable(name: "o1", scope: !364, file: !3, line: 167, type: !101)
!368 = !DILocalVariable(name: "o2", scope: !369, file: !3, line: 173, type: !365)
!369 = distinct !DILexicalBlock(scope: !370, file: !3, line: 173, column: 7)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 172, column: 38)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 172, column: 9)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 171, column: 49)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 171, column: 3)
!374 = distinct !DILexicalBlock(scope: !348, file: !3, line: 171, column: 3)
!375 = !DILocalVariable(name: "o1", scope: !369, file: !3, line: 173, type: !101)
!376 = !DILocalVariable(name: "o2", scope: !377, file: !3, line: 174, type: !365)
!377 = distinct !DILexicalBlock(scope: !370, file: !3, line: 174, column: 7)
!378 = !DILocalVariable(name: "o1", scope: !377, file: !3, line: 174, type: !101)
!379 = !DILocation(line: 162, column: 27, scope: !348)
!380 = !DILocation(line: 162, column: 37, scope: !348)
!381 = !DILocation(line: 162, column: 46, scope: !348)
!382 = !DILocalVariable(name: "L", arg: 1, scope: !383, file: !3, line: 137, type: !91)
!383 = distinct !DISubprogram(name: "findindex", scope: !3, file: !3, line: 137, type: !349, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !384)
!384 = !{!382, !385, !386, !387, !388}
!385 = !DILocalVariable(name: "t", arg: 2, scope: !383, file: !3, line: 137, type: !9)
!386 = !DILocalVariable(name: "key", arg: 3, scope: !383, file: !3, line: 137, type: !100)
!387 = !DILocalVariable(name: "i", scope: !383, file: !3, line: 138, type: !90)
!388 = !DILocalVariable(name: "n", scope: !389, file: !3, line: 144, type: !322)
!389 = distinct !DILexicalBlock(scope: !390, file: !3, line: 143, column: 8)
!390 = distinct !DILexicalBlock(scope: !383, file: !3, line: 141, column: 7)
!391 = !DILocation(line: 137, column: 34, scope: !383, inlinedAt: !392)
