; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua_cjson.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua_cjson.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.lua_State = type opaque
%struct.strbuf_t = type { i8*, i32, i32, i32, i32, i32, i32 }
%struct.json_config_t = type { [256 x i32], [256 x i8], %struct.strbuf_t, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.json_parse_t = type { i8*, i8*, %struct.strbuf_t*, %struct.json_config_t*, i32 }
%struct.json_token_t = type { i32, i32, %union.anon, i32 }
%union.anon = type { i8* }

@.str = private unnamed_addr constant [6 x i8] c"cjson\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"encode\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"decode\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"encode_sparse_array\00", align 1
@.str.4 = private unnamed_addr constant [17 x i8] c"encode_max_depth\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"decode_max_depth\00", align 1
@.str.6 = private unnamed_addr constant [24 x i8] c"encode_number_precision\00", align 1
@.str.7 = private unnamed_addr constant [19 x i8] c"encode_keep_buffer\00", align 1
@.str.8 = private unnamed_addr constant [23 x i8] c"encode_invalid_numbers\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "char2escape", scope: !2, file: !3, line: 153, type: !99, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !22, globals: !25)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua_cjson.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 79, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!8 = !DIEnumerator(name: "T_OBJ_BEGIN", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "T_OBJ_END", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "T_ARR_BEGIN", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "T_ARR_END", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "T_STRING", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "T_NUMBER", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "T_BOOLEAN", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "T_NULL", value: 7, isUnsigned: true)
!16 = !DIEnumerator(name: "T_COLON", value: 8, isUnsigned: true)
!17 = !DIEnumerator(name: "T_COMMA", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "T_END", value: 10, isUnsigned: true)
!19 = !DIEnumerator(name: "T_WHITESPACE", value: 11, isUnsigned: true)
!20 = !DIEnumerator(name: "T_ERROR", value: 12, isUnsigned: true)
!21 = !DIEnumerator(name: "T_UNKNOWN", value: 13, isUnsigned: true)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !{!0, !26, !34, !55}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "json_token_type_name", scope: !2, file: !3, line: 96, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 960, elements: !32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !{!33}
!33 = !DISubrange(count: 15)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "bool_options", scope: !36, file: !3, line: 242, type: !52, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "json_enum_option", scope: !3, file: !3, line: 239, type: !37, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !46)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !40, !39, !44, !45, !39}
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !42, line: 50, baseType: !43)
!42 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !42, line: 50, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!46 = !{!47, !48, !49, !50, !51}
!47 = !DILocalVariable(name: "l", arg: 1, scope: !36, file: !3, line: 239, type: !40)
!48 = !DILocalVariable(name: "optindex", arg: 2, scope: !36, file: !3, line: 239, type: !39)
!49 = !DILocalVariable(name: "setting", arg: 3, scope: !36, file: !3, line: 239, type: !44)
!50 = !DILocalVariable(name: "options", arg: 4, scope: !36, file: !3, line: 240, type: !45)
!51 = !DILocalVariable(name: "bool_true", arg: 5, scope: !36, file: !3, line: 240, type: !39)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 192, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 3)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "options", scope: !57, file: !3, line: 340, type: !96, isLocal: true, isDefinition: true)
!57 = distinct !DISubprogram(name: "json_cfg_encode_invalid_numbers", scope: !3, file: !3, line: 338, type: !58, isLocal: true, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !60)
!58 = !DISubroutineType(types: !59)
!59 = !{!39, !40}
!60 = !{!61, !62}
!61 = !DILocalVariable(name: "l", arg: 1, scope: !57, file: !3, line: 338, type: !40)
!62 = !DILocalVariable(name: "cfg", scope: !57, file: !3, line: 341, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_config_t", file: !3, line: 132, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 114, size: 10816, elements: !66)
!66 = !{!67, !72, !74, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ch2token", scope: !65, file: !3, line: 115, baseType: !68, size: 8192)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !70)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_token_type_t", file: !3, line: 94, baseType: !5)
!70 = !{!71}
!71 = !DISubrange(count: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "escape2char", scope: !65, file: !3, line: 116, baseType: !73, size: 2048, offset: 8192)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2048, elements: !70)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "encode_buf", scope: !65, file: !3, line: 120, baseType: !75, size: 256, offset: 10240)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !76, line: 42, baseType: !77)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/strbuf.h", directory: "/root/.unikraft/apps/redis/build")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 34, size: 256, elements: !78)
!78 = !{!79, !81, !82, !83, !84, !85, !86}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !77, file: !76, line: 35, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !77, file: !76, line: 36, baseType: !39, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !77, file: !76, line: 37, baseType: !39, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "increment", scope: !77, file: !76, line: 38, baseType: !39, size: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !77, file: !76, line: 39, baseType: !39, size: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !77, file: !76, line: 40, baseType: !39, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !77, file: !76, line: 41, baseType: !39, size: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sparse_convert", scope: !65, file: !3, line: 122, baseType: !39, size: 32, offset: 10496)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sparse_ratio", scope: !65, file: !3, line: 123, baseType: !39, size: 32, offset: 10528)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sparse_safe", scope: !65, file: !3, line: 124, baseType: !39, size: 32, offset: 10560)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "encode_max_depth", scope: !65, file: !3, line: 125, baseType: !39, size: 32, offset: 10592)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "encode_invalid_numbers", scope: !65, file: !3, line: 126, baseType: !39, size: 32, offset: 10624)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "encode_number_precision", scope: !65, file: !3, line: 127, baseType: !39, size: 32, offset: 10656)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "encode_keep_buffer", scope: !65, file: !3, line: 128, baseType: !39, size: 32, offset: 10688)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "decode_invalid_numbers", scope: !65, file: !3, line: 130, baseType: !39, size: 32, offset: 10720)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "decode_max_depth", scope: !65, file: !3, line: 131, baseType: !39, size: 32, offset: 10752)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 4)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 16384, elements: !70)
!100 = !{i32 2, !"Dwarf Version", i32 4}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{i32 1, !"wchar_size", i32 4}
!103 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!104 = distinct !DISubprogram(name: "luaopen_cjson", scope: !3, file: !3, line: 1404, type: !58, isLocal: false, isDefinition: true, scopeLine: 1405, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !105)
!105 = !{!106}
!106 = !DILocalVariable(name: "l", arg: 1, scope: !104, file: !3, line: 1404, type: !40)
!107 = !DILocation(line: 1404, column: 30, scope: !104)
!108 = !DILocation(line: 1406, column: 5, scope: !104)
!109 = !DILocation(line: 1410, column: 5, scope: !104)
!110 = !DILocation(line: 1411, column: 5, scope: !104)
!111 = !DILocation(line: 1415, column: 5, scope: !104)
!112 = distinct !DISubprogram(name: "lua_cjson_new", scope: !3, file: !3, line: 1344, type: !58, isLocal: true, isDefinition: true, scopeLine: 1345, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !113)
!113 = !{!114, !115}
!114 = !DILocalVariable(name: "l", arg: 1, scope: !112, file: !3, line: 1344, type: !40)
!115 = !DILocalVariable(name: "reg", scope: !112, file: !3, line: 1346, type: !116)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1408, elements: !125)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !118, line: 38, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !118, line: 35, size: 128, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !118, line: 36, baseType: !29, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !119, file: !118, line: 37, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !42, line: 52, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!125 = !{!126}
!126 = !DISubrange(count: 11)
!127 = !DILocation(line: 1344, column: 37, scope: !112)
!128 = !DILocation(line: 1346, column: 5, scope: !112)
!129 = !DILocation(line: 1346, column: 14, scope: !112)
!130 = !DILocation(line: 1361, column: 5, scope: !112)
!131 = !DILocation(line: 1364, column: 5, scope: !112)
!132 = !DILocalVariable(name: "l", arg: 1, scope: !133, file: !3, line: 373, type: !40)
!133 = distinct !DISubprogram(name: "json_create_config", scope: !3, file: !3, line: 373, type: !134, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !136)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !40}
!136 = !{!132, !137, !138}
!137 = !DILocalVariable(name: "cfg", scope: !133, file: !3, line: 375, type: !63)
!138 = !DILocalVariable(name: "i", scope: !133, file: !3, line: 376, type: !39)
!139 = !DILocation(line: 373, column: 43, scope: !133, inlinedAt: !140)
!140 = distinct !DILocation(line: 1367, column: 5, scope: !112)
!141 = !DILocation(line: 378, column: 11, scope: !133, inlinedAt: !140)
!142 = !DILocation(line: 375, column: 20, scope: !133, inlinedAt: !140)
!143 = !DILocation(line: 381, column: 5, scope: !133, inlinedAt: !140)
!144 = !DILocation(line: 382, column: 5, scope: !133, inlinedAt: !140)
!145 = !DILocation(line: 383, column: 5, scope: !133, inlinedAt: !140)
!146 = !DILocation(line: 384, column: 5, scope: !133, inlinedAt: !140)
!147 = !DILocation(line: 386, column: 10, scope: !133, inlinedAt: !140)
!148 = !DILocation(line: 386, column: 32, scope: !133, inlinedAt: !140)
!149 = !{!150, !150, i64 0}
!150 = !{!"int", !151, i64 0}
!151 = !{!"omnipotent char", !152, i64 0}
!152 = !{!"Simple C/C++ TBAA"}
!153 = !DILocation(line: 390, column: 10, scope: !133, inlinedAt: !140)
!154 = !DILocation(line: 390, column: 27, scope: !133, inlinedAt: !140)
!155 = !{!156, !150, i64 1344}
!156 = !{!"", !151, i64 0, !151, i64 1024, !157, i64 1280, !150, i64 1312, !150, i64 1316, !150, i64 1320, !150, i64 1324, !150, i64 1328, !150, i64 1332, !150, i64 1336, !150, i64 1340, !150, i64 1344}
!157 = !{!"", !158, i64 0, !150, i64 8, !150, i64 12, !150, i64 16, !150, i64 20, !150, i64 24, !150, i64 28}
!158 = !{!"any pointer", !151, i64 0}
!159 = !DILocation(line: 391, column: 10, scope: !133, inlinedAt: !140)
!160 = !DILocation(line: 391, column: 33, scope: !133, inlinedAt: !140)
!161 = !DILocation(line: 397, column: 23, scope: !133, inlinedAt: !140)
!162 = !DILocation(line: 397, column: 5, scope: !133, inlinedAt: !140)
!163 = !DILocation(line: 376, column: 9, scope: !133, inlinedAt: !140)
!164 = !DILocation(line: 403, column: 10, scope: !165, inlinedAt: !140)
!165 = distinct !DILexicalBlock(scope: !133, file: !3, line: 403, column: 5)
!166 = !DILocation(line: 0, scope: !133, inlinedAt: !140)
!167 = !DILocation(line: 403, column: 5, scope: !165, inlinedAt: !140)
!168 = !DILocation(line: 404, column: 9, scope: !169, inlinedAt: !140)
!169 = distinct !DILexicalBlock(scope: !165, file: !3, line: 403, column: 5)
!170 = !DILocation(line: 404, column: 26, scope: !169, inlinedAt: !140)
!171 = !{!151, !151, i64 0}
!172 = !DILocation(line: 403, column: 27, scope: !169, inlinedAt: !140)
!173 = !DILocation(line: 403, column: 5, scope: !169, inlinedAt: !140)
!174 = !DILocation(line: 403, column: 19, scope: !169, inlinedAt: !140)
!175 = distinct !{!175, !176, !177}
!176 = !DILocation(line: 403, column: 5, scope: !165)
!177 = !DILocation(line: 404, column: 28, scope: !165)
!178 = !DILocation(line: 407, column: 5, scope: !133, inlinedAt: !140)
!179 = !DILocation(line: 407, column: 24, scope: !133, inlinedAt: !140)
!180 = !DILocation(line: 408, column: 5, scope: !133, inlinedAt: !140)
!181 = !DILocation(line: 408, column: 24, scope: !133, inlinedAt: !140)
!182 = !DILocation(line: 409, column: 5, scope: !133, inlinedAt: !140)
!183 = !DILocation(line: 409, column: 24, scope: !133, inlinedAt: !140)
!184 = !DILocation(line: 410, column: 5, scope: !133, inlinedAt: !140)
!185 = !DILocation(line: 410, column: 24, scope: !133, inlinedAt: !140)
!186 = !DILocation(line: 411, column: 5, scope: !133, inlinedAt: !140)
!187 = !DILocation(line: 411, column: 24, scope: !133, inlinedAt: !140)
!188 = !DILocation(line: 412, column: 5, scope: !133, inlinedAt: !140)
!189 = !DILocation(line: 412, column: 24, scope: !133, inlinedAt: !140)
!190 = !DILocation(line: 413, column: 5, scope: !133, inlinedAt: !140)
!191 = !DILocation(line: 413, column: 25, scope: !133, inlinedAt: !140)
!192 = !DILocation(line: 414, column: 5, scope: !133, inlinedAt: !140)
!193 = !DILocation(line: 414, column: 24, scope: !133, inlinedAt: !140)
!194 = !DILocation(line: 415, column: 5, scope: !133, inlinedAt: !140)
!195 = !DILocation(line: 415, column: 25, scope: !133, inlinedAt: !140)
!196 = !DILocation(line: 416, column: 5, scope: !133, inlinedAt: !140)
!197 = !DILocation(line: 416, column: 25, scope: !133, inlinedAt: !140)
!198 = !DILocation(line: 417, column: 5, scope: !133, inlinedAt: !140)
!199 = !DILocation(line: 417, column: 25, scope: !133, inlinedAt: !140)
!200 = !DILocation(line: 420, column: 5, scope: !133, inlinedAt: !140)
!201 = !DILocation(line: 420, column: 24, scope: !133, inlinedAt: !140)
!202 = !DILocation(line: 421, column: 5, scope: !133, inlinedAt: !140)
!203 = !DILocation(line: 421, column: 24, scope: !133, inlinedAt: !140)
!204 = !DILocation(line: 422, column: 5, scope: !133, inlinedAt: !140)
!205 = !DILocation(line: 422, column: 24, scope: !133, inlinedAt: !140)
!206 = !DILocation(line: 423, column: 5, scope: !133, inlinedAt: !140)
!207 = !DILocation(line: 423, column: 24, scope: !133, inlinedAt: !140)
!208 = !DILocation(line: 424, column: 5, scope: !133, inlinedAt: !140)
!209 = !DILocation(line: 424, column: 24, scope: !133, inlinedAt: !140)
!210 = !DILocation(line: 425, column: 5, scope: !133, inlinedAt: !140)
!211 = !DILocation(line: 425, column: 24, scope: !133, inlinedAt: !140)
!212 = !DILocation(line: 426, column: 5, scope: !133, inlinedAt: !140)
!213 = !DILocation(line: 426, column: 24, scope: !133, inlinedAt: !140)
!214 = !DILocation(line: 427, column: 5, scope: !133, inlinedAt: !140)
!215 = !DILocation(line: 427, column: 24, scope: !133, inlinedAt: !140)
!216 = !DILocation(line: 428, column: 5, scope: !133, inlinedAt: !140)
!217 = !DILocation(line: 428, column: 24, scope: !133, inlinedAt: !140)
!218 = !DILocation(line: 429, column: 10, scope: !219, inlinedAt: !140)
!219 = distinct !DILexicalBlock(scope: !133, file: !3, line: 429, column: 5)
!220 = !DILocation(line: 429, column: 5, scope: !219, inlinedAt: !140)
!221 = !DILocation(line: 430, column: 9, scope: !222, inlinedAt: !140)
!222 = distinct !DILexicalBlock(scope: !219, file: !3, line: 429, column: 5)
!223 = !DILocation(line: 430, column: 32, scope: !222, inlinedAt: !140)
!224 = !DILocation(line: 429, column: 5, scope: !222, inlinedAt: !140)
!225 = !DILocation(line: 433, column: 10, scope: !226, inlinedAt: !140)
!226 = distinct !DILexicalBlock(scope: !133, file: !3, line: 433, column: 5)
!227 = !DILocation(line: 433, column: 5, scope: !226, inlinedAt: !140)
!228 = !DILocation(line: 434, column: 9, scope: !229, inlinedAt: !140)
!229 = distinct !DILexicalBlock(scope: !226, file: !3, line: 433, column: 5)
!230 = !DILocation(line: 434, column: 29, scope: !229, inlinedAt: !140)
!231 = !DILocation(line: 433, column: 27, scope: !229, inlinedAt: !140)
!232 = !DILocation(line: 433, column: 5, scope: !229, inlinedAt: !140)
!233 = !DILocation(line: 433, column: 19, scope: !229, inlinedAt: !140)
!234 = distinct !{!234, !235, !236}
!235 = !DILocation(line: 433, column: 5, scope: !226)
!236 = !DILocation(line: 434, column: 31, scope: !226)
!237 = !DILocation(line: 435, column: 5, scope: !133, inlinedAt: !140)
!238 = !DILocation(line: 435, column: 27, scope: !133, inlinedAt: !140)
!239 = !DILocation(line: 436, column: 5, scope: !133, inlinedAt: !140)
!240 = !DILocation(line: 436, column: 28, scope: !133, inlinedAt: !140)
!241 = !DILocation(line: 437, column: 5, scope: !133, inlinedAt: !140)
!242 = !DILocation(line: 437, column: 27, scope: !133, inlinedAt: !140)
!243 = !DILocation(line: 438, column: 5, scope: !133, inlinedAt: !140)
!244 = !DILocation(line: 438, column: 27, scope: !133, inlinedAt: !140)
!245 = !DILocation(line: 439, column: 5, scope: !133, inlinedAt: !140)
!246 = !DILocation(line: 439, column: 27, scope: !133, inlinedAt: !140)
!247 = !DILocation(line: 440, column: 5, scope: !133, inlinedAt: !140)
!248 = !DILocation(line: 440, column: 27, scope: !133, inlinedAt: !140)
!249 = !DILocation(line: 441, column: 5, scope: !133, inlinedAt: !140)
!250 = !DILocation(line: 441, column: 27, scope: !133, inlinedAt: !140)
!251 = !DILocation(line: 442, column: 5, scope: !133, inlinedAt: !140)
!252 = !DILocation(line: 442, column: 27, scope: !133, inlinedAt: !140)
!253 = !DILocation(line: 443, column: 5, scope: !133, inlinedAt: !140)
!254 = !DILocation(line: 443, column: 27, scope: !133, inlinedAt: !140)
!255 = !DILocation(line: 444, column: 1, scope: !133, inlinedAt: !140)
!256 = !DILocalVariable(name: "l", arg: 1, scope: !257, file: !3, line: 1300, type: !40)
!257 = distinct !DISubprogram(name: "luaL_setfuncs", scope: !3, file: !3, line: 1300, type: !258, isLocal: true, isDefinition: true, scopeLine: 1301, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !262)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !40, !260, !39}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!262 = !{!256, !263, !264, !265}
!263 = !DILocalVariable(name: "reg", arg: 2, scope: !257, file: !3, line: 1300, type: !260)
!264 = !DILocalVariable(name: "nup", arg: 3, scope: !257, file: !3, line: 1300, type: !39)
!265 = !DILocalVariable(name: "i", scope: !257, file: !3, line: 1302, type: !39)
!266 = !DILocation(line: 1300, column: 39, scope: !257, inlinedAt: !267)
!267 = distinct !DILocation(line: 1368, column: 5, scope: !112)
!268 = !DILocation(line: 1300, column: 58, scope: !257, inlinedAt: !267)
!269 = !DILocation(line: 1300, column: 67, scope: !257, inlinedAt: !267)
!270 = !DILocation(line: 1304, column: 5, scope: !257, inlinedAt: !267)
!271 = !DILocation(line: 1305, column: 5, scope: !257, inlinedAt: !267)
!272 = !DILocation(line: 1305, column: 17, scope: !273, inlinedAt: !267)
!273 = distinct !DILexicalBlock(scope: !274, file: !3, line: 1305, column: 5)
!274 = distinct !DILexicalBlock(scope: !257, file: !3, line: 1305, column: 5)
!275 = !{!276, !158, i64 0}
!276 = !{!"luaL_Reg", !158, i64 0, !158, i64 8}
!277 = !DILocation(line: 1305, column: 22, scope: !273, inlinedAt: !267)
!278 = !DILocation(line: 1305, column: 5, scope: !274, inlinedAt: !267)
!279 = !DILocation(line: 1302, column: 9, scope: !257, inlinedAt: !267)
!280 = !DILocation(line: 1306, column: 14, scope: !281, inlinedAt: !267)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 1306, column: 9)
!282 = distinct !DILexicalBlock(scope: !273, file: !3, line: 1305, column: 38)
!283 = !DILocation(line: 1306, column: 9, scope: !281, inlinedAt: !267)
!284 = !DILocation(line: 1307, column: 13, scope: !285, inlinedAt: !267)
!285 = distinct !DILexicalBlock(scope: !281, file: !3, line: 1306, column: 9)
!286 = !DILocation(line: 1306, column: 9, scope: !285, inlinedAt: !267)
!287 = !DILocation(line: 1308, column: 34, scope: !282, inlinedAt: !267)
!288 = !{!276, !158, i64 8}
!289 = !DILocation(line: 1308, column: 9, scope: !282, inlinedAt: !267)
!290 = !DILocation(line: 1309, column: 42, scope: !282, inlinedAt: !267)
!291 = !DILocation(line: 1309, column: 9, scope: !282, inlinedAt: !267)
!292 = !DILocation(line: 1305, column: 34, scope: !273, inlinedAt: !267)
!293 = !DILocation(line: 1305, column: 5, scope: !273, inlinedAt: !267)
!294 = distinct !{!294, !295, !296}
!295 = !DILocation(line: 1305, column: 5, scope: !274)
!296 = !DILocation(line: 1310, column: 5, scope: !274)
!297 = !DILocation(line: 1311, column: 5, scope: !257, inlinedAt: !267)
!298 = !DILocation(line: 1312, column: 1, scope: !257, inlinedAt: !267)
!299 = !DILocation(line: 1371, column: 5, scope: !112)
!300 = !DILocation(line: 1372, column: 5, scope: !112)
!301 = !DILocation(line: 1375, column: 5, scope: !112)
!302 = !DILocation(line: 1376, column: 5, scope: !112)
!303 = !DILocation(line: 1377, column: 5, scope: !112)
!304 = !DILocation(line: 1378, column: 5, scope: !112)
!305 = !DILocation(line: 1381, column: 1, scope: !112)
!306 = !DILocation(line: 1380, column: 5, scope: !112)
!307 = distinct !DISubprogram(name: "luaopen_cjson_safe", scope: !3, file: !3, line: 1418, type: !58, isLocal: false, isDefinition: true, scopeLine: 1419, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !308)
!308 = !{!309}
!309 = !DILocalVariable(name: "l", arg: 1, scope: !307, file: !3, line: 1418, type: !40)
!310 = !DILocation(line: 1418, column: 35, scope: !307)
!311 = !DILocation(line: 1420, column: 5, scope: !307)
!312 = !DILocation(line: 1423, column: 5, scope: !307)
!313 = distinct !DISubprogram(name: "lua_cjson_safe_new", scope: !3, file: !3, line: 1384, type: !58, isLocal: true, isDefinition: true, scopeLine: 1385, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !314)
!314 = !{!315, !316, !317}
!315 = !DILocalVariable(name: "l", arg: 1, scope: !313, file: !3, line: 1384, type: !40)
!316 = !DILocalVariable(name: "func", scope: !313, file: !3, line: 1386, type: !52)
!317 = !DILocalVariable(name: "i", scope: !313, file: !3, line: 1387, type: !39)
!318 = !DILocation(line: 1384, column: 42, scope: !313)
!319 = !DILocation(line: 1389, column: 5, scope: !313)
!320 = !DILocation(line: 1392, column: 5, scope: !313)
!321 = !DILocation(line: 1393, column: 5, scope: !313)
!322 = !DILocation(line: 1387, column: 9, scope: !313)
!323 = !DILocation(line: 1395, column: 10, scope: !324)
!324 = distinct !DILexicalBlock(scope: !313, file: !3, line: 1395, column: 5)
!325 = !DILocation(line: 1395, column: 5, scope: !324)
!326 = !DILocation(line: 1396, column: 9, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !3, line: 1395, column: 31)
!328 = distinct !DILexicalBlock(scope: !324, file: !3, line: 1395, column: 5)
!329 = !DILocation(line: 1397, column: 9, scope: !327)
!330 = !DILocation(line: 1398, column: 9, scope: !327)
!331 = !DILocation(line: 1395, column: 5, scope: !328)
!332 = !DILocation(line: 1401, column: 5, scope: !313)
!333 = distinct !DISubprogram(name: "json_encode", scope: !3, file: !3, line: 703, type: !58, isLocal: true, isDefinition: true, scopeLine: 704, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !334)
!334 = !{!335, !336, !337, !338, !340, !341}
!335 = !DILocalVariable(name: "l", arg: 1, scope: !333, file: !3, line: 703, type: !40)
!336 = !DILocalVariable(name: "cfg", scope: !333, file: !3, line: 705, type: !63)
!337 = !DILocalVariable(name: "local_encode_buf", scope: !333, file: !3, line: 706, type: !75)
!338 = !DILocalVariable(name: "encode_buf", scope: !333, file: !3, line: 707, type: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!340 = !DILocalVariable(name: "json", scope: !333, file: !3, line: 708, type: !80)
!341 = !DILocalVariable(name: "len", scope: !333, file: !3, line: 709, type: !39)
!342 = !DILocation(line: 703, column: 35, scope: !333)
!343 = !DILocalVariable(name: "l", arg: 1, scope: !344, file: !3, line: 194, type: !40)
!344 = distinct !DISubprogram(name: "json_fetch_config", scope: !3, file: !3, line: 194, type: !345, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{!63, !40}
!347 = !{!343, !348}
!348 = !DILocalVariable(name: "cfg", scope: !344, file: !3, line: 196, type: !63)
!349 = !DILocation(line: 194, column: 52, scope: !344, inlinedAt: !350)
!350 = distinct !DILocation(line: 705, column: 26, scope: !333)
!351 = !DILocation(line: 198, column: 11, scope: !344, inlinedAt: !350)
!352 = !DILocation(line: 196, column: 20, scope: !344, inlinedAt: !350)
!353 = !DILocation(line: 199, column: 10, scope: !354, inlinedAt: !350)
!354 = distinct !DILexicalBlock(scope: !344, file: !3, line: 199, column: 9)
!355 = !DILocation(line: 199, column: 9, scope: !344, inlinedAt: !350)
!356 = !DILocation(line: 200, column: 9, scope: !354, inlinedAt: !350)
!357 = !DILocation(line: 202, column: 5, scope: !344, inlinedAt: !350)
!358 = !DILocation(line: 705, column: 20, scope: !333)
!359 = !DILocation(line: 706, column: 5, scope: !333)
!360 = !DILocation(line: 711, column: 5, scope: !333)
!361 = !DILocation(line: 713, column: 15, scope: !362)
!362 = distinct !DILexicalBlock(scope: !333, file: !3, line: 713, column: 9)
!363 = !{!156, !150, i64 1336}
!364 = !DILocation(line: 713, column: 10, scope: !362)
!365 = !DILocation(line: 713, column: 9, scope: !333)
!366 = !DILocation(line: 707, column: 15, scope: !333)
!367 = !DILocation(line: 706, column: 14, scope: !333)
!368 = !DILocation(line: 716, column: 9, scope: !369)
!369 = distinct !DILexicalBlock(scope: !362, file: !3, line: 713, column: 35)
!370 = !DILocation(line: 717, column: 5, scope: !369)
!371 = !DILocation(line: 719, column: 28, scope: !372)
!372 = distinct !DILexicalBlock(scope: !362, file: !3, line: 717, column: 12)
!373 = !DILocalVariable(name: "s", arg: 1, scope: !374, file: !76, line: 78, type: !339)
!374 = distinct !DISubprogram(name: "strbuf_reset", scope: !76, file: !76, line: 78, type: !375, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !339}
!377 = !{!373}
!378 = !DILocation(line: 78, column: 43, scope: !374, inlinedAt: !379)
!379 = distinct !DILocation(line: 720, column: 9, scope: !372)
!380 = !DILocation(line: 80, column: 8, scope: !374, inlinedAt: !379)
!381 = !DILocation(line: 80, column: 15, scope: !374, inlinedAt: !379)
!382 = !{!157, !150, i64 12}
!383 = !DILocation(line: 81, column: 1, scope: !374, inlinedAt: !379)
!384 = !DILocation(line: 0, scope: !369)
!385 = !DILocation(line: 723, column: 5, scope: !333)
!386 = !DILocalVariable(name: "s", arg: 1, scope: !387, file: !76, line: 145, type: !339)
!387 = distinct !DISubprogram(name: "strbuf_string", scope: !76, file: !76, line: 145, type: !388, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !390)
!388 = !DISubroutineType(types: !389)
!389 = !{!80, !339, !44}
!390 = !{!386, !391}
!391 = !DILocalVariable(name: "len", arg: 2, scope: !387, file: !76, line: 145, type: !44)
!392 = !DILocation(line: 145, column: 45, scope: !387, inlinedAt: !393)
!393 = distinct !DILocation(line: 724, column: 12, scope: !333)
!394 = !DILocation(line: 147, column: 9, scope: !387, inlinedAt: !393)
!395 = !DILocation(line: 148, column: 19, scope: !396, inlinedAt: !393)
!396 = distinct !DILexicalBlock(scope: !387, file: !76, line: 147, column: 9)
!397 = !DILocation(line: 148, column: 9, scope: !396, inlinedAt: !393)
!398 = !DILocation(line: 150, column: 15, scope: !387, inlinedAt: !393)
!399 = !{!157, !158, i64 0}
!400 = !DILocation(line: 150, column: 5, scope: !387, inlinedAt: !393)
!401 = !DILocation(line: 708, column: 11, scope: !333)
!402 = !DILocation(line: 709, column: 9, scope: !333)
!403 = !DILocation(line: 726, column: 30, scope: !333)
!404 = !DILocation(line: 726, column: 5, scope: !333)
!405 = !DILocation(line: 728, column: 15, scope: !406)
!406 = distinct !DILexicalBlock(scope: !333, file: !3, line: 728, column: 9)
!407 = !DILocation(line: 728, column: 10, scope: !406)
!408 = !DILocation(line: 728, column: 9, scope: !333)
!409 = !DILocation(line: 729, column: 9, scope: !406)
!410 = !DILocation(line: 732, column: 1, scope: !333)
!411 = !DILocation(line: 731, column: 5, scope: !333)
!412 = distinct !DISubprogram(name: "json_decode", scope: !3, file: !3, line: 1253, type: !58, isLocal: true, isDefinition: true, scopeLine: 1254, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !413)
!413 = !{!414, !415, !424, !438}
!414 = !DILocalVariable(name: "l", arg: 1, scope: !412, file: !3, line: 1253, type: !40)
!415 = !DILocalVariable(name: "json", scope: !412, file: !3, line: 1255, type: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_parse_t", file: !3, line: 140, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 134, size: 320, elements: !418)
!418 = !{!419, !420, !421, !422, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !417, file: !3, line: 135, baseType: !29, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !417, file: !3, line: 136, baseType: !29, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !417, file: !3, line: 137, baseType: !339, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !417, file: !3, line: 138, baseType: !63, size: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "current_depth", scope: !417, file: !3, line: 139, baseType: !39, size: 32, offset: 256)
!424 = !DILocalVariable(name: "token", scope: !412, file: !3, line: 1256, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_token_t", file: !3, line: 151, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 142, size: 192, elements: !427)
!427 = !{!428, !429, !430, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !3, line: 143, baseType: !69, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !426, file: !3, line: 144, baseType: !39, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !426, file: !3, line: 149, baseType: !431, size: 64, offset: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !3, line: 145, size: 64, elements: !432)
!432 = !{!433, !434, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !431, file: !3, line: 146, baseType: !29, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !431, file: !3, line: 147, baseType: !435, size: 64)
!435 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !431, file: !3, line: 148, baseType: !39, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "string_len", scope: !426, file: !3, line: 150, baseType: !39, size: 32, offset: 128)
!438 = !DILocalVariable(name: "json_len", scope: !412, file: !3, line: 1257, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 40, baseType: !441)
!440 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !442, line: 129, baseType: !443)
!442 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!443 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!444 = !DILocation(line: 1253, column: 35, scope: !412)
!445 = !DILocation(line: 1255, column: 5, scope: !412)
!446 = !DILocation(line: 1256, column: 5, scope: !412)
!447 = !DILocation(line: 1257, column: 5, scope: !412)
!448 = !DILocation(line: 1259, column: 5, scope: !412)
!449 = !DILocation(line: 194, column: 52, scope: !344, inlinedAt: !450)
!450 = distinct !DILocation(line: 1261, column: 16, scope: !412)
!451 = !DILocation(line: 198, column: 11, scope: !344, inlinedAt: !450)
!452 = !DILocation(line: 196, column: 20, scope: !344, inlinedAt: !450)
!453 = !DILocation(line: 199, column: 10, scope: !354, inlinedAt: !450)
!454 = !DILocation(line: 199, column: 9, scope: !344, inlinedAt: !450)
!455 = !DILocation(line: 200, column: 9, scope: !354, inlinedAt: !450)
!456 = !DILocation(line: 202, column: 5, scope: !344, inlinedAt: !450)
!457 = !DILocation(line: 1261, column: 10, scope: !412)
!458 = !DILocation(line: 1261, column: 14, scope: !412)
!459 = !{!460, !158, i64 24}
!460 = !{!"", !158, i64 0, !158, i64 8, !158, i64 16, !158, i64 24, !150, i64 32}
!461 = !DILocation(line: 1257, column: 12, scope: !412)
!462 = !DILocation(line: 1262, column: 17, scope: !412)
!463 = !DILocation(line: 1262, column: 10, scope: !412)
!464 = !DILocation(line: 1262, column: 15, scope: !412)
!465 = !{!460, !158, i64 0}
!466 = !DILocation(line: 1263, column: 10, scope: !412)
!467 = !DILocation(line: 1263, column: 24, scope: !412)
!468 = !{!460, !150, i64 32}
!469 = !DILocation(line: 1264, column: 21, scope: !412)
!470 = !DILocation(line: 1264, column: 10, scope: !412)
!471 = !DILocation(line: 1264, column: 14, scope: !412)
!472 = !{!460, !158, i64 8}
!473 = !DILocation(line: 1271, column: 9, scope: !474)
!474 = distinct !DILexicalBlock(scope: !412, file: !3, line: 1271, column: 9)
!475 = !{!476, !476, i64 0}
!476 = !{!"long", !151, i64 0}
!477 = !DILocation(line: 1271, column: 18, scope: !474)
!478 = !DILocation(line: 1271, column: 23, scope: !474)
!479 = !DILocation(line: 1271, column: 28, scope: !474)
!480 = !DILocation(line: 1271, column: 41, scope: !474)
!481 = !DILocation(line: 1271, column: 45, scope: !474)
!482 = !DILocation(line: 1271, column: 9, scope: !412)
!483 = !DILocation(line: 1272, column: 9, scope: !474)
!484 = !DILocation(line: 1277, column: 27, scope: !412)
!485 = !DILocation(line: 1277, column: 16, scope: !412)
!486 = !DILocation(line: 1277, column: 10, scope: !412)
!487 = !DILocation(line: 1277, column: 14, scope: !412)
!488 = !{!460, !158, i64 16}
!489 = !DILocation(line: 1255, column: 18, scope: !412)
!490 = !DILocation(line: 1256, column: 18, scope: !412)
!491 = !DILocation(line: 1279, column: 5, scope: !412)
!492 = !DILocation(line: 1280, column: 5, scope: !412)
!493 = !DILocation(line: 1283, column: 5, scope: !412)
!494 = !DILocation(line: 1285, column: 15, scope: !495)
!495 = distinct !DILexicalBlock(scope: !412, file: !3, line: 1285, column: 9)
!496 = !{!497, !151, i64 0}
!497 = !{!"", !151, i64 0, !150, i64 4, !151, i64 8, !150, i64 16}
!498 = !DILocation(line: 1285, column: 20, scope: !495)
!499 = !DILocation(line: 1285, column: 9, scope: !412)
