; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lundump.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lundump.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Proto = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, i32*, %struct.Proto**, i32*, %struct.LocVar*, %union.TString**, %union.TString*, i32, i32, i32, i32, i32, i32, i32, i32, %union.GCObject*, i8, i8, i8, i8 }
%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%struct.LocVar = type { %union.TString*, i32, i32 }
%union.TString = type { %struct.anon }
%struct.anon = type { %union.GCObject*, i8, i8, i8, i32, i64 }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lundump.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !9, !85, !34, !21, !303, !47, !73, !338, !307, !341, !316}
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !7, line: 99, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !11, line: 36, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !13, line: 136, size: 1472, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !25, !52, !110, !334, !335, !336, !337}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !12, file: !13, line: 137, baseType: !16, size: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !11, line: 51, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !11, line: 49, size: 128, elements: !18)
!18 = !{!19, !20, !24}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !11, line: 50, baseType: !9, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !17, file: !11, line: 50, baseType: !21, size: 8, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !17, file: !11, line: 50, baseType: !21, size: 8, offset: 72)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !12, file: !13, line: 138, baseType: !26, size: 192)
!26 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !11, line: 199, size: 192, elements: !27)
!27 = !{!28, !37}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !26, file: !11, line: 200, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !22, line: 47, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 47, size: 64, elements: !31)
!31 = !{!32, !33, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !30, file: !22, line: 47, baseType: !8, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !30, file: !22, line: 47, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !30, file: !22, line: 47, baseType: !36, size: 64)
!36 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !26, file: !11, line: 206, baseType: !38, size: 192)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !11, line: 201, size: 192, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !46}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !11, line: 202, baseType: !9, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !38, file: !11, line: 202, baseType: !21, size: 8, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !38, file: !11, line: 202, baseType: !21, size: 8, offset: 72)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !38, file: !11, line: 203, baseType: !21, size: 8, offset: 80)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !38, file: !11, line: 204, baseType: !45, size: 32, offset: 96)
!45 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, file: !11, line: 205, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 40, baseType: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !50, line: 129, baseType: !51)
!50 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !12, file: !13, line: 139, baseType: !53, size: 320)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !11, line: 215, size: 320, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !53, file: !11, line: 216, baseType: !29, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !53, file: !11, line: 222, baseType: !57, size: 320)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !11, line: 217, size: 320, elements: !58)
!58 = !{!59, !60, !61, !62, !108, !109}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !11, line: 218, baseType: !9, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !57, file: !11, line: 218, baseType: !21, size: 8, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !57, file: !11, line: 218, baseType: !21, size: 8, offset: 72)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !57, file: !11, line: 219, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !11, line: 338, size: 512, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !87, !105, !106, !107}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !11, line: 339, baseType: !9, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !64, file: !11, line: 339, baseType: !21, size: 8, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !64, file: !11, line: 339, baseType: !21, size: 8, offset: 72)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !11, line: 340, baseType: !21, size: 8, offset: 80)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !64, file: !11, line: 341, baseType: !21, size: 8, offset: 88)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !64, file: !11, line: 342, baseType: !63, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !64, file: !11, line: 343, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !11, line: 75, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !11, line: 73, size: 128, elements: !76)
!76 = !{!77, !86}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !75, file: !11, line: 74, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !11, line: 64, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !11, line: 59, size: 64, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !79, file: !11, line: 60, baseType: !9, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !79, file: !11, line: 61, baseType: !34, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !79, file: !11, line: 62, baseType: !6, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !79, file: !11, line: 63, baseType: !85, size: 32)
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !75, file: !11, line: 74, baseType: !85, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !64, file: !11, line: 344, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !11, line: 335, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !11, line: 332, size: 320, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !90, file: !11, line: 333, baseType: !74, size: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !90, file: !11, line: 334, baseType: !94, size: 192, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !11, line: 329, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !11, line: 323, size: 192, elements: !96)
!96 = !{!97, !104}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !95, file: !11, line: 327, baseType: !98, size: 192)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !95, file: !11, line: 324, size: 192, elements: !99)
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !11, line: 325, baseType: !78, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !98, file: !11, line: 325, baseType: !85, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !11, line: 326, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !95, file: !11, line: 328, baseType: !74, size: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !64, file: !11, line: 345, baseType: !88, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !64, file: !11, line: 346, baseType: !9, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !64, file: !11, line: 347, baseType: !85, size: 32, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !57, file: !11, line: 220, baseType: !63, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !57, file: !11, line: 221, baseType: !47, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !12, file: !13, line: 140, baseType: !111, size: 448)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !11, line: 309, size: 448, elements: !112)
!112 = !{!113, !283}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !111, file: !11, line: 310, baseType: !114, size: 448)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !11, line: 299, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !11, line: 295, size: 448, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !279}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !11, line: 296, baseType: !9, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !115, file: !11, line: 296, baseType: !21, size: 8, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !115, file: !11, line: 296, baseType: !21, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !115, file: !11, line: 296, baseType: !21, size: 8, offset: 80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !115, file: !11, line: 296, baseType: !21, size: 8, offset: 88)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !115, file: !11, line: 296, baseType: !9, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !115, file: !11, line: 296, baseType: !63, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !115, file: !11, line: 297, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !7, line: 52, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!85, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !7, line: 50, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !13, line: 100, size: 1472, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !139, !140, !216, !230, !231, !232, !233, !234, !235, !236, !237, !239, !240, !241, !242, !243, !244, !269, !270, !271, !272, !273, !276}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !13, line: 101, baseType: !9, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !131, file: !13, line: 101, baseType: !21, size: 8, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !131, file: !13, line: 101, baseType: !21, size: 8, offset: 72)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !131, file: !13, line: 102, baseType: !21, size: 8, offset: 80)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !131, file: !13, line: 103, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !11, line: 193, baseType: !73)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !131, file: !13, line: 104, baseType: !138, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !131, file: !13, line: 105, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !13, line: 94, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !13, line: 68, size: 3456, elements: !144)
!144 = !{!145, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !177, !179, !180, !181, !182, !183, !184, !185, !186, !188, !206, !210}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !143, file: !13, line: 69, baseType: !146, size: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !13, line: 42, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !13, line: 38, size: 128, elements: !148)
!148 = !{!149, !151, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !147, file: !13, line: 39, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !147, file: !13, line: 40, baseType: !152, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !22, line: 18, baseType: !45)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !147, file: !13, line: 41, baseType: !85, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !143, file: !13, line: 70, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !7, line: 66, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!34, !34, !34, !47, !47}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !143, file: !13, line: 71, baseType: !34, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !143, file: !13, line: 72, baseType: !21, size: 8, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !143, file: !13, line: 73, baseType: !21, size: 8, offset: 264)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !143, file: !13, line: 74, baseType: !85, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !143, file: !13, line: 75, baseType: !9, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !143, file: !13, line: 76, baseType: !150, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !143, file: !13, line: 77, baseType: !9, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !143, file: !13, line: 78, baseType: !9, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !143, file: !13, line: 79, baseType: !9, size: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !143, file: !13, line: 80, baseType: !9, size: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !143, file: !13, line: 81, baseType: !170, size: 192, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !171, line: 28, baseType: !172)
!171 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !171, line: 24, size: 192, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !172, file: !171, line: 25, baseType: !5, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !172, file: !171, line: 26, baseType: !47, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !172, file: !171, line: 27, baseType: !47, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !143, file: !13, line: 82, baseType: !178, size: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !22, line: 20, baseType: !47)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !143, file: !13, line: 83, baseType: !178, size: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !143, file: !13, line: 84, baseType: !178, size: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !143, file: !13, line: 85, baseType: !178, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !143, file: !13, line: 86, baseType: !85, size: 32, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !143, file: !13, line: 87, baseType: !85, size: 32, offset: 1184)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !143, file: !13, line: 88, baseType: !125, size: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !143, file: !13, line: 89, baseType: !74, size: 128, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !143, file: !13, line: 90, baseType: !187, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !143, file: !13, line: 91, baseType: !189, size: 320, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !11, line: 284, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !11, line: 274, size: 320, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !11, line: 275, baseType: !9, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !190, file: !11, line: 275, baseType: !21, size: 8, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !190, file: !11, line: 275, baseType: !21, size: 8, offset: 72)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !190, file: !11, line: 276, baseType: !73, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !190, file: !11, line: 283, baseType: !197, size: 128, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !190, file: !11, line: 277, size: 128, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !11, line: 278, baseType: !74, size: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !197, file: !11, line: 282, baseType: !201, size: 128)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !11, line: 279, size: 128, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !11, line: 280, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !11, line: 281, baseType: !204, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !143, file: !13, line: 92, baseType: !207, size: 576, offset: 1792)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 576, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 9)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !143, file: !13, line: 93, baseType: !211, size: 1088, offset: 2368)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 1088, elements: !214)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !11, line: 207, baseType: !26)
!214 = !{!215}
!215 = !DISubrange(count: 17)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !131, file: !13, line: 106, baseType: !217, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !13, line: 55, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !13, line: 48, size: 320, elements: !220)
!220 = !{!221, !222, !223, !224, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !219, file: !13, line: 49, baseType: !138, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !219, file: !13, line: 50, baseType: !138, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !219, file: !13, line: 51, baseType: !138, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !219, file: !13, line: 52, baseType: !225, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !22, line: 88, baseType: !152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !219, file: !13, line: 53, baseType: !85, size: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !219, file: !13, line: 54, baseType: !85, size: 32, offset: 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !131, file: !13, line: 107, baseType: !225, size: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !131, file: !13, line: 108, baseType: !138, size: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !131, file: !13, line: 109, baseType: !138, size: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !131, file: !13, line: 110, baseType: !217, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !131, file: !13, line: 111, baseType: !217, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !131, file: !13, line: 112, baseType: !85, size: 32, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !131, file: !13, line: 113, baseType: !85, size: 32, offset: 736)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !131, file: !13, line: 114, baseType: !238, size: 16, offset: 768)
!238 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !131, file: !13, line: 115, baseType: !238, size: 16, offset: 784)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !131, file: !13, line: 116, baseType: !21, size: 8, offset: 800)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !131, file: !13, line: 117, baseType: !21, size: 8, offset: 808)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !131, file: !13, line: 118, baseType: !85, size: 32, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !131, file: !13, line: 119, baseType: !85, size: 32, offset: 864)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !131, file: !13, line: 120, baseType: !245, size: 64, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !7, line: 330, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !129, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !7, line: 326, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !7, line: 346, size: 960, elements: !252)
!252 = !{!253, !254, !257, !258, !259, !260, !261, !262, !263, !264, !268}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !251, file: !7, line: 347, baseType: !85, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !7, line: 348, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !251, file: !7, line: 349, baseType: !255, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !251, file: !7, line: 350, baseType: !255, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !251, file: !7, line: 351, baseType: !255, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !251, file: !7, line: 352, baseType: !85, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !251, file: !7, line: 353, baseType: !85, size: 32, offset: 352)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !251, file: !7, line: 354, baseType: !85, size: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !251, file: !7, line: 355, baseType: !85, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !251, file: !7, line: 356, baseType: !265, size: 480, offset: 448)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 60)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !251, file: !7, line: 358, baseType: !85, size: 32, offset: 928)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !131, file: !13, line: 121, baseType: !74, size: 128, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !131, file: !13, line: 122, baseType: !74, size: 128, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !131, file: !13, line: 123, baseType: !9, size: 64, offset: 1216)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !131, file: !13, line: 124, baseType: !9, size: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !131, file: !13, line: 125, baseType: !274, size: 64, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !13, line: 18, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !131, file: !13, line: 126, baseType: !277, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !278, line: 49, baseType: !36)
!278 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !115, file: !11, line: 298, baseType: !280, size: 128, offset: 320)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 1)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !111, file: !11, line: 311, baseType: !284, size: 384)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !11, line: 306, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !11, line: 302, size: 384, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !331}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !11, line: 303, baseType: !9, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !285, file: !11, line: 303, baseType: !21, size: 8, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !285, file: !11, line: 303, baseType: !21, size: 8, offset: 72)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !285, file: !11, line: 303, baseType: !21, size: 8, offset: 80)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !285, file: !11, line: 303, baseType: !21, size: 8, offset: 88)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !285, file: !11, line: 303, baseType: !9, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !285, file: !11, line: 303, baseType: !63, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !285, file: !11, line: 304, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !11, line: 231, size: 960, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !304, !306, !308, !315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !11, line: 232, baseType: !9, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !296, file: !11, line: 232, baseType: !21, size: 8, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !296, file: !11, line: 232, baseType: !21, size: 8, offset: 72)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !296, file: !11, line: 233, baseType: !73, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !296, file: !11, line: 234, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !296, file: !11, line: 235, baseType: !305, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !296, file: !11, line: 236, baseType: !307, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !296, file: !11, line: 237, baseType: !309, size: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !11, line: 262, size: 128, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !310, file: !11, line: 263, baseType: !212, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !310, file: !11, line: 264, baseType: !85, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !310, file: !11, line: 265, baseType: !85, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !296, file: !11, line: 238, baseType: !316, size: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !296, file: !11, line: 239, baseType: !212, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !296, file: !11, line: 240, baseType: !85, size: 32, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !296, file: !11, line: 241, baseType: !85, size: 32, offset: 608)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !296, file: !11, line: 242, baseType: !85, size: 32, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !296, file: !11, line: 243, baseType: !85, size: 32, offset: 672)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !296, file: !11, line: 244, baseType: !85, size: 32, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !296, file: !11, line: 245, baseType: !85, size: 32, offset: 736)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !296, file: !11, line: 246, baseType: !85, size: 32, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !296, file: !11, line: 247, baseType: !85, size: 32, offset: 800)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !296, file: !11, line: 248, baseType: !9, size: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !296, file: !11, line: 249, baseType: !21, size: 8, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !296, file: !11, line: 250, baseType: !21, size: 8, offset: 904)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !296, file: !11, line: 251, baseType: !21, size: 8, offset: 912)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !296, file: !11, line: 252, baseType: !21, size: 8, offset: 920)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !285, file: !11, line: 305, baseType: !332, size: 64, offset: 320)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 64, elements: !281)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !12, file: !13, line: 141, baseType: !64, size: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !12, file: !13, line: 142, baseType: !296, size: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !12, file: !13, line: 143, baseType: !190, size: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !12, file: !13, line: 144, baseType: !131, size: 1472)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Proto", file: !11, line: 253, baseType: !296)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "LocVar", file: !11, line: 266, baseType: !310)
!343 = !{i32 2, !"Dwarf Version", i32 4}
!344 = !{i32 2, !"Debug Info Version", i32 3}
!345 = !{i32 1, !"wchar_size", i32 4}
!346 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!347 = distinct !DISubprogram(name: "luaU_undump", scope: !1, file: !1, line: 195, type: !348, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !365)
!348 = !DISubroutineType(types: !349)
!349 = !{!339, !129, !350, !364, !255}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZIO", file: !171, line: 18, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Zio", file: !171, line: 56, size: 320, elements: !353)
!353 = !{!354, !355, !356, !362, !363}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !352, file: !171, line: 57, baseType: !47, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !352, file: !171, line: 58, baseType: !255, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !352, file: !171, line: 59, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Reader", file: !7, line: 58, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!255, !129, !34, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !171, line: 60, baseType: !34, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !352, file: !171, line: 61, baseType: !129, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DILocalVariable(name: "L", arg: 1, scope: !347, file: !1, line: 195, type: !129)
!367 = !DILocalVariable(name: "Z", arg: 2, scope: !347, file: !1, line: 195, type: !350)
!368 = !DILocalVariable(name: "buff", arg: 3, scope: !347, file: !1, line: 195, type: !364)
!369 = !DILocalVariable(name: "name", arg: 4, scope: !347, file: !1, line: 195, type: !255)
!370 = !DILocalVariable(name: "S", scope: !347, file: !1, line: 197, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadState", file: !1, line: 28, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 23, size: 256, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !372, file: !1, line: 24, baseType: !129, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !372, file: !1, line: 25, baseType: !350, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !372, file: !1, line: 26, baseType: !364, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !1, line: 27, baseType: !255, size: 64, offset: 192)
!378 = !DILocalVariable(name: "h", scope: !379, file: !1, line: 185, type: !386)
!379 = distinct !DISubprogram(name: "LoadHeader", scope: !1, file: !1, line: 183, type: !380, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !383)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!383 = !{!384, !378, !385}
!384 = !DILocalVariable(name: "S", arg: 1, scope: !379, file: !1, line: 183, type: !382)
!385 = !DILocalVariable(name: "s", scope: !379, file: !1, line: 186, type: !386)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 12)
!389 = !DILocation(line: 185, column: 7, scope: !379, inlinedAt: !390)
!390 = distinct !DILocation(line: 207, column: 2, scope: !347)
!391 = !DILocation(line: 186, column: 7, scope: !379, inlinedAt: !390)
!392 = !DILocation(line: 195, column: 32, scope: !347)
!393 = !DILocation(line: 195, column: 40, scope: !347)
!394 = !DILocation(line: 195, column: 52, scope: !347)
!395 = !DILocation(line: 195, column: 70, scope: !347)
!396 = !DILocation(line: 197, column: 2, scope: !347)
!397 = !DILocation(line: 198, column: 6, scope: !398)
!398 = distinct !DILexicalBlock(scope: !347, file: !1, line: 198, column: 6)
!399 = !{!400, !400, i64 0}
!400 = !{!"omnipotent char", !401, i64 0}
!401 = !{!"Simple C/C++ TBAA"}
!402 = !DILocation(line: 198, column: 11, scope: !398)
!403 = !DILocation(line: 198, column: 17, scope: !398)
!404 = !DILocation(line: 198, column: 25, scope: !398)
!405 = !DILocation(line: 198, column: 6, scope: !347)
!406 = !DILocation(line: 199, column: 14, scope: !398)
!407 = !DILocation(line: 199, column: 5, scope: !398)
!408 = !DILocation(line: 199, column: 9, scope: !398)
!409 = !{!410, !411, i64 24}
!410 = !{!"", !411, i64 0, !411, i64 8, !411, i64 16, !411, i64 24}
!411 = !{!"any pointer", !400, i64 0}
!412 = !DILocation(line: 199, column: 3, scope: !398)
!413 = !DILocation(line: 200, column: 16, scope: !414)
!414 = distinct !DILexicalBlock(scope: !398, file: !1, line: 200, column: 11)
!415 = !DILocation(line: 200, column: 11, scope: !398)
!416 = !DILocation(line: 0, scope: !414)
!417 = !DILocation(line: 201, column: 9, scope: !414)
!418 = !DILocation(line: 201, column: 3, scope: !414)
!419 = !DILocation(line: 203, column: 9, scope: !414)
!420 = !DILocation(line: 204, column: 4, scope: !347)
!421 = !DILocation(line: 204, column: 5, scope: !347)
!422 = !{!410, !411, i64 0}
!423 = !DILocation(line: 205, column: 4, scope: !347)
!424 = !DILocation(line: 205, column: 5, scope: !347)
!425 = !{!410, !411, i64 8}
!426 = !DILocation(line: 206, column: 4, scope: !347)
!427 = !DILocation(line: 206, column: 5, scope: !347)
!428 = !{!410, !411, i64 16}
!429 = !DILocation(line: 197, column: 12, scope: !347)
!430 = !DILocation(line: 183, column: 35, scope: !379, inlinedAt: !390)
!431 = !DILocation(line: 185, column: 2, scope: !379, inlinedAt: !390)
!432 = !DILocation(line: 186, column: 2, scope: !379, inlinedAt: !390)
!433 = !DILocalVariable(name: "h", arg: 1, scope: !434, file: !1, line: 214, type: !5)
!434 = distinct !DISubprogram(name: "luaU_header", scope: !1, file: !1, line: 214, type: !435, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !5}
!437 = !{!433, !438}
!438 = !DILocalVariable(name: "x", scope: !434, file: !1, line: 216, type: !85)
!439 = !DILocation(line: 214, column: 25, scope: !434, inlinedAt: !440)
!440 = distinct !DILocation(line: 187, column: 2, scope: !379, inlinedAt: !390)
!441 = !DILocation(line: 216, column: 6, scope: !434, inlinedAt: !440)
!442 = !DILocation(line: 217, column: 2, scope: !434, inlinedAt: !440)
