; ModuleID = '/root/.unikraft/libs/lwip/mailbox.c'
source_filename = "/root/.unikraft/libs/lwip/mailbox.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.sys_mbox_t = type { %struct.uk_alloc*, %struct.uk_mbox*, i32 }
%struct.uk_mbox = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [23 x i8] c"Assertion failure: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"mbox\00", align 1
@flexos_shared_alloc = external dso_local local_unnamed_addr global %struct.uk_alloc*, align 8
@.str.2 = private unnamed_addr constant [8 x i8] c"mbox->a\00", align 1
@_intrstack_start = external dso_local global [0 x i8], align 1
@_end = external dso_local global [0 x i8], align 1
@tsb_comp1 = external dso_local global [32 x %struct.uk_thread_status_block], align 16
@tsb_comp0 = external dso_local global [32 x %struct.uk_thread_status_block], align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 90, type: !129, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "sys_mbox_post", scope: !3, file: !3, line: 85, type: !4, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !82, retainedNodes: !164)
!3 = !DIFile(filename: "/root/.unikraft/libs/lwip/mailbox.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !21}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_mbox_t", file: !8, line: 78, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/sys_arch.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 74, size: 192, elements: !10)
!10 = !{!11, !77, !81}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !9, file: !8, line: 75, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !14, line: 77, size: 832, elements: !15)
!14 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !{!16, !25, !30, !35, !42, !44, !49, !50, !51, !56, !61, !66, !67, !68}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !13, file: !14, line: 79, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !14, line: 54, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !12, !22}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 58, baseType: !24)
!23 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !13, file: !14, line: 80, baseType: !26, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !14, line: 56, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!21, !12, !22, !22}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !13, file: !14, line: 81, baseType: !31, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !14, line: 62, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!21, !12, !21, !22}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !13, file: !14, line: 82, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !14, line: 58, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !12, !41, !22, !22}
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !13, file: !14, line: 83, baseType: !43, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !14, line: 60, baseType: !27)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !13, file: !14, line: 84, baseType: !45, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !14, line: 64, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !12, !21}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !13, file: !14, line: 87, baseType: !45, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !13, file: !14, line: 88, baseType: !17, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !13, file: !14, line: 92, baseType: !52, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !14, line: 66, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!21, !12, !24}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !13, file: !14, line: 93, baseType: !57, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !14, line: 68, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !12, !21, !24}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !13, file: !14, line: 99, baseType: !62, size: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !14, line: 70, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!40, !12, !21, !22}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !13, file: !14, line: 100, baseType: !22, size: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !14, line: 103, baseType: !12, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !13, file: !14, line: 104, baseType: !69, offset: 832)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, elements: !75)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !71, line: 20, baseType: !72)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !73, line: 41, baseType: !74)
!73 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!75 = !{!76}
!76 = !DISubrange(count: -1)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mbox", scope: !9, file: !8, line: 76, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_mbox", file: !80, line: 48, flags: DIFlagFwdDecl)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukmpi/include/uk/mbox.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !9, file: !8, line: 77, baseType: !40, size: 32, offset: 128)
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !83, retainedTypes: !112, globals: !126)
!83 = !{!84, !92}
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !85, line: 68, baseType: !86, size: 32, elements: !87)
!85 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!86 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 53, baseType: !40, size: 32, elements: !94)
!93 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!95 = !DIEnumerator(name: "ERR_OK", value: 0)
!96 = !DIEnumerator(name: "ERR_MEM", value: -1)
!97 = !DIEnumerator(name: "ERR_BUF", value: -2)
!98 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!99 = !DIEnumerator(name: "ERR_RTE", value: -4)
!100 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!101 = !DIEnumerator(name: "ERR_VAL", value: -6)
!102 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!103 = !DIEnumerator(name: "ERR_USE", value: -8)
!104 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!105 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!106 = !DIEnumerator(name: "ERR_CONN", value: -11)
!107 = !DIEnumerator(name: "ERR_IF", value: -12)
!108 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!109 = !DIEnumerator(name: "ERR_RST", value: -14)
!110 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!111 = !DIEnumerator(name: "ERR_ARG", value: -16)
!112 = !{!24, !113, !41, !115, !117, !121, !125}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !71, line: 60, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !73, line: 105, baseType: !24)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !71, line: 82, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !73, line: 232, baseType: !24)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !118, line: 48, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !120, line: 129, baseType: !24)
!120 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !122, line: 129, baseType: !123)
!122 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !71, line: 48, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !73, line: 79, baseType: !86)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!126 = !{!127, !0, !133, !159}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 90, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 232, elements: !131)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !{!132}
!132 = !DISubrange(count: 29)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "__str", scope: !135, file: !136, line: 198, type: !156, isLocal: true, isDefinition: true)
!135 = distinct !DISubprogram(name: "uk_pr_crit", scope: !136, file: !136, line: 194, type: !137, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !82, retainedNodes: !141)
!136 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !139, null}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!141 = !{!142, !143}
!142 = !DILocalVariable(name: "fmt", arg: 1, scope: !135, file: !136, line: 194, type: !139)
!143 = !DILocalVariable(name: "argp", scope: !135, file: !136, line: 196, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !145, line: 32, baseType: !146)
!145 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 192, elements: !154)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !148, file: !3, line: 196, baseType: !86, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !148, file: !3, line: 196, baseType: !86, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !148, file: !3, line: 196, baseType: !21, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !148, file: !3, line: 196, baseType: !21, size: 64, offset: 128)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 8)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "__str", scope: !135, file: !136, line: 198, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 80, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 10)
!164 = !{!165, !166, !167, !175}
!165 = !DILocalVariable(name: "mbox", arg: 1, scope: !2, file: !3, line: 85, type: !6)
!166 = !DILocalVariable(name: "msg", arg: 2, scope: !2, file: !3, line: 85, type: !21)
!167 = !DILocalVariable(name: "tid", scope: !168, file: !3, line: 90, type: !123)
!168 = distinct !DILexicalBlock(scope: !169, file: !3, line: 90, column: 3)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 90, column: 3)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 90, column: 3)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 90, column: 3)
!172 = distinct !DILexicalBlock(scope: !173, file: !3, line: 90, column: 3)
!173 = distinct !DILexicalBlock(scope: !174, file: !3, line: 89, column: 12)
!174 = distinct !DILexicalBlock(scope: !2, file: !3, line: 89, column: 6)
!175 = !DILocalVariable(name: "tid", scope: !176, file: !3, line: 95, type: !123)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 95, column: 2)
!177 = distinct !DILexicalBlock(scope: !178, file: !3, line: 95, column: 2)
!178 = distinct !DILexicalBlock(scope: !179, file: !3, line: 95, column: 2)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 95, column: 2)
!180 = distinct !DILexicalBlock(scope: !2, file: !3, line: 95, column: 2)
!181 = !{i32 2, !"Dwarf Version", i32 4}
!182 = !{i32 2, !"Debug Info Version", i32 3}
!183 = !{i32 1, !"wchar_size", i32 4}
!184 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!185 = distinct !DISubprogram(name: "sys_mbox_new", scope: !3, file: !3, line: 42, type: !186, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !82, retainedNodes: !190)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !6, !40}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !93, line: 96, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !122, line: 126, baseType: !70)
!190 = !{!191, !192, !193, !199}
!191 = !DILocalVariable(name: "mbox", arg: 1, scope: !185, file: !3, line: 42, type: !6)
!192 = !DILocalVariable(name: "size", arg: 2, scope: !185, file: !3, line: 42, type: !40)
!193 = !DILocalVariable(name: "tid", scope: !194, file: !3, line: 50, type: !123)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 50, column: 2)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 50, column: 2)
!196 = distinct !DILexicalBlock(scope: !197, file: !3, line: 50, column: 2)
!197 = distinct !DILexicalBlock(scope: !198, file: !3, line: 50, column: 2)
!198 = distinct !DILexicalBlock(scope: !185, file: !3, line: 50, column: 2)
!199 = !DILocalVariable(name: "_ret", scope: !194, file: !3, line: 50, type: !113)
!200 = !DILocation(line: 42, column: 32, scope: !185)
!201 = !DILocation(line: 42, column: 42, scope: !185)
!202 = !DILocation(line: 44, column: 11, scope: !203)
!203 = distinct !DILexicalBlock(scope: !185, file: !3, line: 44, column: 6)
!204 = !DILocation(line: 44, column: 6, scope: !185)
!205 = !DILocation(line: 47, column: 2, scope: !206)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 47, column: 2)
!207 = distinct !DILexicalBlock(scope: !185, file: !3, line: 47, column: 2)
!208 = !DILocation(line: 47, column: 2, scope: !207)
!209 = !{!"branch_weights", i32 1, i32 2000}
!210 = !DILocation(line: 47, column: 2, scope: !211)
