; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/mprec.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/mprec.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "p05", scope: !2, file: !3, line: 427, type: !315, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "__pow5mult", scope: !3, file: !3, line: 422, type: !4, isLocal: false, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true, unit: !289, retainedNodes: !307)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/mprec.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !25, !6, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Bigint", file: !8, line: 352, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/mprec.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !10, line: 47, size: 256, elements: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !14, !16, !17, !18, !19}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !9, file: !10, line: 49, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !9, file: !10, line: 50, baseType: !15, size: 32, offset: 64)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !9, file: !10, line: 50, baseType: !15, size: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !9, file: !10, line: 50, baseType: !15, size: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !9, file: !10, line: 50, baseType: !15, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !9, file: !10, line: 51, baseType: !20, size: 32, offset: 192)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, elements: !23)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !10, line: 25, baseType: !22)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24}
!24 = !DISubrange(count: 1)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !10, line: 569, size: 14912, elements: !27)
!27 = !{!28, !29, !108, !109, !110, !111, !115, !116, !181, !182, !186, !187, !188, !189, !191, !192, !193, !255, !274, !275, !280, !287}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !26, file: !10, line: 571, baseType: !15, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !26, file: !10, line: 576, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !10, line: 287, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !10, line: 181, size: 1408, elements: !33)
!33 = !{!34, !37, !38, !39, !41, !42, !47, !48, !50, !59, !65, !70, !74, !75, !76, !77, !81, !83, !84, !85, !87, !88, !92, !107}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !32, file: !10, line: 182, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !32, file: !10, line: 183, baseType: !15, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !32, file: !10, line: 184, baseType: !15, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !10, line: 185, baseType: !40, size: 16, offset: 128)
!40 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !32, file: !10, line: 186, baseType: !40, size: 16, offset: 144)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !32, file: !10, line: 187, baseType: !43, size: 128, offset: 192)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !10, line: 117, size: 128, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !43, file: !10, line: 118, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !43, file: !10, line: 119, baseType: !15, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !32, file: !10, line: 188, baseType: !15, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !32, file: !10, line: 195, baseType: !49, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !32, file: !10, line: 197, baseType: !51, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !25, !49, !57, !15}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !55, line: 145, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !32, file: !10, line: 199, baseType: !60, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!54, !25, !49, !63, !15}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !32, file: !10, line: 202, baseType: !66, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !25, !49, !69, !15}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !55, line: 114, baseType: !56)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !32, file: !10, line: 203, baseType: !71, size: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!15, !25, !49}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !32, file: !10, line: 206, baseType: !43, size: 128, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !32, file: !10, line: 207, baseType: !35, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !32, file: !10, line: 208, baseType: !15, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !32, file: !10, line: 211, baseType: !78, size: 24, offset: 928)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 24, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 3)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !32, file: !10, line: 212, baseType: !82, size: 8, offset: 952)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !23)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !32, file: !10, line: 215, baseType: !43, size: 128, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !32, file: !10, line: 218, baseType: !15, size: 32, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !10, line: 219, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !55, line: 44, baseType: !56)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !32, file: !10, line: 222, baseType: !25, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !10, line: 226, baseType: !89, size: 32, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !55, line: 175, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !91, line: 12, baseType: !15)
!91 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !32, file: !10, line: 228, baseType: !93, size: 64, offset: 1312)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !55, line: 171, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 163, size: 64, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !94, file: !55, line: 165, baseType: !15, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !94, file: !55, line: 170, baseType: !98, size: 32, offset: 32)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !55, line: 166, size: 32, elements: !99)
!99 = !{!100, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !98, file: !55, line: 168, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !102, line: 124, baseType: !22)
!102 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !98, file: !55, line: 169, baseType: !104, size: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !10, line: 229, baseType: !15, size: 32, offset: 1376)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !26, file: !10, line: 576, baseType: !30, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !26, file: !10, line: 576, baseType: !30, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !26, file: !10, line: 578, baseType: !15, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !26, file: !10, line: 579, baseType: !112, size: 200, offset: 288)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 200, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !26, file: !10, line: 582, baseType: !15, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !26, file: !10, line: 583, baseType: !117, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !119, line: 178, size: 3392, elements: !120)
!119 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!120 = !{!121, !126, !134, !143, !144, !145, !173, !177, !180}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !118, file: !119, line: 180, baseType: !122, size: 1792)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 1792, elements: !123)
!123 = !{!124, !125}
!124 = !DISubrange(count: 7)
!125 = !DISubrange(count: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !118, file: !119, line: 181, baseType: !127, size: 64, offset: 1792)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!15, !25, !57, !130, !131}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 83, baseType: !15)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !133, line: 86, baseType: !93)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !118, file: !119, line: 183, baseType: !135, size: 64, offset: 1856)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!15, !25, !138, !63, !139, !131}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !140, line: 40, baseType: !141)
!140 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !55, line: 129, baseType: !142)
!142 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !118, file: !119, line: 185, baseType: !15, size: 32, offset: 1920)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !118, file: !119, line: 186, baseType: !57, size: 64, offset: 1984)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !118, file: !119, line: 187, baseType: !146, size: 768, offset: 2048)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !147, line: 42, size: 768, elements: !148)
!147 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !146, file: !147, line: 44, baseType: !57, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !146, file: !147, line: 45, baseType: !57, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !146, file: !147, line: 46, baseType: !57, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !146, file: !147, line: 47, baseType: !57, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !146, file: !147, line: 48, baseType: !57, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !146, file: !147, line: 49, baseType: !57, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !146, file: !147, line: 50, baseType: !57, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !146, file: !147, line: 51, baseType: !57, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !146, file: !147, line: 52, baseType: !57, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !146, file: !147, line: 53, baseType: !57, size: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !146, file: !147, line: 54, baseType: !58, size: 8, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !146, file: !147, line: 55, baseType: !58, size: 8, offset: 648)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !146, file: !147, line: 56, baseType: !58, size: 8, offset: 656)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !146, file: !147, line: 57, baseType: !58, size: 8, offset: 664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !146, file: !147, line: 58, baseType: !58, size: 8, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !146, file: !147, line: 59, baseType: !58, size: 8, offset: 680)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !146, file: !147, line: 60, baseType: !58, size: 8, offset: 688)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !146, file: !147, line: 61, baseType: !58, size: 8, offset: 696)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !146, file: !147, line: 62, baseType: !58, size: 8, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !146, file: !147, line: 63, baseType: !58, size: 8, offset: 712)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !146, file: !147, line: 64, baseType: !58, size: 8, offset: 720)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !146, file: !147, line: 65, baseType: !58, size: 8, offset: 728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !146, file: !147, line: 66, baseType: !58, size: 8, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !146, file: !147, line: 67, baseType: !58, size: 8, offset: 744)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !118, file: !119, line: 189, baseType: !174, size: 16, offset: 2816)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !118, file: !119, line: 190, baseType: !178, size: 256, offset: 2832)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 256, elements: !179)
!179 = !{!125}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !118, file: !119, line: 191, baseType: !178, size: 256, offset: 3088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !26, file: !10, line: 585, baseType: !15, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !26, file: !10, line: 587, baseType: !183, size: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !25}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !26, file: !10, line: 590, baseType: !13, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !26, file: !10, line: 591, baseType: !15, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !26, file: !10, line: 592, baseType: !13, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !26, file: !10, line: 593, baseType: !190, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !26, file: !10, line: 596, baseType: !15, size: 32, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !26, file: !10, line: 597, baseType: !57, size: 64, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !26, file: !10, line: 632, baseType: !194, size: 2880, offset: 1152)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !26, file: !10, line: 599, size: 2880, elements: !195)
!195 = !{!196, !246}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !194, file: !10, line: 622, baseType: !197, size: 1728)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !10, line: 601, size: 1728, elements: !198)
!198 = !{!199, !200, !201, !205, !217, !218, !220, !228, !229, !230, !231, !235, !239, !240, !241, !242, !243, !244, !245}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !197, file: !10, line: 603, baseType: !22, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !197, file: !10, line: 604, baseType: !57, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !197, file: !10, line: 605, baseType: !202, size: 208, offset: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 208, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 26)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !197, file: !10, line: 606, baseType: !206, size: 288, offset: 352)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !10, line: 55, size: 288, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !206, file: !10, line: 57, baseType: !15, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !206, file: !10, line: 58, baseType: !15, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !206, file: !10, line: 59, baseType: !15, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !206, file: !10, line: 60, baseType: !15, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !206, file: !10, line: 61, baseType: !15, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !206, file: !10, line: 62, baseType: !15, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !206, file: !10, line: 63, baseType: !15, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !206, file: !10, line: 64, baseType: !15, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !206, file: !10, line: 65, baseType: !15, size: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !197, file: !10, line: 607, baseType: !15, size: 32, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !197, file: !10, line: 608, baseType: !219, size: 64, offset: 704)
!219 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !197, file: !10, line: 609, baseType: !221, size: 112, offset: 768)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !10, line: 319, size: 112, elements: !222)
!222 = !{!223, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !221, file: !10, line: 320, baseType: !224, size: 48)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 48, elements: !79)
!225 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !221, file: !10, line: 321, baseType: !224, size: 48, offset: 48)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !221, file: !10, line: 322, baseType: !225, size: 16, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !197, file: !10, line: 610, baseType: !93, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !197, file: !10, line: 611, baseType: !93, size: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !197, file: !10, line: 612, baseType: !93, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !197, file: !10, line: 613, baseType: !232, size: 64, offset: 1088)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !197, file: !10, line: 614, baseType: !236, size: 192, offset: 1152)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 24)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !197, file: !10, line: 615, baseType: !15, size: 32, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !197, file: !10, line: 616, baseType: !93, size: 64, offset: 1376)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !197, file: !10, line: 617, baseType: !93, size: 64, offset: 1440)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !197, file: !10, line: 618, baseType: !93, size: 64, offset: 1504)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !197, file: !10, line: 619, baseType: !93, size: 64, offset: 1568)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !197, file: !10, line: 620, baseType: !93, size: 64, offset: 1632)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !197, file: !10, line: 621, baseType: !15, size: 32, offset: 1696)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !194, file: !10, line: 631, baseType: !247, size: 2880)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !10, line: 626, size: 2880, elements: !248)
!248 = !{!249, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !247, file: !10, line: 629, baseType: !250, size: 1920)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1920, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 30)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !247, file: !10, line: 630, baseType: !254, size: 960, offset: 1920)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 960, elements: !251)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !26, file: !10, line: 636, baseType: !256, size: 64, offset: 4032)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !10, line: 93, size: 6336, elements: !258)
!258 = !{!259, !260, !261, !266}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !257, file: !10, line: 94, baseType: !256, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !257, file: !10, line: 95, baseType: !15, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !257, file: !10, line: 97, baseType: !262, size: 2048, offset: 128)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 2048, elements: !179)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !257, file: !10, line: 98, baseType: !267, size: 4160, offset: 2176)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !10, line: 74, size: 4160, elements: !268)
!268 = !{!269, !271, !272, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !267, file: !10, line: 75, baseType: !270, size: 2048)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2048, elements: !179)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !267, file: !10, line: 76, baseType: !270, size: 2048, offset: 2048)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !267, file: !10, line: 78, baseType: !21, size: 32, offset: 4096)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !267, file: !10, line: 81, baseType: !21, size: 32, offset: 4128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !26, file: !10, line: 637, baseType: !257, size: 6336, offset: 4096)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !26, file: !10, line: 641, baseType: !276, size: 64, offset: 10432)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !15}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !26, file: !10, line: 646, baseType: !281, size: 192, offset: 10496)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !10, line: 291, size: 192, elements: !282)
!282 = !{!283, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !281, file: !10, line: 293, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !281, file: !10, line: 294, baseType: !15, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !281, file: !10, line: 295, baseType: !30, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !26, file: !10, line: 648, baseType: !288, size: 4224, offset: 10688)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 4224, elements: !79)
!289 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !290, retainedTypes: !291, globals: !294)
!290 = !{}
!291 = !{!49, !190, !6, !15, !57, !292}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !293, line: 79, baseType: !22)
!293 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!294 = !{!0, !295, !300, !305}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "__mprec_tens", scope: !289, file: !3, line: 955, type: !297, isLocal: false, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 1600, elements: !113)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "__mprec_bigtens", scope: !289, file: !3, line: 964, type: !302, isLocal: false, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 320, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 5)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "__mprec_tinytens", scope: !289, file: !3, line: 967, type: !302, isLocal: false, isDefinition: true)
!307 = !{!308, !309, !310, !311, !312, !313, !314}
!308 = !DILocalVariable(name: "ptr", arg: 1, scope: !2, file: !3, line: 422, type: !25)
!309 = !DILocalVariable(name: "b", arg: 2, scope: !2, file: !3, line: 422, type: !6)
!310 = !DILocalVariable(name: "k", arg: 3, scope: !2, file: !3, line: 422, type: !15)
!311 = !DILocalVariable(name: "b1", scope: !2, file: !3, line: 425, type: !6)
!312 = !DILocalVariable(name: "p5", scope: !2, file: !3, line: 425, type: !6)
!313 = !DILocalVariable(name: "p51", scope: !2, file: !3, line: 425, type: !6)
!314 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 426, type: !15)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 96, elements: !79)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!317 = !{i32 2, !"Dwarf Version", i32 4}
!318 = !{i32 2, !"Debug Info Version", i32 3}
!319 = !{i32 1, !"wchar_size", i32 4}
!320 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!321 = distinct !DISubprogram(name: "_Balloc", scope: !3, file: !3, line: 97, type: !322, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !289, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!6, !25, !15}
!324 = !{!325, !326, !327, !328}
!325 = !DILocalVariable(name: "ptr", arg: 1, scope: !321, file: !3, line: 97, type: !25)
!326 = !DILocalVariable(name: "k", arg: 2, scope: !321, file: !3, line: 97, type: !15)
!327 = !DILocalVariable(name: "x", scope: !321, file: !3, line: 99, type: !15)
!328 = !DILocalVariable(name: "rv", scope: !321, file: !3, line: 100, type: !6)
!329 = !DILocation(line: 97, column: 1, scope: !321)
!330 = !DILocation(line: 103, column: 7, scope: !331)
!331 = distinct !DILexicalBlock(scope: !321, file: !3, line: 103, column: 7)
!332 = !{!333, !337, i64 120}
!333 = !{!"_reent", !334, i64 0, !337, i64 8, !337, i64 16, !337, i64 24, !334, i64 32, !335, i64 36, !334, i64 64, !337, i64 72, !334, i64 80, !337, i64 88, !337, i64 96, !334, i64 104, !337, i64 112, !337, i64 120, !334, i64 128, !337, i64 136, !335, i64 144, !337, i64 504, !338, i64 512, !337, i64 1304, !340, i64 1312, !335, i64 1336}
!334 = !{!"int", !335, i64 0}
