; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/multi.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/multi.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sharedObjectsStruct = type { %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, [10 x %struct.redisObject*], [10000 x %struct.redisObject*], [32 x %struct.redisObject*], [32 x %struct.redisObject*], i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/multi.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!9 = distinct !DISubprogram(name: "initClientMultiState", scope: !1, file: !1, line: 35, type: !10, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !263)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !14, line: 780, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !14, line: 723, size: 135360, elements: !16)
!16 = !{!17, !23, !25, !130, !141, !146, !151, !152, !153, !154, !156, !178, !179, !180, !181, !182, !183, !185, !186, !189, !190, !191, !192, !193, !194, !195, !196, !201, !202, !203, !204, !205, !206, !207, !208, !212, !213, !217, !218, !234, !235, !252, !253, !254, !255, !256, !257, !258, !259}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !15, file: !14, line: 724, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !19, line: 60, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !21, line: 105, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !15, file: !14, line: 725, baseType: !24, size: 32, offset: 64)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !15, file: !14, line: 726, baseType: !26, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !14, line: 656, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !14, line: 647, size: 512, elements: !29)
!29 = !{!30, !94, !95, !96, !97, !98, !99, !101}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !28, file: !14, line: 648, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !33, line: 82, baseType: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !33, line: 76, size: 768, elements: !35)
!35 = !{!36, !61, !62, !92, !93}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !33, line: 77, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !33, line: 65, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !33, line: 58, size: 384, elements: !40)
!40 = !{!41, !47, !51, !52, !56, !60}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !39, file: !33, line: 59, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!18, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !39, file: !33, line: 60, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!4, !4, !45}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !39, file: !33, line: 61, baseType: !48, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !39, file: !33, line: 62, baseType: !53, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!24, !4, !45, !45}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !39, file: !33, line: 63, baseType: !57, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !4, !4}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !39, file: !33, line: 64, baseType: !57, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !34, file: !33, line: 78, baseType: !4, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !34, file: !33, line: 79, baseType: !63, size: 512, offset: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, elements: !90)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !33, line: 74, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !33, line: 69, size: 256, elements: !66)
!66 = !{!67, !87, !88, !89}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !65, file: !33, line: 70, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !33, line: 56, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !33, line: 47, size: 192, elements: !72)
!72 = !{!73, !74, !85}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !71, file: !33, line: 48, baseType: !4, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !71, file: !33, line: 54, baseType: !75, size: 64, offset: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !33, line: 49, size: 64, elements: !76)
!76 = !{!77, !78, !79, !83}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !75, file: !33, line: 50, baseType: !4, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !75, file: !33, line: 51, baseType: !18, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !75, file: !33, line: 52, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !19, line: 56, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !21, line: 103, baseType: !82)
!82 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !75, file: !33, line: 53, baseType: !84, size: 64)
!84 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !33, line: 55, baseType: !86, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !65, file: !33, line: 71, baseType: !22, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !65, file: !33, line: 72, baseType: !22, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !65, file: !33, line: 73, baseType: !22, size: 64, offset: 192)
!90 = !{!91}
!91 = !DISubrange(count: 2)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !34, file: !33, line: 80, baseType: !82, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !34, file: !33, line: 81, baseType: !22, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !28, file: !14, line: 649, baseType: !31, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !28, file: !14, line: 650, baseType: !31, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !28, file: !14, line: 651, baseType: !31, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !28, file: !14, line: 652, baseType: !31, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !28, file: !14, line: 653, baseType: !24, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !28, file: !14, line: 654, baseType: !100, size: 64, offset: 384)
!100 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !28, file: !14, line: 655, baseType: !102, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !104, line: 54, baseType: !105)
!104 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !104, line: 47, size: 384, elements: !106)
!106 = !{!107, !116, !117, !121, !125, !129}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !105, file: !104, line: 48, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !104, line: 40, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !104, line: 36, size: 192, elements: !111)
!111 = !{!112, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !104, line: 37, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !104, line: 38, baseType: !113, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !110, file: !104, line: 39, baseType: !4, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !105, file: !104, line: 49, baseType: !108, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !105, file: !104, line: 50, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!4, !4}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !105, file: !104, line: 51, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !4}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !105, file: !104, line: 52, baseType: !126, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!24, !4, !4}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !105, file: !104, line: 53, baseType: !22, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !15, file: !14, line: 727, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !14, line: 622, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !14, line: 614, size: 128, elements: !134)
!134 = !{!135, !137, !138, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !14, line: 615, baseType: !136, size: 4, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !133, file: !14, line: 616, baseType: !136, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !133, file: !14, line: 617, baseType: !136, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !133, file: !14, line: 620, baseType: !24, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !133, file: !14, line: 621, baseType: !4, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !15, file: !14, line: 728, baseType: !142, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !143, line: 43, baseType: !144)
!143 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !15, file: !14, line: 729, baseType: !147, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 40, baseType: !149)
!148 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !150, line: 129, baseType: !22)
!150 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !15, file: !14, line: 730, baseType: !142, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !15, file: !14, line: 734, baseType: !147, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !15, file: !14, line: 735, baseType: !24, size: 32, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !15, file: !14, line: 736, baseType: !155, size: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !15, file: !14, line: 737, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !14, line: 1307, size: 640, elements: !159)
!159 = !{!160, !161, !164, !165, !166, !167, !173, !174, !175, !176, !177}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !14, line: 1308, baseType: !144, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !158, file: !14, line: 1309, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !14, line: 1305, baseType: !10)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !158, file: !14, line: 1310, baseType: !24, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !158, file: !14, line: 1311, baseType: !144, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !158, file: !14, line: 1312, baseType: !24, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !158, file: !14, line: 1315, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !14, line: 1306, baseType: !170)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !157, !155, !24, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !158, file: !14, line: 1317, baseType: !24, size: 32, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !158, file: !14, line: 1318, baseType: !24, size: 32, offset: 416)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !158, file: !14, line: 1319, baseType: !24, size: 32, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !158, file: !14, line: 1320, baseType: !100, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !158, file: !14, line: 1320, baseType: !100, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !15, file: !14, line: 737, baseType: !157, size: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !15, file: !14, line: 738, baseType: !24, size: 32, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !15, file: !14, line: 739, baseType: !24, size: 32, offset: 800)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !15, file: !14, line: 740, baseType: !82, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !15, file: !14, line: 741, baseType: !102, size: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !15, file: !14, line: 742, baseType: !184, size: 64, offset: 960)
!184 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !15, file: !14, line: 743, baseType: !147, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !15, file: !14, line: 745, baseType: !187, size: 64, offset: 1088)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !188, line: 34, baseType: !82)
!188 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !15, file: !14, line: 746, baseType: !187, size: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !15, file: !14, line: 747, baseType: !187, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !14, line: 748, baseType: !24, size: 32, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !15, file: !14, line: 749, baseType: !24, size: 32, offset: 1312)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !15, file: !14, line: 750, baseType: !24, size: 32, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !15, file: !14, line: 751, baseType: !24, size: 32, offset: 1376)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !15, file: !14, line: 752, baseType: !24, size: 32, offset: 1408)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !15, file: !14, line: 753, baseType: !197, size: 64, offset: 1472)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !198, line: 173, baseType: !199)
!198 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !150, line: 100, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !150, line: 44, baseType: !82)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !15, file: !14, line: 754, baseType: !197, size: 64, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !15, file: !14, line: 755, baseType: !142, size: 64, offset: 1600)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !15, file: !14, line: 756, baseType: !100, size: 64, offset: 1664)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !15, file: !14, line: 757, baseType: !100, size: 64, offset: 1728)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !15, file: !14, line: 758, baseType: !100, size: 64, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !15, file: !14, line: 759, baseType: !100, size: 64, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !15, file: !14, line: 760, baseType: !100, size: 64, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !15, file: !14, line: 763, baseType: !209, size: 328, offset: 1984)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 328, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 41)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !15, file: !14, line: 764, baseType: !24, size: 32, offset: 2336)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !15, file: !14, line: 765, baseType: !214, size: 368, offset: 2368)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 368, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 46)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !15, file: !14, line: 766, baseType: !24, size: 32, offset: 2752)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !15, file: !14, line: 767, baseType: !219, size: 256, offset: 2816)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !14, line: 673, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !14, line: 665, size: 256, elements: !221)
!221 = !{!222, !230, !231, !232, !233}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !220, file: !14, line: 666, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !14, line: 663, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !14, line: 659, size: 192, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !225, file: !14, line: 660, baseType: !155, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !225, file: !14, line: 661, baseType: !24, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !225, file: !14, line: 662, baseType: !157, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !220, file: !14, line: 667, baseType: !24, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !220, file: !14, line: 668, baseType: !24, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !220, file: !14, line: 671, baseType: !24, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !220, file: !14, line: 672, baseType: !187, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !15, file: !14, line: 768, baseType: !24, size: 32, offset: 3072)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !15, file: !14, line: 769, baseType: !236, size: 704, offset: 3136)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !14, line: 703, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !14, line: 677, size: 704, elements: !238)
!238 = !{!239, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !237, file: !14, line: 679, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !14, line: 52, baseType: !100)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !237, file: !14, line: 683, baseType: !31, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !237, file: !14, line: 685, baseType: !131, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !237, file: !14, line: 689, baseType: !147, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !237, file: !14, line: 690, baseType: !131, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !237, file: !14, line: 691, baseType: !131, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !237, file: !14, line: 692, baseType: !240, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !237, file: !14, line: 692, baseType: !240, size: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !237, file: !14, line: 693, baseType: !24, size: 32, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !237, file: !14, line: 696, baseType: !24, size: 32, offset: 544)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !237, file: !14, line: 697, baseType: !100, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !237, file: !14, line: 700, baseType: !4, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !15, file: !14, line: 770, baseType: !100, size: 64, offset: 3840)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !15, file: !14, line: 771, baseType: !102, size: 64, offset: 3904)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !15, file: !14, line: 772, baseType: !31, size: 64, offset: 3968)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !15, file: !14, line: 773, baseType: !102, size: 64, offset: 4032)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !15, file: !14, line: 774, baseType: !142, size: 64, offset: 4096)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !15, file: !14, line: 775, baseType: !108, size: 64, offset: 4160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !15, file: !14, line: 778, baseType: !24, size: 32, offset: 4224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !14, line: 779, baseType: !260, size: 131072, offset: 4256)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 131072, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 16384)
!263 = !{!264}
!264 = !DILocalVariable(name: "c", arg: 1, scope: !9, file: !1, line: 35, type: !12)
!265 = !DILocation(line: 35, column: 35, scope: !9)
!266 = !DILocation(line: 36, column: 15, scope: !9)
!267 = !DILocation(line: 36, column: 24, scope: !9)
!268 = !{!269, !274, i64 352}
!269 = !{!"client", !270, i64 0, !273, i64 8, !274, i64 16, !274, i64 24, !274, i64 32, !270, i64 40, !274, i64 48, !270, i64 56, !273, i64 64, !274, i64 72, !274, i64 80, !274, i64 88, !273, i64 96, !273, i64 100, !270, i64 104, !274, i64 112, !275, i64 120, !270, i64 128, !270, i64 136, !270, i64 144, !270, i64 152, !273, i64 160, !273, i64 164, !273, i64 168, !273, i64 172, !273, i64 176, !270, i64 184, !270, i64 192, !274, i64 200, !275, i64 208, !275, i64 216, !275, i64 224, !275, i64 232, !275, i64 240, !271, i64 248, !273, i64 292, !271, i64 296, !273, i64 344, !276, i64 352, !273, i64 384, !277, i64 392, !275, i64 480, !274, i64 488, !274, i64 496, !274, i64 504, !274, i64 512, !274, i64 520, !273, i64 528, !271, i64 532}
!270 = !{!"long", !271, i64 0}
!271 = !{!"omnipotent char", !272, i64 0}
!272 = !{!"Simple C/C++ TBAA"}
!273 = !{!"int", !271, i64 0}
!274 = !{!"any pointer", !271, i64 0}
!275 = !{!"long long", !271, i64 0}
!276 = !{!"multiState", !274, i64 0, !273, i64 8, !273, i64 12, !273, i64 16, !270, i64 24}
!277 = !{!"blockingState", !275, i64 0, !274, i64 8, !274, i64 16, !270, i64 24, !274, i64 32, !274, i64 40, !275, i64 48, !275, i64 56, !273, i64 64, !273, i64 68, !275, i64 72, !274, i64 80}
!278 = !DILocation(line: 37, column: 15, scope: !9)
!279 = !DILocation(line: 37, column: 21, scope: !9)
!280 = !{!269, !273, i64 360}
!281 = !DILocation(line: 38, column: 15, scope: !9)
!282 = !DILocation(line: 38, column: 25, scope: !9)
!283 = !{!269, !273, i64 364}
!284 = !DILocation(line: 39, column: 1, scope: !9)
!285 = distinct !DISubprogram(name: "freeClientMultiState", scope: !1, file: !1, line: 42, type: !10, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !286)
!286 = !{!287, !288, !289, !293}
!287 = !DILocalVariable(name: "c", arg: 1, scope: !285, file: !1, line: 42, type: !12)
!288 = !DILocalVariable(name: "j", scope: !285, file: !1, line: 43, type: !24)
!289 = !DILocalVariable(name: "i", scope: !290, file: !1, line: 46, type: !24)
!290 = distinct !DILexicalBlock(scope: !291, file: !1, line: 45, column: 43)
!291 = distinct !DILexicalBlock(scope: !292, file: !1, line: 45, column: 5)
!292 = distinct !DILexicalBlock(scope: !285, file: !1, line: 45, column: 5)
!293 = !DILocalVariable(name: "mc", scope: !290, file: !1, line: 47, type: !223)
!294 = !DILocation(line: 42, column: 35, scope: !285)
!295 = !DILocation(line: 43, column: 9, scope: !285)
!296 = !DILocation(line: 45, column: 10, scope: !292)
!297 = !DILocation(line: 45, column: 24, scope: !291)
!298 = !DILocation(line: 45, column: 31, scope: !291)
!299 = !DILocation(line: 45, column: 19, scope: !291)
!300 = !DILocation(line: 45, column: 5, scope: !292)
!301 = !DILocation(line: 47, column: 34, scope: !290)
!302 = !DILocation(line: 46, column: 13, scope: !290)
!303 = !DILocation(line: 49, column: 14, scope: !304)
!304 = distinct !DILexicalBlock(scope: !290, file: !1, line: 49, column: 9)
!305 = !DILocation(line: 49, column: 29, scope: !306)
!306 = distinct !DILexicalBlock(scope: !304, file: !1, line: 49, column: 9)
!307 = !{!308, !273, i64 8}
!308 = !{!"multiCmd", !274, i64 0, !273, i64 8, !274, i64 16}
!309 = !DILocation(line: 49, column: 23, scope: !306)
!310 = !DILocation(line: 0, scope: !290)
!311 = !{!308, !274, i64 0}
!312 = !DILocation(line: 49, column: 9, scope: !304)
!313 = !DILocation(line: 50, column: 26, scope: !306)
!314 = !{!274, !274, i64 0}
!315 = !DILocation(line: 50, column: 13, scope: !306)
!316 = !DILocation(line: 49, column: 36, scope: !306)
!317 = !DILocation(line: 49, column: 9, scope: !306)
!318 = distinct !{!318, !312, !319}
!319 = !DILocation(line: 50, column: 37, scope: !304)
!320 = !DILocation(line: 51, column: 15, scope: !290)
!321 = !DILocation(line: 51, column: 9, scope: !290)
!322 = !DILocation(line: 45, column: 39, scope: !291)
!323 = !DILocation(line: 45, column: 5, scope: !291)
!324 = distinct !{!324, !300, !325}
!325 = !DILocation(line: 52, column: 5, scope: !292)
!326 = !DILocation(line: 53, column: 21, scope: !285)
!327 = !DILocation(line: 53, column: 5, scope: !285)
!328 = !DILocation(line: 54, column: 1, scope: !285)
!329 = distinct !DISubprogram(name: "queueMultiCommand", scope: !1, file: !1, line: 57, type: !10, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !330)
!330 = !{!331, !332, !333}
!331 = !DILocalVariable(name: "c", arg: 1, scope: !329, file: !1, line: 57, type: !12)
!332 = !DILocalVariable(name: "mc", scope: !329, file: !1, line: 58, type: !223)
!333 = !DILocalVariable(name: "j", scope: !329, file: !1, line: 59, type: !24)
!334 = !DILocation(line: 57, column: 32, scope: !329)
!335 = !DILocation(line: 61, column: 38, scope: !329)
!336 = !DILocation(line: 61, column: 45, scope: !329)
!337 = !DILocation(line: 62, column: 41, scope: !329)
!338 = !DILocation(line: 62, column: 46, scope: !329)
!339 = !DILocation(line: 62, column: 30, scope: !329)
!340 = !DILocation(line: 62, column: 29, scope: !329)
!341 = !DILocation(line: 61, column: 26, scope: !329)
!342 = !DILocation(line: 61, column: 24, scope: !329)
!343 = !DILocation(line: 63, column: 39, scope: !329)
!344 = !DILocation(line: 63, column: 28, scope: !329)
!345 = !DILocation(line: 64, column: 18, scope: !329)
!346 = !{!269, !274, i64 80}
!347 = !DILocation(line: 64, column: 9, scope: !329)
!348 = !DILocation(line: 64, column: 13, scope: !329)
!349 = !{!308, !274, i64 16}
!350 = !DILocation(line: 65, column: 19, scope: !329)
!351 = !{!269, !273, i64 64}
!352 = !DILocation(line: 65, column: 9, scope: !329)
!353 = !DILocation(line: 65, column: 14, scope: !329)
!354 = !DILocation(line: 66, column: 38, scope: !329)
!355 = !DILocation(line: 66, column: 37, scope: !329)
!356 = !DILocation(line: 66, column: 16, scope: !329)
!357 = !DILocation(line: 66, column: 9, scope: !329)
!358 = !DILocation(line: 66, column: 14, scope: !329)
!359 = !DILocation(line: 67, column: 24, scope: !329)
!360 = !{!269, !274, i64 72}
!361 = !DILocation(line: 67, column: 46, scope: !329)
!362 = !DILocation(line: 67, column: 43, scope: !329)
!363 = !DILocation(line: 67, column: 42, scope: !329)
!364 = !DILocation(line: 67, column: 5, scope: !329)
!365 = !DILocation(line: 59, column: 9, scope: !329)
!366 = !DILocation(line: 68, column: 10, scope: !367)
!367 = distinct !DILexicalBlock(scope: !329, file: !1, line: 68, column: 5)
!368 = !DILocation(line: 68, column: 24, scope: !369)
!369 = distinct !DILexicalBlock(scope: !367, file: !1, line: 68, column: 5)
!370 = !DILocation(line: 68, column: 19, scope: !369)
!371 = !DILocation(line: 68, column: 5, scope: !367)
!372 = !DILocation(line: 69, column: 26, scope: !369)
!373 = !DILocation(line: 69, column: 22, scope: !369)
!374 = !DILocation(line: 69, column: 9, scope: !369)
!375 = !DILocation(line: 68, column: 31, scope: !369)
!376 = !DILocation(line: 68, column: 5, scope: !369)
!377 = distinct !{!377, !371, !378}
!378 = !DILocation(line: 69, column: 33, scope: !367)
!379 = !DILocation(line: 70, column: 20, scope: !329)
!380 = !DILocation(line: 71, column: 31, scope: !329)
!381 = !DILocation(line: 71, column: 36, scope: !329)
!382 = !{!383, !273, i64 32}
!383 = !{!"redisCommand", !274, i64 0, !274, i64 8, !273, i64 16, !274, i64 24, !273, i64 32, !274, i64 40, !273, i64 48, !273, i64 52, !273, i64 56, !275, i64 64, !275, i64 72}
!384 = !DILocation(line: 71, column: 15, scope: !329)
!385 = !DILocation(line: 71, column: 25, scope: !329)
!386 = !DILocation(line: 72, column: 1, scope: !329)
!387 = distinct !DISubprogram(name: "discardTransaction", scope: !1, file: !1, line: 74, type: !10, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !388)
!388 = !{!389}
!389 = !DILocalVariable(name: "c", arg: 1, scope: !387, file: !1, line: 74, type: !12)
!390 = !DILocation(line: 74, column: 33, scope: !387)
!391 = !DILocation(line: 42, column: 35, scope: !285, inlinedAt: !392)
!392 = distinct !DILocation(line: 75, column: 5, scope: !387)
!393 = !DILocation(line: 43, column: 9, scope: !285, inlinedAt: !392)
!394 = !DILocation(line: 45, column: 10, scope: !292, inlinedAt: !392)
!395 = !DILocation(line: 45, column: 24, scope: !291, inlinedAt: !392)
!396 = !DILocation(line: 45, column: 31, scope: !291, inlinedAt: !392)
!397 = !DILocation(line: 45, column: 19, scope: !291, inlinedAt: !392)
!398 = !DILocation(line: 45, column: 5, scope: !292, inlinedAt: !392)
!399 = !DILocation(line: 47, column: 34, scope: !290, inlinedAt: !392)
!400 = !DILocation(line: 46, column: 13, scope: !290, inlinedAt: !392)
!401 = !DILocation(line: 49, column: 14, scope: !304, inlinedAt: !392)
!402 = !DILocation(line: 49, column: 29, scope: !306, inlinedAt: !392)
!403 = !DILocation(line: 49, column: 23, scope: !306, inlinedAt: !392)
!404 = !DILocation(line: 0, scope: !290, inlinedAt: !392)
!405 = !DILocation(line: 49, column: 9, scope: !304, inlinedAt: !392)
!406 = !DILocation(line: 50, column: 26, scope: !306, inlinedAt: !392)
!407 = !DILocation(line: 50, column: 13, scope: !306, inlinedAt: !392)
!408 = !DILocation(line: 49, column: 36, scope: !306, inlinedAt: !392)
!409 = !DILocation(line: 49, column: 9, scope: !306, inlinedAt: !392)
!410 = !DILocation(line: 51, column: 15, scope: !290, inlinedAt: !392)
!411 = !DILocation(line: 51, column: 9, scope: !290, inlinedAt: !392)
!412 = !DILocation(line: 45, column: 39, scope: !291, inlinedAt: !392)
!413 = !DILocation(line: 45, column: 5, scope: !291, inlinedAt: !392)
!414 = !DILocation(line: 53, column: 21, scope: !285, inlinedAt: !392)
!415 = !DILocation(line: 53, column: 5, scope: !285, inlinedAt: !392)
!416 = !DILocation(line: 54, column: 1, scope: !285, inlinedAt: !392)
!417 = !DILocation(line: 35, column: 35, scope: !9, inlinedAt: !418)
!418 = distinct !DILocation(line: 76, column: 5, scope: !387)
!419 = !DILocation(line: 36, column: 15, scope: !9, inlinedAt: !418)
!420 = !DILocation(line: 36, column: 24, scope: !9, inlinedAt: !418)
!421 = !DILocation(line: 37, column: 21, scope: !9, inlinedAt: !418)
!422 = !DILocation(line: 38, column: 15, scope: !9, inlinedAt: !418)
!423 = !DILocation(line: 38, column: 25, scope: !9, inlinedAt: !418)
!424 = !DILocation(line: 39, column: 1, scope: !9, inlinedAt: !418)
!425 = !DILocation(line: 77, column: 8, scope: !387)
!426 = !DILocation(line: 77, column: 14, scope: !387)
!427 = !{!269, !273, i64 160}
!428 = !DILocation(line: 78, column: 5, scope: !387)
!429 = !DILocation(line: 79, column: 1, scope: !387)
!430 = distinct !DISubprogram(name: "unwatchAllKeys", scope: !1, file: !1, line: 265, type: !10, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !431)
!431 = !{!432, !433, !439, !440, !442}
!432 = !DILocalVariable(name: "c", arg: 1, scope: !430, file: !1, line: 265, type: !12)
!433 = !DILocalVariable(name: "li", scope: !430, file: !1, line: 266, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !104, line: 45, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !104, line: 42, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !104, line: 43, baseType: !108, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !435, file: !104, line: 44, baseType: !24, size: 32, offset: 64)
!439 = !DILocalVariable(name: "ln", scope: !430, file: !1, line: 267, type: !108)
!440 = !DILocalVariable(name: "clients", scope: !441, file: !1, line: 272, type: !102)
!441 = distinct !DILexicalBlock(scope: !430, file: !1, line: 271, column: 33)
!442 = !DILocalVariable(name: "wk", scope: !441, file: !1, line: 273, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "watchedKey", file: !1, line: 231, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "watchedKey", file: !1, line: 228, size: 128, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !445, file: !1, line: 229, baseType: !131, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !445, file: !1, line: 230, baseType: !26, size: 64, offset: 64)
!449 = !DILocation(line: 265, column: 29, scope: !430)
!450 = !DILocation(line: 266, column: 5, scope: !430)
!451 = !DILocation(line: 269, column: 9, scope: !452)
!452 = distinct !DILexicalBlock(scope: !430, file: !1, line: 269, column: 9)
!453 = !{!269, !274, i64 488}
!454 = !{!455, !270, i64 40}
!455 = !{!"list", !274, i64 0, !274, i64 8, !274, i64 16, !274, i64 24, !274, i64 32, !270, i64 40}
!456 = !DILocation(line: 269, column: 37, scope: !452)
!457 = !DILocation(line: 269, column: 9, scope: !430)
!458 = !DILocation(line: 266, column: 14, scope: !430)
!459 = !DILocation(line: 270, column: 5, scope: !430)
!460 = !DILocation(line: 271, column: 5, scope: !430)
!461 = !DILocation(line: 271, column: 17, scope: !430)
!462 = !DILocation(line: 267, column: 15, scope: !430)
!463 = !DILocation(line: 277, column: 14, scope: !441)
!464 = !{!465, !274, i64 16}
!465 = !{!"listNode", !274, i64 0, !274, i64 8, !274, i64 16}
!466 = !DILocation(line: 273, column: 21, scope: !441)
!467 = !DILocation(line: 278, column: 38, scope: !441)
!468 = !{!469, !274, i64 8}
!469 = !{!"watchedKey", !274, i64 0, !274, i64 8}
!470 = !DILocation(line: 278, column: 42, scope: !441)
!471 = !{!472, !274, i64 32}
!472 = !{!"redisDb", !274, i64 0, !274, i64 8, !274, i64 16, !274, i64 24, !274, i64 32, !273, i64 40, !275, i64 48, !274, i64 56}
!473 = !DILocation(line: 278, column: 60, scope: !441)
!474 = !{!469, !274, i64 0}
!475 = !DILocation(line: 278, column: 19, scope: !441)
!476 = !DILocation(line: 272, column: 15, scope: !441)
!477 = !DILocation(line: 279, column: 9, scope: !441)
!478 = !DILocation(line: 280, column: 29, scope: !441)
!479 = !DILocation(line: 280, column: 9, scope: !441)
!480 = !DILocation(line: 282, column: 13, scope: !481)
!481 = distinct !DILexicalBlock(scope: !441, file: !1, line: 282, column: 13)
!482 = !DILocation(line: 282, column: 33, scope: !481)
!483 = !DILocation(line: 282, column: 13, scope: !441)
!484 = !DILocation(line: 283, column: 28, scope: !481)
!485 = !DILocation(line: 283, column: 32, scope: !481)
!486 = !DILocation(line: 283, column: 50, scope: !481)
!487 = !DILocation(line: 283, column: 13, scope: !481)
!488 = !DILocation(line: 285, column: 24, scope: !441)
!489 = !DILocation(line: 285, column: 9, scope: !441)
!490 = !DILocation(line: 286, column: 26, scope: !441)
!491 = !DILocation(line: 286, column: 9, scope: !441)
!492 = !DILocation(line: 287, column: 9, scope: !441)
!493 = distinct !{!493, !460, !494}
!494 = !DILocation(line: 288, column: 5, scope: !430)
!495 = !DILocation(line: 0, scope: !452)
!496 = !DILocation(line: 289, column: 1, scope: !430)
!497 = distinct !DISubprogram(name: "flagTransaction", scope: !1, file: !1, line: 83, type: !10, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !498)
!498 = !{!499}
!499 = !DILocalVariable(name: "c", arg: 1, scope: !497, file: !1, line: 83, type: !12)
!500 = !DILocation(line: 83, column: 30, scope: !497)
!501 = !DILocation(line: 84, column: 12, scope: !502)
!502 = distinct !DILexicalBlock(scope: !497, file: !1, line: 84, column: 9)
!503 = !DILocation(line: 84, column: 18, scope: !502)
!504 = !DILocation(line: 84, column: 9, scope: !497)
!505 = !DILocation(line: 85, column: 18, scope: !502)
!506 = !DILocation(line: 85, column: 9, scope: !502)
!507 = !DILocation(line: 86, column: 1, scope: !497)
!508 = distinct !DISubprogram(name: "multiCommand", scope: !1, file: !1, line: 88, type: !10, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !509)
!509 = !{!510}
!510 = !DILocalVariable(name: "c", arg: 1, scope: !508, file: !1, line: 88, type: !12)
!511 = !DILocation(line: 88, column: 27, scope: !508)
!512 = !DILocation(line: 89, column: 12, scope: !513)
!513 = distinct !DILexicalBlock(scope: !508, file: !1, line: 89, column: 9)
