; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/nd6.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/nd6.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!60 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 145, baseType: !7, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!65 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!67 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_type", file: !69, line: 47, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/icmp6.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!71 = !DIEnumerator(name: "ICMP6_TYPE_DUR", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "ICMP6_TYPE_PTB", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "ICMP6_TYPE_TE", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "ICMP6_TYPE_PP", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "ICMP6_TYPE_PE1", value: 100, isUnsigned: true)
!76 = !DIEnumerator(name: "ICMP6_TYPE_PE2", value: 101, isUnsigned: true)
!77 = !DIEnumerator(name: "ICMP6_TYPE_RSV_ERR", value: 127, isUnsigned: true)
!78 = !DIEnumerator(name: "ICMP6_TYPE_EREQ", value: 128, isUnsigned: true)
!79 = !DIEnumerator(name: "ICMP6_TYPE_EREP", value: 129, isUnsigned: true)
!80 = !DIEnumerator(name: "ICMP6_TYPE_MLQ", value: 130, isUnsigned: true)
!81 = !DIEnumerator(name: "ICMP6_TYPE_MLR", value: 131, isUnsigned: true)
!82 = !DIEnumerator(name: "ICMP6_TYPE_MLD", value: 132, isUnsigned: true)
!83 = !DIEnumerator(name: "ICMP6_TYPE_RS", value: 133, isUnsigned: true)
!84 = !DIEnumerator(name: "ICMP6_TYPE_RA", value: 134, isUnsigned: true)
!85 = !DIEnumerator(name: "ICMP6_TYPE_NS", value: 135, isUnsigned: true)
!86 = !DIEnumerator(name: "ICMP6_TYPE_NA", value: 136, isUnsigned: true)
!87 = !DIEnumerator(name: "ICMP6_TYPE_RD", value: 137, isUnsigned: true)
!88 = !DIEnumerator(name: "ICMP6_TYPE_MRA", value: 151, isUnsigned: true)
!89 = !DIEnumerator(name: "ICMP6_TYPE_MRS", value: 152, isUnsigned: true)
!90 = !DIEnumerator(name: "ICMP6_TYPE_MRT", value: 153, isUnsigned: true)
!91 = !DIEnumerator(name: "ICMP6_TYPE_PE3", value: 200, isUnsigned: true)
!92 = !DIEnumerator(name: "ICMP6_TYPE_PE4", value: 201, isUnsigned: true)
!93 = !DIEnumerator(name: "ICMP6_TYPE_RSV_INF", value: 255, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 52, baseType: !7, size: 32, elements: !96)
!95 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/memp.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "MEMP_UDP_PCB", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "MEMP_TCP_PCB", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!111 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!112 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!113 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!115 = !{!116, !124, !147, !117, !152, !162, !170, !179, !180, !188, !199, !131, !206, !218, !227, !234, !235, !242, !247, !248}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !118, line: 125, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !120, line: 24, baseType: !121)
!120 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !122, line: 43, baseType: !123)
!122 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!123 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "na_header", file: !126, line: 71, size: 192, elements: !127)
!126 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/nd6.h", directory: "/root/.unikraft/apps/redis/build")
!127 = !{!128, !129, !130, !135, !136, !140}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !126, line: 72, baseType: !117, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !125, file: !126, line: 73, baseType: !117, size: 8, offset: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !125, file: !126, line: 74, baseType: !131, size: 16, offset: 16)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !118, line: 127, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !120, line: 36, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !122, line: 57, baseType: !134)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !126, line: 75, baseType: !117, size: 8, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !125, file: !126, line: 76, baseType: !137, size: 24, offset: 40)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 24, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "target_address", scope: !125, file: !126, line: 77, baseType: !141, size: 128, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !142, line: 60, baseType: !143)
!142 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !142, line: 53, size: 128, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !143, file: !142, line: 54, baseType: !146, size: 128)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !150)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !118, line: 129, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !120, line: 48, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !122, line: 79, baseType: !7)
!150 = !{!151}
!151 = !DISubrange(count: 4)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !142, line: 80, size: 320, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_v_tc_fl", scope: !154, file: !142, line: 82, baseType: !147, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_plen", scope: !154, file: !142, line: 84, baseType: !131, size: 16, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !154, file: !142, line: 86, baseType: !117, size: 8, offset: 48)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_hoplim", scope: !154, file: !142, line: 88, baseType: !117, size: 8, offset: 56)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !154, file: !142, line: 90, baseType: !141, size: 128, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !154, file: !142, line: 91, baseType: !141, size: 128, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !165, line: 67, baseType: !166)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !165, line: 59, size: 160, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !166, file: !165, line: 60, baseType: !146, size: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !166, file: !165, line: 62, baseType: !117, size: 8, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lladdr_option", file: !126, line: 160, size: 64, elements: !172)
!172 = !{!173, !174, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !126, line: 161, baseType: !117, size: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !171, file: !126, line: 162, baseType: !117, size: 8, offset: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !171, file: !126, line: 163, baseType: !176, size: 48, offset: 16)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 48, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 6)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_header", file: !126, line: 53, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !181, file: !126, line: 54, baseType: !117, size: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !181, file: !126, line: 55, baseType: !117, size: 8, offset: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !181, file: !126, line: 56, baseType: !131, size: 16, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !181, file: !126, line: 57, baseType: !147, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "target_address", scope: !181, file: !126, line: 58, baseType: !141, size: 128, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ra_header", file: !126, line: 118, size: 128, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !126, line: 119, baseType: !117, size: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !189, file: !126, line: 120, baseType: !117, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !189, file: !126, line: 121, baseType: !131, size: 16, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "current_hop_limit", scope: !189, file: !126, line: 122, baseType: !117, size: 8, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !126, line: 123, baseType: !117, size: 8, offset: 40)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "router_lifetime", scope: !189, file: !126, line: 124, baseType: !131, size: 16, offset: 48)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "reachable_time", scope: !189, file: !126, line: 125, baseType: !147, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_timer", scope: !189, file: !126, line: 126, baseType: !147, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtu_option", file: !126, line: 220, size: 64, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !126, line: 221, baseType: !117, size: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !200, file: !126, line: 222, baseType: !117, size: 8, offset: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !200, file: !126, line: 223, baseType: !131, size: 16, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !200, file: !126, line: 224, baseType: !147, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prefix_option", file: !126, line: 180, size: 256, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !126, line: 181, baseType: !117, size: 8)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !207, file: !126, line: 182, baseType: !117, size: 8, offset: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_length", scope: !207, file: !126, line: 183, baseType: !117, size: 8, offset: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !126, line: 184, baseType: !117, size: 8, offset: 24)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "valid_lifetime", scope: !207, file: !126, line: 185, baseType: !147, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_lifetime", scope: !207, file: !126, line: 186, baseType: !147, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !207, file: !126, line: 187, baseType: !137, size: 24, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "site_prefix_length", scope: !207, file: !126, line: 188, baseType: !117, size: 8, offset: 120)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !207, file: !126, line: 189, baseType: !141, size: 128, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redirect_header", file: !126, line: 139, size: 320, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !126, line: 140, baseType: !117, size: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !219, file: !126, line: 141, baseType: !117, size: 8, offset: 8)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !219, file: !126, line: 142, baseType: !131, size: 16, offset: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !219, file: !126, line: 143, baseType: !147, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "target_address", scope: !219, file: !126, line: 144, baseType: !141, size: 128, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "destination_address", scope: !219, file: !126, line: 145, baseType: !141, size: 128, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6_hdr", file: !69, line: 138, size: 64, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !69, line: 139, baseType: !117, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !228, file: !69, line: 140, baseType: !117, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !228, file: !69, line: 141, baseType: !131, size: 16, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !69, line: 142, baseType: !147, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rs_header", file: !126, line: 93, size: 64, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !126, line: 94, baseType: !117, size: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !236, file: !126, line: 95, baseType: !117, size: 8, offset: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !236, file: !126, line: 96, baseType: !131, size: 16, offset: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !236, file: !126, line: 97, baseType: !147, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 40, baseType: !244)
!243 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !245, line: 129, baseType: !246)
!245 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!246 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_addr_idx_t", file: !6, line: 244, baseType: !117)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nd6_q_entry", file: !12, line: 64, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !12, line: 65, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !249, file: !12, line: 66, baseType: !253, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !55, line: 186, size: 192, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !55, line: 188, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !254, file: !55, line: 191, baseType: !179, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !254, file: !55, line: 200, baseType: !131, size: 16, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !55, line: 203, baseType: !131, size: 16, offset: 144)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !254, file: !55, line: 208, baseType: !117, size: 8, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !55, line: 211, baseType: !117, size: 8, offset: 168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !254, file: !55, line: 218, baseType: !117, size: 8, offset: 176)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !254, file: !55, line: 221, baseType: !117, size: 8, offset: 184)
!264 = !{!0, !265, !267, !371, !380, !390, !399, !401, !403, !405, !407, !414, !438, !441}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "retrans_timer", scope: !2, file: !3, line: 84, type: !147, isLocal: false, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "neighbor_cache", scope: !2, file: !3, line: 77, type: !269, isLocal: false, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 4480, elements: !369)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nd6_neighbor_cache_entry", file: !12, line: 71, size: 448, elements: !271)
!271 = !{!272, !273, !358, !359, !360, !361, !362}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next_hop_address", scope: !270, file: !12, line: 72, baseType: !164, size: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "netif", scope: !270, file: !12, line: 73, baseType: !274, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !276)
!276 = !{!277, !278, !293, !294, !295, !297, !298, !300, !301, !311, !318, !323, !328, !333, !334, !335, !339, !340, !341, !342, !343, !344, !345, !350, !351, !352, !353}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !6, line: 263, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !275, file: !6, line: 268, baseType: !279, size: 192, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !49, line: 76, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !49, line: 69, size: 192, elements: !281)
!281 = !{!282, !292}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !280, file: !49, line: 73, baseType: !283, size: 160)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !280, file: !49, line: 70, size: 160, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !283, file: !49, line: 71, baseType: !164, size: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !283, file: !49, line: 72, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !288, line: 57, baseType: !289)
!288 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !288, line: 51, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !289, file: !288, line: 52, baseType: !147, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !49, line: 75, baseType: !117, size: 8, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !275, file: !6, line: 269, baseType: !279, size: 192, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !275, file: !6, line: 270, baseType: !279, size: 192, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !275, file: !6, line: 274, baseType: !296, size: 576, offset: 640)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 576, elements: !138)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !275, file: !6, line: 277, baseType: !137, size: 24, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !275, file: !6, line: 282, baseType: !299, size: 96, offset: 1248)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 96, elements: !138)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !275, file: !6, line: 283, baseType: !299, size: 96, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !275, file: !6, line: 288, baseType: !302, size: 64, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !253, !274}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !21, line: 96, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !118, line: 126, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !120, line: 20, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !122, line: 41, baseType: !310)
!310 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !275, file: !6, line: 294, baseType: !312, size: 64, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!306, !274, !253, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !275, file: !6, line: 299, baseType: !319, size: 64, offset: 1600)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!306, !274, !253}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !275, file: !6, line: 305, baseType: !324, size: 64, offset: 1664)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!306, !274, !253, !162}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !275, file: !6, line: 310, baseType: !329, size: 64, offset: 1728)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !274}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !275, file: !6, line: 319, baseType: !329, size: 64, offset: 1792)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !6, line: 323, baseType: !179, size: 64, offset: 1856)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !275, file: !6, line: 325, baseType: !336, size: 64, offset: 1920)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 1)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !275, file: !6, line: 332, baseType: !131, size: 16, offset: 1984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !275, file: !6, line: 335, baseType: !131, size: 16, offset: 2000)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !275, file: !6, line: 338, baseType: !131, size: 16, offset: 2016)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !275, file: !6, line: 341, baseType: !176, size: 48, offset: 2032)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !275, file: !6, line: 343, baseType: !117, size: 8, offset: 2080)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !6, line: 345, baseType: !117, size: 8, offset: 2088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !6, line: 347, baseType: !346, size: 16, offset: 2096)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 16, elements: !348)
!347 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!348 = !{!349}
!349 = !DISubrange(count: 2)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !275, file: !6, line: 350, baseType: !117, size: 8, offset: 2112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !275, file: !6, line: 353, baseType: !117, size: 8, offset: 2120)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !275, file: !6, line: 357, baseType: !117, size: 8, offset: 2128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !275, file: !6, line: 377, baseType: !354, size: 64, offset: 2176)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!306, !274, !162, !5}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lladdr", scope: !270, file: !12, line: 74, baseType: !176, size: 48, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !270, file: !12, line: 78, baseType: !248, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !270, file: !12, line: 83, baseType: !117, size: 8, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "isrouter", scope: !270, file: !12, line: 84, baseType: !117, size: 8, offset: 392)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !270, file: !12, line: 90, baseType: !363, size: 32, offset: 416)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !270, file: !12, line: 85, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reachable_time", scope: !363, file: !12, line: 86, baseType: !147, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "delay_time", scope: !363, file: !12, line: 87, baseType: !147, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "probes_sent", scope: !363, file: !12, line: 88, baseType: !147, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "stale_time", scope: !363, file: !12, line: 89, baseType: !147, size: 32)
!369 = !{!370}
!370 = !DISubrange(count: 10)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "destination_cache", scope: !2, file: !3, line: 78, type: !373, isLocal: false, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 3840, elements: !369)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nd6_destination_cache_entry", file: !12, line: 93, size: 384, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "destination_addr", scope: !374, file: !12, line: 94, baseType: !164, size: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next_hop_addr", scope: !374, file: !12, line: 95, baseType: !164, size: 160, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pmtu", scope: !374, file: !12, line: 96, baseType: !131, size: 16, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !374, file: !12, line: 97, baseType: !147, size: 32, offset: 352)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "prefix_list", scope: !2, file: !3, line: 79, type: !382, isLocal: false, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 1600, elements: !388)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nd6_prefix_list_entry", file: !12, line: 100, size: 320, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !383, file: !12, line: 101, baseType: !164, size: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "netif", scope: !383, file: !12, line: 102, baseType: !274, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "invalidation_timer", scope: !383, file: !12, line: 103, baseType: !147, size: 32, offset: 256)
!388 = !{!389}
!389 = !DISubrange(count: 5)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "default_router_list", scope: !2, file: !3, line: 80, type: !392, isLocal: false, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 384, elements: !138)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nd6_router_list_entry", file: !12, line: 106, size: 128, elements: !394)
!394 = !{!395, !397, !398}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "neighbor_entry", scope: !393, file: !12, line: 107, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "invalidation_timer", scope: !393, file: !12, line: 108, baseType: !147, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !12, line: 109, baseType: !117, size: 8, offset: 96)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "nd6_cached_neighbor_index", scope: !2, file: !3, line: 87, type: !117, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "nd6_cached_destination_index", scope: !2, file: !3, line: 88, type: !247, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "multicast_address", scope: !2, file: !3, line: 91, type: !164, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "nd6_tmr_rs_reduction", scope: !2, file: !3, line: 93, type: !117, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "nd6_ra_buffer", scope: !2, file: !3, line: 104, type: !409, isLocal: true, isDefinition: true)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ra_options", file: !3, line: 96, size: 256, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lladdr", scope: !409, file: !3, line: 97, baseType: !171, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !409, file: !3, line: 98, baseType: !200, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !409, file: !3, line: 99, baseType: !207, size: 256)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "__str", scope: !416, file: !417, line: 198, type: !435, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "uk_pr_crit", scope: !417, file: !417, line: 194, type: !418, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !422)
!417 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420, null}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!422 = !{!423, !424}
!423 = !DILocalVariable(name: "fmt", arg: 1, scope: !416, file: !417, line: 194, type: !420)
!424 = !DILocalVariable(name: "argp", scope: !416, file: !417, line: 196, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !426, line: 32, baseType: !427)
!426 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 192, elements: !337)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !429, file: !3, line: 196, baseType: !7, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !429, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !429, file: !3, line: 196, baseType: !179, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !429, file: !3, line: 196, baseType: !179, size: 64, offset: 128)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 64, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 8)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "__str", scope: !416, file: !417, line: 198, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 48, elements: !177)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "last_router", scope: !443, file: !3, line: 1674, type: !307, isLocal: true, isDefinition: true)
!443 = distinct !DISubprogram(name: "nd6_select_router", scope: !3, file: !3, line: 1670, type: !444, isLocal: true, isDefinition: true, scopeLine: 1671, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !446)
!444 = !DISubroutineType(types: !445)
!445 = !{!307, !162, !274}
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DILocalVariable(name: "ip6addr", arg: 1, scope: !443, file: !3, line: 1670, type: !162)
!448 = !DILocalVariable(name: "netif", arg: 2, scope: !443, file: !3, line: 1670, type: !274)
!449 = !DILocalVariable(name: "router_netif", scope: !443, file: !3, line: 1672, type: !274)
!450 = !DILocalVariable(name: "i", scope: !443, file: !3, line: 1673, type: !307)
!451 = !DILocalVariable(name: "j", scope: !443, file: !3, line: 1673, type: !307)
!452 = !DILocalVariable(name: "valid_router", scope: !443, file: !3, line: 1673, type: !307)
!453 = !{i32 2, !"Dwarf Version", i32 4}
!454 = !{i32 2, !"Debug Info Version", i32 3}
!455 = !{i32 1, !"wchar_size", i32 4}
!456 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!457 = distinct !DISubprogram(name: "nd6_input", scope: !3, file: !3, line: 287, type: !458, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !253, !274}
!460 = !{!461, !462, !463, !464, !465, !470, !473, !474, !475, !477, !478, !479, !480, !482, !483, !484, !486, !487, !488, !491, !493, !494, !496, !497, !502, !503, !505, !506, !507, !508, !510, !511, !512}
!461 = !DILocalVariable(name: "p", arg: 1, scope: !457, file: !3, line: 287, type: !253)
!462 = !DILocalVariable(name: "inp", arg: 2, scope: !457, file: !3, line: 287, type: !274)
!463 = !DILocalVariable(name: "msg_type", scope: !457, file: !3, line: 289, type: !117)
!464 = !DILocalVariable(name: "i", scope: !457, file: !3, line: 290, type: !307)
!465 = !DILocalVariable(name: "dest_idx", scope: !457, file: !3, line: 291, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !118, line: 128, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !120, line: 32, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !122, line: 55, baseType: !469)
!469 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!470 = !DILocalVariable(name: "na_hdr", scope: !471, file: !3, line: 299, type: !124)
!471 = distinct !DILexicalBlock(scope: !472, file: !3, line: 298, column: 3)
!472 = distinct !DILexicalBlock(scope: !457, file: !3, line: 296, column: 21)
!473 = !DILocalVariable(name: "lladdr_opt", scope: !471, file: !3, line: 300, type: !170)
!474 = !DILocalVariable(name: "target_address", scope: !471, file: !3, line: 301, type: !164)
!475 = !DILocalVariable(name: "ns_hdr", scope: !476, file: !3, line: 429, type: !180)
!476 = distinct !DILexicalBlock(scope: !472, file: !3, line: 428, column: 3)
!477 = !DILocalVariable(name: "lladdr_opt", scope: !476, file: !3, line: 430, type: !170)
!478 = !DILocalVariable(name: "target_address", scope: !476, file: !3, line: 431, type: !164)
!479 = !DILocalVariable(name: "accepted", scope: !476, file: !3, line: 432, type: !117)
