; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netbuf.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netbuf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.netbuf = type { %struct.pbuf*, %struct.pbuf*, %struct.ip_addr, i16 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [26 x i8] c"netbuf_alloc: invalid buf\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Assertion failure: %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"!(1)\00", align 1
@.str.3 = private unnamed_addr constant [36 x i8] c"check that first pbuf can hold size\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"netbuf_free: invalid buf\00", align 1
@.str.5 = private unnamed_addr constant [24 x i8] c"netbuf_ref: invalid buf\00", align 1
@.str.6 = private unnamed_addr constant [27 x i8] c"netbuf_chain: invalid head\00", align 1
@.str.7 = private unnamed_addr constant [27 x i8] c"netbuf_chain: invalid tail\00", align 1
@.str.8 = private unnamed_addr constant [25 x i8] c"netbuf_data: invalid buf\00", align 1

!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !76, globals: !142)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netbuf.c", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !34, !41, !49, !55}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 52, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/memp.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!16 = !DIEnumerator(name: "MEMP_UDP_PCB", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "MEMP_TCP_PCB", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!27 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!28 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!29 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!30 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!31 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!32 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!33 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !35, line: 68, baseType: !14, size: 32, elements: !36)
!35 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 89, baseType: !14, size: 32, elements: !43)
!42 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!45 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!46 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!47 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 145, baseType: !14, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!52 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!54 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 53, baseType: !57, size: 32, elements: !58)
!56 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!59 = !DIEnumerator(name: "ERR_OK", value: 0)
!60 = !DIEnumerator(name: "ERR_MEM", value: -1)
!61 = !DIEnumerator(name: "ERR_BUF", value: -2)
!62 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!63 = !DIEnumerator(name: "ERR_RTE", value: -4)
!64 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!65 = !DIEnumerator(name: "ERR_VAL", value: -6)
!66 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!67 = !DIEnumerator(name: "ERR_USE", value: -8)
!68 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!69 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!70 = !DIEnumerator(name: "ERR_CONN", value: -11)
!71 = !DIEnumerator(name: "ERR_IF", value: -12)
!72 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!73 = !DIEnumerator(name: "ERR_RST", value: -14)
!74 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!75 = !DIEnumerator(name: "ERR_ARG", value: -16)
!76 = !{!77, !87, !135}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netbuf", file: !79, line: 60, size: 384, elements: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !{!81, !105, !106, !134}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !78, file: !79, line: 61, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !42, line: 186, size: 192, elements: !84)
!84 = !{!85, !86, !88, !96, !97, !102, !103, !104}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !42, line: 188, baseType: !82, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !83, file: !42, line: 191, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !83, file: !42, line: 200, baseType: !89, size: 16, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !90, line: 127, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !92, line: 36, baseType: !93)
!92 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !94, line: 57, baseType: !95)
!94 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !83, file: !42, line: 203, baseType: !89, size: 16, offset: 144)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !83, file: !42, line: 208, baseType: !98, size: 8, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !90, line: 125, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !92, line: 24, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !94, line: 43, baseType: !101)
!101 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !83, file: !42, line: 211, baseType: !98, size: 8, offset: 168)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !83, file: !42, line: 218, baseType: !98, size: 8, offset: 176)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !83, file: !42, line: 221, baseType: !98, size: 8, offset: 184)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !78, file: !79, line: 61, baseType: !82, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !78, file: !79, line: 62, baseType: !107, size: 192, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !108, line: 76, baseType: !109)
!108 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !108, line: 69, size: 192, elements: !110)
!110 = !{!111, !133}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !109, file: !108, line: 73, baseType: !112, size: 160)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !109, file: !108, line: 70, size: 160, elements: !113)
!113 = !{!114, !127}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !112, file: !108, line: 71, baseType: !115, size: 160)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !116, line: 67, baseType: !117)
!116 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !116, line: 59, size: 160, elements: !118)
!118 = !{!119, !126}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !117, file: !116, line: 60, baseType: !120, size: 128)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !124)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !90, line: 129, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !92, line: 48, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !94, line: 79, baseType: !14)
!124 = !{!125}
!125 = !DISubrange(count: 4)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !117, file: !116, line: 62, baseType: !98, size: 8, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !112, file: !108, line: 72, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !129, line: 57, baseType: !130)
!129 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !129, line: 51, size: 32, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !130, file: !129, line: 52, baseType: !121, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !108, line: 75, baseType: !98, size: 8, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !78, file: !79, line: 63, baseType: !89, size: 16, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf_rom", file: !42, line: 229, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !42, line: 231, baseType: !82, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !136, file: !42, line: 234, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!142 = !{!0, !143}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 72, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 9)
!148 = !{!149, !150}
!149 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!150 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !152, line: 32, baseType: !153)
!152 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 192, elements: !161)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !155, file: !10, line: 196, baseType: !14, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !155, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !155, file: !10, line: 196, baseType: !87, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !155, file: !10, line: 196, baseType: !87, size: 64, offset: 128)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 8)
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!170 = distinct !DISubprogram(name: "netbuf_new", scope: !10, file: !10, line: 63, type: !171, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !173)
!171 = !DISubroutineType(types: !172)
!172 = !{!77}
!173 = !{!174}
!174 = !DILocalVariable(name: "buf", scope: !170, file: !10, line: 65, type: !77)
!175 = !DILocation(line: 67, column: 26, scope: !170)
!176 = !DILocation(line: 67, column: 9, scope: !170)
!177 = !DILocation(line: 65, column: 18, scope: !170)
!178 = !DILocation(line: 68, column: 11, scope: !179)
!179 = distinct !DILexicalBlock(scope: !170, file: !10, line: 68, column: 7)
!180 = !DILocation(line: 68, column: 7, scope: !170)
!181 = !DILocation(line: 69, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !179, file: !10, line: 68, column: 20)
!183 = !DILocation(line: 70, column: 3, scope: !182)
!184 = !DILocation(line: 71, column: 3, scope: !170)
!185 = distinct !DISubprogram(name: "netbuf_delete", scope: !10, file: !10, line: 81, type: !186, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !188)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !77}
!188 = !{!189}
!189 = !DILocalVariable(name: "buf", arg: 1, scope: !185, file: !10, line: 81, type: !77)
!190 = !DILocation(line: 81, column: 30, scope: !185)
!191 = !DILocation(line: 83, column: 11, scope: !192)
!192 = distinct !DILexicalBlock(scope: !185, file: !10, line: 83, column: 7)
!193 = !DILocation(line: 83, column: 7, scope: !185)
!194 = !DILocation(line: 84, column: 14, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !10, line: 84, column: 9)
!196 = distinct !DILexicalBlock(scope: !192, file: !10, line: 83, column: 20)
!197 = !{!198, !199, i64 0}
!198 = !{!"netbuf", !199, i64 0, !199, i64 8, !202, i64 16, !203, i64 40}
!199 = !{!"any pointer", !200, i64 0}
!200 = !{!"omnipotent char", !201, i64 0}
!201 = !{!"Simple C/C++ TBAA"}
!202 = !{!"ip_addr", !200, i64 0, !200, i64 20}
!203 = !{!"short", !200, i64 0}
!204 = !DILocation(line: 84, column: 16, scope: !195)
!205 = !DILocation(line: 84, column: 9, scope: !196)
!206 = !DILocation(line: 85, column: 7, scope: !207)
!207 = distinct !DILexicalBlock(scope: !195, file: !10, line: 84, column: 25)
!208 = !DILocation(line: 86, column: 14, scope: !207)
!209 = !{!199, !199, i64 0}
!210 = !DILocation(line: 87, column: 5, scope: !207)
!211 = !DILocation(line: 88, column: 28, scope: !196)
!212 = !DILocation(line: 88, column: 5, scope: !196)
!213 = !DILocation(line: 89, column: 3, scope: !196)
!214 = !DILocation(line: 90, column: 1, scope: !185)
!215 = distinct !DISubprogram(name: "netbuf_alloc", scope: !10, file: !10, line: 102, type: !216, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!87, !77, !89}
!218 = !{!219, !220}
!219 = !DILocalVariable(name: "buf", arg: 1, scope: !215, file: !10, line: 102, type: !77)
!220 = !DILocalVariable(name: "size", arg: 2, scope: !215, file: !10, line: 102, type: !89)
!221 = !DILocation(line: 102, column: 29, scope: !215)
!222 = !DILocation(line: 102, column: 40, scope: !215)
!223 = !DILocation(line: 104, column: 3, scope: !224)
!224 = distinct !DILexicalBlock(scope: !225, file: !10, line: 104, column: 3)
!225 = distinct !DILexicalBlock(scope: !215, file: !10, line: 104, column: 3)
