; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netdb.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netdb.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.hostent = type { i8*, i8**, i32, i32, i8** }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, {}*, {}*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i8, i8, [14 x i8] }
%struct.sockaddr_storage = type { i8, i8, [2 x i8], [3 x i32], [3 x i32] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@lwip_gethostbyname.s_hostent = internal global %struct.hostent zeroinitializer, align 8, !dbg !0
@lwip_gethostbyname.s_aliases = internal global i8* null, align 8, !dbg !186
@lwip_gethostbyname.s_hostent_addr = internal global %struct.ip_addr zeroinitializer, align 4, !dbg !188

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s_hostent", scope: !2, file: !3, line: 94, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "lwip_gethostbyname", scope: !3, file: !3, line: 88, type: !4, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !222)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netdb.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !19}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !8, line: 92, size: 256, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netdb.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !13, !15, !17, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !7, file: !8, line: 93, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !7, file: !8, line: 94, baseType: !14, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !7, file: !8, line: 96, baseType: !16, size: 32, offset: 128)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !7, file: !8, line: 97, baseType: !16, size: 32, offset: 160)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !7, file: !8, line: 98, baseType: !14, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!21 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !57, globals: !185)
!22 = !{!23, !43, !50}
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 53, baseType: !16, size: 32, elements: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!26 = !DIEnumerator(name: "ERR_OK", value: 0)
!27 = !DIEnumerator(name: "ERR_MEM", value: -1)
!28 = !DIEnumerator(name: "ERR_BUF", value: -2)
!29 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!30 = !DIEnumerator(name: "ERR_RTE", value: -4)
!31 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!32 = !DIEnumerator(name: "ERR_VAL", value: -6)
!33 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!34 = !DIEnumerator(name: "ERR_USE", value: -8)
!35 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!36 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!37 = !DIEnumerator(name: "ERR_CONN", value: -11)
!38 = !DIEnumerator(name: "ERR_IF", value: -12)
!39 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!40 = !DIEnumerator(name: "ERR_RST", value: -14)
!41 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!42 = !DIEnumerator(name: "ERR_ARG", value: -16)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !44, line: 54, baseType: !45, size: 32, elements: !46)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !51, line: 68, baseType: !45, size: 32, elements: !52)
!51 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!57 = !{!14, !58, !59, !102, !11, !105, !106, !78, !108, !131, !143, !144, !151, !169, !119, !184}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gethostbyname_r_helper", file: !3, line: 54, size: 384, elements: !61)
!61 = !{!62, !100, !101}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !60, file: !3, line: 55, baseType: !63, size: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !98)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !44, line: 76, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !44, line: 69, size: 192, elements: !67)
!67 = !{!68, !97}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !66, file: !44, line: 73, baseType: !69, size: 160)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !44, line: 70, size: 160, elements: !70)
!70 = !{!71, !91}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !69, file: !44, line: 71, baseType: !72, size: 160)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !73, line: 67, baseType: !74)
!73 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !73, line: 59, size: 160, elements: !75)
!75 = !{!76, !86}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !74, file: !73, line: 60, baseType: !77, size: 128)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !84)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !79, line: 129, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !81, line: 48, baseType: !82)
!81 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !83, line: 79, baseType: !45)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !{!85}
!85 = !DISubrange(count: 4)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !74, file: !73, line: 62, baseType: !87, size: 8, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !79, line: 125, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !81, line: 24, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !83, line: 43, baseType: !90)
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !69, file: !44, line: 72, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !93, line: 57, baseType: !94)
!93 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !93, line: 51, size: 32, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !94, file: !93, line: 52, baseType: !78, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !44, line: 75, baseType: !87, size: 8, offset: 160)
!98 = !{!99}
!99 = !DISubrange(count: 2)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !60, file: !3, line: 56, baseType: !65, size: 192, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !60, file: !3, line: 57, baseType: !11, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_ptr_t", file: !79, line: 135, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !81, line: 82, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !83, line: 232, baseType: !105)
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !81, line: 60, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !83, line: 105, baseType: !105)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !8, line: 103, size: 384, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !118, !129, !130}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !109, file: !8, line: 104, baseType: !16, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !109, file: !8, line: 105, baseType: !16, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !109, file: !8, line: 106, baseType: !16, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !109, file: !8, line: 107, baseType: !16, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !109, file: !8, line: 108, baseType: !116, size: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !117, line: 113, baseType: !78)
!117 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/sockets.h", directory: "/root/.unikraft/apps/redis/build")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !109, file: !8, line: 109, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !117, line: 94, size: 128, elements: !121)
!121 = !{!122, !123, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !120, file: !117, line: 95, baseType: !87, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !120, file: !117, line: 96, baseType: !124, size: 8, offset: 8)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !117, line: 63, baseType: !87)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !120, file: !117, line: 97, baseType: !126, size: 112, offset: 16)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 112, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 14)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !109, file: !8, line: 110, baseType: !11, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !109, file: !8, line: 111, baseType: !108, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !117, line: 100, size: 224, elements: !133)
!133 = !{!134, !135, !136, !138, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "s2_len", scope: !132, file: !117, line: 101, baseType: !87, size: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !132, file: !117, line: 102, baseType: !124, size: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "s2_data1", scope: !132, file: !117, line: 103, baseType: !137, size: 16, offset: 16)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16, elements: !98)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "s2_data2", scope: !132, file: !117, line: 104, baseType: !139, size: 96, offset: 32)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 96, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "s2_data3", scope: !132, file: !117, line: 106, baseType: !139, size: 96, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !117, line: 84, size: 224, elements: !146)
!146 = !{!147, !148, !149, !155, !156, !168}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !145, file: !117, line: 85, baseType: !87, size: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !145, file: !117, line: 86, baseType: !124, size: 8, offset: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !145, file: !117, line: 87, baseType: !150, size: 16, offset: 16)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !117, line: 68, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !79, line: 127, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !81, line: 36, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !83, line: 57, baseType: !154)
!154 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !145, file: !117, line: 88, baseType: !78, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !145, file: !117, line: 89, baseType: !157, size: 128, offset: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !158, line: 62, size: 128, elements: !159)
!158 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/inet.h", directory: "/root/.unikraft/apps/redis/build")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !157, file: !158, line: 66, baseType: !161, size: 128)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !157, file: !158, line: 63, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "u32_addr", scope: !161, file: !158, line: 64, baseType: !77, size: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "u8_addr", scope: !161, file: !158, line: 65, baseType: !165, size: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !145, file: !117, line: 90, baseType: !78, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !117, line: 73, size: 128, elements: !171)
!171 = !{!172, !173, !174, !175, !180}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !170, file: !117, line: 74, baseType: !87, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !170, file: !117, line: 75, baseType: !124, size: 8, offset: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !170, file: !117, line: 76, baseType: !150, size: 16, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !170, file: !117, line: 77, baseType: !176, size: 32, offset: 32)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !158, line: 58, size: 32, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !176, file: !158, line: 59, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !158, line: 55, baseType: !78)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !170, file: !117, line: 79, baseType: !181, size: 64, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!185 = !{!0, !186, !188, !190, !192, !197, !199, !220}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "s_aliases", scope: !2, file: !3, line: 95, type: !11, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "s_hostent_addr", scope: !2, file: !3, line: 96, type: !65, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "s_phostent_addr", scope: !2, file: !3, line: 97, type: !63, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "s_hostname", scope: !2, file: !3, line: 98, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2056, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 257)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "h_errno", scope: !21, file: !3, line: 62, type: !16, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "__str", scope: !201, file: !202, line: 198, type: !181, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "uk_pr_crit", scope: !202, file: !202, line: 194, type: !203, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !205)
!202 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!203 = !DISubroutineType(types: !204)
!204 = !{null, !19, null}
!205 = !{!206, !207}
!206 = !DILocalVariable(name: "fmt", arg: 1, scope: !201, file: !202, line: 194, type: !19)
!207 = !DILocalVariable(name: "argp", scope: !201, file: !202, line: 196, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !209, line: 32, baseType: !210)
!209 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 192, elements: !218)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !212, file: !3, line: 196, baseType: !45, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !212, file: !3, line: 196, baseType: !45, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !212, file: !3, line: 196, baseType: !58, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !212, file: !3, line: 196, baseType: !58, size: 64, offset: 128)
!218 = !{!219}
!219 = !DISubrange(count: 1)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "__str", scope: !201, file: !202, line: 198, type: !181, isLocal: true, isDefinition: true)
!222 = !{!223, !224, !230}
!223 = !DILocalVariable(name: "name", arg: 1, scope: !2, file: !3, line: 88, type: !19)
!224 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 90, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !24, line: 96, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !79, line: 126, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !81, line: 20, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !83, line: 41, baseType: !229)
!229 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!230 = !DILocalVariable(name: "addr", scope: !2, file: !3, line: 91, type: !65)
!231 = !{i32 2, !"Dwarf Version", i32 4}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!235 = !DILocation(line: 88, column: 32, scope: !2)
!236 = !DILocation(line: 91, column: 3, scope: !2)
!237 = !DILocation(line: 91, column: 13, scope: !2)
!238 = !DILocation(line: 101, column: 9, scope: !2)
!239 = !DILocation(line: 90, column: 9, scope: !2)
!240 = !DILocation(line: 102, column: 11, scope: !241)
!241 = distinct !DILexicalBlock(scope: !2, file: !3, line: 102, column: 7)
!242 = !DILocation(line: 102, column: 7, scope: !2)
!243 = !DILocation(line: 104, column: 13, scope: !244)
!244 = distinct !DILexicalBlock(scope: !241, file: !3, line: 102, column: 22)
!245 = !{!246, !246, i64 0}
!246 = !{!"int", !247, i64 0}
!247 = !{!"omnipotent char", !248, i64 0}
!248 = !{!"Simple C/C++ TBAA"}
!249 = !DILocation(line: 105, column: 5, scope: !244)
!250 = !DILocation(line: 109, column: 20, scope: !2)
!251 = !{i64 0, i64 16, !252, i64 16, i64 1, !252, i64 0, i64 4, !245, i64 20, i64 1, !252}
!252 = !{!247, !247, i64 0}
!253 = !DILocation(line: 110, column: 22, scope: !2)
!254 = !{!255, !255, i64 0}
!255 = !{!"any pointer", !247, i64 0}
!256 = !DILocation(line: 112, column: 3, scope: !2)
!257 = !DILocation(line: 113, column: 35, scope: !2)
!258 = !DILocation(line: 114, column: 20, scope: !2)
!259 = !{!260, !255, i64 0}
!260 = !{!"hostent", !255, i64 0, !255, i64 8, !246, i64 16, !246, i64 20, !255, i64 24}
!261 = !DILocation(line: 115, column: 13, scope: !2)
!262 = !DILocation(line: 116, column: 23, scope: !2)
!263 = !{!260, !255, i64 8}
!264 = !DILocation(line: 117, column: 24, scope: !2)
!265 = !{!260, !246, i64 16}
!266 = !DILocation(line: 118, column: 22, scope: !2)
!267 = !{!260, !246, i64 20}
!268 = !DILocation(line: 119, column: 25, scope: !2)
!269 = !{!260, !255, i64 24}
!270 = !DILocation(line: 142, column: 3, scope: !2)
!271 = !DILocation(line: 0, scope: !2)
!272 = !DILocation(line: 0, scope: !244)
!273 = !DILocation(line: 144, column: 1, scope: !2)
!274 = distinct !DISubprogram(name: "lwip_gethostbyname_r", scope: !3, file: !3, line: 163, type: !275, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !282)
!275 = !DISubroutineType(types: !276)
!276 = !{!16, !19, !6, !11, !277, !281, !184}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !278, line: 40, baseType: !279)
!278 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !280, line: 129, baseType: !105)
!280 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!283 = !DILocalVariable(name: "name", arg: 1, scope: !274, file: !3, line: 163, type: !19)
!284 = !DILocalVariable(name: "ret", arg: 2, scope: !274, file: !3, line: 163, type: !6)
!285 = !DILocalVariable(name: "buf", arg: 3, scope: !274, file: !3, line: 163, type: !11)
!286 = !DILocalVariable(name: "buflen", arg: 4, scope: !274, file: !3, line: 164, type: !277)
!287 = !DILocalVariable(name: "result", arg: 5, scope: !274, file: !3, line: 164, type: !281)
!288 = !DILocalVariable(name: "h_errnop", arg: 6, scope: !274, file: !3, line: 164, type: !184)
!289 = !DILocalVariable(name: "err", scope: !274, file: !3, line: 166, type: !225)
!290 = !DILocalVariable(name: "h", scope: !274, file: !3, line: 167, type: !59)
!291 = !DILocalVariable(name: "hostname", scope: !274, file: !3, line: 168, type: !11)
!292 = !DILocalVariable(name: "namelen", scope: !274, file: !3, line: 169, type: !277)
!293 = !DILocalVariable(name: "lh_errno", scope: !274, file: !3, line: 170, type: !16)
!294 = !DILocation(line: 163, column: 34, scope: !274)
!295 = !DILocation(line: 163, column: 56, scope: !274)
!296 = !DILocation(line: 163, column: 67, scope: !274)
!297 = !DILocation(line: 164, column: 29, scope: !274)
!298 = !DILocation(line: 164, column: 54, scope: !274)
!299 = !DILocation(line: 164, column: 67, scope: !274)
!300 = !DILocation(line: 170, column: 3, scope: !274)
!301 = !DILocation(line: 172, column: 16, scope: !302)
!302 = distinct !DILexicalBlock(scope: !274, file: !3, line: 172, column: 7)
!303 = !DILocation(line: 172, column: 7, scope: !274)
!304 = !DILocation(line: 175, column: 3, scope: !305)
!305 = distinct !DILexicalBlock(scope: !302, file: !3, line: 172, column: 25)
!306 = !DILocation(line: 177, column: 14, scope: !307)
!307 = distinct !DILexicalBlock(scope: !274, file: !3, line: 177, column: 7)
!308 = !DILocation(line: 177, column: 7, scope: !274)
!309 = !DILocation(line: 179, column: 15, scope: !310)
!310 = distinct !DILexicalBlock(scope: !307, file: !3, line: 177, column: 23)
!311 = !DILocation(line: 180, column: 5, scope: !310)
!312 = !DILocation(line: 183, column: 11, scope: !274)
!313 = !DILocation(line: 184, column: 13, scope: !314)
!314 = distinct !DILexicalBlock(scope: !274, file: !3, line: 184, column: 7)
!315 = !DILocation(line: 184, column: 30, scope: !314)
!316 = !DILocation(line: 184, column: 22, scope: !314)
!317 = !DILocation(line: 184, column: 47, scope: !314)
!318 = !DILocation(line: 186, column: 15, scope: !319)
!319 = distinct !DILexicalBlock(scope: !314, file: !3, line: 184, column: 57)
!320 = !DILocation(line: 187, column: 5, scope: !319)
!321 = !DILocation(line: 190, column: 13, scope: !274)
!322 = !DILocation(line: 169, column: 10, scope: !274)
!323 = !DILocation(line: 191, column: 55, scope: !324)
!324 = distinct !DILexicalBlock(scope: !274, file: !3, line: 191, column: 7)
!325 = !DILocation(line: 191, column: 14, scope: !324)
!326 = !DILocation(line: 191, column: 7, scope: !274)
!327 = !DILocation(line: 193, column: 15, scope: !328)
!328 = distinct !DILexicalBlock(scope: !324, file: !3, line: 191, column: 94)
!329 = !DILocation(line: 194, column: 5, scope: !328)
!330 = !DILocation(line: 198, column: 26, scope: !274)
!331 = !DILocation(line: 168, column: 9, scope: !274)
!332 = !DILocation(line: 201, column: 9, scope: !274)
!333 = !DILocation(line: 166, column: 9, scope: !274)
!334 = !DILocation(line: 202, column: 11, scope: !335)
!335 = distinct !DILexicalBlock(scope: !274, file: !3, line: 202, column: 7)
!336 = !DILocation(line: 202, column: 7, scope: !274)
!337 = !DILocation(line: 204, column: 15, scope: !338)
!338 = distinct !DILexicalBlock(scope: !335, file: !3, line: 202, column: 22)
!339 = !DILocation(line: 205, column: 5, scope: !338)
!340 = !DILocation(line: 167, column: 34, scope: !274)
!341 = !DILocation(line: 209, column: 3, scope: !274)
!342 = !DILocation(line: 210, column: 3, scope: !274)
!343 = !DILocation(line: 210, column: 21, scope: !274)
!344 = !DILocation(line: 213, column: 19, scope: !274)
!345 = !DILocation(line: 214, column: 3, scope: !274)
!346 = !DILocation(line: 214, column: 19, scope: !274)
!347 = !DILocation(line: 215, column: 6, scope: !274)
!348 = !DILocation(line: 215, column: 14, scope: !274)
!349 = !{!350, !255, i64 40}
!350 = !{!"gethostbyname_r_helper", !247, i64 0, !351, i64 16, !255, i64 40}
!351 = !{!"ip_addr", !247, i64 0, !247, i64 20}
!352 = !DILocation(line: 216, column: 8, scope: !274)
!353 = !DILocation(line: 216, column: 15, scope: !274)
!354 = !DILocation(line: 217, column: 8, scope: !274)
!355 = !DILocation(line: 217, column: 18, scope: !274)
!356 = !DILocation(line: 218, column: 8, scope: !274)
!357 = !DILocation(line: 218, column: 19, scope: !274)
!358 = !DILocation(line: 219, column: 8, scope: !274)
!359 = !DILocation(line: 219, column: 17, scope: !274)
!360 = !DILocation(line: 220, column: 8, scope: !274)
!361 = !DILocation(line: 220, column: 20, scope: !274)
!362 = !DILocation(line: 223, column: 11, scope: !274)
!363 = !DILocation(line: 226, column: 3, scope: !274)
!364 = !DILocation(line: 0, scope: !274)
!365 = !DILocation(line: 0, scope: !310)
!366 = !DILocation(line: 227, column: 1, scope: !274)
!367 = distinct !DISubprogram(name: "lwip_freeaddrinfo", scope: !3, file: !3, line: 237, type: !368, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !370)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !108}
!370 = !{!371, !372}
!371 = !DILocalVariable(name: "ai", arg: 1, scope: !367, file: !3, line: 237, type: !108)
!372 = !DILocalVariable(name: "next", scope: !367, file: !3, line: 239, type: !108)
!373 = !DILocation(line: 237, column: 36, scope: !367)
!374 = !DILocation(line: 241, column: 3, scope: !367)
!375 = !DILocation(line: 241, column: 13, scope: !367)
!376 = !DILocation(line: 242, column: 16, scope: !377)
!377 = distinct !DILexicalBlock(scope: !367, file: !3, line: 241, column: 22)
!378 = !{!379, !255, i64 40}
!379 = !{!"addrinfo", !246, i64 0, !246, i64 4, !246, i64 8, !246, i64 12, !246, i64 16, !255, i64 24, !255, i64 32, !255, i64 40}
!380 = !DILocation(line: 239, column: 20, scope: !367)
!381 = !DILocation(line: 243, column: 13, scope: !377)
!382 = !DILocalVariable(name: "a", arg: 1, scope: !383, file: !384, line: 237, type: !387)
!383 = distinct !DISubprogram(name: "uk_free", scope: !384, file: !384, line: 237, type: !385, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !441)
!384 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387, !58}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !384, line: 77, size: 832, elements: !389)
!389 = !{!390, !397, !402, !407, !413, !415, !418, !419, !420, !425, !430, !435, !436, !437}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !388, file: !384, line: 79, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !384, line: 54, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!58, !387, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !396, line: 58, baseType: !105)
!396 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!397 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !388, file: !384, line: 80, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !384, line: 56, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!58, !387, !395, !395}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !388, file: !384, line: 81, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !384, line: 62, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!58, !387, !58, !395}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !388, file: !384, line: 82, baseType: !408, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !384, line: 58, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!16, !387, !412, !395, !395}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !388, file: !384, line: 83, baseType: !414, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !384, line: 60, baseType: !399)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !388, file: !384, line: 84, baseType: !416, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !384, line: 64, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !388, file: !384, line: 87, baseType: !416, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !388, file: !384, line: 88, baseType: !391, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !388, file: !384, line: 92, baseType: !421, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !384, line: 66, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!58, !387, !105}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !388, file: !384, line: 93, baseType: !426, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !384, line: 68, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !387, !58, !105}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !388, file: !384, line: 99, baseType: !431, size: 64, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !384, line: 70, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!16, !387, !58, !395}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !388, file: !384, line: 100, baseType: !395, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !384, line: 103, baseType: !387, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !388, file: !384, line: 104, baseType: !438, offset: 832)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: -1)
!441 = !{!382, !442}
!442 = !DILocalVariable(name: "ptr", arg: 2, scope: !383, file: !384, line: 237, type: !58)
!443 = !DILocation(line: 237, column: 45, scope: !383, inlinedAt: !444)
!444 = distinct !DILocation(line: 243, column: 5, scope: !377)
!445 = !DILocalVariable(name: "a", arg: 1, scope: !446, file: !384, line: 231, type: !387)
!446 = distinct !DISubprogram(name: "uk_do_free", scope: !384, file: !384, line: 231, type: !385, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !447)
!447 = !{!445, !448}
!448 = !DILocalVariable(name: "ptr", arg: 2, scope: !446, file: !384, line: 231, type: !58)
!449 = !DILocation(line: 231, column: 48, scope: !446, inlinedAt: !450)
!450 = distinct !DILocation(line: 239, column: 2, scope: !383, inlinedAt: !444)
!451 = !DILocation(line: 233, column: 2, scope: !452, inlinedAt: !450)
!452 = distinct !DILexicalBlock(scope: !453, file: !384, line: 233, column: 2)
!453 = distinct !DILexicalBlock(scope: !446, file: !384, line: 233, column: 2)
!454 = !DILocation(line: 233, column: 2, scope: !453, inlinedAt: !450)
!455 = !{!"branch_weights", i32 1, i32 2000}
!456 = !DILocation(line: 233, column: 2, scope: !457, inlinedAt: !450)
!457 = distinct !DILexicalBlock(scope: !452, file: !384, line: 233, column: 2)
!458 = !DILocation(line: 243, column: 34, scope: !377)
!459 = !DILocation(line: 231, column: 57, scope: !446, inlinedAt: !450)
!460 = !DILocation(line: 237, column: 54, scope: !383, inlinedAt: !444)
!461 = !DILocation(line: 234, column: 5, scope: !446, inlinedAt: !450)
!462 = !DILocation(line: 234, column: 2, scope: !446, inlinedAt: !450)
!463 = !DILocation(line: 235, column: 1, scope: !446, inlinedAt: !450)
!464 = !DILocation(line: 240, column: 1, scope: !383, inlinedAt: !444)
!465 = distinct !{!465, !374, !466}
!466 = !DILocation(line: 245, column: 3, scope: !367)
!467 = !DILocation(line: 246, column: 1, scope: !367)
!468 = distinct !DISubprogram(name: "lwip_getaddrinfo", scope: !3, file: !3, line: 270, type: !469, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !474)
!469 = !DISubroutineType(types: !470)
!470 = !{!16, !19, !19, !471, !473}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !495, !496, !501, !504}
!475 = !DILocalVariable(name: "nodename", arg: 1, scope: !468, file: !3, line: 270, type: !19)
!476 = !DILocalVariable(name: "servname", arg: 2, scope: !468, file: !3, line: 270, type: !19)
!477 = !DILocalVariable(name: "hints", arg: 3, scope: !468, file: !3, line: 271, type: !471)
!478 = !DILocalVariable(name: "res", arg: 4, scope: !468, file: !3, line: 271, type: !473)
!479 = !DILocalVariable(name: "err", scope: !468, file: !3, line: 273, type: !225)
!480 = !DILocalVariable(name: "addr", scope: !468, file: !3, line: 274, type: !65)
!481 = !DILocalVariable(name: "ai", scope: !468, file: !3, line: 275, type: !108)
!482 = !DILocalVariable(name: "sa", scope: !468, file: !3, line: 276, type: !131)
!483 = !DILocalVariable(name: "port_nr", scope: !468, file: !3, line: 277, type: !16)
!484 = !DILocalVariable(name: "total_size", scope: !468, file: !3, line: 278, type: !277)
!485 = !DILocalVariable(name: "namelen", scope: !468, file: !3, line: 279, type: !277)
!486 = !DILocalVariable(name: "ai_family", scope: !468, file: !3, line: 280, type: !16)
!487 = !DILocalVariable(name: "tid", scope: !488, file: !3, line: 309, type: !80)
