; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !36, !74, !77, !81, !64, !82, !113, !114, !115, !125, !136, !146, !155}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !8, line: 82, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !8, line: 76, size: 768, elements: !10)
!10 = !{!11, !42, !43, !72, !73}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 77, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !8, line: 65, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !8, line: 58, size: 384, elements: !15)
!15 = !{!16, !27, !31, !32, !37, !41}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !14, file: !8, line: 59, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !25}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !21, line: 60, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !14, file: !8, line: 60, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !4, !25}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !14, file: !8, line: 61, baseType: !28, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !14, file: !8, line: 62, baseType: !33, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !4, !25, !25}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !14, file: !8, line: 63, baseType: !38, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !4, !4}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !14, file: !8, line: 64, baseType: !38, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !9, file: !8, line: 78, baseType: !4, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !9, file: !8, line: 79, baseType: !44, size: 512, offset: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !70)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !8, line: 74, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !8, line: 69, size: 256, elements: !47)
!47 = !{!48, !67, !68, !69}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !8, line: 70, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !8, line: 56, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !8, line: 47, size: 192, elements: !53)
!53 = !{!54, !55, !65}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !52, file: !8, line: 48, baseType: !4, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !52, file: !8, line: 54, baseType: !56, size: 64, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !8, line: 49, size: 64, elements: !57)
!57 = !{!58, !59, !60, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !56, file: !8, line: 50, baseType: !4, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !56, file: !8, line: 51, baseType: !20, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !56, file: !8, line: 52, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 56, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 103, baseType: !5)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !56, file: !8, line: 53, baseType: !64, size: 64)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !8, line: 55, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !8, line: 71, baseType: !24, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !46, file: !8, line: 72, baseType: !24, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !46, file: !8, line: 73, baseType: !24, size: 64, offset: 192)
!70 = !{!71}
!71 = !DISubrange(count: 2)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !9, file: !8, line: 80, baseType: !5, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !9, file: !8, line: 81, baseType: !24, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 40, baseType: !79)
!78 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !80, line: 129, baseType: !24)
!80 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !84, line: 829, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !84, line: 826, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !85, file: !84, line: 827, baseType: !6, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !85, file: !84, line: 828, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !84, line: 824, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !84, line: 820, size: 256, elements: !92)
!92 = !{!93, !110, !111, !112}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !91, file: !84, line: 821, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !84, line: 810, size: 192, elements: !96)
!96 = !{!97, !100, !101, !102}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !95, file: !84, line: 811, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !99, line: 43, baseType: !81)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !95, file: !84, line: 812, baseType: !64, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !95, file: !84, line: 813, baseType: !94, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !95, file: !84, line: 817, baseType: !103, offset: 192)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, elements: !108)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !84, line: 814, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !104, file: !84, line: 815, baseType: !94, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !104, file: !84, line: 816, baseType: !24, size: 64, offset: 64)
!108 = !{!109}
!109 = !DISubrange(count: -1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !91, file: !84, line: 821, baseType: !94, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !84, line: 822, baseType: !24, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !91, file: !84, line: 823, baseType: !36, size: 32, offset: 192)
!113 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !84, line: 622, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !84, line: 614, size: 128, elements: !118)
!118 = !{!119, !121, !122, !123, !124}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !84, line: 615, baseType: !120, size: 4, flags: DIFlagBitField, extraData: i64 0)
!120 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !117, file: !84, line: 616, baseType: !120, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !117, file: !84, line: 617, baseType: !120, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !117, file: !84, line: 620, baseType: !36, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !117, file: !84, line: 621, baseType: !4, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !99, line: 51, size: 24, elements: !127)
!127 = !{!128, !132, !133, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !99, line: 52, baseType: !129, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 24, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 43, baseType: !131)
!131 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !126, file: !99, line: 53, baseType: !129, size: 8, offset: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !99, line: 54, baseType: !131, size: 8, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !126, file: !99, line: 55, baseType: !135, offset: 24)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, elements: !108)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !99, line: 57, size: 40, elements: !138)
!138 = !{!139, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !137, file: !99, line: 58, baseType: !140, size: 16)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 36, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 57, baseType: !142)
!142 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !137, file: !99, line: 59, baseType: !140, size: 16, offset: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !99, line: 60, baseType: !131, size: 8, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !137, file: !99, line: 61, baseType: !135, offset: 40)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !99, line: 63, size: 72, elements: !148)
!148 = !{!149, !152, !153, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !147, file: !99, line: 64, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 48, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 79, baseType: !120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !147, file: !99, line: 65, baseType: !150, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !99, line: 66, baseType: !131, size: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !147, file: !99, line: 67, baseType: !135, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !99, line: 69, size: 136, elements: !157)
!157 = !{!158, !159, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !99, line: 70, baseType: !20, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !156, file: !99, line: 71, baseType: !20, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !99, line: 72, baseType: !131, size: 8, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !156, file: !99, line: 73, baseType: !135, offset: 136)
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!166 = distinct !DISubprogram(name: "createObject", scope: !1, file: !1, line: 41, type: !167, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!115, !36, !4}
!169 = !{!170, !171, !172}
!170 = !DILocalVariable(name: "type", arg: 1, scope: !166, file: !1, line: 41, type: !36)
!171 = !DILocalVariable(name: "ptr", arg: 2, scope: !166, file: !1, line: 41, type: !4)
!172 = !DILocalVariable(name: "o", scope: !166, file: !1, line: 42, type: !115)
!173 = !DILocation(line: 41, column: 24, scope: !166)
!174 = !DILocation(line: 41, column: 36, scope: !166)
!175 = !DILocation(line: 42, column: 15, scope: !166)
!176 = !DILocation(line: 42, column: 11, scope: !166)
!177 = !DILocation(line: 43, column: 8, scope: !166)
!178 = !DILocation(line: 43, column: 13, scope: !166)
!179 = !DILocation(line: 44, column: 17, scope: !166)
!180 = !DILocation(line: 45, column: 8, scope: !166)
!181 = !DILocation(line: 45, column: 12, scope: !166)
!182 = !{!183, !187, i64 8}
!183 = !{!"redisObject", !184, i64 0, !184, i64 0, !184, i64 1, !184, i64 4, !187, i64 8}
!184 = !{!"int", !185, i64 0}
!185 = !{!"omnipotent char", !186, i64 0}
!186 = !{!"Simple C/C++ TBAA"}
!187 = !{!"any pointer", !185, i64 0}
!188 = !DILocation(line: 46, column: 8, scope: !166)
!189 = !DILocation(line: 46, column: 17, scope: !166)
!190 = !{!183, !184, i64 4}
!191 = !DILocation(line: 50, column: 16, scope: !192)
!192 = distinct !DILexicalBlock(scope: !166, file: !1, line: 50, column: 9)
!193 = !{!194, !184, i64 2712}
!194 = !{!"redisServer", !184, i64 0, !187, i64 8, !187, i64 16, !187, i64 24, !184, i64 32, !184, i64 36, !184, i64 40, !187, i64 48, !187, i64 56, !187, i64 64, !187, i64 72, !184, i64 80, !184, i64 84, !184, i64 88, !184, i64 92, !187, i64 96, !187, i64 104, !184, i64 112, !184, i64 116, !185, i64 120, !184, i64 164, !195, i64 168, !184, i64 176, !187, i64 184, !187, i64 192, !187, i64 200, !185, i64 208, !184, i64 216, !184, i64 220, !185, i64 224, !184, i64 352, !187, i64 360, !184, i64 368, !185, i64 372, !184, i64 436, !184, i64 440, !185, i64 444, !184, i64 508, !187, i64 512, !187, i64 520, !187, i64 528, !187, i64 536, !187, i64 544, !187, i64 552, !187, i64 560, !184, i64 568, !196, i64 576, !185, i64 584, !187, i64 840, !195, i64 848, !184, i64 856, !184, i64 860, !195, i64 864, !195, i64 872, !195, i64 880, !195, i64 888, !187, i64 896, !187, i64 904, !187, i64 912, !187, i64 920, !187, i64 928, !187, i64 936, !187, i64 944, !187, i64 952, !187, i64 960, !187, i64 968, !187, i64 976, !187, i64 984, !187, i64 992, !195, i64 1000, !196, i64 1008, !196, i64 1016, !196, i64 1024, !197, i64 1032, !196, i64 1040, !196, i64 1048, !196, i64 1056, !196, i64 1064, !196, i64 1072, !196, i64 1080, !196, i64 1088, !196, i64 1096, !196, i64 1104, !195, i64 1112, !196, i64 1120, !197, i64 1128, !196, i64 1136, !196, i64 1144, !196, i64 1152, !196, i64 1160, !187, i64 1168, !196, i64 1176, !196, i64 1184, !195, i64 1192, !198, i64 1200, !196, i64 1240, !196, i64 1248, !195, i64 1256, !195, i64 1264, !185, i64 1272, !184, i64 1728, !184, i64 1732, !184, i64 1736, !184, i64 1740, !184, i64 1744, !195, i64 1752, !184, i64 1760, !184, i64 1764, !184, i64 1768, !184, i64 1772, !195, i64 1776, !195, i64 1784, !184, i64 1792, !184, i64 1796, !184, i64 1800, !184, i64 1804, !185, i64 1808, !184, i64 1880, !184, i64 1884, !187, i64 1888, !184, i64 1896, !184, i64 1900, !195, i64 1904, !195, i64 1912, !195, i64 1920, !195, i64 1928, !184, i64 1936, !184, i64 1940, !187, i64 1944, !187, i64 1952, !184, i64 1960, !184, i64 1964, !195, i64 1968, !195, i64 1976, !195, i64 1984, !195, i64 1992, !184, i64 2000, !195, i64 2008, !184, i64 2016, !184, i64 2020, !184, i64 2024, !184, i64 2028, !184, i64 2032, !184, i64 2036, !184, i64 2040, !184, i64 2044, !184, i64 2048, !184, i64 2052, !184, i64 2056, !184, i64 2060, !184, i64 2064, !187, i64 2072, !196, i64 2080, !196, i64 2088, !184, i64 2096, !187, i64 2104, !184, i64 2112, !187, i64 2120, !184, i64 2128, !184, i64 2132, !195, i64 2136, !195, i64 2144, !195, i64 2152, !195, i64 2160, !184, i64 2168, !184, i64 2172, !184, i64 2176, !184, i64 2180, !184, i64 2184, !184, i64 2188, !185, i64 2192, !199, i64 2200, !200, i64 2224, !187, i64 2240, !184, i64 2248, !187, i64 2256, !184, i64 2264, !185, i64 2268, !185, i64 2309, !196, i64 2352, !196, i64 2360, !184, i64 2368, !184, i64 2372, !187, i64 2376, !196, i64 2384, !196, i64 2392, !196, i64 2400, !196, i64 2408, !195, i64 2416, !195, i64 2424, !184, i64 2432, !184, i64 2436, !184, i64 2440, !184, i64 2444, !184, i64 2448, !187, i64 2456, !187, i64 2464, !184, i64 2472, !184, i64 2476, !187, i64 2480, !187, i64 2488, !184, i64 2496, !184, i64 2500, !195, i64 2504, !195, i64 2512, !195, i64 2520, !184, i64 2528, !184, i64 2532, !187, i64 2536, !195, i64 2544, !184, i64 2552, !184, i64 2556, !184, i64 2560, !195, i64 2568, !184, i64 2576, !184, i64 2580, !184, i64 2584, !187, i64 2592, !185, i64 2600, !196, i64 2648, !184, i64 2656, !187, i64 2664, !187, i64 2672, !184, i64 2680, !187, i64 2688, !184, i64 2696, !184, i64 2700, !196, i64 2704, !184, i64 2712, !184, i64 2716, !184, i64 2720, !184, i64 2724, !196, i64 2728, !184, i64 2736, !185, i64 2740, !187, i64 2768, !187, i64 2776, !184, i64 2784, !184, i64 2788, !184, i64 2792, !184, i64 2796, !195, i64 2800, !195, i64 2808, !195, i64 2816, !195, i64 2824, !195, i64 2832, !195, i64 2840, !195, i64 2848, !195, i64 2856, !184, i64 2864, !184, i64 2868, !195, i64 2872, !195, i64 2880, !184, i64 2888, !196, i64 2896, !187, i64 2904, !187, i64 2912, !184, i64 2920, !184, i64 2924, !196, i64 2928, !187, i64 2936, !187, i64 2944, !184, i64 2952, !184, i64 2956, !184, i64 2960, !184, i64 2964, !187, i64 2968, !184, i64 2976, !184, i64 2980, !184, i64 2984, !187, i64 2992, !187, i64 3000, !187, i64 3008, !187, i64 3016, !196, i64 3024, !196, i64 3032, !196, i64 3040, !184, i64 3048, !184, i64 3052, !184, i64 3056, !184, i64 3060, !184, i64 3064, !184, i64 3068, !184, i64 3072, !184, i64 3076, !184, i64 3080, !184, i64 3084, !184, i64 3088, !196, i64 3096, !187, i64 3104, !187, i64 3112, !187, i64 3120, !184, i64 3128, !184, i64 3132, !184, i64 3136, !195, i64 3144, !187, i64 3152, !187, i64 3160, !187, i64 3168}
!195 = !{!"long", !185, i64 0}
!196 = !{!"long long", !185, i64 0}
!197 = !{!"double", !185, i64 0}
!198 = !{!"malloc_stats", !195, i64 0, !195, i64 8, !195, i64 16, !195, i64 24, !195, i64 32}
!199 = !{!"", !184, i64 0, !195, i64 8, !196, i64 16}
!200 = !{!"redisOpArray", !187, i64 0, !184, i64 8}
!201 = !DILocation(line: 50, column: 33, scope: !192)
!202 = !DILocation(line: 50, column: 9, scope: !166)
!203 = !DILocation(line: 51, column: 19, scope: !204)
!204 = distinct !DILexicalBlock(scope: !192, file: !1, line: 50, column: 55)
!205 = !DILocation(line: 51, column: 18, scope: !204)
!206 = !DILocation(line: 51, column: 16, scope: !204)
!207 = !DILocation(line: 52, column: 5, scope: !204)
!208 = !DILocation(line: 53, column: 18, scope: !209)
!209 = distinct !DILexicalBlock(scope: !192, file: !1, line: 52, column: 12)
!210 = !DILocation(line: 53, column: 16, scope: !209)
!211 = !DILocation(line: 0, scope: !204)
!212 = !DILocation(line: 55, column: 5, scope: !166)
!213 = distinct !DISubprogram(name: "makeObjectShared", scope: !1, file: !1, line: 69, type: !214, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{!115, !115}
!216 = !{!217}
!217 = !DILocalVariable(name: "o", arg: 1, scope: !213, file: !1, line: 69, type: !115)
!218 = !DILocation(line: 69, column: 30, scope: !213)
!219 = !DILocation(line: 70, column: 5, scope: !213)
!220 = !DILocation(line: 71, column: 17, scope: !213)
!221 = !DILocation(line: 72, column: 5, scope: !213)
!222 = distinct !DISubprogram(name: "createRawStringObject", scope: !1, file: !1, line: 77, type: !223, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!115, !74, !77}
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "ptr", arg: 1, scope: !222, file: !1, line: 77, type: !74)
!227 = !DILocalVariable(name: "len", arg: 2, scope: !222, file: !1, line: 77, type: !77)
!228 = !DILocation(line: 77, column: 41, scope: !222)
!229 = !DILocation(line: 77, column: 53, scope: !222)
!230 = !DILocation(line: 78, column: 37, scope: !222)
!231 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !232)
!232 = distinct !DILocation(line: 78, column: 12, scope: !222)
!233 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !232)
!234 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !232)
!235 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !232)
!236 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !232)
!237 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !232)
!238 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !232)
!239 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !232)
!240 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !232)
!241 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !232)
!242 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !232)
!243 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !232)
!244 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !232)
!245 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !232)
!246 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !232)
!247 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !232)
!248 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !232)
!249 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !232)
!250 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !232)
!251 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !232)
!252 = !DILocation(line: 0, scope: !222)
!253 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !232)
!254 = !DILocation(line: 78, column: 5, scope: !222)
!255 = distinct !DISubprogram(name: "createEmbeddedStringObject", scope: !1, file: !1, line: 84, type: !223, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DILocalVariable(name: "ptr", arg: 1, scope: !255, file: !1, line: 84, type: !74)
!258 = !DILocalVariable(name: "len", arg: 2, scope: !255, file: !1, line: 84, type: !77)
!259 = !DILocalVariable(name: "o", scope: !255, file: !1, line: 85, type: !115)
!260 = !DILocalVariable(name: "sh", scope: !255, file: !1, line: 86, type: !125)
!261 = !DILocation(line: 84, column: 46, scope: !255)
!262 = !DILocation(line: 84, column: 58, scope: !255)
!263 = !DILocation(line: 85, column: 62, scope: !255)
!264 = !DILocation(line: 85, column: 15, scope: !255)
!265 = !DILocation(line: 85, column: 11, scope: !255)
!266 = !DILocation(line: 86, column: 35, scope: !255)
!267 = !DILocation(line: 86, column: 21, scope: !255)
!268 = !DILocation(line: 88, column: 8, scope: !255)
!269 = !DILocation(line: 88, column: 13, scope: !255)
!270 = !DILocation(line: 89, column: 17, scope: !255)
!271 = !DILocation(line: 90, column: 16, scope: !255)
!272 = !DILocation(line: 90, column: 8, scope: !255)
!273 = !DILocation(line: 90, column: 12, scope: !255)
!274 = !DILocation(line: 91, column: 8, scope: !255)
!275 = !DILocation(line: 91, column: 17, scope: !255)
!276 = !DILocation(line: 92, column: 16, scope: !277)
!277 = distinct !DILexicalBlock(scope: !255, file: !1, line: 92, column: 9)
!278 = !DILocation(line: 92, column: 33, scope: !277)
!279 = !DILocation(line: 92, column: 9, scope: !255)
!280 = !DILocation(line: 93, column: 19, scope: !281)
!281 = distinct !DILexicalBlock(scope: !277, file: !1, line: 92, column: 55)
!282 = !DILocation(line: 93, column: 18, scope: !281)
!283 = !DILocation(line: 93, column: 16, scope: !281)
!284 = !DILocation(line: 94, column: 5, scope: !281)
!285 = !DILocation(line: 95, column: 18, scope: !286)
!286 = distinct !DILexicalBlock(scope: !277, file: !1, line: 94, column: 12)
!287 = !DILocation(line: 95, column: 16, scope: !286)
!288 = !DILocation(line: 0, scope: !281)
!289 = !DILocation(line: 98, column: 15, scope: !255)
!290 = !DILocation(line: 98, column: 13, scope: !255)
!291 = !{!185, !185, i64 0}
!292 = !DILocation(line: 99, column: 9, scope: !255)
!293 = !DILocation(line: 99, column: 15, scope: !255)
!294 = !DILocation(line: 100, column: 9, scope: !255)
!295 = !DILocation(line: 100, column: 15, scope: !255)
!296 = !DILocation(line: 101, column: 16, scope: !297)
!297 = distinct !DILexicalBlock(scope: !255, file: !1, line: 101, column: 9)
!298 = !{!187, !187, i64 0}
!299 = !DILocation(line: 101, column: 13, scope: !297)
!300 = !DILocation(line: 101, column: 9, scope: !255)
!301 = !DILocation(line: 102, column: 9, scope: !297)
!302 = !DILocation(line: 102, column: 22, scope: !297)
!303 = !DILocation(line: 103, column: 14, scope: !304)
!304 = distinct !DILexicalBlock(scope: !297, file: !1, line: 103, column: 14)
!305 = !DILocation(line: 103, column: 14, scope: !297)
!306 = !DILocation(line: 104, column: 9, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !1, line: 103, column: 19)
!308 = !DILocation(line: 105, column: 9, scope: !307)
!309 = !DILocation(line: 105, column: 22, scope: !307)
!310 = !DILocation(line: 106, column: 5, scope: !307)
!311 = !DILocation(line: 107, column: 29, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !1, line: 106, column: 12)
!313 = !DILocation(line: 107, column: 9, scope: !312)
!314 = !DILocation(line: 109, column: 5, scope: !255)
!315 = distinct !DISubprogram(name: "createStringObject", scope: !1, file: !1, line: 119, type: !223, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !316)
!316 = !{!317, !318}
!317 = !DILocalVariable(name: "ptr", arg: 1, scope: !315, file: !1, line: 119, type: !74)
!318 = !DILocalVariable(name: "len", arg: 2, scope: !315, file: !1, line: 119, type: !77)
!319 = !DILocation(line: 119, column: 38, scope: !315)
!320 = !DILocation(line: 119, column: 50, scope: !315)
!321 = !DILocation(line: 120, column: 13, scope: !322)
!322 = distinct !DILexicalBlock(scope: !315, file: !1, line: 120, column: 9)
!323 = !DILocation(line: 120, column: 9, scope: !315)
!324 = !DILocation(line: 121, column: 16, scope: !322)
!325 = !DILocation(line: 121, column: 9, scope: !322)
!326 = !DILocation(line: 77, column: 41, scope: !222, inlinedAt: !327)
!327 = distinct !DILocation(line: 123, column: 16, scope: !322)
!328 = !DILocation(line: 77, column: 53, scope: !222, inlinedAt: !327)
!329 = !DILocation(line: 78, column: 37, scope: !222, inlinedAt: !327)
!330 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !331)
!331 = distinct !DILocation(line: 78, column: 12, scope: !222, inlinedAt: !327)
!332 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !331)
!333 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !331)
!334 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !331)
!335 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !331)
!336 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !331)
!337 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !331)
!338 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !331)
!339 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !331)
!340 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !331)
!341 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !331)
!342 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !331)
!343 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !331)
!344 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !331)
!345 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !331)
!346 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !331)
!347 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !331)
!348 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !331)
!349 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !331)
!350 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !331)
!351 = !DILocation(line: 0, scope: !222, inlinedAt: !327)
!352 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !331)
!353 = !DILocation(line: 78, column: 5, scope: !222, inlinedAt: !327)
!354 = !DILocation(line: 123, column: 9, scope: !322)
!355 = !DILocation(line: 0, scope: !322)
!356 = !DILocation(line: 124, column: 1, scope: !315)
!357 = distinct !DISubprogram(name: "createStringObjectFromLongLongWithOptions", scope: !1, file: !1, line: 133, type: !358, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !361)
!358 = !DISubroutineType(types: !359)
!359 = !{!115, !360, !36}
!360 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!361 = !{!362, !363, !364}
!362 = !DILocalVariable(name: "value", arg: 1, scope: !357, file: !1, line: 133, type: !360)
!363 = !DILocalVariable(name: "valueobj", arg: 2, scope: !357, file: !1, line: 133, type: !36)
!364 = !DILocalVariable(name: "o", scope: !357, file: !1, line: 134, type: !115)
!365 = !DILocation(line: 133, column: 59, scope: !357)
!366 = !DILocation(line: 133, column: 70, scope: !357)
!367 = !DILocation(line: 136, column: 16, scope: !368)
!368 = distinct !DILexicalBlock(scope: !357, file: !1, line: 136, column: 9)
!369 = !{!194, !196, i64 2704}
!370 = !DILocation(line: 136, column: 26, scope: !368)
!371 = !DILocation(line: 136, column: 31, scope: !368)
!372 = !DILocation(line: 137, column: 18, scope: !368)
!373 = !DILocation(line: 137, column: 35, scope: !368)
!374 = !DILocation(line: 136, column: 9, scope: !357)
!375 = !DILocation(line: 142, column: 5, scope: !376)
!376 = distinct !DILexicalBlock(scope: !368, file: !1, line: 138, column: 5)
!377 = !DILocation(line: 144, column: 20, scope: !378)
!378 = distinct !DILexicalBlock(scope: !357, file: !1, line: 144, column: 9)
!379 = !DILocation(line: 144, column: 63, scope: !378)
!380 = !DILocation(line: 145, column: 22, scope: !381)
!381 = distinct !DILexicalBlock(scope: !378, file: !1, line: 144, column: 69)
!382 = !DILocalVariable(name: "o", arg: 1, scope: !383, file: !1, line: 349, type: !115)
!383 = distinct !DISubprogram(name: "incrRefCount", scope: !1, file: !1, line: 349, type: !384, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !115}
!386 = !{!382}
!387 = !DILocation(line: 349, column: 25, scope: !383, inlinedAt: !388)
!388 = distinct !DILocation(line: 145, column: 9, scope: !381)
!389 = !DILocation(line: 350, column: 12, scope: !390, inlinedAt: !388)
!390 = distinct !DILexicalBlock(scope: !383, file: !1, line: 350, column: 9)
!391 = !DILocation(line: 350, column: 21, scope: !390, inlinedAt: !388)
!392 = !DILocation(line: 350, column: 9, scope: !383, inlinedAt: !388)
!393 = !DILocation(line: 350, column: 56, scope: !390, inlinedAt: !388)
!394 = !DILocation(line: 350, column: 45, scope: !390, inlinedAt: !388)
!395 = !DILocation(line: 351, column: 1, scope: !383, inlinedAt: !388)
!396 = !DILocation(line: 134, column: 11, scope: !357)
!397 = !DILocation(line: 147, column: 5, scope: !381)
!398 = !DILocation(line: 148, column: 31, scope: !399)
!399 = distinct !DILexicalBlock(scope: !400, file: !1, line: 148, column: 13)
!400 = distinct !DILexicalBlock(scope: !378, file: !1, line: 147, column: 12)
!401 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !402)
!402 = distinct !DILocation(line: 149, column: 17, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !1, line: 148, column: 53)
!404 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !402)
!405 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !402)
!406 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !402)
!407 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !402)
!408 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !402)
!409 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !402)
!410 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !402)
!411 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !402)
!412 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !402)
!413 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !402)
!414 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !402)
!415 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !402)
!416 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !402)
!417 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !402)
!418 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !402)
!419 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !402)
!420 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !402)
!421 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !402)
!422 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !402)
!423 = !DILocation(line: 0, scope: !403)
!424 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !402)
!425 = !DILocation(line: 150, column: 25, scope: !403)
!426 = !DILocation(line: 151, column: 22, scope: !403)
!427 = !DILocation(line: 151, column: 20, scope: !403)
!428 = !DILocation(line: 152, column: 9, scope: !403)
!429 = !DILocation(line: 0, scope: !430)
!430 = distinct !DILexicalBlock(scope: !399, file: !1, line: 152, column: 16)
!431 = !DILocation(line: 0, scope: !381)
!432 = !DILocation(line: 156, column: 5, scope: !357)
!433 = !DILocation(line: 349, column: 25, scope: !383)
!434 = !DILocation(line: 350, column: 12, scope: !390)
!435 = !DILocation(line: 350, column: 21, scope: !390)
!436 = !DILocation(line: 350, column: 9, scope: !383)
!437 = !DILocation(line: 350, column: 56, scope: !390)
!438 = !DILocation(line: 350, column: 45, scope: !390)
!439 = !DILocation(line: 351, column: 1, scope: !383)
!440 = distinct !DISubprogram(name: "createStringObjectFromLongLong", scope: !1, file: !1, line: 161, type: !441, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!115, !360}
!443 = !{!444}
!444 = !DILocalVariable(name: "value", arg: 1, scope: !440, file: !1, line: 161, type: !360)
!445 = !DILocation(line: 161, column: 48, scope: !440)
!446 = !DILocation(line: 162, column: 12, scope: !440)
!447 = !DILocation(line: 162, column: 5, scope: !440)
!448 = distinct !DISubprogram(name: "createStringObjectFromLongLongForValue", scope: !1, file: !1, line: 169, type: !441, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !449)
!449 = !{!450}
!450 = !DILocalVariable(name: "value", arg: 1, scope: !448, file: !1, line: 169, type: !360)
!451 = !DILocation(line: 169, column: 56, scope: !448)
!452 = !DILocation(line: 170, column: 12, scope: !448)
!453 = !DILocation(line: 170, column: 5, scope: !448)
!454 = distinct !DISubprogram(name: "createStringObjectFromLongDouble", scope: !1, file: !1, line: 179, type: !455, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !458)
!455 = !DISubroutineType(types: !456)
!456 = !{!115, !457, !36}
!457 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!458 = !{!459, !460, !461, !465}
!459 = !DILocalVariable(name: "value", arg: 1, scope: !454, file: !1, line: 179, type: !457)
!460 = !DILocalVariable(name: "humanfriendly", arg: 2, scope: !454, file: !1, line: 179, type: !36)
!461 = !DILocalVariable(name: "buf", scope: !454, file: !1, line: 180, type: !462)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 40960, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 5120)
!465 = !DILocalVariable(name: "len", scope: !454, file: !1, line: 181, type: !36)
!466 = !DILocation(line: 179, column: 52, scope: !454)
!467 = !DILocation(line: 179, column: 63, scope: !454)
!468 = !DILocation(line: 180, column: 5, scope: !454)
!469 = !DILocation(line: 180, column: 10, scope: !454)
!470 = !DILocation(line: 181, column: 15, scope: !454)
!471 = !DILocation(line: 181, column: 9, scope: !454)
!472 = !DILocation(line: 182, column: 35, scope: !454)
!473 = !DILocation(line: 182, column: 12, scope: !454)
!474 = !DILocation(line: 183, column: 1, scope: !454)
!475 = !DILocation(line: 182, column: 5, scope: !454)
!476 = distinct !DISubprogram(name: "dupStringObject", scope: !1, file: !1, line: 193, type: !477, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !481)
!477 = !DISubroutineType(types: !478)
!478 = !{!115, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!481 = !{!482, !483}
!482 = !DILocalVariable(name: "o", arg: 1, scope: !476, file: !1, line: 193, type: !479)
!483 = !DILocalVariable(name: "d", scope: !476, file: !1, line: 194, type: !115)
!484 = !DILocation(line: 193, column: 35, scope: !476)
!485 = !DILocation(line: 196, column: 5, scope: !476)
!486 = !DILocation(line: 198, column: 15, scope: !476)
!487 = !DILocation(line: 198, column: 5, scope: !476)
!488 = !DILocation(line: 200, column: 41, scope: !489)
!489 = distinct !DILexicalBlock(scope: !476, file: !1, line: 198, column: 25)
!490 = !DILocalVariable(name: "s", arg: 1, scope: !491, file: !99, line: 87, type: !496)
!491 = distinct !DISubprogram(name: "sdslen", scope: !99, file: !99, line: 87, type: !492, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !497)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !496}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !495, line: 58, baseType: !24)
!495 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!497 = !{!490, !498}
!498 = !DILocalVariable(name: "flags", scope: !491, file: !99, line: 88, type: !131)
!499 = !DILocation(line: 87, column: 39, scope: !491, inlinedAt: !500)
!500 = distinct !DILocation(line: 200, column: 45, scope: !489)
!501 = !DILocation(line: 88, column: 27, scope: !491, inlinedAt: !500)
!502 = !DILocation(line: 88, column: 19, scope: !491, inlinedAt: !500)
!503 = !DILocation(line: 89, column: 5, scope: !491, inlinedAt: !500)
!504 = !DILocation(line: 91, column: 20, scope: !505, inlinedAt: !500)
!505 = distinct !DILexicalBlock(scope: !491, file: !99, line: 89, column: 33)
!506 = !DILocation(line: 91, column: 13, scope: !505, inlinedAt: !500)
!507 = !DILocation(line: 93, column: 20, scope: !505, inlinedAt: !500)
!508 = !DILocation(line: 93, column: 34, scope: !505, inlinedAt: !500)
!509 = !DILocation(line: 93, column: 13, scope: !505, inlinedAt: !500)
!510 = !DILocation(line: 95, column: 20, scope: !505, inlinedAt: !500)
!511 = !DILocation(line: 95, column: 35, scope: !505, inlinedAt: !500)
!512 = !{!513, !513, i64 0}
!513 = !{!"short", !185, i64 0}
!514 = !DILocation(line: 95, column: 13, scope: !505, inlinedAt: !500)
!515 = !DILocation(line: 97, column: 20, scope: !505, inlinedAt: !500)
!516 = !DILocation(line: 97, column: 35, scope: !505, inlinedAt: !500)
!517 = !{!184, !184, i64 0}
!518 = !DILocation(line: 97, column: 13, scope: !505, inlinedAt: !500)
!519 = !DILocation(line: 99, column: 20, scope: !505, inlinedAt: !500)
!520 = !DILocation(line: 99, column: 35, scope: !505, inlinedAt: !500)
!521 = !{!195, !195, i64 0}
!522 = !DILocation(line: 99, column: 13, scope: !505, inlinedAt: !500)
!523 = !DILocation(line: 0, scope: !505, inlinedAt: !500)
!524 = !DILocation(line: 0, scope: !489)
!525 = !DILocation(line: 102, column: 1, scope: !491, inlinedAt: !500)
!526 = !DILocation(line: 77, column: 41, scope: !222, inlinedAt: !527)
!527 = distinct !DILocation(line: 200, column: 16, scope: !489)
!528 = !DILocation(line: 77, column: 53, scope: !222, inlinedAt: !527)
!529 = !DILocation(line: 78, column: 37, scope: !222, inlinedAt: !527)
!530 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !531)
!531 = distinct !DILocation(line: 78, column: 12, scope: !222, inlinedAt: !527)
!532 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !531)
!533 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !531)
!534 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !531)
!535 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !531)
!536 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !531)
!537 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !531)
!538 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !531)
!539 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !531)
!540 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !531)
!541 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !531)
!542 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !531)
!543 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !531)
!544 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !531)
!545 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !531)
!546 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !531)
!547 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !531)
!548 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !531)
!549 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !531)
!550 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !531)
!551 = !DILocation(line: 0, scope: !222, inlinedAt: !527)
!552 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !531)
!553 = !DILocation(line: 78, column: 5, scope: !222, inlinedAt: !527)
!554 = !DILocation(line: 200, column: 9, scope: !489)
!555 = !DILocation(line: 202, column: 46, scope: !489)
!556 = !DILocation(line: 87, column: 39, scope: !491, inlinedAt: !557)
!557 = distinct !DILocation(line: 202, column: 50, scope: !489)
!558 = !DILocation(line: 88, column: 27, scope: !491, inlinedAt: !557)
!559 = !DILocation(line: 88, column: 19, scope: !491, inlinedAt: !557)
!560 = !DILocation(line: 89, column: 5, scope: !491, inlinedAt: !557)
!561 = !DILocation(line: 91, column: 20, scope: !505, inlinedAt: !557)
!562 = !DILocation(line: 91, column: 13, scope: !505, inlinedAt: !557)
!563 = !DILocation(line: 93, column: 20, scope: !505, inlinedAt: !557)
!564 = !DILocation(line: 93, column: 34, scope: !505, inlinedAt: !557)
!565 = !DILocation(line: 93, column: 13, scope: !505, inlinedAt: !557)
!566 = !DILocation(line: 95, column: 20, scope: !505, inlinedAt: !557)
!567 = !DILocation(line: 95, column: 35, scope: !505, inlinedAt: !557)
!568 = !DILocation(line: 95, column: 13, scope: !505, inlinedAt: !557)
!569 = !DILocation(line: 97, column: 20, scope: !505, inlinedAt: !557)
!570 = !DILocation(line: 97, column: 35, scope: !505, inlinedAt: !557)
!571 = !DILocation(line: 97, column: 13, scope: !505, inlinedAt: !557)
!572 = !DILocation(line: 99, column: 20, scope: !505, inlinedAt: !557)
!573 = !DILocation(line: 99, column: 35, scope: !505, inlinedAt: !557)
!574 = !DILocation(line: 99, column: 13, scope: !505, inlinedAt: !557)
!575 = !DILocation(line: 0, scope: !505, inlinedAt: !557)
!576 = !DILocation(line: 102, column: 1, scope: !491, inlinedAt: !557)
!577 = !DILocation(line: 202, column: 16, scope: !489)
!578 = !DILocation(line: 202, column: 9, scope: !489)
!579 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !580)
!580 = distinct !DILocation(line: 204, column: 13, scope: !489)
!581 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !580)
!582 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !580)
!583 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !580)
!584 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !580)
!585 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !580)
!586 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !580)
!587 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !580)
!588 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !580)
!589 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !580)
!590 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !580)
!591 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !580)
!592 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !580)
!593 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !580)
!594 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !580)
!595 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !580)
!596 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !580)
!597 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !580)
!598 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !580)
!599 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !580)
!600 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !580)
!601 = !DILocation(line: 194, column: 11, scope: !476)
!602 = !DILocation(line: 205, column: 21, scope: !489)
!603 = !DILocation(line: 206, column: 21, scope: !489)
!604 = !DILocation(line: 206, column: 16, scope: !489)
!605 = !DILocation(line: 207, column: 9, scope: !489)
!606 = !DILocation(line: 209, column: 9, scope: !489)
!607 = !DILocation(line: 212, column: 1, scope: !476)
!608 = distinct !DISubprogram(name: "createQuicklistObject", scope: !1, file: !1, line: 214, type: !609, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{!115}
!611 = !{!612, !640}
!612 = !DILocalVariable(name: "l", scope: !608, file: !1, line: 215, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !615, line: 80, baseType: !616)
!615 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !615, line: 73, size: 320, elements: !617)
!617 = !{!618, !635, !636, !637, !638, !639}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !616, file: !615, line: 74, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !615, line: 55, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !615, line: 44, size: 256, elements: !622)
!622 = !{!623, !625, !626, !628, !629, !630, !631, !632, !633, !634}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !615, line: 45, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !615, line: 46, baseType: !624, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !621, file: !615, line: 47, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !621, file: !615, line: 48, baseType: !120, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !621, file: !615, line: 49, baseType: !120, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !621, file: !615, line: 50, baseType: !120, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !621, file: !615, line: 51, baseType: !120, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !621, file: !615, line: 52, baseType: !120, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !621, file: !615, line: 53, baseType: !120, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !621, file: !615, line: 54, baseType: !120, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !616, file: !615, line: 75, baseType: !619, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !616, file: !615, line: 76, baseType: !24, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !616, file: !615, line: 77, baseType: !24, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !616, file: !615, line: 78, baseType: !36, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !616, file: !615, line: 79, baseType: !120, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!640 = !DILocalVariable(name: "o", scope: !608, file: !1, line: 216, type: !115)
!641 = !DILocation(line: 215, column: 20, scope: !608)
!642 = !DILocation(line: 215, column: 16, scope: !608)
!643 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !644)
!644 = distinct !DILocation(line: 216, column: 15, scope: !608)
!645 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !644)
!646 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !644)
!647 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !644)
!648 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !644)
!649 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !644)
!650 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !644)
!651 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !644)
!652 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !644)
!653 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !644)
!654 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !644)
!655 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !644)
!656 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !644)
!657 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !644)
!658 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !644)
!659 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !644)
!660 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !644)
!661 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !644)
!662 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !644)
!663 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !644)
!664 = !DILocation(line: 0, scope: !608)
!665 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !644)
!666 = !DILocation(line: 216, column: 11, scope: !608)
!667 = !DILocation(line: 217, column: 17, scope: !608)
!668 = !DILocation(line: 218, column: 5, scope: !608)
!669 = distinct !DISubprogram(name: "createZiplistObject", scope: !1, file: !1, line: 221, type: !609, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !670)
!670 = !{!671, !672}
!671 = !DILocalVariable(name: "zl", scope: !669, file: !1, line: 222, type: !627)
!672 = !DILocalVariable(name: "o", scope: !669, file: !1, line: 223, type: !115)
!673 = !DILocation(line: 222, column: 25, scope: !669)
!674 = !DILocation(line: 222, column: 20, scope: !669)
!675 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !676)
!676 = distinct !DILocation(line: 223, column: 15, scope: !669)
!677 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !676)
!678 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !676)
!679 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !676)
!680 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !676)
!681 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !676)
!682 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !676)
!683 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !676)
!684 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !676)
!685 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !676)
!686 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !676)
!687 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !676)
!688 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !676)
!689 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !676)
!690 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !676)
!691 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !676)
!692 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !676)
!693 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !676)
!694 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !676)
!695 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !676)
!696 = !DILocation(line: 0, scope: !669)
!697 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !676)
!698 = !DILocation(line: 223, column: 11, scope: !669)
!699 = !DILocation(line: 224, column: 17, scope: !669)
!700 = !DILocation(line: 225, column: 5, scope: !669)
!701 = distinct !DISubprogram(name: "createSetObject", scope: !1, file: !1, line: 228, type: !609, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !702)
!702 = !{!703, !704}
!703 = !DILocalVariable(name: "d", scope: !701, file: !1, line: 229, type: !6)
!704 = !DILocalVariable(name: "o", scope: !701, file: !1, line: 230, type: !115)
!705 = !DILocation(line: 229, column: 15, scope: !701)
!706 = !DILocation(line: 229, column: 11, scope: !701)
!707 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !708)
!708 = distinct !DILocation(line: 230, column: 15, scope: !701)
!709 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !708)
!710 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !708)
!711 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !708)
!712 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !708)
!713 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !708)
!714 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !708)
!715 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !708)
!716 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !708)
!717 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !708)
!718 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !708)
!719 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !708)
!720 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !708)
!721 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !708)
!722 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !708)
!723 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !708)
!724 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !708)
!725 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !708)
!726 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !708)
!727 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !708)
!728 = !DILocation(line: 0, scope: !701)
!729 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !708)
!730 = !DILocation(line: 230, column: 11, scope: !701)
!731 = !DILocation(line: 231, column: 17, scope: !701)
!732 = !DILocation(line: 232, column: 5, scope: !701)
!733 = distinct !DISubprogram(name: "createIntsetObject", scope: !1, file: !1, line: 235, type: !609, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !734)
!734 = !{!735, !748}
!735 = !DILocalVariable(name: "is", scope: !733, file: !1, line: 236, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "intset", file: !738, line: 39, baseType: !739)
!738 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/intset.h", directory: "/root/.unikraft/apps/redis/build")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "intset", file: !738, line: 35, size: 64, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !739, file: !738, line: 36, baseType: !150, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !739, file: !738, line: 37, baseType: !150, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !739, file: !738, line: 38, baseType: !744, offset: 64)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, elements: !108)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 20, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 41, baseType: !747)
!747 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!748 = !DILocalVariable(name: "o", scope: !733, file: !1, line: 237, type: !115)
!749 = !DILocation(line: 236, column: 18, scope: !733)
!750 = !DILocation(line: 236, column: 13, scope: !733)
!751 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !752)
!752 = distinct !DILocation(line: 237, column: 15, scope: !733)
!753 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !752)
!754 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !752)
!755 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !752)
!756 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !752)
!757 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !752)
!758 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !752)
!759 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !752)
!760 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !752)
!761 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !752)
!762 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !752)
!763 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !752)
!764 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !752)
!765 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !752)
!766 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !752)
!767 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !752)
!768 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !752)
!769 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !752)
!770 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !752)
!771 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !752)
!772 = !DILocation(line: 0, scope: !733)
!773 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !752)
!774 = !DILocation(line: 237, column: 11, scope: !733)
!775 = !DILocation(line: 238, column: 17, scope: !733)
!776 = !DILocation(line: 239, column: 5, scope: !733)
!777 = distinct !DISubprogram(name: "createHashObject", scope: !1, file: !1, line: 242, type: !609, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !778)
!778 = !{!779, !780}
!779 = !DILocalVariable(name: "zl", scope: !777, file: !1, line: 243, type: !627)
!780 = !DILocalVariable(name: "o", scope: !777, file: !1, line: 244, type: !115)
!781 = !DILocation(line: 243, column: 25, scope: !777)
!782 = !DILocation(line: 243, column: 20, scope: !777)
!783 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !784)
!784 = distinct !DILocation(line: 244, column: 15, scope: !777)
!785 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !784)
!786 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !784)
!787 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !784)
!788 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !784)
!789 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !784)
!790 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !784)
!791 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !784)
!792 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !784)
!793 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !784)
!794 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !784)
!795 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !784)
!796 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !784)
!797 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !784)
!798 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !784)
!799 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !784)
!800 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !784)
!801 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !784)
!802 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !784)
!803 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !784)
!804 = !DILocation(line: 0, scope: !777)
!805 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !784)
!806 = !DILocation(line: 244, column: 11, scope: !777)
!807 = !DILocation(line: 245, column: 17, scope: !777)
!808 = !DILocation(line: 246, column: 5, scope: !777)
!809 = distinct !DISubprogram(name: "createZsetObject", scope: !1, file: !1, line: 249, type: !609, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !810)
!810 = !{!811, !812}
!811 = !DILocalVariable(name: "zs", scope: !809, file: !1, line: 250, type: !82)
!812 = !DILocalVariable(name: "o", scope: !809, file: !1, line: 251, type: !115)
!813 = !DILocation(line: 250, column: 16, scope: !809)
!814 = !DILocation(line: 250, column: 11, scope: !809)
!815 = !DILocation(line: 253, column: 16, scope: !809)
!816 = !DILocation(line: 253, column: 9, scope: !809)
!817 = !DILocation(line: 253, column: 14, scope: !809)
!818 = !{!819, !187, i64 0}
!819 = !{!"zset", !187, i64 0, !187, i64 8}
!820 = !DILocation(line: 254, column: 15, scope: !809)
!821 = !DILocation(line: 254, column: 9, scope: !809)
!822 = !DILocation(line: 254, column: 13, scope: !809)
!823 = !{!819, !187, i64 8}
!824 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !825)
!825 = distinct !DILocation(line: 255, column: 9, scope: !809)
!826 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !825)
!827 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !825)
!828 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !825)
!829 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !825)
!830 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !825)
!831 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !825)
!832 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !825)
!833 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !825)
!834 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !825)
!835 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !825)
!836 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !825)
!837 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !825)
!838 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !825)
!839 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !825)
!840 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !825)
!841 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !825)
!842 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !825)
!843 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !825)
!844 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !825)
!845 = !DILocation(line: 0, scope: !809)
!846 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !825)
!847 = !DILocation(line: 251, column: 11, scope: !809)
!848 = !DILocation(line: 256, column: 17, scope: !809)
!849 = !DILocation(line: 257, column: 5, scope: !809)
!850 = distinct !DISubprogram(name: "createZsetZiplistObject", scope: !1, file: !1, line: 260, type: !609, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !851)
!851 = !{!852, !853}
!852 = !DILocalVariable(name: "zl", scope: !850, file: !1, line: 261, type: !627)
!853 = !DILocalVariable(name: "o", scope: !850, file: !1, line: 262, type: !115)
!854 = !DILocation(line: 261, column: 25, scope: !850)
!855 = !DILocation(line: 261, column: 20, scope: !850)
!856 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !857)
!857 = distinct !DILocation(line: 262, column: 15, scope: !850)
!858 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !857)
!859 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !857)
!860 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !857)
!861 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !857)
!862 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !857)
!863 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !857)
!864 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !857)
!865 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !857)
!866 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !857)
!867 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !857)
!868 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !857)
!869 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !857)
!870 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !857)
!871 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !857)
!872 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !857)
!873 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !857)
!874 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !857)
!875 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !857)
!876 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !857)
!877 = !DILocation(line: 0, scope: !850)
!878 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !857)
!879 = !DILocation(line: 262, column: 11, scope: !850)
!880 = !DILocation(line: 263, column: 17, scope: !850)
!881 = !DILocation(line: 264, column: 5, scope: !850)
!882 = distinct !DISubprogram(name: "createStreamObject", scope: !1, file: !1, line: 267, type: !609, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !883)
!883 = !{!884, !917}
!884 = !DILocalVariable(name: "s", scope: !882, file: !1, line: 268, type: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !887, line: 21, baseType: !888)
!887 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !887, line: 16, size: 320, elements: !889)
!889 = !{!890, !909, !910, !916}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !888, file: !887, line: 17, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !893, line: 137, baseType: !894)
!893 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !893, line: 133, size: 192, elements: !895)
!895 = !{!896, !907, !908}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !894, file: !893, line: 134, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !893, line: 131, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !893, line: 98, size: 32, elements: !900)
!900 = !{!901, !902, !903, !904, !905}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !899, file: !893, line: 99, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !899, file: !893, line: 100, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !899, file: !893, line: 101, baseType: !150, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !899, file: !893, line: 102, baseType: !150, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !899, file: !893, line: 130, baseType: !906, offset: 32)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, elements: !108)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !894, file: !893, line: 135, baseType: !20, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !894, file: !893, line: 136, baseType: !20, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !888, file: !887, line: 18, baseType: !20, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !888, file: !887, line: 19, baseType: !911, size: 128, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !887, line: 14, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !887, line: 11, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !912, file: !887, line: 12, baseType: !20, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !912, file: !887, line: 13, baseType: !20, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !888, file: !887, line: 20, baseType: !891, size: 64, offset: 256)
!917 = !DILocalVariable(name: "o", scope: !882, file: !1, line: 269, type: !115)
!918 = !DILocation(line: 268, column: 17, scope: !882)
!919 = !DILocation(line: 268, column: 13, scope: !882)
!920 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !921)
!921 = distinct !DILocation(line: 269, column: 15, scope: !882)
!922 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !921)
!923 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !921)
!924 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !921)
!925 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !921)
!926 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !921)
!927 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !921)
!928 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !921)
!929 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !921)
!930 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !921)
!931 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !921)
!932 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !921)
!933 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !921)
!934 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !921)
!935 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !921)
!936 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !921)
!937 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !921)
!938 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !921)
!939 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !921)
!940 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !921)
!941 = !DILocation(line: 0, scope: !882)
!942 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !921)
!943 = !DILocation(line: 269, column: 11, scope: !882)
!944 = !DILocation(line: 270, column: 17, scope: !882)
!945 = !DILocation(line: 271, column: 5, scope: !882)
!946 = distinct !DISubprogram(name: "createModuleObject", scope: !1, file: !1, line: 274, type: !947, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1288)
!947 = !DISubroutineType(types: !948)
!948 = !{!115, !949, !4}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleType", file: !84, line: 530, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleType", file: !84, line: 517, size: 768, elements: !952)
!952 = !{!953, !954, !957, !1240, !1245, !1250, !1255, !1268, !1273, !1278, !1283, !1284}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !951, file: !84, line: 518, baseType: !20, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !951, file: !84, line: 519, baseType: !955, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModule", file: !84, line: 496, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !951, file: !84, line: 520, baseType: !958, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeLoadFunc", file: !84, line: 506, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!4, !962, !36}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleIO", file: !84, line: 555, size: 384, elements: !964)
!964 = !{!965, !966, !1232, !1233, !1234, !1235, !1238}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !963, file: !84, line: 556, baseType: !77, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !963, file: !84, line: 557, baseType: !967, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !969, line: 87, baseType: !970)
!969 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !969, line: 39, size: 832, elements: !971)
!971 = !{!972, !977, !981, !989, !993, !997, !998, !999, !1000}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !970, file: !969, line: 43, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!494, !976, !4, !494}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !970, file: !969, line: 44, baseType: !978, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!494, !976, !25, !494}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !970, file: !969, line: 45, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!985, !976}
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !986, line: 173, baseType: !987)
!986 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 100, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !80, line: 44, baseType: !5)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !970, file: !969, line: 46, baseType: !990, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!36, !976}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !970, file: !969, line: 52, baseType: !994, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !976, !25, !494}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !970, file: !969, line: 55, baseType: !20, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !970, file: !969, line: 58, baseType: !494, size: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !970, file: !969, line: 61, baseType: !494, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !970, file: !969, line: 84, baseType: !1001, size: 320, offset: 512)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !969, line: 64, size: 320, elements: !1002)
!1002 = !{!1003, !1008, !1223}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1001, file: !969, line: 69, baseType: !1004, size: 128)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1001, file: !969, line: 66, size: 128, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1004, file: !969, line: 67, baseType: !98, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1004, file: !969, line: 68, baseType: !985, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1001, file: !969, line: 75, baseType: !1009, size: 192)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1001, file: !969, line: 71, size: 192, elements: !1010)
!1010 = !{!1011, !1221, !1222}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1009, file: !969, line: 72, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1014, line: 66, baseType: !1015)
!1014 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !1016, line: 287, baseType: !1017)
!1016 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !1016, line: 181, size: 1408, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1024, !1025, !1030, !1031, !1032, !1191, !1195, !1200, !1204, !1205, !1206, !1207, !1209, !1211, !1212, !1213, !1214, !1215, !1219, !1220}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !1017, file: !1016, line: 182, baseType: !627, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !1017, file: !1016, line: 183, baseType: !36, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !1017, file: !1016, line: 184, baseType: !36, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1017, file: !1016, line: 185, baseType: !1023, size: 16, offset: 128)
!1023 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !1017, file: !1016, line: 186, baseType: !1023, size: 16, offset: 144)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !1017, file: !1016, line: 187, baseType: !1026, size: 128, offset: 192)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !1016, line: 117, size: 128, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !1026, file: !1016, line: 118, baseType: !627, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1026, file: !1016, line: 119, baseType: !36, size: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !1017, file: !1016, line: 188, baseType: !36, size: 32, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !1017, file: !1016, line: 195, baseType: !4, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !1017, file: !1016, line: 197, baseType: !1033, size: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1036, !1037, !4, !81, !36}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !80, line: 145, baseType: !5)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !1016, line: 569, size: 14912, elements: !1039)
!1039 = !{!1040, !1041, !1043, !1044, !1045, !1046, !1050, !1051, !1054, !1055, !1059, !1073, !1074, !1075, !1077, !1078, !1079, !1155, !1176, !1177, !1182, !1189}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !1038, file: !1016, line: 571, baseType: !36, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !1038, file: !1016, line: 576, baseType: !1042, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !1038, file: !1016, line: 576, baseType: !1042, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !1038, file: !1016, line: 576, baseType: !1042, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !1038, file: !1016, line: 578, baseType: !36, size: 32, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !1038, file: !1016, line: 579, baseType: !1047, size: 200, offset: 288)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 200, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 25)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !1038, file: !1016, line: 582, baseType: !36, size: 32, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !1038, file: !1016, line: 583, baseType: !1052, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !1016, line: 40, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !1038, file: !1016, line: 585, baseType: !36, size: 32, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !1038, file: !1016, line: 587, baseType: !1056, size: 64, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1037}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !1038, file: !1016, line: 590, baseType: !1060, size: 64, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !1016, line: 47, size: 256, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1061, file: !1016, line: 49, baseType: !1060, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !1061, file: !1016, line: 50, baseType: !36, size: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !1061, file: !1016, line: 50, baseType: !36, size: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !1061, file: !1016, line: 50, baseType: !36, size: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !1061, file: !1016, line: 50, baseType: !36, size: 32, offset: 160)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !1061, file: !1016, line: 51, baseType: !1069, size: 32, offset: 192)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 32, elements: !1071)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !1016, line: 25, baseType: !120)
!1071 = !{!1072}
!1072 = !DISubrange(count: 1)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !1038, file: !1016, line: 591, baseType: !36, size: 32, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !1038, file: !1016, line: 592, baseType: !1060, size: 64, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !1038, file: !1016, line: 593, baseType: !1076, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !1038, file: !1016, line: 596, baseType: !36, size: 32, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !1038, file: !1016, line: 597, baseType: !81, size: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !1038, file: !1016, line: 632, baseType: !1080, size: 2880, offset: 1152)
!1080 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1038, file: !1016, line: 599, size: 2880, elements: !1081)
!1081 = !{!1082, !1146}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !1080, file: !1016, line: 622, baseType: !1083, size: 1728)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1080, file: !1016, line: 601, size: 1728, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1091, !1103, !1104, !1106, !1115, !1129, !1130, !1131, !1135, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !1083, file: !1016, line: 603, baseType: !120, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1083, file: !1016, line: 604, baseType: !81, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !1083, file: !1016, line: 605, baseType: !1088, size: 208, offset: 128)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 208, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 26)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !1083, file: !1016, line: 606, baseType: !1092, size: 288, offset: 352)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !1016, line: 55, size: 288, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1092, file: !1016, line: 57, baseType: !36, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1092, file: !1016, line: 58, baseType: !36, size: 32, offset: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1092, file: !1016, line: 59, baseType: !36, size: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1092, file: !1016, line: 60, baseType: !36, size: 32, offset: 96)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1092, file: !1016, line: 61, baseType: !36, size: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1092, file: !1016, line: 62, baseType: !36, size: 32, offset: 160)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1092, file: !1016, line: 63, baseType: !36, size: 32, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1092, file: !1016, line: 64, baseType: !36, size: 32, offset: 224)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1092, file: !1016, line: 65, baseType: !36, size: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !1083, file: !1016, line: 607, baseType: !36, size: 32, offset: 640)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1083, file: !1016, line: 608, baseType: !1105, size: 64, offset: 704)
!1105 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !1083, file: !1016, line: 609, baseType: !1107, size: 112, offset: 768)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !1016, line: 319, size: 112, elements: !1108)
!1108 = !{!1109, !1113, !1114}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1107, file: !1016, line: 320, baseType: !1110, size: 48)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 48, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 3)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1107, file: !1016, line: 321, baseType: !1110, size: 48, offset: 48)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1107, file: !1016, line: 322, baseType: !142, size: 16, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1083, file: !1016, line: 610, baseType: !1116, size: 64, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !80, line: 171, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 163, size: 64, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1117, file: !80, line: 165, baseType: !36, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1117, file: !80, line: 170, baseType: !1121, size: 32, offset: 32)
!1121 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1117, file: !80, line: 166, size: 32, elements: !1122)
!1122 = !{!1123, !1125}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1121, file: !80, line: 168, baseType: !1124, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !495, line: 124, baseType: !120)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1121, file: !80, line: 169, baseType: !1126, size: 32)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !1127)
!1127 = !{!1128}
!1128 = !DISubrange(count: 4)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1083, file: !1016, line: 611, baseType: !1116, size: 64, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1083, file: !1016, line: 612, baseType: !1116, size: 64, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1083, file: !1016, line: 613, baseType: !1132, size: 64, offset: 1088)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !1133)
!1133 = !{!1134}
!1134 = !DISubrange(count: 8)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !1083, file: !1016, line: 614, baseType: !1136, size: 192, offset: 1152)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 24)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1083, file: !1016, line: 615, baseType: !36, size: 32, offset: 1344)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1083, file: !1016, line: 616, baseType: !1116, size: 64, offset: 1376)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1083, file: !1016, line: 617, baseType: !1116, size: 64, offset: 1440)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1083, file: !1016, line: 618, baseType: !1116, size: 64, offset: 1504)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1083, file: !1016, line: 619, baseType: !1116, size: 64, offset: 1568)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1083, file: !1016, line: 620, baseType: !1116, size: 64, offset: 1632)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !1083, file: !1016, line: 621, baseType: !36, size: 32, offset: 1696)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !1080, file: !1016, line: 631, baseType: !1147, size: 2880)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1080, file: !1016, line: 626, size: 2880, elements: !1148)
!1148 = !{!1149, !1153}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !1147, file: !1016, line: 629, baseType: !1150, size: 1920)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 1920, elements: !1151)
!1151 = !{!1152}
!1152 = !DISubrange(count: 30)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !1147, file: !1016, line: 630, baseType: !1154, size: 960, offset: 1920)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 960, elements: !1151)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !1038, file: !1016, line: 636, baseType: !1156, size: 64, offset: 4032)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !1016, line: 93, size: 6336, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1168}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1157, file: !1016, line: 94, baseType: !1156, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1157, file: !1016, line: 95, baseType: !36, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1157, file: !1016, line: 97, baseType: !1162, size: 2048, offset: 128)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 2048, elements: !1166)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{null}
!1166 = !{!1167}
!1167 = !DISubrange(count: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !1157, file: !1016, line: 98, baseType: !1169, size: 4160, offset: 2176)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !1016, line: 74, size: 4160, elements: !1170)
!1170 = !{!1171, !1173, !1174, !1175}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1169, file: !1016, line: 75, baseType: !1172, size: 2048)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1166)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1169, file: !1016, line: 76, baseType: !1172, size: 2048, offset: 2048)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1169, file: !1016, line: 78, baseType: !1070, size: 32, offset: 4096)
