; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/open_memstream.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/open_memstream.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/open_memstream.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 435, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!7 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!8 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!9 = !DIEnumerator(name: "PTHREAD_INHERIT_SCHED", value: 0)
!10 = !DIEnumerator(name: "PTHREAD_EXPLICIT_SCHED", value: 1)
!11 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS", value: 0)
!12 = !DIEnumerator(name: "PTHREAD_SCOPE_SYSTEM", value: 1)
!13 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS_VFPU", value: 2)
!14 = !DIEnumerator(name: "PTHREAD_CANCEL_ENABLE", value: 0)
!15 = !DIEnumerator(name: "PTHREAD_CANCEL_DISABLE", value: 1)
!16 = !DIEnumerator(name: "PTHREAD_CANCEL_ASYNCHRONOUS", value: 0)
!17 = !DIEnumerator(name: "PTHREAD_CANCEL_DEFERRED", value: 1)
!18 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!19 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!20 = !DIEnumerator(name: "PTHREAD_BARRIER_SERIAL_THREAD", value: -1)
!21 = !{!22, !25, !26, !55, !50, !57, !56, !61, !34, !64}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "memstream", file: !1, line: 91, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memstream", file: !1, line: 79, size: 448, elements: !29)
!29 = !{!30, !31, !32, !39, !40, !41, !42, !49}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !28, file: !1, line: 80, baseType: !25, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf", scope: !28, file: !1, line: 81, baseType: !22, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "psize", scope: !28, file: !1, line: 82, baseType: !33, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 40, baseType: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !37, line: 129, baseType: !38)
!37 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !28, file: !1, line: 83, baseType: !34, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !28, file: !1, line: 84, baseType: !34, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !28, file: !1, line: 85, baseType: !34, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !28, file: !1, line: 89, baseType: !43, size: 32, offset: 384)
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !28, file: !1, line: 86, size: 32, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !43, file: !1, line: 87, baseType: !24, size: 8)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !43, file: !1, line: 88, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !48, line: 83, baseType: !5)
!48 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "wide", scope: !28, file: !1, line: 90, baseType: !50, size: 8, offset: 416)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !51, line: 20, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !53, line: 41, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !58, line: 200, baseType: !59)
!58 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !37, line: 145, baseType: !60)
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !58, line: 173, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 100, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !37, line: 44, baseType: !60)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !37, line: 114, baseType: !60)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 1, !"wchar_size", i32 4}
!68 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!69 = distinct !DISubprogram(name: "_open_memstream_r", scope: !1, file: !1, line: 381, type: !70, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !285)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !98, !22, !33}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !74, line: 66, baseType: !75)
!74 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !76, line: 287, baseType: !77)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !76, line: 181, size: 1408, elements: !78)
!78 = !{!79, !82, !83, !84, !86, !87, !92, !93, !94, !254, !260, !264, !268, !269, !270, !271, !273, !275, !276, !277, !278, !279, !283, !284}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !77, file: !76, line: 182, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !77, file: !76, line: 183, baseType: !5, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !77, file: !76, line: 184, baseType: !5, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !76, line: 185, baseType: !85, size: 16, offset: 128)
!85 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !77, file: !76, line: 186, baseType: !85, size: 16, offset: 144)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !77, file: !76, line: 187, baseType: !88, size: 128, offset: 192)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !76, line: 117, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !88, file: !76, line: 118, baseType: !80, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !88, file: !76, line: 119, baseType: !5, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !77, file: !76, line: 188, baseType: !5, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !77, file: !76, line: 195, baseType: !25, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !77, file: !76, line: 197, baseType: !95, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!59, !98, !25, !23, !5}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !76, line: 569, size: 14912, elements: !100)
!100 = !{!101, !102, !104, !105, !106, !107, !111, !112, !115, !116, !120, !135, !136, !137, !139, !140, !141, !218, !239, !240, !245, !252}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !99, file: !76, line: 571, baseType: !5, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !99, file: !76, line: 576, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !99, file: !76, line: 576, baseType: !103, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !99, file: !76, line: 576, baseType: !103, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !99, file: !76, line: 578, baseType: !5, size: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !99, file: !76, line: 579, baseType: !108, size: 200, offset: 288)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 200, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 25)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !99, file: !76, line: 582, baseType: !5, size: 32, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !99, file: !76, line: 583, baseType: !113, size: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !76, line: 40, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !99, file: !76, line: 585, baseType: !5, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !99, file: !76, line: 587, baseType: !117, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !98}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !99, file: !76, line: 590, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !76, line: 47, size: 256, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !122, file: !76, line: 49, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !122, file: !76, line: 50, baseType: !5, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !122, file: !76, line: 50, baseType: !5, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !122, file: !76, line: 50, baseType: !5, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !122, file: !76, line: 50, baseType: !5, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !122, file: !76, line: 51, baseType: !130, size: 32, offset: 192)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !133)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !76, line: 25, baseType: !132)
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !99, file: !76, line: 591, baseType: !5, size: 32, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !99, file: !76, line: 592, baseType: !121, size: 64, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !99, file: !76, line: 593, baseType: !138, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !99, file: !76, line: 596, baseType: !5, size: 32, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !99, file: !76, line: 597, baseType: !23, size: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !99, file: !76, line: 632, baseType: !142, size: 2880, offset: 1152)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !76, line: 599, size: 2880, elements: !143)
!143 = !{!144, !209}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !142, file: !76, line: 622, baseType: !145, size: 1728)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !142, file: !76, line: 601, size: 1728, elements: !146)
!146 = !{!147, !148, !149, !153, !165, !166, !168, !178, !192, !193, !194, !198, !202, !203, !204, !205, !206, !207, !208}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !145, file: !76, line: 603, baseType: !132, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !145, file: !76, line: 604, baseType: !23, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !145, file: !76, line: 605, baseType: !150, size: 208, offset: 128)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 208, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 26)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !145, file: !76, line: 606, baseType: !154, size: 288, offset: 352)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !76, line: 55, size: 288, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !154, file: !76, line: 57, baseType: !5, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !154, file: !76, line: 58, baseType: !5, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !154, file: !76, line: 59, baseType: !5, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !154, file: !76, line: 60, baseType: !5, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !154, file: !76, line: 61, baseType: !5, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !154, file: !76, line: 62, baseType: !5, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !154, file: !76, line: 63, baseType: !5, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !154, file: !76, line: 64, baseType: !5, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !154, file: !76, line: 65, baseType: !5, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !145, file: !76, line: 607, baseType: !5, size: 32, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !145, file: !76, line: 608, baseType: !167, size: 64, offset: 704)
!167 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !145, file: !76, line: 609, baseType: !169, size: 112, offset: 768)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !76, line: 319, size: 112, elements: !170)
!170 = !{!171, !176, !177}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !169, file: !76, line: 320, baseType: !172, size: 48)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 48, elements: !174)
!173 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !169, file: !76, line: 321, baseType: !172, size: 48, offset: 48)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !169, file: !76, line: 322, baseType: !173, size: 16, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !145, file: !76, line: 610, baseType: !179, size: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !37, line: 171, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 163, size: 64, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !180, file: !37, line: 165, baseType: !5, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !180, file: !37, line: 170, baseType: !184, size: 32, offset: 32)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !37, line: 166, size: 32, elements: !185)
!185 = !{!186, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !184, file: !37, line: 168, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !48, line: 124, baseType: !132)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !184, file: !37, line: 169, baseType: !189, size: 32)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 4)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !145, file: !76, line: 611, baseType: !179, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !145, file: !76, line: 612, baseType: !179, size: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !145, file: !76, line: 613, baseType: !195, size: 64, offset: 1088)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !145, file: !76, line: 614, baseType: !199, size: 192, offset: 1152)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 24)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !145, file: !76, line: 615, baseType: !5, size: 32, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !145, file: !76, line: 616, baseType: !179, size: 64, offset: 1376)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !145, file: !76, line: 617, baseType: !179, size: 64, offset: 1440)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !145, file: !76, line: 618, baseType: !179, size: 64, offset: 1504)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !145, file: !76, line: 619, baseType: !179, size: 64, offset: 1568)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !145, file: !76, line: 620, baseType: !179, size: 64, offset: 1632)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !145, file: !76, line: 621, baseType: !5, size: 32, offset: 1696)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !142, file: !76, line: 631, baseType: !210, size: 2880)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !142, file: !76, line: 626, size: 2880, elements: !211)
!211 = !{!212, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !210, file: !76, line: 629, baseType: !213, size: 1920)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 1920, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 30)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !210, file: !76, line: 630, baseType: !217, size: 960, offset: 1920)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 960, elements: !214)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !99, file: !76, line: 636, baseType: !219, size: 64, offset: 4032)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !76, line: 93, size: 6336, elements: !221)
!221 = !{!222, !223, !224, !231}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !220, file: !76, line: 94, baseType: !219, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !220, file: !76, line: 95, baseType: !5, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !220, file: !76, line: 97, baseType: !225, size: 2048, offset: 128)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 2048, elements: !229)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null}
!229 = !{!230}
!230 = !DISubrange(count: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !220, file: !76, line: 98, baseType: !232, size: 4160, offset: 2176)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !76, line: 74, size: 4160, elements: !233)
!233 = !{!234, !236, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !232, file: !76, line: 75, baseType: !235, size: 2048)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !229)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !232, file: !76, line: 76, baseType: !235, size: 2048, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !232, file: !76, line: 78, baseType: !131, size: 32, offset: 4096)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !232, file: !76, line: 81, baseType: !131, size: 32, offset: 4128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !99, file: !76, line: 637, baseType: !220, size: 6336, offset: 4096)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !99, file: !76, line: 641, baseType: !241, size: 64, offset: 10432)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !5}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !99, file: !76, line: 646, baseType: !246, size: 192, offset: 10496)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !76, line: 291, size: 192, elements: !247)
!247 = !{!248, !250, !251}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !246, file: !76, line: 293, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !246, file: !76, line: 294, baseType: !5, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !246, file: !76, line: 295, baseType: !103, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !99, file: !76, line: 648, baseType: !253, size: 4224, offset: 10688)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 4224, elements: !174)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !77, file: !76, line: 199, baseType: !255, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!59, !98, !25, !258, !5}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !77, file: !76, line: 202, baseType: !261, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!64, !98, !25, !64, !5}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !77, file: !76, line: 203, baseType: !265, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!5, !98, !25}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !77, file: !76, line: 206, baseType: !88, size: 128, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !77, file: !76, line: 207, baseType: !80, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !77, file: !76, line: 208, baseType: !5, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !77, file: !76, line: 211, baseType: !272, size: 24, offset: 928)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 24, elements: !174)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !77, file: !76, line: 212, baseType: !274, size: 8, offset: 952)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, elements: !133)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !77, file: !76, line: 215, baseType: !88, size: 128, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !77, file: !76, line: 218, baseType: !5, size: 32, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !76, line: 219, baseType: !63, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !77, file: !76, line: 222, baseType: !98, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !77, file: !76, line: 226, baseType: !280, size: 32, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !37, line: 175, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !282, line: 12, baseType: !5)
!282 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !77, file: !76, line: 228, baseType: !179, size: 64, offset: 1312)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !77, file: !76, line: 229, baseType: !5, size: 32, offset: 1376)
!285 = !{!286, !287, !288}
!286 = !DILocalVariable(name: "ptr", arg: 1, scope: !69, file: !1, line: 381, type: !98)
!287 = !DILocalVariable(name: "buf", arg: 2, scope: !69, file: !1, line: 381, type: !22)
!288 = !DILocalVariable(name: "size", arg: 3, scope: !69, file: !1, line: 381, type: !33)
!289 = !DILocation(line: 381, column: 1, scope: !69)
!290 = !DILocation(line: 386, column: 10, scope: !69)
!291 = !DILocation(line: 386, column: 3, scope: !69)
!292 = distinct !DISubprogram(name: "internal_open_memstream_r", scope: !1, file: !1, line: 298, type: !293, isLocal: true, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!72, !98, !22, !33, !5}
!295 = !{!296, !297, !298, !299, !300, !301, !302, !306, !310}
!296 = !DILocalVariable(name: "ptr", arg: 1, scope: !292, file: !1, line: 298, type: !98)
!297 = !DILocalVariable(name: "buf", arg: 2, scope: !292, file: !1, line: 298, type: !22)
!298 = !DILocalVariable(name: "size", arg: 3, scope: !292, file: !1, line: 298, type: !33)
!299 = !DILocalVariable(name: "wide", arg: 4, scope: !292, file: !1, line: 298, type: !5)
!300 = !DILocalVariable(name: "fp", scope: !292, file: !1, line: 304, type: !72)
!301 = !DILocalVariable(name: "c", scope: !292, file: !1, line: 305, type: !26)
!302 = !DILocalVariable(name: "__oldsfpcancel", scope: !303, file: !1, line: 316, type: !5)
!303 = distinct !DILexicalBlock(scope: !304, file: !1, line: 316, column: 7)
!304 = distinct !DILexicalBlock(scope: !305, file: !1, line: 315, column: 5)
!305 = distinct !DILexicalBlock(scope: !292, file: !1, line: 314, column: 7)
!306 = !DILocalVariable(name: "__oldsfpcancel", scope: !307, file: !1, line: 341, type: !5)
!307 = distinct !DILexicalBlock(scope: !308, file: !1, line: 341, column: 7)
!308 = distinct !DILexicalBlock(scope: !309, file: !1, line: 340, column: 5)
!309 = distinct !DILexicalBlock(scope: !292, file: !1, line: 339, column: 7)
!310 = !DILocalVariable(name: "__oldfpcancel", scope: !311, file: !1, line: 363, type: !5)
!311 = distinct !DILexicalBlock(scope: !292, file: !1, line: 363, column: 3)
!312 = !DILocation(line: 298, column: 1, scope: !292)
!313 = !DILocation(line: 307, column: 8, scope: !314)
!314 = distinct !DILexicalBlock(scope: !292, file: !1, line: 307, column: 7)
!315 = !DILocation(line: 307, column: 16, scope: !314)
!316 = !DILocation(line: 307, column: 12, scope: !314)
!317 = !DILocation(line: 309, column: 12, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !1, line: 308, column: 5)
!319 = !DILocation(line: 309, column: 19, scope: !318)
!320 = !{!321, !322, i64 0}
!321 = !{!"_reent", !322, i64 0, !325, i64 8, !325, i64 16, !325, i64 24, !322, i64 32, !323, i64 36, !322, i64 64, !325, i64 72, !322, i64 80, !325, i64 88, !325, i64 96, !322, i64 104, !325, i64 112, !325, i64 120, !322, i64 128, !325, i64 136, !323, i64 144, !325, i64 504, !326, i64 512, !325, i64 1304, !328, i64 1312, !323, i64 1336}
!322 = !{!"int", !323, i64 0}
!323 = !{!"omnipotent char", !324, i64 0}
!324 = !{!"Simple C/C++ TBAA"}
!325 = !{!"any pointer", !323, i64 0}
!326 = !{!"_atexit", !325, i64 0, !322, i64 8, !323, i64 16, !327, i64 272}
!327 = !{!"_on_exit_args", !323, i64 0, !323, i64 256, !322, i64 512, !322, i64 516}
!328 = !{!"_glue", !325, i64 0, !322, i64 8, !325, i64 16}
!329 = !DILocation(line: 310, column: 7, scope: !318)
!330 = !DILocation(line: 312, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !292, file: !1, line: 312, column: 7)
!332 = !DILocation(line: 304, column: 9, scope: !292)
!333 = !DILocation(line: 312, column: 26, scope: !331)
!334 = !DILocation(line: 312, column: 7, scope: !292)
!335 = !DILocation(line: 314, column: 26, scope: !305)
!336 = !DILocation(line: 305, column: 14, scope: !292)
!337 = !DILocation(line: 314, column: 54, scope: !305)
