; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_tkAssocCreate.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_tkAssocCreate.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pte_thread_t_ = type { %struct.uk_thread*, %struct.pte_handle_t, %struct.pte_thread_t_*, i32, i8*, i8*, i32, i32, %struct.pthread_mutex_t_*, i32, %struct.pthread_mutex_t_*, i32, i32, i32, [8 x i64], i8, i8*, i8* }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.anon.0 = type { %struct.uk_waitq_entry* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_tkAssocCreate.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 61, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18, !19}
!13 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!20 = !{!21, !42}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadKeyAssoc", file: !11, line: 224, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadKeyAssoc", file: !11, line: 292, size: 384, elements: !24)
!24 = !{!25, !521, !530, !531, !532, !533}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !23, file: !11, line: 392, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !11, line: 83, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !11, line: 85, size: 1536, elements: !29)
!29 = !{!30, !475, !483, !484, !487, !488, !489, !490, !491, !508, !509, !510, !511, !512, !513, !518, !519, !520}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !28, file: !11, line: 87, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !32, line: 11, baseType: !33)
!32 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !35, line: 59, size: 1024, elements: !36)
!35 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !{!37, !41, !43, !44, !45, !51, !56, !62, !64, !81, !230, !231, !232, !445}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !35, line: 60, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !34, file: !35, line: 61, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !34, file: !35, line: 62, baseType: !42, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !34, file: !35, line: 63, baseType: !42, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !34, file: !35, line: 64, baseType: !46, size: 128, offset: 256)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !34, file: !35, line: 64, size: 128, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !46, file: !35, line: 64, baseType: !33, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !46, file: !35, line: 64, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !35, line: 65, baseType: !52, size: 32, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 48, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !55, line: 79, baseType: !5)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !34, file: !35, line: 66, baseType: !57, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !58, line: 49, baseType: !59)
!58 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !60, line: 128, baseType: !61)
!60 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !34, file: !35, line: 67, baseType: !63, size: 8, offset: 512)
!63 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !34, file: !35, line: 68, baseType: !65, size: 128, offset: 576)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !66, line: 42, size: 128, elements: !67)
!66 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !{!68, !79}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !65, file: !66, line: 42, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !66, line: 35, size: 192, elements: !71)
!71 = !{!72, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !70, file: !66, line: 36, baseType: !73, size: 32)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !70, file: !66, line: 37, baseType: !33, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !70, file: !66, line: 38, baseType: !76, size: 64, offset: 128)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !66, line: 38, size: 64, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !76, file: !66, line: 38, baseType: !69, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !65, file: !66, line: 42, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !34, file: !35, line: 69, baseType: !82, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !84, line: 90, size: 2176, elements: !85)
!84 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !{!86, !91, !109, !114, !116, !118, !123, !131, !136, !142, !143, !144, !149, !227, !228, !229}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !83, file: !84, line: 91, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !84, line: 68, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !82}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !83, file: !84, line: 93, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !84, line: 71, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!73, !82, !33, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !99, line: 62, baseType: !100)
!99 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !99, line: 55, size: 128, elements: !101)
!101 = !{!102, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !100, file: !99, line: 57, baseType: !63, size: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !100, file: !99, line: 59, baseType: !104, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !99, line: 53, baseType: !73)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !100, file: !99, line: 61, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !58, line: 48, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !60, line: 129, baseType: !108)
!108 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !83, file: !84, line: 94, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !84, line: 74, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !82, !33}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !83, file: !84, line: 95, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !84, line: 76, baseType: !111)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !83, file: !84, line: 96, baseType: !117, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !84, line: 78, baseType: !111)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !83, file: !84, line: 98, baseType: !119, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !84, line: 81, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!73, !82, !33, !104}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !83, file: !84, line: 99, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !84, line: 83, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!73, !82, !128, !130}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !83, file: !84, line: 100, baseType: !132, size: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !84, line: 85, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!73, !82, !33, !73}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !83, file: !84, line: 101, baseType: !137, size: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !84, line: 87, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!73, !82, !128, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !83, file: !84, line: 104, baseType: !63, size: 8, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !83, file: !84, line: 105, baseType: !34, size: 1024, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !83, file: !84, line: 106, baseType: !145, size: 128, offset: 1664)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !35, line: 93, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !145, file: !35, line: 93, baseType: !33, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !145, file: !35, line: 93, baseType: !50, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !83, file: !84, line: 107, baseType: !150, size: 192, offset: 1792)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !151, line: 59, size: 192, elements: !152)
!151 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!152 = !{!153, !218, !222}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !150, file: !151, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !151, line: 51, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!42, !158, !108, !108}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !160, line: 77, size: 832, elements: !161)
!160 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!161 = !{!162, !169, !174, !179, !185, !187, !192, !193, !194, !199, !204, !209, !210, !211}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !159, file: !160, line: 79, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !160, line: 54, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!42, !158, !167}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !168, line: 58, baseType: !108)
!168 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !159, file: !160, line: 80, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !160, line: 56, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!42, !158, !167, !167}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !159, file: !160, line: 81, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !160, line: 62, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!42, !158, !42, !167}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !159, file: !160, line: 82, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !160, line: 58, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!73, !158, !184, !167, !167}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !159, file: !160, line: 83, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !160, line: 60, baseType: !171)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !159, file: !160, line: 84, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !160, line: 64, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !158, !42}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !159, file: !160, line: 87, baseType: !188, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !159, file: !160, line: 88, baseType: !163, size: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !159, file: !160, line: 92, baseType: !195, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !160, line: 66, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!42, !158, !108}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !159, file: !160, line: 93, baseType: !200, size: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !160, line: 68, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !158, !42, !108}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !159, file: !160, line: 99, baseType: !205, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !160, line: 70, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!73, !158, !42, !167}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !159, file: !160, line: 100, baseType: !167, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !160, line: 103, baseType: !158, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !159, file: !160, line: 104, baseType: !212, offset: 832)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, elements: !216)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !53, line: 20, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !55, line: 41, baseType: !215)
!215 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!216 = !{!217}
!217 = !DISubrange(count: -1)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !150, file: !151, line: 63, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !42}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !150, file: !151, line: 65, baseType: !223, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !151, line: 56, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !42, !42}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !83, file: !84, line: 108, baseType: !158, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !84, line: 109, baseType: !82, size: 64, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !83, file: !84, line: 110, baseType: !42, size: 64, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !34, file: !35, line: 70, baseType: !42, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !34, file: !35, line: 72, baseType: !73, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !34, file: !35, line: 82, baseType: !233, size: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !235, line: 569, size: 14912, elements: !236)
!235 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!236 = !{!237, !238, !313, !314, !315, !316, !320, !321, !324, !325, !329, !341, !342, !343, !345, !346, !347, !409, !430, !431, !436, !443}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !234, file: !235, line: 571, baseType: !73, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !234, file: !235, line: 576, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !235, line: 287, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !235, line: 181, size: 1408, elements: !242)
!242 = !{!243, !246, !247, !248, !250, !251, !256, !257, !258, !265, !269, !274, !278, !279, !280, !281, !285, !289, !290, !291, !293, !294, !298, !312}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !241, file: !235, line: 182, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !241, file: !235, line: 183, baseType: !73, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !241, file: !235, line: 184, baseType: !73, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !235, line: 185, baseType: !249, size: 16, offset: 128)
!249 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !241, file: !235, line: 186, baseType: !249, size: 16, offset: 144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !241, file: !235, line: 187, baseType: !252, size: 128, offset: 192)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !235, line: 117, size: 128, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !252, file: !235, line: 118, baseType: !244, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !252, file: !235, line: 119, baseType: !73, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !241, file: !235, line: 188, baseType: !73, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !241, file: !235, line: 195, baseType: !42, size: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !241, file: !235, line: 197, baseType: !259, size: 64, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !233, !42, !264, !73}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !263, line: 145, baseType: !61)
!263 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !241, file: !235, line: 199, baseType: !266, size: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!262, !233, !42, !38, !73}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !241, file: !235, line: 202, baseType: !270, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !233, !42, !273, !73}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !263, line: 114, baseType: !61)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !241, file: !235, line: 203, baseType: !275, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!73, !233, !42}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !241, file: !235, line: 206, baseType: !252, size: 128, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !241, file: !235, line: 207, baseType: !244, size: 64, offset: 832)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !241, file: !235, line: 208, baseType: !73, size: 32, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !241, file: !235, line: 211, baseType: !282, size: 24, offset: 928)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 24, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !241, file: !235, line: 212, baseType: !286, size: 8, offset: 952)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 8, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 1)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !241, file: !235, line: 215, baseType: !252, size: 128, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !241, file: !235, line: 218, baseType: !73, size: 32, offset: 1088)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !235, line: 219, baseType: !292, size: 64, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !263, line: 44, baseType: !61)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !241, file: !235, line: 222, baseType: !233, size: 64, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !235, line: 226, baseType: !295, size: 32, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !263, line: 175, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !297, line: 12, baseType: !73)
!297 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !241, file: !235, line: 228, baseType: !299, size: 64, offset: 1312)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !263, line: 171, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !263, line: 163, size: 64, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !300, file: !263, line: 165, baseType: !73, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !300, file: !263, line: 170, baseType: !304, size: 32, offset: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !263, line: 166, size: 32, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !304, file: !263, line: 168, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !168, line: 124, baseType: !5)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !304, file: !263, line: 169, baseType: !309, size: 32)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 32, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 4)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !235, line: 229, baseType: !73, size: 32, offset: 1376)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !234, file: !235, line: 576, baseType: !239, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !234, file: !235, line: 576, baseType: !239, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !234, file: !235, line: 578, baseType: !73, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !234, file: !235, line: 579, baseType: !317, size: 200, offset: 288)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 200, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 25)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !234, file: !235, line: 582, baseType: !73, size: 32, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !234, file: !235, line: 583, baseType: !322, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !235, line: 40, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !234, file: !235, line: 585, baseType: !73, size: 32, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !234, file: !235, line: 587, baseType: !326, size: 64, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !233}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !234, file: !235, line: 590, baseType: !330, size: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !235, line: 47, size: 256, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !331, file: !235, line: 49, baseType: !330, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !331, file: !235, line: 50, baseType: !73, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !331, file: !235, line: 50, baseType: !73, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !331, file: !235, line: 50, baseType: !73, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !331, file: !235, line: 50, baseType: !73, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !331, file: !235, line: 51, baseType: !339, size: 32, offset: 192)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 32, elements: !287)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !235, line: 25, baseType: !5)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !234, file: !235, line: 591, baseType: !73, size: 32, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !234, file: !235, line: 592, baseType: !330, size: 64, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !234, file: !235, line: 593, baseType: !344, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !234, file: !235, line: 596, baseType: !73, size: 32, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !234, file: !235, line: 597, baseType: !264, size: 64, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !234, file: !235, line: 632, baseType: !348, size: 2880, offset: 1152)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !235, line: 599, size: 2880, elements: !349)
!349 = !{!350, !400}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !348, file: !235, line: 622, baseType: !351, size: 1728)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !235, line: 601, size: 1728, elements: !352)
!352 = !{!353, !354, !355, !359, !371, !372, !374, !382, !383, !384, !385, !389, !393, !394, !395, !396, !397, !398, !399}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !351, file: !235, line: 603, baseType: !5, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !351, file: !235, line: 604, baseType: !264, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !351, file: !235, line: 605, baseType: !356, size: 208, offset: 128)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 208, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 26)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !351, file: !235, line: 606, baseType: !360, size: 288, offset: 352)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !235, line: 55, size: 288, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !360, file: !235, line: 57, baseType: !73, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !360, file: !235, line: 58, baseType: !73, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !360, file: !235, line: 59, baseType: !73, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !360, file: !235, line: 60, baseType: !73, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !360, file: !235, line: 61, baseType: !73, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !360, file: !235, line: 62, baseType: !73, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !360, file: !235, line: 63, baseType: !73, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !360, file: !235, line: 64, baseType: !73, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !360, file: !235, line: 65, baseType: !73, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !351, file: !235, line: 607, baseType: !73, size: 32, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !351, file: !235, line: 608, baseType: !373, size: 64, offset: 704)
!373 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !351, file: !235, line: 609, baseType: !375, size: 112, offset: 768)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !235, line: 319, size: 112, elements: !376)
!376 = !{!377, !380, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !375, file: !235, line: 320, baseType: !378, size: 48)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 48, elements: !283)
!379 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !375, file: !235, line: 321, baseType: !378, size: 48, offset: 48)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !375, file: !235, line: 322, baseType: !379, size: 16, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !351, file: !235, line: 610, baseType: !299, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !351, file: !235, line: 611, baseType: !299, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !351, file: !235, line: 612, baseType: !299, size: 64, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !351, file: !235, line: 613, baseType: !386, size: 64, offset: 1088)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 8)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !351, file: !235, line: 614, baseType: !390, size: 192, offset: 1152)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 24)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !351, file: !235, line: 615, baseType: !73, size: 32, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !351, file: !235, line: 616, baseType: !299, size: 64, offset: 1376)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !351, file: !235, line: 617, baseType: !299, size: 64, offset: 1440)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !351, file: !235, line: 618, baseType: !299, size: 64, offset: 1504)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !351, file: !235, line: 619, baseType: !299, size: 64, offset: 1568)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !351, file: !235, line: 620, baseType: !299, size: 64, offset: 1632)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !351, file: !235, line: 621, baseType: !73, size: 32, offset: 1696)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !348, file: !235, line: 631, baseType: !401, size: 2880)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !235, line: 626, size: 2880, elements: !402)
!402 = !{!403, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !401, file: !235, line: 629, baseType: !404, size: 1920)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 1920, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 30)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !401, file: !235, line: 630, baseType: !408, size: 960, offset: 1920)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !405)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !234, file: !235, line: 636, baseType: !410, size: 64, offset: 4032)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !235, line: 93, size: 6336, elements: !412)
!412 = !{!413, !414, !415, !422}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !411, file: !235, line: 94, baseType: !410, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !411, file: !235, line: 95, baseType: !73, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !411, file: !235, line: 97, baseType: !416, size: 2048, offset: 128)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 2048, elements: !420)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{null}
!420 = !{!421}
!421 = !DISubrange(count: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !411, file: !235, line: 98, baseType: !423, size: 4160, offset: 2176)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !235, line: 74, size: 4160, elements: !424)
!424 = !{!425, !427, !428, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !423, file: !235, line: 75, baseType: !426, size: 2048)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2048, elements: !420)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !423, file: !235, line: 76, baseType: !426, size: 2048, offset: 2048)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !423, file: !235, line: 78, baseType: !340, size: 32, offset: 4096)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !423, file: !235, line: 81, baseType: !340, size: 32, offset: 4128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !234, file: !235, line: 637, baseType: !411, size: 6336, offset: 4096)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !234, file: !235, line: 641, baseType: !432, size: 64, offset: 10432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !73}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !234, file: !235, line: 646, baseType: !437, size: 192, offset: 10496)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !235, line: 291, size: 192, elements: !438)
!438 = !{!439, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !437, file: !235, line: 293, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !437, file: !235, line: 294, baseType: !73, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !437, file: !235, line: 295, baseType: !239, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !234, file: !235, line: 648, baseType: !444, size: 4224, offset: 10688)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 4224, elements: !283)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !34, file: !35, line: 85, baseType: !446, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !448)
!448 = !{!449, !453, !454, !461, !474}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !447, file: !4, line: 116, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !451, line: 64, baseType: !452)
!451 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !451, line: 63, baseType: !108)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !447, file: !4, line: 118, baseType: !450, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !447, file: !4, line: 120, baseType: !455, size: 128, offset: 128)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !456, line: 51, size: 128, elements: !457)
!456 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!457 = !{!458, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !456, line: 52, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !456, line: 53, baseType: !459, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !447, file: !4, line: 122, baseType: !462, size: 256, offset: 256)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !462, file: !4, line: 107, baseType: !3, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !462, file: !4, line: 109, baseType: !450, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !462, file: !4, line: 111, baseType: !467, size: 96, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !451, line: 72, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 68, size: 96, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !468, file: !451, line: 69, baseType: !73, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !468, file: !451, line: 70, baseType: !73, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !468, file: !451, line: 71, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !451, line: 61, baseType: !73)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !447, file: !4, line: 124, baseType: !455, size: 128, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !28, file: !11, line: 88, baseType: !476, size: 128, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !477, line: 413, baseType: !478)
!477 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !477, line: 411, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 395, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !479, file: !477, line: 398, baseType: !42, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !479, file: !477, line: 399, baseType: !5, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !28, file: !11, line: 89, baseType: !26, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !28, file: !11, line: 90, baseType: !485, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !11, line: 80, baseType: !10)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !28, file: !11, line: 91, baseType: !42, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !28, file: !11, line: 92, baseType: !42, size: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !28, file: !11, line: 93, baseType: !73, size: 32, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !28, file: !11, line: 94, baseType: !73, size: 32, offset: 480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !28, file: !11, line: 95, baseType: !492, size: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !477, line: 417, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !11, line: 146, size: 320, elements: !495)
!495 = !{!496, !504, !505, !506, !507}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !494, file: !11, line: 148, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !32, line: 12, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !500, line: 51, size: 192, elements: !501)
!500 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !499, file: !500, line: 52, baseType: !61, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !499, file: !500, line: 53, baseType: !65, size: 128, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !494, file: !11, line: 149, baseType: !73, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !494, file: !11, line: 156, baseType: !73, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !494, file: !11, line: 159, baseType: !73, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !494, file: !11, line: 160, baseType: !476, size: 128, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !28, file: !11, line: 96, baseType: !73, size: 32, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !28, file: !11, line: 97, baseType: !492, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !28, file: !11, line: 98, baseType: !73, size: 32, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !28, file: !11, line: 99, baseType: !73, size: 32, offset: 736)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !28, file: !11, line: 100, baseType: !73, size: 32, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !28, file: !11, line: 102, baseType: !514, size: 512, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !515, line: 372, baseType: !516)
!515 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 512, elements: !387)
!517 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !28, file: !11, line: 104, baseType: !73, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !28, file: !11, line: 106, baseType: !42, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !28, file: !11, line: 107, baseType: !42, size: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !23, file: !11, line: 393, baseType: !522, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !477, line: 416, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_key_t_", file: !11, line: 214, size: 256, elements: !525)
!525 = !{!526, !527, !528, !529}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !524, file: !11, line: 216, baseType: !5, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !524, file: !11, line: 217, baseType: !219, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "keyLock", scope: !524, file: !11, line: 218, baseType: !492, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !524, file: !11, line: 219, baseType: !42, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nextKey", scope: !23, file: !11, line: 394, baseType: !21, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nextThread", scope: !23, file: !11, line: 395, baseType: !21, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "prevKey", scope: !23, file: !11, line: 396, baseType: !21, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "prevThread", scope: !23, file: !11, line: 397, baseType: !21, size: 64, offset: 320)
!534 = !{i32 2, !"Dwarf Version", i32 4}
!535 = !{i32 2, !"Debug Info Version", i32 3}
!536 = !{i32 1, !"wchar_size", i32 4}
!537 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!538 = distinct !DISubprogram(name: "pte_tkAssocCreate", scope: !1, file: !1, line: 51, type: !539, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!73, !26, !522}
!541 = !{!542, !543, !544}
!542 = !DILocalVariable(name: "sp", arg: 1, scope: !538, file: !1, line: 51, type: !26)
!543 = !DILocalVariable(name: "key", arg: 2, scope: !538, file: !1, line: 51, type: !522)
!544 = !DILocalVariable(name: "assoc", scope: !538, file: !1, line: 83, type: !21)
!545 = !DILocation(line: 51, column: 35, scope: !538)
!546 = !DILocation(line: 51, column: 53, scope: !538)
!547 = !DILocation(line: 92, column: 30, scope: !538)
!548 = !DILocation(line: 83, column: 19, scope: !538)
!549 = !DILocation(line: 94, column: 13, scope: !550)
!550 = distinct !DILexicalBlock(scope: !538, file: !1, line: 94, column: 7)
!551 = !DILocation(line: 94, column: 7, scope: !538)
!552 = !DILocation(line: 99, column: 10, scope: !538)
!553 = !DILocation(line: 99, column: 17, scope: !538)
!554 = !{!555, !556, i64 0}
!555 = !{!"ThreadKeyAssoc", !556, i64 0, !556, i64 8, !556, i64 16, !556, i64 24, !556, i64 32, !556, i64 40}
!556 = !{!"any pointer", !557, i64 0}
!557 = !{!"omnipotent char", !558, i64 0}
!558 = !{!"Simple C/C++ TBAA"}
!559 = !DILocation(line: 100, column: 10, scope: !538)
!560 = !DILocation(line: 100, column: 14, scope: !538)
!561 = !{!555, !556, i64 8}
!562 = !DILocation(line: 105, column: 10, scope: !538)
!563 = !DILocation(line: 105, column: 21, scope: !538)
!564 = !{!555, !556, i64 40}
!565 = !DILocation(line: 106, column: 47, scope: !538)
!566 = !{!567, !556, i64 24}
!567 = !{!"pthread_key_t_", !568, i64 0, !556, i64 8, !556, i64 16, !556, i64 24}
!568 = !{!"int", !557, i64 0}
!569 = !DILocation(line: 106, column: 10, scope: !538)
!570 = !DILocation(line: 106, column: 21, scope: !538)
!571 = !{!555, !556, i64 24}
!572 = !DILocation(line: 107, column: 25, scope: !573)
!573 = distinct !DILexicalBlock(scope: !538, file: !1, line: 107, column: 7)
!574 = !DILocation(line: 107, column: 7, scope: !538)
!575 = !DILocation(line: 109, column: 26, scope: !576)
!576 = distinct !DILexicalBlock(scope: !573, file: !1, line: 108, column: 5)
!577 = !DILocation(line: 109, column: 37, scope: !576)
!578 = !DILocation(line: 110, column: 5, scope: !576)
!579 = !DILocation(line: 111, column: 16, scope: !538)
!580 = !DILocation(line: 116, column: 10, scope: !538)
!581 = !DILocation(line: 116, column: 18, scope: !538)
!582 = !{!555, !556, i64 32}
!583 = !DILocation(line: 117, column: 43, scope: !538)
!584 = !{!585, !556, i64 176}
!585 = !{!"pte_thread_t_", !556, i64 0, !586, i64 8, !556, i64 24, !557, i64 32, !556, i64 40, !556, i64 48, !568, i64 56, !568, i64 60, !556, i64 64, !568, i64 72, !556, i64 80, !568, i64 88, !568, i64 92, !568, i64 96, !557, i64 104, !568, i64 168, !556, i64 176, !556, i64 184}
!586 = !{!"", !556, i64 0, !568, i64 8}
!587 = !DILocation(line: 117, column: 10, scope: !538)
!588 = !DILocation(line: 117, column: 18, scope: !538)
!589 = !{!555, !556, i64 16}
!590 = !DILocation(line: 118, column: 22, scope: !591)
!591 = distinct !DILexicalBlock(scope: !538, file: !1, line: 118, column: 7)
!592 = !DILocation(line: 118, column: 7, scope: !538)
!593 = !DILocation(line: 120, column: 23, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !1, line: 119, column: 5)
!595 = !DILocation(line: 120, column: 31, scope: !594)
!596 = !DILocation(line: 121, column: 5, scope: !594)
!597 = !DILocation(line: 122, column: 12, scope: !538)
!598 = !DILocation(line: 124, column: 3, scope: !538)
!599 = !DILocation(line: 0, scope: !538)
