; ModuleID = '/root/.unikraft/libs/pthread-embedded/pte_osal.c'
source_filename = "/root/.unikraft/libs/pthread-embedded/pte_osal.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, {}*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, {}*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__uk_inittab39_pthread_initcall", scope: !2, file: !3, line: 68, type: !529, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !493)
!3 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/pte_osal.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !15, !21}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pte_osResult", file: !6, line: 38, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_generic_osal.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "PTE_OS_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PTE_OS_NO_RESOURCES", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PTE_OS_GENERAL_FAILURE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PTE_OS_TIMEOUT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PTE_OS_INTERRUPTED", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PTE_OS_INVALID_PARAM", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !16, line: 92, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !22, line: 68, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!28 = !{!29, !30, !473, !137, !104}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !33, line: 59, size: 1024, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !39, !40, !41, !42, !47, !52, !58, !60, !77, !228, !229, !230, !443}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !33, line: 60, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !32, file: !33, line: 61, baseType: !29, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !32, file: !33, line: 62, baseType: !29, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !32, file: !33, line: 63, baseType: !29, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !32, file: !33, line: 64, baseType: !43, size: 128, offset: 256)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !32, file: !33, line: 64, size: 128, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !43, file: !33, line: 64, baseType: !31, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !43, file: !33, line: 64, baseType: !30, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !33, line: 65, baseType: !48, size: 32, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 48, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !51, line: 79, baseType: !7)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !32, file: !33, line: 66, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !54, line: 49, baseType: !55)
!54 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !56, line: 128, baseType: !57)
!56 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !32, file: !33, line: 67, baseType: !59, size: 8, offset: 512)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !32, file: !33, line: 68, baseType: !61, size: 128, offset: 576)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !62, line: 42, size: 128, elements: !63)
!62 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!63 = !{!64, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !61, file: !62, line: 42, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !62, line: 35, size: 192, elements: !67)
!67 = !{!68, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !66, file: !62, line: 36, baseType: !69, size: 32)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !66, file: !62, line: 37, baseType: !31, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !66, file: !62, line: 38, baseType: !72, size: 64, offset: 128)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !62, line: 38, size: 64, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !72, file: !62, line: 38, baseType: !65, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !61, file: !62, line: 42, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !32, file: !33, line: 69, baseType: !78, size: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !80, line: 90, size: 2176, elements: !81)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !{!82, !87, !105, !110, !112, !114, !119, !127, !132, !138, !139, !140, !145, !225, !226, !227}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !79, file: !80, line: 91, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !80, line: 68, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !78}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !79, file: !80, line: 93, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !80, line: 71, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!69, !78, !31, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !95, line: 55, size: 128, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !96, file: !95, line: 57, baseType: !59, size: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !96, file: !95, line: 59, baseType: !100, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !95, line: 53, baseType: !69)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !96, file: !95, line: 61, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !54, line: 48, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !56, line: 129, baseType: !104)
!104 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !79, file: !80, line: 94, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !80, line: 74, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !78, !31}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !79, file: !80, line: 95, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !80, line: 76, baseType: !107)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !79, file: !80, line: 96, baseType: !113, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !80, line: 78, baseType: !107)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !79, file: !80, line: 98, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !80, line: 81, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!69, !78, !31, !100}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !79, file: !80, line: 99, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !80, line: 83, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!69, !78, !124, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !79, file: !80, line: 100, baseType: !128, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !80, line: 85, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!69, !78, !31, !69}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !79, file: !80, line: 101, baseType: !133, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !80, line: 87, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!69, !78, !124, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !79, file: !80, line: 104, baseType: !59, size: 8, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !79, file: !80, line: 105, baseType: !32, size: 1024, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !79, file: !80, line: 106, baseType: !141, size: 128, offset: 1664)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !33, line: 93, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !141, file: !33, line: 93, baseType: !31, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !141, file: !33, line: 93, baseType: !30, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !79, file: !80, line: 107, baseType: !146, size: 192, offset: 1792)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !147, line: 59, size: 192, elements: !148)
!147 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!148 = !{!149, !216, !220}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !146, file: !147, line: 61, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !147, line: 51, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!29, !154, !104, !104}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !156, line: 77, size: 832, elements: !157)
!156 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!157 = !{!158, !167, !172, !177, !183, !185, !190, !191, !192, !197, !202, !207, !208, !209}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !155, file: !156, line: 79, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !156, line: 54, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!29, !154, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !164, line: 40, baseType: !165)
!164 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !166, line: 129, baseType: !104)
!166 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !155, file: !156, line: 80, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !156, line: 56, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!29, !154, !163, !163}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !155, file: !156, line: 81, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !156, line: 62, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!29, !154, !29, !163}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !155, file: !156, line: 82, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !156, line: 58, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!69, !154, !182, !163, !163}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !155, file: !156, line: 83, baseType: !184, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !156, line: 60, baseType: !169)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !155, file: !156, line: 84, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !156, line: 64, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !154, !29}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !155, file: !156, line: 87, baseType: !186, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !155, file: !156, line: 88, baseType: !159, size: 64, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !155, file: !156, line: 92, baseType: !193, size: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !156, line: 66, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!29, !154, !104}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !155, file: !156, line: 93, baseType: !198, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !156, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !154, !29, !104}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !155, file: !156, line: 99, baseType: !203, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !156, line: 70, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!69, !154, !29, !163}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !155, file: !156, line: 100, baseType: !163, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !156, line: 103, baseType: !154, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !155, file: !156, line: 104, baseType: !210, offset: 832)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, elements: !214)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !49, line: 20, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !51, line: 41, baseType: !213)
!213 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!214 = !{!215}
!215 = !DISubrange(count: -1)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !146, file: !147, line: 63, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !29}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !146, file: !147, line: 65, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !147, line: 56, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !29, !29}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !79, file: !80, line: 108, baseType: !154, size: 64, offset: 1984)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !80, line: 109, baseType: !78, size: 64, offset: 2048)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !79, file: !80, line: 110, baseType: !29, size: 64, offset: 2112)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !32, file: !33, line: 70, baseType: !29, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !32, file: !33, line: 72, baseType: !69, size: 32, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !32, file: !33, line: 82, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !233, line: 569, size: 14912, elements: !234)
!233 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!234 = !{!235, !236, !311, !312, !313, !314, !318, !319, !322, !323, !327, !339, !340, !341, !343, !344, !345, !407, !428, !429, !434, !441}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !232, file: !233, line: 571, baseType: !69, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !232, file: !233, line: 576, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !233, line: 287, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !233, line: 181, size: 1408, elements: !240)
!240 = !{!241, !244, !245, !246, !248, !249, !254, !255, !256, !262, !266, !271, !275, !276, !277, !278, !282, !286, !287, !288, !290, !291, !295, !310}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !239, file: !233, line: 182, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !239, file: !233, line: 183, baseType: !69, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !239, file: !233, line: 184, baseType: !69, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !233, line: 185, baseType: !247, size: 16, offset: 128)
!247 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !239, file: !233, line: 186, baseType: !247, size: 16, offset: 144)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !239, file: !233, line: 187, baseType: !250, size: 128, offset: 192)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !233, line: 117, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !250, file: !233, line: 118, baseType: !242, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !250, file: !233, line: 119, baseType: !69, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !239, file: !233, line: 188, baseType: !69, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !239, file: !233, line: 195, baseType: !29, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !239, file: !233, line: 197, baseType: !257, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !231, !29, !261, !69}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !166, line: 145, baseType: !57)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !239, file: !233, line: 199, baseType: !263, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!260, !231, !29, !36, !69}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !239, file: !233, line: 202, baseType: !267, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !231, !29, !270, !69}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !166, line: 114, baseType: !57)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !239, file: !233, line: 203, baseType: !272, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!69, !231, !29}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !239, file: !233, line: 206, baseType: !250, size: 128, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !239, file: !233, line: 207, baseType: !242, size: 64, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !239, file: !233, line: 208, baseType: !69, size: 32, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !239, file: !233, line: 211, baseType: !279, size: 24, offset: 928)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 24, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 3)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !239, file: !233, line: 212, baseType: !283, size: 8, offset: 952)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 8, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 1)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !239, file: !233, line: 215, baseType: !250, size: 128, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !239, file: !233, line: 218, baseType: !69, size: 32, offset: 1088)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !233, line: 219, baseType: !289, size: 64, offset: 1152)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !166, line: 44, baseType: !57)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !239, file: !233, line: 222, baseType: !231, size: 64, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !233, line: 226, baseType: !292, size: 32, offset: 1280)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !166, line: 175, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !294, line: 12, baseType: !69)
!294 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !239, file: !233, line: 228, baseType: !296, size: 64, offset: 1312)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !166, line: 171, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 163, size: 64, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !297, file: !166, line: 165, baseType: !69, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !297, file: !166, line: 170, baseType: !301, size: 32, offset: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !297, file: !166, line: 166, size: 32, elements: !302)
!302 = !{!303, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !301, file: !166, line: 168, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !305, line: 124, baseType: !7)
!305 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !301, file: !166, line: 169, baseType: !307, size: 32)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 32, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 4)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !233, line: 229, baseType: !69, size: 32, offset: 1376)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !232, file: !233, line: 576, baseType: !237, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !232, file: !233, line: 576, baseType: !237, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !232, file: !233, line: 578, baseType: !69, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !232, file: !233, line: 579, baseType: !315, size: 200, offset: 288)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 200, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 25)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !232, file: !233, line: 582, baseType: !69, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !232, file: !233, line: 583, baseType: !320, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !233, line: 40, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !232, file: !233, line: 585, baseType: !69, size: 32, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !232, file: !233, line: 587, baseType: !324, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !231}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !232, file: !233, line: 590, baseType: !328, size: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !233, line: 47, size: 256, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !329, file: !233, line: 49, baseType: !328, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !329, file: !233, line: 51, baseType: !337, size: 32, offset: 192)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 32, elements: !284)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !233, line: 25, baseType: !7)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !232, file: !233, line: 591, baseType: !69, size: 32, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !232, file: !233, line: 592, baseType: !328, size: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !232, file: !233, line: 593, baseType: !342, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !232, file: !233, line: 596, baseType: !69, size: 32, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !232, file: !233, line: 597, baseType: !261, size: 64, offset: 1088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !232, file: !233, line: 632, baseType: !346, size: 2880, offset: 1152)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !233, line: 599, size: 2880, elements: !347)
!347 = !{!348, !398}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !346, file: !233, line: 622, baseType: !349, size: 1728)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !233, line: 601, size: 1728, elements: !350)
!350 = !{!351, !352, !353, !357, !369, !370, !372, !380, !381, !382, !383, !387, !391, !392, !393, !394, !395, !396, !397}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !349, file: !233, line: 603, baseType: !7, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !349, file: !233, line: 604, baseType: !261, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !349, file: !233, line: 605, baseType: !354, size: 208, offset: 128)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 208, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 26)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !349, file: !233, line: 606, baseType: !358, size: 288, offset: 352)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !233, line: 55, size: 288, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !358, file: !233, line: 57, baseType: !69, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !358, file: !233, line: 58, baseType: !69, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !358, file: !233, line: 59, baseType: !69, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !358, file: !233, line: 60, baseType: !69, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !358, file: !233, line: 61, baseType: !69, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !358, file: !233, line: 62, baseType: !69, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !358, file: !233, line: 63, baseType: !69, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !358, file: !233, line: 64, baseType: !69, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !358, file: !233, line: 65, baseType: !69, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !349, file: !233, line: 607, baseType: !69, size: 32, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !349, file: !233, line: 608, baseType: !371, size: 64, offset: 704)
!371 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !349, file: !233, line: 609, baseType: !373, size: 112, offset: 768)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !233, line: 319, size: 112, elements: !374)
!374 = !{!375, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !373, file: !233, line: 320, baseType: !376, size: 48)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 48, elements: !280)
!377 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !373, file: !233, line: 321, baseType: !376, size: 48, offset: 48)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !373, file: !233, line: 322, baseType: !377, size: 16, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !349, file: !233, line: 610, baseType: !296, size: 64, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !349, file: !233, line: 611, baseType: !296, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !349, file: !233, line: 612, baseType: !296, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !349, file: !233, line: 613, baseType: !384, size: 64, offset: 1088)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !349, file: !233, line: 614, baseType: !388, size: 192, offset: 1152)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 24)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !349, file: !233, line: 615, baseType: !69, size: 32, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !349, file: !233, line: 616, baseType: !296, size: 64, offset: 1376)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !349, file: !233, line: 617, baseType: !296, size: 64, offset: 1440)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !349, file: !233, line: 618, baseType: !296, size: 64, offset: 1504)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !349, file: !233, line: 619, baseType: !296, size: 64, offset: 1568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !349, file: !233, line: 620, baseType: !296, size: 64, offset: 1632)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !349, file: !233, line: 621, baseType: !69, size: 32, offset: 1696)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !346, file: !233, line: 631, baseType: !399, size: 2880)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !233, line: 626, size: 2880, elements: !400)
!400 = !{!401, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !399, file: !233, line: 629, baseType: !402, size: 1920)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 1920, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 30)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !399, file: !233, line: 630, baseType: !406, size: 960, offset: 1920)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !403)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !232, file: !233, line: 636, baseType: !408, size: 64, offset: 4032)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !233, line: 93, size: 6336, elements: !410)
!410 = !{!411, !412, !413, !420}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !409, file: !233, line: 94, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !409, file: !233, line: 95, baseType: !69, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !409, file: !233, line: 97, baseType: !414, size: 2048, offset: 128)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 2048, elements: !418)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null}
!418 = !{!419}
!419 = !DISubrange(count: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !409, file: !233, line: 98, baseType: !421, size: 4160, offset: 2176)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !233, line: 74, size: 4160, elements: !422)
!422 = !{!423, !425, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !421, file: !233, line: 75, baseType: !424, size: 2048)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !418)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !421, file: !233, line: 76, baseType: !424, size: 2048, offset: 2048)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !421, file: !233, line: 78, baseType: !338, size: 32, offset: 4096)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !421, file: !233, line: 81, baseType: !338, size: 32, offset: 4128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !232, file: !233, line: 637, baseType: !409, size: 6336, offset: 4096)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !232, file: !233, line: 641, baseType: !430, size: 64, offset: 10432)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !69}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !232, file: !233, line: 646, baseType: !435, size: 192, offset: 10496)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !233, line: 291, size: 192, elements: !436)
!436 = !{!437, !439, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !435, file: !233, line: 293, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !435, file: !233, line: 294, baseType: !69, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !435, file: !233, line: 295, baseType: !237, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !232, file: !233, line: 648, baseType: !442, size: 4224, offset: 10688)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 4224, elements: !280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !32, file: !33, line: 85, baseType: !444, size: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !16, line: 114, size: 640, elements: !446)
!446 = !{!447, !451, !452, !459, !472}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !445, file: !16, line: 116, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !449, line: 64, baseType: !450)
!449 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !449, line: 63, baseType: !104)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !445, file: !16, line: 118, baseType: !448, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !445, file: !16, line: 120, baseType: !453, size: 128, offset: 128)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !454, line: 51, size: 128, elements: !455)
!454 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !454, line: 52, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !454, line: 53, baseType: !457, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !445, file: !16, line: 122, baseType: !460, size: 256, offset: 256)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !16, line: 98, size: 256, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !460, file: !16, line: 107, baseType: !15, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !460, file: !16, line: 109, baseType: !448, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !460, file: !16, line: 111, baseType: !465, size: 96, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !449, line: 72, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !449, line: 68, size: 96, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !466, file: !449, line: 69, baseType: !69, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !466, file: !449, line: 70, baseType: !69, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !466, file: !449, line: 71, baseType: !471, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !449, line: 61, baseType: !69)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !445, file: !16, line: 124, baseType: !453, size: 128, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_data_t", file: !3, line: 54, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 39, size: 704, elements: !476)
!476 = !{!477, !482, !483, !484, !485, !491, !492}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "entry_point", scope: !475, file: !3, line: 41, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadEntryPoint", file: !6, line: 124, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!69, !29}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !475, file: !3, line: 43, baseType: !29, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uk_thread", scope: !475, file: !3, line: 45, baseType: !31, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !475, file: !3, line: 47, baseType: !29, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start_sem", scope: !475, file: !3, line: 49, baseType: !486, size: 192, offset: 256)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !487, line: 51, size: 192, elements: !488)
!487 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !486, file: !487, line: 52, baseType: !57, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !486, file: !487, line: 53, baseType: !61, size: 128, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_sem", scope: !475, file: !3, line: 51, baseType: !486, size: 192, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !475, file: !3, line: 53, baseType: !69, size: 32, offset: 640)
!493 = !{!0, !494, !516, !521, !527}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__str", scope: !496, file: !497, line: 190, type: !513, isLocal: true, isDefinition: true)
!496 = distinct !DISubprogram(name: "uk_pr_err", scope: !497, file: !497, line: 186, type: !498, isLocal: true, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !500)
!497 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!498 = !DISubroutineType(types: !499)
!499 = !{null, !36, null}
!500 = !{!501, !502}
!501 = !DILocalVariable(name: "fmt", arg: 1, scope: !496, file: !497, line: 186, type: !36)
!502 = !DILocalVariable(name: "argp", scope: !496, file: !497, line: 188, type: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !504, line: 32, baseType: !505)
!504 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 164, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 192, elements: !284)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 164, size: 192, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !507, file: !3, line: 164, baseType: !7, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !507, file: !3, line: 164, baseType: !7, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !507, file: !3, line: 164, baseType: !29, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !507, file: !3, line: 164, baseType: !29, size: 64, offset: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 20)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "__str", scope: !496, file: !497, line: 190, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 88, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 11)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "__str", scope: !523, file: !497, line: 198, type: !513, isLocal: true, isDefinition: true)
!523 = distinct !DISubprogram(name: "uk_pr_crit", scope: !497, file: !497, line: 194, type: !498, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !524)
!524 = !{!525, !526}
!525 = !DILocalVariable(name: "fmt", arg: 1, scope: !523, file: !497, line: 194, type: !36)
!526 = !DILocalVariable(name: "argp", scope: !523, file: !497, line: 196, type: !503)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "__str", scope: !523, file: !497, line: 198, type: !518, isLocal: true, isDefinition: true)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_init_func_t", file: !531, line: 43, baseType: !532)
!531 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/init.h", directory: "/root/.unikraft/apps/redis/build")
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!69}
!535 = !{i32 2, !"Dwarf Version", i32 4}
!536 = !{i32 2, !"Debug Info Version", i32 3}
!537 = !{i32 1, !"wchar_size", i32 4}
!538 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!539 = distinct !DISubprogram(name: "pthread_initcall", scope: !3, file: !3, line: 63, type: !533, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!540 = !{}
!541 = !DILocation(line: 65, column: 2, scope: !539)
!542 = !DILocation(line: 66, column: 9, scope: !539)
!543 = !DILocation(line: 66, column: 2, scope: !539)
!544 = distinct !DISubprogram(name: "pte_osInit", scope: !3, file: !3, line: 70, type: !545, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !548)
!545 = !DISubroutineType(types: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osResult", file: !6, line: 60, baseType: !5)
!548 = !{!549, !550, !551}
!549 = !DILocalVariable(name: "result", scope: !544, file: !3, line: 72, type: !547)
!550 = !DILocalVariable(name: "ptd", scope: !544, file: !3, line: 73, type: !473)
!551 = !DILocalVariable(name: "crnt", scope: !544, file: !3, line: 74, type: !31)
!552 = !DILocation(line: 72, column: 15, scope: !544)
!553 = !DILocation(line: 77, column: 11, scope: !544)
!554 = !DILocation(line: 78, column: 13, scope: !555)
!555 = distinct !DILexicalBlock(scope: !544, file: !3, line: 78, column: 6)
!556 = !DILocation(line: 78, column: 6, scope: !544)
!557 = !DILocation(line: 79, column: 3, scope: !558)
!558 = distinct !DILexicalBlock(scope: !555, file: !3, line: 78, column: 27)
!559 = !DILocation(line: 80, column: 3, scope: !558)
!560 = !DILocation(line: 84, column: 8, scope: !544)
!561 = !DILocation(line: 73, column: 21, scope: !544)
!562 = !DILocation(line: 85, column: 10, scope: !563)
!563 = distinct !DILexicalBlock(scope: !544, file: !3, line: 85, column: 6)
!564 = !DILocation(line: 85, column: 6, scope: !544)
!565 = !DILocation(line: 90, column: 13, scope: !544)
!566 = !DILocation(line: 90, column: 7, scope: !544)
!567 = !DILocation(line: 90, column: 11, scope: !544)
!568 = !{!569, !570, i64 24}
!569 = !{!"", !570, i64 0, !570, i64 8, !570, i64 16, !570, i64 24, !573, i64 32, !573, i64 56, !576, i64 80}
!570 = !{!"any pointer", !571, i64 0}
!571 = !{!"omnipotent char", !572, i64 0}
!572 = !{!"Simple C/C++ TBAA"}
!573 = !{!"uk_semaphore", !574, i64 0, !575, i64 8}
!574 = !{!"long", !571, i64 0}
!575 = !{!"uk_waitq", !570, i64 0, !570, i64 8}
!576 = !{!"int", !571, i64 0}
!577 = !DILocation(line: 91, column: 15, scope: !578)
!578 = distinct !DILexicalBlock(scope: !544, file: !3, line: 91, column: 6)
!579 = !DILocation(line: 91, column: 6, scope: !544)
!580 = !DILocation(line: 92, column: 3, scope: !581)
!581 = distinct !DILexicalBlock(scope: !578, file: !3, line: 91, column: 24)
!582 = !DILocation(line: 93, column: 3, scope: !581)
!583 = !DILocation(line: 95, column: 3, scope: !581)
!584 = !DILocation(line: 120, column: 2, scope: !585, inlinedAt: !591)
!585 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !586, file: !586, line: 116, type: !587, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !589)
!586 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!587 = !DISubroutineType(types: !588)
!588 = !{!104}
!589 = !{!590}
!590 = !DILocalVariable(name: "sp", scope: !585, file: !586, line: 118, type: !104)
!591 = distinct !DILocation(line: 154, column: 21, scope: !592, inlinedAt: !598)
!592 = distinct !DISubprogram(name: "uk_thread_current", scope: !33, file: !33, line: 151, type: !593, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{!31}
!595 = !{!596, !597}
!596 = !DILocalVariable(name: "current", scope: !592, file: !33, line: 153, type: !30)
!597 = !DILocalVariable(name: "sp", scope: !592, file: !33, line: 154, type: !104)
!598 = distinct !DILocation(line: 98, column: 2, scope: !544)
!599 = !{i32 483801}
!600 = !DILocation(line: 118, column: 16, scope: !585, inlinedAt: !591)
!601 = !DILocation(line: 121, column: 2, scope: !585, inlinedAt: !591)
!602 = !DILocation(line: 154, column: 16, scope: !592, inlinedAt: !598)
!603 = !DILocation(line: 156, column: 38, scope: !592, inlinedAt: !598)
!604 = !DILocation(line: 156, column: 12, scope: !592, inlinedAt: !598)
!605 = !DILocation(line: 153, column: 21, scope: !592, inlinedAt: !598)
!606 = !DILocation(line: 158, column: 9, scope: !592, inlinedAt: !598)
!607 = !{!570, !570, i64 0}
!608 = !DILocation(line: 158, column: 2, scope: !592, inlinedAt: !598)
!609 = !DILocation(line: 74, column: 20, scope: !544)
!610 = !DILocalVariable(name: "thread", arg: 1, scope: !611, file: !33, line: 145, type: !31)
!611 = distinct !DISubprogram(name: "uk_thread_set_private", scope: !33, file: !33, line: 145, type: !612, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !614)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !31, !29}
!614 = !{!610, !615}
!615 = !DILocalVariable(name: "prv", arg: 2, scope: !611, file: !33, line: 145, type: !29)
!616 = !DILocation(line: 145, column: 46, scope: !611, inlinedAt: !617)
!617 = distinct !DILocation(line: 100, column: 2, scope: !544)
!618 = !DILocation(line: 145, column: 60, scope: !611, inlinedAt: !617)
!619 = !DILocation(line: 147, column: 10, scope: !611, inlinedAt: !617)
!620 = !DILocation(line: 147, column: 14, scope: !611, inlinedAt: !617)
!621 = !{!622, !570, i64 96}
!622 = !{!"uk_thread", !570, i64 0, !570, i64 8, !570, i64 16, !570, i64 24, !623, i64 32, !576, i64 48, !574, i64 56, !624, i64 64, !575, i64 72, !570, i64 88, !570, i64 96, !576, i64 104, !570, i64 112, !570, i64 120}
!623 = !{!"", !570, i64 0, !570, i64 8}
!624 = !{!"_Bool", !571, i64 0}
!625 = !DILocation(line: 148, column: 1, scope: !611, inlinedAt: !617)
!626 = !DILocation(line: 101, column: 7, scope: !544)
!627 = !DILocation(line: 101, column: 17, scope: !544)
!628 = !{!569, !570, i64 16}
!629 = !DILocation(line: 101, column: 2, scope: !544)
!630 = !DILocation(line: 0, scope: !544)
!631 = !DILocation(line: 0, scope: !558)
!632 = !DILocation(line: 104, column: 2, scope: !544)
!633 = !DILocation(line: 186, column: 42, scope: !496)
!634 = !DILocation(line: 188, column: 2, scope: !496)
!635 = !DILocation(line: 188, column: 10, scope: !496)
!636 = !DILocation(line: 189, column: 2, scope: !496)
!637 = !DILocation(line: 190, column: 2, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !497, line: 190, column: 2)
!639 = distinct !DILexicalBlock(scope: !496, file: !497, line: 190, column: 2)
!640 = !DILocation(line: 191, column: 2, scope: !496)
!641 = !DILocation(line: 192, column: 1, scope: !496)
!642 = distinct !DISubprogram(name: "pte_kill", scope: !3, file: !3, line: 113, type: !643, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !647)
!643 = !DISubroutineType(types: !644)
!644 = !{!69, !645, !69}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !646, line: 11, baseType: !31)
!646 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!647 = !{!648, !649}
!648 = !DILocalVariable(name: "threadId", arg: 1, scope: !642, file: !3, line: 113, type: !645)
!649 = !DILocalVariable(name: "sig", arg: 2, scope: !642, file: !3, line: 113, type: !69)
!650 = !DILocation(line: 113, column: 33, scope: !642)
!651 = !DILocation(line: 113, column: 47, scope: !642)
!652 = !DILocation(line: 115, column: 9, scope: !642)
!653 = !DILocation(line: 115, column: 2, scope: !642)
!654 = distinct !DISubprogram(name: "pte_osThreadCreate", scope: !3, file: !3, line: 155, type: !655, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{!547, !478, !69, !69, !29, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!658 = !{!659, !660, !661, !662, !663, !664}
!659 = !DILocalVariable(name: "entry_point", arg: 1, scope: !654, file: !3, line: 155, type: !478)
!660 = !DILocalVariable(name: "stack_size", arg: 2, scope: !654, file: !3, line: 156, type: !69)
!661 = !DILocalVariable(name: "initial_prio", arg: 3, scope: !654, file: !3, line: 156, type: !69)
!662 = !DILocalVariable(name: "argv", arg: 4, scope: !654, file: !3, line: 156, type: !29)
!663 = !DILocalVariable(name: "ph", arg: 5, scope: !654, file: !3, line: 157, type: !657)
!664 = !DILocalVariable(name: "ptd", scope: !654, file: !3, line: 159, type: !473)
!665 = !DILocation(line: 155, column: 56, scope: !654)
!666 = !DILocation(line: 156, column: 6, scope: !654)
!667 = !DILocation(line: 156, column: 22, scope: !654)
!668 = !DILocation(line: 156, column: 42, scope: !654)
!669 = !DILocation(line: 157, column: 22, scope: !654)
!670 = !DILocation(line: 162, column: 18, scope: !654)
!671 = !DILocalVariable(name: "a", arg: 1, scope: !672, file: !156, line: 157, type: !154)
!672 = distinct !DISubprogram(name: "uk_malloc", scope: !156, file: !156, line: 157, type: !161, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !673)
!673 = !{!671, !674}
!674 = !DILocalVariable(name: "size", arg: 2, scope: !672, file: !156, line: 157, type: !163)
!675 = !DILocation(line: 157, column: 48, scope: !672, inlinedAt: !676)
!676 = distinct !DILocation(line: 162, column: 8, scope: !654)
!677 = !DILocation(line: 157, column: 58, scope: !672, inlinedAt: !676)
!678 = !DILocation(line: 159, column: 6, scope: !679, inlinedAt: !676)
!679 = distinct !DILexicalBlock(scope: !672, file: !156, line: 159, column: 6)
!680 = !DILocation(line: 159, column: 6, scope: !672, inlinedAt: !676)
!681 = !{!"branch_weights", i32 1, i32 2000}
!682 = !DILocation(line: 160, column: 3, scope: !683, inlinedAt: !676)
!683 = distinct !DILexicalBlock(scope: !679, file: !156, line: 159, column: 20)
!684 = !DILocation(line: 160, column: 9, scope: !683, inlinedAt: !676)
!685 = !{!576, !576, i64 0}
!686 = !DILocation(line: 161, column: 3, scope: !683, inlinedAt: !676)
!687 = !DILocation(line: 164, column: 1, scope: !672, inlinedAt: !676)
!688 = !DILocation(line: 159, column: 21, scope: !654)
!689 = !DILocation(line: 163, column: 6, scope: !654)
!690 = !DILocalVariable(name: "a", arg: 1, scope: !691, file: !156, line: 151, type: !154)
!691 = distinct !DISubprogram(name: "uk_do_malloc", scope: !156, file: !156, line: 151, type: !161, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !692)
!692 = !{!690, !693}
!693 = !DILocalVariable(name: "size", arg: 2, scope: !691, file: !156, line: 151, type: !163)
!694 = !DILocation(line: 151, column: 51, scope: !691, inlinedAt: !695)
!695 = distinct !DILocation(line: 163, column: 9, scope: !672, inlinedAt: !676)
!696 = !DILocation(line: 151, column: 61, scope: !691, inlinedAt: !695)
!697 = !DILocation(line: 153, column: 2, scope: !698, inlinedAt: !695)
!698 = distinct !DILexicalBlock(scope: !691, file: !156, line: 153, column: 2)
!699 = !DILocation(line: 154, column: 12, scope: !691, inlinedAt: !695)
!700 = !DILocation(line: 154, column: 9, scope: !691, inlinedAt: !695)
!701 = !DILocation(line: 154, column: 2, scope: !691, inlinedAt: !695)
!702 = !DILocation(line: 163, column: 2, scope: !672, inlinedAt: !676)
!703 = !DILocation(line: 163, column: 7, scope: !704)
!704 = distinct !DILexicalBlock(scope: !654, file: !3, line: 163, column: 6)
!705 = !DILocation(line: 166, column: 7, scope: !654)
!706 = !DILocation(line: 166, column: 19, scope: !654)
!707 = !{!569, !570, i64 0}
!708 = !DILocation(line: 167, column: 7, scope: !654)
!709 = !DILocation(line: 167, column: 12, scope: !654)
!710 = !{!569, !570, i64 8}
!711 = !DILocation(line: 170, column: 13, scope: !654)
!712 = !DILocation(line: 170, column: 7, scope: !654)
!713 = !DILocation(line: 170, column: 11, scope: !654)
!714 = !DILocation(line: 171, column: 15, scope: !715)
!715 = distinct !DILexicalBlock(scope: !654, file: !3, line: 171, column: 6)
!716 = !DILocation(line: 171, column: 6, scope: !654)
!717 = !DILocation(line: 172, column: 3, scope: !718)
!718 = distinct !DILexicalBlock(scope: !715, file: !3, line: 171, column: 24)
!719 = !DILocation(line: 173, column: 3, scope: !718)
!720 = !DILocation(line: 174, column: 3, scope: !718)
!721 = !DILocation(line: 177, column: 26, scope: !654)
!722 = !DILocation(line: 177, column: 2, scope: !654)
!723 = !DILocation(line: 178, column: 26, scope: !654)
!724 = !DILocation(line: 178, column: 2, scope: !654)
!725 = !DILocation(line: 179, column: 7, scope: !654)
!726 = !DILocation(line: 179, column: 12, scope: !654)
!727 = !{!569, !576, i64 80}
!728 = !DILocalVariable(name: "name", arg: 1, scope: !729, file: !33, line: 101, type: !36)
!729 = distinct !DISubprogram(name: "uk_thread_create_attr", scope: !33, file: !33, line: 101, type: !730, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!31, !36, !92, !217, !29}
!732 = !{!728, !733, !734, !735}
!733 = !DILocalVariable(name: "attr", arg: 2, scope: !729, file: !33, line: 102, type: !92)
!734 = !DILocalVariable(name: "function", arg: 3, scope: !729, file: !33, line: 102, type: !217)
!735 = !DILocalVariable(name: "arg", arg: 4, scope: !729, file: !33, line: 102, type: !29)
!736 = !DILocation(line: 101, column: 67, scope: !729, inlinedAt: !737)
!737 = distinct !DILocation(line: 181, column: 2, scope: !654)
!738 = !DILocation(line: 102, column: 26, scope: !729, inlinedAt: !737)
!739 = !DILocation(line: 102, column: 38, scope: !729, inlinedAt: !737)
!740 = !DILocation(line: 102, column: 63, scope: !729, inlinedAt: !737)
!741 = !DILocation(line: 104, column: 32, scope: !729, inlinedAt: !737)
!742 = !DILocation(line: 104, column: 9, scope: !729, inlinedAt: !737)
!743 = !DILocation(line: 104, column: 2, scope: !729, inlinedAt: !737)
!744 = !DILocation(line: 181, column: 2, scope: !654)
!745 = !DILocation(line: 183, column: 21, scope: !746)
!746 = distinct !DILexicalBlock(scope: !654, file: !3, line: 183, column: 6)
!747 = !DILocation(line: 183, column: 6, scope: !654)
!748 = !DILocation(line: 184, column: 28, scope: !749)
!749 = distinct !DILexicalBlock(scope: !746, file: !3, line: 183, column: 30)
!750 = !DILocation(line: 184, column: 3, scope: !749)
!751 = !DILocation(line: 185, column: 3, scope: !749)
!752 = !DILocation(line: 186, column: 3, scope: !749)
!753 = !DILocation(line: 191, column: 2, scope: !654)
!754 = !DILocation(line: 194, column: 2, scope: !654)
!755 = !DILocation(line: 145, column: 46, scope: !611, inlinedAt: !756)
!756 = distinct !DILocation(line: 194, column: 2, scope: !654)
!757 = !DILocation(line: 145, column: 60, scope: !611, inlinedAt: !756)
!758 = !DILocation(line: 147, column: 10, scope: !611, inlinedAt: !756)
!759 = !DILocation(line: 147, column: 14, scope: !611, inlinedAt: !756)
!760 = !DILocation(line: 148, column: 1, scope: !611, inlinedAt: !756)
!761 = !DILocation(line: 196, column: 13, scope: !654)
!762 = !DILocation(line: 196, column: 6, scope: !654)
!763 = !DILocation(line: 198, column: 2, scope: !654)
!764 = !DILocation(line: 0, scope: !704)
!765 = !DILocation(line: 199, column: 1, scope: !654)
!766 = distinct !DISubprogram(name: "uk_stub_thread_entry", scope: !3, file: !3, line: 142, type: !218, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !767)
!767 = !{!768, !769}
!768 = !DILocalVariable(name: "argv", arg: 1, scope: !766, file: !3, line: 142, type: !29)
!769 = !DILocalVariable(name: "ptd", scope: !766, file: !3, line: 147, type: !473)
!770 = !DILocation(line: 142, column: 40, scope: !766)
!771 = !DILocalVariable(name: "val", arg: 1, scope: !772, file: !773, line: 88, type: !48)
!772 = distinct !DISubprogram(name: "wrpkru", scope: !773, file: !773, line: 88, type: !774, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !776)
!773 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku.h", directory: "/root/.unikraft/apps/redis/build")
!774 = !DISubroutineType(types: !775)
!775 = !{null, !48}
!776 = !{!771}
!777 = !DILocation(line: 88, column: 67, scope: !772, inlinedAt: !778)
!778 = distinct !DILocation(line: 145, column: 2, scope: !766)
!779 = !DILocation(line: 91, column: 2, scope: !772, inlinedAt: !778)
!780 = !{i32 277494}
!781 = !DILocation(line: 97, column: 1, scope: !772, inlinedAt: !778)
!782 = !DILocation(line: 147, column: 21, scope: !766)
!783 = !DILocation(line: 150, column: 26, scope: !766)
!784 = !DILocation(line: 150, column: 2, scope: !766)
!785 = !DILocation(line: 152, column: 7, scope: !766)
!786 = !DILocation(line: 152, column: 24, scope: !766)
!787 = !DILocation(line: 152, column: 2, scope: !766)
!788 = !DILocation(line: 153, column: 1, scope: !766)
!789 = distinct !DISubprogram(name: "pte_osThreadStart", scope: !3, file: !3, line: 201, type: !790, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{!547, !645}
!792 = !{!793, !794}
!793 = !DILocalVariable(name: "h", arg: 1, scope: !789, file: !3, line: 201, type: !645)
!794 = !DILocalVariable(name: "ptd", scope: !789, file: !3, line: 203, type: !473)
!795 = !DILocation(line: 201, column: 51, scope: !789)
!796 = !DILocalVariable(name: "h", arg: 1, scope: !797, file: !3, line: 126, type: !645)
!797 = distinct !DISubprogram(name: "handle_to_ptd", scope: !3, file: !3, line: 126, type: !798, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!473, !645}
!800 = !{!796, !801}
!801 = !DILocalVariable(name: "res", scope: !797, file: !3, line: 128, type: !473)
!802 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !803)
!803 = distinct !DILocation(line: 203, column: 27, scope: !789)
!804 = !DILocalVariable(name: "thread", arg: 1, scope: !805, file: !33, line: 139, type: !31)
!805 = distinct !DISubprogram(name: "uk_thread_get_private", scope: !33, file: !33, line: 139, type: !806, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{!29, !31}
!808 = !{!804}
!809 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !810)
!810 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !803)
!811 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !810)
!812 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !810)
!813 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !803)
!814 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !803)
!815 = !DILocation(line: 203, column: 21, scope: !789)
!816 = !DILocalVariable(name: "s", arg: 1, scope: !817, file: !487, line: 194, type: !820)
!817 = distinct !DISubprogram(name: "uk_semaphore_up", scope: !487, file: !487, line: 194, type: !818, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !821)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !820}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!821 = !{!816, !822, !823}
!822 = !DILocalVariable(name: "irqf", scope: !817, file: !487, line: 196, type: !104)
!823 = !DILocalVariable(name: "wq", scope: !817, file: !487, line: 209, type: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!826 = !DILocation(line: 194, column: 57, scope: !817, inlinedAt: !827)
!827 = distinct !DILocation(line: 206, column: 2, scope: !789)
!828 = !DILocation(line: 198, column: 2, scope: !829, inlinedAt: !827)
!829 = distinct !DILexicalBlock(scope: !817, file: !487, line: 198, column: 2)
!830 = !DILocation(line: 200, column: 9, scope: !817, inlinedAt: !827)
!831 = !DILocation(line: 196, column: 16, scope: !817, inlinedAt: !827)
!832 = !DILocation(line: 201, column: 7, scope: !817, inlinedAt: !827)
!833 = !DILocation(line: 201, column: 2, scope: !817, inlinedAt: !827)
!834 = !{!573, !574, i64 0}
!835 = !DILocation(line: 209, column: 28, scope: !817, inlinedAt: !827)
!836 = !DILocalVariable(name: "wq", arg: 1, scope: !837, file: !838, line: 99, type: !841)
!837 = distinct !DISubprogram(name: "uk_waitq_wake_up", scope: !838, file: !838, line: 99, type: !839, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !842)
!838 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait.h", directory: "/root/.unikraft/apps/redis/build")
!839 = !DISubroutineType(types: !840)
!840 = !{null, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!842 = !{!836, !843, !844, !845}
!843 = !DILocalVariable(name: "flags", scope: !837, file: !838, line: 101, type: !104)
!844 = !DILocalVariable(name: "curr", scope: !837, file: !838, line: 102, type: !65)
!845 = !DILocalVariable(name: "tmp", scope: !837, file: !838, line: 102, type: !65)
!846 = !DILocation(line: 99, column: 40, scope: !837, inlinedAt: !847)
!847 = distinct !DILocation(line: 210, column: 2, scope: !817, inlinedAt: !827)
!848 = !DILocation(line: 104, column: 10, scope: !837, inlinedAt: !847)
!849 = !DILocation(line: 101, column: 16, scope: !837, inlinedAt: !847)
!850 = !DILocation(line: 105, column: 2, scope: !851, inlinedAt: !847)
!851 = distinct !DILexicalBlock(scope: !837, file: !838, line: 105, column: 2)
!852 = !{!575, !570, i64 0}
!853 = !DILocation(line: 102, column: 25, scope: !837, inlinedAt: !847)
!854 = !DILocation(line: 105, column: 2, scope: !855, inlinedAt: !847)
!855 = distinct !DILexicalBlock(scope: !851, file: !838, line: 105, column: 2)
!856 = !{!857, !570, i64 16}
!857 = !{!"uk_waitq_entry", !576, i64 0, !570, i64 8, !858, i64 16}
!858 = !{!"", !570, i64 0}
!859 = !DILocation(line: 102, column: 32, scope: !837, inlinedAt: !847)
!860 = !DILocation(line: 106, column: 24, scope: !855, inlinedAt: !847)
!861 = !{!857, !570, i64 8}
!862 = !DILocation(line: 106, column: 3, scope: !855, inlinedAt: !847)
!863 = distinct !{!863, !864, !865}
!864 = !DILocation(line: 105, column: 2, scope: !851)
!865 = !DILocation(line: 106, column: 30, scope: !851)
!866 = !DILocation(line: 107, column: 2, scope: !837, inlinedAt: !847)
!867 = !DILocation(line: 108, column: 1, scope: !837, inlinedAt: !847)
!868 = !DILocation(line: 211, column: 2, scope: !817, inlinedAt: !827)
!869 = !DILocation(line: 212, column: 1, scope: !817, inlinedAt: !827)
!870 = !DILocation(line: 208, column: 2, scope: !789)
!871 = distinct !DISubprogram(name: "pte_osThreadDelete", scope: !3, file: !3, line: 211, type: !790, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !872)
!872 = !{!873, !874}
!873 = !DILocalVariable(name: "h", arg: 1, scope: !871, file: !3, line: 211, type: !645)
!874 = !DILocalVariable(name: "ptd", scope: !871, file: !3, line: 213, type: !473)
!875 = !DILocation(line: 211, column: 52, scope: !871)
!876 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !877)
!877 = distinct !DILocation(line: 213, column: 27, scope: !871)
!878 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !879)
!879 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !877)
!880 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !879)
!881 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !879)
!882 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !877)
!883 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !877)
!884 = !DILocation(line: 213, column: 21, scope: !871)
!885 = !DILocation(line: 216, column: 27, scope: !871)
!886 = !DILocation(line: 216, column: 2, scope: !871)
!887 = !DILocation(line: 217, column: 7, scope: !871)
!888 = !DILocation(line: 217, column: 2, scope: !871)
!889 = !DILocation(line: 219, column: 2, scope: !871)
!890 = distinct !DISubprogram(name: "pte_osThreadExitAndDelete", scope: !3, file: !3, line: 222, type: !790, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !891)
!891 = !{!892}
!892 = !DILocalVariable(name: "h", arg: 1, scope: !890, file: !3, line: 222, type: !645)
!893 = !DILocation(line: 222, column: 59, scope: !890)
!894 = !DILocation(line: 224, column: 9, scope: !895)
!895 = distinct !DILexicalBlock(scope: !890, file: !3, line: 224, column: 6)
!896 = !{!622, !570, i64 88}
!897 = !DILocation(line: 224, column: 6, scope: !895)
!898 = !DILocation(line: 224, column: 6, scope: !890)
!899 = !DILocalVariable(name: "thread", arg: 1, scope: !900, file: !33, line: 117, type: !31)
!900 = distinct !DISubprogram(name: "uk_thread_kill", scope: !33, file: !33, line: 117, type: !901, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !903)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !31}
!903 = !{!899}
!904 = !DILocation(line: 117, column: 53, scope: !900, inlinedAt: !905)
!905 = distinct !DILocation(line: 225, column: 3, scope: !895)
!906 = !DILocation(line: 119, column: 2, scope: !900, inlinedAt: !905)
!907 = !DILocation(line: 120, column: 1, scope: !900, inlinedAt: !905)
!908 = !DILocation(line: 225, column: 3, scope: !895)
!909 = !DILocation(line: 211, column: 52, scope: !871, inlinedAt: !910)
!910 = distinct !DILocation(line: 226, column: 2, scope: !890)
!911 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !912)
!912 = distinct !DILocation(line: 213, column: 27, scope: !871, inlinedAt: !910)
!913 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !914)
!914 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !912)
!915 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !914)
!916 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !914)
!917 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !912)
!918 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !912)
!919 = !DILocation(line: 213, column: 21, scope: !871, inlinedAt: !910)
!920 = !DILocation(line: 216, column: 27, scope: !871, inlinedAt: !910)
!921 = !DILocation(line: 216, column: 2, scope: !871, inlinedAt: !910)
!922 = !DILocation(line: 217, column: 7, scope: !871, inlinedAt: !910)
!923 = !DILocation(line: 217, column: 2, scope: !871, inlinedAt: !910)
!924 = !DILocation(line: 219, column: 2, scope: !871, inlinedAt: !910)
!925 = !DILocation(line: 228, column: 2, scope: !890)
!926 = distinct !DISubprogram(name: "pte_osThreadExit", scope: !3, file: !3, line: 231, type: !416, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !927)
!927 = !{!928}
!928 = !DILocalVariable(name: "ptd", scope: !926, file: !3, line: 233, type: !473)
!929 = !DILocation(line: 233, column: 27, scope: !926)
!930 = !DILocation(line: 233, column: 21, scope: !926)
!931 = !DILocation(line: 235, column: 7, scope: !926)
!932 = !DILocation(line: 235, column: 12, scope: !926)
!933 = !DILocation(line: 236, column: 2, scope: !926)
!934 = distinct !DISubprogram(name: "current_ptd", scope: !3, file: !3, line: 133, type: !935, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !937)
!935 = !DISubroutineType(types: !936)
!936 = !{!473}
!937 = !{!938, !941}
!938 = !DILocalVariable(name: "thread", scope: !934, file: !3, line: 135, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !32)
!941 = !DILocalVariable(name: "ptd", scope: !934, file: !3, line: 136, type: !942)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!944 = !DILocation(line: 120, column: 2, scope: !585, inlinedAt: !945)
!945 = distinct !DILocation(line: 154, column: 21, scope: !592, inlinedAt: !946)
!946 = distinct !DILocation(line: 137, column: 2, scope: !934)
!947 = !DILocation(line: 118, column: 16, scope: !585, inlinedAt: !945)
!948 = !DILocation(line: 121, column: 2, scope: !585, inlinedAt: !945)
!949 = !DILocation(line: 154, column: 16, scope: !592, inlinedAt: !946)
!950 = !DILocation(line: 156, column: 38, scope: !592, inlinedAt: !946)
!951 = !DILocation(line: 156, column: 12, scope: !592, inlinedAt: !946)
!952 = !DILocation(line: 153, column: 21, scope: !592, inlinedAt: !946)
!953 = !DILocation(line: 158, column: 9, scope: !592, inlinedAt: !946)
!954 = !DILocation(line: 158, column: 2, scope: !592, inlinedAt: !946)
!955 = !DILocation(line: 135, column: 29, scope: !934)
!956 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !957)
!957 = distinct !DILocation(line: 138, column: 2, scope: !934)
!958 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !957)
!959 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !957)
!960 = !DILocation(line: 136, column: 30, scope: !934)
!961 = !DILocation(line: 139, column: 2, scope: !934)
!962 = distinct !DISubprogram(name: "pte_osThreadWaitForEnd", scope: !3, file: !3, line: 239, type: !790, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !963)
!963 = !{!964, !965, !966}
!964 = !DILocalVariable(name: "h", arg: 1, scope: !962, file: !3, line: 239, type: !645)
!965 = !DILocalVariable(name: "ptd", scope: !962, file: !3, line: 241, type: !473)
!966 = !DILocalVariable(name: "self_ptd", scope: !962, file: !3, line: 242, type: !473)
!967 = !DILocation(line: 239, column: 56, scope: !962)
!968 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !969)
!969 = distinct !DILocation(line: 241, column: 27, scope: !962)
!970 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !971)
!971 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !969)
!972 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !971)
!973 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !971)
!974 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !969)
!975 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !969)
!976 = !DILocation(line: 241, column: 21, scope: !962)
!977 = !DILocation(line: 120, column: 2, scope: !585, inlinedAt: !978)
!978 = distinct !DILocation(line: 154, column: 21, scope: !592, inlinedAt: !979)
!979 = distinct !DILocation(line: 137, column: 2, scope: !934, inlinedAt: !980)
!980 = distinct !DILocation(line: 242, column: 32, scope: !962)
!981 = !DILocation(line: 118, column: 16, scope: !585, inlinedAt: !978)
!982 = !DILocation(line: 121, column: 2, scope: !585, inlinedAt: !978)
!983 = !DILocation(line: 154, column: 16, scope: !592, inlinedAt: !979)
!984 = !DILocation(line: 156, column: 38, scope: !592, inlinedAt: !979)
!985 = !DILocation(line: 156, column: 12, scope: !592, inlinedAt: !979)
!986 = !DILocation(line: 153, column: 21, scope: !592, inlinedAt: !979)
!987 = !DILocation(line: 158, column: 9, scope: !592, inlinedAt: !979)
!988 = !DILocation(line: 158, column: 2, scope: !592, inlinedAt: !979)
!989 = !DILocation(line: 135, column: 29, scope: !934, inlinedAt: !980)
!990 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !991)
!991 = distinct !DILocation(line: 138, column: 2, scope: !934, inlinedAt: !980)
!992 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !991)
!993 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !991)
!994 = !DILocation(line: 136, column: 30, scope: !934, inlinedAt: !980)
!995 = !DILocation(line: 139, column: 2, scope: !934, inlinedAt: !980)
!996 = !DILocation(line: 242, column: 21, scope: !962)
!997 = !DILocation(line: 244, column: 2, scope: !962)
!998 = !DILocation(line: 245, column: 12, scope: !999)
!999 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 245, column: 7)
!1000 = distinct !DILexicalBlock(scope: !962, file: !3, line: 244, column: 12)
!1001 = !DILocation(line: 245, column: 7, scope: !999)
!1002 = !DILocation(line: 245, column: 7, scope: !1000)
!1003 = !DILocation(line: 246, column: 4, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !999, file: !3, line: 245, column: 18)
!1005 = !DILocation(line: 247, column: 4, scope: !1004)
!1006 = !DILocation(line: 250, column: 16, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 250, column: 7)
!1008 = !DILocation(line: 250, column: 40, scope: !1007)
!1009 = !{!569, !574, i64 56}
!1010 = !DILocation(line: 250, column: 46, scope: !1007)
!1011 = !DILocation(line: 250, column: 7, scope: !1000)
!1012 = !DILocation(line: 120, column: 2, scope: !585, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 154, column: 21, scope: !592, inlinedAt: !1014)
!1014 = distinct !DILocation(line: 117, column: 30, scope: !1015, inlinedAt: !1019)
!1015 = distinct !DISubprogram(name: "uk_sched_yield", scope: !80, file: !80, line: 114, type: !416, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1016)
!1016 = !{!1017, !1018}
!1017 = !DILocalVariable(name: "s", scope: !1015, file: !80, line: 116, type: !78)
!1018 = !DILocalVariable(name: "current", scope: !1015, file: !80, line: 117, type: !31)
!1019 = distinct !DILocation(line: 254, column: 4, scope: !1007)
!1020 = !DILocation(line: 118, column: 16, scope: !585, inlinedAt: !1013)
!1021 = !DILocation(line: 121, column: 2, scope: !585, inlinedAt: !1013)
!1022 = !DILocation(line: 154, column: 16, scope: !592, inlinedAt: !1014)
!1023 = !DILocation(line: 156, column: 38, scope: !592, inlinedAt: !1014)
!1024 = !DILocation(line: 156, column: 12, scope: !592, inlinedAt: !1014)
!1025 = !DILocation(line: 153, column: 21, scope: !592, inlinedAt: !1014)
!1026 = !DILocation(line: 158, column: 9, scope: !592, inlinedAt: !1014)
!1027 = !DILocation(line: 158, column: 2, scope: !592, inlinedAt: !1014)
!1028 = !DILocation(line: 117, column: 20, scope: !1015, inlinedAt: !1019)
!1029 = !DILocation(line: 119, column: 2, scope: !1030, inlinedAt: !1019)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !80, line: 119, column: 2)
!1031 = distinct !DILexicalBlock(scope: !1015, file: !80, line: 119, column: 2)
!1032 = !DILocation(line: 119, column: 2, scope: !1031, inlinedAt: !1019)
!1033 = !DILocation(line: 119, column: 2, scope: !1034, inlinedAt: !1019)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !80, line: 119, column: 2)
!1035 = !DILocation(line: 121, column: 15, scope: !1015, inlinedAt: !1019)
!1036 = !DILocation(line: 116, column: 19, scope: !1015, inlinedAt: !1019)
!1037 = !DILocation(line: 122, column: 2, scope: !1038, inlinedAt: !1019)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !80, line: 122, column: 2)
!1039 = distinct !DILexicalBlock(scope: !1015, file: !80, line: 122, column: 2)
!1040 = !DILocation(line: 122, column: 2, scope: !1039, inlinedAt: !1019)
!1041 = !DILocation(line: 122, column: 2, scope: !1042, inlinedAt: !1019)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !80, line: 122, column: 2)
!1043 = !DILocation(line: 123, column: 5, scope: !1015, inlinedAt: !1019)
!1044 = !{!1045, !570, i64 0}
!1045 = !{!"uk_sched", !570, i64 0, !570, i64 8, !570, i64 16, !570, i64 24, !570, i64 32, !570, i64 40, !570, i64 48, !570, i64 56, !570, i64 64, !624, i64 72, !622, i64 80, !1046, i64 208, !1047, i64 224, !570, i64 248, !570, i64 256, !570, i64 264}
!1046 = !{!"uk_thread_list", !570, i64 0, !570, i64 8}
!1047 = !{!"ukplat_ctx_callbacks", !570, i64 0, !570, i64 8, !570, i64 16}
!1048 = !DILocation(line: 123, column: 2, scope: !1015, inlinedAt: !1019)
!1049 = !DILocation(line: 124, column: 1, scope: !1015, inlinedAt: !1019)
!1050 = distinct !{!1050, !997, !1051}
!1051 = !DILocation(line: 255, column: 2, scope: !962)
!1052 = !DILocation(line: 0, scope: !1007)
!1053 = !DILocation(line: 0, scope: !1004)
!1054 = !DILocation(line: 256, column: 1, scope: !962)
!1055 = distinct !DISubprogram(name: "pte_osThreadCancel", scope: !3, file: !3, line: 258, type: !790, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1056)
!1056 = !{!1057, !1058}
!1057 = !DILocalVariable(name: "h", arg: 1, scope: !1055, file: !3, line: 258, type: !645)
!1058 = !DILocalVariable(name: "ptd", scope: !1055, file: !3, line: 260, type: !473)
!1059 = !DILocation(line: 258, column: 52, scope: !1055)
!1060 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 260, column: 27, scope: !1055)
!1062 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !1061)
!1064 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !1063)
!1065 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !1063)
!1066 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !1061)
!1067 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !1061)
!1068 = !DILocation(line: 260, column: 21, scope: !1055)
!1069 = !DILocation(line: 194, column: 57, scope: !817, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 262, column: 2, scope: !1055)
!1071 = !DILocation(line: 198, column: 2, scope: !829, inlinedAt: !1070)
!1072 = !DILocation(line: 200, column: 9, scope: !817, inlinedAt: !1070)
!1073 = !DILocation(line: 196, column: 16, scope: !817, inlinedAt: !1070)
!1074 = !DILocation(line: 201, column: 7, scope: !817, inlinedAt: !1070)
!1075 = !DILocation(line: 201, column: 2, scope: !817, inlinedAt: !1070)
!1076 = !DILocation(line: 209, column: 28, scope: !817, inlinedAt: !1070)
!1077 = !DILocation(line: 99, column: 40, scope: !837, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 210, column: 2, scope: !817, inlinedAt: !1070)
!1079 = !DILocation(line: 104, column: 10, scope: !837, inlinedAt: !1078)
!1080 = !DILocation(line: 101, column: 16, scope: !837, inlinedAt: !1078)
!1081 = !DILocation(line: 105, column: 2, scope: !851, inlinedAt: !1078)
!1082 = !DILocation(line: 102, column: 25, scope: !837, inlinedAt: !1078)
!1083 = !DILocation(line: 105, column: 2, scope: !855, inlinedAt: !1078)
!1084 = !DILocation(line: 102, column: 32, scope: !837, inlinedAt: !1078)
!1085 = !DILocation(line: 106, column: 24, scope: !855, inlinedAt: !1078)
!1086 = !DILocation(line: 106, column: 3, scope: !855, inlinedAt: !1078)
!1087 = !DILocation(line: 107, column: 2, scope: !837, inlinedAt: !1078)
!1088 = !DILocation(line: 108, column: 1, scope: !837, inlinedAt: !1078)
!1089 = !DILocation(line: 211, column: 2, scope: !817, inlinedAt: !1070)
!1090 = !DILocation(line: 212, column: 1, scope: !817, inlinedAt: !1070)
!1091 = !DILocation(line: 264, column: 2, scope: !1055)
!1092 = distinct !DISubprogram(name: "pte_osThreadCheckCancel", scope: !3, file: !3, line: 267, type: !790, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1093)
!1093 = !{!1094, !1095}
!1094 = !DILocalVariable(name: "h", arg: 1, scope: !1092, file: !3, line: 267, type: !645)
!1095 = !DILocalVariable(name: "ptd", scope: !1092, file: !3, line: 269, type: !473)
!1096 = !DILocation(line: 267, column: 57, scope: !1092)
!1097 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 269, column: 27, scope: !1092)
!1099 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !1098)
!1101 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !1100)
!1102 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !1100)
!1103 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !1098)
!1104 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !1098)
!1105 = !DILocation(line: 269, column: 21, scope: !1092)
!1106 = !DILocation(line: 271, column: 6, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 271, column: 6)
!1108 = !DILocation(line: 271, column: 10, scope: !1107)
!1109 = !DILocation(line: 271, column: 29, scope: !1107)
!1110 = !DILocation(line: 271, column: 35, scope: !1107)
!1111 = !DILocation(line: 271, column: 6, scope: !1092)
!1112 = !DILocation(line: 274, column: 2, scope: !1092)
!1113 = !DILocation(line: 0, scope: !1092)
!1114 = !DILocation(line: 0, scope: !1107)
!1115 = !DILocation(line: 275, column: 1, scope: !1092)
!1116 = distinct !DISubprogram(name: "pte_osThreadGetHandle", scope: !3, file: !3, line: 277, type: !1117, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1119)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!645}
!1119 = !{!1120}
!1120 = !DILocalVariable(name: "cur", scope: !1116, file: !3, line: 279, type: !31)
!1121 = !DILocation(line: 120, column: 2, scope: !585, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 154, column: 21, scope: !592, inlinedAt: !1123)
!1123 = distinct !DILocation(line: 280, column: 2, scope: !1116)
!1124 = !DILocation(line: 118, column: 16, scope: !585, inlinedAt: !1122)
!1125 = !DILocation(line: 121, column: 2, scope: !585, inlinedAt: !1122)
!1126 = !DILocation(line: 154, column: 16, scope: !592, inlinedAt: !1123)
!1127 = !DILocation(line: 156, column: 38, scope: !592, inlinedAt: !1123)
!1128 = !DILocation(line: 156, column: 12, scope: !592, inlinedAt: !1123)
!1129 = !DILocation(line: 153, column: 21, scope: !592, inlinedAt: !1123)
!1130 = !DILocation(line: 158, column: 9, scope: !592, inlinedAt: !1123)
!1131 = !DILocation(line: 158, column: 2, scope: !592, inlinedAt: !1123)
!1132 = !DILocation(line: 279, column: 20, scope: !1116)
!1133 = !DILocation(line: 281, column: 2, scope: !1116)
!1134 = distinct !DISubprogram(name: "pte_osThreadGetPriority", scope: !3, file: !3, line: 284, type: !1135, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1137)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!69, !645}
!1137 = !{!1138, !1139, !1140, !1141}
!1138 = !DILocalVariable(name: "h", arg: 1, scope: !1134, file: !3, line: 284, type: !645)
!1139 = !DILocalVariable(name: "ret", scope: !1134, file: !3, line: 286, type: !69)
!1140 = !DILocalVariable(name: "ptd", scope: !1134, file: !3, line: 287, type: !473)
!1141 = !DILocalVariable(name: "prio", scope: !1134, file: !3, line: 288, type: !100)
!1142 = !DILocation(line: 284, column: 48, scope: !1134)
!1143 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 287, column: 27, scope: !1134)
!1145 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !1146)
!1146 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !1144)
!1147 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !1146)
!1148 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !1146)
!1149 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !1144)
!1150 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !1144)
!1151 = !DILocation(line: 287, column: 21, scope: !1134)
!1152 = !DILocation(line: 288, column: 2, scope: !1134)
!1153 = !DILocation(line: 290, column: 2, scope: !1134)
!1154 = !DILocation(line: 288, column: 9, scope: !1134)
!1155 = !DILocation(line: 286, column: 6, scope: !1134)
!1156 = !DILocation(line: 293, column: 9, scope: !1134)
!1157 = !DILocation(line: 294, column: 1, scope: !1134)
!1158 = !DILocation(line: 293, column: 2, scope: !1134)
!1159 = distinct !DISubprogram(name: "pte_osThreadSetPriority", scope: !3, file: !3, line: 296, type: !1160, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1162)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!547, !645, !69}
!1162 = !{!1163, !1164, !1165, !1166}
!1163 = !DILocalVariable(name: "h", arg: 1, scope: !1159, file: !3, line: 296, type: !645)
!1164 = !DILocalVariable(name: "new_prio", arg: 2, scope: !1159, file: !3, line: 296, type: !69)
!1165 = !DILocalVariable(name: "ret", scope: !1159, file: !3, line: 298, type: !69)
!1166 = !DILocalVariable(name: "ptd", scope: !1159, file: !3, line: 299, type: !473)
!1167 = !DILocation(line: 296, column: 57, scope: !1159)
!1168 = !DILocation(line: 296, column: 64, scope: !1159)
!1169 = !DILocation(line: 126, column: 60, scope: !797, inlinedAt: !1170)
!1170 = distinct !DILocation(line: 299, column: 27, scope: !1159)
!1171 = !DILocation(line: 139, column: 47, scope: !805, inlinedAt: !1172)
!1172 = distinct !DILocation(line: 129, column: 2, scope: !797, inlinedAt: !1170)
!1173 = !DILocation(line: 141, column: 17, scope: !805, inlinedAt: !1172)
!1174 = !DILocation(line: 141, column: 2, scope: !805, inlinedAt: !1172)
!1175 = !DILocation(line: 128, column: 21, scope: !797, inlinedAt: !1170)
!1176 = !DILocation(line: 130, column: 2, scope: !797, inlinedAt: !1170)
!1177 = !DILocation(line: 299, column: 21, scope: !1159)
!1178 = !DILocation(line: 301, column: 2, scope: !1159)
!1179 = !DILocation(line: 298, column: 6, scope: !1159)
!1180 = !DILocation(line: 304, column: 9, scope: !1159)
!1181 = !DILocation(line: 304, column: 2, scope: !1159)
!1182 = distinct !DISubprogram(name: "pte_osThreadSleep", scope: !3, file: !3, line: 307, type: !1183, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1185)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{null, !7}
!1185 = !{!1186, !1187}
!1186 = !DILocalVariable(name: "msecs", arg: 1, scope: !1182, file: !3, line: 307, type: !7)
!1187 = !DILocalVariable(name: "nsec", scope: !1182, file: !3, line: 309, type: !102)
!1188 = !DILocation(line: 307, column: 37, scope: !1182)
!1189 = !DILocation(line: 309, column: 16, scope: !1182)
!1190 = !DILocation(line: 309, column: 9, scope: !1182)
!1191 = !DILocation(line: 311, column: 2, scope: !1182)
!1192 = !DILocation(line: 312, column: 1, scope: !1182)
!1193 = distinct !DISubprogram(name: "pte_osThreadGetMinPriority", scope: !3, file: !3, line: 314, type: !533, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!1194 = !DILocation(line: 316, column: 2, scope: !1193)
