; ModuleID = '/root/.unikraft/libs/pthread-embedded/pthread_sigmask.c'
source_filename = "/root/.unikraft/libs/pthread-embedded/pthread_sigmask.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @pthread_sigmask(i32, i64*, i64*) local_unnamed_addr #0 !dbg !316 {
  %4 = tail call i32 @uk_thread_sigmask(i32 %0, i64* %1, i64* %2) #3, !dbg !329
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !330
  ret i32 %4, !dbg !330
}

; Function Attrs: noredzone
declare dso_local i32 @uk_thread_sigmask(i32, i64*, i64*) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10)
!1 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/pthread_sigmask.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !14, line: 59, size: 1024, elements: !15)
!14 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !{!16, !20, !22, !23, !24, !29, !34, !40, !42, !59, !62, !63, !64, !279}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !14, line: 60, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !13, file: !14, line: 61, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !13, file: !14, line: 62, baseType: !21, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !13, file: !14, line: 63, baseType: !21, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !13, file: !14, line: 64, baseType: !25, size: 128, offset: 256)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 64, size: 128, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !25, file: !14, line: 64, baseType: !12, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !25, file: !14, line: 64, baseType: !11, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !14, line: 65, baseType: !30, size: 32, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 48, baseType: !32)
!31 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 79, baseType: !5)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !13, file: !14, line: 66, baseType: !35, size: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !36, line: 49, baseType: !37)
!36 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !38, line: 128, baseType: !39)
!38 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!39 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !13, file: !14, line: 67, baseType: !41, size: 8, offset: 512)
!41 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !13, file: !14, line: 68, baseType: !43, size: 128, offset: 576)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !44, line: 42, size: 128, elements: !45)
!44 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !{!46, !57}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !43, file: !44, line: 42, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !44, line: 35, size: 192, elements: !49)
!49 = !{!50, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !48, file: !44, line: 36, baseType: !51, size: 32)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !48, file: !44, line: 37, baseType: !12, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !48, file: !44, line: 38, baseType: !54, size: 64, offset: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !44, line: 38, size: 64, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !54, file: !44, line: 38, baseType: !47, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !43, file: !44, line: 42, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !13, file: !14, line: 69, baseType: !60, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !14, line: 53, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !13, file: !14, line: 70, baseType: !21, size: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !13, file: !14, line: 72, baseType: !51, size: 32, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !13, file: !14, line: 82, baseType: !65, size: 64, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !67, line: 569, size: 14912, elements: !68)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !{!69, !70, !146, !147, !148, !149, !153, !154, !158, !159, !163, !175, !176, !177, !179, !180, !181, !243, !264, !265, !270, !277}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !66, file: !67, line: 571, baseType: !51, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !66, file: !67, line: 576, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !67, line: 287, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !67, line: 181, size: 1408, elements: !74)
!74 = !{!75, !78, !79, !80, !82, !83, !88, !89, !90, !97, !101, !106, !110, !111, !112, !113, !117, !121, !122, !123, !125, !126, !130, !145}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !73, file: !67, line: 182, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !73, file: !67, line: 183, baseType: !51, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !73, file: !67, line: 184, baseType: !51, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !73, file: !67, line: 185, baseType: !81, size: 16, offset: 128)
!81 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !73, file: !67, line: 186, baseType: !81, size: 16, offset: 144)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !73, file: !67, line: 187, baseType: !84, size: 128, offset: 192)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !67, line: 117, size: 128, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !84, file: !67, line: 118, baseType: !76, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !84, file: !67, line: 119, baseType: !51, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !73, file: !67, line: 188, baseType: !51, size: 32, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !73, file: !67, line: 195, baseType: !21, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !73, file: !67, line: 197, baseType: !91, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !65, !21, !96, !51}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !95, line: 145, baseType: !39)
!95 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !73, file: !67, line: 199, baseType: !98, size: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!94, !65, !21, !17, !51}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !73, file: !67, line: 202, baseType: !102, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !65, !21, !105, !51}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !95, line: 114, baseType: !39)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !73, file: !67, line: 203, baseType: !107, size: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!51, !65, !21}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !73, file: !67, line: 206, baseType: !84, size: 128, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !73, file: !67, line: 207, baseType: !76, size: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !73, file: !67, line: 208, baseType: !51, size: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !73, file: !67, line: 211, baseType: !114, size: 24, offset: 928)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 24, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 3)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !73, file: !67, line: 212, baseType: !118, size: 8, offset: 952)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !73, file: !67, line: 215, baseType: !84, size: 128, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !73, file: !67, line: 218, baseType: !51, size: 32, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !73, file: !67, line: 219, baseType: !124, size: 64, offset: 1152)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !95, line: 44, baseType: !39)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !73, file: !67, line: 222, baseType: !65, size: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !73, file: !67, line: 226, baseType: !127, size: 32, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !95, line: 175, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !129, line: 12, baseType: !51)
!129 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !73, file: !67, line: 228, baseType: !131, size: 64, offset: 1312)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !95, line: 171, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 163, size: 64, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !132, file: !95, line: 165, baseType: !51, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !132, file: !95, line: 170, baseType: !136, size: 32, offset: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !95, line: 166, size: 32, elements: !137)
!137 = !{!138, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !136, file: !95, line: 168, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !140, line: 124, baseType: !5)
!140 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !136, file: !95, line: 169, baseType: !142, size: 32)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 4)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !73, file: !67, line: 229, baseType: !51, size: 32, offset: 1376)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !66, file: !67, line: 576, baseType: !71, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !66, file: !67, line: 576, baseType: !71, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !66, file: !67, line: 578, baseType: !51, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !66, file: !67, line: 579, baseType: !150, size: 200, offset: 288)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 200, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 25)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !66, file: !67, line: 582, baseType: !51, size: 32, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !66, file: !67, line: 583, baseType: !155, size: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !157, line: 9, flags: DIFlagFwdDecl)
!157 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !66, file: !67, line: 585, baseType: !51, size: 32, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !66, file: !67, line: 587, baseType: !160, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !65}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !66, file: !67, line: 590, baseType: !164, size: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !67, line: 47, size: 256, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !165, file: !67, line: 49, baseType: !164, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !165, file: !67, line: 50, baseType: !51, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !165, file: !67, line: 50, baseType: !51, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !165, file: !67, line: 50, baseType: !51, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !165, file: !67, line: 50, baseType: !51, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !165, file: !67, line: 51, baseType: !173, size: 32, offset: 192)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 32, elements: !119)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !67, line: 25, baseType: !5)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !66, file: !67, line: 591, baseType: !51, size: 32, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !66, file: !67, line: 592, baseType: !164, size: 64, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !66, file: !67, line: 593, baseType: !178, size: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !66, file: !67, line: 596, baseType: !51, size: 32, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !66, file: !67, line: 597, baseType: !96, size: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !66, file: !67, line: 632, baseType: !182, size: 2880, offset: 1152)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !67, line: 599, size: 2880, elements: !183)
!183 = !{!184, !234}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !182, file: !67, line: 622, baseType: !185, size: 1728)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !67, line: 601, size: 1728, elements: !186)
!186 = !{!187, !188, !189, !193, !205, !206, !208, !216, !217, !218, !219, !223, !227, !228, !229, !230, !231, !232, !233}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !185, file: !67, line: 603, baseType: !5, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !185, file: !67, line: 604, baseType: !96, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !185, file: !67, line: 605, baseType: !190, size: 208, offset: 128)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 208, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 26)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !185, file: !67, line: 606, baseType: !194, size: 288, offset: 352)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !67, line: 55, size: 288, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !194, file: !67, line: 57, baseType: !51, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !194, file: !67, line: 58, baseType: !51, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !194, file: !67, line: 59, baseType: !51, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !194, file: !67, line: 60, baseType: !51, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !194, file: !67, line: 61, baseType: !51, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !194, file: !67, line: 62, baseType: !51, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !194, file: !67, line: 63, baseType: !51, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !194, file: !67, line: 64, baseType: !51, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !194, file: !67, line: 65, baseType: !51, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !185, file: !67, line: 607, baseType: !51, size: 32, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !185, file: !67, line: 608, baseType: !207, size: 64, offset: 704)
!207 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !185, file: !67, line: 609, baseType: !209, size: 112, offset: 768)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !67, line: 319, size: 112, elements: !210)
!210 = !{!211, !214, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !209, file: !67, line: 320, baseType: !212, size: 48)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 48, elements: !115)
!213 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !209, file: !67, line: 321, baseType: !212, size: 48, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !209, file: !67, line: 322, baseType: !213, size: 16, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !185, file: !67, line: 610, baseType: !131, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !185, file: !67, line: 611, baseType: !131, size: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !185, file: !67, line: 612, baseType: !131, size: 64, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !185, file: !67, line: 613, baseType: !220, size: 64, offset: 1088)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 8)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !185, file: !67, line: 614, baseType: !224, size: 192, offset: 1152)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 24)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !185, file: !67, line: 615, baseType: !51, size: 32, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !185, file: !67, line: 616, baseType: !131, size: 64, offset: 1376)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !185, file: !67, line: 617, baseType: !131, size: 64, offset: 1440)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !185, file: !67, line: 618, baseType: !131, size: 64, offset: 1504)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !185, file: !67, line: 619, baseType: !131, size: 64, offset: 1568)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !185, file: !67, line: 620, baseType: !131, size: 64, offset: 1632)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !185, file: !67, line: 621, baseType: !51, size: 32, offset: 1696)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !182, file: !67, line: 631, baseType: !235, size: 2880)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !67, line: 626, size: 2880, elements: !236)
!236 = !{!237, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !235, file: !67, line: 629, baseType: !238, size: 1920)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1920, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 30)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !235, file: !67, line: 630, baseType: !242, size: 960, offset: 1920)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !239)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !66, file: !67, line: 636, baseType: !244, size: 64, offset: 4032)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !67, line: 93, size: 6336, elements: !246)
!246 = !{!247, !248, !249, !256}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !245, file: !67, line: 94, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !245, file: !67, line: 95, baseType: !51, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !245, file: !67, line: 97, baseType: !250, size: 2048, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 2048, elements: !254)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null}
!254 = !{!255}
!255 = !DISubrange(count: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !245, file: !67, line: 98, baseType: !257, size: 4160, offset: 2176)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !67, line: 74, size: 4160, elements: !258)
!258 = !{!259, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !257, file: !67, line: 75, baseType: !260, size: 2048)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !254)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !257, file: !67, line: 76, baseType: !260, size: 2048, offset: 2048)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !257, file: !67, line: 78, baseType: !174, size: 32, offset: 4096)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !257, file: !67, line: 81, baseType: !174, size: 32, offset: 4128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !66, file: !67, line: 637, baseType: !245, size: 6336, offset: 4096)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !66, file: !67, line: 641, baseType: !266, size: 64, offset: 10432)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !51}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !66, file: !67, line: 646, baseType: !271, size: 192, offset: 10496)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !67, line: 291, size: 192, elements: !272)
!272 = !{!273, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !271, file: !67, line: 293, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !271, file: !67, line: 294, baseType: !51, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !271, file: !67, line: 295, baseType: !71, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !66, file: !67, line: 648, baseType: !278, size: 4224, offset: 10688)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 4224, elements: !115)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !13, file: !14, line: 85, baseType: !280, size: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !282)
!282 = !{!283, !289, !290, !297, !311}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !281, file: !4, line: 116, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !285, line: 31, baseType: !286)
!285 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/select.h", directory: "/root/.unikraft/apps/redis/build")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !287, line: 41, baseType: !288)
!287 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_sigset.h", directory: "/root/.unikraft/apps/redis/build")
!288 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !281, file: !4, line: 118, baseType: !284, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !281, file: !4, line: 120, baseType: !291, size: 128, offset: 128)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !292, line: 51, size: 128, elements: !293)
!292 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!293 = !{!294, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !292, line: 52, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !291, file: !292, line: 53, baseType: !295, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !281, file: !4, line: 122, baseType: !298, size: 256, offset: 256)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !299)
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !298, file: !4, line: 107, baseType: !3, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !298, file: !4, line: 109, baseType: !284, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !298, file: !4, line: 111, baseType: !303, size: 96, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !304, line: 72, baseType: !305)
!304 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 68, size: 96, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !305, file: !304, line: 69, baseType: !51, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !305, file: !304, line: 70, baseType: !51, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !305, file: !304, line: 71, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !304, line: 61, baseType: !51)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !281, file: !4, line: 124, baseType: !291, size: 128, offset: 512)
!312 = !{i32 2, !"Dwarf Version", i32 4}
!313 = !{i32 2, !"Debug Info Version", i32 3}
!314 = !{i32 1, !"wchar_size", i32 4}
!315 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!316 = distinct !DISubprogram(name: "pthread_sigmask", scope: !1, file: !1, line: 26, type: !317, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !322)
!317 = !DISubroutineType(types: !318)
!318 = !{!51, !51, !319, !321}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!322 = !{!323, !324, !325}
!323 = !DILocalVariable(name: "how", arg: 1, scope: !316, file: !1, line: 26, type: !51)
!324 = !DILocalVariable(name: "set", arg: 2, scope: !316, file: !1, line: 26, type: !319)
!325 = !DILocalVariable(name: "oldset", arg: 3, scope: !316, file: !1, line: 26, type: !321)
!326 = !DILocation(line: 26, column: 25, scope: !316)
!327 = !DILocation(line: 26, column: 46, scope: !316)
!328 = !DILocation(line: 26, column: 61, scope: !316)
!329 = !DILocation(line: 28, column: 9, scope: !316)
!330 = !DILocation(line: 28, column: 2, scope: !316)
