; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_barrier_wait.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_barrier_wait.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pthread_barrier_t_ = type { i32, i32, i32, i32, [2 x %struct.sem_t_*] }
%struct.sem_t_ = type { i32, %struct.pthread_mutex_t_*, %struct.uk_semaphore* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.pte_handle_t = type { i8*, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !28)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_barrier_wait.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 435, baseType: !12, size: 32, elements: !13)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!14 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!15 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!16 = !DIEnumerator(name: "PTHREAD_INHERIT_SCHED", value: 0)
!17 = !DIEnumerator(name: "PTHREAD_EXPLICIT_SCHED", value: 1)
!18 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS", value: 0)
!19 = !DIEnumerator(name: "PTHREAD_SCOPE_SYSTEM", value: 1)
!20 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS_VFPU", value: 2)
!21 = !DIEnumerator(name: "PTHREAD_CANCEL_ENABLE", value: 0)
!22 = !DIEnumerator(name: "PTHREAD_CANCEL_DISABLE", value: 1)
!23 = !DIEnumerator(name: "PTHREAD_CANCEL_ASYNCHRONOUS", value: 0)
!24 = !DIEnumerator(name: "PTHREAD_CANCEL_DEFERRED", value: 1)
!25 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!26 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!27 = !DIEnumerator(name: "PTHREAD_BARRIER_SERIAL_THREAD", value: -1)
!28 = !{!29, !30, !161}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_barrier_t", file: !11, line: 424, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_barrier_t_", file: !33, line: 200, size: 256, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nCurrentBarrierHeight", scope: !32, file: !33, line: 202, baseType: !5, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nInitialBarrierHeight", scope: !32, file: !33, line: 203, baseType: !5, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "iStep", scope: !32, file: !33, line: 204, baseType: !12, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "pshared", scope: !32, file: !33, line: 205, baseType: !12, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "semBarrierBreeched", scope: !32, file: !33, line: 206, baseType: !40, size: 128, offset: 128)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !512)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !42, line: 78, baseType: !43)
!42 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_t_", file: !33, line: 136, size: 192, elements: !45)
!45 = !{!46, !47, !511}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !44, file: !33, line: 138, baseType: !12, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !44, file: !33, line: 139, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !11, line: 417, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !33, line: 146, size: 320, elements: !51)
!51 = !{!52, !501, !502, !503, !504}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !50, file: !33, line: 148, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !54, line: 12, baseType: !55)
!54 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !57, line: 51, size: 192, elements: !58)
!57 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !{!59, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !56, file: !57, line: 52, baseType: !60, size: 64)
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !56, file: !57, line: 53, baseType: !62, size: 128, offset: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !63, line: 42, size: 128, elements: !64)
!63 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !{!65, !499}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !62, file: !63, line: 42, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !63, line: 35, size: 192, elements: !68)
!68 = !{!69, !70, !495}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !67, file: !63, line: 36, baseType: !12, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !67, file: !63, line: 37, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !73, line: 59, size: 1024, elements: !74)
!73 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !{!75, !79, !80, !81, !82, !88, !93, !98, !100, !101, !250, !251, !252, !465}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 60, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !72, file: !73, line: 61, baseType: !29, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !72, file: !73, line: 62, baseType: !29, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !72, file: !73, line: 63, baseType: !29, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !72, file: !73, line: 64, baseType: !83, size: 128, offset: 256)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !73, line: 64, size: 128, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !83, file: !73, line: 64, baseType: !71, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !83, file: !73, line: 64, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !72, file: !73, line: 65, baseType: !89, size: 32, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !90, line: 48, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !92, line: 79, baseType: !5)
!92 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !72, file: !73, line: 66, baseType: !94, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !95, line: 49, baseType: !96)
!95 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !97, line: 128, baseType: !60)
!97 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !72, file: !73, line: 67, baseType: !99, size: 8, offset: 512)
!99 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !72, file: !73, line: 68, baseType: !62, size: 128, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !72, file: !73, line: 69, baseType: !102, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !104, line: 90, size: 2176, elements: !105)
!104 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!105 = !{!106, !111, !129, !134, !136, !138, !143, !151, !156, !162, !163, !164, !169, !247, !248, !249}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !103, file: !104, line: 91, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !104, line: 68, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !102}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !103, file: !104, line: 93, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !104, line: 71, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!12, !102, !71, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !119, line: 62, baseType: !120)
!119 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !119, line: 55, size: 128, elements: !121)
!121 = !{!122, !123, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !120, file: !119, line: 57, baseType: !99, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !120, file: !119, line: 59, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !119, line: 53, baseType: !12)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !120, file: !119, line: 61, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !95, line: 48, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !97, line: 129, baseType: !128)
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !103, file: !104, line: 94, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !104, line: 74, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !102, !71}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !103, file: !104, line: 95, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !104, line: 76, baseType: !131)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !103, file: !104, line: 96, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !104, line: 78, baseType: !131)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !103, file: !104, line: 98, baseType: !139, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !104, line: 81, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!12, !102, !71, !124}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !103, file: !104, line: 99, baseType: !144, size: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !104, line: 83, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!12, !102, !148, !150}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !103, file: !104, line: 100, baseType: !152, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !104, line: 85, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!12, !102, !71, !12}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !103, file: !104, line: 101, baseType: !157, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !104, line: 87, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!12, !102, !148, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !103, file: !104, line: 104, baseType: !99, size: 8, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !103, file: !104, line: 105, baseType: !72, size: 1024, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !103, file: !104, line: 106, baseType: !165, size: 128, offset: 1664)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !73, line: 93, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !165, file: !73, line: 93, baseType: !71, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !165, file: !73, line: 93, baseType: !87, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !103, file: !104, line: 107, baseType: !170, size: 192, offset: 1792)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !171, line: 59, size: 192, elements: !172)
!171 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!172 = !{!173, !238, !242}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !170, file: !171, line: 61, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !171, line: 51, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!29, !178, !128, !128}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !180, line: 77, size: 832, elements: !181)
!180 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!181 = !{!182, !189, !194, !199, !205, !207, !212, !213, !214, !219, !224, !229, !230, !231}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !179, file: !180, line: 79, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !180, line: 54, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!29, !178, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 58, baseType: !128)
!188 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !179, file: !180, line: 80, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !180, line: 56, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!29, !178, !187, !187}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !179, file: !180, line: 81, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !180, line: 62, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!29, !178, !29, !187}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !179, file: !180, line: 82, baseType: !200, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !180, line: 58, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!12, !178, !204, !187, !187}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !179, file: !180, line: 83, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !180, line: 60, baseType: !191)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !179, file: !180, line: 84, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !180, line: 64, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !178, !29}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !179, file: !180, line: 87, baseType: !208, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !179, file: !180, line: 88, baseType: !183, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !179, file: !180, line: 92, baseType: !215, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !180, line: 66, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!29, !178, !128}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !179, file: !180, line: 93, baseType: !220, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !180, line: 68, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !178, !29, !128}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !179, file: !180, line: 99, baseType: !225, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !180, line: 70, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!12, !178, !29, !187}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, file: !180, line: 100, baseType: !187, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !180, line: 103, baseType: !178, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !179, file: !180, line: 104, baseType: !232, offset: 832)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, elements: !236)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !90, line: 20, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !92, line: 41, baseType: !235)
!235 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!236 = !{!237}
!237 = !DISubrange(count: -1)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !170, file: !171, line: 63, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !29}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !170, file: !171, line: 65, baseType: !243, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !171, line: 56, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !29, !29}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !103, file: !104, line: 108, baseType: !178, size: 64, offset: 1984)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !104, line: 109, baseType: !102, size: 64, offset: 2048)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !103, file: !104, line: 110, baseType: !29, size: 64, offset: 2112)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !72, file: !73, line: 70, baseType: !29, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !72, file: !73, line: 72, baseType: !12, size: 32, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !72, file: !73, line: 82, baseType: !253, size: 64, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !255, line: 569, size: 14912, elements: !256)
!255 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!256 = !{!257, !258, !333, !334, !335, !336, !340, !341, !344, !345, !349, !361, !362, !363, !365, !366, !367, !429, !450, !451, !456, !463}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !254, file: !255, line: 571, baseType: !12, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !254, file: !255, line: 576, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !255, line: 287, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !255, line: 181, size: 1408, elements: !262)
!262 = !{!263, !266, !267, !268, !270, !271, !276, !277, !278, !285, !289, !294, !298, !299, !300, !301, !305, !309, !310, !311, !313, !314, !318, !332}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !261, file: !255, line: 182, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !261, file: !255, line: 183, baseType: !12, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !261, file: !255, line: 184, baseType: !12, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !261, file: !255, line: 185, baseType: !269, size: 16, offset: 128)
!269 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !261, file: !255, line: 186, baseType: !269, size: 16, offset: 144)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !261, file: !255, line: 187, baseType: !272, size: 128, offset: 192)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !255, line: 117, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !272, file: !255, line: 118, baseType: !264, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !272, file: !255, line: 119, baseType: !12, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !261, file: !255, line: 188, baseType: !12, size: 32, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !261, file: !255, line: 195, baseType: !29, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !261, file: !255, line: 197, baseType: !279, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !253, !29, !284, !12}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !283, line: 145, baseType: !60)
!283 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !261, file: !255, line: 199, baseType: !286, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!282, !253, !29, !76, !12}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !261, file: !255, line: 202, baseType: !290, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !253, !29, !293, !12}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !283, line: 114, baseType: !60)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !261, file: !255, line: 203, baseType: !295, size: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!12, !253, !29}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !261, file: !255, line: 206, baseType: !272, size: 128, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !261, file: !255, line: 207, baseType: !264, size: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !261, file: !255, line: 208, baseType: !12, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !261, file: !255, line: 211, baseType: !302, size: 24, offset: 928)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 24, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 3)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !261, file: !255, line: 212, baseType: !306, size: 8, offset: 952)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 8, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 1)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !261, file: !255, line: 215, baseType: !272, size: 128, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !261, file: !255, line: 218, baseType: !12, size: 32, offset: 1088)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !261, file: !255, line: 219, baseType: !312, size: 64, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !283, line: 44, baseType: !60)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !261, file: !255, line: 222, baseType: !253, size: 64, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !261, file: !255, line: 226, baseType: !315, size: 32, offset: 1280)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !283, line: 175, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !317, line: 12, baseType: !12)
!317 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !261, file: !255, line: 228, baseType: !319, size: 64, offset: 1312)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !283, line: 171, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 163, size: 64, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !320, file: !283, line: 165, baseType: !12, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !320, file: !283, line: 170, baseType: !324, size: 32, offset: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !283, line: 166, size: 32, elements: !325)
!325 = !{!326, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !324, file: !283, line: 168, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !188, line: 124, baseType: !5)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !324, file: !283, line: 169, baseType: !329, size: 32)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 32, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 4)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !261, file: !255, line: 229, baseType: !12, size: 32, offset: 1376)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !254, file: !255, line: 576, baseType: !259, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !254, file: !255, line: 576, baseType: !259, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !254, file: !255, line: 578, baseType: !12, size: 32, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !254, file: !255, line: 579, baseType: !337, size: 200, offset: 288)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 200, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 25)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !254, file: !255, line: 582, baseType: !12, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !254, file: !255, line: 583, baseType: !342, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !255, line: 40, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !254, file: !255, line: 585, baseType: !12, size: 32, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !254, file: !255, line: 587, baseType: !346, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !253}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !254, file: !255, line: 590, baseType: !350, size: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !255, line: 47, size: 256, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !351, file: !255, line: 49, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !351, file: !255, line: 50, baseType: !12, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !351, file: !255, line: 50, baseType: !12, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !351, file: !255, line: 50, baseType: !12, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !351, file: !255, line: 50, baseType: !12, size: 32, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !351, file: !255, line: 51, baseType: !359, size: 32, offset: 192)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 32, elements: !307)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !255, line: 25, baseType: !5)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !254, file: !255, line: 591, baseType: !12, size: 32, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !254, file: !255, line: 592, baseType: !350, size: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !254, file: !255, line: 593, baseType: !364, size: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !254, file: !255, line: 596, baseType: !12, size: 32, offset: 1024)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !254, file: !255, line: 597, baseType: !284, size: 64, offset: 1088)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !254, file: !255, line: 632, baseType: !368, size: 2880, offset: 1152)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !254, file: !255, line: 599, size: 2880, elements: !369)
!369 = !{!370, !420}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !368, file: !255, line: 622, baseType: !371, size: 1728)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !255, line: 601, size: 1728, elements: !372)
!372 = !{!373, !374, !375, !379, !391, !392, !394, !402, !403, !404, !405, !409, !413, !414, !415, !416, !417, !418, !419}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !371, file: !255, line: 603, baseType: !5, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !371, file: !255, line: 604, baseType: !284, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !371, file: !255, line: 605, baseType: !376, size: 208, offset: 128)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 208, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 26)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !371, file: !255, line: 606, baseType: !380, size: 288, offset: 352)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !255, line: 55, size: 288, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !380, file: !255, line: 57, baseType: !12, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !380, file: !255, line: 58, baseType: !12, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !380, file: !255, line: 59, baseType: !12, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !380, file: !255, line: 60, baseType: !12, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !380, file: !255, line: 61, baseType: !12, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !380, file: !255, line: 62, baseType: !12, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !380, file: !255, line: 63, baseType: !12, size: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !380, file: !255, line: 64, baseType: !12, size: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !380, file: !255, line: 65, baseType: !12, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !371, file: !255, line: 607, baseType: !12, size: 32, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !371, file: !255, line: 608, baseType: !393, size: 64, offset: 704)
!393 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !371, file: !255, line: 609, baseType: !395, size: 112, offset: 768)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !255, line: 319, size: 112, elements: !396)
!396 = !{!397, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !395, file: !255, line: 320, baseType: !398, size: 48)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 48, elements: !303)
!399 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !395, file: !255, line: 321, baseType: !398, size: 48, offset: 48)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !395, file: !255, line: 322, baseType: !399, size: 16, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !371, file: !255, line: 610, baseType: !319, size: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !371, file: !255, line: 611, baseType: !319, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !371, file: !255, line: 612, baseType: !319, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !371, file: !255, line: 613, baseType: !406, size: 64, offset: 1088)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !371, file: !255, line: 614, baseType: !410, size: 192, offset: 1152)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 192, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 24)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !371, file: !255, line: 615, baseType: !12, size: 32, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !371, file: !255, line: 616, baseType: !319, size: 64, offset: 1376)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !371, file: !255, line: 617, baseType: !319, size: 64, offset: 1440)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !371, file: !255, line: 618, baseType: !319, size: 64, offset: 1504)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !371, file: !255, line: 619, baseType: !319, size: 64, offset: 1568)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !371, file: !255, line: 620, baseType: !319, size: 64, offset: 1632)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !371, file: !255, line: 621, baseType: !12, size: 32, offset: 1696)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !368, file: !255, line: 631, baseType: !421, size: 2880)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !255, line: 626, size: 2880, elements: !422)
!422 = !{!423, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !421, file: !255, line: 629, baseType: !424, size: 1920)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1920, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 30)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !421, file: !255, line: 630, baseType: !428, size: 960, offset: 1920)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !425)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !254, file: !255, line: 636, baseType: !430, size: 64, offset: 4032)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !255, line: 93, size: 6336, elements: !432)
!432 = !{!433, !434, !435, !442}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !431, file: !255, line: 94, baseType: !430, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !431, file: !255, line: 95, baseType: !12, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !431, file: !255, line: 97, baseType: !436, size: 2048, offset: 128)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 2048, elements: !440)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null}
!440 = !{!441}
!441 = !DISubrange(count: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !431, file: !255, line: 98, baseType: !443, size: 4160, offset: 2176)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !255, line: 74, size: 4160, elements: !444)
!444 = !{!445, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !443, file: !255, line: 75, baseType: !446, size: 2048)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !440)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !443, file: !255, line: 76, baseType: !446, size: 2048, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !443, file: !255, line: 78, baseType: !360, size: 32, offset: 4096)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !443, file: !255, line: 81, baseType: !360, size: 32, offset: 4128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !254, file: !255, line: 637, baseType: !431, size: 6336, offset: 4096)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !254, file: !255, line: 641, baseType: !452, size: 64, offset: 10432)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !12}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !254, file: !255, line: 646, baseType: !457, size: 192, offset: 10496)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !255, line: 291, size: 192, elements: !458)
!458 = !{!459, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !457, file: !255, line: 293, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !457, file: !255, line: 294, baseType: !12, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !457, file: !255, line: 295, baseType: !259, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !254, file: !255, line: 648, baseType: !464, size: 4224, offset: 10688)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 4224, elements: !303)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !72, file: !73, line: 85, baseType: !466, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !468)
!468 = !{!469, !473, !474, !481, !494}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !467, file: !4, line: 116, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !471, line: 64, baseType: !472)
!471 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !471, line: 63, baseType: !128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !467, file: !4, line: 118, baseType: !470, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !467, file: !4, line: 120, baseType: !475, size: 128, offset: 128)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !476, line: 51, size: 128, elements: !477)
!476 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!477 = !{!478, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !475, file: !476, line: 52, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !475, file: !476, line: 53, baseType: !479, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !467, file: !4, line: 122, baseType: !482, size: 256, offset: 256)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !482, file: !4, line: 107, baseType: !3, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !482, file: !4, line: 109, baseType: !470, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !482, file: !4, line: 111, baseType: !487, size: 96, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !471, line: 72, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 68, size: 96, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !488, file: !471, line: 69, baseType: !12, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !488, file: !471, line: 70, baseType: !12, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !488, file: !471, line: 71, baseType: !493, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !471, line: 61, baseType: !12)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !467, file: !4, line: 124, baseType: !475, size: 128, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !67, file: !63, line: 38, baseType: !496, size: 64, offset: 128)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !63, line: 38, size: 64, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !496, file: !63, line: 38, baseType: !66, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !62, file: !63, line: 42, baseType: !500, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !50, file: !33, line: 149, baseType: !12, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !50, file: !33, line: 156, baseType: !12, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !50, file: !33, line: 159, baseType: !12, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !50, file: !33, line: 160, baseType: !505, size: 128, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !11, line: 413, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !11, line: 411, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 395, size: 128, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !507, file: !11, line: 398, baseType: !29, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !507, file: !11, line: 399, baseType: !5, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !44, file: !33, line: 140, baseType: !53, size: 64, offset: 128)
!512 = !{!513}
!513 = !DISubrange(count: 2)
!514 = !{i32 2, !"Dwarf Version", i32 4}
!515 = !{i32 2, !"Debug Info Version", i32 3}
!516 = !{i32 1, !"wchar_size", i32 4}
!517 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!518 = distinct !DISubprogram(name: "pthread_barrier_wait", scope: !1, file: !1, line: 48, type: !519, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !522)
!519 = !DISubroutineType(types: !520)
!520 = !{!12, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!522 = !{!523, !524, !525, !526, !527, !531}
!523 = !DILocalVariable(name: "barrier", arg: 1, scope: !518, file: !1, line: 48, type: !521)
!524 = !DILocalVariable(name: "result", scope: !518, file: !1, line: 50, type: !12)
!525 = !DILocalVariable(name: "step", scope: !518, file: !1, line: 51, type: !12)
!526 = !DILocalVariable(name: "b", scope: !518, file: !1, line: 52, type: !30)
!527 = !DILocalVariable(name: "__orig", scope: !528, file: !1, line: 96, type: !12)
!528 = distinct !DILexicalBlock(scope: !529, file: !1, line: 96, column: 17)
!529 = distinct !DILexicalBlock(scope: !530, file: !1, line: 94, column: 5)
!530 = distinct !DILexicalBlock(scope: !518, file: !1, line: 93, column: 7)
!531 = !DILocalVariable(name: "stored", scope: !532, file: !1, line: 96, type: !12)
!532 = distinct !DILexicalBlock(scope: !528, file: !1, line: 96, column: 17)
!533 = !DILocation(line: 48, column: 43, scope: !518)
!534 = !DILocation(line: 54, column: 15, scope: !535)
!535 = distinct !DILexicalBlock(scope: !518, file: !1, line: 54, column: 7)
!536 = !DILocation(line: 54, column: 23, scope: !535)
!537 = !DILocation(line: 54, column: 26, scope: !535)
!538 = !{!539, !539, i64 0}
!539 = !{!"any pointer", !540, i64 0}
!540 = !{!"omnipotent char", !541, i64 0}
!541 = !{!"Simple C/C++ TBAA"}
!542 = !DILocation(line: 54, column: 35, scope: !535)
!543 = !DILocation(line: 54, column: 7, scope: !518)
!544 = !DILocation(line: 52, column: 21, scope: !518)
!545 = !DILocation(line: 60, column: 13, scope: !518)
!546 = !{!547, !548, i64 8}
!547 = !{!"pthread_barrier_t_", !548, i64 0, !548, i64 4, !548, i64 8, !548, i64 12, !540, i64 16}
!548 = !{!"int", !540, i64 0}
!549 = !DILocation(line: 51, column: 7, scope: !518)
!550 = !DILocation(line: 62, column: 12, scope: !551)
!551 = distinct !DILexicalBlock(scope: !518, file: !1, line: 62, column: 7)
!552 = !DILocation(line: 62, column: 9, scope: !551)
!553 = !DILocation(line: 62, column: 7, scope: !518)
!554 = !DILocation(line: 65, column: 37, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !1, line: 63, column: 5)
!556 = !{!547, !548, i64 4}
!557 = !DILocation(line: 65, column: 32, scope: !555)
!558 = !{!547, !548, i64 0}
!559 = !DILocation(line: 76, column: 42, scope: !555)
!560 = !DILocation(line: 76, column: 17, scope: !555)
!561 = !DILocation(line: 77, column: 40, scope: !555)
!562 = !DILocation(line: 78, column: 63, scope: !555)
!563 = !DILocation(line: 77, column: 19, scope: !555)
!564 = !DILocation(line: 85, column: 28, scope: !565)
!565 = distinct !DILexicalBlock(scope: !551, file: !1, line: 81, column: 5)
!566 = !DILocation(line: 85, column: 16, scope: !565)
!567 = !DILocation(line: 50, column: 7, scope: !518)
!568 = !DILocation(line: 0, scope: !565)
!569 = !DILocation(line: 93, column: 9, scope: !530)
!570 = !DILocation(line: 93, column: 7, scope: !518)
!571 = !DILocation(line: 96, column: 17, scope: !528)
!572 = !DILocation(line: 96, column: 17, scope: !532)
!573 = !DILocation(line: 95, column: 22, scope: !529)
!574 = !DILocation(line: 95, column: 17, scope: !529)
!575 = !DILocation(line: 98, column: 5, scope: !529)
!576 = !DILocation(line: 0, scope: !518)
!577 = !DILocation(line: 0, scope: !578)
!578 = distinct !DILexicalBlock(scope: !535, file: !1, line: 55, column: 5)
