; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.redisReader = type { i32, [128 x i8], i8*, i64, i64, i64, [9 x %struct.redisReadTask], i32, i8*, %struct.redisReplyObjectFunctions*, i8* }
%struct.redisReadTask = type { i32, i32, i32, i8*, %struct.redisReadTask*, i8* }
%struct.redisReplyObjectFunctions = type { i8* (%struct.redisReadTask*, i8*, i64)*, i8* (%struct.redisReadTask*, i32)*, i8* (%struct.redisReadTask*, i64)*, i8* (%struct.redisReadTask*)*, void (i8*)* }

@.str = private unnamed_addr constant [81 x i8] c"/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.c\00", align 1
@__func__.redisReaderFeed = private unnamed_addr constant [16 x i8] c"redisReaderFeed\00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"r->buf != NULL\00", align 1
@.str.2 = private unnamed_addr constant [14 x i8] c"Out of memory\00", align 1
@__func__.processItem = private unnamed_addr constant [12 x i8] c"processItem\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"NULL\00", align 1
@.str.4 = private unnamed_addr constant [42 x i8] c"Protocol error, got %s as reply type byte\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"\22\5C%c\22\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !22, !32, !42, !52, !14, !53}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !7, line: 50, size: 24, elements: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/sds.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !{!9, !15, !16, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !6, file: !7, line: 51, baseType: !10, size: 8)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 24, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !13, line: 43, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !6, file: !7, line: 52, baseType: !10, size: 8, offset: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !6, file: !7, line: 53, baseType: !14, size: 8, offset: 16)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !6, file: !7, line: 54, baseType: !18, offset: 24)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !{!21}
!21 = !DISubrange(count: -1)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !7, line: 56, size: 40, elements: !24)
!24 = !{!25, !29, !30, !31}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !23, file: !7, line: 57, baseType: !26, size: 16)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 36, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !13, line: 57, baseType: !28)
!28 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !23, file: !7, line: 58, baseType: !26, size: 16, offset: 16)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !7, line: 59, baseType: !14, size: 8, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !23, file: !7, line: 60, baseType: !18, offset: 40)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !7, line: 62, size: 72, elements: !34)
!34 = !{!35, !39, !40, !41}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !33, file: !7, line: 63, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 48, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !13, line: 79, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !33, file: !7, line: 64, baseType: !36, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !7, line: 65, baseType: !14, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !7, line: 66, baseType: !18, offset: 72)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !7, line: 68, size: 136, elements: !44)
!44 = !{!45, !49, !50, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !7, line: 69, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 60, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !13, line: 105, baseType: !48)
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !43, file: !7, line: 70, baseType: !46, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !7, line: 71, baseType: !14, size: 8, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !43, file: !7, line: 72, baseType: !18, offset: 136)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 40, baseType: !55)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !56, line: 129, baseType: !48)
!56 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!61 = distinct !DISubprogram(name: "redisReaderCreateWithFunctions", scope: !1, file: !1, line: 416, type: !62, isLocal: false, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !124)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !96}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReader", file: !66, line: 95, baseType: !67)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.h", directory: "/root/.unikraft/apps/redis/build")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReader", file: !66, line: 80, size: 4480, elements: !68)
!68 = !{!69, !70, !74, !76, !77, !78, !79, !93, !94, !95, !123}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !67, file: !66, line: 81, baseType: !52, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !67, file: !66, line: 82, baseType: !71, size: 1024, offset: 32)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1024, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !67, file: !66, line: 84, baseType: !75, size: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !67, file: !66, line: 85, baseType: !53, size: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !66, line: 86, baseType: !53, size: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "maxbuf", scope: !67, file: !66, line: 87, baseType: !53, size: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rstack", scope: !67, file: !66, line: 89, baseType: !80, size: 2880, offset: 1344)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2880, elements: !91)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReadTask", file: !66, line: 70, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReadTask", file: !66, line: 63, size: 320, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !90}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !66, line: 64, baseType: !52, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !82, file: !66, line: 65, baseType: !52, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !82, file: !66, line: 66, baseType: !52, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !82, file: !66, line: 67, baseType: !4, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !82, file: !66, line: 68, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !82, file: !66, line: 69, baseType: !4, size: 64, offset: 256)
!91 = !{!92}
!92 = !DISubrange(count: 9)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ridx", scope: !67, file: !66, line: 90, baseType: !52, size: 32, offset: 4224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !67, file: !66, line: 91, baseType: !4, size: 64, offset: 4288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !67, file: !66, line: 93, baseType: !96, size: 64, offset: 4352)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReplyObjectFunctions", file: !66, line: 78, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReplyObjectFunctions", file: !66, line: 72, size: 320, elements: !99)
!99 = !{!100, !106, !110, !115, !119}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "createString", scope: !98, file: !66, line: 73, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!4, !104, !75, !53}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "createArray", scope: !98, file: !66, line: 74, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!4, !104, !52}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "createInteger", scope: !98, file: !66, line: 75, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!4, !104, !114}
!114 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "createNil", scope: !98, file: !66, line: 76, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!4, !104}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "freeObject", scope: !98, file: !66, line: 77, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !4}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !67, file: !66, line: 94, baseType: !4, size: 64, offset: 4416)
!124 = !{!125, !126}
!125 = !DILocalVariable(name: "fn", arg: 1, scope: !61, file: !1, line: 416, type: !96)
!126 = !DILocalVariable(name: "r", scope: !61, file: !1, line: 417, type: !64)
!127 = !DILocation(line: 416, column: 72, scope: !61)
!128 = !DILocation(line: 419, column: 9, scope: !61)
!129 = !DILocation(line: 417, column: 18, scope: !61)
!130 = !DILocation(line: 420, column: 11, scope: !131)
!131 = distinct !DILexicalBlock(scope: !61, file: !1, line: 420, column: 9)
!132 = !DILocation(line: 420, column: 9, scope: !61)
!133 = !DILocation(line: 423, column: 8, scope: !61)
!134 = !DILocation(line: 423, column: 12, scope: !61)
!135 = !{!136, !137, i64 0}
!136 = !{!"redisReader", !137, i64 0, !138, i64 4, !140, i64 136, !141, i64 144, !141, i64 152, !141, i64 160, !138, i64 168, !137, i64 528, !140, i64 536, !140, i64 544, !140, i64 552}
!137 = !{!"int", !138, i64 0}
!138 = !{!"omnipotent char", !139, i64 0}
!139 = !{!"Simple C/C++ TBAA"}
!140 = !{!"any pointer", !138, i64 0}
!141 = !{!"long", !138, i64 0}
!142 = !DILocation(line: 424, column: 8, scope: !61)
!143 = !DILocation(line: 424, column: 18, scope: !61)
!144 = !{!138, !138, i64 0}
!145 = !DILocation(line: 425, column: 8, scope: !61)
!146 = !DILocation(line: 425, column: 11, scope: !61)
!147 = !{!136, !140, i64 544}
!148 = !DILocation(line: 426, column: 14, scope: !61)
!149 = !DILocation(line: 426, column: 8, scope: !61)
!150 = !DILocation(line: 426, column: 12, scope: !61)
!151 = !{!136, !140, i64 136}
!152 = !DILocation(line: 427, column: 8, scope: !61)
!153 = !DILocation(line: 427, column: 15, scope: !61)
!154 = !{!136, !141, i64 160}
!155 = !DILocation(line: 428, column: 16, scope: !156)
!156 = distinct !DILexicalBlock(scope: !61, file: !1, line: 428, column: 9)
!157 = !DILocation(line: 428, column: 9, scope: !61)
!158 = !DILocation(line: 429, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !156, file: !1, line: 428, column: 25)
!160 = !DILocation(line: 430, column: 9, scope: !159)
!161 = !DILocation(line: 433, column: 8, scope: !61)
!162 = !DILocation(line: 433, column: 13, scope: !61)
!163 = !{!136, !137, i64 528}
!164 = !DILocation(line: 434, column: 5, scope: !61)
!165 = !DILocation(line: 0, scope: !61)
!166 = !DILocation(line: 0, scope: !131)
!167 = !DILocation(line: 435, column: 1, scope: !61)
!168 = distinct !DISubprogram(name: "redisReaderFree", scope: !1, file: !1, line: 437, type: !169, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !64}
!171 = !{!172}
!172 = !DILocalVariable(name: "r", arg: 1, scope: !168, file: !1, line: 437, type: !64)
!173 = !DILocation(line: 437, column: 35, scope: !168)
!174 = !DILocation(line: 438, column: 12, scope: !175)
!175 = distinct !DILexicalBlock(scope: !168, file: !1, line: 438, column: 9)
!176 = !{!136, !140, i64 536}
!177 = !DILocation(line: 438, column: 18, scope: !175)
!178 = !DILocation(line: 438, column: 26, scope: !175)
!179 = !DILocation(line: 438, column: 32, scope: !175)
!180 = !DILocation(line: 438, column: 29, scope: !175)
!181 = !DILocation(line: 438, column: 35, scope: !175)
!182 = !DILocation(line: 438, column: 45, scope: !175)
!183 = !{!184, !140, i64 32}
!184 = !{!"redisReplyObjectFunctions", !140, i64 0, !140, i64 8, !140, i64 16, !140, i64 24, !140, i64 32}
!185 = !DILocation(line: 438, column: 38, scope: !175)
!186 = !DILocation(line: 438, column: 9, scope: !168)
!187 = !DILocation(line: 439, column: 9, scope: !175)
!188 = !DILocation(line: 440, column: 12, scope: !189)
!189 = distinct !DILexicalBlock(scope: !168, file: !1, line: 440, column: 9)
!190 = !DILocation(line: 440, column: 16, scope: !189)
!191 = !DILocation(line: 440, column: 9, scope: !168)
!192 = !DILocation(line: 441, column: 9, scope: !189)
