; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/redis-check-rdb.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/redis-check-rdb.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon = type { %struct._rio*, %struct.redisObject*, i32, i64, i64, i64, i32, i32, [1024 x i8] }
%struct._rio = type { i64 (%struct._rio*, i8*, i64)*, i64 (%struct._rio*, i8*, i64)*, i64 (%struct._rio*)*, i32 (%struct._rio*)*, void (%struct._rio*, i8*, i64)*, i64, i64, i64, %union.anon }
%union.anon = type { %struct.anon.3 }
%struct.anon.3 = type { i32*, i32*, i32, i64, i8* }
%struct.redisObject = type { i32, i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rdbCheckMode", scope: !2, file: !3, line: 37, type: !27, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !11)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/redis-check-rdb.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !9, !10}
!6 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !{!0, !12, !17, !22, !356}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "rdb_check_doing_string", scope: !2, file: !3, line: 62, type: !14, isLocal: false, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 8)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "rdb_type_string", scope: !2, file: !3, line: 73, type: !19, isLocal: false, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 16)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "rdb", scope: !24, file: !3, line: 184, type: !297, isLocal: true, isDefinition: true)
!24 = distinct !DISubprogram(name: "redis_check_rdb", scope: !3, file: !3, line: 179, type: !25, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !243)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !7, !28}
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 66, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !32, line: 287, baseType: !33)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !32, line: 181, size: 1408, elements: !34)
!34 = !{!35, !38, !39, !40, !42, !43, !48, !49, !50, !210, !216, !221, !225, !226, !227, !228, !230, !232, !233, !234, !236, !237, !241, !242}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !33, file: !32, line: 182, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !33, file: !32, line: 183, baseType: !27, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !33, file: !32, line: 184, baseType: !27, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !33, file: !32, line: 185, baseType: !41, size: 16, offset: 128)
!41 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !33, file: !32, line: 186, baseType: !41, size: 16, offset: 144)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !33, file: !32, line: 187, baseType: !44, size: 128, offset: 192)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !32, line: 117, size: 128, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !44, file: !32, line: 118, baseType: !36, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !44, file: !32, line: 119, baseType: !27, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !33, file: !32, line: 188, baseType: !27, size: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !33, file: !32, line: 195, baseType: !10, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !33, file: !32, line: 197, baseType: !51, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !57, !10, !7, !27}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !55, line: 145, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !32, line: 569, size: 14912, elements: !59)
!59 = !{!60, !61, !63, !64, !65, !66, !70, !71, !74, !75, !79, !93, !94, !95, !97, !98, !99, !174, !195, !196, !201, !208}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !58, file: !32, line: 571, baseType: !27, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !58, file: !32, line: 576, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !58, file: !32, line: 576, baseType: !62, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !58, file: !32, line: 576, baseType: !62, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !58, file: !32, line: 578, baseType: !27, size: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !58, file: !32, line: 579, baseType: !67, size: 200, offset: 288)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 25)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !58, file: !32, line: 582, baseType: !27, size: 32, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !58, file: !32, line: 583, baseType: !72, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !32, line: 40, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !58, file: !32, line: 585, baseType: !27, size: 32, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !58, file: !32, line: 587, baseType: !76, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !57}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !58, file: !32, line: 590, baseType: !80, size: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !32, line: 47, size: 256, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !81, file: !32, line: 49, baseType: !80, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !81, file: !32, line: 50, baseType: !27, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !81, file: !32, line: 50, baseType: !27, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !81, file: !32, line: 50, baseType: !27, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !81, file: !32, line: 50, baseType: !27, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !81, file: !32, line: 51, baseType: !89, size: 32, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 32, elements: !91)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !32, line: 25, baseType: !9)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !58, file: !32, line: 591, baseType: !27, size: 32, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !58, file: !32, line: 592, baseType: !80, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !58, file: !32, line: 593, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !58, file: !32, line: 596, baseType: !27, size: 32, offset: 1024)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !58, file: !32, line: 597, baseType: !7, size: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !58, file: !32, line: 632, baseType: !100, size: 2880, offset: 1152)
!100 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !32, line: 599, size: 2880, elements: !101)
!101 = !{!102, !165}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !100, file: !32, line: 622, baseType: !103, size: 1728)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !32, line: 601, size: 1728, elements: !104)
!104 = !{!105, !106, !107, !111, !123, !124, !125, !135, !150, !151, !152, !154, !158, !159, !160, !161, !162, !163, !164}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !103, file: !32, line: 603, baseType: !9, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !103, file: !32, line: 604, baseType: !7, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !103, file: !32, line: 605, baseType: !108, size: 208, offset: 128)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 208, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 26)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !103, file: !32, line: 606, baseType: !112, size: 288, offset: 352)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !32, line: 55, size: 288, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !112, file: !32, line: 57, baseType: !27, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !112, file: !32, line: 58, baseType: !27, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !112, file: !32, line: 59, baseType: !27, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !112, file: !32, line: 60, baseType: !27, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !112, file: !32, line: 61, baseType: !27, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !112, file: !32, line: 62, baseType: !27, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !112, file: !32, line: 63, baseType: !27, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !112, file: !32, line: 64, baseType: !27, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !112, file: !32, line: 65, baseType: !27, size: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !103, file: !32, line: 607, baseType: !27, size: 32, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !103, file: !32, line: 608, baseType: !6, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !103, file: !32, line: 609, baseType: !126, size: 112, offset: 768)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !32, line: 319, size: 112, elements: !127)
!127 = !{!128, !133, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !126, file: !32, line: 320, baseType: !129, size: 48)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 48, elements: !131)
!130 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !126, file: !32, line: 321, baseType: !129, size: 48, offset: 48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !126, file: !32, line: 322, baseType: !130, size: 16, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !103, file: !32, line: 610, baseType: !136, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !55, line: 171, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 163, size: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !137, file: !55, line: 165, baseType: !27, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !137, file: !55, line: 170, baseType: !141, size: 32, offset: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !55, line: 166, size: 32, elements: !142)
!142 = !{!143, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !141, file: !55, line: 168, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !145, line: 124, baseType: !9)
!145 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !141, file: !55, line: 169, baseType: !147, size: 32)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !103, file: !32, line: 611, baseType: !136, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !103, file: !32, line: 612, baseType: !136, size: 64, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !103, file: !32, line: 613, baseType: !153, size: 64, offset: 1088)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !15)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !103, file: !32, line: 614, baseType: !155, size: 192, offset: 1152)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 24)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !103, file: !32, line: 615, baseType: !27, size: 32, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !103, file: !32, line: 616, baseType: !136, size: 64, offset: 1376)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !103, file: !32, line: 617, baseType: !136, size: 64, offset: 1440)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !103, file: !32, line: 618, baseType: !136, size: 64, offset: 1504)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !103, file: !32, line: 619, baseType: !136, size: 64, offset: 1568)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !103, file: !32, line: 620, baseType: !136, size: 64, offset: 1632)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !103, file: !32, line: 621, baseType: !27, size: 32, offset: 1696)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !100, file: !32, line: 631, baseType: !166, size: 2880)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !32, line: 626, size: 2880, elements: !167)
!167 = !{!168, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !166, file: !32, line: 629, baseType: !169, size: 1920)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1920, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 30)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !166, file: !32, line: 630, baseType: !173, size: 960, offset: 1920)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 960, elements: !170)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !58, file: !32, line: 636, baseType: !175, size: 64, offset: 4032)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !32, line: 93, size: 6336, elements: !177)
!177 = !{!178, !179, !180, !187}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !176, file: !32, line: 94, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !176, file: !32, line: 95, baseType: !27, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !176, file: !32, line: 97, baseType: !181, size: 2048, offset: 128)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 2048, elements: !185)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null}
!185 = !{!186}
!186 = !DISubrange(count: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !176, file: !32, line: 98, baseType: !188, size: 4160, offset: 2176)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !32, line: 74, size: 4160, elements: !189)
!189 = !{!190, !192, !193, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !188, file: !32, line: 75, baseType: !191, size: 2048)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !185)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !188, file: !32, line: 76, baseType: !191, size: 2048, offset: 2048)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !188, file: !32, line: 78, baseType: !90, size: 32, offset: 4096)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !188, file: !32, line: 81, baseType: !90, size: 32, offset: 4128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !58, file: !32, line: 637, baseType: !176, size: 6336, offset: 4096)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !58, file: !32, line: 641, baseType: !197, size: 64, offset: 10432)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !27}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !58, file: !32, line: 646, baseType: !202, size: 192, offset: 10496)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !32, line: 291, size: 192, elements: !203)
!203 = !{!204, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !202, file: !32, line: 293, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !202, file: !32, line: 294, baseType: !27, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !202, file: !32, line: 295, baseType: !62, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !58, file: !32, line: 648, baseType: !209, size: 4224, offset: 10688)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 4224, elements: !131)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !33, file: !32, line: 199, baseType: !211, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!54, !57, !10, !214, !27}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !33, file: !32, line: 202, baseType: !217, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !57, !10, !220, !27}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !55, line: 114, baseType: !56)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !33, file: !32, line: 203, baseType: !222, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!27, !57, !10}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !33, file: !32, line: 206, baseType: !44, size: 128, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !33, file: !32, line: 207, baseType: !36, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !33, file: !32, line: 208, baseType: !27, size: 32, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !33, file: !32, line: 211, baseType: !229, size: 24, offset: 928)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, elements: !131)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !33, file: !32, line: 212, baseType: !231, size: 8, offset: 952)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !91)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !33, file: !32, line: 215, baseType: !44, size: 128, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !33, file: !32, line: 218, baseType: !27, size: 32, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !33, file: !32, line: 219, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !55, line: 44, baseType: !56)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !33, file: !32, line: 222, baseType: !57, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !33, file: !32, line: 226, baseType: !238, size: 32, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !55, line: 175, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !240, line: 12, baseType: !27)
!240 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !33, file: !32, line: 228, baseType: !136, size: 64, offset: 1312)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !33, file: !32, line: 229, baseType: !27, size: 32, offset: 1376)
!243 = !{!244, !245, !246, !252, !253, !254, !258, !260, !261, !262, !274, !275, !282, !288, !289, !292, !293, !296}
!244 = !DILocalVariable(name: "rdbfilename", arg: 1, scope: !24, file: !3, line: 179, type: !7)
!245 = !DILocalVariable(name: "fp", arg: 2, scope: !24, file: !3, line: 179, type: !28)
!246 = !DILocalVariable(name: "dbid", scope: !24, file: !3, line: 180, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !248, line: 60, baseType: !249)
!248 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !250, line: 105, baseType: !251)
!250 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!251 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!252 = !DILocalVariable(name: "type", scope: !24, file: !3, line: 181, type: !27)
!253 = !DILocalVariable(name: "rdbver", scope: !24, file: !3, line: 181, type: !27)
!254 = !DILocalVariable(name: "buf", scope: !24, file: !3, line: 182, type: !255)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 1024)
!258 = !DILocalVariable(name: "expiretime", scope: !24, file: !3, line: 183, type: !259)
!259 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!260 = !DILocalVariable(name: "now", scope: !24, file: !3, line: 183, type: !259)
!261 = !DILocalVariable(name: "closefile", scope: !24, file: !3, line: 186, type: !27)
!262 = !DILocalVariable(name: "key", scope: !263, file: !3, line: 207, type: !264)
!263 = distinct !DILexicalBlock(scope: !24, file: !3, line: 206, column: 14)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !266, line: 622, baseType: !267)
!266 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !266, line: 614, size: 128, elements: !268)
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !266, line: 615, baseType: !9, size: 4, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !267, file: !266, line: 616, baseType: !9, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !267, file: !266, line: 617, baseType: !9, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !267, file: !266, line: 620, baseType: !27, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !267, file: !266, line: 621, baseType: !10, size: 64, offset: 64)
!274 = !DILocalVariable(name: "val", scope: !263, file: !3, line: 207, type: !264)
!275 = !DILocalVariable(name: "byte", scope: !276, file: !3, line: 230, type: !280)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 228, column: 45)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 228, column: 20)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 222, column: 20)
!279 = distinct !DILexicalBlock(scope: !263, file: !3, line: 214, column: 13)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !248, line: 24, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !250, line: 43, baseType: !37)
!282 = !DILocalVariable(name: "db_size", scope: !283, file: !3, line: 250, type: !247)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 247, column: 49)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 247, column: 20)
!285 = distinct !DILexicalBlock(scope: !286, file: !3, line: 240, column: 20)
!286 = distinct !DILexicalBlock(scope: !287, file: !3, line: 237, column: 20)
!287 = distinct !DILexicalBlock(scope: !277, file: !3, line: 233, column: 20)
!288 = !DILocalVariable(name: "expires_size", scope: !283, file: !3, line: 250, type: !247)
!289 = !DILocalVariable(name: "auxkey", scope: !290, file: !3, line: 263, type: !264)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 257, column: 44)
!291 = distinct !DILexicalBlock(scope: !284, file: !3, line: 257, column: 20)
!292 = !DILocalVariable(name: "auxval", scope: !290, file: !3, line: 263, type: !264)
!293 = !DILocalVariable(name: "cksum", scope: !294, file: !3, line: 301, type: !247)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 300, column: 45)
!295 = distinct !DILexicalBlock(scope: !24, file: !3, line: 300, column: 9)
!296 = !DILocalVariable(name: "expected", scope: !294, file: !3, line: 301, type: !247)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !298, line: 87, baseType: !299)
!298 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !298, line: 39, size: 832, elements: !300)
!300 = !{!301, !307, !313, !320, !324, !328, !329, !330, !331}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !299, file: !298, line: 43, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !306, !10, !305}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 58, baseType: !251)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !299, file: !298, line: 44, baseType: !308, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!305, !306, !311, !305}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !299, file: !298, line: 45, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !306}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !318, line: 173, baseType: !319)
!318 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 100, baseType: !235)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !299, file: !298, line: 46, baseType: !321, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!27, !306}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !299, file: !298, line: 52, baseType: !325, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !306, !311, !305}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !299, file: !298, line: 55, baseType: !247, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !299, file: !298, line: 58, baseType: !305, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !299, file: !298, line: 61, baseType: !305, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !299, file: !298, line: 84, baseType: !332, size: 320, offset: 512)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !299, file: !298, line: 64, size: 320, elements: !333)
!333 = !{!334, !341, !347}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !332, file: !298, line: 69, baseType: !335, size: 128)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !298, line: 66, size: 128, elements: !336)
!336 = !{!337, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !335, file: !298, line: 67, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !339, line: 43, baseType: !7)
!339 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !335, file: !298, line: 68, baseType: !317, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !332, file: !298, line: 75, baseType: !342, size: 192)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !298, line: 71, size: 192, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !342, file: !298, line: 72, baseType: !28, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !342, file: !298, line: 73, baseType: !317, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "autosync", scope: !342, file: !298, line: 74, baseType: !317, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fdset", scope: !332, file: !298, line: 83, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !298, line: 77, size: 320, elements: !349)
!349 = !{!350, !352, !353, !354, !355}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !348, file: !298, line: 78, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !298, line: 79, baseType: !351, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "numfds", scope: !348, file: !298, line: 80, baseType: !27, size: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !348, file: !298, line: 81, baseType: !317, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !348, file: !298, line: 82, baseType: !338, size: 64, offset: 256)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "rdbstate", scope: !2, file: !3, line: 49, type: !358, isLocal: false, isDefinition: true)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 39, size: 8640, elements: !359)
!359 = !{!360, !362, !363, !364, !365, !366, !367, !368, !369}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !358, file: !3, line: 40, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !358, file: !3, line: 41, baseType: !264, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "key_type", scope: !358, file: !3, line: 42, baseType: !27, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !358, file: !3, line: 43, baseType: !251, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !358, file: !3, line: 44, baseType: !251, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "already_expired", scope: !358, file: !3, line: 45, baseType: !251, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "doing", scope: !358, file: !3, line: 46, baseType: !27, size: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "error_set", scope: !358, file: !3, line: 47, baseType: !27, size: 32, offset: 416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !358, file: !3, line: 48, baseType: !255, size: 8192, offset: 448)
!370 = !{i32 2, !"Dwarf Version", i32 4}
!371 = !{i32 2, !"Debug Info Version", i32 3}
!372 = !{i32 1, !"wchar_size", i32 4}
!373 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!374 = distinct !DISubprogram(name: "rdbShowGenericInfo", scope: !3, file: !3, line: 92, type: !183, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!375 = !DILocation(line: 93, column: 47, scope: !374)
!376 = !{!377, !382, i64 24}
!377 = !{!"", !378, i64 0, !378, i64 8, !381, i64 16, !382, i64 24, !382, i64 32, !382, i64 40, !381, i64 48, !381, i64 52, !379, i64 56}
!378 = !{!"any pointer", !379, i64 0}
!379 = !{!"omnipotent char", !380, i64 0}
!380 = !{!"Simple C/C++ TBAA"}
!381 = !{!"int", !379, i64 0}
!382 = !{!"long", !379, i64 0}
!383 = !DILocation(line: 93, column: 5, scope: !374)
!384 = !DILocation(line: 94, column: 45, scope: !374)
!385 = !{!377, !382, i64 32}
!386 = !DILocation(line: 94, column: 5, scope: !374)
!387 = !DILocation(line: 95, column: 53, scope: !374)
!388 = !{!377, !382, i64 40}
!389 = !DILocation(line: 95, column: 5, scope: !374)
!390 = !DILocation(line: 96, column: 1, scope: !374)
!391 = distinct !DISubprogram(name: "rdbCheckError", scope: !3, file: !3, line: 100, type: !392, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !214, null}
!394 = !{!395, !396, !397}
!395 = !DILocalVariable(name: "fmt", arg: 1, scope: !391, file: !3, line: 100, type: !214)
!396 = !DILocalVariable(name: "msg", scope: !391, file: !3, line: 101, type: !255)
!397 = !DILocalVariable(name: "ap", scope: !391, file: !3, line: 102, type: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !30, line: 46, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !400, line: 51, baseType: !401)
!400 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 102, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 192, elements: !91)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 102, size: 192, elements: !404)
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !403, file: !3, line: 102, baseType: !9, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !403, file: !3, line: 102, baseType: !9, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !403, file: !3, line: 102, baseType: !10, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !403, file: !3, line: 102, baseType: !10, size: 64, offset: 128)
!409 = !DILocation(line: 100, column: 32, scope: !391)
!410 = !DILocation(line: 101, column: 5, scope: !391)
!411 = !DILocation(line: 101, column: 10, scope: !391)
!412 = !DILocation(line: 102, column: 5, scope: !391)
!413 = !DILocation(line: 102, column: 13, scope: !391)
!414 = !DILocation(line: 104, column: 5, scope: !391)
!415 = !DILocation(line: 105, column: 5, scope: !391)
!416 = !DILocation(line: 106, column: 5, scope: !391)
!417 = !DILocation(line: 108, column: 5, scope: !391)
!418 = !DILocation(line: 110, column: 40, scope: !391)
!419 = !{!377, !378, i64 0}
!420 = !DILocation(line: 110, column: 31, scope: !391)
!421 = !DILocation(line: 111, column: 27, scope: !391)
!422 = !{!423, !382, i64 48}
!423 = !{!"_rio", !378, i64 0, !378, i64 8, !378, i64 16, !378, i64 24, !378, i64 32, !382, i64 40, !382, i64 48, !382, i64 56, !379, i64 64}
!424 = !DILocation(line: 109, column: 5, scope: !391)
!425 = !DILocation(line: 113, column: 41, scope: !391)
!426 = !{!377, !381, i64 48}
!427 = !DILocation(line: 113, column: 9, scope: !391)
!428 = !{!378, !378, i64 0}
!429 = !DILocation(line: 112, column: 5, scope: !391)
!430 = !DILocation(line: 114, column: 18, scope: !431)
!431 = distinct !DILexicalBlock(scope: !391, file: !3, line: 114, column: 9)
!432 = !{!377, !378, i64 8}
!433 = !DILocation(line: 114, column: 9, scope: !431)
!434 = !DILocation(line: 114, column: 9, scope: !391)
!435 = !DILocation(line: 116, column: 34, scope: !431)
!436 = !{!437, !378, i64 8}
!437 = !{!"redisObject", !381, i64 0, !381, i64 0, !381, i64 1, !381, i64 4, !378, i64 8}
!438 = !DILocation(line: 115, column: 9, scope: !431)
!439 = !DILocation(line: 117, column: 18, scope: !440)
!440 = distinct !DILexicalBlock(scope: !391, file: !3, line: 117, column: 9)
!441 = !{!377, !381, i64 16}
!442 = !DILocation(line: 117, column: 27, scope: !440)
!443 = !DILocation(line: 117, column: 9, scope: !391)
!444 = !DILocation(line: 120, column: 42, scope: !440)
!445 = !DILocation(line: 120, column: 13, scope: !440)
!446 = !DILocation(line: 122, column: 17, scope: !440)
!447 = !DILocation(line: 118, column: 9, scope: !440)
!448 = !DILocation(line: 93, column: 47, scope: !374, inlinedAt: !449)
!449 = distinct !DILocation(line: 123, column: 5, scope: !391)
!450 = !DILocation(line: 93, column: 5, scope: !374, inlinedAt: !449)
!451 = !DILocation(line: 94, column: 45, scope: !374, inlinedAt: !449)
!452 = !DILocation(line: 94, column: 5, scope: !374, inlinedAt: !449)
!453 = !DILocation(line: 95, column: 53, scope: !374, inlinedAt: !449)
!454 = !DILocation(line: 95, column: 5, scope: !374, inlinedAt: !449)
!455 = !DILocation(line: 96, column: 1, scope: !374, inlinedAt: !449)
!456 = !DILocation(line: 124, column: 1, scope: !391)
!457 = distinct !DISubprogram(name: "rdbCheckInfo", scope: !3, file: !3, line: 127, type: !392, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !458)
!458 = !{!459, !460, !461}
!459 = !DILocalVariable(name: "fmt", arg: 1, scope: !457, file: !3, line: 127, type: !214)
!460 = !DILocalVariable(name: "msg", scope: !457, file: !3, line: 128, type: !255)
!461 = !DILocalVariable(name: "ap", scope: !457, file: !3, line: 129, type: !398)
!462 = !DILocation(line: 127, column: 31, scope: !457)
!463 = !DILocation(line: 128, column: 5, scope: !457)
!464 = !DILocation(line: 128, column: 10, scope: !457)
!465 = !DILocation(line: 129, column: 5, scope: !457)
!466 = !DILocation(line: 129, column: 13, scope: !457)
!467 = !DILocation(line: 131, column: 5, scope: !457)
!468 = !DILocation(line: 132, column: 5, scope: !457)
!469 = !DILocation(line: 133, column: 5, scope: !457)
!470 = !DILocation(line: 136, column: 40, scope: !457)
!471 = !DILocation(line: 136, column: 31, scope: !457)
!472 = !DILocation(line: 137, column: 27, scope: !457)
!473 = !DILocation(line: 135, column: 5, scope: !457)
!474 = !DILocation(line: 138, column: 1, scope: !457)
!475 = distinct !DISubprogram(name: "rdbCheckSetError", scope: !3, file: !3, line: 142, type: !392, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !476)
!476 = !{!477, !478}
!477 = !DILocalVariable(name: "fmt", arg: 1, scope: !475, file: !3, line: 142, type: !214)
!478 = !DILocalVariable(name: "ap", scope: !475, file: !3, line: 143, type: !398)
!479 = !DILocation(line: 142, column: 35, scope: !475)
!480 = !DILocation(line: 143, column: 5, scope: !475)
!481 = !DILocation(line: 143, column: 13, scope: !475)
!482 = !DILocation(line: 145, column: 5, scope: !475)
!483 = !DILocation(line: 146, column: 5, scope: !475)
!484 = !DILocation(line: 147, column: 5, scope: !475)
!485 = !DILocation(line: 148, column: 24, scope: !475)
!486 = !{!377, !381, i64 52}
!487 = !DILocation(line: 149, column: 1, scope: !475)
!488 = distinct !DISubprogram(name: "rdbCheckHandleCrash", scope: !3, file: !3, line: 154, type: !489, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !500)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !27, !491, !10}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !493, line: 72, baseType: !494)
!493 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 68, size: 96, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !494, file: !493, line: 69, baseType: !27, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !494, file: !493, line: 70, baseType: !27, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !494, file: !493, line: 71, baseType: !499, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !493, line: 61, baseType: !27)
!500 = !{!501, !502, !503}
!501 = !DILocalVariable(name: "sig", arg: 1, scope: !488, file: !3, line: 154, type: !27)
!502 = !DILocalVariable(name: "info", arg: 2, scope: !488, file: !3, line: 154, type: !491)
!503 = !DILocalVariable(name: "secret", arg: 3, scope: !488, file: !3, line: 154, type: !10)
!504 = !DILocation(line: 154, column: 30, scope: !488)
!505 = !DILocation(line: 154, column: 46, scope: !488)
!506 = !DILocation(line: 154, column: 58, scope: !488)
!507 = !DILocation(line: 159, column: 5, scope: !488)
!508 = !DILocation(line: 160, column: 5, scope: !488)
!509 = distinct !DISubprogram(name: "rdbCheckSetupSignals", scope: !3, file: !3, line: 163, type: !183, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !510)
!510 = !{!511}
!511 = !DILocalVariable(name: "act", scope: !509, file: !3, line: 164, type: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !493, line: 74, size: 256, elements: !513)
!513 = !{!514, !520, !523, !524}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !512, file: !493, line: 78, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !512, file: !493, line: 75, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !515, file: !493, line: 76, baseType: !198, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !515, file: !493, line: 77, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !512, file: !493, line: 79, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !493, line: 64, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !493, line: 63, baseType: !251)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !512, file: !493, line: 80, baseType: !27, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !512, file: !493, line: 81, baseType: !182, size: 64, offset: 192)
!525 = !DILocation(line: 164, column: 5, scope: !509)
!526 = !DILocation(line: 166, column: 22, scope: !509)
!527 = !DILocation(line: 166, column: 5, scope: !509)
!528 = !DILocation(line: 167, column: 9, scope: !509)
!529 = !DILocation(line: 167, column: 18, scope: !509)
!530 = !{!531, !381, i64 16}
!531 = !{!"sigaction", !379, i64 0, !382, i64 8, !381, i64 16, !378, i64 24}
!532 = !DILocation(line: 168, column: 9, scope: !509)
!533 = !DILocation(line: 168, column: 22, scope: !509)
!534 = !{!379, !379, i64 0}
!535 = !DILocation(line: 164, column: 22, scope: !509)
!536 = !DILocation(line: 169, column: 5, scope: !509)
!537 = !DILocation(line: 170, column: 5, scope: !509)
!538 = !DILocation(line: 171, column: 5, scope: !509)
!539 = !DILocation(line: 172, column: 5, scope: !509)
!540 = !DILocation(line: 173, column: 1, scope: !509)
!541 = !DILocation(line: 179, column: 27, scope: !24)
!542 = !DILocation(line: 179, column: 46, scope: !24)
!543 = !DILocation(line: 182, column: 5, scope: !24)
!544 = !DILocation(line: 182, column: 10, scope: !24)
!545 = !DILocation(line: 183, column: 33, scope: !24)
!546 = !DILocation(line: 183, column: 27, scope: !24)
!547 = !DILocation(line: 186, column: 25, scope: !24)
!548 = !DILocation(line: 187, column: 20, scope: !549)
!549 = distinct !DILexicalBlock(scope: !24, file: !3, line: 187, column: 9)
!550 = !DILocation(line: 187, column: 29, scope: !549)
!551 = !DILocation(line: 187, column: 53, scope: !549)
!552 = !DILocation(line: 187, column: 9, scope: !24)
!553 = !DILocation(line: 189, column: 5, scope: !24)
!554 = !DILocation(line: 190, column: 18, scope: !24)
!555 = !DILocation(line: 191, column: 22, scope: !24)
!556 = !{!423, !378, i64 32}
!557 = !DILocalVariable(name: "r", arg: 1, scope: !558, file: !298, line: 106, type: !361)
!558 = distinct !DISubprogram(name: "rioRead", scope: !298, file: !298, line: 106, type: !559, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{!305, !361, !10, !305}
!561 = !{!557, !562, !563, !564}
!562 = !DILocalVariable(name: "buf", arg: 2, scope: !558, file: !298, line: 106, type: !10)
!563 = !DILocalVariable(name: "len", arg: 3, scope: !558, file: !298, line: 106, type: !305)
!564 = !DILocalVariable(name: "bytes_to_read", scope: !565, file: !298, line: 108, type: !305)
!565 = distinct !DILexicalBlock(scope: !558, file: !298, line: 107, column: 17)
!566 = !DILocation(line: 106, column: 35, scope: !558, inlinedAt: !567)
!567 = distinct !DILocation(line: 192, column: 9, scope: !568)
!568 = distinct !DILexicalBlock(scope: !24, file: !3, line: 192, column: 9)
!569 = !DILocation(line: 106, column: 44, scope: !558, inlinedAt: !567)
!570 = !DILocation(line: 106, column: 56, scope: !558, inlinedAt: !567)
!571 = !DILocation(line: 107, column: 5, scope: !558, inlinedAt: !567)
!572 = !DILocation(line: 108, column: 36, scope: !565, inlinedAt: !567)
!573 = !{!423, !382, i64 56}
!574 = !DILocation(line: 108, column: 33, scope: !565, inlinedAt: !567)
!575 = !DILocation(line: 108, column: 57, scope: !565, inlinedAt: !567)
!576 = !DILocation(line: 108, column: 84, scope: !565, inlinedAt: !567)
!577 = !DILocation(line: 108, column: 32, scope: !565, inlinedAt: !567)
!578 = !DILocation(line: 108, column: 16, scope: !565, inlinedAt: !567)
!579 = !DILocation(line: 109, column: 16, scope: !580, inlinedAt: !567)
!580 = distinct !DILexicalBlock(scope: !565, file: !298, line: 109, column: 13)
!581 = !{!423, !378, i64 0}
!582 = !DILocation(line: 109, column: 13, scope: !580, inlinedAt: !567)
!583 = !DILocation(line: 109, column: 42, scope: !580, inlinedAt: !567)
!584 = !DILocation(line: 109, column: 13, scope: !565, inlinedAt: !567)
!585 = !DILocation(line: 110, column: 13, scope: !580, inlinedAt: !567)
