; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/replication.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/replication.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 54, type: !458, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "replicationGetSlaveName", scope: !3, file: !3, line: 53, type: !4, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !455)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/replication.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !10, line: 780, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !10, line: 723, size: 135360, elements: !12)
!12 = !{!13, !19, !21, !127, !138, !141, !146, !147, !148, !149, !151, !175, !176, !177, !178, !179, !180, !182, !183, !186, !187, !188, !189, !190, !191, !192, !193, !198, !199, !200, !201, !202, !203, !204, !205, !209, !210, !214, !215, !231, !232, !249, !250, !251, !252, !253, !254, !255, !256}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !11, file: !10, line: 724, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 60, baseType: !16)
!15 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !17, line: 105, baseType: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !11, file: !10, line: 725, baseType: !20, size: 32, offset: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !11, file: !10, line: 726, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !10, line: 656, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !10, line: 647, size: 512, elements: !25)
!25 = !{!26, !91, !92, !93, !94, !95, !96, !98}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !24, file: !10, line: 648, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !29, line: 82, baseType: !30)
!29 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !29, line: 76, size: 768, elements: !31)
!31 = !{!32, !58, !59, !89, !90}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !29, line: 77, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !29, line: 65, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !29, line: 58, size: 384, elements: !36)
!36 = !{!37, !43, !48, !49, !53, !57}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !35, file: !29, line: 59, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!14, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !35, file: !29, line: 60, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !47, !41}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !35, file: !29, line: 61, baseType: !44, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !35, file: !29, line: 62, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!20, !47, !41, !41}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !35, file: !29, line: 63, baseType: !54, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !47, !47}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !35, file: !29, line: 64, baseType: !54, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !30, file: !29, line: 78, baseType: !47, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !30, file: !29, line: 79, baseType: !60, size: 512, offset: 128)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !87)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !29, line: 74, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !29, line: 69, size: 256, elements: !63)
!63 = !{!64, !84, !85, !86}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !62, file: !29, line: 70, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !29, line: 56, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !29, line: 47, size: 192, elements: !69)
!69 = !{!70, !71, !82}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !68, file: !29, line: 48, baseType: !47, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !68, file: !29, line: 54, baseType: !72, size: 64, offset: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !68, file: !29, line: 49, size: 64, elements: !73)
!73 = !{!74, !75, !76, !80}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !72, file: !29, line: 50, baseType: !47, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !72, file: !29, line: 51, baseType: !14, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !72, file: !29, line: 52, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !15, line: 56, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !17, line: 103, baseType: !79)
!79 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !72, file: !29, line: 53, baseType: !81, size: 64)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !29, line: 55, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !29, line: 71, baseType: !18, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !62, file: !29, line: 72, baseType: !18, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !62, file: !29, line: 73, baseType: !18, size: 64, offset: 192)
!87 = !{!88}
!88 = !DISubrange(count: 2)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !30, file: !29, line: 80, baseType: !79, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !30, file: !29, line: 81, baseType: !18, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !24, file: !10, line: 649, baseType: !27, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !24, file: !10, line: 650, baseType: !27, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !24, file: !10, line: 651, baseType: !27, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !24, file: !10, line: 652, baseType: !27, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !24, file: !10, line: 653, baseType: !20, size: 32, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !24, file: !10, line: 654, baseType: !97, size: 64, offset: 384)
!97 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !24, file: !10, line: 655, baseType: !99, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !101, line: 54, baseType: !102)
!101 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !101, line: 47, size: 384, elements: !103)
!103 = !{!104, !113, !114, !118, !122, !126}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !102, file: !101, line: 48, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !101, line: 40, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !101, line: 36, size: 192, elements: !108)
!108 = !{!109, !111, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !107, file: !101, line: 37, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !107, file: !101, line: 38, baseType: !110, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !107, file: !101, line: 39, baseType: !47, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !102, file: !101, line: 49, baseType: !105, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !102, file: !101, line: 50, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!47, !47}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !102, file: !101, line: 51, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !47}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !102, file: !101, line: 52, baseType: !123, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!20, !47, !47}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !102, file: !101, line: 53, baseType: !18, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !10, line: 727, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !10, line: 622, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !10, line: 614, size: 128, elements: !131)
!131 = !{!132, !134, !135, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !10, line: 615, baseType: !133, size: 4, flags: DIFlagBitField, extraData: i64 0)
!133 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !130, file: !10, line: 616, baseType: !133, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !130, file: !10, line: 617, baseType: !133, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !130, file: !10, line: 620, baseType: !20, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !130, file: !10, line: 621, baseType: !47, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !11, file: !10, line: 728, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !140, line: 43, baseType: !6)
!140 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !11, file: !10, line: 729, baseType: !142, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !143, line: 40, baseType: !144)
!143 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !145, line: 129, baseType: !18)
!145 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !11, file: !10, line: 730, baseType: !139, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !11, file: !10, line: 734, baseType: !142, size: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !11, file: !10, line: 735, baseType: !20, size: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !11, file: !10, line: 736, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !11, file: !10, line: 737, baseType: !152, size: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !10, line: 1307, size: 640, elements: !154)
!154 = !{!155, !156, !161, !162, !163, !164, !170, !171, !172, !173, !174}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !10, line: 1308, baseType: !6, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !153, file: !10, line: 1309, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !10, line: 1305, baseType: !159)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !8}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !153, file: !10, line: 1310, baseType: !20, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !153, file: !10, line: 1311, baseType: !6, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !10, line: 1312, baseType: !20, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !153, file: !10, line: 1315, baseType: !165, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !10, line: 1306, baseType: !167)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !152, !150, !20, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !153, file: !10, line: 1317, baseType: !20, size: 32, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !153, file: !10, line: 1318, baseType: !20, size: 32, offset: 416)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !153, file: !10, line: 1319, baseType: !20, size: 32, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !153, file: !10, line: 1320, baseType: !97, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !153, file: !10, line: 1320, baseType: !97, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !11, file: !10, line: 737, baseType: !152, size: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !11, file: !10, line: 738, baseType: !20, size: 32, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !11, file: !10, line: 739, baseType: !20, size: 32, offset: 800)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !11, file: !10, line: 740, baseType: !79, size: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !11, file: !10, line: 741, baseType: !99, size: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !11, file: !10, line: 742, baseType: !181, size: 64, offset: 960)
!181 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !11, file: !10, line: 743, baseType: !142, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !11, file: !10, line: 745, baseType: !184, size: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !185, line: 34, baseType: !79)
!185 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !11, file: !10, line: 746, baseType: !184, size: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !11, file: !10, line: 747, baseType: !184, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !11, file: !10, line: 748, baseType: !20, size: 32, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !11, file: !10, line: 749, baseType: !20, size: 32, offset: 1312)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !11, file: !10, line: 750, baseType: !20, size: 32, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !11, file: !10, line: 751, baseType: !20, size: 32, offset: 1376)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !11, file: !10, line: 752, baseType: !20, size: 32, offset: 1408)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !11, file: !10, line: 753, baseType: !194, size: 64, offset: 1472)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !195, line: 173, baseType: !196)
!195 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !145, line: 100, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !145, line: 44, baseType: !79)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !11, file: !10, line: 754, baseType: !194, size: 64, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !11, file: !10, line: 755, baseType: !139, size: 64, offset: 1600)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !11, file: !10, line: 756, baseType: !97, size: 64, offset: 1664)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !11, file: !10, line: 757, baseType: !97, size: 64, offset: 1728)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !11, file: !10, line: 758, baseType: !97, size: 64, offset: 1792)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !11, file: !10, line: 759, baseType: !97, size: 64, offset: 1856)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !11, file: !10, line: 760, baseType: !97, size: 64, offset: 1920)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !11, file: !10, line: 763, baseType: !206, size: 328, offset: 1984)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 328, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 41)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !11, file: !10, line: 764, baseType: !20, size: 32, offset: 2336)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !11, file: !10, line: 765, baseType: !211, size: 368, offset: 2368)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 368, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 46)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !11, file: !10, line: 766, baseType: !20, size: 32, offset: 2752)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !11, file: !10, line: 767, baseType: !216, size: 256, offset: 2816)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !10, line: 673, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !10, line: 665, size: 256, elements: !218)
!218 = !{!219, !227, !228, !229, !230}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !217, file: !10, line: 666, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !10, line: 663, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !10, line: 659, size: 192, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !222, file: !10, line: 660, baseType: !150, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !222, file: !10, line: 661, baseType: !20, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !222, file: !10, line: 662, baseType: !152, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !217, file: !10, line: 667, baseType: !20, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !217, file: !10, line: 668, baseType: !20, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !217, file: !10, line: 671, baseType: !20, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !217, file: !10, line: 672, baseType: !184, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !11, file: !10, line: 768, baseType: !20, size: 32, offset: 3072)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !11, file: !10, line: 769, baseType: !233, size: 704, offset: 3136)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !10, line: 703, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !10, line: 677, size: 704, elements: !235)
!235 = !{!236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !234, file: !10, line: 679, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !10, line: 52, baseType: !97)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !234, file: !10, line: 683, baseType: !27, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !234, file: !10, line: 685, baseType: !128, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !234, file: !10, line: 689, baseType: !142, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !234, file: !10, line: 690, baseType: !128, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !234, file: !10, line: 691, baseType: !128, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !234, file: !10, line: 692, baseType: !237, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !234, file: !10, line: 692, baseType: !237, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !234, file: !10, line: 693, baseType: !20, size: 32, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !234, file: !10, line: 696, baseType: !20, size: 32, offset: 544)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !234, file: !10, line: 697, baseType: !97, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !234, file: !10, line: 700, baseType: !47, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !11, file: !10, line: 770, baseType: !97, size: 64, offset: 3840)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !11, file: !10, line: 771, baseType: !99, size: 64, offset: 3904)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !11, file: !10, line: 772, baseType: !27, size: 64, offset: 3968)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !11, file: !10, line: 773, baseType: !99, size: 64, offset: 4032)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !11, file: !10, line: 774, baseType: !139, size: 64, offset: 4096)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !11, file: !10, line: 775, baseType: !105, size: 64, offset: 4160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !11, file: !10, line: 778, baseType: !20, size: 32, offset: 4224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !11, file: !10, line: 779, baseType: !257, size: 131072, offset: 4256)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 131072, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 16384)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !261, retainedTypes: !262, globals: !302)
!261 = !{}
!262 = !{!181, !47, !79, !6, !97, !20, !263, !276, !286, !295}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !140, line: 51, size: 24, elements: !265)
!265 = !{!266, !270, !271, !272}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !264, file: !140, line: 52, baseType: !267, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 24, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 43, baseType: !269)
!269 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !264, file: !140, line: 53, baseType: !267, size: 8, offset: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !264, file: !140, line: 54, baseType: !269, size: 8, offset: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !264, file: !140, line: 55, baseType: !273, offset: 24)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: -1)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !140, line: 57, size: 40, elements: !278)
!278 = !{!279, !283, !284, !285}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !140, line: 58, baseType: !280, size: 16)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 36, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !17, line: 57, baseType: !282)
!282 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !277, file: !140, line: 59, baseType: !280, size: 16, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !277, file: !140, line: 60, baseType: !269, size: 8, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !277, file: !140, line: 61, baseType: !273, offset: 40)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !140, line: 63, size: 72, elements: !288)
!288 = !{!289, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !287, file: !140, line: 64, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 48, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 79, baseType: !133)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !287, file: !140, line: 65, baseType: !290, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !140, line: 66, baseType: !269, size: 8, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !140, line: 67, baseType: !273, offset: 72)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !140, line: 69, size: 136, elements: !297)
!297 = !{!298, !299, !300, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !296, file: !140, line: 70, baseType: !14, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !296, file: !140, line: 71, baseType: !14, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !140, line: 72, baseType: !269, size: 8, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !296, file: !140, line: 73, baseType: !273, offset: 136)
!302 = !{!0, !303, !308, !411, !413, !415}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "newline_sent", scope: !305, file: !3, line: 1084, type: !184, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "replicationSendNewlineToMaster", scope: !3, file: !3, line: 1083, type: !306, isLocal: false, isDefinition: true, scopeLine: 1083, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !261)
!306 = !DISubroutineType(types: !307)
!307 = !{null}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "eofmark", scope: !310, file: !3, line: 1151, type: !408, isLocal: true, isDefinition: true)
!310 = distinct !DISubprogram(name: "readSyncBulkPayload", scope: !3, file: !3, line: 1141, type: !311, isLocal: false, isDefinition: true, scopeLine: 1141, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !373)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313, !20, !47, !20}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !315, line: 109, baseType: !316)
!315 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !315, line: 97, size: 640, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !336, !343, !365, !366, !367, !372}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !316, file: !315, line: 98, baseType: !20, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !316, file: !315, line: 99, baseType: !20, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !316, file: !315, line: 100, baseType: !97, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !316, file: !315, line: 101, baseType: !184, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !316, file: !315, line: 102, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !315, line: 76, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !315, line: 71, size: 256, elements: !326)
!326 = !{!327, !328, !334, !335}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !325, file: !315, line: 72, baseType: !20, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !325, file: !315, line: 73, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !315, line: 65, baseType: !331)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !20, !47, !20}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !325, file: !315, line: 74, baseType: !329, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !325, file: !315, line: 75, baseType: !47, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !316, file: !315, line: 103, baseType: !337, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !315, line: 94, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !315, line: 91, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !339, file: !315, line: 92, baseType: !20, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !339, file: !315, line: 93, baseType: !20, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !316, file: !315, line: 104, baseType: !344, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !315, line: 88, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !315, line: 79, size: 512, elements: !347)
!347 = !{!348, !349, !350, !351, !356, !361, !362, !364}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !346, file: !315, line: 80, baseType: !97, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !346, file: !315, line: 81, baseType: !79, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !346, file: !315, line: 82, baseType: !79, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !346, file: !315, line: 83, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !315, line: 66, baseType: !354)
!354 = !DISubroutineType(types: !355)
!355 = !{!20, !333, !97, !47}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !346, file: !315, line: 84, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !315, line: 67, baseType: !359)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !333, !47}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !346, file: !315, line: 85, baseType: !47, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !346, file: !315, line: 86, baseType: !363, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !315, line: 87, baseType: !363, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !316, file: !315, line: 105, baseType: !20, size: 32, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !316, file: !315, line: 106, baseType: !47, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !316, file: !315, line: 107, baseType: !368, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !315, line: 68, baseType: !370)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !333}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !316, file: !315, line: 108, baseType: !368, size: 64, offset: 576)
!373 = !{!374, !375, !376, !377, !378, !382, !385, !386, !387, !388, !389, !394, !397, !400}
!374 = !DILocalVariable(name: "el", arg: 1, scope: !310, file: !3, line: 1141, type: !313)
!375 = !DILocalVariable(name: "fd", arg: 2, scope: !310, file: !3, line: 1141, type: !20)
!376 = !DILocalVariable(name: "privdata", arg: 3, scope: !310, file: !3, line: 1141, type: !47)
!377 = !DILocalVariable(name: "mask", arg: 4, scope: !310, file: !3, line: 1141, type: !20)
!378 = !DILocalVariable(name: "buf", scope: !310, file: !3, line: 1142, type: !379)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 4096)
!382 = !DILocalVariable(name: "nread", scope: !310, file: !3, line: 1143, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !195, line: 200, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !145, line: 145, baseType: !79)
!385 = !DILocalVariable(name: "readlen", scope: !310, file: !3, line: 1143, type: !383)
!386 = !DILocalVariable(name: "nwritten", scope: !310, file: !3, line: 1143, type: !383)
!387 = !DILocalVariable(name: "left", scope: !310, file: !3, line: 1144, type: !194)
!388 = !DILocalVariable(name: "eof_reached", scope: !310, file: !3, line: 1229, type: !20)
!389 = !DILocalVariable(name: "rem", scope: !390, file: !3, line: 1236, type: !20)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 1235, column: 16)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 1233, column: 13)
!392 = distinct !DILexicalBlock(scope: !393, file: !3, line: 1231, column: 18)
!393 = distinct !DILexicalBlock(scope: !310, file: !3, line: 1231, column: 9)
!394 = !DILocalVariable(name: "sync_size", scope: !395, file: !3, line: 1267, type: !194)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 1266, column: 5)
!396 = distinct !DILexicalBlock(scope: !310, file: !3, line: 1264, column: 9)
!397 = !DILocalVariable(name: "aof_is_enabled", scope: !398, file: !3, line: 1281, type: !20)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 1280, column: 22)
!399 = distinct !DILexicalBlock(scope: !310, file: !3, line: 1280, column: 9)
!400 = !DILocalVariable(name: "rsi", scope: !398, file: !3, line: 1315, type: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "rdbSaveInfo", file: !10, line: 912, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdbSaveInfo", file: !10, line: 904, size: 512, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "repl_stream_db", scope: !402, file: !10, line: 906, baseType: !20, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "repl_id_is_set", scope: !402, file: !10, line: 909, baseType: !20, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "repl_id", scope: !402, file: !10, line: 910, baseType: !206, size: 328, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "repl_offset", scope: !402, file: !10, line: 911, baseType: !97, size: 64, offset: 448)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 320, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 40)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "lastbytes", scope: !310, file: !3, line: 1152, type: !408, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "usemark", scope: !310, file: !3, line: 1153, type: !20, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "replication_cron_loops", scope: !417, file: !3, line: 2565, type: !97, isLocal: true, isDefinition: true)
!417 = distinct !DISubprogram(name: "replicationCron", scope: !3, file: !3, line: 2564, type: !306, isLocal: false, isDefinition: true, scopeLine: 2564, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !418)
!418 = !{!419, !425, !426, !430, !433, !435, !436, !439, !440, !442, !445, !448, !449, !450, !451, !452, !453}
!419 = !DILocalVariable(name: "li", scope: !417, file: !3, line: 2613, type: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !101, line: 45, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !101, line: 42, size: 128, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !101, line: 43, baseType: !105, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !421, file: !101, line: 44, baseType: !20, size: 32, offset: 64)
!425 = !DILocalVariable(name: "ln", scope: !417, file: !3, line: 2614, type: !105)
!426 = !DILocalVariable(name: "ping_argv", scope: !417, file: !3, line: 2615, type: !427)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 1)
!430 = !DILocalVariable(name: "manual_failover_in_progress", scope: !431, file: !3, line: 2625, type: !20)
!431 = distinct !DILexicalBlock(scope: !432, file: !3, line: 2620, column: 5)
!432 = distinct !DILexicalBlock(scope: !417, file: !3, line: 2618, column: 9)
!433 = !DILocalVariable(name: "slave", scope: !434, file: !3, line: 2654, type: !8)
!434 = distinct !DILexicalBlock(scope: !417, file: !3, line: 2653, column: 33)
!435 = !DILocalVariable(name: "is_presync", scope: !434, file: !3, line: 2656, type: !20)
!436 = !DILocalVariable(name: "li", scope: !437, file: !3, line: 2670, type: !420)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 2669, column: 36)
!438 = distinct !DILexicalBlock(scope: !417, file: !3, line: 2669, column: 9)
!439 = !DILocalVariable(name: "ln", scope: !437, file: !3, line: 2671, type: !105)
!440 = !DILocalVariable(name: "slave", scope: !441, file: !3, line: 2675, type: !8)
!441 = distinct !DILexicalBlock(scope: !437, file: !3, line: 2674, column: 37)
!442 = !DILocalVariable(name: "idle", scope: !443, file: !3, line: 2697, type: !184)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 2696, column: 5)
!444 = distinct !DILexicalBlock(scope: !417, file: !3, line: 2694, column: 9)
!445 = !DILocalVariable(name: "idle", scope: !446, file: !3, line: 2742, type: !184)
!446 = distinct !DILexicalBlock(scope: !447, file: !3, line: 2741, column: 67)
!447 = distinct !DILexicalBlock(scope: !417, file: !3, line: 2741, column: 9)
!448 = !DILocalVariable(name: "max_idle", scope: !446, file: !3, line: 2742, type: !184)
!449 = !DILocalVariable(name: "slaves_waiting", scope: !446, file: !3, line: 2743, type: !20)
!450 = !DILocalVariable(name: "mincapa", scope: !446, file: !3, line: 2744, type: !20)
!451 = !DILocalVariable(name: "ln", scope: !446, file: !3, line: 2745, type: !105)
!452 = !DILocalVariable(name: "li", scope: !446, file: !3, line: 2746, type: !420)
!453 = !DILocalVariable(name: "slave", scope: !454, file: !3, line: 2750, type: !8)
!454 = distinct !DILexicalBlock(scope: !446, file: !3, line: 2749, column: 37)
!455 = !{!456, !457}
!456 = !DILocalVariable(name: "c", arg: 1, scope: !2, file: !3, line: 53, type: !8)
!457 = !DILocalVariable(name: "ip", scope: !2, file: !3, line: 55, type: !211)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 624, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 78)
!461 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!462 = !{i32 2, !"Dwarf Version", i32 4}
!463 = !{i32 2, !"Debug Info Version", i32 3}
!464 = !{i32 1, !"wchar_size", i32 4}
!465 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!466 = !DILocation(line: 53, column: 39, scope: !2)
!467 = !DILocation(line: 55, column: 5, scope: !2)
!468 = !DILocation(line: 55, column: 10, scope: !2)
!469 = !DILocation(line: 57, column: 11, scope: !2)
!470 = !{!471, !471, i64 0}
!471 = !{!"omnipotent char", !472, i64 0}
!472 = !{!"Simple C/C++ TBAA"}
!473 = !DILocation(line: 58, column: 12, scope: !2)
!474 = !DILocation(line: 59, column: 9, scope: !475)
!475 = distinct !DILexicalBlock(scope: !2, file: !3, line: 59, column: 9)
!476 = !DILocation(line: 59, column: 24, scope: !475)
!477 = !DILocation(line: 59, column: 32, scope: !475)
!478 = !DILocation(line: 63, column: 13, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !3, line: 61, column: 5)
!480 = !DILocation(line: 60, column: 29, scope: !475)
!481 = !{!482, !484, i64 8}
!482 = !{!"client", !483, i64 0, !484, i64 8, !485, i64 16, !485, i64 24, !485, i64 32, !483, i64 40, !485, i64 48, !483, i64 56, !484, i64 64, !485, i64 72, !485, i64 80, !485, i64 88, !484, i64 96, !484, i64 100, !483, i64 104, !485, i64 112, !486, i64 120, !483, i64 128, !483, i64 136, !483, i64 144, !483, i64 152, !484, i64 160, !484, i64 164, !484, i64 168, !484, i64 172, !484, i64 176, !483, i64 184, !483, i64 192, !485, i64 200, !486, i64 208, !486, i64 216, !486, i64 224, !486, i64 232, !486, i64 240, !471, i64 248, !484, i64 292, !471, i64 296, !484, i64 344, !487, i64 352, !484, i64 384, !488, i64 392, !486, i64 480, !485, i64 488, !485, i64 496, !485, i64 504, !485, i64 512, !485, i64 520, !484, i64 528, !471, i64 532}
!483 = !{!"long", !471, i64 0}
!484 = !{!"int", !471, i64 0}
!485 = !{!"any pointer", !471, i64 0}
!486 = !{!"long long", !471, i64 0}
!487 = !{!"multiState", !485, i64 0, !484, i64 8, !484, i64 12, !484, i64 16, !483, i64 24}
!488 = !{!"blockingState", !486, i64 0, !485, i64 8, !485, i64 16, !483, i64 24, !485, i64 32, !485, i64 40, !486, i64 48, !486, i64 56, !484, i64 64, !484, i64 68, !486, i64 72, !485, i64 80}
!489 = !DILocation(line: 60, column: 9, scope: !475)
!490 = !DILocation(line: 60, column: 52, scope: !475)
!491 = !DILocation(line: 59, column: 9, scope: !2)
!492 = !DILocation(line: 63, column: 13, scope: !493)
!493 = distinct !DILexicalBlock(scope: !479, file: !3, line: 63, column: 13)
!494 = !DILocation(line: 63, column: 28, scope: !493)
!495 = !DILocation(line: 63, column: 37, scope: !493)
!496 = !DILocation(line: 65, column: 16, scope: !497)
!497 = distinct !DILexicalBlock(scope: !479, file: !3, line: 65, column: 13)
!498 = !{!482, !484, i64 292}
!499 = !DILocation(line: 65, column: 13, scope: !497)
!500 = !DILocation(line: 65, column: 13, scope: !479)
!501 = !DILocation(line: 66, column: 13, scope: !497)
!502 = !DILocation(line: 68, column: 13, scope: !497)
!503 = !DILocation(line: 71, column: 37, scope: !504)
!504 = distinct !DILexicalBlock(scope: !475, file: !3, line: 69, column: 12)
!505 = !{!482, !483, i64 0}
!506 = !DILocation(line: 70, column: 9, scope: !504)
!507 = !DILocation(line: 74, column: 1, scope: !2)
!508 = !DILocation(line: 73, column: 5, scope: !2)
!509 = distinct !DISubprogram(name: "createReplicationBacklog", scope: !3, file: !3, line: 78, type: !306, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !261)
!510 = !DILocation(line: 79, column: 5, scope: !509)
!511 = !{!512, !485, i64 2376}
!512 = !{!"redisServer", !484, i64 0, !485, i64 8, !485, i64 16, !485, i64 24, !484, i64 32, !484, i64 36, !484, i64 40, !485, i64 48, !485, i64 56, !485, i64 64, !485, i64 72, !484, i64 80, !484, i64 84, !484, i64 88, !484, i64 92, !485, i64 96, !485, i64 104, !484, i64 112, !484, i64 116, !471, i64 120, !484, i64 164, !483, i64 168, !484, i64 176, !485, i64 184, !485, i64 192, !485, i64 200, !471, i64 208, !484, i64 216, !484, i64 220, !471, i64 224, !484, i64 352, !485, i64 360, !484, i64 368, !471, i64 372, !484, i64 436, !484, i64 440, !471, i64 444, !484, i64 508, !485, i64 512, !485, i64 520, !485, i64 528, !485, i64 536, !485, i64 544, !485, i64 552, !485, i64 560, !484, i64 568, !486, i64 576, !471, i64 584, !485, i64 840, !483, i64 848, !484, i64 856, !484, i64 860, !483, i64 864, !483, i64 872, !483, i64 880, !483, i64 888, !485, i64 896, !485, i64 904, !485, i64 912, !485, i64 920, !485, i64 928, !485, i64 936, !485, i64 944, !485, i64 952, !485, i64 960, !485, i64 968, !485, i64 976, !485, i64 984, !485, i64 992, !483, i64 1000, !486, i64 1008, !486, i64 1016, !486, i64 1024, !513, i64 1032, !486, i64 1040, !486, i64 1048, !486, i64 1056, !486, i64 1064, !486, i64 1072, !486, i64 1080, !486, i64 1088, !486, i64 1096, !486, i64 1104, !483, i64 1112, !486, i64 1120, !513, i64 1128, !486, i64 1136, !486, i64 1144, !486, i64 1152, !486, i64 1160, !485, i64 1168, !486, i64 1176, !486, i64 1184, !483, i64 1192, !514, i64 1200, !486, i64 1240, !486, i64 1248, !483, i64 1256, !483, i64 1264, !471, i64 1272, !484, i64 1728, !484, i64 1732, !484, i64 1736, !484, i64 1740, !484, i64 1744, !483, i64 1752, !484, i64 1760, !484, i64 1764, !484, i64 1768, !484, i64 1772, !483, i64 1776, !483, i64 1784, !484, i64 1792, !484, i64 1796, !484, i64 1800, !484, i64 1804, !471, i64 1808, !484, i64 1880, !484, i64 1884, !485, i64 1888, !484, i64 1896, !484, i64 1900, !483, i64 1904, !483, i64 1912, !483, i64 1920, !483, i64 1928, !484, i64 1936, !484, i64 1940, !485, i64 1944, !485, i64 1952, !484, i64 1960, !484, i64 1964, !483, i64 1968, !483, i64 1976, !483, i64 1984, !483, i64 1992, !484, i64 2000, !483, i64 2008, !484, i64 2016, !484, i64 2020, !484, i64 2024, !484, i64 2028, !484, i64 2032, !484, i64 2036, !484, i64 2040, !484, i64 2044, !484, i64 2048, !484, i64 2052, !484, i64 2056, !484, i64 2060, !484, i64 2064, !485, i64 2072, !486, i64 2080, !486, i64 2088, !484, i64 2096, !485, i64 2104, !484, i64 2112, !485, i64 2120, !484, i64 2128, !484, i64 2132, !483, i64 2136, !483, i64 2144, !483, i64 2152, !483, i64 2160, !484, i64 2168, !484, i64 2172, !484, i64 2176, !484, i64 2180, !484, i64 2184, !484, i64 2188, !471, i64 2192, !515, i64 2200, !516, i64 2224, !485, i64 2240, !484, i64 2248, !485, i64 2256, !484, i64 2264, !471, i64 2268, !471, i64 2309, !486, i64 2352, !486, i64 2360, !484, i64 2368, !484, i64 2372, !485, i64 2376, !486, i64 2384, !486, i64 2392, !486, i64 2400, !486, i64 2408, !483, i64 2416, !483, i64 2424, !484, i64 2432, !484, i64 2436, !484, i64 2440, !484, i64 2444, !484, i64 2448, !485, i64 2456, !485, i64 2464, !484, i64 2472, !484, i64 2476, !485, i64 2480, !485, i64 2488, !484, i64 2496, !484, i64 2500, !483, i64 2504, !483, i64 2512, !483, i64 2520, !484, i64 2528, !484, i64 2532, !485, i64 2536, !483, i64 2544, !484, i64 2552, !484, i64 2556, !484, i64 2560, !483, i64 2568, !484, i64 2576, !484, i64 2580, !484, i64 2584, !485, i64 2592, !471, i64 2600, !486, i64 2648, !484, i64 2656, !485, i64 2664, !485, i64 2672, !484, i64 2680, !485, i64 2688, !484, i64 2696, !484, i64 2700, !486, i64 2704, !484, i64 2712, !484, i64 2716, !484, i64 2720, !484, i64 2724, !486, i64 2728, !484, i64 2736, !471, i64 2740, !485, i64 2768, !485, i64 2776, !484, i64 2784, !484, i64 2788, !484, i64 2792, !484, i64 2796, !483, i64 2800, !483, i64 2808, !483, i64 2816, !483, i64 2824, !483, i64 2832, !483, i64 2840, !483, i64 2848, !483, i64 2856, !484, i64 2864, !484, i64 2868, !483, i64 2872, !483, i64 2880, !484, i64 2888, !486, i64 2896, !485, i64 2904, !485, i64 2912, !484, i64 2920, !484, i64 2924, !486, i64 2928, !485, i64 2936, !485, i64 2944, !484, i64 2952, !484, i64 2956, !484, i64 2960, !484, i64 2964, !485, i64 2968, !484, i64 2976, !484, i64 2980, !484, i64 2984, !485, i64 2992, !485, i64 3000, !485, i64 3008, !485, i64 3016, !486, i64 3024, !486, i64 3032, !486, i64 3040, !484, i64 3048, !484, i64 3052, !484, i64 3056, !484, i64 3060, !484, i64 3064, !484, i64 3068, !484, i64 3072, !484, i64 3076, !484, i64 3080, !484, i64 3084, !484, i64 3088, !486, i64 3096, !485, i64 3104, !485, i64 3112, !485, i64 3120, !484, i64 3128, !484, i64 3132, !484, i64 3136, !483, i64 3144, !485, i64 3152, !485, i64 3160, !485, i64 3168}
!513 = !{!"double", !471, i64 0}
!514 = !{!"malloc_stats", !483, i64 0, !483, i64 8, !483, i64 16, !483, i64 24, !483, i64 32}
!515 = !{!"", !484, i64 0, !483, i64 8, !486, i64 16}
!516 = !{!"redisOpArray", !485, i64 0, !484, i64 8}
!517 = !DILocation(line: 80, column: 42, scope: !509)
!518 = !{!512, !486, i64 2384}
!519 = !DILocation(line: 80, column: 27, scope: !509)
!520 = !DILocation(line: 80, column: 25, scope: !509)
!521 = !DILocation(line: 81, column: 33, scope: !509)
!522 = !{!486, !486, i64 0}
!523 = !DILocation(line: 87, column: 38, scope: !509)
!524 = !{!512, !486, i64 2352}
!525 = !DILocation(line: 87, column: 56, scope: !509)
!526 = !DILocation(line: 87, column: 29, scope: !509)
!527 = !{!512, !486, i64 2408}
!528 = !DILocation(line: 88, column: 1, scope: !509)
!529 = distinct !DISubprogram(name: "resizeReplicationBacklog", scope: !3, file: !3, line: 96, type: !530, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !97}
!532 = !{!533}
!533 = !DILocalVariable(name: "newsize", arg: 1, scope: !529, file: !3, line: 96, type: !97)
!534 = !DILocation(line: 96, column: 41, scope: !529)
!535 = !DILocation(line: 97, column: 9, scope: !529)
!536 = !DILocation(line: 99, column: 16, scope: !537)
!537 = distinct !DILexicalBlock(scope: !529, file: !3, line: 99, column: 9)
!538 = !DILocation(line: 99, column: 34, scope: !537)
!539 = !DILocation(line: 99, column: 9, scope: !529)
!540 = !DILocation(line: 101, column: 30, scope: !529)
!541 = !DILocation(line: 102, column: 16, scope: !542)
!542 = distinct !DILexicalBlock(scope: !529, file: !3, line: 102, column: 9)
!543 = !DILocation(line: 102, column: 29, scope: !542)
!544 = !DILocation(line: 102, column: 9, scope: !529)
!545 = !DILocation(line: 108, column: 9, scope: !546)
!546 = distinct !DILexicalBlock(scope: !542, file: !3, line: 102, column: 38)
!547 = !DILocation(line: 109, column: 46, scope: !546)
!548 = !DILocation(line: 109, column: 31, scope: !546)
!549 = !DILocation(line: 109, column: 29, scope: !546)
!550 = !DILocation(line: 110, column: 37, scope: !546)
!551 = !DILocation(line: 113, column: 42, scope: !546)
!552 = !DILocation(line: 113, column: 60, scope: !546)
!553 = !DILocation(line: 113, column: 33, scope: !546)
!554 = !DILocation(line: 114, column: 5, scope: !546)
!555 = !DILocation(line: 115, column: 1, scope: !529)
!556 = distinct !DISubprogram(name: "freeReplicationBacklog", scope: !3, file: !3, line: 117, type: !306, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !261)
!557 = !DILocation(line: 118, column: 5, scope: !556)
!558 = !{!512, !485, i64 536}
!559 = !{!560, !483, i64 40}
!560 = !{!"list", !485, i64 0, !485, i64 8, !485, i64 16, !485, i64 24, !485, i64 32, !483, i64 40}
!561 = !DILocation(line: 119, column: 18, scope: !556)
!562 = !DILocation(line: 119, column: 5, scope: !556)
!563 = !DILocation(line: 120, column: 25, scope: !556)
!564 = !DILocation(line: 121, column: 1, scope: !556)
!565 = distinct !DISubprogram(name: "feedReplicationBacklog", scope: !3, file: !3, line: 127, type: !566, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !47, !142}
!568 = !{!569, !570, !571, !573}
!569 = !DILocalVariable(name: "ptr", arg: 1, scope: !565, file: !3, line: 127, type: !47)
!570 = !DILocalVariable(name: "len", arg: 2, scope: !565, file: !3, line: 127, type: !142)
!571 = !DILocalVariable(name: "p", scope: !565, file: !3, line: 128, type: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!573 = !DILocalVariable(name: "thislen", scope: !574, file: !3, line: 135, type: !142)
!574 = distinct !DILexicalBlock(scope: !565, file: !3, line: 134, column: 16)
!575 = !DILocation(line: 127, column: 35, scope: !565)
!576 = !DILocation(line: 127, column: 47, scope: !565)
!577 = !DILocation(line: 128, column: 20, scope: !565)
!578 = !DILocation(line: 130, column: 31, scope: !565)
!579 = !DILocation(line: 134, column: 5, scope: !565)
!580 = !DILocation(line: 145, column: 16, scope: !581)
!581 = distinct !DILexicalBlock(scope: !565, file: !3, line: 145, column: 9)
!582 = !{!512, !486, i64 2392}
!583 = !DILocation(line: 145, column: 46, scope: !581)
!584 = !DILocation(line: 135, column: 33, scope: !574)
!585 = !DILocation(line: 135, column: 60, scope: !574)
!586 = !{!512, !486, i64 2400}
!587 = !DILocation(line: 135, column: 51, scope: !574)
!588 = !DILocation(line: 135, column: 16, scope: !574)
!589 = !DILocation(line: 136, column: 21, scope: !590)
!590 = distinct !DILexicalBlock(scope: !574, file: !3, line: 136, column: 13)
!591 = !DILocation(line: 136, column: 13, scope: !574)
!592 = !DILocation(line: 136, column: 28, scope: !590)
!593 = !DILocation(line: 0, scope: !574)
!594 = !DILocation(line: 137, column: 23, scope: !574)
!595 = !DILocation(line: 137, column: 35, scope: !574)
!596 = !DILocation(line: 137, column: 9, scope: !574)
!597 = !DILocation(line: 138, column: 33, scope: !574)
!598 = !DILocation(line: 139, column: 47, scope: !599)
!599 = distinct !DILexicalBlock(scope: !574, file: !3, line: 139, column: 13)
!600 = !DILocation(line: 139, column: 37, scope: !599)
!601 = !DILocation(line: 139, column: 13, scope: !574)
!602 = !DILocation(line: 0, scope: !599)
!603 = !DILocation(line: 141, column: 13, scope: !574)
!604 = !DILocation(line: 142, column: 11, scope: !574)
!605 = !DILocation(line: 143, column: 37, scope: !574)
!606 = distinct !{!606, !579, !607}
!607 = !DILocation(line: 144, column: 5, scope: !565)
!608 = !DILocation(line: 145, column: 37, scope: !581)
!609 = !DILocation(line: 145, column: 9, scope: !565)
!610 = !DILocation(line: 146, column: 37, scope: !581)
!611 = !DILocation(line: 146, column: 9, scope: !581)
!612 = !DILocation(line: 149, column: 38, scope: !565)
!613 = !DILocation(line: 148, column: 38, scope: !565)
!614 = !DILocation(line: 148, column: 57, scope: !565)
!615 = !DILocation(line: 149, column: 59, scope: !565)
!616 = !DILocation(line: 148, column: 29, scope: !565)
!617 = !DILocation(line: 150, column: 1, scope: !565)
!618 = distinct !DISubprogram(name: "feedReplicationBacklogWithObject", scope: !3, file: !3, line: 154, type: !619, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !128}
!621 = !{!622, !623, !627, !628}
!622 = !DILocalVariable(name: "o", arg: 1, scope: !618, file: !3, line: 154, type: !128)
!623 = !DILocalVariable(name: "llstr", scope: !618, file: !3, line: 155, type: !624)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 21)
!627 = !DILocalVariable(name: "p", scope: !618, file: !3, line: 156, type: !47)
!628 = !DILocalVariable(name: "len", scope: !618, file: !3, line: 157, type: !142)
!629 = !DILocation(line: 154, column: 45, scope: !618)
!630 = !DILocation(line: 155, column: 5, scope: !618)
!631 = !DILocation(line: 155, column: 10, scope: !618)
!632 = !DILocation(line: 159, column: 12, scope: !633)
!633 = distinct !DILexicalBlock(scope: !618, file: !3, line: 159, column: 9)
!634 = !DILocation(line: 159, column: 21, scope: !633)
!635 = !DILocation(line: 159, column: 9, scope: !618)
!636 = !DILocation(line: 0, scope: !637)
!637 = distinct !DILexicalBlock(scope: !633, file: !3, line: 162, column: 12)
!638 = !DILocation(line: 160, column: 54, scope: !639)
!639 = distinct !DILexicalBlock(scope: !633, file: !3, line: 159, column: 42)
!640 = !{!641, !485, i64 8}
!641 = !{!"redisObject", !484, i64 0, !484, i64 0, !484, i64 1, !484, i64 4, !485, i64 8}
!642 = !DILocation(line: 160, column: 15, scope: !639)
!643 = !DILocation(line: 157, column: 12, scope: !618)
!644 = !DILocation(line: 156, column: 11, scope: !618)
!645 = !DILocation(line: 162, column: 5, scope: !639)
!646 = !DILocation(line: 163, column: 25, scope: !637)
!647 = !DILocalVariable(name: "s", arg: 1, scope: !648, file: !140, line: 87, type: !653)
!648 = distinct !DISubprogram(name: "sdslen", scope: !140, file: !140, line: 87, type: !649, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !654)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !653}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !652, line: 58, baseType: !18)
!652 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!654 = !{!647, !655}
!655 = !DILocalVariable(name: "flags", scope: !648, file: !140, line: 88, type: !269)
!656 = !DILocation(line: 87, column: 39, scope: !648, inlinedAt: !657)
!657 = distinct !DILocation(line: 163, column: 15, scope: !637)
!658 = !DILocation(line: 88, column: 27, scope: !648, inlinedAt: !657)
!659 = !DILocation(line: 88, column: 19, scope: !648, inlinedAt: !657)
!660 = !DILocation(line: 89, column: 5, scope: !648, inlinedAt: !657)
!661 = !DILocation(line: 91, column: 20, scope: !662, inlinedAt: !657)
!662 = distinct !DILexicalBlock(scope: !648, file: !140, line: 89, column: 33)
!663 = !DILocation(line: 91, column: 13, scope: !662, inlinedAt: !657)
!664 = !DILocation(line: 93, column: 20, scope: !662, inlinedAt: !657)
!665 = !DILocation(line: 93, column: 34, scope: !662, inlinedAt: !657)
!666 = !DILocation(line: 93, column: 13, scope: !662, inlinedAt: !657)
!667 = !DILocation(line: 95, column: 20, scope: !662, inlinedAt: !657)
!668 = !DILocation(line: 95, column: 35, scope: !662, inlinedAt: !657)
!669 = !{!670, !670, i64 0}
!670 = !{!"short", !471, i64 0}
!671 = !DILocation(line: 95, column: 13, scope: !662, inlinedAt: !657)
!672 = !DILocation(line: 97, column: 20, scope: !662, inlinedAt: !657)
!673 = !DILocation(line: 97, column: 35, scope: !662, inlinedAt: !657)
!674 = !{!484, !484, i64 0}
!675 = !DILocation(line: 97, column: 13, scope: !662, inlinedAt: !657)
!676 = !DILocation(line: 99, column: 20, scope: !662, inlinedAt: !657)
!677 = !DILocation(line: 99, column: 35, scope: !662, inlinedAt: !657)
!678 = !{!483, !483, i64 0}
!679 = !DILocation(line: 99, column: 13, scope: !662, inlinedAt: !657)
!680 = !DILocation(line: 0, scope: !662, inlinedAt: !657)
!681 = !DILocation(line: 102, column: 1, scope: !648, inlinedAt: !657)
!682 = !DILocation(line: 127, column: 35, scope: !565, inlinedAt: !683)
!683 = distinct !DILocation(line: 166, column: 5, scope: !618)
!684 = !DILocation(line: 127, column: 47, scope: !565, inlinedAt: !683)
!685 = !DILocation(line: 128, column: 20, scope: !565, inlinedAt: !683)
!686 = !DILocation(line: 130, column: 31, scope: !565, inlinedAt: !683)
!687 = !DILocation(line: 134, column: 5, scope: !565, inlinedAt: !683)
!688 = !DILocation(line: 145, column: 16, scope: !581, inlinedAt: !683)
!689 = !DILocation(line: 145, column: 46, scope: !581, inlinedAt: !683)
!690 = !DILocation(line: 135, column: 33, scope: !574, inlinedAt: !683)
!691 = !DILocation(line: 135, column: 60, scope: !574, inlinedAt: !683)
!692 = !DILocation(line: 135, column: 51, scope: !574, inlinedAt: !683)
!693 = !DILocation(line: 135, column: 16, scope: !574, inlinedAt: !683)
!694 = !DILocation(line: 136, column: 21, scope: !590, inlinedAt: !683)
!695 = !DILocation(line: 136, column: 13, scope: !574, inlinedAt: !683)
!696 = !DILocation(line: 136, column: 28, scope: !590, inlinedAt: !683)
!697 = !DILocation(line: 0, scope: !574, inlinedAt: !683)
!698 = !DILocation(line: 137, column: 23, scope: !574, inlinedAt: !683)
!699 = !DILocation(line: 137, column: 35, scope: !574, inlinedAt: !683)
!700 = !DILocation(line: 137, column: 9, scope: !574, inlinedAt: !683)
!701 = !DILocation(line: 138, column: 33, scope: !574, inlinedAt: !683)
!702 = !DILocation(line: 139, column: 47, scope: !599, inlinedAt: !683)
!703 = !DILocation(line: 139, column: 37, scope: !599, inlinedAt: !683)
!704 = !DILocation(line: 139, column: 13, scope: !574, inlinedAt: !683)
!705 = !DILocation(line: 0, scope: !599, inlinedAt: !683)
!706 = !DILocation(line: 141, column: 13, scope: !574, inlinedAt: !683)
!707 = !DILocation(line: 142, column: 11, scope: !574, inlinedAt: !683)
!708 = !DILocation(line: 143, column: 37, scope: !574, inlinedAt: !683)
!709 = !DILocation(line: 145, column: 37, scope: !581, inlinedAt: !683)
!710 = !DILocation(line: 145, column: 9, scope: !565, inlinedAt: !683)
!711 = !DILocation(line: 146, column: 37, scope: !581, inlinedAt: !683)
!712 = !DILocation(line: 146, column: 9, scope: !581, inlinedAt: !683)
!713 = !DILocation(line: 149, column: 38, scope: !565, inlinedAt: !683)
!714 = !DILocation(line: 148, column: 38, scope: !565, inlinedAt: !683)
!715 = !DILocation(line: 148, column: 57, scope: !565, inlinedAt: !683)
!716 = !DILocation(line: 149, column: 59, scope: !565, inlinedAt: !683)
!717 = !DILocation(line: 148, column: 29, scope: !565, inlinedAt: !683)
!718 = !DILocation(line: 150, column: 1, scope: !565, inlinedAt: !683)
!719 = !DILocation(line: 167, column: 1, scope: !618)
!720 = distinct !DISubprogram(name: "replicationFeedSlaves", scope: !3, file: !3, line: 174, type: !721, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !99, !20, !150, !20}
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !736, !739, !741, !747, !751}
!724 = !DILocalVariable(name: "slaves", arg: 1, scope: !720, file: !3, line: 174, type: !99)
!725 = !DILocalVariable(name: "dictid", arg: 2, scope: !720, file: !3, line: 174, type: !20)
!726 = !DILocalVariable(name: "argv", arg: 3, scope: !720, file: !3, line: 174, type: !150)
!727 = !DILocalVariable(name: "argc", arg: 4, scope: !720, file: !3, line: 174, type: !20)
!728 = !DILocalVariable(name: "ln", scope: !720, file: !3, line: 175, type: !105)
!729 = !DILocalVariable(name: "li", scope: !720, file: !3, line: 176, type: !420)
!730 = !DILocalVariable(name: "j", scope: !720, file: !3, line: 177, type: !20)
!731 = !DILocalVariable(name: "len", scope: !720, file: !3, line: 177, type: !20)
!732 = !DILocalVariable(name: "llstr", scope: !720, file: !3, line: 178, type: !624)
!733 = !DILocalVariable(name: "selectcmd", scope: !734, file: !3, line: 196, type: !128)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 195, column: 38)
!735 = distinct !DILexicalBlock(scope: !720, file: !3, line: 195, column: 9)
!736 = !DILocalVariable(name: "dictid_len", scope: !737, file: !3, line: 202, type: !20)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 201, column: 16)
!738 = distinct !DILexicalBlock(scope: !734, file: !3, line: 199, column: 13)
!739 = !DILocalVariable(name: "slave", scope: !740, file: !3, line: 217, type: !8)
!740 = distinct !DILexicalBlock(scope: !734, file: !3, line: 216, column: 37)
!741 = !DILocalVariable(name: "aux", scope: !742, file: !3, line: 229, type: !744)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 228, column: 30)
!743 = distinct !DILexicalBlock(scope: !720, file: !3, line: 228, column: 9)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 24)
!747 = !DILocalVariable(name: "objlen", scope: !748, file: !3, line: 239, type: !79)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 238, column: 36)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 238, column: 9)
!750 = distinct !DILexicalBlock(scope: !742, file: !3, line: 238, column: 9)
!751 = !DILocalVariable(name: "slave", scope: !752, file: !3, line: 257, type: !8)
!752 = distinct !DILexicalBlock(scope: !720, file: !3, line: 256, column: 33)
!753 = !DILocation(line: 174, column: 34, scope: !720)
!754 = !DILocation(line: 174, column: 46, scope: !720)
!755 = !DILocation(line: 174, column: 61, scope: !720)
!756 = !DILocation(line: 174, column: 71, scope: !720)
!757 = !DILocation(line: 176, column: 5, scope: !720)
!758 = !DILocation(line: 178, column: 5, scope: !720)
!759 = !DILocation(line: 178, column: 10, scope: !720)
!760 = !DILocation(line: 185, column: 16, scope: !761)
!761 = distinct !DILexicalBlock(scope: !720, file: !3, line: 185, column: 9)
!762 = !{!512, !485, i64 2464}
!763 = !DILocation(line: 185, column: 27, scope: !761)
!764 = !DILocation(line: 185, column: 9, scope: !720)
!765 = !DILocation(line: 189, column: 16, scope: !766)
!766 = distinct !DILexicalBlock(scope: !720, file: !3, line: 189, column: 9)
!767 = !DILocation(line: 189, column: 29, scope: !766)
!768 = !DILocation(line: 189, column: 37, scope: !766)
!769 = !DILocation(line: 189, column: 40, scope: !766)
!770 = !DILocation(line: 189, column: 59, scope: !766)
!771 = !DILocation(line: 189, column: 9, scope: !720)
!772 = !DILocation(line: 0, scope: !720)
!773 = !DILocation(line: 192, column: 5, scope: !720)
!774 = !DILocation(line: 195, column: 16, scope: !735)
!775 = !{!512, !484, i64 2368}
!776 = !DILocation(line: 195, column: 27, scope: !735)
!777 = !DILocation(line: 195, column: 9, scope: !720)
!778 = !DILocation(line: 225, column: 23, scope: !720)
!779 = !DILocation(line: 228, column: 9, scope: !720)
!780 = !DILocation(line: 199, column: 25, scope: !738)
!781 = !DILocation(line: 0, scope: !737)
!782 = !DILocation(line: 200, column: 25, scope: !783)
!783 = distinct !DILexicalBlock(scope: !738, file: !3, line: 199, column: 63)
!784 = !{!485, !485, i64 0}
!785 = !DILocation(line: 196, column: 15, scope: !734)
!786 = !DILocation(line: 201, column: 9, scope: !783)
!787 = !DILocation(line: 212, column: 13, scope: !734)
!788 = !DILocation(line: 204, column: 26, scope: !737)
!789 = !DILocation(line: 202, column: 17, scope: !737)
!790 = !DILocation(line: 206, column: 30, scope: !737)
!791 = !DILocation(line: 206, column: 17, scope: !737)
!792 = !DILocation(line: 205, column: 25, scope: !737)
!793 = !DILocation(line: 212, column: 20, scope: !794)
!794 = distinct !DILexicalBlock(scope: !734, file: !3, line: 212, column: 13)
!795 = !DILocation(line: 212, column: 13, scope: !794)
!796 = !DILocation(line: 212, column: 34, scope: !794)
!797 = !DILocation(line: 176, column: 14, scope: !720)
!798 = !DILocation(line: 215, column: 9, scope: !734)
!799 = !DILocation(line: 216, column: 9, scope: !734)
!800 = !DILocation(line: 216, column: 21, scope: !734)
!801 = !DILocation(line: 175, column: 15, scope: !720)
!802 = !DILocation(line: 217, column: 33, scope: !740)
!803 = !{!804, !485, i64 16}
!804 = !{!"listNode", !485, i64 0, !485, i64 8, !485, i64 16}
!805 = !DILocation(line: 217, column: 21, scope: !740)
!806 = !DILocation(line: 218, column: 24, scope: !807)
!807 = distinct !DILexicalBlock(scope: !740, file: !3, line: 218, column: 17)
!808 = !{!482, !484, i64 168}
!809 = !DILocation(line: 218, column: 34, scope: !807)
!810 = !DILocation(line: 218, column: 17, scope: !740)
!811 = distinct !{!811, !799, !812}
!812 = !DILocation(line: 220, column: 9, scope: !734)
!813 = !DILocation(line: 219, column: 13, scope: !740)
!814 = !DILocation(line: 0, scope: !807)
!815 = !DILocation(line: 222, column: 24, scope: !816)
!816 = distinct !DILexicalBlock(scope: !734, file: !3, line: 222, column: 13)
!817 = !DILocation(line: 223, column: 13, scope: !816)
!818 = !DILocation(line: 224, column: 5, scope: !734)
!819 = !DILocation(line: 228, column: 16, scope: !743)
!820 = !DILocation(line: 228, column: 9, scope: !743)
!821 = !DILocation(line: 229, column: 9, scope: !742)
!822 = !DILocation(line: 229, column: 14, scope: !742)
!823 = !DILocation(line: 232, column: 16, scope: !742)
!824 = !DILocation(line: 233, column: 28, scope: !742)
!825 = !DILocation(line: 233, column: 45, scope: !742)
!826 = !DILocation(line: 233, column: 15, scope: !742)
!827 = !DILocation(line: 177, column: 12, scope: !720)
!828 = !DILocation(line: 234, column: 16, scope: !742)
!829 = !DILocation(line: 234, column: 9, scope: !742)
!830 = !DILocation(line: 234, column: 20, scope: !742)
!831 = !DILocation(line: 235, column: 16, scope: !742)
!832 = !DILocation(line: 235, column: 9, scope: !742)
!833 = !DILocation(line: 235, column: 20, scope: !742)
!834 = !DILocation(line: 236, column: 39, scope: !742)
!835 = !DILocation(line: 236, column: 36, scope: !742)
!836 = !DILocation(line: 127, column: 35, scope: !565, inlinedAt: !837)
!837 = distinct !DILocation(line: 236, column: 9, scope: !742)
!838 = !DILocation(line: 127, column: 47, scope: !565, inlinedAt: !837)
!839 = !DILocation(line: 128, column: 20, scope: !565, inlinedAt: !837)
!840 = !DILocation(line: 130, column: 31, scope: !565, inlinedAt: !837)
!841 = !DILocation(line: 134, column: 5, scope: !565, inlinedAt: !837)
!842 = !DILocation(line: 145, column: 16, scope: !581, inlinedAt: !837)
!843 = !DILocation(line: 145, column: 46, scope: !581, inlinedAt: !837)
!844 = !DILocation(line: 135, column: 33, scope: !574, inlinedAt: !837)
!845 = !DILocation(line: 135, column: 60, scope: !574, inlinedAt: !837)
!846 = !DILocation(line: 135, column: 51, scope: !574, inlinedAt: !837)
!847 = !DILocation(line: 135, column: 16, scope: !574, inlinedAt: !837)
!848 = !DILocation(line: 136, column: 21, scope: !590, inlinedAt: !837)
!849 = !DILocation(line: 136, column: 13, scope: !574, inlinedAt: !837)
!850 = !DILocation(line: 136, column: 28, scope: !590, inlinedAt: !837)
!851 = !DILocation(line: 0, scope: !574, inlinedAt: !837)
!852 = !DILocation(line: 137, column: 23, scope: !574, inlinedAt: !837)
!853 = !DILocation(line: 137, column: 35, scope: !574, inlinedAt: !837)
!854 = !DILocation(line: 137, column: 9, scope: !574, inlinedAt: !837)
!855 = !DILocation(line: 138, column: 33, scope: !574, inlinedAt: !837)
!856 = !DILocation(line: 139, column: 47, scope: !599, inlinedAt: !837)
!857 = !DILocation(line: 139, column: 37, scope: !599, inlinedAt: !837)
!858 = !DILocation(line: 139, column: 13, scope: !574, inlinedAt: !837)
!859 = !DILocation(line: 0, scope: !599, inlinedAt: !837)
!860 = !DILocation(line: 141, column: 13, scope: !574, inlinedAt: !837)
!861 = !DILocation(line: 142, column: 11, scope: !574, inlinedAt: !837)
!862 = !DILocation(line: 143, column: 37, scope: !574, inlinedAt: !837)
!863 = !DILocation(line: 145, column: 37, scope: !581, inlinedAt: !837)
!864 = !DILocation(line: 145, column: 9, scope: !565, inlinedAt: !837)
!865 = !DILocation(line: 146, column: 37, scope: !581, inlinedAt: !837)
!866 = !DILocation(line: 146, column: 9, scope: !581, inlinedAt: !837)
!867 = !DILocation(line: 149, column: 38, scope: !565, inlinedAt: !837)
!868 = !DILocation(line: 148, column: 38, scope: !565, inlinedAt: !837)
!869 = !DILocation(line: 148, column: 57, scope: !565, inlinedAt: !837)
!870 = !DILocation(line: 149, column: 59, scope: !565, inlinedAt: !837)
!871 = !DILocation(line: 148, column: 29, scope: !565, inlinedAt: !837)
!872 = !DILocation(line: 150, column: 1, scope: !565, inlinedAt: !837)
!873 = !DILocation(line: 177, column: 9, scope: !720)
!874 = !DILocation(line: 238, column: 14, scope: !750)
!875 = !DILocation(line: 238, column: 23, scope: !749)
!876 = !DILocation(line: 238, column: 9, scope: !750)
!877 = !DILocation(line: 239, column: 43, scope: !748)
!878 = !DILocation(line: 239, column: 27, scope: !748)
!879 = !DILocation(line: 239, column: 18, scope: !748)
!880 = !DILocation(line: 244, column: 20, scope: !748)
!881 = !DILocation(line: 245, column: 19, scope: !748)
!882 = !DILocation(line: 246, column: 20, scope: !748)
!883 = !DILocation(line: 246, column: 13, scope: !748)
!884 = !DILocation(line: 246, column: 24, scope: !748)
!885 = !DILocation(line: 247, column: 20, scope: !748)
!886 = !DILocation(line: 247, column: 13, scope: !748)
!887 = !DILocation(line: 247, column: 24, scope: !748)
!888 = !DILocation(line: 248, column: 43, scope: !748)
!889 = !DILocation(line: 248, column: 40, scope: !748)
!890 = !DILocation(line: 127, column: 35, scope: !565, inlinedAt: !891)
!891 = distinct !DILocation(line: 248, column: 13, scope: !748)
!892 = !DILocation(line: 127, column: 47, scope: !565, inlinedAt: !891)
!893 = !DILocation(line: 128, column: 20, scope: !565, inlinedAt: !891)
!894 = !DILocation(line: 130, column: 31, scope: !565, inlinedAt: !891)
!895 = !DILocation(line: 134, column: 5, scope: !565, inlinedAt: !891)
!896 = !DILocation(line: 145, column: 16, scope: !581, inlinedAt: !891)
!897 = !DILocation(line: 145, column: 46, scope: !581, inlinedAt: !891)
!898 = !DILocation(line: 135, column: 33, scope: !574, inlinedAt: !891)
!899 = !DILocation(line: 135, column: 60, scope: !574, inlinedAt: !891)
!900 = !DILocation(line: 135, column: 51, scope: !574, inlinedAt: !891)
!901 = !DILocation(line: 135, column: 16, scope: !574, inlinedAt: !891)
!902 = !DILocation(line: 136, column: 21, scope: !590, inlinedAt: !891)
!903 = !DILocation(line: 136, column: 13, scope: !574, inlinedAt: !891)
!904 = !DILocation(line: 136, column: 28, scope: !590, inlinedAt: !891)
!905 = !DILocation(line: 0, scope: !574, inlinedAt: !891)
!906 = !DILocation(line: 137, column: 23, scope: !574, inlinedAt: !891)
!907 = !DILocation(line: 137, column: 35, scope: !574, inlinedAt: !891)
!908 = !DILocation(line: 137, column: 9, scope: !574, inlinedAt: !891)
!909 = !DILocation(line: 138, column: 33, scope: !574, inlinedAt: !891)
!910 = !DILocation(line: 139, column: 47, scope: !599, inlinedAt: !891)
!911 = !DILocation(line: 139, column: 37, scope: !599, inlinedAt: !891)
!912 = !DILocation(line: 139, column: 13, scope: !574, inlinedAt: !891)
!913 = !DILocation(line: 0, scope: !599, inlinedAt: !891)
!914 = !DILocation(line: 141, column: 13, scope: !574, inlinedAt: !891)
!915 = !DILocation(line: 142, column: 11, scope: !574, inlinedAt: !891)
!916 = !DILocation(line: 143, column: 37, scope: !574, inlinedAt: !891)
!917 = !DILocation(line: 145, column: 37, scope: !581, inlinedAt: !891)
!918 = !DILocation(line: 145, column: 9, scope: !565, inlinedAt: !891)
!919 = !DILocation(line: 146, column: 37, scope: !581, inlinedAt: !891)
!920 = !DILocation(line: 146, column: 9, scope: !581, inlinedAt: !891)
!921 = !DILocation(line: 149, column: 38, scope: !565, inlinedAt: !891)
!922 = !DILocation(line: 148, column: 38, scope: !565, inlinedAt: !891)
!923 = !DILocation(line: 148, column: 57, scope: !565, inlinedAt: !891)
!924 = !DILocation(line: 149, column: 59, scope: !565, inlinedAt: !891)
!925 = !DILocation(line: 148, column: 29, scope: !565, inlinedAt: !891)
!926 = !DILocation(line: 150, column: 1, scope: !565, inlinedAt: !891)
!927 = !DILocation(line: 249, column: 46, scope: !748)
!928 = !DILocation(line: 249, column: 13, scope: !748)
!929 = !DILocation(line: 250, column: 39, scope: !748)
!930 = !DILocation(line: 250, column: 43, scope: !748)
!931 = !DILocation(line: 127, column: 35, scope: !565, inlinedAt: !932)
!932 = distinct !DILocation(line: 250, column: 13, scope: !748)
!933 = !DILocation(line: 127, column: 47, scope: !565, inlinedAt: !932)
!934 = !DILocation(line: 128, column: 20, scope: !565, inlinedAt: !932)
!935 = !DILocation(line: 130, column: 31, scope: !565, inlinedAt: !932)
!936 = !DILocation(line: 134, column: 5, scope: !565, inlinedAt: !932)
!937 = !DILocation(line: 135, column: 33, scope: !574, inlinedAt: !932)
!938 = !DILocation(line: 135, column: 60, scope: !574, inlinedAt: !932)
!939 = !DILocation(line: 135, column: 51, scope: !574, inlinedAt: !932)
!940 = !DILocation(line: 135, column: 16, scope: !574, inlinedAt: !932)
!941 = !DILocation(line: 136, column: 21, scope: !590, inlinedAt: !932)
!942 = !DILocation(line: 136, column: 13, scope: !574, inlinedAt: !932)
!943 = !DILocation(line: 136, column: 28, scope: !590, inlinedAt: !932)
!944 = !DILocation(line: 0, scope: !574, inlinedAt: !932)
!945 = !DILocation(line: 137, column: 23, scope: !574, inlinedAt: !932)
!946 = !DILocation(line: 137, column: 35, scope: !574, inlinedAt: !932)
!947 = !DILocation(line: 137, column: 9, scope: !574, inlinedAt: !932)
!948 = !DILocation(line: 138, column: 33, scope: !574, inlinedAt: !932)
!949 = !DILocation(line: 139, column: 47, scope: !599, inlinedAt: !932)
!950 = !DILocation(line: 139, column: 37, scope: !599, inlinedAt: !932)
!951 = !DILocation(line: 139, column: 13, scope: !574, inlinedAt: !932)
!952 = !DILocation(line: 0, scope: !599, inlinedAt: !932)
!953 = !DILocation(line: 141, column: 13, scope: !574, inlinedAt: !932)
!954 = !DILocation(line: 142, column: 11, scope: !574, inlinedAt: !932)
!955 = !DILocation(line: 143, column: 37, scope: !574, inlinedAt: !932)
!956 = !DILocation(line: 145, column: 37, scope: !581, inlinedAt: !932)
!957 = !DILocation(line: 145, column: 9, scope: !565, inlinedAt: !932)
!958 = !DILocation(line: 146, column: 37, scope: !581, inlinedAt: !932)
!959 = !DILocation(line: 146, column: 9, scope: !581, inlinedAt: !932)
!960 = !DILocation(line: 149, column: 38, scope: !565, inlinedAt: !932)
!961 = !DILocation(line: 148, column: 38, scope: !565, inlinedAt: !932)
!962 = !DILocation(line: 148, column: 57, scope: !565, inlinedAt: !932)
!963 = !DILocation(line: 149, column: 59, scope: !565, inlinedAt: !932)
!964 = !DILocation(line: 148, column: 29, scope: !565, inlinedAt: !932)
!965 = !DILocation(line: 150, column: 1, scope: !565, inlinedAt: !932)
!966 = !DILocation(line: 238, column: 32, scope: !749)
!967 = !DILocation(line: 238, column: 9, scope: !749)
!968 = distinct !{!968, !876, !969}
!969 = !DILocation(line: 251, column: 9, scope: !750)
!970 = !DILocation(line: 252, column: 5, scope: !743)
!971 = !DILocation(line: 252, column: 5, scope: !742)
!972 = !DILocation(line: 255, column: 5, scope: !720)
!973 = !DILocation(line: 256, column: 5, scope: !720)
!974 = !DILocation(line: 256, column: 17, scope: !720)
!975 = !DILocation(line: 257, column: 29, scope: !752)
!976 = !DILocation(line: 257, column: 17, scope: !752)
!977 = !DILocation(line: 260, column: 20, scope: !978)
!978 = distinct !DILexicalBlock(scope: !752, file: !3, line: 260, column: 13)
!979 = !DILocation(line: 260, column: 30, scope: !978)
!980 = !DILocation(line: 260, column: 13, scope: !752)
!981 = distinct !{!981, !973, !982}
!982 = !DILocation(line: 273, column: 5, scope: !720)
!983 = !DILocation(line: 267, column: 9, scope: !752)
!984 = !DILocation(line: 271, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !752, file: !3, line: 271, column: 9)
!986 = !DILocation(line: 271, column: 9, scope: !985)
!987 = !DILocation(line: 272, column: 32, scope: !988)
!988 = distinct !DILexicalBlock(scope: !985, file: !3, line: 271, column: 9)
!989 = !DILocation(line: 272, column: 13, scope: !988)
!990 = !DILocation(line: 271, column: 32, scope: !988)
!991 = !DILocation(line: 271, column: 9, scope: !988)
!992 = !DILocation(line: 271, column: 23, scope: !988)
!993 = distinct !{!993, !986, !994}
!994 = !DILocation(line: 272, column: 39, scope: !985)
!995 = !DILocation(line: 0, scope: !978)
!996 = !DILocation(line: 0, scope: !761)
!997 = !DILocation(line: 274, column: 1, scope: !720)
!998 = distinct !DISubprogram(name: "replicationFeedSlavesFromMasterStream", scope: !3, file: !3, line: 279, type: !999, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !1001)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !99, !6, !142}
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007}
!1002 = !DILocalVariable(name: "slaves", arg: 1, scope: !998, file: !3, line: 279, type: !99)
!1003 = !DILocalVariable(name: "buf", arg: 2, scope: !998, file: !3, line: 279, type: !6)
!1004 = !DILocalVariable(name: "buflen", arg: 3, scope: !998, file: !3, line: 279, type: !142)
!1005 = !DILocalVariable(name: "ln", scope: !998, file: !3, line: 280, type: !105)
!1006 = !DILocalVariable(name: "li", scope: !998, file: !3, line: 281, type: !420)
!1007 = !DILocalVariable(name: "slave", scope: !1008, file: !3, line: 296, type: !8)
!1008 = distinct !DILexicalBlock(scope: !998, file: !3, line: 295, column: 33)
!1009 = !DILocation(line: 279, column: 50, scope: !998)
!1010 = !DILocation(line: 279, column: 64, scope: !998)
!1011 = !DILocation(line: 279, column: 76, scope: !998)
!1012 = !DILocation(line: 281, column: 5, scope: !998)
!1013 = !DILocation(line: 293, column: 16, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !998, file: !3, line: 293, column: 9)
!1015 = !DILocation(line: 293, column: 9, scope: !1014)
!1016 = !DILocation(line: 293, column: 9, scope: !998)
!1017 = !DILocation(line: 127, column: 35, scope: !565, inlinedAt: !1018)
!1018 = distinct !DILocation(line: 293, column: 30, scope: !1014)
!1019 = !DILocation(line: 127, column: 47, scope: !565, inlinedAt: !1018)
!1020 = !DILocation(line: 128, column: 20, scope: !565, inlinedAt: !1018)
!1021 = !DILocation(line: 130, column: 31, scope: !565, inlinedAt: !1018)
!1022 = !DILocation(line: 134, column: 5, scope: !565, inlinedAt: !1018)
!1023 = !DILocation(line: 145, column: 16, scope: !581, inlinedAt: !1018)
!1024 = !DILocation(line: 145, column: 46, scope: !581, inlinedAt: !1018)
!1025 = !DILocation(line: 135, column: 33, scope: !574, inlinedAt: !1018)
!1026 = !DILocation(line: 135, column: 60, scope: !574, inlinedAt: !1018)
!1027 = !DILocation(line: 135, column: 51, scope: !574, inlinedAt: !1018)
!1028 = !DILocation(line: 135, column: 16, scope: !574, inlinedAt: !1018)
!1029 = !DILocation(line: 136, column: 21, scope: !590, inlinedAt: !1018)
!1030 = !DILocation(line: 136, column: 13, scope: !574, inlinedAt: !1018)
!1031 = !DILocation(line: 136, column: 28, scope: !590, inlinedAt: !1018)
!1032 = !DILocation(line: 0, scope: !574, inlinedAt: !1018)
!1033 = !DILocation(line: 137, column: 23, scope: !574, inlinedAt: !1018)
!1034 = !DILocation(line: 137, column: 35, scope: !574, inlinedAt: !1018)
!1035 = !DILocation(line: 137, column: 9, scope: !574, inlinedAt: !1018)
!1036 = !DILocation(line: 138, column: 33, scope: !574, inlinedAt: !1018)
!1037 = !DILocation(line: 139, column: 47, scope: !599, inlinedAt: !1018)
!1038 = !DILocation(line: 139, column: 37, scope: !599, inlinedAt: !1018)
!1039 = !DILocation(line: 139, column: 13, scope: !574, inlinedAt: !1018)
!1040 = !DILocation(line: 0, scope: !599, inlinedAt: !1018)
!1041 = !DILocation(line: 141, column: 13, scope: !574, inlinedAt: !1018)
!1042 = !DILocation(line: 142, column: 11, scope: !574, inlinedAt: !1018)
!1043 = !DILocation(line: 143, column: 37, scope: !574, inlinedAt: !1018)
!1044 = !DILocation(line: 145, column: 37, scope: !581, inlinedAt: !1018)
!1045 = !DILocation(line: 145, column: 9, scope: !565, inlinedAt: !1018)
!1046 = !DILocation(line: 146, column: 37, scope: !581, inlinedAt: !1018)
!1047 = !DILocation(line: 146, column: 9, scope: !581, inlinedAt: !1018)
!1048 = !DILocation(line: 149, column: 38, scope: !565, inlinedAt: !1018)
!1049 = !DILocation(line: 148, column: 38, scope: !565, inlinedAt: !1018)
!1050 = !DILocation(line: 148, column: 57, scope: !565, inlinedAt: !1018)
!1051 = !DILocation(line: 149, column: 59, scope: !565, inlinedAt: !1018)
!1052 = !DILocation(line: 148, column: 29, scope: !565, inlinedAt: !1018)
!1053 = !DILocation(line: 150, column: 1, scope: !565, inlinedAt: !1018)
!1054 = !DILocation(line: 293, column: 30, scope: !1014)
!1055 = !DILocation(line: 281, column: 14, scope: !998)
!1056 = !DILocation(line: 294, column: 5, scope: !998)
!1057 = !DILocation(line: 295, column: 5, scope: !998)
!1058 = !DILocation(line: 295, column: 17, scope: !998)
!1059 = !DILocation(line: 280, column: 15, scope: !998)
!1060 = !DILocation(line: 296, column: 29, scope: !1008)
!1061 = !DILocation(line: 296, column: 17, scope: !1008)
!1062 = !DILocation(line: 299, column: 20, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 299, column: 13)
!1064 = !DILocation(line: 299, column: 30, scope: !1063)
!1065 = !DILocation(line: 299, column: 13, scope: !1008)
!1066 = distinct !{!1066, !1057, !1067}
!1067 = !DILocation(line: 301, column: 5, scope: !998)
!1068 = !DILocation(line: 300, column: 9, scope: !1008)
!1069 = !DILocation(line: 0, scope: !1063)
!1070 = !DILocation(line: 302, column: 1, scope: !998)
!1071 = distinct !DISubprogram(name: "replicationFeedMonitors", scope: !3, file: !3, line: 304, type: !1072, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !8, !99, !20, !150, !20}
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1091}
!1075 = !DILocalVariable(name: "c", arg: 1, scope: !1071, file: !3, line: 304, type: !8)
!1076 = !DILocalVariable(name: "monitors", arg: 2, scope: !1071, file: !3, line: 304, type: !99)
!1077 = !DILocalVariable(name: "dictid", arg: 3, scope: !1071, file: !3, line: 304, type: !20)
!1078 = !DILocalVariable(name: "argv", arg: 4, scope: !1071, file: !3, line: 304, type: !150)
!1079 = !DILocalVariable(name: "argc", arg: 5, scope: !1071, file: !3, line: 304, type: !20)
!1080 = !DILocalVariable(name: "ln", scope: !1071, file: !3, line: 305, type: !105)
!1081 = !DILocalVariable(name: "li", scope: !1071, file: !3, line: 306, type: !420)
!1082 = !DILocalVariable(name: "j", scope: !1071, file: !3, line: 307, type: !20)
!1083 = !DILocalVariable(name: "cmdrepr", scope: !1071, file: !3, line: 308, type: !139)
!1084 = !DILocalVariable(name: "cmdobj", scope: !1071, file: !3, line: 309, type: !128)
!1085 = !DILocalVariable(name: "tv", scope: !1071, file: !3, line: 310, type: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !185, line: 44, size: 128, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1086, file: !185, line: 45, baseType: !184, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1086, file: !185, line: 46, baseType: !1090, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !185, line: 39, baseType: !79)
!1091 = !DILocalVariable(name: "monitor", scope: !1092, file: !3, line: 337, type: !8)
!1092 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 336, column: 33)
!1093 = !DILocation(line: 304, column: 38, scope: !1071)
!1094 = !DILocation(line: 304, column: 47, scope: !1071)
!1095 = !DILocation(line: 304, column: 61, scope: !1071)
!1096 = !DILocation(line: 304, column: 76, scope: !1071)
!1097 = !DILocation(line: 304, column: 86, scope: !1071)
!1098 = !DILocation(line: 306, column: 5, scope: !1071)
!1099 = !DILocation(line: 308, column: 19, scope: !1071)
!1100 = !DILocation(line: 308, column: 9, scope: !1071)
!1101 = !DILocation(line: 310, column: 5, scope: !1071)
!1102 = !DILocation(line: 310, column: 20, scope: !1071)
!1103 = !DILocation(line: 312, column: 5, scope: !1071)
!1104 = !DILocation(line: 313, column: 58, scope: !1071)
!1105 = !{!1106, !483, i64 0}
!1106 = !{!"timeval", !483, i64 0, !483, i64 8}
!1107 = !DILocation(line: 313, column: 74, scope: !1071)
!1108 = !{!1106, !483, i64 8}
!1109 = !DILocation(line: 313, column: 15, scope: !1071)
!1110 = !DILocation(line: 314, column: 12, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 314, column: 9)
!1112 = !{!482, !484, i64 160}
!1113 = !DILocation(line: 314, column: 18, scope: !1111)
!1114 = !DILocation(line: 314, column: 9, scope: !1071)
!1115 = !DILocation(line: 315, column: 19, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 314, column: 32)
!1117 = !DILocation(line: 316, column: 5, scope: !1116)
!1118 = !DILocation(line: 316, column: 25, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 316, column: 16)
!1120 = !DILocation(line: 316, column: 16, scope: !1111)
!1121 = !DILocation(line: 317, column: 70, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 316, column: 47)
!1123 = !{!512, !485, i64 360}
!1124 = !DILocation(line: 317, column: 19, scope: !1122)
!1125 = !DILocation(line: 318, column: 5, scope: !1122)
!1126 = !DILocation(line: 319, column: 58, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 318, column: 12)
!1128 = !DILocation(line: 319, column: 19, scope: !1127)
!1129 = !DILocation(line: 0, scope: !1127)
!1130 = !DILocation(line: 307, column: 9, scope: !1071)
!1131 = !DILocation(line: 322, column: 10, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 322, column: 5)
!1133 = !DILocation(line: 322, column: 19, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 322, column: 5)
!1135 = !DILocation(line: 322, column: 5, scope: !1132)
!1136 = !DILocation(line: 323, column: 13, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 323, column: 13)
!1138 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 322, column: 32)
!1139 = !DILocation(line: 323, column: 22, scope: !1137)
!1140 = !DILocation(line: 323, column: 31, scope: !1137)
!1141 = !DILocation(line: 0, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 325, column: 16)
!1143 = !DILocation(line: 323, column: 13, scope: !1138)
!1144 = !DILocation(line: 324, column: 56, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 323, column: 52)
!1146 = !DILocation(line: 324, column: 23, scope: !1145)
!1147 = !DILocation(line: 325, column: 9, scope: !1145)
!1148 = !DILocation(line: 87, column: 39, scope: !648, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 327, column: 25, scope: !1142)
!1150 = !DILocation(line: 88, column: 27, scope: !648, inlinedAt: !1149)
!1151 = !DILocation(line: 88, column: 19, scope: !648, inlinedAt: !1149)
!1152 = !DILocation(line: 89, column: 5, scope: !648, inlinedAt: !1149)
!1153 = !DILocation(line: 91, column: 20, scope: !662, inlinedAt: !1149)
!1154 = !DILocation(line: 91, column: 13, scope: !662, inlinedAt: !1149)
!1155 = !DILocation(line: 93, column: 20, scope: !662, inlinedAt: !1149)
!1156 = !DILocation(line: 93, column: 34, scope: !662, inlinedAt: !1149)
!1157 = !DILocation(line: 93, column: 13, scope: !662, inlinedAt: !1149)
!1158 = !DILocation(line: 95, column: 20, scope: !662, inlinedAt: !1149)
!1159 = !DILocation(line: 95, column: 35, scope: !662, inlinedAt: !1149)
!1160 = !DILocation(line: 95, column: 13, scope: !662, inlinedAt: !1149)
!1161 = !DILocation(line: 97, column: 20, scope: !662, inlinedAt: !1149)
!1162 = !DILocation(line: 97, column: 35, scope: !662, inlinedAt: !1149)
!1163 = !DILocation(line: 97, column: 13, scope: !662, inlinedAt: !1149)
!1164 = !DILocation(line: 99, column: 20, scope: !662, inlinedAt: !1149)
!1165 = !DILocation(line: 99, column: 35, scope: !662, inlinedAt: !1149)
!1166 = !DILocation(line: 99, column: 13, scope: !662, inlinedAt: !1149)
!1167 = !DILocation(line: 0, scope: !662, inlinedAt: !1149)
!1168 = !DILocation(line: 102, column: 1, scope: !648, inlinedAt: !1149)
!1169 = !DILocation(line: 326, column: 23, scope: !1142)
!1170 = !DILocation(line: 329, column: 15, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 329, column: 13)
!1172 = !DILocation(line: 329, column: 13, scope: !1138)
!1173 = !DILocation(line: 330, column: 23, scope: !1171)
!1174 = !DILocation(line: 330, column: 13, scope: !1171)
!1175 = !DILocation(line: 0, scope: !1145)
!1176 = !DILocation(line: 322, column: 28, scope: !1134)
!1177 = !DILocation(line: 322, column: 5, scope: !1134)
!1178 = distinct !{!1178, !1135, !1179}
!1179 = !DILocation(line: 331, column: 5, scope: !1132)
!1180 = !DILocation(line: 0, scope: !1171)
!1181 = !DILocation(line: 332, column: 15, scope: !1071)
!1182 = !DILocation(line: 333, column: 14, scope: !1071)
!1183 = !DILocation(line: 309, column: 11, scope: !1071)
!1184 = !DILocation(line: 306, column: 14, scope: !1071)
!1185 = !DILocation(line: 335, column: 5, scope: !1071)
!1186 = !DILocation(line: 336, column: 5, scope: !1071)
!1187 = !DILocation(line: 336, column: 17, scope: !1071)
!1188 = !DILocation(line: 305, column: 15, scope: !1071)
!1189 = !DILocation(line: 337, column: 31, scope: !1092)
!1190 = !DILocation(line: 337, column: 17, scope: !1092)
!1191 = !DILocation(line: 338, column: 9, scope: !1092)
!1192 = distinct !{!1192, !1186, !1193}
!1193 = !DILocation(line: 339, column: 5, scope: !1071)
!1194 = !DILocation(line: 340, column: 5, scope: !1071)
!1195 = !DILocation(line: 341, column: 1, scope: !1071)
!1196 = distinct !DISubprogram(name: "addReplyReplicationBacklog", scope: !3, file: !3, line: 345, type: !1197, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !1199)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!97, !8, !97}
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205}
!1200 = !DILocalVariable(name: "c", arg: 1, scope: !1196, file: !3, line: 345, type: !8)
!1201 = !DILocalVariable(name: "offset", arg: 2, scope: !1196, file: !3, line: 345, type: !97)
!1202 = !DILocalVariable(name: "j", scope: !1196, file: !3, line: 346, type: !97)
!1203 = !DILocalVariable(name: "skip", scope: !1196, file: !3, line: 346, type: !97)
