; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sched_yield.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sched_yield.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.anon.0 = type { %struct.uk_waitq_entry* }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !487, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "uk_pr_crit", scope: !3, file: !3, line: 194, type: !4, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !472)
!3 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, null}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !26, globals: !466)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sched_yield.c", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !19}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !13, line: 92, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !20, line: 68, baseType: !14, size: 32, elements: !21)
!20 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !30, line: 59, size: 1024, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !33, !35, !36, !37, !42, !47, !53, !55, !72, !221, !222, !223, !436}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !30, line: 60, baseType: !6, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !29, file: !30, line: 61, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !29, file: !30, line: 62, baseType: !34, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !29, file: !30, line: 63, baseType: !34, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !29, file: !30, line: 64, baseType: !38, size: 128, offset: 256)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !30, line: 64, size: 128, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !38, file: !30, line: 64, baseType: !28, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !38, file: !30, line: 64, baseType: !27, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !30, line: 65, baseType: !43, size: 32, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !44, line: 48, baseType: !45)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !46, line: 79, baseType: !14)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !29, file: !30, line: 66, baseType: !48, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !49, line: 49, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !51, line: 128, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !29, file: !30, line: 67, baseType: !54, size: 8, offset: 512)
!54 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !29, file: !30, line: 68, baseType: !56, size: 128, offset: 576)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !57, line: 42, size: 128, elements: !58)
!57 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !{!59, !70}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !56, file: !57, line: 42, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !57, line: 35, size: 192, elements: !62)
!62 = !{!63, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !61, file: !57, line: 36, baseType: !64, size: 32)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !61, file: !57, line: 37, baseType: !28, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !61, file: !57, line: 38, baseType: !67, size: 64, offset: 128)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !61, file: !57, line: 38, size: 64, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !67, file: !57, line: 38, baseType: !60, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !56, file: !57, line: 42, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !29, file: !30, line: 69, baseType: !73, size: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !75, line: 90, size: 2176, elements: !76)
!75 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !{!77, !82, !100, !105, !107, !109, !114, !122, !127, !133, !134, !135, !140, !218, !219, !220}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !74, file: !75, line: 91, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !75, line: 68, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !73}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !74, file: !75, line: 93, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !75, line: 71, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!64, !73, !28, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !90, line: 62, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !90, line: 55, size: 128, elements: !92)
!92 = !{!93, !94, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !91, file: !90, line: 57, baseType: !54, size: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !91, file: !90, line: 59, baseType: !95, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !90, line: 53, baseType: !64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !91, file: !90, line: 61, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !49, line: 48, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !51, line: 129, baseType: !99)
!99 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !74, file: !75, line: 94, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !75, line: 74, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !73, !28}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !74, file: !75, line: 95, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !75, line: 76, baseType: !102)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !74, file: !75, line: 96, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !75, line: 78, baseType: !102)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !74, file: !75, line: 98, baseType: !110, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !75, line: 81, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!64, !73, !28, !95}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !74, file: !75, line: 99, baseType: !115, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !75, line: 83, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!64, !73, !119, !121}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !74, file: !75, line: 100, baseType: !123, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !75, line: 85, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!64, !73, !28, !64}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !74, file: !75, line: 101, baseType: !128, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !75, line: 87, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!64, !73, !119, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !74, file: !75, line: 104, baseType: !54, size: 8, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !74, file: !75, line: 105, baseType: !29, size: 1024, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !74, file: !75, line: 106, baseType: !136, size: 128, offset: 1664)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !30, line: 93, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !136, file: !30, line: 93, baseType: !28, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !136, file: !30, line: 93, baseType: !27, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !74, file: !75, line: 107, baseType: !141, size: 192, offset: 1792)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !142, line: 59, size: 192, elements: !143)
!142 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!143 = !{!144, !209, !213}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !141, file: !142, line: 61, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !142, line: 51, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!34, !149, !99, !99}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !151, line: 77, size: 832, elements: !152)
!151 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!152 = !{!153, !160, !165, !170, !176, !178, !183, !184, !185, !190, !195, !200, !201, !202}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !150, file: !151, line: 79, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !151, line: 54, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!34, !149, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !159, line: 58, baseType: !99)
!159 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !150, file: !151, line: 80, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !151, line: 56, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!34, !149, !158, !158}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !150, file: !151, line: 81, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !151, line: 62, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!34, !149, !34, !158}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !150, file: !151, line: 82, baseType: !171, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !151, line: 58, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!64, !149, !175, !158, !158}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !150, file: !151, line: 83, baseType: !177, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !151, line: 60, baseType: !162)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !150, file: !151, line: 84, baseType: !179, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !151, line: 64, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !149, !34}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !150, file: !151, line: 87, baseType: !179, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !150, file: !151, line: 88, baseType: !154, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !150, file: !151, line: 92, baseType: !186, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !151, line: 66, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!34, !149, !99}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !150, file: !151, line: 93, baseType: !191, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !151, line: 68, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !149, !34, !99}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !150, file: !151, line: 99, baseType: !196, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !151, line: 70, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!64, !149, !34, !158}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !150, file: !151, line: 100, baseType: !158, size: 64, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !151, line: 103, baseType: !149, size: 64, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !150, file: !151, line: 104, baseType: !203, offset: 832)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, elements: !207)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !44, line: 20, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !46, line: 41, baseType: !206)
!206 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!207 = !{!208}
!208 = !DISubrange(count: -1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !141, file: !142, line: 63, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !34}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !141, file: !142, line: 65, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !142, line: 56, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !34, !34}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !74, file: !75, line: 108, baseType: !149, size: 64, offset: 1984)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !75, line: 109, baseType: !73, size: 64, offset: 2048)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !74, file: !75, line: 110, baseType: !34, size: 64, offset: 2112)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !29, file: !30, line: 70, baseType: !34, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !29, file: !30, line: 72, baseType: !64, size: 32, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !29, file: !30, line: 82, baseType: !224, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !226, line: 569, size: 14912, elements: !227)
!226 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!227 = !{!228, !229, !304, !305, !306, !307, !311, !312, !315, !316, !320, !332, !333, !334, !336, !337, !338, !400, !421, !422, !427, !434}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !225, file: !226, line: 571, baseType: !64, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !225, file: !226, line: 576, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !226, line: 287, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !226, line: 181, size: 1408, elements: !233)
!233 = !{!234, !237, !238, !239, !241, !242, !247, !248, !249, !256, !260, !265, !269, !270, !271, !272, !276, !280, !281, !282, !284, !285, !289, !303}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !232, file: !226, line: 182, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !232, file: !226, line: 183, baseType: !64, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !232, file: !226, line: 184, baseType: !64, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !226, line: 185, baseType: !240, size: 16, offset: 128)
!240 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !232, file: !226, line: 186, baseType: !240, size: 16, offset: 144)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !232, file: !226, line: 187, baseType: !243, size: 128, offset: 192)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !226, line: 117, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !243, file: !226, line: 118, baseType: !235, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !243, file: !226, line: 119, baseType: !64, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !232, file: !226, line: 188, baseType: !64, size: 32, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !232, file: !226, line: 195, baseType: !34, size: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !232, file: !226, line: 197, baseType: !250, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!253, !224, !34, !255, !64}
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !254, line: 145, baseType: !52)
!254 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !232, file: !226, line: 199, baseType: !257, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!253, !224, !34, !6, !64}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !232, file: !226, line: 202, baseType: !261, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !224, !34, !264, !64}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !254, line: 114, baseType: !52)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !232, file: !226, line: 203, baseType: !266, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!64, !224, !34}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !232, file: !226, line: 206, baseType: !243, size: 128, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !232, file: !226, line: 207, baseType: !235, size: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !232, file: !226, line: 208, baseType: !64, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !232, file: !226, line: 211, baseType: !273, size: 24, offset: 928)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 24, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 3)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !232, file: !226, line: 212, baseType: !277, size: 8, offset: 952)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 8, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 1)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !232, file: !226, line: 215, baseType: !243, size: 128, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !232, file: !226, line: 218, baseType: !64, size: 32, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !232, file: !226, line: 219, baseType: !283, size: 64, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !254, line: 44, baseType: !52)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !232, file: !226, line: 222, baseType: !224, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !232, file: !226, line: 226, baseType: !286, size: 32, offset: 1280)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !254, line: 175, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !288, line: 12, baseType: !64)
!288 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !232, file: !226, line: 228, baseType: !290, size: 64, offset: 1312)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !254, line: 171, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 163, size: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !291, file: !254, line: 165, baseType: !64, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !291, file: !254, line: 170, baseType: !295, size: 32, offset: 32)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !291, file: !254, line: 166, size: 32, elements: !296)
!296 = !{!297, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !295, file: !254, line: 168, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !159, line: 124, baseType: !14)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !295, file: !254, line: 169, baseType: !300, size: 32)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 32, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 4)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !232, file: !226, line: 229, baseType: !64, size: 32, offset: 1376)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !225, file: !226, line: 576, baseType: !230, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !225, file: !226, line: 576, baseType: !230, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !225, file: !226, line: 578, baseType: !64, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !225, file: !226, line: 579, baseType: !308, size: 200, offset: 288)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 25)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !225, file: !226, line: 582, baseType: !64, size: 32, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !225, file: !226, line: 583, baseType: !313, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !226, line: 40, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !225, file: !226, line: 585, baseType: !64, size: 32, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !225, file: !226, line: 587, baseType: !317, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !224}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !225, file: !226, line: 590, baseType: !321, size: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !226, line: 47, size: 256, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !322, file: !226, line: 49, baseType: !321, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !322, file: !226, line: 50, baseType: !64, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !322, file: !226, line: 50, baseType: !64, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !322, file: !226, line: 50, baseType: !64, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !322, file: !226, line: 50, baseType: !64, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !322, file: !226, line: 51, baseType: !330, size: 32, offset: 192)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !278)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !226, line: 25, baseType: !14)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !225, file: !226, line: 591, baseType: !64, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !225, file: !226, line: 592, baseType: !321, size: 64, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !225, file: !226, line: 593, baseType: !335, size: 64, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !225, file: !226, line: 596, baseType: !64, size: 32, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !225, file: !226, line: 597, baseType: !255, size: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !225, file: !226, line: 632, baseType: !339, size: 2880, offset: 1152)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !226, line: 599, size: 2880, elements: !340)
!340 = !{!341, !391}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !339, file: !226, line: 622, baseType: !342, size: 1728)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !339, file: !226, line: 601, size: 1728, elements: !343)
!343 = !{!344, !345, !346, !350, !362, !363, !365, !373, !374, !375, !376, !380, !384, !385, !386, !387, !388, !389, !390}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !342, file: !226, line: 603, baseType: !14, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !342, file: !226, line: 604, baseType: !255, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !342, file: !226, line: 605, baseType: !347, size: 208, offset: 128)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 208, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 26)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !342, file: !226, line: 606, baseType: !351, size: 288, offset: 352)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !226, line: 55, size: 288, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !351, file: !226, line: 57, baseType: !64, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !351, file: !226, line: 58, baseType: !64, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !351, file: !226, line: 59, baseType: !64, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !351, file: !226, line: 60, baseType: !64, size: 32, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !351, file: !226, line: 61, baseType: !64, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !351, file: !226, line: 62, baseType: !64, size: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !351, file: !226, line: 63, baseType: !64, size: 32, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !351, file: !226, line: 64, baseType: !64, size: 32, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !351, file: !226, line: 65, baseType: !64, size: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !342, file: !226, line: 607, baseType: !64, size: 32, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !342, file: !226, line: 608, baseType: !364, size: 64, offset: 704)
!364 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !342, file: !226, line: 609, baseType: !366, size: 112, offset: 768)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !226, line: 319, size: 112, elements: !367)
!367 = !{!368, !371, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !366, file: !226, line: 320, baseType: !369, size: 48)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 48, elements: !274)
!370 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !366, file: !226, line: 321, baseType: !369, size: 48, offset: 48)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !366, file: !226, line: 322, baseType: !370, size: 16, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !342, file: !226, line: 610, baseType: !290, size: 64, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !342, file: !226, line: 611, baseType: !290, size: 64, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !342, file: !226, line: 612, baseType: !290, size: 64, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !342, file: !226, line: 613, baseType: !377, size: 64, offset: 1088)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 8)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !342, file: !226, line: 614, baseType: !381, size: 192, offset: 1152)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 24)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !342, file: !226, line: 615, baseType: !64, size: 32, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !342, file: !226, line: 616, baseType: !290, size: 64, offset: 1376)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !342, file: !226, line: 617, baseType: !290, size: 64, offset: 1440)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !342, file: !226, line: 618, baseType: !290, size: 64, offset: 1504)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !342, file: !226, line: 619, baseType: !290, size: 64, offset: 1568)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !342, file: !226, line: 620, baseType: !290, size: 64, offset: 1632)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !342, file: !226, line: 621, baseType: !64, size: 32, offset: 1696)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !339, file: !226, line: 631, baseType: !392, size: 2880)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !339, file: !226, line: 626, size: 2880, elements: !393)
!393 = !{!394, !398}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !392, file: !226, line: 629, baseType: !395, size: 1920)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 1920, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 30)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !392, file: !226, line: 630, baseType: !399, size: 960, offset: 1920)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 960, elements: !396)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !225, file: !226, line: 636, baseType: !401, size: 64, offset: 4032)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !226, line: 93, size: 6336, elements: !403)
!403 = !{!404, !405, !406, !413}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !402, file: !226, line: 94, baseType: !401, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !402, file: !226, line: 95, baseType: !64, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !402, file: !226, line: 97, baseType: !407, size: 2048, offset: 128)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 2048, elements: !411)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null}
!411 = !{!412}
!412 = !DISubrange(count: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !402, file: !226, line: 98, baseType: !414, size: 4160, offset: 2176)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !226, line: 74, size: 4160, elements: !415)
!415 = !{!416, !418, !419, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !414, file: !226, line: 75, baseType: !417, size: 2048)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !411)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !414, file: !226, line: 76, baseType: !417, size: 2048, offset: 2048)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !414, file: !226, line: 78, baseType: !331, size: 32, offset: 4096)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !414, file: !226, line: 81, baseType: !331, size: 32, offset: 4128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !225, file: !226, line: 637, baseType: !402, size: 6336, offset: 4096)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !225, file: !226, line: 641, baseType: !423, size: 64, offset: 10432)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !64}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !225, file: !226, line: 646, baseType: !428, size: 192, offset: 10496)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !226, line: 291, size: 192, elements: !429)
!429 = !{!430, !432, !433}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !428, file: !226, line: 293, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !428, file: !226, line: 294, baseType: !64, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !428, file: !226, line: 295, baseType: !230, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !225, file: !226, line: 648, baseType: !435, size: 4224, offset: 10688)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 4224, elements: !274)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !29, file: !30, line: 85, baseType: !437, size: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !13, line: 114, size: 640, elements: !439)
!439 = !{!440, !444, !445, !452, !465}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !438, file: !13, line: 116, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !442, line: 64, baseType: !443)
!442 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !442, line: 63, baseType: !99)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !438, file: !13, line: 118, baseType: !441, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !438, file: !13, line: 120, baseType: !446, size: 128, offset: 128)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !447, line: 51, size: 128, elements: !448)
!447 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!448 = !{!449, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !447, line: 52, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !446, file: !447, line: 53, baseType: !450, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !438, file: !13, line: 122, baseType: !453, size: 256, offset: 256)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !13, line: 98, size: 256, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !453, file: !13, line: 107, baseType: !12, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !453, file: !13, line: 109, baseType: !441, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !453, file: !13, line: 111, baseType: !458, size: 96, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !442, line: 72, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 68, size: 96, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !459, file: !442, line: 69, baseType: !64, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !459, file: !442, line: 70, baseType: !64, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !459, file: !442, line: 71, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !442, line: 61, baseType: !64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !438, file: !13, line: 124, baseType: !446, size: 128, offset: 512)
!466 = !{!0, !467}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 112, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 14)
!472 = !{!473, !474}
!473 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!474 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !476, line: 46, baseType: !477)
!476 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !478, line: 51, baseType: !479)
!478 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 192, elements: !278)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !481, file: !10, line: 196, baseType: !14, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !481, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !481, file: !10, line: 196, baseType: !34, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !481, file: !10, line: 196, baseType: !34, size: 64, offset: 128)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 20)
!490 = !{i32 2, !"Dwarf Version", i32 4}
!491 = !{i32 2, !"Debug Info Version", i32 3}
!492 = !{i32 1, !"wchar_size", i32 4}
!493 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!494 = distinct !DISubprogram(name: "sched_yield", scope: !10, file: !10, line: 57, type: !495, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{!64}
!497 = !{}
!498 = !DILocation(line: 120, column: 2, scope: !499, inlinedAt: !505)
!499 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !500, file: !500, line: 116, type: !501, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !503)
!500 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!501 = !DISubroutineType(types: !502)
!502 = !{!99}
!503 = !{!504}
!504 = !DILocalVariable(name: "sp", scope: !499, file: !500, line: 118, type: !99)
!505 = distinct !DILocation(line: 154, column: 21, scope: !506, inlinedAt: !512)
!506 = distinct !DISubprogram(name: "uk_thread_current", scope: !30, file: !30, line: 151, type: !507, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!28}
!509 = !{!510, !511}
!510 = !DILocalVariable(name: "current", scope: !506, file: !30, line: 153, type: !27)
!511 = !DILocalVariable(name: "sp", scope: !506, file: !30, line: 154, type: !99)
!512 = distinct !DILocation(line: 117, column: 30, scope: !513, inlinedAt: !517)
!513 = distinct !DISubprogram(name: "uk_sched_yield", scope: !75, file: !75, line: 114, type: !409, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !514)
!514 = !{!515, !516}
!515 = !DILocalVariable(name: "s", scope: !513, file: !75, line: 116, type: !73)
!516 = !DILocalVariable(name: "current", scope: !513, file: !75, line: 117, type: !28)
!517 = distinct !DILocation(line: 244, column: 2, scope: !518, inlinedAt: !520)
!518 = distinct !DISubprogram(name: "pte_osYield", scope: !519, file: !519, line: 242, type: !409, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !497)
!519 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_generic_osal.h", directory: "/root/.unikraft/apps/redis/build")
!520 = distinct !DILocation(line: 86, column: 3, scope: !494)
!521 = !{i32 526077}
!522 = !DILocation(line: 118, column: 16, scope: !499, inlinedAt: !505)
!523 = !DILocation(line: 121, column: 2, scope: !499, inlinedAt: !505)
!524 = !DILocation(line: 154, column: 16, scope: !506, inlinedAt: !512)
!525 = !DILocation(line: 156, column: 38, scope: !506, inlinedAt: !512)
!526 = !DILocation(line: 156, column: 12, scope: !506, inlinedAt: !512)
!527 = !DILocation(line: 153, column: 21, scope: !506, inlinedAt: !512)
!528 = !DILocation(line: 158, column: 9, scope: !506, inlinedAt: !512)
!529 = !{!530, !530, i64 0}
!530 = !{!"any pointer", !531, i64 0}
!531 = !{!"omnipotent char", !532, i64 0}
!532 = !{!"Simple C/C++ TBAA"}
!533 = !DILocation(line: 158, column: 2, scope: !506, inlinedAt: !512)
!534 = !DILocation(line: 117, column: 20, scope: !513, inlinedAt: !517)
!535 = !DILocation(line: 119, column: 2, scope: !536, inlinedAt: !517)
!536 = distinct !DILexicalBlock(scope: !537, file: !75, line: 119, column: 2)
!537 = distinct !DILexicalBlock(scope: !513, file: !75, line: 119, column: 2)
