; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_post.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_post.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sem_t_ = type { i32, %struct.pthread_mutex_t_*, %struct.uk_semaphore* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.pte_handle_t = type { i8*, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_post.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pte_osResult", file: !11, line: 38, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_generic_osal.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "PTE_OS_OK", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PTE_OS_NO_RESOURCES", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PTE_OS_GENERAL_FAILURE", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PTE_OS_TIMEOUT", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PTE_OS_INTERRUPTED", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PTE_OS_INVALID_PARAM", value: 5, isUnsigned: true)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !{i32 2, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!25 = distinct !DISubprogram(name: "sem_post", scope: !1, file: !1, line: 59, type: !26, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !503)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29}
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !31, line: 78, baseType: !32)
!31 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_t_", file: !34, line: 136, size: 192, elements: !35)
!34 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !{!36, !37, !502}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !33, file: !34, line: 138, baseType: !28, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !33, file: !34, line: 139, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !39, line: 417, baseType: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !34, line: 146, size: 320, elements: !42)
!42 = !{!43, !492, !493, !494, !495}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !41, file: !34, line: 148, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !45, line: 12, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !48, line: 51, size: 192, elements: !49)
!48 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !{!50, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !47, file: !48, line: 52, baseType: !51, size: 64)
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !47, file: !48, line: 53, baseType: !53, size: 128, offset: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !54, line: 42, size: 128, elements: !55)
!54 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !{!56, !490}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !53, file: !54, line: 42, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !54, line: 35, size: 192, elements: !59)
!59 = !{!60, !61, !486}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !58, file: !54, line: 36, baseType: !28, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !58, file: !54, line: 37, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !64, line: 59, size: 1024, elements: !65)
!64 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!65 = !{!66, !70, !71, !72, !73, !79, !84, !89, !91, !92, !241, !242, !243, !456}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !64, line: 60, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !63, file: !64, line: 61, baseType: !20, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !63, file: !64, line: 62, baseType: !20, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !63, file: !64, line: 63, baseType: !20, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !63, file: !64, line: 64, baseType: !74, size: 128, offset: 256)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !64, line: 64, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !74, file: !64, line: 64, baseType: !62, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !74, file: !64, line: 64, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !64, line: 65, baseType: !80, size: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !81, line: 48, baseType: !82)
!81 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !83, line: 79, baseType: !5)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !63, file: !64, line: 66, baseType: !85, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !86, line: 49, baseType: !87)
!86 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !88, line: 128, baseType: !51)
!88 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !63, file: !64, line: 67, baseType: !90, size: 8, offset: 512)
!90 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !63, file: !64, line: 68, baseType: !53, size: 128, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !63, file: !64, line: 69, baseType: !93, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !95, line: 90, size: 2176, elements: !96)
!95 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !{!97, !102, !120, !125, !127, !129, !134, !142, !147, !153, !154, !155, !160, !238, !239, !240}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !94, file: !95, line: 91, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !95, line: 68, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !93}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !94, file: !95, line: 93, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !95, line: 71, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!28, !93, !62, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !110, line: 62, baseType: !111)
!110 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !110, line: 55, size: 128, elements: !112)
!112 = !{!113, !114, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !111, file: !110, line: 57, baseType: !90, size: 8)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !111, file: !110, line: 59, baseType: !115, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !110, line: 53, baseType: !28)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !111, file: !110, line: 61, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !86, line: 48, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !88, line: 129, baseType: !119)
!119 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !94, file: !95, line: 94, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !95, line: 74, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !93, !62}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !94, file: !95, line: 95, baseType: !126, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !95, line: 76, baseType: !122)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !94, file: !95, line: 96, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !95, line: 78, baseType: !122)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !94, file: !95, line: 98, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !95, line: 81, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!28, !93, !62, !115}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !94, file: !95, line: 99, baseType: !135, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !95, line: 83, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!28, !93, !139, !141}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !94, file: !95, line: 100, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !95, line: 85, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!28, !93, !62, !28}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !94, file: !95, line: 101, baseType: !148, size: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !95, line: 87, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!28, !93, !139, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !94, file: !95, line: 104, baseType: !90, size: 8, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !94, file: !95, line: 105, baseType: !63, size: 1024, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !94, file: !95, line: 106, baseType: !156, size: 128, offset: 1664)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !64, line: 93, size: 128, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !156, file: !64, line: 93, baseType: !62, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !156, file: !64, line: 93, baseType: !78, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !94, file: !95, line: 107, baseType: !161, size: 192, offset: 1792)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !162, line: 59, size: 192, elements: !163)
!162 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!163 = !{!164, !229, !233}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !161, file: !162, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !162, line: 51, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!20, !169, !119, !119}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !171, line: 77, size: 832, elements: !172)
!171 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!172 = !{!173, !180, !185, !190, !196, !198, !203, !204, !205, !210, !215, !220, !221, !222}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !170, file: !171, line: 79, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !171, line: 54, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!20, !169, !178}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 58, baseType: !119)
!179 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !170, file: !171, line: 80, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !171, line: 56, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!20, !169, !178, !178}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !170, file: !171, line: 81, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !171, line: 62, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!20, !169, !20, !178}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !170, file: !171, line: 82, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !171, line: 58, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!28, !169, !195, !178, !178}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !170, file: !171, line: 83, baseType: !197, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !171, line: 60, baseType: !182)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !170, file: !171, line: 84, baseType: !199, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !171, line: 64, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !169, !20}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !170, file: !171, line: 87, baseType: !199, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !170, file: !171, line: 88, baseType: !174, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !170, file: !171, line: 92, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !171, line: 66, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!20, !169, !119}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !170, file: !171, line: 93, baseType: !211, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !171, line: 68, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !169, !20, !119}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !170, file: !171, line: 99, baseType: !216, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !171, line: 70, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!28, !169, !20, !178}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !170, file: !171, line: 100, baseType: !178, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !171, line: 103, baseType: !169, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !170, file: !171, line: 104, baseType: !223, offset: 832)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, elements: !227)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !81, line: 20, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !83, line: 41, baseType: !226)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !{!228}
!228 = !DISubrange(count: -1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !161, file: !162, line: 63, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !20}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !161, file: !162, line: 65, baseType: !234, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !162, line: 56, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !20, !20}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !94, file: !95, line: 108, baseType: !169, size: 64, offset: 1984)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !95, line: 109, baseType: !93, size: 64, offset: 2048)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !94, file: !95, line: 110, baseType: !20, size: 64, offset: 2112)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !63, file: !64, line: 70, baseType: !20, size: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !63, file: !64, line: 72, baseType: !28, size: 32, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !63, file: !64, line: 82, baseType: !244, size: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !246, line: 569, size: 14912, elements: !247)
!246 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!247 = !{!248, !249, !324, !325, !326, !327, !331, !332, !335, !336, !340, !352, !353, !354, !356, !357, !358, !420, !441, !442, !447, !454}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !245, file: !246, line: 571, baseType: !28, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !245, file: !246, line: 576, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !246, line: 287, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !246, line: 181, size: 1408, elements: !253)
!253 = !{!254, !257, !258, !259, !261, !262, !267, !268, !269, !276, !280, !285, !289, !290, !291, !292, !296, !300, !301, !302, !304, !305, !309, !323}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !252, file: !246, line: 182, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !252, file: !246, line: 183, baseType: !28, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !252, file: !246, line: 184, baseType: !28, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !252, file: !246, line: 185, baseType: !260, size: 16, offset: 128)
!260 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !252, file: !246, line: 186, baseType: !260, size: 16, offset: 144)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !252, file: !246, line: 187, baseType: !263, size: 128, offset: 192)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !246, line: 117, size: 128, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !263, file: !246, line: 118, baseType: !255, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !263, file: !246, line: 119, baseType: !28, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !252, file: !246, line: 188, baseType: !28, size: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !252, file: !246, line: 195, baseType: !20, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !252, file: !246, line: 197, baseType: !270, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !244, !20, !275, !28}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !274, line: 145, baseType: !51)
!274 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !252, file: !246, line: 199, baseType: !277, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!273, !244, !20, !67, !28}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !252, file: !246, line: 202, baseType: !281, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !244, !20, !284, !28}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !274, line: 114, baseType: !51)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !252, file: !246, line: 203, baseType: !286, size: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!28, !244, !20}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !252, file: !246, line: 206, baseType: !263, size: 128, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !252, file: !246, line: 207, baseType: !255, size: 64, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !252, file: !246, line: 208, baseType: !28, size: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !252, file: !246, line: 211, baseType: !293, size: 24, offset: 928)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 24, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 3)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !252, file: !246, line: 212, baseType: !297, size: 8, offset: 952)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 8, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 1)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !252, file: !246, line: 215, baseType: !263, size: 128, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !252, file: !246, line: 218, baseType: !28, size: 32, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !252, file: !246, line: 219, baseType: !303, size: 64, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !274, line: 44, baseType: !51)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !252, file: !246, line: 222, baseType: !244, size: 64, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !252, file: !246, line: 226, baseType: !306, size: 32, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !274, line: 175, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !308, line: 12, baseType: !28)
!308 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !252, file: !246, line: 228, baseType: !310, size: 64, offset: 1312)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !274, line: 171, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !274, line: 163, size: 64, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !311, file: !274, line: 165, baseType: !28, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !311, file: !274, line: 170, baseType: !315, size: 32, offset: 32)
!315 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !311, file: !274, line: 166, size: 32, elements: !316)
!316 = !{!317, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !315, file: !274, line: 168, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !179, line: 124, baseType: !5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !315, file: !274, line: 169, baseType: !320, size: 32)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 32, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 4)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !252, file: !246, line: 229, baseType: !28, size: 32, offset: 1376)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !245, file: !246, line: 576, baseType: !250, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !245, file: !246, line: 576, baseType: !250, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !245, file: !246, line: 578, baseType: !28, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !245, file: !246, line: 579, baseType: !328, size: 200, offset: 288)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 200, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 25)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !245, file: !246, line: 582, baseType: !28, size: 32, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !245, file: !246, line: 583, baseType: !333, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !246, line: 40, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !245, file: !246, line: 585, baseType: !28, size: 32, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !245, file: !246, line: 587, baseType: !337, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !244}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !245, file: !246, line: 590, baseType: !341, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !246, line: 47, size: 256, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !342, file: !246, line: 49, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !342, file: !246, line: 50, baseType: !28, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !342, file: !246, line: 50, baseType: !28, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !342, file: !246, line: 50, baseType: !28, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !342, file: !246, line: 50, baseType: !28, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !342, file: !246, line: 51, baseType: !350, size: 32, offset: 192)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 32, elements: !298)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !246, line: 25, baseType: !5)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !245, file: !246, line: 591, baseType: !28, size: 32, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !245, file: !246, line: 592, baseType: !341, size: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !245, file: !246, line: 593, baseType: !355, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !245, file: !246, line: 596, baseType: !28, size: 32, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !245, file: !246, line: 597, baseType: !275, size: 64, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !245, file: !246, line: 632, baseType: !359, size: 2880, offset: 1152)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !246, line: 599, size: 2880, elements: !360)
!360 = !{!361, !411}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !359, file: !246, line: 622, baseType: !362, size: 1728)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !246, line: 601, size: 1728, elements: !363)
!363 = !{!364, !365, !366, !370, !382, !383, !385, !393, !394, !395, !396, !400, !404, !405, !406, !407, !408, !409, !410}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !362, file: !246, line: 603, baseType: !5, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !362, file: !246, line: 604, baseType: !275, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !362, file: !246, line: 605, baseType: !367, size: 208, offset: 128)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 208, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 26)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !362, file: !246, line: 606, baseType: !371, size: 288, offset: 352)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !246, line: 55, size: 288, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !371, file: !246, line: 57, baseType: !28, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !371, file: !246, line: 58, baseType: !28, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !371, file: !246, line: 59, baseType: !28, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !371, file: !246, line: 60, baseType: !28, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !371, file: !246, line: 61, baseType: !28, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !371, file: !246, line: 62, baseType: !28, size: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !371, file: !246, line: 63, baseType: !28, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !371, file: !246, line: 64, baseType: !28, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !371, file: !246, line: 65, baseType: !28, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !362, file: !246, line: 607, baseType: !28, size: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !362, file: !246, line: 608, baseType: !384, size: 64, offset: 704)
!384 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !362, file: !246, line: 609, baseType: !386, size: 112, offset: 768)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !246, line: 319, size: 112, elements: !387)
!387 = !{!388, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !386, file: !246, line: 320, baseType: !389, size: 48)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 48, elements: !294)
!390 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !386, file: !246, line: 321, baseType: !389, size: 48, offset: 48)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !386, file: !246, line: 322, baseType: !390, size: 16, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !362, file: !246, line: 610, baseType: !310, size: 64, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !362, file: !246, line: 611, baseType: !310, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !362, file: !246, line: 612, baseType: !310, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !362, file: !246, line: 613, baseType: !397, size: 64, offset: 1088)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !362, file: !246, line: 614, baseType: !401, size: 192, offset: 1152)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 192, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 24)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !362, file: !246, line: 615, baseType: !28, size: 32, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !362, file: !246, line: 616, baseType: !310, size: 64, offset: 1376)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !362, file: !246, line: 617, baseType: !310, size: 64, offset: 1440)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !362, file: !246, line: 618, baseType: !310, size: 64, offset: 1504)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !362, file: !246, line: 619, baseType: !310, size: 64, offset: 1568)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !362, file: !246, line: 620, baseType: !310, size: 64, offset: 1632)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !362, file: !246, line: 621, baseType: !28, size: 32, offset: 1696)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !359, file: !246, line: 631, baseType: !412, size: 2880)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !246, line: 626, size: 2880, elements: !413)
!413 = !{!414, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !412, file: !246, line: 629, baseType: !415, size: 1920)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 1920, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 30)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !412, file: !246, line: 630, baseType: !419, size: 960, offset: 1920)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !416)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !245, file: !246, line: 636, baseType: !421, size: 64, offset: 4032)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !246, line: 93, size: 6336, elements: !423)
!423 = !{!424, !425, !426, !433}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !422, file: !246, line: 94, baseType: !421, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !422, file: !246, line: 95, baseType: !28, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !422, file: !246, line: 97, baseType: !427, size: 2048, offset: 128)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 2048, elements: !431)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null}
!431 = !{!432}
!432 = !DISubrange(count: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !422, file: !246, line: 98, baseType: !434, size: 4160, offset: 2176)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !246, line: 74, size: 4160, elements: !435)
!435 = !{!436, !438, !439, !440}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !434, file: !246, line: 75, baseType: !437, size: 2048)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !431)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !434, file: !246, line: 76, baseType: !437, size: 2048, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !434, file: !246, line: 78, baseType: !351, size: 32, offset: 4096)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !434, file: !246, line: 81, baseType: !351, size: 32, offset: 4128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !245, file: !246, line: 637, baseType: !422, size: 6336, offset: 4096)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !245, file: !246, line: 641, baseType: !443, size: 64, offset: 10432)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !28}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !245, file: !246, line: 646, baseType: !448, size: 192, offset: 10496)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !246, line: 291, size: 192, elements: !449)
!449 = !{!450, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !448, file: !246, line: 293, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !448, file: !246, line: 294, baseType: !28, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !448, file: !246, line: 295, baseType: !250, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !245, file: !246, line: 648, baseType: !455, size: 4224, offset: 10688)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 4224, elements: !294)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !63, file: !64, line: 85, baseType: !457, size: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !459)
!459 = !{!460, !464, !465, !472, !485}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !458, file: !4, line: 116, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !462, line: 64, baseType: !463)
!462 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !462, line: 63, baseType: !119)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !458, file: !4, line: 118, baseType: !461, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !458, file: !4, line: 120, baseType: !466, size: 128, offset: 128)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !467, line: 51, size: 128, elements: !468)
!467 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!468 = !{!469, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !467, line: 52, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !466, file: !467, line: 53, baseType: !470, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !458, file: !4, line: 122, baseType: !473, size: 256, offset: 256)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !473, file: !4, line: 107, baseType: !3, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !473, file: !4, line: 109, baseType: !461, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !473, file: !4, line: 111, baseType: !478, size: 96, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !462, line: 72, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 68, size: 96, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !479, file: !462, line: 69, baseType: !28, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !479, file: !462, line: 70, baseType: !28, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !479, file: !462, line: 71, baseType: !484, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !462, line: 61, baseType: !28)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !458, file: !4, line: 124, baseType: !466, size: 128, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !58, file: !54, line: 38, baseType: !487, size: 64, offset: 128)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !58, file: !54, line: 38, size: 64, elements: !488)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !487, file: !54, line: 38, baseType: !57, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !53, file: !54, line: 42, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !41, file: !34, line: 149, baseType: !28, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !41, file: !34, line: 156, baseType: !28, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !41, file: !34, line: 159, baseType: !28, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !41, file: !34, line: 160, baseType: !496, size: 128, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !39, line: 413, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !39, line: 411, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 395, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !498, file: !39, line: 398, baseType: !20, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !498, file: !39, line: 399, baseType: !5, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !33, file: !34, line: 140, baseType: !44, size: 64, offset: 128)
!503 = !{!504, !505, !506, !507}
!504 = !DILocalVariable(name: "sem", arg: 1, scope: !25, file: !1, line: 59, type: !29)
!505 = !DILocalVariable(name: "result", scope: !25, file: !1, line: 85, type: !28)
!506 = !DILocalVariable(name: "s", scope: !25, file: !1, line: 86, type: !30)
!507 = !DILocalVariable(name: "osResult", scope: !508, file: !1, line: 105, type: !513)
!508 = distinct !DILexicalBlock(scope: !509, file: !1, line: 104, column: 9)
!509 = distinct !DILexicalBlock(scope: !510, file: !1, line: 103, column: 11)
!510 = distinct !DILexicalBlock(scope: !511, file: !1, line: 93, column: 5)
!511 = distinct !DILexicalBlock(scope: !512, file: !1, line: 92, column: 12)
!512 = distinct !DILexicalBlock(scope: !25, file: !1, line: 88, column: 7)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osResult", file: !11, line: 60, baseType: !10)
!514 = !DILocation(line: 59, column: 19, scope: !25)
!515 = !DILocation(line: 85, column: 7, scope: !25)
!516 = !DILocation(line: 86, column: 13, scope: !25)
!517 = !{!518, !518, i64 0}
!518 = !{!"any pointer", !519, i64 0}
!519 = !{!"omnipotent char", !520, i64 0}
!520 = !{!"Simple C/C++ TBAA"}
!521 = !DILocation(line: 86, column: 9, scope: !25)
!522 = !DILocation(line: 88, column: 9, scope: !512)
!523 = !DILocation(line: 88, column: 7, scope: !25)
!524 = !DILocation(line: 91, column: 5, scope: !525)
!525 = distinct !DILexicalBlock(scope: !512, file: !1, line: 89, column: 5)
!526 = !DILocation(line: 92, column: 46, scope: !511)
!527 = !DILocation(line: 92, column: 22, scope: !511)
!528 = !DILocation(line: 92, column: 53, scope: !511)
!529 = !DILocation(line: 92, column: 12, scope: !512)
!530 = !DILocation(line: 96, column: 11, scope: !531)
!531 = distinct !DILexicalBlock(scope: !510, file: !1, line: 96, column: 11)
!532 = !DILocation(line: 96, column: 16, scope: !531)
!533 = !DILocation(line: 96, column: 11, scope: !510)
!534 = !DILocation(line: 98, column: 18, scope: !535)
!535 = distinct !DILexicalBlock(scope: !531, file: !1, line: 97, column: 9)
!536 = !DILocation(line: 100, column: 11, scope: !535)
!537 = !DILocation(line: 103, column: 14, scope: !509)
!538 = !{!539, !540, i64 0}
!539 = !{!"sem_t_", !540, i64 0, !518, i64 8, !518, i64 16}
!540 = !{!"int", !519, i64 0}
!541 = !DILocation(line: 103, column: 20, scope: !509)
!542 = !DILocation(line: 103, column: 11, scope: !510)
!543 = !DILocation(line: 105, column: 58, scope: !508)
!544 = !{!539, !518, i64 16}
!545 = !DILocation(line: 105, column: 35, scope: !508)
!546 = !DILocation(line: 105, column: 24, scope: !508)
!547 = !DILocation(line: 107, column: 15, scope: !548)
!548 = distinct !DILexicalBlock(scope: !508, file: !1, line: 107, column: 15)
!549 = !DILocation(line: 107, column: 26, scope: !548)
!550 = !DILocation(line: 108, column: 28, scope: !548)
!551 = !DILocation(line: 108, column: 15, scope: !548)
!552 = !DILocation(line: 110, column: 23, scope: !553)
!553 = distinct !DILexicalBlock(scope: !548, file: !1, line: 109, column: 13)
!554 = !DILocation(line: 112, column: 13, scope: !553)
!555 = !DILocation(line: 123, column: 7, scope: !25)
!556 = !DILocation(line: 0, scope: !557)
!557 = distinct !DILexicalBlock(scope: !509, file: !1, line: 116, column: 9)
!558 = !DILocation(line: 120, column: 14, scope: !510)
!559 = !DILocation(line: 121, column: 5, scope: !510)
!560 = !DILocation(line: 123, column: 14, scope: !561)
!561 = distinct !DILexicalBlock(scope: !25, file: !1, line: 123, column: 7)
!562 = !DILocation(line: 125, column: 7, scope: !563)
!563 = distinct !DILexicalBlock(scope: !561, file: !1, line: 124, column: 5)
!564 = !DILocation(line: 125, column: 13, scope: !563)
!565 = !{!540, !540, i64 0}
!566 = !DILocation(line: 126, column: 7, scope: !563)
!567 = !DILocation(line: 0, scope: !535)
!568 = !DILocation(line: 131, column: 1, scope: !25)
