; ModuleID = '/root/.unikraft/libs/lwip/semaphore.c'
source_filename = "/root/.unikraft/libs/lwip/semaphore.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }
%struct.uk_thread_list = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.ukplat_ctx_callbacks = type { i8* (%struct.uk_alloc*, i64, i64)*, void (i8*)*, void (i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 102, type: !506, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "sys_arch_sem_wait", scope: !3, file: !3, line: 97, type: !4, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !469, retainedNodes: !533)
!3 = !DIFile(filename: "/root/.unikraft/libs/lwip/semaphore.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13, !6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !7, line: 129, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 48, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !11, line: 79, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sem_t", file: !15, line: 72, baseType: !16)
!15 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/sys_arch.h", directory: "/root/.unikraft/apps/redis/build")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 69, size: 256, elements: !17)
!17 = !{!18, !468}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !16, file: !15, line: 70, baseType: !19, size: 192)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !20, line: 51, size: 192, elements: !21)
!20 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !{!22, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !19, file: !20, line: 52, baseType: !23, size: 64)
!23 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !19, file: !20, line: 53, baseType: !25, size: 128, offset: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !26, line: 42, size: 128, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !466}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !25, file: !26, line: 42, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !26, line: 35, size: 192, elements: !31)
!31 = !{!32, !34, !462}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !30, file: !26, line: 36, baseType: !33, size: 32)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !30, file: !26, line: 37, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !37, line: 59, size: 1024, elements: !38)
!37 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!38 = !{!39, !43, !45, !46, !47, !53, !54, !59, !61, !62, !211, !212, !213, !426}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !37, line: 60, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !36, file: !37, line: 61, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !36, file: !37, line: 62, baseType: !44, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !36, file: !37, line: 63, baseType: !44, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !36, file: !37, line: 64, baseType: !48, size: 128, offset: 256)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !36, file: !37, line: 64, size: 128, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !48, file: !37, line: 64, baseType: !35, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !48, file: !37, line: 64, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !37, line: 65, baseType: !8, size: 32, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !36, file: !37, line: 66, baseType: !55, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !56, line: 49, baseType: !57)
!56 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !58, line: 128, baseType: !23)
!58 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !36, file: !37, line: 67, baseType: !60, size: 8, offset: 512)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !36, file: !37, line: 68, baseType: !25, size: 128, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !36, file: !37, line: 69, baseType: !63, size: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !65, line: 90, size: 2176, elements: !66)
!65 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !{!67, !72, !90, !95, !97, !99, !104, !112, !117, !123, !124, !125, !130, !208, !209, !210}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !64, file: !65, line: 91, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !65, line: 68, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !63}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !64, file: !65, line: 93, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !65, line: 71, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!33, !63, !35, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !80, line: 62, baseType: !81)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !80, line: 55, size: 128, elements: !82)
!82 = !{!83, !84, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !81, file: !80, line: 57, baseType: !60, size: 8)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !81, file: !80, line: 59, baseType: !85, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !80, line: 53, baseType: !33)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !81, file: !80, line: 61, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !56, line: 48, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !58, line: 129, baseType: !89)
!89 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !64, file: !65, line: 94, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !65, line: 74, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !63, !35}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !64, file: !65, line: 95, baseType: !96, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !65, line: 76, baseType: !92)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !64, file: !65, line: 96, baseType: !98, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !65, line: 78, baseType: !92)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !64, file: !65, line: 98, baseType: !100, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !65, line: 81, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!33, !63, !35, !85}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !64, file: !65, line: 99, baseType: !105, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !65, line: 83, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!33, !63, !109, !111}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !64, file: !65, line: 100, baseType: !113, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !65, line: 85, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!33, !63, !35, !33}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !64, file: !65, line: 101, baseType: !118, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !65, line: 87, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!33, !63, !109, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !64, file: !65, line: 104, baseType: !60, size: 8, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !64, file: !65, line: 105, baseType: !36, size: 1024, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !64, file: !65, line: 106, baseType: !126, size: 128, offset: 1664)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !37, line: 93, size: 128, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !126, file: !37, line: 93, baseType: !35, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !126, file: !37, line: 93, baseType: !52, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !64, file: !65, line: 107, baseType: !131, size: 192, offset: 1792)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !132, line: 59, size: 192, elements: !133)
!132 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!133 = !{!134, !199, !203}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !131, file: !132, line: 61, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !132, line: 51, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!44, !139, !89, !89}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !141, line: 77, size: 832, elements: !142)
!141 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!142 = !{!143, !150, !155, !160, !166, !168, !173, !174, !175, !180, !185, !190, !191, !192}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !140, file: !141, line: 79, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !141, line: 54, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!44, !139, !148}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !149, line: 58, baseType: !89)
!149 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !140, file: !141, line: 80, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !141, line: 56, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!44, !139, !148, !148}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !140, file: !141, line: 81, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !141, line: 62, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!44, !139, !44, !148}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !140, file: !141, line: 82, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !141, line: 58, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!33, !139, !165, !148, !148}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !140, file: !141, line: 83, baseType: !167, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !141, line: 60, baseType: !152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !140, file: !141, line: 84, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !141, line: 64, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !139, !44}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !140, file: !141, line: 87, baseType: !169, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !140, file: !141, line: 88, baseType: !144, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !140, file: !141, line: 92, baseType: !176, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !141, line: 66, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!44, !139, !89}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !140, file: !141, line: 93, baseType: !181, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !141, line: 68, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !139, !44, !89}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !140, file: !141, line: 99, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !141, line: 70, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!33, !139, !44, !148}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !141, line: 100, baseType: !148, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !141, line: 103, baseType: !139, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !140, file: !141, line: 104, baseType: !193, offset: 832)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, elements: !197)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !9, line: 20, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !11, line: 41, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !{!198}
!198 = !DISubrange(count: -1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !131, file: !132, line: 63, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !44}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !131, file: !132, line: 65, baseType: !204, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !132, line: 56, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !44, !44}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !64, file: !65, line: 108, baseType: !139, size: 64, offset: 1984)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !65, line: 109, baseType: !63, size: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !64, file: !65, line: 110, baseType: !44, size: 64, offset: 2112)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !36, file: !37, line: 70, baseType: !44, size: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !36, file: !37, line: 72, baseType: !33, size: 32, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !36, file: !37, line: 82, baseType: !214, size: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !216, line: 569, size: 14912, elements: !217)
!216 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!217 = !{!218, !219, !294, !295, !296, !297, !301, !302, !305, !306, !310, !322, !323, !324, !326, !327, !328, !390, !411, !412, !417, !424}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !215, file: !216, line: 571, baseType: !33, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !215, file: !216, line: 576, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !216, line: 287, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !216, line: 181, size: 1408, elements: !223)
!223 = !{!224, !227, !228, !229, !231, !232, !237, !238, !239, !246, !250, !255, !259, !260, !261, !262, !266, !270, !271, !272, !274, !275, !279, !293}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !222, file: !216, line: 182, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !222, file: !216, line: 183, baseType: !33, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !222, file: !216, line: 184, baseType: !33, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !222, file: !216, line: 185, baseType: !230, size: 16, offset: 128)
!230 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !222, file: !216, line: 186, baseType: !230, size: 16, offset: 144)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !222, file: !216, line: 187, baseType: !233, size: 128, offset: 192)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !216, line: 117, size: 128, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !233, file: !216, line: 118, baseType: !225, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !233, file: !216, line: 119, baseType: !33, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !222, file: !216, line: 188, baseType: !33, size: 32, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !222, file: !216, line: 195, baseType: !44, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !222, file: !216, line: 197, baseType: !240, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !214, !44, !245, !33}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !244, line: 145, baseType: !23)
!244 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !222, file: !216, line: 199, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!243, !214, !44, !40, !33}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !222, file: !216, line: 202, baseType: !251, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!254, !214, !44, !254, !33}
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !244, line: 114, baseType: !23)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !222, file: !216, line: 203, baseType: !256, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!33, !214, !44}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !222, file: !216, line: 206, baseType: !233, size: 128, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !222, file: !216, line: 207, baseType: !225, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !222, file: !216, line: 208, baseType: !33, size: 32, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !222, file: !216, line: 211, baseType: !263, size: 24, offset: 928)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 24, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 3)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !222, file: !216, line: 212, baseType: !267, size: 8, offset: 952)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 1)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !222, file: !216, line: 215, baseType: !233, size: 128, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !222, file: !216, line: 218, baseType: !33, size: 32, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !222, file: !216, line: 219, baseType: !273, size: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !244, line: 44, baseType: !23)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !222, file: !216, line: 222, baseType: !214, size: 64, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !222, file: !216, line: 226, baseType: !276, size: 32, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !244, line: 175, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !278, line: 12, baseType: !33)
!278 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !222, file: !216, line: 228, baseType: !280, size: 64, offset: 1312)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !244, line: 171, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !244, line: 163, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !281, file: !244, line: 165, baseType: !33, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !281, file: !244, line: 170, baseType: !285, size: 32, offset: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !244, line: 166, size: 32, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !285, file: !244, line: 168, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !149, line: 124, baseType: !12)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !285, file: !244, line: 169, baseType: !290, size: 32)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 4)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !222, file: !216, line: 229, baseType: !33, size: 32, offset: 1376)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !215, file: !216, line: 576, baseType: !220, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !215, file: !216, line: 576, baseType: !220, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !215, file: !216, line: 578, baseType: !33, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !215, file: !216, line: 579, baseType: !298, size: 200, offset: 288)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 200, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 25)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !215, file: !216, line: 582, baseType: !33, size: 32, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !215, file: !216, line: 583, baseType: !303, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !216, line: 40, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !215, file: !216, line: 585, baseType: !33, size: 32, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !215, file: !216, line: 587, baseType: !307, size: 64, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !214}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !215, file: !216, line: 590, baseType: !311, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !216, line: 47, size: 256, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !312, file: !216, line: 49, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !312, file: !216, line: 50, baseType: !33, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !312, file: !216, line: 50, baseType: !33, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !312, file: !216, line: 50, baseType: !33, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !312, file: !216, line: 50, baseType: !33, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !312, file: !216, line: 51, baseType: !320, size: 32, offset: 192)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 32, elements: !268)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !216, line: 25, baseType: !12)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !215, file: !216, line: 591, baseType: !33, size: 32, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !215, file: !216, line: 592, baseType: !311, size: 64, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !215, file: !216, line: 593, baseType: !325, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !215, file: !216, line: 596, baseType: !33, size: 32, offset: 1024)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !215, file: !216, line: 597, baseType: !245, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !215, file: !216, line: 632, baseType: !329, size: 2880, offset: 1152)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !215, file: !216, line: 599, size: 2880, elements: !330)
!330 = !{!331, !381}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !329, file: !216, line: 622, baseType: !332, size: 1728)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !216, line: 601, size: 1728, elements: !333)
!333 = !{!334, !335, !336, !340, !352, !353, !355, !363, !364, !365, !366, !370, !374, !375, !376, !377, !378, !379, !380}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !332, file: !216, line: 603, baseType: !12, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !332, file: !216, line: 604, baseType: !245, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !332, file: !216, line: 605, baseType: !337, size: 208, offset: 128)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 208, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 26)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !332, file: !216, line: 606, baseType: !341, size: 288, offset: 352)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !216, line: 55, size: 288, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !341, file: !216, line: 57, baseType: !33, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !341, file: !216, line: 58, baseType: !33, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !341, file: !216, line: 59, baseType: !33, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !341, file: !216, line: 60, baseType: !33, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !341, file: !216, line: 61, baseType: !33, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !341, file: !216, line: 62, baseType: !33, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !341, file: !216, line: 63, baseType: !33, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !341, file: !216, line: 64, baseType: !33, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !341, file: !216, line: 65, baseType: !33, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !332, file: !216, line: 607, baseType: !33, size: 32, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !332, file: !216, line: 608, baseType: !354, size: 64, offset: 704)
!354 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !332, file: !216, line: 609, baseType: !356, size: 112, offset: 768)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !216, line: 319, size: 112, elements: !357)
!357 = !{!358, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !356, file: !216, line: 320, baseType: !359, size: 48)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 48, elements: !264)
!360 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !356, file: !216, line: 321, baseType: !359, size: 48, offset: 48)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !356, file: !216, line: 322, baseType: !360, size: 16, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !332, file: !216, line: 610, baseType: !280, size: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !332, file: !216, line: 611, baseType: !280, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !332, file: !216, line: 612, baseType: !280, size: 64, offset: 1024)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !332, file: !216, line: 613, baseType: !367, size: 64, offset: 1088)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !332, file: !216, line: 614, baseType: !371, size: 192, offset: 1152)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 192, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 24)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !332, file: !216, line: 615, baseType: !33, size: 32, offset: 1344)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !332, file: !216, line: 616, baseType: !280, size: 64, offset: 1376)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !332, file: !216, line: 617, baseType: !280, size: 64, offset: 1440)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !332, file: !216, line: 618, baseType: !280, size: 64, offset: 1504)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !332, file: !216, line: 619, baseType: !280, size: 64, offset: 1568)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !332, file: !216, line: 620, baseType: !280, size: 64, offset: 1632)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !332, file: !216, line: 621, baseType: !33, size: 32, offset: 1696)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !329, file: !216, line: 631, baseType: !382, size: 2880)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !216, line: 626, size: 2880, elements: !383)
!383 = !{!384, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !382, file: !216, line: 629, baseType: !385, size: 1920)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 1920, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 30)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !382, file: !216, line: 630, baseType: !389, size: 960, offset: 1920)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 960, elements: !386)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !215, file: !216, line: 636, baseType: !391, size: 64, offset: 4032)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !216, line: 93, size: 6336, elements: !393)
!393 = !{!394, !395, !396, !403}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !392, file: !216, line: 94, baseType: !391, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !392, file: !216, line: 95, baseType: !33, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !392, file: !216, line: 97, baseType: !397, size: 2048, offset: 128)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 2048, elements: !401)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null}
!401 = !{!402}
!402 = !DISubrange(count: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !392, file: !216, line: 98, baseType: !404, size: 4160, offset: 2176)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !216, line: 74, size: 4160, elements: !405)
!405 = !{!406, !408, !409, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !404, file: !216, line: 75, baseType: !407, size: 2048)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !401)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !404, file: !216, line: 76, baseType: !407, size: 2048, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !404, file: !216, line: 78, baseType: !321, size: 32, offset: 4096)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !404, file: !216, line: 81, baseType: !321, size: 32, offset: 4128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !215, file: !216, line: 637, baseType: !392, size: 6336, offset: 4096)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !215, file: !216, line: 641, baseType: !413, size: 64, offset: 10432)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !33}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !215, file: !216, line: 646, baseType: !418, size: 192, offset: 10496)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !216, line: 291, size: 192, elements: !419)
!419 = !{!420, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !418, file: !216, line: 293, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !418, file: !216, line: 294, baseType: !33, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !418, file: !216, line: 295, baseType: !220, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !215, file: !216, line: 648, baseType: !425, size: 4224, offset: 10688)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 4224, elements: !264)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !36, file: !37, line: 85, baseType: !427, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !429, line: 114, size: 640, elements: !430)
!429 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!430 = !{!431, !435, !436, !443, !461}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !428, file: !429, line: 116, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !433, line: 64, baseType: !434)
!433 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !433, line: 63, baseType: !89)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !428, file: !429, line: 118, baseType: !432, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !428, file: !429, line: 120, baseType: !437, size: 128, offset: 128)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !438, line: 51, size: 128, elements: !439)
!438 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!439 = !{!440, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !438, line: 52, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !438, line: 53, baseType: !441, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !428, file: !429, line: 122, baseType: !444, size: 256, offset: 256)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !429, line: 98, size: 256, elements: !445)
!445 = !{!446, !452, !453}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !444, file: !429, line: 107, baseType: !447, size: 32)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !429, line: 92, baseType: !12, size: 32, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!450 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !444, file: !429, line: 109, baseType: !432, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !444, file: !429, line: 111, baseType: !454, size: 96, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !433, line: 72, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 68, size: 96, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !455, file: !433, line: 69, baseType: !33, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !455, file: !433, line: 70, baseType: !33, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !455, file: !433, line: 71, baseType: !460, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !433, line: 61, baseType: !33)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !428, file: !429, line: 124, baseType: !437, size: 128, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !30, file: !26, line: 38, baseType: !463, size: 64, offset: 128)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !30, file: !26, line: 38, size: 64, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !463, file: !26, line: 38, baseType: !29, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !25, file: !26, line: 42, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !16, file: !15, line: 71, baseType: !33, size: 32, offset: 192)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !498, globals: !503)
!470 = !{!447, !471, !491}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !472, line: 53, baseType: !33, size: 32, elements: !473)
!472 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!474 = !DIEnumerator(name: "ERR_OK", value: 0)
!475 = !DIEnumerator(name: "ERR_MEM", value: -1)
!476 = !DIEnumerator(name: "ERR_BUF", value: -2)
!477 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!478 = !DIEnumerator(name: "ERR_RTE", value: -4)
!479 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!480 = !DIEnumerator(name: "ERR_VAL", value: -6)
!481 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!482 = !DIEnumerator(name: "ERR_USE", value: -8)
!483 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!484 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!485 = !DIEnumerator(name: "ERR_CONN", value: -11)
!486 = !DIEnumerator(name: "ERR_IF", value: -12)
!487 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!488 = !DIEnumerator(name: "ERR_RST", value: -14)
!489 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!490 = !DIEnumerator(name: "ERR_ARG", value: -16)
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !492, line: 68, baseType: !12, size: 32, elements: !493)
!492 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!493 = !{!494, !495, !496, !497}
!494 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!495 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!496 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!497 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!498 = !{!89, !23, !499, !501, !87, !6, !122, !52}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 60, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !11, line: 105, baseType: !89)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!503 = !{!0, !504, !509, !528}
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 102, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 224, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 28)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "__str", scope: !511, file: !512, line: 198, type: !367, isLocal: true, isDefinition: true)
!511 = distinct !DISubprogram(name: "uk_pr_crit", scope: !512, file: !512, line: 194, type: !513, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !469, retainedNodes: !515)
!512 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!513 = !DISubroutineType(types: !514)
!514 = !{null, !40, null}
!515 = !{!516, !517}
!516 = !DILocalVariable(name: "fmt", arg: 1, scope: !511, file: !512, line: 194, type: !40)
!517 = !DILocalVariable(name: "argp", scope: !511, file: !512, line: 196, type: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !519, line: 32, baseType: !520)
!519 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !521)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 192, elements: !268)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !523)
!523 = !{!524, !525, !526, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !522, file: !3, line: 196, baseType: !12, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !522, file: !3, line: 196, baseType: !12, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !522, file: !3, line: 196, baseType: !44, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !522, file: !3, line: 196, baseType: !44, size: 64, offset: 128)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "__str", scope: !511, file: !512, line: 198, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 96, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 12)
!533 = !{!534, !535, !536, !537, !540, !546, !547, !555, !556, !563}
!534 = !DILocalVariable(name: "sem", arg: 1, scope: !2, file: !3, line: 97, type: !13)
!535 = !DILocalVariable(name: "timeout", arg: 2, scope: !2, file: !3, line: 97, type: !6)
!536 = !DILocalVariable(name: "nsret", scope: !2, file: !3, line: 99, type: !87)
!537 = !DILocalVariable(name: "s", scope: !2, file: !3, line: 100, type: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!540 = !DILocalVariable(name: "tid", scope: !541, file: !3, line: 102, type: !8)
!541 = distinct !DILexicalBlock(scope: !542, file: !3, line: 102, column: 2)
!542 = distinct !DILexicalBlock(scope: !543, file: !3, line: 102, column: 2)
!543 = distinct !DILexicalBlock(scope: !544, file: !3, line: 102, column: 2)
!544 = distinct !DILexicalBlock(scope: !545, file: !3, line: 102, column: 2)
!545 = distinct !DILexicalBlock(scope: !2, file: !3, line: 102, column: 2)
!546 = !DILocalVariable(name: "_arg3", scope: !541, file: !3, line: 102, type: !499)
!547 = !DILocalVariable(name: "tid", scope: !548, file: !3, line: 106, type: !8)
!548 = distinct !DILexicalBlock(scope: !549, file: !3, line: 106, column: 3)
!549 = distinct !DILexicalBlock(scope: !550, file: !3, line: 106, column: 3)
!550 = distinct !DILexicalBlock(scope: !551, file: !3, line: 106, column: 3)
!551 = distinct !DILexicalBlock(scope: !552, file: !3, line: 106, column: 3)
!552 = distinct !DILexicalBlock(scope: !553, file: !3, line: 106, column: 3)
!553 = distinct !DILexicalBlock(scope: !554, file: !3, line: 105, column: 20)
!554 = distinct !DILexicalBlock(scope: !2, file: !3, line: 105, column: 6)
!555 = !DILocalVariable(name: "_ret", scope: !548, file: !3, line: 106, type: !499)
!556 = !DILocalVariable(name: "tid", scope: !557, file: !3, line: 109, type: !8)
!557 = distinct !DILexicalBlock(scope: !558, file: !3, line: 109, column: 3)
!558 = distinct !DILexicalBlock(scope: !559, file: !3, line: 109, column: 3)
!559 = distinct !DILexicalBlock(scope: !560, file: !3, line: 109, column: 3)
!560 = distinct !DILexicalBlock(scope: !561, file: !3, line: 109, column: 3)
!561 = distinct !DILexicalBlock(scope: !562, file: !3, line: 109, column: 3)
!562 = distinct !DILexicalBlock(scope: !554, file: !3, line: 108, column: 9)
!563 = !DILocalVariable(name: "_ret", scope: !557, file: !3, line: 109, type: !499)
!564 = !{i32 2, !"Dwarf Version", i32 4}
!565 = !{i32 2, !"Debug Info Version", i32 3}
!566 = !{i32 1, !"wchar_size", i32 4}
!567 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!568 = distinct !DISubprogram(name: "sys_sem_new", scope: !3, file: !3, line: 45, type: !569, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, unit: !469, retainedNodes: !576)
!569 = !DISubroutineType(types: !570)
!570 = !{!571, !13, !573}
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !472, line: 96, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !7, line: 126, baseType: !194)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !7, line: 125, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 24, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !11, line: 43, baseType: !226)
!576 = !{!577, !578, !579}
!577 = !DILocalVariable(name: "sem", arg: 1, scope: !568, file: !3, line: 45, type: !13)
