; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sentinel.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sentinel.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.dictType = type { i64 (i8*)*, i8* (i8*, i8*)*, i8* (i8*, i8*)*, i32 (i8*, i8*, i8*)*, void (i8*, i8*)*, void (i8*, i8*)* }
%struct.client = type { i64, i32, %struct.redisDb*, %struct.redisObject*, i8*, i64, i8*, i64, i32, %struct.redisObject**, %struct.redisCommand*, %struct.redisCommand*, i32, i32, i64, %struct.list*, i64, i64, i64, i64, i64, i32, i32, i32, i32, i32, i64, i64, i8*, i64, i64, i64, i64, i64, [41 x i8], i32, [46 x i8], i32, %struct.multiState, i32, %struct.blockingState, i64, %struct.list*, %struct.dict*, %struct.list*, i8*, %struct.listNode*, i32, [16384 x i8] }
%struct.redisDb = type { %struct.dict*, %struct.dict*, %struct.dict*, %struct.dict*, %struct.dict*, i32, i64, %struct.list* }
%struct.redisObject = type { i32, i32, i8* }
%struct.redisCommand = type { i8*, {}*, i32, i8*, i32, i32* (%struct.redisCommand*, %struct.redisObject**, i32, i32*)*, i32, i32, i32, i64, i64 }
%struct.multiState = type { %struct.multiCmd*, i32, i32, i32, i64 }
%struct.multiCmd = type { %struct.redisObject**, i32, %struct.redisCommand* }
%struct.blockingState = type { i64, %struct.dict*, %struct.redisObject*, i64, %struct.redisObject*, %struct.redisObject*, i64, i64, i32, i32, i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "instancesDictType", scope: !2, file: !3, line: 404, type: !198, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !414)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sentinel.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "redisConnectionType", file: !6, line: 134, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/hiredis.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "REDIS_CONN_TCP", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "REDIS_CONN_UNIX", value: 1, isUnsigned: true)
!11 = !{!12, !13, !14, !15, !16, !18, !23, !24, !306, !319, !329, !338, !345}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !19, line: 60, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !21, line: 105, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "sentinelRedisInstance", file: !3, line: 230, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sentinelRedisInstance", file: !3, line: 164, size: 2560, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !40, !265, !266, !267, !268, !269, !270, !271, !272, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !3, line: 165, baseType: !15, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !3, line: 166, baseType: !16, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "runid", scope: !27, file: !3, line: 167, baseType: !16, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "config_epoch", scope: !27, file: !3, line: 168, baseType: !18, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !27, file: !3, line: 169, baseType: !34, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "sentinelAddr", file: !3, line: 51, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sentinelAddr", file: !3, line: 48, size: 128, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !36, file: !3, line: 49, baseType: !16, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !36, file: !3, line: 50, baseType: !15, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !27, file: !3, line: 170, baseType: !41, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "instanceLink", file: !3, line: 162, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "instanceLink", file: !3, line: 137, size: 768, elements: !44)
!44 = !{!45, !46, !47, !48, !254, !255, !258, !259, !260, !261, !262, !263, !264}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !43, file: !3, line: 138, baseType: !15, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !43, file: !3, line: 139, baseType: !15, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pending_commands", scope: !43, file: !3, line: 140, baseType: !15, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !43, file: !3, line: 141, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisAsyncContext", file: !51, line: 101, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/async.h", directory: "/root/.unikraft/apps/redis/build")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisAsyncContext", file: !51, line: 61, size: 2752, elements: !53)
!53 = !{!54, !146, !147, !148, !149, !158, !165, !168, !187}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !52, file: !51, line: 63, baseType: !55, size: 1664)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisContext", file: !6, line: 161, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisContext", file: !6, line: 140, size: 1664, elements: !57)
!57 = !{!58, !59, !63, !64, !65, !66, !126, !127, !136, !142}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !56, file: !6, line: 141, baseType: !15, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !56, file: !6, line: 142, baseType: !60, size: 1024, offset: 32)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !56, file: !6, line: 143, baseType: !15, size: 32, offset: 1056)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !6, line: 144, baseType: !15, size: 32, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "obuf", scope: !56, file: !6, line: 145, baseType: !16, size: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !56, file: !6, line: 146, baseType: !67, size: 64, offset: 1216)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReader", file: !69, line: 95, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.h", directory: "/root/.unikraft/apps/redis/build")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReader", file: !69, line: 80, size: 4480, elements: !71)
!71 = !{!72, !73, !74, !75, !80, !81, !82, !96, !97, !98, !125}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !70, file: !69, line: 81, baseType: !15, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !70, file: !69, line: 82, baseType: !60, size: 1024, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !70, file: !69, line: 84, baseType: !16, size: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !70, file: !69, line: 85, baseType: !76, size: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 40, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !79, line: 129, baseType: !22)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !70, file: !69, line: 86, baseType: !76, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "maxbuf", scope: !70, file: !69, line: 87, baseType: !76, size: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rstack", scope: !70, file: !69, line: 89, baseType: !83, size: 2880, offset: 1344)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2880, elements: !94)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReadTask", file: !69, line: 70, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReadTask", file: !69, line: 63, size: 320, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !93}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !69, line: 64, baseType: !15, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !85, file: !69, line: 65, baseType: !15, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !85, file: !69, line: 66, baseType: !15, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !85, file: !69, line: 67, baseType: !12, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !85, file: !69, line: 68, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !85, file: !69, line: 69, baseType: !12, size: 64, offset: 256)
!94 = !{!95}
!95 = !DISubrange(count: 9)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ridx", scope: !70, file: !69, line: 90, baseType: !15, size: 32, offset: 4224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !70, file: !69, line: 91, baseType: !12, size: 64, offset: 4288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !70, file: !69, line: 93, baseType: !99, size: 64, offset: 4352)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReplyObjectFunctions", file: !69, line: 78, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReplyObjectFunctions", file: !69, line: 72, size: 320, elements: !102)
!102 = !{!103, !109, !113, !117, !121}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "createString", scope: !101, file: !69, line: 73, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!12, !107, !16, !76}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "createArray", scope: !101, file: !69, line: 74, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!12, !107, !15}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "createInteger", scope: !101, file: !69, line: 75, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!12, !107, !23}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "createNil", scope: !101, file: !69, line: 76, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!12, !107}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "freeObject", scope: !101, file: !69, line: 77, baseType: !122, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !70, file: !69, line: 94, baseType: !12, size: 64, offset: 4416)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !56, file: !6, line: 148, baseType: !5, size: 32, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !56, file: !6, line: 149, baseType: !128, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !130, line: 44, size: 128, elements: !131)
!130 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !129, file: !130, line: 45, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !130, line: 34, baseType: !13)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !129, file: !130, line: 46, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !130, line: 39, baseType: !13)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !56, file: !6, line: 155, baseType: !137, size: 192, offset: 1408)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !6, line: 151, size: 192, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !137, file: !6, line: 152, baseType: !16, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "source_addr", scope: !137, file: !6, line: 153, baseType: !16, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !137, file: !6, line: 154, baseType: !15, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "unix_sock", scope: !56, file: !6, line: 159, baseType: !143, size: 64, offset: 1600)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !6, line: 157, size: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !143, file: !6, line: 158, baseType: !16, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !52, file: !51, line: 66, baseType: !15, size: 32, offset: 1664)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !52, file: !51, line: 67, baseType: !16, size: 64, offset: 1728)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !51, line: 70, baseType: !12, size: 64, offset: 1792)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !52, file: !51, line: 83, baseType: !150, size: 384, offset: 1856)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !51, line: 73, size: 384, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !51, line: 74, baseType: !12, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "addRead", scope: !150, file: !51, line: 78, baseType: !122, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "delRead", scope: !150, file: !51, line: 79, baseType: !122, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "addWrite", scope: !150, file: !51, line: 80, baseType: !122, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "delWrite", scope: !150, file: !51, line: 81, baseType: !122, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !150, file: !51, line: 82, baseType: !122, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "onDisconnect", scope: !52, file: !51, line: 87, baseType: !159, size: 64, offset: 2240)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDisconnectCallback", file: !51, line: 57, baseType: !161)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163, !15}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "onConnect", scope: !52, file: !51, line: 90, baseType: !166, size: 64, offset: 2304)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisConnectCallback", file: !51, line: 58, baseType: !161)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "replies", scope: !52, file: !51, line: 93, baseType: !169, size: 128, offset: 2368)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallbackList", file: !51, line: 54, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCallbackList", file: !51, line: 52, size: 128, elements: !171)
!171 = !{!172, !186}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !170, file: !51, line: 53, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallback", file: !51, line: 49, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCallback", file: !51, line: 45, size: 192, elements: !176)
!176 = !{!177, !179, !185}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !51, line: 46, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !175, file: !51, line: 47, baseType: !180, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallbackFn", file: !51, line: 44, baseType: !182)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !12, !12}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !175, file: !51, line: 48, baseType: !12, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !170, file: !51, line: 53, baseType: !173, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !52, file: !51, line: 100, baseType: !188, size: 256, offset: 2496)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !51, line: 96, size: 256, elements: !189)
!189 = !{!190, !191, !253}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !188, file: !51, line: 97, baseType: !169, size: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !188, file: !51, line: 98, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !194, line: 76, size: 768, elements: !195)
!194 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!195 = !{!196, !221, !222, !251, !252}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !193, file: !194, line: 77, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !194, line: 65, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !194, line: 58, size: 384, elements: !200)
!200 = !{!201, !207, !211, !212, !216, !220}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !199, file: !194, line: 59, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!18, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !199, file: !194, line: 60, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!12, !12, !205}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !199, file: !194, line: 61, baseType: !208, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !199, file: !194, line: 62, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!15, !12, !205, !205}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !199, file: !194, line: 63, baseType: !217, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !199, file: !194, line: 64, baseType: !217, size: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !193, file: !194, line: 78, baseType: !12, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !193, file: !194, line: 79, baseType: !223, size: 512, offset: 128)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 512, elements: !249)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !194, line: 74, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !194, line: 69, size: 256, elements: !226)
!226 = !{!227, !246, !247, !248}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !225, file: !194, line: 70, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !194, line: 56, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !194, line: 47, size: 192, elements: !232)
!232 = !{!233, !234, !244}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !231, file: !194, line: 48, baseType: !12, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !231, file: !194, line: 54, baseType: !235, size: 64, offset: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !194, line: 49, size: 64, elements: !236)
!236 = !{!237, !238, !239, !242}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !235, file: !194, line: 50, baseType: !12, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !235, file: !194, line: 51, baseType: !18, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !235, file: !194, line: 52, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !19, line: 56, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !21, line: 103, baseType: !13)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !235, file: !194, line: 53, baseType: !243, size: 64)
!243 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !194, line: 55, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !194, line: 71, baseType: !22, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !225, file: !194, line: 72, baseType: !22, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !225, file: !194, line: 73, baseType: !22, size: 64, offset: 192)
!249 = !{!250}
!250 = !DISubrange(count: 2)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !193, file: !194, line: 80, baseType: !13, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !193, file: !194, line: 81, baseType: !22, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "patterns", scope: !188, file: !51, line: 99, baseType: !192, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !43, file: !3, line: 142, baseType: !49, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cc_conn_time", scope: !43, file: !3, line: 143, baseType: !256, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !257, line: 52, baseType: !23)
!257 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pc_conn_time", scope: !43, file: !3, line: 144, baseType: !256, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pc_last_activity", scope: !43, file: !3, line: 145, baseType: !256, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "last_avail_time", scope: !43, file: !3, line: 146, baseType: !256, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "act_ping_time", scope: !43, file: !3, line: 148, baseType: !256, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "last_ping_time", scope: !43, file: !3, line: 153, baseType: !256, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "last_pong_time", scope: !43, file: !3, line: 157, baseType: !256, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "last_reconn_time", scope: !43, file: !3, line: 160, baseType: !256, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "last_pub_time", scope: !27, file: !3, line: 171, baseType: !256, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "last_hello_time", scope: !27, file: !3, line: 172, baseType: !256, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "last_master_down_reply_time", scope: !27, file: !3, line: 175, baseType: !256, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "s_down_since_time", scope: !27, file: !3, line: 177, baseType: !256, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "o_down_since_time", scope: !27, file: !3, line: 178, baseType: !256, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "down_after_period", scope: !27, file: !3, line: 179, baseType: !256, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "info_refresh", scope: !27, file: !3, line: 180, baseType: !256, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "renamed_commands", scope: !27, file: !3, line: 181, baseType: !273, size: 64, offset: 832)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !194, line: 82, baseType: !193)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "role_reported", scope: !27, file: !3, line: 191, baseType: !15, size: 32, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "role_reported_time", scope: !27, file: !3, line: 192, baseType: !256, size: 64, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "slave_conf_change_time", scope: !27, file: !3, line: 193, baseType: !256, size: 64, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sentinels", scope: !27, file: !3, line: 196, baseType: !273, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "slaves", scope: !27, file: !3, line: 197, baseType: !273, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !27, file: !3, line: 198, baseType: !7, size: 32, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parallel_syncs", scope: !27, file: !3, line: 199, baseType: !15, size: 32, offset: 1248)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "auth_pass", scope: !27, file: !3, line: 200, baseType: !16, size: 64, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "master_link_down_time", scope: !27, file: !3, line: 203, baseType: !256, size: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "slave_priority", scope: !27, file: !3, line: 204, baseType: !15, size: 32, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "slave_reconf_sent_time", scope: !27, file: !3, line: 205, baseType: !256, size: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !27, file: !3, line: 206, baseType: !287, size: 64, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "slave_master_host", scope: !27, file: !3, line: 207, baseType: !16, size: 64, offset: 1600)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "slave_master_port", scope: !27, file: !3, line: 208, baseType: !15, size: 32, offset: 1664)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "slave_master_link_status", scope: !27, file: !3, line: 209, baseType: !15, size: 32, offset: 1696)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "slave_repl_offset", scope: !27, file: !3, line: 210, baseType: !14, size: 64, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "leader", scope: !27, file: !3, line: 212, baseType: !16, size: 64, offset: 1792)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "leader_epoch", scope: !27, file: !3, line: 216, baseType: !18, size: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "failover_epoch", scope: !27, file: !3, line: 217, baseType: !18, size: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "failover_state", scope: !27, file: !3, line: 218, baseType: !15, size: 32, offset: 1984)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "failover_state_change_time", scope: !27, file: !3, line: 219, baseType: !256, size: 64, offset: 2048)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "failover_start_time", scope: !27, file: !3, line: 220, baseType: !256, size: 64, offset: 2112)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "failover_timeout", scope: !27, file: !3, line: 221, baseType: !256, size: 64, offset: 2176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "failover_delay_logged", scope: !27, file: !3, line: 222, baseType: !256, size: 64, offset: 2240)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "promoted_slave", scope: !27, file: !3, line: 224, baseType: !287, size: 64, offset: 2304)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "notification_script", scope: !27, file: !3, line: 227, baseType: !16, size: 64, offset: 2368)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "client_reconfig_script", scope: !27, file: !3, line: 228, baseType: !16, size: 64, offset: 2432)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !27, file: !3, line: 229, baseType: !304, size: 64, offset: 2496)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !305, line: 43, baseType: !16)
!305 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !305, line: 51, size: 24, elements: !308)
!308 = !{!309, !313, !314, !315}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !307, file: !305, line: 52, baseType: !310, size: 8)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 24, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !21, line: 43, baseType: !312)
!312 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !307, file: !305, line: 53, baseType: !310, size: 8, offset: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !305, line: 54, baseType: !312, size: 8, offset: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !307, file: !305, line: 55, baseType: !316, offset: 24)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: -1)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !305, line: 57, size: 40, elements: !321)
!321 = !{!322, !326, !327, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !320, file: !305, line: 58, baseType: !323, size: 16)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 36, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 57, baseType: !325)
!325 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !320, file: !305, line: 59, baseType: !323, size: 16, offset: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !305, line: 60, baseType: !312, size: 8, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !320, file: !305, line: 61, baseType: !316, offset: 40)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !305, line: 63, size: 72, elements: !331)
!331 = !{!332, !335, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !330, file: !305, line: 64, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 48, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 79, baseType: !7)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !330, file: !305, line: 65, baseType: !333, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !305, line: 66, baseType: !312, size: 8, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !330, file: !305, line: 67, baseType: !316, offset: 72)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !305, line: 69, size: 136, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !339, file: !305, line: 70, baseType: !18, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !339, file: !305, line: 71, baseType: !18, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !305, line: 72, baseType: !312, size: 8, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !339, file: !305, line: 73, baseType: !316, offset: 136)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisAeEvents", file: !3, line: 276, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisAeEvents", file: !3, line: 271, size: 256, elements: !348)
!348 = !{!349, !350, !411, !412, !413}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !347, file: !3, line: 272, baseType: !49, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !347, file: !3, line: 273, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !353, line: 109, baseType: !354)
!353 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !353, line: 97, size: 640, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !374, !381, !403, !404, !405, !410}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !354, file: !353, line: 98, baseType: !15, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !354, file: !353, line: 99, baseType: !15, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !354, file: !353, line: 100, baseType: !23, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !354, file: !353, line: 101, baseType: !133, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !354, file: !353, line: 102, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !353, line: 76, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !353, line: 71, size: 256, elements: !364)
!364 = !{!365, !366, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !363, file: !353, line: 72, baseType: !15, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !363, file: !353, line: 73, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !353, line: 65, baseType: !369)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !371, !15, !12, !15}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !363, file: !353, line: 74, baseType: !367, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !363, file: !353, line: 75, baseType: !12, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !354, file: !353, line: 103, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !353, line: 94, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !353, line: 91, size: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !377, file: !353, line: 92, baseType: !15, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !377, file: !353, line: 93, baseType: !15, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !354, file: !353, line: 104, baseType: !382, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !353, line: 88, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !353, line: 79, size: 512, elements: !385)
!385 = !{!386, !387, !388, !389, !394, !399, !400, !402}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !384, file: !353, line: 80, baseType: !23, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !384, file: !353, line: 81, baseType: !13, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !384, file: !353, line: 82, baseType: !13, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !384, file: !353, line: 83, baseType: !390, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !353, line: 66, baseType: !392)
!392 = !DISubroutineType(types: !393)
!393 = !{!15, !371, !23, !12}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !384, file: !353, line: 84, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !353, line: 67, baseType: !397)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !371, !12}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !384, file: !353, line: 85, baseType: !12, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !353, line: 86, baseType: !401, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !353, line: 87, baseType: !401, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !354, file: !353, line: 105, baseType: !15, size: 32, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !354, file: !353, line: 106, baseType: !12, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !354, file: !353, line: 107, baseType: !406, size: 64, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !353, line: 68, baseType: !408)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !371}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !354, file: !353, line: 108, baseType: !406, size: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !347, file: !3, line: 274, baseType: !15, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !347, file: !3, line: 275, baseType: !15, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !347, file: !3, line: 275, baseType: !15, size: 32, offset: 192)
!414 = !{!0, !415, !417, !419, !590}
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "leaderVotesDictType", scope: !2, file: !3, line: 417, type: !198, isLocal: false, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "renamedCommandsDictType", scope: !2, file: !3, line: 427, type: !198, isLocal: false, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "sentinelcmds", scope: !2, file: !3, line: 444, type: !421, isLocal: false, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 7680, elements: !588)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !257, line: 1307, size: 640, elements: !423)
!423 = !{!424, !425, !574, !575, !576, !577, !583, !584, !585, !586, !587}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !257, line: 1308, baseType: !16, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !422, file: !257, line: 1309, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !257, line: 1305, baseType: !428)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !257, line: 780, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !257, line: 723, size: 135360, elements: !433)
!433 = !{!434, !435, !436, !474, !484, !485, !486, !487, !488, !489, !491, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !513, !514, !515, !516, !517, !518, !519, !520, !524, !525, !529, !530, !546, !547, !563, !564, !565, !566, !567, !568, !569, !570}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !257, line: 724, baseType: !18, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !432, file: !257, line: 725, baseType: !15, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !432, file: !257, line: 726, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !257, line: 656, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !257, line: 647, size: 512, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !439, file: !257, line: 648, baseType: !273, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !439, file: !257, line: 649, baseType: !273, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !439, file: !257, line: 650, baseType: !273, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !439, file: !257, line: 651, baseType: !273, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !439, file: !257, line: 652, baseType: !273, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !439, file: !257, line: 653, baseType: !15, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !439, file: !257, line: 654, baseType: !23, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !439, file: !257, line: 655, baseType: !449, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !451, line: 54, baseType: !452)
!451 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !451, line: 47, size: 384, elements: !453)
!453 = !{!454, !463, !464, !468, !469, !473}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !452, file: !451, line: 48, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !451, line: 40, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !451, line: 36, size: 192, elements: !458)
!458 = !{!459, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !451, line: 37, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !451, line: 38, baseType: !460, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !457, file: !451, line: 39, baseType: !12, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !452, file: !451, line: 49, baseType: !455, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !452, file: !451, line: 50, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!12, !12}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !452, file: !451, line: 51, baseType: !122, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !452, file: !451, line: 52, baseType: !470, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!15, !12, !12}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !452, file: !451, line: 53, baseType: !22, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !257, line: 727, baseType: !475, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !257, line: 622, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !257, line: 614, size: 128, elements: !478)
!478 = !{!479, !480, !481, !482, !483}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !257, line: 615, baseType: !7, size: 4, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !477, file: !257, line: 616, baseType: !7, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !477, file: !257, line: 617, baseType: !7, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !477, file: !257, line: 620, baseType: !15, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !477, file: !257, line: 621, baseType: !12, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !432, file: !257, line: 728, baseType: !304, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !432, file: !257, line: 729, baseType: !76, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !432, file: !257, line: 730, baseType: !304, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !432, file: !257, line: 734, baseType: !76, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !432, file: !257, line: 735, baseType: !15, size: 32, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !432, file: !257, line: 736, baseType: !490, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !432, file: !257, line: 737, baseType: !492, size: 64, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !432, file: !257, line: 737, baseType: !492, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !432, file: !257, line: 738, baseType: !15, size: 32, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !432, file: !257, line: 739, baseType: !15, size: 32, offset: 800)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !432, file: !257, line: 740, baseType: !13, size: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !432, file: !257, line: 741, baseType: !449, size: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !432, file: !257, line: 742, baseType: !14, size: 64, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !432, file: !257, line: 743, baseType: !76, size: 64, offset: 1024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !432, file: !257, line: 745, baseType: !133, size: 64, offset: 1088)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !432, file: !257, line: 746, baseType: !133, size: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !432, file: !257, line: 747, baseType: !133, size: 64, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !432, file: !257, line: 748, baseType: !15, size: 32, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !432, file: !257, line: 749, baseType: !15, size: 32, offset: 1312)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !432, file: !257, line: 750, baseType: !15, size: 32, offset: 1344)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !432, file: !257, line: 751, baseType: !15, size: 32, offset: 1376)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !432, file: !257, line: 752, baseType: !15, size: 32, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !432, file: !257, line: 753, baseType: !509, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !510, line: 173, baseType: !511)
!510 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 100, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !79, line: 44, baseType: !13)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !432, file: !257, line: 754, baseType: !509, size: 64, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !432, file: !257, line: 755, baseType: !304, size: 64, offset: 1600)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !432, file: !257, line: 756, baseType: !23, size: 64, offset: 1664)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !432, file: !257, line: 757, baseType: !23, size: 64, offset: 1728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !432, file: !257, line: 758, baseType: !23, size: 64, offset: 1792)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !432, file: !257, line: 759, baseType: !23, size: 64, offset: 1856)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !432, file: !257, line: 760, baseType: !23, size: 64, offset: 1920)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !432, file: !257, line: 763, baseType: !521, size: 328, offset: 1984)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 328, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 41)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !432, file: !257, line: 764, baseType: !15, size: 32, offset: 2336)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !432, file: !257, line: 765, baseType: !526, size: 368, offset: 2368)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 368, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 46)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !432, file: !257, line: 766, baseType: !15, size: 32, offset: 2752)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !432, file: !257, line: 767, baseType: !531, size: 256, offset: 2816)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !257, line: 673, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !257, line: 665, size: 256, elements: !533)
!533 = !{!534, !542, !543, !544, !545}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !532, file: !257, line: 666, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !257, line: 663, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !257, line: 659, size: 192, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !537, file: !257, line: 660, baseType: !490, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !537, file: !257, line: 661, baseType: !15, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !537, file: !257, line: 662, baseType: !492, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !532, file: !257, line: 667, baseType: !15, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !532, file: !257, line: 668, baseType: !15, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !532, file: !257, line: 671, baseType: !15, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !532, file: !257, line: 672, baseType: !133, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !432, file: !257, line: 768, baseType: !15, size: 32, offset: 3072)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !432, file: !257, line: 769, baseType: !548, size: 704, offset: 3136)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !257, line: 703, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !257, line: 677, size: 704, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !549, file: !257, line: 679, baseType: !256, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !549, file: !257, line: 683, baseType: !273, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !549, file: !257, line: 685, baseType: !475, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !549, file: !257, line: 689, baseType: !76, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !549, file: !257, line: 690, baseType: !475, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !549, file: !257, line: 691, baseType: !475, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !549, file: !257, line: 692, baseType: !256, size: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !549, file: !257, line: 692, baseType: !256, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !549, file: !257, line: 693, baseType: !15, size: 32, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !549, file: !257, line: 696, baseType: !15, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !549, file: !257, line: 697, baseType: !23, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !549, file: !257, line: 700, baseType: !12, size: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !432, file: !257, line: 770, baseType: !23, size: 64, offset: 3840)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !432, file: !257, line: 771, baseType: !449, size: 64, offset: 3904)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !432, file: !257, line: 772, baseType: !273, size: 64, offset: 3968)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !432, file: !257, line: 773, baseType: !449, size: 64, offset: 4032)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !432, file: !257, line: 774, baseType: !304, size: 64, offset: 4096)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !432, file: !257, line: 775, baseType: !455, size: 64, offset: 4160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !432, file: !257, line: 778, baseType: !15, size: 32, offset: 4224)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !432, file: !257, line: 779, baseType: !571, size: 131072, offset: 4256)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 131072, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 16384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !422, file: !257, line: 1310, baseType: !15, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !422, file: !257, line: 1311, baseType: !16, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !422, file: !257, line: 1312, baseType: !15, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !422, file: !257, line: 1315, baseType: !578, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !257, line: 1306, baseType: !580)
!580 = !DISubroutineType(types: !581)
!581 = !{!582, !492, !490, !15, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !422, file: !257, line: 1317, baseType: !15, size: 32, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !422, file: !257, line: 1318, baseType: !15, size: 32, offset: 416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !422, file: !257, line: 1319, baseType: !15, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !422, file: !257, line: 1320, baseType: !23, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !422, file: !257, line: 1320, baseType: !23, size: 64, offset: 576)
!588 = !{!589}
!589 = !DISubrange(count: 12)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "sentinel", scope: !2, file: !3, line: 251, type: !592, isLocal: false, isDefinition: true)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sentinelState", file: !3, line: 233, size: 1024, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "myid", scope: !592, file: !3, line: 234, baseType: !521, size: 328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "current_epoch", scope: !592, file: !3, line: 235, baseType: !18, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "masters", scope: !592, file: !3, line: 236, baseType: !273, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tilt", scope: !592, file: !3, line: 239, baseType: !15, size: 32, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "running_scripts", scope: !592, file: !3, line: 240, baseType: !15, size: 32, offset: 544)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tilt_start_time", scope: !592, file: !3, line: 241, baseType: !256, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "previous_time", scope: !592, file: !3, line: 242, baseType: !256, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "scripts_queue", scope: !592, file: !3, line: 243, baseType: !449, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "announce_ip", scope: !592, file: !3, line: 244, baseType: !16, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "announce_port", scope: !592, file: !3, line: 246, baseType: !15, size: 32, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "simfailure_flags", scope: !592, file: !3, line: 248, baseType: !22, size: 64, offset: 896)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "deny_scripts_reconfig", scope: !592, file: !3, line: 249, baseType: !15, size: 32, offset: 960)
!606 = !{i32 2, !"Dwarf Version", i32 4}
!607 = !{i32 2, !"Debug Info Version", i32 3}
!608 = !{i32 1, !"wchar_size", i32 4}
!609 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!610 = distinct !DISubprogram(name: "dictInstancesValDestructor", scope: !3, file: !3, line: 395, type: !218, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !611)
!611 = !{!612, !613}
!612 = !DILocalVariable(name: "privdata", arg: 1, scope: !610, file: !3, line: 395, type: !12)
!613 = !DILocalVariable(name: "obj", arg: 2, scope: !610, file: !3, line: 395, type: !12)
!614 = !DILocation(line: 395, column: 40, scope: !610)
!615 = !DILocation(line: 395, column: 56, scope: !610)
!616 = !DILocation(line: 397, column: 34, scope: !610)
!617 = !DILocation(line: 397, column: 5, scope: !610)
!618 = !DILocation(line: 398, column: 1, scope: !610)
!619 = distinct !DISubprogram(name: "releaseSentinelRedisInstance", scope: !3, file: !3, line: 1262, type: !620, isLocal: false, isDefinition: true, scopeLine: 1262, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !622)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !25}
!622 = !{!623}
!623 = !DILocalVariable(name: "ri", arg: 1, scope: !619, file: !3, line: 1262, type: !25)
!624 = !DILocation(line: 1262, column: 58, scope: !619)
!625 = !DILocation(line: 1264, column: 21, scope: !619)
!626 = !{!627, !631, i64 136}
!627 = !{!"sentinelRedisInstance", !628, i64 0, !631, i64 8, !631, i64 16, !632, i64 24, !631, i64 32, !631, i64 40, !633, i64 48, !633, i64 56, !633, i64 64, !633, i64 72, !633, i64 80, !633, i64 88, !633, i64 96, !631, i64 104, !628, i64 112, !633, i64 120, !633, i64 128, !631, i64 136, !631, i64 144, !628, i64 152, !628, i64 156, !631, i64 160, !633, i64 168, !628, i64 176, !633, i64 184, !631, i64 192, !631, i64 200, !628, i64 208, !628, i64 212, !633, i64 216, !631, i64 224, !632, i64 232, !632, i64 240, !628, i64 248, !633, i64 256, !633, i64 264, !633, i64 272, !633, i64 280, !631, i64 288, !631, i64 296, !631, i64 304, !631, i64 312}
!628 = !{!"int", !629, i64 0}
!629 = !{!"omnipotent char", !630, i64 0}
!630 = !{!"Simple C/C++ TBAA"}
!631 = !{!"any pointer", !629, i64 0}
!632 = !{!"long", !629, i64 0}
!633 = !{!"long long", !629, i64 0}
!634 = !DILocation(line: 1264, column: 5, scope: !619)
!635 = !DILocation(line: 1265, column: 21, scope: !619)
!636 = !{!627, !631, i64 144}
!637 = !DILocation(line: 1265, column: 5, scope: !619)
!638 = !DILocation(line: 1268, column: 29, scope: !619)
!639 = !{!627, !631, i64 40}
!640 = !DILocation(line: 1268, column: 5, scope: !619)
!641 = !DILocation(line: 1271, column: 17, scope: !619)
!642 = !{!627, !631, i64 8}
!643 = !DILocation(line: 1271, column: 5, scope: !619)
!644 = !DILocation(line: 1272, column: 17, scope: !619)
!645 = !{!627, !631, i64 16}
!646 = !DILocation(line: 1272, column: 5, scope: !619)
!647 = !DILocation(line: 1273, column: 17, scope: !619)
!648 = !{!627, !631, i64 296}
!649 = !DILocation(line: 1273, column: 5, scope: !619)
!650 = !DILocation(line: 1274, column: 17, scope: !619)
!651 = !{!627, !631, i64 304}
!652 = !DILocation(line: 1274, column: 5, scope: !619)
!653 = !DILocation(line: 1275, column: 17, scope: !619)
!654 = !{!627, !631, i64 200}
!655 = !DILocation(line: 1275, column: 5, scope: !619)
!656 = !DILocation(line: 1276, column: 17, scope: !619)
!657 = !{!627, !631, i64 224}
!658 = !DILocation(line: 1276, column: 5, scope: !619)
!659 = !DILocation(line: 1277, column: 17, scope: !619)
!660 = !{!627, !631, i64 160}
!661 = !DILocation(line: 1277, column: 5, scope: !619)
!662 = !DILocation(line: 1278, column: 17, scope: !619)
!663 = !{!627, !631, i64 312}
!664 = !DILocation(line: 1278, column: 5, scope: !619)
!665 = !DILocation(line: 1279, column: 29, scope: !619)
!666 = !{!627, !631, i64 32}
!667 = !DILocalVariable(name: "sa", arg: 1, scope: !668, file: !3, line: 568, type: !34)
!668 = distinct !DISubprogram(name: "releaseSentinelAddr", scope: !3, file: !3, line: 568, type: !669, isLocal: false, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !34}
!671 = !{!667}
!672 = !DILocation(line: 568, column: 40, scope: !668, inlinedAt: !673)
!673 = distinct !DILocation(line: 1279, column: 5, scope: !619)
!674 = !DILocation(line: 569, column: 17, scope: !668, inlinedAt: !673)
!675 = !{!676, !631, i64 0}
!676 = !{!"sentinelAddr", !631, i64 0, !628, i64 8}
!677 = !DILocation(line: 569, column: 5, scope: !668, inlinedAt: !673)
!678 = !DILocation(line: 570, column: 11, scope: !668, inlinedAt: !673)
!679 = !DILocation(line: 570, column: 5, scope: !668, inlinedAt: !673)
!680 = !DILocation(line: 571, column: 1, scope: !668, inlinedAt: !673)
!681 = !DILocation(line: 1280, column: 21, scope: !619)
!682 = !{!627, !631, i64 104}
!683 = !DILocation(line: 1280, column: 5, scope: !619)
!684 = !DILocation(line: 1283, column: 14, scope: !685)
!685 = distinct !DILexicalBlock(scope: !619, file: !3, line: 1283, column: 9)
!686 = !{!627, !628, i64 0}
!687 = !DILocation(line: 1283, column: 20, scope: !685)
!688 = !DILocation(line: 1283, column: 33, scope: !685)
!689 = !DILocation(line: 1283, column: 47, scope: !685)
!690 = !DILocation(line: 1283, column: 63, scope: !685)
!691 = !DILocation(line: 1283, column: 70, scope: !685)
!692 = !{!627, !631, i64 192}
!693 = !DILocation(line: 1283, column: 66, scope: !685)
!694 = !DILocation(line: 1283, column: 9, scope: !619)
!695 = !DILocation(line: 1284, column: 21, scope: !685)
!696 = !DILocation(line: 1284, column: 36, scope: !685)
!697 = !{!627, !631, i64 288}
!698 = !DILocation(line: 1284, column: 9, scope: !685)
!699 = !DILocation(line: 1286, column: 11, scope: !619)
!700 = !DILocation(line: 1286, column: 5, scope: !619)
!701 = !DILocation(line: 1287, column: 1, scope: !619)
!702 = distinct !DISubprogram(name: "sentinelCommand", scope: !3, file: !3, line: 2985, type: !428, isLocal: false, isDefinition: true, scopeLine: 2985, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !703)
!703 = !{!704, !705, !709, !712, !715, !718, !719, !720, !721, !722, !723, !727, !730, !733, !737, !738, !739, !740, !744, !747, !748, !749, !752, !756, !757, !758, !762, !765, !777, !778, !780, !781, !782, !784}
!704 = !DILocalVariable(name: "c", arg: 1, scope: !702, file: !3, line: 2985, type: !430)
!705 = !DILocalVariable(name: "ri", scope: !706, file: !3, line: 2992, type: !25)
!706 = distinct !DILexicalBlock(scope: !707, file: !3, line: 2990, column: 55)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 2990, column: 16)
!708 = distinct !DILexicalBlock(scope: !702, file: !3, line: 2986, column: 9)
!709 = !DILocalVariable(name: "ri", scope: !710, file: !3, line: 3002, type: !25)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 3000, column: 5)
!711 = distinct !DILexicalBlock(scope: !707, file: !3, line: 2998, column: 16)
!712 = !DILocalVariable(name: "ri", scope: !713, file: !3, line: 3010, type: !25)
!713 = distinct !DILexicalBlock(scope: !714, file: !3, line: 3008, column: 58)
!714 = distinct !DILexicalBlock(scope: !711, file: !3, line: 3008, column: 16)
!715 = !DILocalVariable(name: "ri", scope: !716, file: !3, line: 3034, type: !25)
!716 = distinct !DILexicalBlock(scope: !717, file: !3, line: 3016, column: 71)
!717 = distinct !DILexicalBlock(scope: !714, file: !3, line: 3016, column: 16)
!718 = !DILocalVariable(name: "req_epoch", scope: !716, file: !3, line: 3035, type: !23)
!719 = !DILocalVariable(name: "leader_epoch", scope: !716, file: !3, line: 3036, type: !18)
!720 = !DILocalVariable(name: "leader", scope: !716, file: !3, line: 3037, type: !16)
!721 = !DILocalVariable(name: "port", scope: !716, file: !3, line: 3038, type: !13)
!722 = !DILocalVariable(name: "isdown", scope: !716, file: !3, line: 3039, type: !15)
!723 = !DILocalVariable(name: "ri", scope: !724, file: !3, line: 3076, type: !25)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 3074, column: 72)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 3074, column: 16)
!726 = distinct !DILexicalBlock(scope: !717, file: !3, line: 3070, column: 16)
!727 = !DILocalVariable(name: "addr", scope: !728, file: !3, line: 3083, type: !34)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 3082, column: 16)
!729 = distinct !DILexicalBlock(scope: !724, file: !3, line: 3080, column: 13)
!730 = !DILocalVariable(name: "ri", scope: !731, file: !3, line: 3091, type: !25)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 3089, column: 57)
!732 = distinct !DILexicalBlock(scope: !725, file: !3, line: 3089, column: 16)
!733 = !DILocalVariable(name: "ri", scope: !734, file: !3, line: 3116, type: !25)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 3114, column: 56)
!735 = distinct !DILexicalBlock(scope: !736, file: !3, line: 3114, column: 16)
!736 = distinct !DILexicalBlock(scope: !732, file: !3, line: 3109, column: 16)
!737 = !DILocalVariable(name: "quorum", scope: !734, file: !3, line: 3117, type: !13)
!738 = !DILocalVariable(name: "port", scope: !734, file: !3, line: 3117, type: !13)
!739 = !DILocalVariable(name: "ip", scope: !734, file: !3, line: 3118, type: !526)
!740 = !DILocalVariable(name: "ri", scope: !741, file: !3, line: 3166, type: !25)
!741 = distinct !DILexicalBlock(scope: !742, file: !3, line: 3164, column: 55)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 3164, column: 16)
!743 = distinct !DILexicalBlock(scope: !735, file: !3, line: 3159, column: 16)
!744 = !DILocalVariable(name: "ri", scope: !745, file: !3, line: 3177, type: !25)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 3175, column: 57)
!746 = distinct !DILexicalBlock(scope: !742, file: !3, line: 3175, column: 16)
!747 = !DILocalVariable(name: "usable", scope: !745, file: !3, line: 3178, type: !15)
!748 = !DILocalVariable(name: "result", scope: !745, file: !3, line: 3183, type: !15)
!749 = !DILocalVariable(name: "e", scope: !750, file: !3, line: 3189, type: !304)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 3188, column: 16)
!751 = distinct !DILexicalBlock(scope: !745, file: !3, line: 3184, column: 13)
!752 = !DILocalVariable(name: "now", scope: !753, file: !3, line: 3208, type: !256)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 3205, column: 59)
!754 = distinct !DILexicalBlock(scope: !755, file: !3, line: 3205, column: 16)
!755 = distinct !DILexicalBlock(scope: !746, file: !3, line: 3202, column: 16)
!756 = !DILocalVariable(name: "copy_keeper", scope: !753, file: !3, line: 3213, type: !198)
!757 = !DILocalVariable(name: "masters_local", scope: !753, file: !3, line: 3215, type: !273)
!758 = !DILocalVariable(name: "i", scope: !759, file: !3, line: 3219, type: !15)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 3219, column: 13)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 3216, column: 26)
!761 = distinct !DILexicalBlock(scope: !753, file: !3, line: 3216, column: 13)
!762 = !DILocalVariable(name: "ri", scope: !763, file: !3, line: 3220, type: !25)
!763 = distinct !DILexicalBlock(scope: !764, file: !3, line: 3219, column: 47)
!764 = distinct !DILexicalBlock(scope: !759, file: !3, line: 3219, column: 13)
!765 = !DILocalVariable(name: "di", scope: !753, file: !3, line: 3237, type: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !194, line: 95, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !194, line: 88, size: 384, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !768, file: !194, line: 89, baseType: !273, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !768, file: !194, line: 90, baseType: !13, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !768, file: !194, line: 91, baseType: !15, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !768, file: !194, line: 91, baseType: !15, size: 32, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !768, file: !194, line: 92, baseType: !229, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !768, file: !194, line: 92, baseType: !229, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !768, file: !194, line: 94, baseType: !23, size: 64, offset: 320)
!777 = !DILocalVariable(name: "de", scope: !753, file: !3, line: 3238, type: !229)
!778 = !DILocalVariable(name: "ri", scope: !779, file: !3, line: 3241, type: !25)
!779 = distinct !DILexicalBlock(scope: !753, file: !3, line: 3240, column: 45)
!780 = !DILocalVariable(name: "sdi", scope: !779, file: !3, line: 3251, type: !766)
!781 = !DILocalVariable(name: "sde", scope: !779, file: !3, line: 3252, type: !229)
!782 = !DILocalVariable(name: "sri", scope: !783, file: !3, line: 3255, type: !25)
!783 = distinct !DILexicalBlock(scope: !779, file: !3, line: 3254, column: 51)
!784 = !DILocalVariable(name: "j", scope: !785, file: !3, line: 3269, type: !15)
!785 = distinct !DILexicalBlock(scope: !786, file: !3, line: 3267, column: 65)
!786 = distinct !DILexicalBlock(scope: !754, file: !3, line: 3267, column: 16)
!787 = !DILocation(line: 2985, column: 30, scope: !702)
!788 = !DILocation(line: 2986, column: 24, scope: !708)
!789 = !{!790, !631, i64 72}
!790 = !{!"client", !632, i64 0, !628, i64 8, !631, i64 16, !631, i64 24, !631, i64 32, !632, i64 40, !631, i64 48, !632, i64 56, !628, i64 64, !631, i64 72, !631, i64 80, !631, i64 88, !628, i64 96, !628, i64 100, !632, i64 104, !631, i64 112, !633, i64 120, !632, i64 128, !632, i64 136, !632, i64 144, !632, i64 152, !628, i64 160, !628, i64 164, !628, i64 168, !628, i64 172, !628, i64 176, !632, i64 184, !632, i64 192, !631, i64 200, !633, i64 208, !633, i64 216, !633, i64 224, !633, i64 232, !633, i64 240, !629, i64 248, !628, i64 292, !629, i64 296, !628, i64 344, !791, i64 352, !628, i64 384, !792, i64 392, !633, i64 480, !631, i64 488, !631, i64 496, !631, i64 504, !631, i64 512, !631, i64 520, !628, i64 528, !629, i64 532}
!791 = !{!"multiState", !631, i64 0, !628, i64 8, !628, i64 12, !628, i64 16, !632, i64 24}
!792 = !{!"blockingState", !633, i64 0, !631, i64 8, !631, i64 16, !632, i64 24, !631, i64 32, !631, i64 40, !633, i64 48, !633, i64 56, !628, i64 64, !628, i64 68, !633, i64 72, !631, i64 80}
!793 = !DILocation(line: 2986, column: 21, scope: !708)
!794 = !{!631, !631, i64 0}
!795 = !DILocation(line: 2986, column: 33, scope: !708)
!796 = !{!797, !631, i64 8}
!797 = !{!"redisObject", !628, i64 0, !628, i64 0, !628, i64 1, !628, i64 4, !631, i64 8}
!798 = !DILocation(line: 2986, column: 10, scope: !708)
!799 = !DILocation(line: 2986, column: 9, scope: !702)
!800 = !DILocation(line: 2988, column: 16, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !3, line: 2988, column: 13)
!802 = distinct !DILexicalBlock(scope: !708, file: !3, line: 2986, column: 49)
!803 = !{!790, !628, i64 64}
!804 = !DILocation(line: 2988, column: 21, scope: !801)
!805 = !DILocation(line: 2988, column: 13, scope: !802)
!806 = !DILocation(line: 2989, column: 49, scope: !802)
!807 = !{!808, !631, i64 56}
!808 = !{!"sentinelState", !629, i64 0, !632, i64 48, !631, i64 56, !628, i64 64, !628, i64 68, !633, i64 72, !633, i64 80, !631, i64 88, !631, i64 96, !628, i64 104, !632, i64 112, !628, i64 120}
!809 = !DILocation(line: 2989, column: 9, scope: !802)
!810 = !DILocation(line: 2990, column: 5, scope: !802)
!811 = !DILocation(line: 2990, column: 17, scope: !707)
!812 = !DILocation(line: 2990, column: 16, scope: !708)
!813 = !DILocation(line: 2994, column: 16, scope: !814)
!814 = distinct !DILexicalBlock(scope: !706, file: !3, line: 2994, column: 13)
!815 = !DILocation(line: 2994, column: 21, scope: !814)
!816 = !DILocation(line: 2994, column: 13, scope: !706)
!817 = !DILocation(line: 2994, column: 27, scope: !814)
!818 = !DILocation(line: 2995, column: 57, scope: !819)
!819 = distinct !DILexicalBlock(scope: !706, file: !3, line: 2995, column: 13)
!820 = !DILocalVariable(name: "c", arg: 1, scope: !821, file: !3, line: 2947, type: !430)
!821 = distinct !DISubprogram(name: "sentinelGetMasterByNameOrReplyError", scope: !3, file: !3, line: 2947, type: !822, isLocal: false, isDefinition: true, scopeLine: 2949, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{!25, !430, !475}
!824 = !{!820, !825, !826}
!825 = !DILocalVariable(name: "name", arg: 2, scope: !821, file: !3, line: 2948, type: !475)
!826 = !DILocalVariable(name: "ri", scope: !821, file: !3, line: 2950, type: !25)
!827 = !DILocation(line: 2947, column: 68, scope: !821, inlinedAt: !828)
!828 = distinct !DILocation(line: 2995, column: 19, scope: !819)
!829 = !DILocation(line: 2948, column: 31, scope: !821, inlinedAt: !828)
!830 = !DILocation(line: 2952, column: 34, scope: !821, inlinedAt: !828)
!831 = !DILocation(line: 2952, column: 48, scope: !821, inlinedAt: !828)
!832 = !DILocation(line: 2952, column: 10, scope: !821, inlinedAt: !828)
!833 = !DILocation(line: 2953, column: 10, scope: !834, inlinedAt: !828)
!834 = distinct !DILexicalBlock(scope: !821, file: !3, line: 2953, column: 9)
!835 = !DILocation(line: 2953, column: 9, scope: !821, inlinedAt: !828)
!836 = !DILocation(line: 2954, column: 9, scope: !837, inlinedAt: !828)
!837 = distinct !DILexicalBlock(scope: !834, file: !3, line: 2953, column: 14)
!838 = !DILocation(line: 2955, column: 9, scope: !837, inlinedAt: !828)
!839 = !DILocation(line: 2958, column: 1, scope: !821, inlinedAt: !828)
!840 = !DILocation(line: 2992, column: 32, scope: !706)
!841 = !DILocation(line: 2995, column: 13, scope: !706)
!842 = !DILocation(line: 2996, column: 22, scope: !819)
!843 = !DILocation(line: 2957, column: 5, scope: !821, inlinedAt: !828)
!844 = !DILocation(line: 2950, column: 28, scope: !821, inlinedAt: !828)
!845 = !DILocation(line: 2997, column: 9, scope: !706)
!846 = !DILocation(line: 2998, column: 5, scope: !707)
!847 = !DILocation(line: 0, scope: !819)
!848 = !DILocation(line: 2998, column: 17, scope: !711)
!849 = !DILocation(line: 2998, column: 54, scope: !711)
!850 = !DILocation(line: 2999, column: 17, scope: !711)
!851 = !DILocation(line: 2998, column: 16, scope: !707)
!852 = !DILocation(line: 3004, column: 16, scope: !853)
!853 = distinct !DILexicalBlock(scope: !710, file: !3, line: 3004, column: 13)
!854 = !DILocation(line: 3004, column: 21, scope: !853)
!855 = !DILocation(line: 3004, column: 13, scope: !710)
!856 = !DILocation(line: 3004, column: 27, scope: !853)
!857 = !DILocation(line: 3005, column: 57, scope: !858)
!858 = distinct !DILexicalBlock(scope: !710, file: !3, line: 3005, column: 13)
!859 = !DILocation(line: 2947, column: 68, scope: !821, inlinedAt: !860)
!860 = distinct !DILocation(line: 3005, column: 19, scope: !858)
!861 = !DILocation(line: 2948, column: 31, scope: !821, inlinedAt: !860)
!862 = !DILocation(line: 2952, column: 34, scope: !821, inlinedAt: !860)
!863 = !DILocation(line: 2952, column: 48, scope: !821, inlinedAt: !860)
!864 = !DILocation(line: 2952, column: 10, scope: !821, inlinedAt: !860)
!865 = !DILocation(line: 2953, column: 10, scope: !834, inlinedAt: !860)
!866 = !DILocation(line: 2953, column: 9, scope: !821, inlinedAt: !860)
!867 = !DILocation(line: 2954, column: 9, scope: !837, inlinedAt: !860)
!868 = !DILocation(line: 2955, column: 9, scope: !837, inlinedAt: !860)
!869 = !DILocation(line: 2958, column: 1, scope: !821, inlinedAt: !860)
!870 = !DILocation(line: 3002, column: 32, scope: !710)
!871 = !DILocation(line: 3005, column: 13, scope: !710)
!872 = !DILocation(line: 3006, column: 13, scope: !858)
!873 = !DILocation(line: 2957, column: 5, scope: !821, inlinedAt: !860)
!874 = !DILocation(line: 2950, column: 28, scope: !821, inlinedAt: !860)
!875 = !DILocation(line: 3007, column: 44, scope: !710)
!876 = !DILocation(line: 3007, column: 9, scope: !710)
!877 = !DILocation(line: 3008, column: 5, scope: !711)
!878 = !DILocation(line: 0, scope: !858)
!879 = !DILocation(line: 3008, column: 17, scope: !714)
!880 = !DILocation(line: 3008, column: 16, scope: !711)
!881 = !DILocation(line: 3012, column: 16, scope: !882)
!882 = distinct !DILexicalBlock(scope: !713, file: !3, line: 3012, column: 13)
!883 = !DILocation(line: 3012, column: 21, scope: !882)
!884 = !DILocation(line: 3012, column: 13, scope: !713)
!885 = !DILocation(line: 3012, column: 27, scope: !882)
!886 = !DILocation(line: 3013, column: 57, scope: !887)
!887 = distinct !DILexicalBlock(scope: !713, file: !3, line: 3013, column: 13)
!888 = !DILocation(line: 2947, column: 68, scope: !821, inlinedAt: !889)
!889 = distinct !DILocation(line: 3013, column: 19, scope: !887)
!890 = !DILocation(line: 2948, column: 31, scope: !821, inlinedAt: !889)
!891 = !DILocation(line: 2952, column: 34, scope: !821, inlinedAt: !889)
!892 = !DILocation(line: 2952, column: 48, scope: !821, inlinedAt: !889)
!893 = !DILocation(line: 2952, column: 10, scope: !821, inlinedAt: !889)
!894 = !DILocation(line: 2953, column: 10, scope: !834, inlinedAt: !889)
!895 = !DILocation(line: 2953, column: 9, scope: !821, inlinedAt: !889)
!896 = !DILocation(line: 2954, column: 9, scope: !837, inlinedAt: !889)
!897 = !DILocation(line: 2955, column: 9, scope: !837, inlinedAt: !889)
!898 = !DILocation(line: 2958, column: 1, scope: !821, inlinedAt: !889)
!899 = !DILocation(line: 3010, column: 32, scope: !713)
!900 = !DILocation(line: 3013, column: 13, scope: !713)
!901 = !DILocation(line: 3014, column: 13, scope: !887)
!902 = !DILocation(line: 2957, column: 5, scope: !821, inlinedAt: !889)
!903 = !DILocation(line: 2950, column: 28, scope: !821, inlinedAt: !889)
!904 = !DILocation(line: 3015, column: 44, scope: !713)
!905 = !DILocation(line: 3015, column: 9, scope: !713)
!906 = !DILocation(line: 3016, column: 5, scope: !714)
!907 = !DILocation(line: 0, scope: !887)
!908 = !DILocation(line: 3016, column: 17, scope: !717)
!909 = !DILocation(line: 3016, column: 16, scope: !714)
!910 = !DILocation(line: 3035, column: 9, scope: !716)
!911 = !DILocation(line: 3036, column: 9, scope: !716)
!912 = !DILocation(line: 3036, column: 18, scope: !716)
!913 = !{!632, !632, i64 0}
!914 = !DILocation(line: 3037, column: 15, scope: !716)
!915 = !DILocation(line: 3038, column: 9, scope: !716)
!916 = !DILocation(line: 3039, column: 13, scope: !716)
!917 = !DILocation(line: 3041, column: 16, scope: !918)
!918 = distinct !DILexicalBlock(scope: !716, file: !3, line: 3041, column: 13)
!919 = !DILocation(line: 3041, column: 21, scope: !918)
!920 = !DILocation(line: 3041, column: 13, scope: !716)
!921 = !DILocation(line: 3041, column: 27, scope: !918)
!922 = !DILocation(line: 3070, column: 5, scope: !717)
!923 = !DILocation(line: 3042, column: 40, scope: !924)
!924 = distinct !DILexicalBlock(scope: !716, file: !3, line: 3042, column: 13)
!925 = !DILocation(line: 3038, column: 14, scope: !716)
!926 = !DILocation(line: 3042, column: 13, scope: !924)
!927 = !DILocation(line: 3042, column: 63, scope: !924)
!928 = !DILocation(line: 3042, column: 71, scope: !924)
!929 = !DILocation(line: 3043, column: 47, scope: !924)
!930 = !DILocation(line: 3043, column: 44, scope: !924)
!931 = !DILocation(line: 3035, column: 19, scope: !716)
!932 = !DILocation(line: 3043, column: 13, scope: !924)
!933 = !DILocation(line: 3044, column: 63, scope: !924)
!934 = !DILocation(line: 3042, column: 13, scope: !716)
!935 = !DILocation(line: 3046, column: 62, scope: !716)
!936 = !DILocation(line: 3047, column: 16, scope: !716)
!937 = !DILocation(line: 3047, column: 13, scope: !716)
!938 = !DILocation(line: 3047, column: 25, scope: !716)
!939 = !DILocation(line: 3047, column: 29, scope: !716)
!940 = !DILocation(line: 3046, column: 14, scope: !716)
!941 = !DILocation(line: 3034, column: 32, scope: !716)
!942 = !DILocation(line: 3051, column: 23, scope: !943)
!943 = distinct !DILexicalBlock(scope: !716, file: !3, line: 3051, column: 13)
!944 = !{!808, !628, i64 64}
!945 = !DILocation(line: 3051, column: 14, scope: !943)
!946 = !DILocation(line: 3051, column: 31, scope: !943)
!947 = !DILocation(line: 3051, column: 28, scope: !943)
!948 = !DILocation(line: 3051, column: 42, scope: !943)
!949 = !DILocation(line: 3051, column: 48, scope: !943)
!950 = !DILocation(line: 3051, column: 62, scope: !943)
!951 = !DILocation(line: 3052, column: 48, scope: !943)
!952 = !DILocation(line: 3051, column: 13, scope: !716)
!953 = !DILocation(line: 3053, column: 13, scope: !943)
!954 = !DILocation(line: 0, scope: !716)
!955 = !DILocation(line: 3057, column: 16, scope: !956)
!956 = distinct !DILexicalBlock(scope: !716, file: !3, line: 3057, column: 13)
!957 = !DILocation(line: 3057, column: 23, scope: !956)
!958 = !DILocation(line: 3057, column: 29, scope: !956)
!959 = !DILocation(line: 3057, column: 42, scope: !956)
!960 = !DILocation(line: 3057, column: 59, scope: !956)
!961 = !DILocation(line: 3057, column: 56, scope: !956)
!962 = !DILocation(line: 3057, column: 68, scope: !956)
!963 = !DILocation(line: 3057, column: 45, scope: !956)
!964 = !DILocation(line: 3057, column: 13, scope: !716)
!965 = !DILocation(line: 3058, column: 54, scope: !966)
!966 = distinct !DILexicalBlock(scope: !956, file: !3, line: 3057, column: 78)
!967 = !{!633, !633, i64 0}
!968 = !DILocation(line: 3058, column: 22, scope: !966)
!969 = !DILocation(line: 3061, column: 9, scope: !966)
!970 = !DILocation(line: 3068, column: 40, scope: !716)
!971 = !DILocation(line: 3065, column: 9, scope: !716)
!972 = !DILocation(line: 3066, column: 21, scope: !716)
!973 = !DILocation(line: 3066, column: 37, scope: !716)
!974 = !DILocation(line: 3066, column: 51, scope: !716)
!975 = !DILocation(line: 3066, column: 9, scope: !716)
!976 = !DILocation(line: 3067, column: 32, scope: !716)
!977 = !DILocation(line: 3067, column: 9, scope: !716)
!978 = !DILocation(line: 3068, column: 9, scope: !716)
!979 = !DILocation(line: 3069, column: 13, scope: !716)
!980 = !DILocation(line: 3069, column: 21, scope: !981)
!981 = distinct !DILexicalBlock(scope: !716, file: !3, line: 3069, column: 13)
!982 = !DILocation(line: 0, scope: !924)
!983 = !DILocation(line: 3070, column: 17, scope: !726)
!984 = !DILocation(line: 3070, column: 16, scope: !717)
!985 = !DILocation(line: 3072, column: 16, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 3072, column: 13)
!987 = distinct !DILexicalBlock(scope: !726, file: !3, line: 3070, column: 54)
!988 = !DILocation(line: 3072, column: 21, scope: !986)
!989 = !DILocation(line: 3072, column: 13, scope: !987)
!990 = !DILocation(line: 3073, column: 58, scope: !987)
!991 = !DILocation(line: 3073, column: 70, scope: !987)
!992 = !DILocation(line: 3073, column: 28, scope: !987)
!993 = !DILocation(line: 3073, column: 9, scope: !987)
!994 = !DILocation(line: 3074, column: 5, scope: !987)
!995 = !DILocation(line: 3074, column: 17, scope: !725)
!996 = !DILocation(line: 3074, column: 16, scope: !726)
!997 = !DILocation(line: 3078, column: 16, scope: !998)
!998 = distinct !DILexicalBlock(scope: !724, file: !3, line: 3078, column: 13)
!999 = !DILocation(line: 3078, column: 21, scope: !998)
!1000 = !DILocation(line: 3078, column: 13, scope: !724)
!1001 = !DILocation(line: 3078, column: 27, scope: !998)
!1002 = !DILocation(line: 3079, column: 38, scope: !724)
!1003 = !DILocation(line: 3079, column: 50, scope: !724)
!1004 = !DILocalVariable(name: "name", arg: 1, scope: !1005, file: !3, line: 1374, type: !16)
!1005 = distinct !DISubprogram(name: "sentinelGetMasterByName", scope: !3, file: !3, line: 1374, type: !1006, isLocal: false, isDefinition: true, scopeLine: 1374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1008)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!25, !16}
!1008 = !{!1004, !1009, !1010}
!1009 = !DILocalVariable(name: "ri", scope: !1005, file: !3, line: 1375, type: !25)
!1010 = !DILocalVariable(name: "sdsname", scope: !1005, file: !3, line: 1376, type: !304)
!1011 = !DILocation(line: 1374, column: 54, scope: !1005, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 3079, column: 14, scope: !724)
!1013 = !DILocation(line: 1376, column: 19, scope: !1005, inlinedAt: !1012)
!1014 = !DILocation(line: 1376, column: 9, scope: !1005, inlinedAt: !1012)
!1015 = !DILocation(line: 1378, column: 34, scope: !1005, inlinedAt: !1012)
!1016 = !DILocation(line: 1378, column: 10, scope: !1005, inlinedAt: !1012)
!1017 = !DILocation(line: 1375, column: 28, scope: !1005, inlinedAt: !1012)
!1018 = !DILocation(line: 1379, column: 5, scope: !1005, inlinedAt: !1012)
!1019 = !DILocation(line: 1380, column: 5, scope: !1005, inlinedAt: !1012)
!1020 = !DILocation(line: 3076, column: 32, scope: !724)
!1021 = !DILocation(line: 3080, column: 16, scope: !729)
!1022 = !DILocation(line: 3080, column: 13, scope: !724)
!1023 = !DILocation(line: 3081, column: 31, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !729, file: !3, line: 3080, column: 25)
!1025 = !{!1026, !631, i64 88}
!1026 = !{!"sharedObjectsStruct", !631, i64 0, !631, i64 8, !631, i64 16, !631, i64 24, !631, i64 32, !631, i64 40, !631, i64 48, !631, i64 56, !631, i64 64, !631, i64 72, !631, i64 80, !631, i64 88, !631, i64 96, !631, i64 104, !631, i64 112, !631, i64 120, !631, i64 128, !631, i64 136, !631, i64 144, !631, i64 152, !631, i64 160, !631, i64 168, !631, i64 176, !631, i64 184, !631, i64 192, !631, i64 200, !631, i64 208, !631, i64 216, !631, i64 224, !631, i64 232, !631, i64 240, !631, i64 248, !631, i64 256, !631, i64 264, !631, i64 272, !631, i64 280, !631, i64 288, !631, i64 296, !631, i64 304, !631, i64 312, !631, i64 320, !631, i64 328, !631, i64 336, !631, i64 344, !631, i64 352, !631, i64 360, !629, i64 368, !629, i64 448, !629, i64 80448, !629, i64 80704, !631, i64 80960, !631, i64 80968}
!1027 = !DILocation(line: 3081, column: 13, scope: !1024)
!1028 = !DILocation(line: 3082, column: 9, scope: !1024)
!1029 = !DILocalVariable(name: "master", arg: 1, scope: !1030, file: !3, line: 1554, type: !25)
!1030 = distinct !DISubprogram(name: "sentinelGetCurrentMasterAddress", scope: !3, file: !3, line: 1554, type: !1031, isLocal: false, isDefinition: true, scopeLine: 1554, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1033)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!34, !25}
!1033 = !{!1029}
!1034 = !DILocation(line: 1554, column: 70, scope: !1030, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 3083, column: 34, scope: !728)
!1036 = !DILocation(line: 1560, column: 18, scope: !1037, inlinedAt: !1035)
!1037 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1560, column: 9)
!1038 = !DILocation(line: 1560, column: 24, scope: !1037, inlinedAt: !1035)
!1039 = !DILocation(line: 1560, column: 52, scope: !1037, inlinedAt: !1035)
!1040 = !DILocation(line: 1561, column: 17, scope: !1037, inlinedAt: !1035)
!1041 = !DILocation(line: 1561, column: 9, scope: !1037, inlinedAt: !1035)
!1042 = !DILocation(line: 1561, column: 32, scope: !1037, inlinedAt: !1035)
!1043 = !DILocation(line: 1562, column: 17, scope: !1037, inlinedAt: !1035)
!1044 = !{!627, !628, i64 248}
!1045 = !DILocation(line: 1562, column: 32, scope: !1037, inlinedAt: !1035)
!1046 = !DILocation(line: 1560, column: 9, scope: !1030, inlinedAt: !1035)
!1047 = !DILocation(line: 1564, column: 40, scope: !1048, inlinedAt: !1035)
!1048 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 1563, column: 5)
!1049 = !DILocation(line: 1564, column: 9, scope: !1048, inlinedAt: !1035)
!1050 = !DILocation(line: 1566, column: 24, scope: !1051, inlinedAt: !1035)
!1051 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 1565, column: 12)
!1052 = !DILocation(line: 1566, column: 9, scope: !1051, inlinedAt: !1035)
!1053 = !DILocation(line: 0, scope: !728)
!1054 = !DILocation(line: 1568, column: 1, scope: !1030, inlinedAt: !1035)
!1055 = !DILocation(line: 3083, column: 27, scope: !728)
!1056 = !DILocation(line: 3085, column: 13, scope: !728)
!1057 = !DILocation(line: 3086, column: 41, scope: !728)
!1058 = !DILocation(line: 3086, column: 13, scope: !728)
!1059 = !DILocation(line: 3087, column: 42, scope: !728)
!1060 = !{!676, !628, i64 8}
!1061 = !DILocation(line: 3087, column: 36, scope: !728)
!1062 = !DILocation(line: 3087, column: 13, scope: !728)
!1063 = !DILocation(line: 3089, column: 5, scope: !725)
!1064 = !DILocation(line: 3089, column: 17, scope: !732)
!1065 = !DILocation(line: 3089, column: 16, scope: !725)
!1066 = !DILocation(line: 3093, column: 16, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !731, file: !3, line: 3093, column: 13)
!1068 = !DILocation(line: 3093, column: 21, scope: !1067)
!1069 = !DILocation(line: 3093, column: 13, scope: !731)
!1070 = !DILocation(line: 3093, column: 27, scope: !1067)
!1071 = !DILocation(line: 3094, column: 57, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !731, file: !3, line: 3094, column: 13)
!1073 = !DILocation(line: 2947, column: 68, scope: !821, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 3094, column: 19, scope: !1072)
!1075 = !DILocation(line: 2948, column: 31, scope: !821, inlinedAt: !1074)
!1076 = !DILocation(line: 2952, column: 34, scope: !821, inlinedAt: !1074)
!1077 = !DILocation(line: 2952, column: 48, scope: !821, inlinedAt: !1074)
!1078 = !DILocation(line: 2952, column: 10, scope: !821, inlinedAt: !1074)
!1079 = !DILocation(line: 2953, column: 10, scope: !834, inlinedAt: !1074)
!1080 = !DILocation(line: 2953, column: 9, scope: !821, inlinedAt: !1074)
!1081 = !DILocation(line: 2954, column: 9, scope: !837, inlinedAt: !1074)
!1082 = !DILocation(line: 2955, column: 9, scope: !837, inlinedAt: !1074)
!1083 = !DILocation(line: 2958, column: 1, scope: !821, inlinedAt: !1074)
!1084 = !DILocation(line: 3091, column: 32, scope: !731)
