; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.client = type { i64, i32, %struct.redisDb*, %struct.redisObject*, i8*, i64, i8*, i64, i32, %struct.redisObject**, %struct.redisCommand*, %struct.redisCommand*, i32, i32, i64, %struct.list*, i64, i64, i64, i64, i64, i32, i32, i32, i32, i32, i64, i64, i8*, i64, i64, i64, i64, i64, [41 x i8], i32, [46 x i8], i32, %struct.multiState, i32, %struct.blockingState, i64, %struct.list*, %struct.dict*, %struct.list*, i8*, %struct.listNode*, i32, [16384 x i8] }
%struct.redisDb = type { %struct.dict*, %struct.dict*, %struct.dict*, %struct.dict*, %struct.dict*, i32, i64, %struct.list* }
%struct.redisObject = type { i32, i32, i8* }
%struct.redisCommand = type { i8*, {}*, i32, i8*, i32, i32* (%struct.redisCommand*, %struct.redisObject**, i32, i32*)*, i32, i32, i32, i64, i64 }
%struct.multiState = type { %struct.multiCmd*, i32, i32, i32, i64 }
%struct.multiCmd = type { %struct.redisObject**, i32, %struct.redisCommand* }
%struct.blockingState = type { i64, %struct.dict*, %struct.redisObject*, i64, %struct.redisObject*, %struct.redisObject*, i64, i64, i32, i32, i64, i8* }
%struct.dict = type { %struct.dictType*, i8*, [2 x %struct.dictht], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "redisCommandTable", scope: !2, file: !3, line: 147, type: !1140, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !315)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !9, !38, !42, !40, !44, !55, !56, !57, !60, !265, !37, !137, !267, !74, !268, !271, !277, !279, !289, !299, !308, !259}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !11, line: 54, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !11, line: 47, size: 384, elements: !13)
!13 = !{!14, !23, !24, !28, !32, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !12, file: !11, line: 48, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !11, line: 40, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !11, line: 36, size: 192, elements: !18)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !17, file: !11, line: 37, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !11, line: 38, baseType: !20, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !17, file: !11, line: 39, baseType: !6, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !12, file: !11, line: 49, baseType: !15, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !12, file: !11, line: 50, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!6, !6}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !12, file: !11, line: 51, baseType: !29, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !6}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !12, file: !11, line: 52, baseType: !33, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!7, !6, !6}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !11, line: 53, baseType: !37, size: 64, offset: 320)
!37 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !39, line: 43, baseType: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !46, line: 622, baseType: !47)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !46, line: 614, size: 128, elements: !48)
!48 = !{!49, !51, !52, !53, !54}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !46, line: 615, baseType: !50, size: 4, flags: DIFlagBitField, extraData: i64 0)
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !47, file: !46, line: 616, baseType: !50, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !47, file: !46, line: 617, baseType: !50, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !47, file: !46, line: 620, baseType: !7, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !47, file: !46, line: 621, baseType: !6, size: 64, offset: 64)
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !7}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !46, line: 1307, size: 640, elements: !62)
!62 = !{!63, !64, !251, !252, !253, !254, !260, !261, !262, !263, !264}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !46, line: 1308, baseType: !40, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !61, file: !46, line: 1309, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !46, line: 1305, baseType: !67)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !46, line: 780, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !46, line: 723, size: 135360, elements: !72)
!72 = !{!73, !78, !79, !154, !155, !156, !161, !162, !163, !164, !166, !167, !168, !169, !170, !171, !172, !173, !174, !177, !178, !179, !180, !181, !182, !183, !184, !189, !190, !191, !192, !193, !194, !195, !196, !200, !201, !205, !206, !222, !223, !240, !241, !242, !243, !244, !245, !246, !247}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !71, file: !46, line: 724, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !75, line: 60, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !77, line: 105, baseType: !37)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !71, file: !46, line: 725, baseType: !7, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !71, file: !46, line: 726, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !46, line: 656, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !46, line: 647, size: 512, elements: !83)
!83 = !{!84, !147, !148, !149, !150, !151, !152, !153}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !82, file: !46, line: 648, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !87, line: 82, baseType: !88)
!87 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !87, line: 76, size: 768, elements: !89)
!89 = !{!90, !115, !116, !145, !146}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !87, line: 77, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !87, line: 65, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !87, line: 58, size: 384, elements: !94)
!94 = !{!95, !101, !105, !106, !110, !114}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !93, file: !87, line: 59, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!74, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !93, file: !87, line: 60, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!6, !6, !99}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !93, file: !87, line: 61, baseType: !102, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !93, file: !87, line: 62, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!7, !6, !99, !99}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !93, file: !87, line: 63, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !6, !6}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !93, file: !87, line: 64, baseType: !111, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !88, file: !87, line: 78, baseType: !6, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !88, file: !87, line: 79, baseType: !117, size: 512, offset: 128)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 512, elements: !143)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !87, line: 74, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !87, line: 69, size: 256, elements: !120)
!120 = !{!121, !140, !141, !142}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !119, file: !87, line: 70, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !87, line: 56, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !87, line: 47, size: 192, elements: !126)
!126 = !{!127, !128, !138}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !125, file: !87, line: 48, baseType: !6, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !125, file: !87, line: 54, baseType: !129, size: 64, offset: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !87, line: 49, size: 64, elements: !130)
!130 = !{!131, !132, !133, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !87, line: 50, baseType: !6, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !129, file: !87, line: 51, baseType: !74, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !129, file: !87, line: 52, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !75, line: 56, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !77, line: 103, baseType: !55)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !129, file: !87, line: 53, baseType: !137, size: 64)
!137 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !87, line: 55, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !87, line: 71, baseType: !37, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !119, file: !87, line: 72, baseType: !37, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !119, file: !87, line: 73, baseType: !37, size: 64, offset: 192)
!143 = !{!144}
!144 = !DISubrange(count: 2)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !88, file: !87, line: 80, baseType: !55, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !88, file: !87, line: 81, baseType: !37, size: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !82, file: !46, line: 649, baseType: !85, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !82, file: !46, line: 650, baseType: !85, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !82, file: !46, line: 651, baseType: !85, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !82, file: !46, line: 652, baseType: !85, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !82, file: !46, line: 653, baseType: !7, size: 32, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !82, file: !46, line: 654, baseType: !8, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !82, file: !46, line: 655, baseType: !9, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !46, line: 727, baseType: !44, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !71, file: !46, line: 728, baseType: !38, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !71, file: !46, line: 729, baseType: !157, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 40, baseType: !159)
!158 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !160, line: 129, baseType: !37)
!160 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !71, file: !46, line: 730, baseType: !38, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !71, file: !46, line: 734, baseType: !157, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !71, file: !46, line: 735, baseType: !7, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !71, file: !46, line: 736, baseType: !165, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !71, file: !46, line: 737, baseType: !60, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !71, file: !46, line: 737, baseType: !60, size: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !71, file: !46, line: 738, baseType: !7, size: 32, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !71, file: !46, line: 739, baseType: !7, size: 32, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !71, file: !46, line: 740, baseType: !55, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !71, file: !46, line: 741, baseType: !9, size: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !71, file: !46, line: 742, baseType: !56, size: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !71, file: !46, line: 743, baseType: !157, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !71, file: !46, line: 745, baseType: !175, size: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !176, line: 34, baseType: !55)
!176 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !71, file: !46, line: 746, baseType: !175, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !71, file: !46, line: 747, baseType: !175, size: 64, offset: 1216)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !71, file: !46, line: 748, baseType: !7, size: 32, offset: 1280)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !71, file: !46, line: 749, baseType: !7, size: 32, offset: 1312)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !71, file: !46, line: 750, baseType: !7, size: 32, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !71, file: !46, line: 751, baseType: !7, size: 32, offset: 1376)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !71, file: !46, line: 752, baseType: !7, size: 32, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !71, file: !46, line: 753, baseType: !185, size: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !186, line: 173, baseType: !187)
!186 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !160, line: 100, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 44, baseType: !55)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !71, file: !46, line: 754, baseType: !185, size: 64, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !71, file: !46, line: 755, baseType: !38, size: 64, offset: 1600)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !71, file: !46, line: 756, baseType: !8, size: 64, offset: 1664)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !71, file: !46, line: 757, baseType: !8, size: 64, offset: 1728)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !71, file: !46, line: 758, baseType: !8, size: 64, offset: 1792)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !71, file: !46, line: 759, baseType: !8, size: 64, offset: 1856)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !71, file: !46, line: 760, baseType: !8, size: 64, offset: 1920)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !71, file: !46, line: 763, baseType: !197, size: 328, offset: 1984)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 328, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 41)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !71, file: !46, line: 764, baseType: !7, size: 32, offset: 2336)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !71, file: !46, line: 765, baseType: !202, size: 368, offset: 2368)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 368, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 46)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !71, file: !46, line: 766, baseType: !7, size: 32, offset: 2752)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !71, file: !46, line: 767, baseType: !207, size: 256, offset: 2816)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !46, line: 673, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !46, line: 665, size: 256, elements: !209)
!209 = !{!210, !218, !219, !220, !221}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !208, file: !46, line: 666, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !46, line: 663, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !46, line: 659, size: 192, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !213, file: !46, line: 660, baseType: !165, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !213, file: !46, line: 661, baseType: !7, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !213, file: !46, line: 662, baseType: !60, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !208, file: !46, line: 667, baseType: !7, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !208, file: !46, line: 668, baseType: !7, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !208, file: !46, line: 671, baseType: !7, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !208, file: !46, line: 672, baseType: !175, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !71, file: !46, line: 768, baseType: !7, size: 32, offset: 3072)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !71, file: !46, line: 769, baseType: !224, size: 704, offset: 3136)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !46, line: 703, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !46, line: 677, size: 704, elements: !226)
!226 = !{!227, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !225, file: !46, line: 679, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !46, line: 52, baseType: !8)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !225, file: !46, line: 683, baseType: !85, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !225, file: !46, line: 685, baseType: !44, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !225, file: !46, line: 689, baseType: !157, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !225, file: !46, line: 690, baseType: !44, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !225, file: !46, line: 691, baseType: !44, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !225, file: !46, line: 692, baseType: !228, size: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !225, file: !46, line: 692, baseType: !228, size: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !225, file: !46, line: 693, baseType: !7, size: 32, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !225, file: !46, line: 696, baseType: !7, size: 32, offset: 544)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !225, file: !46, line: 697, baseType: !8, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !225, file: !46, line: 700, baseType: !6, size: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !71, file: !46, line: 770, baseType: !8, size: 64, offset: 3840)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !71, file: !46, line: 771, baseType: !9, size: 64, offset: 3904)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !71, file: !46, line: 772, baseType: !85, size: 64, offset: 3968)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !71, file: !46, line: 773, baseType: !9, size: 64, offset: 4032)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !71, file: !46, line: 774, baseType: !38, size: 64, offset: 4096)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !71, file: !46, line: 775, baseType: !15, size: 64, offset: 4160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !71, file: !46, line: 778, baseType: !7, size: 32, offset: 4224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !71, file: !46, line: 779, baseType: !248, size: 131072, offset: 4256)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 131072, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 16384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !61, file: !46, line: 1310, baseType: !7, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !61, file: !46, line: 1311, baseType: !40, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !46, line: 1312, baseType: !7, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !61, file: !46, line: 1315, baseType: !255, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !46, line: 1306, baseType: !257)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !60, !165, !7, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !61, file: !46, line: 1317, baseType: !7, size: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !61, file: !46, line: 1318, baseType: !7, size: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !61, file: !46, line: 1319, baseType: !7, size: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !61, file: !46, line: 1320, baseType: !8, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !61, file: !46, line: 1320, baseType: !8, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !75, line: 67, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !77, line: 214, baseType: !55)
!267 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !75, line: 24, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !77, line: 43, baseType: !43)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !176, line: 44, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !272, file: !176, line: 45, baseType: !175, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !272, file: !176, line: 46, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !176, line: 39, baseType: !55)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !75, line: 82, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !77, line: 232, baseType: !37)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !39, line: 51, size: 24, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !280, file: !39, line: 52, baseType: !269, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !280, file: !39, line: 53, baseType: !269, size: 8, offset: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !280, file: !39, line: 54, baseType: !43, size: 8, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !280, file: !39, line: 55, baseType: !286, offset: 24)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: -1)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !39, line: 57, size: 40, elements: !291)
!291 = !{!292, !296, !297, !298}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !290, file: !39, line: 58, baseType: !293, size: 16)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !75, line: 36, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !77, line: 57, baseType: !295)
!295 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !290, file: !39, line: 59, baseType: !293, size: 16, offset: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !39, line: 60, baseType: !43, size: 8, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !290, file: !39, line: 61, baseType: !286, offset: 40)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !39, line: 63, size: 72, elements: !301)
!301 = !{!302, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !300, file: !39, line: 64, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !75, line: 48, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !77, line: 79, baseType: !50)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !300, file: !39, line: 65, baseType: !303, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !39, line: 66, baseType: !43, size: 8, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !300, file: !39, line: 67, baseType: !286, offset: 72)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !39, line: 69, size: 136, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !309, file: !39, line: 70, baseType: !74, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !309, file: !39, line: 71, baseType: !74, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !39, line: 72, baseType: !43, size: 8, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !309, file: !39, line: 73, baseType: !286, offset: 136)
!315 = !{!0, !316, !318, !320, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !362, !364, !517, !531, !596, !598, !600, !602, !604, !1130, !1133, !1138}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "objectKeyPointerValueDictType", scope: !2, file: !3, line: 591, type: !92, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "objectKeyHeapPointerValueDictType", scope: !2, file: !3, line: 602, type: !92, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "setDictType", scope: !2, file: !3, line: 612, type: !92, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "zsetDictType", scope: !2, file: !3, line: 622, type: !92, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "dbDictType", scope: !2, file: !3, line: 632, type: !92, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "shaScriptObjectDictType", scope: !2, file: !3, line: 642, type: !92, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "keyptrDictType", scope: !2, file: !3, line: 652, type: !92, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "commandTableDictType", scope: !2, file: !3, line: 662, type: !92, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "hashDictType", scope: !2, file: !3, line: 672, type: !92, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "keylistDictType", scope: !2, file: !3, line: 684, type: !92, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "clusterNodesDictType", scope: !2, file: !3, line: 695, type: !92, isLocal: false, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "clusterNodesBlackListDictType", scope: !2, file: !3, line: 707, type: !92, isLocal: false, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "modulesDictType", scope: !2, file: !3, line: 719, type: !92, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "migrateCacheDictType", scope: !2, file: !3, line: 729, type: !92, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "replScriptCacheDictType", scope: !2, file: !3, line: 741, type: !92, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "resize_db", scope: !348, file: !3, line: 1042, type: !50, isLocal: true, isDefinition: true)
!348 = distinct !DISubprogram(name: "databasesCron", scope: !3, file: !3, line: 1020, type: !349, isLocal: false, isDefinition: true, scopeLine: 1020, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !351)
!349 = !DISubroutineType(types: !350)
!350 = !{null}
!351 = !{!352, !355, !356}
!352 = !DILocalVariable(name: "dbs_per_call", scope: !353, file: !3, line: 1044, type: !7)
!353 = distinct !DILexicalBlock(scope: !354, file: !3, line: 1038, column: 67)
!354 = distinct !DILexicalBlock(scope: !348, file: !3, line: 1038, column: 9)
!355 = !DILocalVariable(name: "j", scope: !353, file: !3, line: 1045, type: !7)
!356 = !DILocalVariable(name: "work_done", scope: !357, file: !3, line: 1059, type: !7)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 1058, column: 48)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 1058, column: 13)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 1058, column: 13)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 1057, column: 37)
!361 = distinct !DILexicalBlock(scope: !353, file: !3, line: 1057, column: 13)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "rehash_db", scope: !348, file: !3, line: 1043, type: !50, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "call_uname", scope: !366, file: !3, line: 3128, type: !7, isLocal: true, isDefinition: true)
!366 = distinct !DISubprogram(name: "genRedisInfoString", scope: !3, file: !3, line: 3111, type: !367, isLocal: false, isDefinition: true, scopeLine: 3111, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!38, !40}
!369 = !{!370, !371, !372, !373, !374, !398, !399, !400, !401, !402, !405, !406, !409, !410, !416, !417, !418, !419, !420, !421, !422, !423, !424, !427, !428, !464, !469, !470, !471, !472, !477, !480, !481, !487, !489, !490, !491, !492, !493, !494, !497, !498, !510, !516}
!370 = !DILocalVariable(name: "section", arg: 1, scope: !366, file: !3, line: 3111, type: !40)
!371 = !DILocalVariable(name: "info", scope: !366, file: !3, line: 3112, type: !38)
!372 = !DILocalVariable(name: "uptime", scope: !366, file: !3, line: 3113, type: !175)
!373 = !DILocalVariable(name: "j", scope: !366, file: !3, line: 3114, type: !7)
!374 = !DILocalVariable(name: "self_ru", scope: !366, file: !3, line: 3115, type: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !376, line: 26, size: 2176, elements: !377)
!376 = !DIFile(filename: "/root/.unikraft/unikraft/lib/posix-process/musl-imported/include/sys/resource.h", directory: "/root/.unikraft/apps/redis/build")
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !375, file: !376, line: 27, baseType: !272, size: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !375, file: !376, line: 28, baseType: !272, size: 128, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !375, file: !376, line: 30, baseType: !55, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !375, file: !376, line: 31, baseType: !55, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !375, file: !376, line: 32, baseType: !55, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !375, file: !376, line: 33, baseType: !55, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !375, file: !376, line: 34, baseType: !55, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !375, file: !376, line: 35, baseType: !55, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !375, file: !376, line: 36, baseType: !55, size: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !375, file: !376, line: 37, baseType: !55, size: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !375, file: !376, line: 38, baseType: !55, size: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !375, file: !376, line: 39, baseType: !55, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !375, file: !376, line: 40, baseType: !55, size: 64, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !375, file: !376, line: 41, baseType: !55, size: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !375, file: !376, line: 42, baseType: !55, size: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !375, file: !376, line: 43, baseType: !55, size: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved", scope: !375, file: !376, line: 45, baseType: !395, size: 1024, offset: 1152)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 1024, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 16)
!398 = !DILocalVariable(name: "c_ru", scope: !366, file: !3, line: 3115, type: !375)
!399 = !DILocalVariable(name: "allsections", scope: !366, file: !3, line: 3116, type: !7)
!400 = !DILocalVariable(name: "defsections", scope: !366, file: !3, line: 3116, type: !7)
!401 = !DILocalVariable(name: "sections", scope: !366, file: !3, line: 3117, type: !7)
!402 = !DILocalVariable(name: "mode", scope: !403, file: !3, line: 3130, type: !40)
!403 = distinct !DILexicalBlock(scope: !404, file: !3, line: 3127, column: 70)
!404 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3127, column: 9)
!405 = !DILocalVariable(name: "lruclock", scope: !403, file: !3, line: 3144, type: !50)
!406 = !DILocalVariable(name: "maxin", scope: !407, file: !3, line: 3196, type: !157)
!407 = distinct !DILexicalBlock(scope: !408, file: !3, line: 3195, column: 71)
!408 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3195, column: 9)
!409 = !DILocalVariable(name: "maxout", scope: !407, file: !3, line: 3196, type: !157)
!410 = !DILocalVariable(name: "hmem", scope: !411, file: !3, line: 3212, type: !413)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 3211, column: 70)
!412 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3211, column: 9)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 64)
!416 = !DILocalVariable(name: "peak_hmem", scope: !411, file: !3, line: 3213, type: !413)
!417 = !DILocalVariable(name: "total_system_hmem", scope: !411, file: !3, line: 3214, type: !413)
!418 = !DILocalVariable(name: "used_memory_lua_hmem", scope: !411, file: !3, line: 3215, type: !413)
!419 = !DILocalVariable(name: "used_memory_scripts_hmem", scope: !411, file: !3, line: 3216, type: !413)
!420 = !DILocalVariable(name: "used_memory_rss_hmem", scope: !411, file: !3, line: 3217, type: !413)
!421 = !DILocalVariable(name: "maxmemory_hmem", scope: !411, file: !3, line: 3218, type: !413)
!422 = !DILocalVariable(name: "zmalloc_used", scope: !411, file: !3, line: 3219, type: !157)
!423 = !DILocalVariable(name: "total_system_mem", scope: !411, file: !3, line: 3220, type: !157)
!424 = !DILocalVariable(name: "evict_policy", scope: !411, file: !3, line: 3221, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!427 = !DILocalVariable(name: "memory_lua", scope: !411, file: !3, line: 3222, type: !8)
!428 = !DILocalVariable(name: "mh", scope: !411, file: !3, line: 3223, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisMemOverhead", file: !46, line: 865, size: 1472, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !450, !451, !452, !453, !454, !455, !456, !457}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "peak_allocated", scope: !430, file: !46, line: 866, baseType: !157, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "total_allocated", scope: !430, file: !46, line: 867, baseType: !157, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "startup_allocated", scope: !430, file: !46, line: 868, baseType: !157, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog", scope: !430, file: !46, line: 869, baseType: !157, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "clients_slaves", scope: !430, file: !46, line: 870, baseType: !157, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "clients_normal", scope: !430, file: !46, line: 871, baseType: !157, size: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "aof_buffer", scope: !430, file: !46, line: 872, baseType: !157, size: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lua_caches", scope: !430, file: !46, line: 873, baseType: !157, size: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "overhead_total", scope: !430, file: !46, line: 874, baseType: !157, size: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !430, file: !46, line: 875, baseType: !157, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "total_keys", scope: !430, file: !46, line: 876, baseType: !157, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_key", scope: !430, file: !46, line: 877, baseType: !157, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dataset_perc", scope: !430, file: !46, line: 878, baseType: !267, size: 32, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "peak_perc", scope: !430, file: !46, line: 879, baseType: !267, size: 32, offset: 800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "total_frag", scope: !430, file: !46, line: 880, baseType: !267, size: 32, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "total_frag_bytes", scope: !430, file: !46, line: 881, baseType: !448, size: 64, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !186, line: 200, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !160, line: 145, baseType: !55)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_frag", scope: !430, file: !46, line: 882, baseType: !267, size: 32, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_frag_bytes", scope: !430, file: !46, line: 883, baseType: !448, size: 64, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_rss", scope: !430, file: !46, line: 884, baseType: !267, size: 32, offset: 1088)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_rss_bytes", scope: !430, file: !46, line: 885, baseType: !448, size: 64, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rss_extra", scope: !430, file: !46, line: 886, baseType: !267, size: 32, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rss_extra_bytes", scope: !430, file: !46, line: 887, baseType: !157, size: 64, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_dbs", scope: !430, file: !46, line: 888, baseType: !157, size: 64, offset: 1344)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !430, file: !46, line: 893, baseType: !458, size: 64, offset: 1408)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !46, line: 889, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dbid", scope: !459, file: !46, line: 890, baseType: !157, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "overhead_ht_main", scope: !459, file: !46, line: 891, baseType: !157, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "overhead_ht_expires", scope: !459, file: !46, line: 892, baseType: !157, size: 64, offset: 128)
!464 = !DILocalVariable(name: "perc", scope: !465, file: !3, line: 3386, type: !137)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 3385, column: 29)
!466 = distinct !DILexicalBlock(scope: !467, file: !3, line: 3385, column: 13)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 3328, column: 75)
!468 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3328, column: 9)
!469 = !DILocalVariable(name: "eta", scope: !465, file: !3, line: 3387, type: !175)
!470 = !DILocalVariable(name: "elapsed", scope: !465, file: !3, line: 3387, type: !175)
!471 = !DILocalVariable(name: "remaining_bytes", scope: !465, file: !3, line: 3388, type: !185)
!472 = !DILocalVariable(name: "slave_repl_offset", scope: !473, file: !3, line: 3484, type: !8)
!473 = distinct !DILexicalBlock(scope: !474, file: !3, line: 3483, column: 32)
!474 = distinct !DILexicalBlock(scope: !475, file: !3, line: 3483, column: 13)
!475 = distinct !DILexicalBlock(scope: !476, file: !3, line: 3477, column: 75)
!476 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3477, column: 9)
!477 = !DILocalVariable(name: "slaveid", scope: !478, file: !3, line: 3544, type: !7)
!478 = distinct !DILexicalBlock(scope: !479, file: !3, line: 3543, column: 40)
!479 = distinct !DILexicalBlock(scope: !475, file: !3, line: 3543, column: 13)
!480 = !DILocalVariable(name: "ln", scope: !478, file: !3, line: 3545, type: !15)
!481 = !DILocalVariable(name: "li", scope: !478, file: !3, line: 3546, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !11, line: 45, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !11, line: 42, size: 128, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !11, line: 43, baseType: !15, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !483, file: !11, line: 44, baseType: !7, size: 32, offset: 64)
!487 = !DILocalVariable(name: "slave", scope: !488, file: !3, line: 3550, type: !69)
!488 = distinct !DILexicalBlock(scope: !478, file: !3, line: 3549, column: 41)
!489 = !DILocalVariable(name: "state", scope: !488, file: !3, line: 3551, type: !40)
!490 = !DILocalVariable(name: "ip", scope: !488, file: !3, line: 3552, type: !202)
!491 = !DILocalVariable(name: "slaveip", scope: !488, file: !3, line: 3552, type: !40)
!492 = !DILocalVariable(name: "port", scope: !488, file: !3, line: 3553, type: !7)
!493 = !DILocalVariable(name: "lag", scope: !488, file: !3, line: 3554, type: !55)
!494 = !DILocalVariable(name: "c", scope: !495, file: !3, line: 3624, type: !60)
!495 = distinct !DILexicalBlock(scope: !496, file: !3, line: 3620, column: 61)
!496 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3620, column: 9)
!497 = !DILocalVariable(name: "de", scope: !495, file: !3, line: 3625, type: !123)
!498 = !DILocalVariable(name: "di", scope: !495, file: !3, line: 3626, type: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !87, line: 95, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !87, line: 88, size: 384, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !501, file: !87, line: 89, baseType: !85, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !501, file: !87, line: 90, baseType: !55, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !501, file: !87, line: 91, baseType: !7, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !501, file: !87, line: 91, baseType: !7, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !501, file: !87, line: 92, baseType: !123, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !501, file: !87, line: 92, baseType: !123, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !501, file: !87, line: 94, baseType: !8, size: 64, offset: 320)
!510 = !DILocalVariable(name: "keys", scope: !511, file: !3, line: 3653, type: !8)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 3652, column: 44)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 3652, column: 9)
!513 = distinct !DILexicalBlock(scope: !514, file: !3, line: 3652, column: 9)
!514 = distinct !DILexicalBlock(scope: !515, file: !3, line: 3649, column: 72)
!515 = distinct !DILexicalBlock(scope: !366, file: !3, line: 3649, column: 9)
!516 = !DILocalVariable(name: "vkeys", scope: !511, file: !3, line: 3653, type: !8)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "name", scope: !366, file: !3, line: 3129, type: !519, isLocal: true, isDefinition: true)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !520, line: 43, size: 3120, elements: !521)
!520 = !DIFile(filename: "/root/.unikraft/unikraft/lib/posix-sysinfo/include/sys/utsname.h", directory: "/root/.unikraft/apps/redis/build")
!521 = !{!522, !526, !527, !528, !529, !530}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !519, file: !520, line: 44, baseType: !523, size: 520)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 520, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 65)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !519, file: !520, line: 45, baseType: !523, size: 520, offset: 520)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !519, file: !520, line: 46, baseType: !523, size: 520, offset: 1040)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !519, file: !520, line: 47, baseType: !523, size: 520, offset: 1560)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !519, file: !520, line: 48, baseType: !523, size: 520, offset: 2080)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !519, file: !520, line: 49, baseType: !523, size: 520, offset: 2600)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "shared", scope: !2, file: !3, line: 81, type: !533, isLocal: false, isDefinition: true)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sharedObjectsStruct", file: !46, line: 793, size: 647808, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !589, !593, !594, !595}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "crlf", scope: !533, file: !46, line: 794, baseType: !44, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "emptybulk", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "czero", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cone", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cnegone", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pong", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !533, file: !46, line: 794, baseType: !44, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "colon", scope: !533, file: !46, line: 795, baseType: !44, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nullbulk", scope: !533, file: !46, line: 795, baseType: !44, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nullmultibulk", scope: !533, file: !46, line: 795, baseType: !44, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !533, file: !46, line: 795, baseType: !44, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "emptymultibulk", scope: !533, file: !46, line: 796, baseType: !44, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "wrongtypeerr", scope: !533, file: !46, line: 796, baseType: !44, size: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nokeyerr", scope: !533, file: !46, line: 796, baseType: !44, size: 64, offset: 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "syntaxerr", scope: !533, file: !46, line: 796, baseType: !44, size: 64, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sameobjecterr", scope: !533, file: !46, line: 796, baseType: !44, size: 64, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "outofrangeerr", scope: !533, file: !46, line: 797, baseType: !44, size: 64, offset: 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "noscripterr", scope: !533, file: !46, line: 797, baseType: !44, size: 64, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "loadingerr", scope: !533, file: !46, line: 797, baseType: !44, size: 64, offset: 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "slowscripterr", scope: !533, file: !46, line: 797, baseType: !44, size: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bgsaveerr", scope: !533, file: !46, line: 797, baseType: !44, size: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "masterdownerr", scope: !533, file: !46, line: 798, baseType: !44, size: 64, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "roslaveerr", scope: !533, file: !46, line: 798, baseType: !44, size: 64, offset: 1536)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "execaborterr", scope: !533, file: !46, line: 798, baseType: !44, size: 64, offset: 1600)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "noautherr", scope: !533, file: !46, line: 798, baseType: !44, size: 64, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "noreplicaserr", scope: !533, file: !46, line: 798, baseType: !44, size: 64, offset: 1728)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "busykeyerr", scope: !533, file: !46, line: 799, baseType: !44, size: 64, offset: 1792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "oomerr", scope: !533, file: !46, line: 799, baseType: !44, size: 64, offset: 1856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "plus", scope: !533, file: !46, line: 799, baseType: !44, size: 64, offset: 1920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "messagebulk", scope: !533, file: !46, line: 799, baseType: !44, size: 64, offset: 1984)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pmessagebulk", scope: !533, file: !46, line: 799, baseType: !44, size: 64, offset: 2048)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "subscribebulk", scope: !533, file: !46, line: 799, baseType: !44, size: 64, offset: 2112)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "unsubscribebulk", scope: !533, file: !46, line: 800, baseType: !44, size: 64, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "psubscribebulk", scope: !533, file: !46, line: 800, baseType: !44, size: 64, offset: 2240)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "punsubscribebulk", scope: !533, file: !46, line: 800, baseType: !44, size: 64, offset: 2304)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !533, file: !46, line: 800, baseType: !44, size: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !533, file: !46, line: 800, baseType: !44, size: 64, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rpop", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2496)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lpop", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2560)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lpush", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2624)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rpoplpush", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2688)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "zpopmin", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2752)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "zpopmax", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2816)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "emptyscan", scope: !533, file: !46, line: 801, baseType: !44, size: 64, offset: 2880)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !533, file: !46, line: 802, baseType: !582, size: 640, offset: 2944)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 640, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 10)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "integers", scope: !533, file: !46, line: 803, baseType: !586, size: 640000, offset: 3584)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 640000, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 10000)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mbulkhdr", scope: !533, file: !46, line: 804, baseType: !590, size: 2048, offset: 643584)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bulkhdr", scope: !533, file: !46, line: 805, baseType: !590, size: 2048, offset: 645632)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "minstring", scope: !533, file: !46, line: 806, baseType: !38, size: 64, offset: 647680)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "maxstring", scope: !533, file: !46, line: 806, baseType: !38, size: 64, offset: 647744)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "R_Zero", scope: !2, file: !3, line: 87, type: !137, isLocal: false, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "R_PosInf", scope: !2, file: !3, line: 87, type: !137, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "R_NegInf", scope: !2, file: !3, line: 87, type: !137, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "R_Nan", scope: !2, file: !3, line: 87, type: !137, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "server", scope: !2, file: !3, line: 92, type: !606, isLocal: false, isDefinition: true)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisServer", file: !46, line: 940, size: 25408, elements: !607)
!607 = !{!608, !611, !612, !613, !615, !616, !617, !618, !619, !620, !621, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !699, !700, !701, !703, !704, !705, !708, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !739, !740, !741, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !799, !800, !801, !802, !803, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !903, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1128, !1129}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !606, file: !46, line: 942, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !610, line: 61, baseType: !7)
!610 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!611 = !DIDerivedType(tag: DW_TAG_member, name: "configfile", scope: !606, file: !46, line: 943, baseType: !40, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !606, file: !46, line: 944, baseType: !40, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "exec_argv", scope: !606, file: !46, line: 945, baseType: !614, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_hz", scope: !606, file: !46, line: 946, baseType: !7, size: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "config_hz", scope: !606, file: !46, line: 947, baseType: !7, size: 32, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hz", scope: !606, file: !46, line: 950, baseType: !7, size: 32, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !606, file: !46, line: 951, baseType: !80, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !606, file: !46, line: 952, baseType: !85, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "orig_commands", scope: !606, file: !46, line: 953, baseType: !85, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "el", scope: !606, file: !46, line: 954, baseType: !622, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !624, line: 109, baseType: !625)
!624 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !624, line: 97, size: 640, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !645, !652, !674, !675, !676, !681}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !625, file: !624, line: 98, baseType: !7, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !625, file: !624, line: 99, baseType: !7, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !625, file: !624, line: 100, baseType: !8, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !625, file: !624, line: 101, baseType: !175, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !625, file: !624, line: 102, baseType: !632, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !624, line: 76, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !624, line: 71, size: 256, elements: !635)
!635 = !{!636, !637, !643, !644}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !634, file: !624, line: 72, baseType: !7, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !634, file: !624, line: 73, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !624, line: 65, baseType: !640)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !642, !7, !6, !7}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !634, file: !624, line: 74, baseType: !638, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !634, file: !624, line: 75, baseType: !6, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !625, file: !624, line: 103, baseType: !646, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !624, line: 94, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !624, line: 91, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !648, file: !624, line: 92, baseType: !7, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !648, file: !624, line: 93, baseType: !7, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !625, file: !624, line: 104, baseType: !653, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !624, line: 88, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !624, line: 79, size: 512, elements: !656)
!656 = !{!657, !658, !659, !660, !665, !670, !671, !673}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !655, file: !624, line: 80, baseType: !8, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !655, file: !624, line: 81, baseType: !55, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !655, file: !624, line: 82, baseType: !55, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !655, file: !624, line: 83, baseType: !661, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !624, line: 66, baseType: !663)
!663 = !DISubroutineType(types: !664)
!664 = !{!7, !642, !8, !6}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !655, file: !624, line: 84, baseType: !666, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !624, line: 67, baseType: !668)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !642, !6}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !655, file: !624, line: 85, baseType: !6, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !655, file: !624, line: 86, baseType: !672, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !624, line: 87, baseType: !672, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !625, file: !624, line: 105, baseType: !7, size: 32, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !625, file: !624, line: 106, baseType: !6, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !625, file: !624, line: 107, baseType: !677, size: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !624, line: 68, baseType: !679)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !642}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !625, file: !624, line: 108, baseType: !677, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lruclock", scope: !606, file: !46, line: 955, baseType: !50, size: 32, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_asap", scope: !606, file: !46, line: 956, baseType: !7, size: 32, offset: 672)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "activerehashing", scope: !606, file: !46, line: 957, baseType: !7, size: 32, offset: 704)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_running", scope: !606, file: !46, line: 958, baseType: !7, size: 32, offset: 736)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "requirepass", scope: !606, file: !46, line: 959, baseType: !40, size: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !606, file: !46, line: 960, baseType: !40, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "arch_bits", scope: !606, file: !46, line: 961, baseType: !7, size: 32, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cronloops", scope: !606, file: !46, line: 962, baseType: !7, size: 32, offset: 928)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "runid", scope: !606, file: !46, line: 963, baseType: !197, size: 328, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel_mode", scope: !606, file: !46, line: 964, baseType: !7, size: 32, offset: 1312)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "initial_memory_usage", scope: !606, file: !46, line: 965, baseType: !157, size: 64, offset: 1344)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "always_show_logo", scope: !606, file: !46, line: 966, baseType: !7, size: 32, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "moduleapi", scope: !606, file: !46, line: 968, baseType: !85, size: 64, offset: 1472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sharedapi", scope: !606, file: !46, line: 969, baseType: !85, size: 64, offset: 1536)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "loadmodule_queue", scope: !606, file: !46, line: 971, baseType: !9, size: 64, offset: 1600)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_pipe", scope: !606, file: !46, line: 972, baseType: !698, size: 64, offset: 1664)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !143)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !606, file: !46, line: 976, baseType: !7, size: 32, offset: 1728)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_backlog", scope: !606, file: !46, line: 977, baseType: !7, size: 32, offset: 1760)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bindaddr", scope: !606, file: !46, line: 978, baseType: !702, size: 1024, offset: 1792)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !396)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bindaddr_count", scope: !606, file: !46, line: 979, baseType: !7, size: 32, offset: 2816)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "unixsocket", scope: !606, file: !46, line: 980, baseType: !40, size: 64, offset: 2880)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "unixsocketperm", scope: !606, file: !46, line: 981, baseType: !706, size: 32, offset: 2944)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !186, line: 205, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !160, line: 88, baseType: !304)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ipfd", scope: !606, file: !46, line: 982, baseType: !709, size: 512, offset: 2976)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !396)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ipfd_count", scope: !606, file: !46, line: 983, baseType: !7, size: 32, offset: 3488)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sofd", scope: !606, file: !46, line: 984, baseType: !7, size: 32, offset: 3520)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cfd", scope: !606, file: !46, line: 985, baseType: !709, size: 512, offset: 3552)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cfd_count", scope: !606, file: !46, line: 986, baseType: !7, size: 32, offset: 4064)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !606, file: !46, line: 987, baseType: !9, size: 64, offset: 4096)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "clients_to_close", scope: !606, file: !46, line: 988, baseType: !9, size: 64, offset: 4160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "clients_pending_write", scope: !606, file: !46, line: 989, baseType: !9, size: 64, offset: 4224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "slaves", scope: !606, file: !46, line: 990, baseType: !9, size: 64, offset: 4288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !606, file: !46, line: 990, baseType: !9, size: 64, offset: 4352)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "current_client", scope: !606, file: !46, line: 991, baseType: !69, size: 64, offset: 4416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clients_index", scope: !606, file: !46, line: 992, baseType: !721, size: 64, offset: 4480)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !723, line: 137, baseType: !724)
!723 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !723, line: 133, size: 192, elements: !725)
!725 = !{!726, !737, !738}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !724, file: !723, line: 134, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !723, line: 131, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !723, line: 98, size: 32, elements: !730)
!730 = !{!731, !732, !733, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !729, file: !723, line: 99, baseType: !303, size: 1, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !729, file: !723, line: 100, baseType: !303, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !729, file: !723, line: 101, baseType: !303, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !729, file: !723, line: 102, baseType: !303, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !729, file: !723, line: 130, baseType: !736, offset: 32)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, elements: !287)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !724, file: !723, line: 135, baseType: !74, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !724, file: !723, line: 136, baseType: !74, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "clients_paused", scope: !606, file: !46, line: 993, baseType: !7, size: 32, offset: 4544)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "clients_pause_end_time", scope: !606, file: !46, line: 994, baseType: !228, size: 64, offset: 4608)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "neterr", scope: !606, file: !46, line: 995, baseType: !742, size: 2048, offset: 4672)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_cached_sockets", scope: !606, file: !46, line: 996, baseType: !85, size: 64, offset: 6720)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_client_id", scope: !606, file: !46, line: 997, baseType: !74, size: 64, offset: 6784)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "protected_mode", scope: !606, file: !46, line: 998, baseType: !7, size: 32, offset: 6848)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !606, file: !46, line: 1000, baseType: !7, size: 32, offset: 6880)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "loading_total_bytes", scope: !606, file: !46, line: 1001, baseType: !185, size: 64, offset: 6912)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "loading_loaded_bytes", scope: !606, file: !46, line: 1002, baseType: !185, size: 64, offset: 6976)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "loading_start_time", scope: !606, file: !46, line: 1003, baseType: !175, size: 64, offset: 7040)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "loading_process_events_interval_bytes", scope: !606, file: !46, line: 1004, baseType: !185, size: 64, offset: 7104)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "delCommand", scope: !606, file: !46, line: 1006, baseType: !60, size: 64, offset: 7168)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "multiCommand", scope: !606, file: !46, line: 1006, baseType: !60, size: 64, offset: 7232)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lpushCommand", scope: !606, file: !46, line: 1006, baseType: !60, size: 64, offset: 7296)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lpopCommand", scope: !606, file: !46, line: 1007, baseType: !60, size: 64, offset: 7360)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rpopCommand", scope: !606, file: !46, line: 1007, baseType: !60, size: 64, offset: 7424)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "zpopminCommand", scope: !606, file: !46, line: 1007, baseType: !60, size: 64, offset: 7488)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "zpopmaxCommand", scope: !606, file: !46, line: 1008, baseType: !60, size: 64, offset: 7552)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sremCommand", scope: !606, file: !46, line: 1008, baseType: !60, size: 64, offset: 7616)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "execCommand", scope: !606, file: !46, line: 1008, baseType: !60, size: 64, offset: 7680)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "expireCommand", scope: !606, file: !46, line: 1009, baseType: !60, size: 64, offset: 7744)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pexpireCommand", scope: !606, file: !46, line: 1009, baseType: !60, size: 64, offset: 7808)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "xclaimCommand", scope: !606, file: !46, line: 1009, baseType: !60, size: 64, offset: 7872)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "xgroupCommand", scope: !606, file: !46, line: 1010, baseType: !60, size: 64, offset: 7936)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stat_starttime", scope: !606, file: !46, line: 1012, baseType: !175, size: 64, offset: 8000)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stat_numcommands", scope: !606, file: !46, line: 1013, baseType: !8, size: 64, offset: 8064)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "stat_numconnections", scope: !606, file: !46, line: 1014, baseType: !8, size: 64, offset: 8128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "stat_expiredkeys", scope: !606, file: !46, line: 1015, baseType: !8, size: 64, offset: 8192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stat_expired_stale_perc", scope: !606, file: !46, line: 1016, baseType: !137, size: 64, offset: 8256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stat_expired_time_cap_reached_count", scope: !606, file: !46, line: 1017, baseType: !8, size: 64, offset: 8320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stat_evictedkeys", scope: !606, file: !46, line: 1018, baseType: !8, size: 64, offset: 8384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "stat_keyspace_hits", scope: !606, file: !46, line: 1019, baseType: !8, size: 64, offset: 8448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stat_keyspace_misses", scope: !606, file: !46, line: 1020, baseType: !8, size: 64, offset: 8512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_hits", scope: !606, file: !46, line: 1021, baseType: !8, size: 64, offset: 8576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_misses", scope: !606, file: !46, line: 1022, baseType: !8, size: 64, offset: 8640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_key_hits", scope: !606, file: !46, line: 1023, baseType: !8, size: 64, offset: 8704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_key_misses", scope: !606, file: !46, line: 1024, baseType: !8, size: 64, offset: 8768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_scanned", scope: !606, file: !46, line: 1025, baseType: !8, size: 64, offset: 8832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stat_peak_memory", scope: !606, file: !46, line: 1026, baseType: !157, size: 64, offset: 8896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stat_fork_time", scope: !606, file: !46, line: 1027, baseType: !8, size: 64, offset: 8960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stat_fork_rate", scope: !606, file: !46, line: 1028, baseType: !137, size: 64, offset: 9024)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stat_rejected_conn", scope: !606, file: !46, line: 1029, baseType: !8, size: 64, offset: 9088)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sync_full", scope: !606, file: !46, line: 1030, baseType: !8, size: 64, offset: 9152)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sync_partial_ok", scope: !606, file: !46, line: 1031, baseType: !8, size: 64, offset: 9216)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sync_partial_err", scope: !606, file: !46, line: 1032, baseType: !8, size: 64, offset: 9280)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog", scope: !606, file: !46, line: 1033, baseType: !9, size: 64, offset: 9344)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog_entry_id", scope: !606, file: !46, line: 1034, baseType: !8, size: 64, offset: 9408)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog_log_slower_than", scope: !606, file: !46, line: 1035, baseType: !8, size: 64, offset: 9472)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog_max_len", scope: !606, file: !46, line: 1036, baseType: !37, size: 64, offset: 9536)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cron_malloc_stats", scope: !606, file: !46, line: 1037, baseType: !792, size: 320, offset: 9600)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_stats", file: !46, line: 916, size: 320, elements: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "zmalloc_used", scope: !792, file: !46, line: 917, baseType: !157, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "process_rss", scope: !792, file: !46, line: 918, baseType: !157, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_allocated", scope: !792, file: !46, line: 919, baseType: !157, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_active", scope: !792, file: !46, line: 920, baseType: !157, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "allocator_resident", scope: !792, file: !46, line: 921, baseType: !157, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "stat_net_input_bytes", scope: !606, file: !46, line: 1038, baseType: !8, size: 64, offset: 9920)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "stat_net_output_bytes", scope: !606, file: !46, line: 1039, baseType: !8, size: 64, offset: 9984)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stat_rdb_cow_bytes", scope: !606, file: !46, line: 1040, baseType: !157, size: 64, offset: 10048)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stat_aof_cow_bytes", scope: !606, file: !46, line: 1041, baseType: !157, size: 64, offset: 10112)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "inst_metric", scope: !606, file: !46, line: 1049, baseType: !804, size: 3648, offset: 10176)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 3648, elements: !812)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !606, file: !46, line: 1044, size: 1216, elements: !806)
!806 = !{!807, !808, !809, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "last_sample_time", scope: !805, file: !46, line: 1045, baseType: !8, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "last_sample_count", scope: !805, file: !46, line: 1046, baseType: !8, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !805, file: !46, line: 1047, baseType: !810, size: 1024, offset: 128)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1024, elements: !396)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !805, file: !46, line: 1048, baseType: !7, size: 32, offset: 1152)
!812 = !{!813}
!813 = !DISubrange(count: 3)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !606, file: !46, line: 1051, baseType: !7, size: 32, offset: 13824)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "maxidletime", scope: !606, file: !46, line: 1052, baseType: !7, size: 32, offset: 13856)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tcpkeepalive", scope: !606, file: !46, line: 1053, baseType: !7, size: 32, offset: 13888)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "active_expire_enabled", scope: !606, file: !46, line: 1054, baseType: !7, size: 32, offset: 13920)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_enabled", scope: !606, file: !46, line: 1055, baseType: !7, size: 32, offset: 13952)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_ignore_bytes", scope: !606, file: !46, line: 1056, baseType: !157, size: 64, offset: 14016)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_threshold_lower", scope: !606, file: !46, line: 1057, baseType: !7, size: 32, offset: 14080)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_threshold_upper", scope: !606, file: !46, line: 1058, baseType: !7, size: 32, offset: 14112)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_cycle_min", scope: !606, file: !46, line: 1059, baseType: !7, size: 32, offset: 14144)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_cycle_max", scope: !606, file: !46, line: 1060, baseType: !7, size: 32, offset: 14176)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_max_scan_fields", scope: !606, file: !46, line: 1061, baseType: !37, size: 64, offset: 14208)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "client_max_querybuf_len", scope: !606, file: !46, line: 1062, baseType: !157, size: 64, offset: 14272)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dbnum", scope: !606, file: !46, line: 1063, baseType: !7, size: 32, offset: 14336)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "supervised", scope: !606, file: !46, line: 1064, baseType: !7, size: 32, offset: 14368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "supervised_mode", scope: !606, file: !46, line: 1065, baseType: !7, size: 32, offset: 14400)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "daemonize", scope: !606, file: !46, line: 1066, baseType: !7, size: 32, offset: 14432)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "client_obuf_limits", scope: !606, file: !46, line: 1067, baseType: !831, size: 576, offset: 14464)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 576, elements: !812)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "clientBufferLimitsConfig", file: !46, line: 835, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clientBufferLimitsConfig", file: !46, line: 831, size: 192, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "hard_limit_bytes", scope: !833, file: !46, line: 832, baseType: !56, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "soft_limit_bytes", scope: !833, file: !46, line: 833, baseType: !56, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "soft_limit_seconds", scope: !833, file: !46, line: 834, baseType: !175, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "aof_state", scope: !606, file: !46, line: 1069, baseType: !7, size: 32, offset: 15040)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "aof_fsync", scope: !606, file: !46, line: 1070, baseType: !7, size: 32, offset: 15072)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "aof_filename", scope: !606, file: !46, line: 1071, baseType: !40, size: 64, offset: 15104)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "aof_no_fsync_on_rewrite", scope: !606, file: !46, line: 1072, baseType: !7, size: 32, offset: 15168)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_perc", scope: !606, file: !46, line: 1073, baseType: !7, size: 32, offset: 15200)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_min_size", scope: !606, file: !46, line: 1074, baseType: !185, size: 64, offset: 15232)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_base_size", scope: !606, file: !46, line: 1075, baseType: !185, size: 64, offset: 15296)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "aof_current_size", scope: !606, file: !46, line: 1076, baseType: !185, size: 64, offset: 15360)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "aof_fsync_offset", scope: !606, file: !46, line: 1077, baseType: !185, size: 64, offset: 15424)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_scheduled", scope: !606, file: !46, line: 1078, baseType: !7, size: 32, offset: 15488)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "aof_child_pid", scope: !606, file: !46, line: 1079, baseType: !609, size: 32, offset: 15520)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_buf_blocks", scope: !606, file: !46, line: 1080, baseType: !9, size: 64, offset: 15552)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "aof_buf", scope: !606, file: !46, line: 1081, baseType: !38, size: 64, offset: 15616)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "aof_fd", scope: !606, file: !46, line: 1082, baseType: !7, size: 32, offset: 15680)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "aof_selected_db", scope: !606, file: !46, line: 1083, baseType: !7, size: 32, offset: 15712)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "aof_flush_postponed_start", scope: !606, file: !46, line: 1084, baseType: !175, size: 64, offset: 15744)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "aof_last_fsync", scope: !606, file: !46, line: 1085, baseType: !175, size: 64, offset: 15808)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_time_last", scope: !606, file: !46, line: 1086, baseType: !175, size: 64, offset: 15872)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_time_start", scope: !606, file: !46, line: 1087, baseType: !175, size: 64, offset: 15936)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "aof_lastbgrewrite_status", scope: !606, file: !46, line: 1088, baseType: !7, size: 32, offset: 16000)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "aof_delayed_fsync", scope: !606, file: !46, line: 1089, baseType: !37, size: 64, offset: 16064)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_incremental_fsync", scope: !606, file: !46, line: 1090, baseType: !7, size: 32, offset: 16128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save_incremental_fsync", scope: !606, file: !46, line: 1091, baseType: !7, size: 32, offset: 16160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "aof_last_write_status", scope: !606, file: !46, line: 1092, baseType: !7, size: 32, offset: 16192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "aof_last_write_errno", scope: !606, file: !46, line: 1093, baseType: !7, size: 32, offset: 16224)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "aof_load_truncated", scope: !606, file: !46, line: 1094, baseType: !7, size: 32, offset: 16256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "aof_use_rdb_preamble", scope: !606, file: !46, line: 1095, baseType: !7, size: 32, offset: 16288)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_write_data_to_child", scope: !606, file: !46, line: 1097, baseType: !7, size: 32, offset: 16320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_read_data_from_parent", scope: !606, file: !46, line: 1098, baseType: !7, size: 32, offset: 16352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_write_ack_to_parent", scope: !606, file: !46, line: 1099, baseType: !7, size: 32, offset: 16384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_read_ack_from_child", scope: !606, file: !46, line: 1100, baseType: !7, size: 32, offset: 16416)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_write_ack_to_child", scope: !606, file: !46, line: 1101, baseType: !7, size: 32, offset: 16448)
