; ModuleID = '/root/.unikraft/libs/lwip/sockets.c'
source_filename = "/root/.unikraft/libs/lwip/sockets.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, {}*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, {}*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.lwip_sock = type { %struct.netconn*, %union.lwip_sock_lastdata, i16, i16, i16, i8 }
%struct.netconn = type { i32, i32, %union.anon.4, i8, %struct.sys_sem_t, %struct.sys_mbox_t, %struct.sys_mbox_t, i32, i8, %struct.api_msg*, void (%struct.netconn*, i32, i16)* }
%union.anon.4 = type { %struct.ip_pcb* }
%struct.ip_pcb = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8 }
%struct.ip_addr = type { %union.anon.5, i8 }
%union.anon.5 = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.sys_sem_t = type { %struct.uk_semaphore, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }

!95 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!96 = !DIEnumerator(name: "ERR_RST", value: -14)
!97 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!98 = !DIEnumerator(name: "ERR_ARG", value: -16)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !100, line: 54, baseType: !7, size: 32, elements: !101)
!100 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 89, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!109 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!110 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!111 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 145, baseType: !7, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!116 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!118 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_pollscan_opts", file: !3, line: 3169, baseType: !7, size: 32, elements: !120)
!120 = !{!121, !122, !123}
!121 = !DIEnumerator(name: "LWIP_POLLSCAN_CLEAR", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "LWIP_POLLSCAN_INC_WAIT", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "LWIP_POLLSCAN_DEC_WAIT", value: 4, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !125, line: 156, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netconn_igmp", file: !37, line: 191, baseType: !7, size: 32, elements: !130)
!130 = !{!131, !132}
!131 = !DIEnumerator(name: "NETCONN_JOIN", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "NETCONN_LEAVE", value: 1, isUnsigned: true)
!133 = !{!134, !135, !139, !80, !143, !144, !146, !151, !188, !203, !169, !156, !206, !210, !219, !216, !221, !164, !228, !36, !238, !369, !696, !703, !711, !712, !204, !999, !225, !1001, !1003, !1004, !1005, !1006, !1008, !1030, !1032, !1034, !1036}
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !136, line: 60, baseType: !137)
!136 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !138, line: 105, baseType: !134)
!138 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sptr", file: !140, line: 186, baseType: !141)
!140 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !140, line: 128, baseType: !142)
!142 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !147, line: 128, baseType: !148)
!147 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !136, line: 32, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !138, line: 55, baseType: !150)
!150 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !153, line: 84, size: 224, elements: !154)
!153 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/sockets.h", directory: "/root/.unikraft/apps/redis/build")
!154 = !{!155, !160, !162, !168, !172, !187}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !152, file: !153, line: 85, baseType: !156, size: 8)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !147, line: 125, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !136, line: 24, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !138, line: 43, baseType: !159)
!159 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !152, file: !153, line: 86, baseType: !161, size: 8, offset: 8)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !153, line: 63, baseType: !156)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !152, file: !153, line: 87, baseType: !163, size: 16, offset: 16)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !153, line: 68, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !147, line: 127, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !136, line: 36, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !138, line: 57, baseType: !167)
!167 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !152, file: !153, line: 88, baseType: !169, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !147, line: 129, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !136, line: 48, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !138, line: 79, baseType: !7)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !152, file: !153, line: 89, baseType: !173, size: 128, offset: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !174, line: 62, size: 128, elements: !175)
!174 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/inet.h", directory: "/root/.unikraft/apps/redis/build")
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !173, file: !174, line: 66, baseType: !177, size: 128)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !174, line: 63, size: 128, elements: !178)
!178 = !{!179, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "u32_addr", scope: !177, file: !174, line: 64, baseType: !180, size: 128)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 4)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "u8_addr", scope: !177, file: !174, line: 65, baseType: !184, size: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 16)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !152, file: !153, line: 90, baseType: !169, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !153, line: 73, size: 128, elements: !190)
!190 = !{!191, !192, !193, !194, !199}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !189, file: !153, line: 74, baseType: !156, size: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !189, file: !153, line: 75, baseType: !161, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !189, file: !153, line: 76, baseType: !163, size: 16, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !189, file: !153, line: 77, baseType: !195, size: 32, offset: 32)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !174, line: 58, size: 32, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !195, file: !174, line: 59, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !174, line: 55, baseType: !169)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !189, file: !153, line: 79, baseType: !200, size: 64, offset: 64)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 8)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_ptr_t", file: !147, line: 135, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !136, line: 82, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !138, line: 232, baseType: !134)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !207, line: 200, baseType: !208)
!207 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !209, line: 145, baseType: !142)
!209 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !212, line: 47, size: 128, elements: !213)
!212 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/sys/uio.h", directory: "/root/.unikraft/apps/redis/build")
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !211, file: !212, line: 48, baseType: !143, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !211, file: !212, line: 49, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !217, line: 40, baseType: !218)
!217 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !209, line: 129, baseType: !134)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !220, line: 49, baseType: !142)
!220 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netvector", file: !37, line: 293, size: 128, elements: !223)
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !222, file: !37, line: 295, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !222, file: !37, line: 297, baseType: !216, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !153, line: 94, size: 128, elements: !231)
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !230, file: !153, line: 95, baseType: !156, size: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !230, file: !153, line: 96, baseType: !161, size: 8, offset: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !230, file: !153, line: 97, baseType: !235, size: 112, offset: 16)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 112, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 14)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwip_select_cb", file: !240, line: 147, size: 704, elements: !241)
!240 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/sockets_priv.h", directory: "/root/.unikraft/apps/redis/build")
!241 = !{!242, !243, !244, !255, !256, !257, !264, !266, !267}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !240, line: 149, baseType: !238, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !240, line: 151, baseType: !238, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "readset", scope: !239, file: !240, line: 154, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_types_fd_set", file: !247, line: 55, baseType: !248)
!247 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/select.h", directory: "/root/.unikraft/apps/redis/build")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_types_fd_set", file: !247, line: 53, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !248, file: !247, line: 54, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, elements: !253)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_mask", file: !247, line: 45, baseType: !134)
!253 = !{!254}
!254 = !DISubrange(count: 1)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "writeset", scope: !239, file: !240, line: 156, baseType: !245, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "exceptset", scope: !239, file: !240, line: 158, baseType: !245, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !239, file: !240, line: 162, baseType: !258, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !153, line: 542, size: 64, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !259, file: !153, line: 544, baseType: !80, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !259, file: !153, line: 545, baseType: !150, size: 16, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !259, file: !153, line: 546, baseType: !150, size: 16, offset: 48)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "poll_nfds", scope: !239, file: !240, line: 164, baseType: !265, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfds_t", file: !153, line: 541, baseType: !7)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sem_signalled", scope: !239, file: !240, line: 167, baseType: !80, size: 32, offset: 416)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !239, file: !240, line: 169, baseType: !268, size: 256, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sem_t", file: !269, line: 72, baseType: !270)
!269 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/sys_arch.h", directory: "/root/.unikraft/apps/redis/build")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 69, size: 256, elements: !271)
!271 = !{!272, !695}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !270, file: !269, line: 70, baseType: !273, size: 192)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !274, line: 51, size: 192, elements: !275)
!274 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !273, file: !274, line: 52, baseType: !142, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !273, file: !274, line: 53, baseType: !278, size: 128, offset: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !279, line: 42, size: 128, elements: !280)
!279 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!280 = !{!281, !693}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !278, file: !279, line: 42, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !279, line: 35, size: 192, elements: !284)
!284 = !{!285, !286, !689}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !283, file: !279, line: 36, baseType: !80, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !283, file: !279, line: 37, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !289, line: 59, size: 1024, elements: !290)
!289 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!290 = !{!291, !294, !295, !296, !297, !303, !304, !307, !309, !310, !457, !458, !459, !659}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !289, line: 60, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !288, file: !289, line: 61, baseType: !143, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !288, file: !289, line: 62, baseType: !143, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !288, file: !289, line: 63, baseType: !143, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !288, file: !289, line: 64, baseType: !298, size: 128, offset: 256)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !289, line: 64, size: 128, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !298, file: !289, line: 64, baseType: !287, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !298, file: !289, line: 64, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !289, line: 65, baseType: !170, size: 32, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !288, file: !289, line: 66, baseType: !305, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !306, line: 49, baseType: !141)
!306 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!307 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !288, file: !289, line: 67, baseType: !308, size: 8, offset: 512)
!308 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !288, file: !289, line: 68, baseType: !278, size: 128, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !288, file: !289, line: 69, baseType: !311, size: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !313, line: 90, size: 2176, elements: !314)
!313 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!314 = !{!315, !320, !337, !342, !344, !346, !351, !359, !364, !370, !371, !372, !377, !454, !455, !456}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !312, file: !313, line: 91, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !313, line: 68, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !311}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !312, file: !313, line: 93, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !313, line: 71, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!80, !311, !287, !325}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !328, line: 62, baseType: !329)
!328 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !328, line: 55, size: 128, elements: !330)
!330 = !{!331, !332, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !329, file: !328, line: 57, baseType: !308, size: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !329, file: !328, line: 59, baseType: !333, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !328, line: 53, baseType: !80)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !329, file: !328, line: 61, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !306, line: 48, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !140, line: 129, baseType: !134)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !312, file: !313, line: 94, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !313, line: 74, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !311, !287}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !312, file: !313, line: 95, baseType: !343, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !313, line: 76, baseType: !339)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !312, file: !313, line: 96, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !313, line: 78, baseType: !339)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !312, file: !313, line: 98, baseType: !347, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !313, line: 81, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!80, !311, !287, !333}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !312, file: !313, line: 99, baseType: !352, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !313, line: 83, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!80, !311, !356, !358}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !312, file: !313, line: 100, baseType: !360, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !313, line: 85, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!80, !311, !287, !80}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !312, file: !313, line: 101, baseType: !365, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !313, line: 87, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!80, !311, !356, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !312, file: !313, line: 104, baseType: !308, size: 8, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !312, file: !313, line: 105, baseType: !288, size: 1024, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !312, file: !313, line: 106, baseType: !373, size: 128, offset: 1664)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !289, line: 93, size: 128, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !373, file: !289, line: 93, baseType: !287, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !373, file: !289, line: 93, baseType: !302, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !312, file: !313, line: 107, baseType: !378, size: 192, offset: 1792)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !379, line: 59, size: 192, elements: !380)
!379 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!380 = !{!381, !445, !449}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !378, file: !379, line: 61, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !379, line: 51, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!143, !386, !134, !134}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !388, line: 77, size: 832, elements: !389)
!388 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!389 = !{!390, !396, !401, !406, !412, !414, !419, !420, !421, !426, !431, !436, !437, !438}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !387, file: !388, line: 79, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !388, line: 54, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!143, !386, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 58, baseType: !134)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !387, file: !388, line: 80, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !388, line: 56, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!143, !386, !395, !395}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !387, file: !388, line: 81, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !388, line: 62, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!143, !386, !143, !395}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !387, file: !388, line: 82, baseType: !407, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !388, line: 58, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!80, !386, !411, !395, !395}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !387, file: !388, line: 83, baseType: !413, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !388, line: 60, baseType: !398)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !387, file: !388, line: 84, baseType: !415, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !388, line: 64, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !386, !143}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !387, file: !388, line: 87, baseType: !415, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !387, file: !388, line: 88, baseType: !391, size: 64, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !387, file: !388, line: 92, baseType: !422, size: 64, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !388, line: 66, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!143, !386, !134}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !387, file: !388, line: 93, baseType: !427, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !388, line: 68, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !386, !143, !134}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !387, file: !388, line: 99, baseType: !432, size: 64, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !388, line: 70, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!80, !386, !143, !395}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !387, file: !388, line: 100, baseType: !395, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !388, line: 103, baseType: !386, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !387, file: !388, line: 104, baseType: !439, offset: 832)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, elements: !443)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !136, line: 20, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !138, line: 41, baseType: !442)
!442 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!443 = !{!444}
!444 = !DISubrange(count: -1)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !378, file: !379, line: 63, baseType: !446, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !143}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !378, file: !379, line: 65, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !379, line: 56, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !143, !143}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !312, file: !313, line: 108, baseType: !386, size: 64, offset: 1984)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !313, line: 109, baseType: !311, size: 64, offset: 2048)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !312, file: !313, line: 110, baseType: !143, size: 64, offset: 2112)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !288, file: !289, line: 70, baseType: !143, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !288, file: !289, line: 72, baseType: !80, size: 32, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !288, file: !289, line: 82, baseType: !460, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !462, line: 569, size: 14912, elements: !463)
!462 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!463 = !{!464, !465, !531, !532, !533, !534, !538, !539, !542, !543, !547, !559, !560, !561, !563, !564, !565, !623, !644, !645, !650, !657}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !461, file: !462, line: 571, baseType: !80, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !461, file: !462, line: 576, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !462, line: 287, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !462, line: 181, size: 1408, elements: !469)
!469 = !{!470, !472, !473, !474, !475, !476, !481, !482, !483, !487, !491, !496, !500, !501, !502, !503, !507, !509, !510, !511, !513, !514, !518, !530}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !468, file: !462, line: 182, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !468, file: !462, line: 183, baseType: !80, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !468, file: !462, line: 184, baseType: !80, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !468, file: !462, line: 185, baseType: !150, size: 16, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !468, file: !462, line: 186, baseType: !150, size: 16, offset: 144)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !468, file: !462, line: 187, baseType: !477, size: 128, offset: 192)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !462, line: 117, size: 128, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !477, file: !462, line: 118, baseType: !471, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !477, file: !462, line: 119, baseType: !80, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !468, file: !462, line: 188, baseType: !80, size: 32, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !468, file: !462, line: 195, baseType: !143, size: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !468, file: !462, line: 197, baseType: !484, size: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!208, !460, !143, !144, !80}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !468, file: !462, line: 199, baseType: !488, size: 64, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!208, !460, !143, !292, !80}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !468, file: !462, line: 202, baseType: !492, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !460, !143, !495, !80}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !209, line: 114, baseType: !142)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !468, file: !462, line: 203, baseType: !497, size: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!80, !460, !143}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !468, file: !462, line: 206, baseType: !477, size: 128, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !468, file: !462, line: 207, baseType: !471, size: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !468, file: !462, line: 208, baseType: !80, size: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !468, file: !462, line: 211, baseType: !504, size: 24, offset: 928)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 24, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 3)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !468, file: !462, line: 212, baseType: !508, size: 8, offset: 952)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 8, elements: !253)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !468, file: !462, line: 215, baseType: !477, size: 128, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !468, file: !462, line: 218, baseType: !80, size: 32, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !468, file: !462, line: 219, baseType: !512, size: 64, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !209, line: 44, baseType: !142)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !468, file: !462, line: 222, baseType: !460, size: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !468, file: !462, line: 226, baseType: !515, size: 32, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !209, line: 175, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !517, line: 12, baseType: !80)
!517 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !468, file: !462, line: 228, baseType: !519, size: 64, offset: 1312)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !209, line: 171, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 163, size: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !520, file: !209, line: 165, baseType: !80, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !520, file: !209, line: 170, baseType: !524, size: 32, offset: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !209, line: 166, size: 32, elements: !525)
!525 = !{!526, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !524, file: !209, line: 168, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !220, line: 124, baseType: !7)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !524, file: !209, line: 169, baseType: !529, size: 32)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 32, elements: !181)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !468, file: !462, line: 229, baseType: !80, size: 32, offset: 1376)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !461, file: !462, line: 576, baseType: !466, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !461, file: !462, line: 576, baseType: !466, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !461, file: !462, line: 578, baseType: !80, size: 32, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !461, file: !462, line: 579, baseType: !535, size: 200, offset: 288)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 200, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 25)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !461, file: !462, line: 582, baseType: !80, size: 32, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !461, file: !462, line: 583, baseType: !540, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !462, line: 40, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !461, file: !462, line: 585, baseType: !80, size: 32, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !461, file: !462, line: 587, baseType: !544, size: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !460}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !461, file: !462, line: 590, baseType: !548, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !462, line: 47, size: 256, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !549, file: !462, line: 49, baseType: !548, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !549, file: !462, line: 50, baseType: !80, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !549, file: !462, line: 50, baseType: !80, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !549, file: !462, line: 50, baseType: !80, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !549, file: !462, line: 50, baseType: !80, size: 32, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !549, file: !462, line: 51, baseType: !557, size: 32, offset: 192)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 32, elements: !253)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !462, line: 25, baseType: !7)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !461, file: !462, line: 591, baseType: !80, size: 32, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !461, file: !462, line: 592, baseType: !548, size: 64, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !461, file: !462, line: 593, baseType: !562, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !461, file: !462, line: 596, baseType: !80, size: 32, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !461, file: !462, line: 597, baseType: !144, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !461, file: !462, line: 632, baseType: !566, size: 2880, offset: 1152)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !461, file: !462, line: 599, size: 2880, elements: !567)
!567 = !{!568, !614}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !566, file: !462, line: 622, baseType: !569, size: 1728)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !462, line: 601, size: 1728, elements: !570)
!570 = !{!571, !572, !573, !577, !589, !590, !592, !599, !600, !601, !602, !603, !607, !608, !609, !610, !611, !612, !613}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !569, file: !462, line: 603, baseType: !7, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !569, file: !462, line: 604, baseType: !144, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !569, file: !462, line: 605, baseType: !574, size: 208, offset: 128)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 208, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 26)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !569, file: !462, line: 606, baseType: !578, size: 288, offset: 352)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !462, line: 55, size: 288, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !578, file: !462, line: 57, baseType: !80, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !578, file: !462, line: 58, baseType: !80, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !578, file: !462, line: 59, baseType: !80, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !578, file: !462, line: 60, baseType: !80, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !578, file: !462, line: 61, baseType: !80, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !578, file: !462, line: 62, baseType: !80, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !578, file: !462, line: 63, baseType: !80, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !578, file: !462, line: 64, baseType: !80, size: 32, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !578, file: !462, line: 65, baseType: !80, size: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !569, file: !462, line: 607, baseType: !80, size: 32, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !569, file: !462, line: 608, baseType: !591, size: 64, offset: 704)
!591 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !569, file: !462, line: 609, baseType: !593, size: 112, offset: 768)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !462, line: 319, size: 112, elements: !594)
!594 = !{!595, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !593, file: !462, line: 320, baseType: !596, size: 48)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 48, elements: !505)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !593, file: !462, line: 321, baseType: !596, size: 48, offset: 48)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !593, file: !462, line: 322, baseType: !167, size: 16, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !569, file: !462, line: 610, baseType: !519, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !569, file: !462, line: 611, baseType: !519, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !569, file: !462, line: 612, baseType: !519, size: 64, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !569, file: !462, line: 613, baseType: !200, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !569, file: !462, line: 614, baseType: !604, size: 192, offset: 1152)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 24)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !569, file: !462, line: 615, baseType: !80, size: 32, offset: 1344)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !569, file: !462, line: 616, baseType: !519, size: 64, offset: 1376)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !569, file: !462, line: 617, baseType: !519, size: 64, offset: 1440)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !569, file: !462, line: 618, baseType: !519, size: 64, offset: 1504)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !569, file: !462, line: 619, baseType: !519, size: 64, offset: 1568)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !569, file: !462, line: 620, baseType: !519, size: 64, offset: 1632)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !569, file: !462, line: 621, baseType: !80, size: 32, offset: 1696)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !566, file: !462, line: 631, baseType: !615, size: 2880)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !462, line: 626, size: 2880, elements: !616)
!616 = !{!617, !621}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !615, file: !462, line: 629, baseType: !618, size: 1920)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1920, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 30)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !615, file: !462, line: 630, baseType: !622, size: 960, offset: 1920)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !619)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !461, file: !462, line: 636, baseType: !624, size: 64, offset: 4032)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !462, line: 93, size: 6336, elements: !626)
!626 = !{!627, !628, !629, !636}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !625, file: !462, line: 94, baseType: !624, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !625, file: !462, line: 95, baseType: !80, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !625, file: !462, line: 97, baseType: !630, size: 2048, offset: 128)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 2048, elements: !634)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null}
!634 = !{!635}
!635 = !DISubrange(count: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !625, file: !462, line: 98, baseType: !637, size: 4160, offset: 2176)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !462, line: 74, size: 4160, elements: !638)
!638 = !{!639, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !637, file: !462, line: 75, baseType: !640, size: 2048)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 2048, elements: !634)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !637, file: !462, line: 76, baseType: !640, size: 2048, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !637, file: !462, line: 78, baseType: !558, size: 32, offset: 4096)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !637, file: !462, line: 81, baseType: !558, size: 32, offset: 4128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !461, file: !462, line: 637, baseType: !625, size: 6336, offset: 4096)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !461, file: !462, line: 641, baseType: !646, size: 64, offset: 10432)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !80}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !461, file: !462, line: 646, baseType: !651, size: 192, offset: 10496)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !462, line: 291, size: 192, elements: !652)
!652 = !{!653, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !651, file: !462, line: 293, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !651, file: !462, line: 294, baseType: !80, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !651, file: !462, line: 295, baseType: !466, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !461, file: !462, line: 648, baseType: !658, size: 4224, offset: 10688)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 4224, elements: !505)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !288, file: !289, line: 85, baseType: !660, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !6, line: 114, size: 640, elements: !662)
!662 = !{!663, !667, !668, !675, !688}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !661, file: !6, line: 116, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !665, line: 64, baseType: !666)
!665 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !665, line: 63, baseType: !134)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !661, file: !6, line: 118, baseType: !664, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !661, file: !6, line: 120, baseType: !669, size: 128, offset: 128)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !670, line: 51, size: 128, elements: !671)
!670 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!671 = !{!672, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !670, line: 52, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !669, file: !670, line: 53, baseType: !673, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !661, file: !6, line: 122, baseType: !676, size: 256, offset: 256)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !6, line: 98, size: 256, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !676, file: !6, line: 107, baseType: !5, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !676, file: !6, line: 109, baseType: !664, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !676, file: !6, line: 111, baseType: !681, size: 96, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !665, line: 72, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 68, size: 96, elements: !683)
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !682, file: !665, line: 69, baseType: !80, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !682, file: !665, line: 70, baseType: !80, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !682, file: !665, line: 71, baseType: !687, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !665, line: 61, baseType: !80)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !661, file: !6, line: 124, baseType: !669, size: 128, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !283, file: !279, line: 38, baseType: !690, size: 64, offset: 128)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !283, file: !279, line: 38, size: 64, elements: !691)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !690, file: !279, line: 38, baseType: !282, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !278, file: !279, line: 42, baseType: !694, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !270, file: !269, line: 71, baseType: !80, size: 32, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !699, line: 57, baseType: !700)
!699 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !699, line: 51, size: 32, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !700, file: !699, line: 52, baseType: !169, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !706, line: 67, baseType: !707)
!706 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !706, line: 59, size: 160, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !707, file: !706, line: 60, baseType: !180, size: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !707, file: !706, line: 62, baseType: !156, size: 8, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnode", file: !18, line: 69, size: 960, elements: !715)
!715 = !{!716, !717, !718, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "v_ino", scope: !714, file: !18, line: 70, baseType: !135, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "v_link", scope: !714, file: !18, line: 71, baseType: !669, size: 128, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "v_mount", scope: !714, file: !18, line: 72, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount", file: !721, line: 46, size: 16960, elements: !722)
!721 = !DIFile(filename: "/root/.unikraft/unikraft/lib/vfscore/include/vfscore/mount.h", directory: "/root/.unikraft/apps/redis/build")
!722 = !{!723, !975, !976, !977, !981, !982, !985, !986, !987, !988, !989}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "m_op", scope: !720, file: !721, line: 47, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vfsops", file: !721, line: 148, size: 384, elements: !726)
!726 = !{!727, !731, !735, !739, !743, !776}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "vfs_mount", scope: !725, file: !721, line: 149, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!80, !719, !292, !80, !225}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vfs_unmount", scope: !725, file: !721, line: 150, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!80, !719, !80}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vfs_sync", scope: !725, file: !721, line: 151, baseType: !736, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!80, !719}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vfs_vget", scope: !725, file: !721, line: 152, baseType: !740, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!80, !719, !713}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "vfs_statfs", scope: !725, file: !721, line: 153, baseType: !744, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!80, !719, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !749, line: 14, size: 896, elements: !750)
!749 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/sys/statfs.h", directory: "/root/.unikraft/apps/redis/build")
!750 = !{!751, !752, !753, !756, !757, !758, !762, !763, !771, !772, !773, !774}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !748, file: !749, line: 15, baseType: !134, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !748, file: !749, line: 15, baseType: !134, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !748, file: !749, line: 16, baseType: !754, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsblkcnt_t", file: !207, line: 144, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !209, line: 36, baseType: !137)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !748, file: !749, line: 16, baseType: !754, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !748, file: !749, line: 16, baseType: !754, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !748, file: !749, line: 17, baseType: !759, size: 32, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsfilcnt_t", file: !760, line: 43, baseType: !761)
!760 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/sys/statvfs.h", directory: "/root/.unikraft/apps/redis/build")
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !209, line: 40, baseType: !171)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !748, file: !749, line: 17, baseType: !759, size: 32, offset: 352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !748, file: !749, line: 18, baseType: !764, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_t", file: !749, line: 12, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__fsid_t", file: !749, line: 10, size: 64, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !765, file: !749, line: 11, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 2)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !748, file: !749, line: 19, baseType: !134, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !748, file: !749, line: 19, baseType: !134, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !748, file: !749, line: 19, baseType: !134, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !748, file: !749, line: 19, baseType: !775, size: 256, offset: 640)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 256, elements: !181)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vfs_vnops", scope: !725, file: !721, line: 154, baseType: !777, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnops", file: !18, line: 178, size: 1472, elements: !779)
!779 = !{!780, !825, !830, !843, !848, !853, !858, !860, !879, !884, !891, !896, !901, !903, !905, !941, !943, !948, !953, !955, !960, !965, !970}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vop_open", scope: !778, file: !18, line: 179, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_open_t", file: !18, line: 148, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!80, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vfscore_file", file: !787, line: 53, size: 640, elements: !788)
!787 = !DIFile(filename: "/root/.unikraft/unikraft/lib/vfscore/include/vfscore/file.h", directory: "/root/.unikraft/apps/redis/build")
!788 = !{!789, !790, !791, !792, !795, !796, !797, !824}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !786, file: !787, line: 54, baseType: !80, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !786, file: !787, line: 55, baseType: !80, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "f_count", scope: !786, file: !787, line: 56, baseType: !80, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "f_offset", scope: !786, file: !787, line: 57, baseType: !793, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !207, line: 173, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !209, line: 100, baseType: !512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "f_data", scope: !786, file: !787, line: 58, baseType: !143, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "f_vfs_flags", scope: !786, file: !787, line: 59, baseType: !80, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "f_dentry", scope: !786, file: !787, line: 60, baseType: !798, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !800, line: 42, size: 1088, elements: !801)
!800 = !DIFile(filename: "/root/.unikraft/unikraft/lib/vfscore/include/vfscore/dentry.h", directory: "/root/.unikraft/apps/redis/build")
!801 = !{!802, !809, !810, !811, !812, !813, !814, !815, !822, !823}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "d_link", scope: !799, file: !800, line: 43, baseType: !803, size: 128)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_hlist_node", file: !670, line: 271, size: 128, elements: !804)
!804 = !{!805, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !670, line: 272, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !803, file: !670, line: 272, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "d_refcnt", scope: !799, file: !800, line: 44, baseType: !80, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "d_path", scope: !799, file: !800, line: 45, baseType: !144, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "d_vnode", scope: !799, file: !800, line: 46, baseType: !713, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "d_mount", scope: !799, file: !800, line: 47, baseType: !719, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !799, file: !800, line: 48, baseType: !798, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "d_names_link", scope: !799, file: !800, line: 49, baseType: !669, size: 128, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "d_lock", scope: !799, file: !800, line: 50, baseType: !816, size: 256, offset: 576)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_mutex", file: !817, line: 58, size: 256, elements: !818)
!817 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/mutex.h", directory: "/root/.unikraft/apps/redis/build")
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !816, file: !817, line: 59, baseType: !80, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !816, file: !817, line: 60, baseType: !287, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !816, file: !817, line: 61, baseType: !278, size: 128, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "d_child_list", scope: !799, file: !800, line: 51, baseType: !669, size: 128, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "d_child_link", scope: !799, file: !800, line: 52, baseType: !669, size: 128, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "f_lock", scope: !786, file: !787, line: 61, baseType: !816, size: 256, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "vop_close", scope: !778, file: !18, line: 180, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_close_t", file: !18, line: 149, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!80, !713, !785}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "vop_read", scope: !778, file: !18, line: 181, baseType: !831, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_read_t", file: !18, line: 150, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!80, !713, !785, !835, !80}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uio", file: !13, line: 53, size: 320, elements: !837)
!837 = !{!838, !839, !840, !841, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uio_iov", scope: !836, file: !13, line: 54, baseType: !210, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "uio_iovcnt", scope: !836, file: !13, line: 55, baseType: !80, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "uio_offset", scope: !836, file: !13, line: 56, baseType: !793, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "uio_resid", scope: !836, file: !13, line: 57, baseType: !206, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "uio_rw", scope: !836, file: !13, line: 58, baseType: !12, size: 32, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vop_write", scope: !778, file: !18, line: 182, baseType: !844, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_write_t", file: !18, line: 152, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!80, !713, !835, !80}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vop_seek", scope: !778, file: !18, line: 183, baseType: !849, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_seek_t", file: !18, line: 153, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!80, !713, !785, !793, !793}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vop_ioctl", scope: !778, file: !18, line: 184, baseType: !854, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_ioctl_t", file: !18, line: 155, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!80, !713, !785, !134, !143}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vop_fsync", scope: !778, file: !18, line: 185, baseType: !859, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_fsync_t", file: !18, line: 156, baseType: !827)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "vop_readdir", scope: !778, file: !18, line: 186, baseType: !861, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_readdir_t", file: !18, line: 157, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!80, !713, !785, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !867, line: 55, size: 2240, elements: !868)
!867 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/dirent.h", directory: "/root/.unikraft/apps/redis/build")
!868 = !{!869, !872, !873, !874, !875}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !866, file: !867, line: 56, baseType: !870, size: 16)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !207, line: 155, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !209, line: 73, baseType: !167)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !866, file: !867, line: 57, baseType: !793, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !866, file: !867, line: 58, baseType: !167, size: 16, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !866, file: !867, line: 59, baseType: !159, size: 8, offset: 144)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !866, file: !867, line: 60, baseType: !876, size: 2048, offset: 152)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 2048, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "vop_lookup", scope: !778, file: !18, line: 187, baseType: !880, size: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_lookup_t", file: !18, line: 158, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!80, !713, !144, !712}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "vop_create", scope: !778, file: !18, line: 188, baseType: !885, size: 64, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_create_t", file: !18, line: 159, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!80, !713, !144, !889}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !207, line: 205, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !209, line: 88, baseType: !171)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "vop_remove", scope: !778, file: !18, line: 189, baseType: !892, size: 64, offset: 640)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_remove_t", file: !18, line: 160, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!80, !713, !713, !144}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "vop_rename", scope: !778, file: !18, line: 190, baseType: !897, size: 64, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_rename_t", file: !18, line: 161, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!80, !713, !713, !144, !713, !713, !144}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "vop_mkdir", scope: !778, file: !18, line: 191, baseType: !902, size: 64, offset: 768)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_mkdir_t", file: !18, line: 163, baseType: !886)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "vop_rmdir", scope: !778, file: !18, line: 192, baseType: !904, size: 64, offset: 832)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_rmdir_t", file: !18, line: 164, baseType: !893)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "vop_getattr", scope: !778, file: !18, line: 193, baseType: !906, size: 64, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_getattr_t", file: !18, line: 165, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!80, !713, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vattr", file: !18, line: 92, size: 768, elements: !912)
!912 = !{!913, !914, !915, !916, !919, !922, !925, !928, !929, !936, !937, !938, !939, !940}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "va_mask", scope: !911, file: !18, line: 93, baseType: !7, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "va_type", scope: !911, file: !18, line: 94, baseType: !17, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "va_mode", scope: !911, file: !18, line: 95, baseType: !889, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "va_nlink", scope: !911, file: !18, line: 96, baseType: !917, size: 16, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !207, line: 210, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !209, line: 210, baseType: !167)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "va_uid", scope: !911, file: !18, line: 97, baseType: !920, size: 16, offset: 112)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !207, line: 181, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !209, line: 58, baseType: !167)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "va_gid", scope: !911, file: !18, line: 98, baseType: !923, size: 16, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !207, line: 185, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !209, line: 61, baseType: !167)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "va_fsid", scope: !911, file: !18, line: 99, baseType: !926, size: 16, offset: 144)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !207, line: 177, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !209, line: 54, baseType: !150)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "va_nodeid", scope: !911, file: !18, line: 100, baseType: !870, size: 16, offset: 160)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "va_atime", scope: !911, file: !18, line: 101, baseType: !930, size: 128, offset: 192)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !931, line: 52, size: 128, elements: !932)
!931 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!932 = !{!933, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !930, file: !931, line: 53, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !931, line: 34, baseType: !142)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !930, file: !931, line: 54, baseType: !142, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "va_mtime", scope: !911, file: !18, line: 102, baseType: !930, size: 128, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "va_ctime", scope: !911, file: !18, line: 103, baseType: !930, size: 128, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "va_rdev", scope: !911, file: !18, line: 104, baseType: !926, size: 16, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "va_nblocks", scope: !911, file: !18, line: 105, baseType: !135, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "va_size", scope: !911, file: !18, line: 106, baseType: !793, size: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "vop_setattr", scope: !778, file: !18, line: 194, baseType: !942, size: 64, offset: 960)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_setattr_t", file: !18, line: 166, baseType: !907)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "vop_inactive", scope: !778, file: !18, line: 195, baseType: !944, size: 64, offset: 1024)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_inactive_t", file: !18, line: 167, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!80, !713}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "vop_truncate", scope: !778, file: !18, line: 196, baseType: !949, size: 64, offset: 1088)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_truncate_t", file: !18, line: 168, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!80, !713, !793}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "vop_link", scope: !778, file: !18, line: 197, baseType: !954, size: 64, offset: 1152)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_link_t", file: !18, line: 169, baseType: !893)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "vop_cache", scope: !778, file: !18, line: 198, baseType: !956, size: 64, offset: 1216)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_cache_t", file: !18, line: 170, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!80, !713, !785, !835}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "vop_fallocate", scope: !778, file: !18, line: 199, baseType: !961, size: 64, offset: 1280)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_fallocate_t", file: !18, line: 171, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!80, !713, !80, !793, !793}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vop_readlink", scope: !778, file: !18, line: 200, baseType: !966, size: 64, offset: 1344)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_readlink_t", file: !18, line: 172, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!80, !713, !835}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vop_symlink", scope: !778, file: !18, line: 201, baseType: !971, size: 64, offset: 1408)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "vnop_symlink_t", file: !18, line: 173, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!80, !713, !144, !144}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "m_flags", scope: !720, file: !721, line: 48, baseType: !80, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "m_count", scope: !720, file: !721, line: 49, baseType: !80, size: 32, offset: 96)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "m_path", scope: !720, file: !721, line: 50, baseType: !978, size: 8192, offset: 128)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8192, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 1024)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "m_special", scope: !720, file: !721, line: 51, baseType: !978, size: 8192, offset: 8320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "m_dev", scope: !720, file: !721, line: 52, baseType: !983, size: 64, offset: 16512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !721, line: 52, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "m_root", scope: !720, file: !721, line: 53, baseType: !798, size: 64, offset: 16576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "m_covered", scope: !720, file: !721, line: 54, baseType: !798, size: 64, offset: 16640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "m_data", scope: !720, file: !721, line: 55, baseType: !143, size: 64, offset: 16704)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_list", scope: !720, file: !721, line: 56, baseType: !669, size: 128, offset: 16768)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "m_fsid", scope: !720, file: !721, line: 57, baseType: !764, size: 64, offset: 16896)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "v_op", scope: !714, file: !18, line: 73, baseType: !777, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "v_refcnt", scope: !714, file: !18, line: 74, baseType: !80, size: 32, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !714, file: !18, line: 75, baseType: !80, size: 32, offset: 352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "v_flags", scope: !714, file: !18, line: 76, baseType: !80, size: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "v_mode", scope: !714, file: !18, line: 77, baseType: !889, size: 32, offset: 416)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "v_size", scope: !714, file: !18, line: 78, baseType: !793, size: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !714, file: !18, line: 79, baseType: !816, size: 256, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "v_names", scope: !714, file: !18, line: 80, baseType: !669, size: 128, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "v_data", scope: !714, file: !18, line: 81, baseType: !143, size: 64, offset: 896)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !153, line: 185, size: 192, elements: !1011)
!1011 = !{!1012, !1016}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_name", scope: !1010, file: !153, line: 186, baseType: !1013, size: 48)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 48, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 6)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !1010, file: !153, line: 200, baseType: !1017, size: 128, offset: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1010, file: !153, line: 187, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !1017, file: !153, line: 188, baseType: !230, size: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !1017, file: !153, line: 189, baseType: !230, size: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !1017, file: !153, line: 190, baseType: !230, size: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !1017, file: !153, line: 191, baseType: !230, size: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !1017, file: !153, line: 192, baseType: !230, size: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !1017, file: !153, line: 193, baseType: !150, size: 16)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !1017, file: !153, line: 194, baseType: !80, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !1017, file: !153, line: 195, baseType: !80, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !1017, file: !153, line: 197, baseType: !1013, size: 48)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !1017, file: !153, line: 198, baseType: !1013, size: 48)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !1017, file: !153, line: 199, baseType: !144, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpflags_t", file: !1035, line: 206, baseType: !164)
!1035 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_mreq", file: !153, line: 374, size: 160, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_multiaddr", scope: !1038, file: !153, line: 375, baseType: !173, size: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_interface", scope: !1038, file: !153, line: 376, baseType: !7, size: 32, offset: 128)
!1042 = !{!0, !1043, !1062, !1067, !1147, !1149, !1151, !1153, !1155, !1157, !1159}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "__str", scope: !1045, file: !1046, line: 198, type: !200, isLocal: true, isDefinition: true)
!1045 = distinct !DISubprogram(name: "uk_pr_crit", scope: !1046, file: !1046, line: 194, type: !1047, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1049)
!1046 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !292, null}
!1049 = !{!1050, !1051}
!1050 = !DILocalVariable(name: "fmt", arg: 1, scope: !1045, file: !1046, line: 194, type: !292)
!1051 = !DILocalVariable(name: "argp", scope: !1045, file: !1046, line: 196, type: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1053, line: 32, baseType: !1054)
!1053 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !1055)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 192, elements: !253)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1056, file: !3, line: 196, baseType: !7, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1056, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1056, file: !3, line: 196, baseType: !143, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1056, file: !3, line: 196, baseType: !143, size: 64, offset: 128)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "__str", scope: !1045, file: !1046, line: 198, type: !1064, isLocal: true, isDefinition: true)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 80, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 10)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(name: "__str", scope: !1069, file: !3, line: 241, type: !1146, isLocal: true, isDefinition: true)
!1069 = distinct !DISubprogram(name: "sock_fd_alloc", scope: !3, file: !3, line: 189, type: !1070, isLocal: true, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1072)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!80, !80}
!1072 = !{!1073, !1074, !1075, !1076, !1082, !1083, !1084, !1085, !1086, !1092, !1093, !1099, !1100, !1101, !1107, !1113, !1114, !1115, !1121, !1122, !1128, !1134, !1140}
!1073 = !DILocalVariable(name: "sock_fd", arg: 1, scope: !1069, file: !3, line: 189, type: !80)
!1074 = !DILocalVariable(name: "ret", scope: !1069, file: !3, line: 191, type: !80)
!1075 = !DILocalVariable(name: "vfs_fd", scope: !1069, file: !3, line: 192, type: !80)
!1076 = !DILocalVariable(name: "file", scope: !1069, file: !3, line: 193, type: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock_net_file", file: !3, line: 156, size: 128, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vfscore_file", scope: !1078, file: !3, line: 157, baseType: !785, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sock_fd", scope: !1078, file: !3, line: 158, baseType: !80, size: 32, offset: 64)
!1082 = !DILocalVariable(name: "vfs_file", scope: !1069, file: !3, line: 194, type: !785)
!1083 = !DILocalVariable(name: "s_dentry", scope: !1069, file: !3, line: 195, type: !798)
!1084 = !DILocalVariable(name: "s_vnode", scope: !1069, file: !3, line: 196, type: !713)
!1085 = !DILocalVariable(name: "_dss_s_vnode", scope: !1069, file: !3, line: 197, type: !712)
!1086 = !DILocalVariable(name: "tid", scope: !1087, file: !3, line: 200, type: !170)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 200, column: 2)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 200, column: 2)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 200, column: 2)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 200, column: 2)
!1091 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 200, column: 2)
!1092 = !DILocalVariable(name: "_ret", scope: !1087, file: !3, line: 200, type: !135)
!1093 = !DILocalVariable(name: "tid", scope: !1094, file: !3, line: 224, type: !170)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 224, column: 2)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 224, column: 2)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 224, column: 2)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 224, column: 2)
!1098 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 224, column: 2)
!1099 = !DILocalVariable(name: "_ret", scope: !1094, file: !3, line: 224, type: !135)
!1100 = !DILocalVariable(name: "_arg3", scope: !1094, file: !3, line: 224, type: !135)
!1101 = !DILocalVariable(name: "tid", scope: !1102, file: !3, line: 235, type: !170)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 235, column: 2)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 235, column: 2)
