; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/strtod.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/strtod.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.FPI = type { i32, i32, i32, i32, i32 }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "fpi", scope: !2, file: !3, line: 306, type: !321, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_strtod_l", scope: !3, file: !3, line: 253, type: !4, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, unit: !292, retainedNodes: !336)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/strtod.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !287, !288, !290}
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !9, line: 569, size: 14912, elements: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !{!11, !13, !95, !96, !97, !98, !102, !103, !168, !169, !173, !185, !186, !187, !189, !190, !191, !253, !272, !273, !278, !285}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !8, file: !9, line: 571, baseType: !12, size: 32)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !8, file: !9, line: 576, baseType: !14, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !9, line: 287, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 181, size: 1408, elements: !17)
!17 = !{!18, !21, !22, !23, !25, !26, !31, !32, !34, !43, !49, !54, !58, !59, !60, !61, !65, !69, !70, !71, !73, !74, !78, !94}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !16, file: !9, line: 182, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !16, file: !9, line: 183, baseType: !12, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !16, file: !9, line: 184, baseType: !12, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !16, file: !9, line: 185, baseType: !24, size: 16, offset: 128)
!24 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !16, file: !9, line: 186, baseType: !24, size: 16, offset: 144)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !16, file: !9, line: 187, baseType: !27, size: 128, offset: 192)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 117, size: 128, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !27, file: !9, line: 118, baseType: !19, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !27, file: !9, line: 119, baseType: !12, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !16, file: !9, line: 188, baseType: !12, size: 32, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !16, file: !9, line: 195, baseType: !33, size: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !16, file: !9, line: 197, baseType: !35, size: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !7, !33, !41, !12}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !39, line: 145, baseType: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !16, file: !9, line: 199, baseType: !44, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!38, !7, !33, !47, !12}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !16, file: !9, line: 202, baseType: !50, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !7, !33, !53, !12}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !39, line: 114, baseType: !40)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !16, file: !9, line: 203, baseType: !55, size: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!12, !7, !33}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !16, file: !9, line: 206, baseType: !27, size: 128, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !16, file: !9, line: 207, baseType: !19, size: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !16, file: !9, line: 208, baseType: !12, size: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !16, file: !9, line: 211, baseType: !62, size: 24, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !16, file: !9, line: 212, baseType: !66, size: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !16, file: !9, line: 215, baseType: !27, size: 128, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !16, file: !9, line: 218, baseType: !12, size: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !16, file: !9, line: 219, baseType: !72, size: 64, offset: 1152)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !39, line: 44, baseType: !40)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !16, file: !9, line: 222, baseType: !7, size: 64, offset: 1216)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !16, file: !9, line: 226, baseType: !75, size: 32, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !39, line: 175, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !77, line: 12, baseType: !12)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !16, file: !9, line: 228, baseType: !79, size: 64, offset: 1312)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !39, line: 171, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 163, size: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !80, file: !39, line: 165, baseType: !12, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !80, file: !39, line: 170, baseType: !84, size: 32, offset: 32)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !39, line: 166, size: 32, elements: !85)
!85 = !{!86, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !84, file: !39, line: 168, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !88, line: 124, baseType: !89)
!88 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!89 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !84, file: !39, line: 169, baseType: !91, size: 32)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !16, file: !9, line: 229, baseType: !12, size: 32, offset: 1376)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !8, file: !9, line: 576, baseType: !14, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !8, file: !9, line: 576, baseType: !14, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !8, file: !9, line: 578, baseType: !12, size: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !8, file: !9, line: 579, baseType: !99, size: 200, offset: 288)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 200, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 25)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !8, file: !9, line: 582, baseType: !12, size: 32, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !8, file: !9, line: 583, baseType: !104, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !106, line: 178, size: 3392, elements: !107)
!106 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!107 = !{!108, !113, !121, !130, !131, !132, !160, !164, !167}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !105, file: !106, line: 180, baseType: !109, size: 1792)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1792, elements: !110)
!110 = !{!111, !112}
!111 = !DISubrange(count: 7)
!112 = !DISubrange(count: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !105, file: !106, line: 181, baseType: !114, size: 64, offset: 1792)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!12, !7, !41, !117, !118}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !88, line: 83, baseType: !12)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !120, line: 86, baseType: !79)
!120 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !105, file: !106, line: 183, baseType: !122, size: 64, offset: 1856)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !7, !125, !47, !126, !118}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 40, baseType: !128)
!127 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !39, line: 129, baseType: !129)
!129 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !105, file: !106, line: 185, baseType: !12, size: 32, offset: 1920)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !105, file: !106, line: 186, baseType: !41, size: 64, offset: 1984)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !105, file: !106, line: 187, baseType: !133, size: 768, offset: 2048)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !134, line: 42, size: 768, elements: !135)
!134 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !133, file: !134, line: 44, baseType: !41, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !133, file: !134, line: 45, baseType: !41, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !133, file: !134, line: 46, baseType: !41, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !133, file: !134, line: 47, baseType: !41, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !133, file: !134, line: 48, baseType: !41, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !133, file: !134, line: 49, baseType: !41, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !133, file: !134, line: 50, baseType: !41, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !133, file: !134, line: 51, baseType: !41, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !133, file: !134, line: 52, baseType: !41, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !133, file: !134, line: 53, baseType: !41, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !133, file: !134, line: 54, baseType: !42, size: 8, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !133, file: !134, line: 55, baseType: !42, size: 8, offset: 648)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !133, file: !134, line: 56, baseType: !42, size: 8, offset: 656)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !133, file: !134, line: 57, baseType: !42, size: 8, offset: 664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !133, file: !134, line: 58, baseType: !42, size: 8, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !133, file: !134, line: 59, baseType: !42, size: 8, offset: 680)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !133, file: !134, line: 60, baseType: !42, size: 8, offset: 688)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !133, file: !134, line: 61, baseType: !42, size: 8, offset: 696)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !133, file: !134, line: 62, baseType: !42, size: 8, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !133, file: !134, line: 63, baseType: !42, size: 8, offset: 712)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !133, file: !134, line: 64, baseType: !42, size: 8, offset: 720)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !133, file: !134, line: 65, baseType: !42, size: 8, offset: 728)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !133, file: !134, line: 66, baseType: !42, size: 8, offset: 736)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !133, file: !134, line: 67, baseType: !42, size: 8, offset: 744)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !105, file: !106, line: 189, baseType: !161, size: 16, offset: 2816)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 16, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !105, file: !106, line: 190, baseType: !165, size: 256, offset: 2832)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !166)
!166 = !{!112}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !105, file: !106, line: 191, baseType: !165, size: 256, offset: 3088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !8, file: !9, line: 585, baseType: !12, size: 32, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !8, file: !9, line: 587, baseType: !170, size: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !7}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !8, file: !9, line: 590, baseType: !174, size: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !9, line: 47, size: 256, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !175, file: !9, line: 49, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !175, file: !9, line: 50, baseType: !12, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !175, file: !9, line: 50, baseType: !12, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !175, file: !9, line: 50, baseType: !12, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !175, file: !9, line: 50, baseType: !12, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !175, file: !9, line: 51, baseType: !183, size: 32, offset: 192)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !67)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !9, line: 25, baseType: !89)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !8, file: !9, line: 591, baseType: !12, size: 32, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !8, file: !9, line: 592, baseType: !174, size: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !8, file: !9, line: 593, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !8, file: !9, line: 596, baseType: !12, size: 32, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !8, file: !9, line: 597, baseType: !41, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !8, file: !9, line: 632, baseType: !192, size: 2880, offset: 1152)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !9, line: 599, size: 2880, elements: !193)
!193 = !{!194, !244}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !192, file: !9, line: 622, baseType: !195, size: 1728)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !9, line: 601, size: 1728, elements: !196)
!196 = !{!197, !198, !199, !203, !215, !216, !218, !226, !227, !228, !229, !233, !237, !238, !239, !240, !241, !242, !243}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !195, file: !9, line: 603, baseType: !89, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !195, file: !9, line: 604, baseType: !41, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !195, file: !9, line: 605, baseType: !200, size: 208, offset: 128)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 208, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 26)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !195, file: !9, line: 606, baseType: !204, size: 288, offset: 352)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !9, line: 55, size: 288, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !204, file: !9, line: 57, baseType: !12, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !204, file: !9, line: 58, baseType: !12, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !204, file: !9, line: 59, baseType: !12, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !204, file: !9, line: 60, baseType: !12, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !204, file: !9, line: 61, baseType: !12, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !204, file: !9, line: 62, baseType: !12, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !204, file: !9, line: 63, baseType: !12, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !204, file: !9, line: 64, baseType: !12, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !204, file: !9, line: 65, baseType: !12, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !195, file: !9, line: 607, baseType: !12, size: 32, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !195, file: !9, line: 608, baseType: !217, size: 64, offset: 704)
!217 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !195, file: !9, line: 609, baseType: !219, size: 112, offset: 768)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !9, line: 319, size: 112, elements: !220)
!220 = !{!221, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !219, file: !9, line: 320, baseType: !222, size: 48)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 48, elements: !63)
!223 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !219, file: !9, line: 321, baseType: !222, size: 48, offset: 48)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !219, file: !9, line: 322, baseType: !223, size: 16, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !195, file: !9, line: 610, baseType: !79, size: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !195, file: !9, line: 611, baseType: !79, size: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !195, file: !9, line: 612, baseType: !79, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !195, file: !9, line: 613, baseType: !230, size: 64, offset: 1088)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !195, file: !9, line: 614, baseType: !234, size: 192, offset: 1152)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 192, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 24)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !195, file: !9, line: 615, baseType: !12, size: 32, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !195, file: !9, line: 616, baseType: !79, size: 64, offset: 1376)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !195, file: !9, line: 617, baseType: !79, size: 64, offset: 1440)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !195, file: !9, line: 618, baseType: !79, size: 64, offset: 1504)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !195, file: !9, line: 619, baseType: !79, size: 64, offset: 1568)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !195, file: !9, line: 620, baseType: !79, size: 64, offset: 1632)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !195, file: !9, line: 621, baseType: !12, size: 32, offset: 1696)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !192, file: !9, line: 631, baseType: !245, size: 2880)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !9, line: 626, size: 2880, elements: !246)
!246 = !{!247, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !245, file: !9, line: 629, baseType: !248, size: 1920)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1920, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 30)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !245, file: !9, line: 630, baseType: !252, size: 960, offset: 1920)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 960, elements: !249)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !8, file: !9, line: 636, baseType: !254, size: 64, offset: 4032)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !9, line: 93, size: 6336, elements: !256)
!256 = !{!257, !258, !259, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !255, file: !9, line: 94, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !255, file: !9, line: 95, baseType: !12, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !255, file: !9, line: 97, baseType: !260, size: 2048, offset: 128)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 2048, elements: !166)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !255, file: !9, line: 98, baseType: !265, size: 4160, offset: 2176)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !9, line: 74, size: 4160, elements: !266)
!266 = !{!267, !269, !270, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !265, file: !9, line: 75, baseType: !268, size: 2048)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !166)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !265, file: !9, line: 76, baseType: !268, size: 2048, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !265, file: !9, line: 78, baseType: !184, size: 32, offset: 4096)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !265, file: !9, line: 81, baseType: !184, size: 32, offset: 4128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !8, file: !9, line: 637, baseType: !255, size: 6336, offset: 4096)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !8, file: !9, line: 641, baseType: !274, size: 64, offset: 10432)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !12}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !8, file: !9, line: 646, baseType: !279, size: 192, offset: 10496)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !9, line: 291, size: 192, elements: !280)
!280 = !{!281, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !279, file: !9, line: 293, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !279, file: !9, line: 294, baseType: !12, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !279, file: !9, line: 295, baseType: !14, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !8, file: !9, line: 648, baseType: !286, size: 4224, offset: 10688)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4224, elements: !63)
!287 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!288 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !291, line: 10, baseType: !104)
!291 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !293, retainedTypes: !311, globals: !318)
!293 = !{!294}
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 36, baseType: !89, size: 32, elements: !296)
!295 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/gdtoa.h", directory: "/root/.unikraft/apps/redis/build")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!297 = !DIEnumerator(name: "STRTOG_Zero", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "STRTOG_Normal", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "STRTOG_Denormal", value: 2, isUnsigned: true)
!300 = !DIEnumerator(name: "STRTOG_Infinite", value: 3, isUnsigned: true)
!301 = !DIEnumerator(name: "STRTOG_NaN", value: 4, isUnsigned: true)
!302 = !DIEnumerator(name: "STRTOG_NaNbits", value: 5, isUnsigned: true)
!303 = !DIEnumerator(name: "STRTOG_NoNumber", value: 6, isUnsigned: true)
!304 = !DIEnumerator(name: "STRTOG_Retmask", value: 7, isUnsigned: true)
!305 = !DIEnumerator(name: "STRTOG_Neg", value: 8, isUnsigned: true)
!306 = !DIEnumerator(name: "STRTOG_Inexlo", value: 16, isUnsigned: true)
!307 = !DIEnumerator(name: "STRTOG_Inexhi", value: 32, isUnsigned: true)
!308 = !DIEnumerator(name: "STRTOG_Inexact", value: 48, isUnsigned: true)
!309 = !DIEnumerator(name: "STRTOG_Underflow", value: 64, isUnsigned: true)
!310 = !DIEnumerator(name: "STRTOG_Overflow", value: 128, isUnsigned: true)
!311 = !{!12, !312, !33, !41, !314, !317, !184, !316}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !313, line: 79, baseType: !89)
!313 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", file: !315, line: 84, baseType: !316)
!315 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/mprec.h", directory: "/root/.unikraft/apps/redis/build")
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !313, line: 77, baseType: !12)
!317 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!318 = !{!0, !319, !330}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "fpinan", scope: !2, file: !3, line: 433, type: !321, isLocal: true, isDefinition: true)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPI", file: !295, line: 63, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPI", file: !295, line: 57, size: 160, elements: !324)
!324 = !{!325, !326, !327, !328, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !323, file: !295, line: 58, baseType: !12, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !323, file: !295, line: 59, baseType: !12, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !323, file: !295, line: 60, baseType: !12, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rounding", scope: !323, file: !295, line: 61, baseType: !12, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sudden_underflow", scope: !323, file: !295, line: 62, baseType: !12, size: 32, offset: 128)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "tinytens", scope: !292, file: !3, line: 170, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 320, elements: !334)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!334 = !{!335}
!335 = !DISubrange(count: 5)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !376, !377, !378, !379, !380, !381, !384, !385, !386, !387, !388, !389, !390, !391, !393, !394, !398, !399}
!337 = !DILocalVariable(name: "ptr", arg: 1, scope: !2, file: !3, line: 253, type: !7)
!338 = !DILocalVariable(name: "s00", arg: 2, scope: !2, file: !3, line: 253, type: !287)
!339 = !DILocalVariable(name: "se", arg: 3, scope: !2, file: !3, line: 253, type: !288)
!340 = !DILocalVariable(name: "loc", arg: 4, scope: !2, file: !3, line: 254, type: !290)
!341 = !DILocalVariable(name: "scale", scope: !2, file: !3, line: 257, type: !12)
!342 = !DILocalVariable(name: "bb2", scope: !2, file: !3, line: 259, type: !12)
!343 = !DILocalVariable(name: "bb5", scope: !2, file: !3, line: 259, type: !12)
!344 = !DILocalVariable(name: "bbe", scope: !2, file: !3, line: 259, type: !12)
!345 = !DILocalVariable(name: "bd2", scope: !2, file: !3, line: 259, type: !12)
!346 = !DILocalVariable(name: "bd5", scope: !2, file: !3, line: 259, type: !12)
!347 = !DILocalVariable(name: "bbbits", scope: !2, file: !3, line: 259, type: !12)
!348 = !DILocalVariable(name: "bs2", scope: !2, file: !3, line: 259, type: !12)
!349 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 259, type: !12)
!350 = !DILocalVariable(name: "decpt", scope: !2, file: !3, line: 259, type: !12)
!351 = !DILocalVariable(name: "dsign", scope: !2, file: !3, line: 259, type: !12)
!352 = !DILocalVariable(name: "e", scope: !2, file: !3, line: 260, type: !12)
!353 = !DILocalVariable(name: "e1", scope: !2, file: !3, line: 260, type: !12)
!354 = !DILocalVariable(name: "esign", scope: !2, file: !3, line: 260, type: !12)
!355 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 260, type: !12)
!356 = !DILocalVariable(name: "j", scope: !2, file: !3, line: 260, type: !12)
!357 = !DILocalVariable(name: "k", scope: !2, file: !3, line: 260, type: !12)
!358 = !DILocalVariable(name: "nd", scope: !2, file: !3, line: 260, type: !12)
!359 = !DILocalVariable(name: "nd0", scope: !2, file: !3, line: 260, type: !12)
!360 = !DILocalVariable(name: "nf", scope: !2, file: !3, line: 260, type: !12)
!361 = !DILocalVariable(name: "nz", scope: !2, file: !3, line: 260, type: !12)
!362 = !DILocalVariable(name: "nz0", scope: !2, file: !3, line: 260, type: !12)
!363 = !DILocalVariable(name: "sign", scope: !2, file: !3, line: 260, type: !12)
!364 = !DILocalVariable(name: "s", scope: !2, file: !3, line: 261, type: !47)
!365 = !DILocalVariable(name: "s0", scope: !2, file: !3, line: 261, type: !47)
!366 = !DILocalVariable(name: "s1", scope: !2, file: !3, line: 261, type: !47)
!367 = !DILocalVariable(name: "aadj", scope: !2, file: !3, line: 262, type: !6)
!368 = !DILocalVariable(name: "adj", scope: !2, file: !3, line: 262, type: !6)
!369 = !DILocalVariable(name: "aadj1", scope: !2, file: !3, line: 263, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "U", file: !315, line: 89, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !315, line: 89, size: 64, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !371, file: !315, line: 89, baseType: !6, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !371, file: !315, line: 89, baseType: !375, size: 64)
