; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !6, !9, !38, !39, !54, !64, !73}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !11, line: 80, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !11, line: 73, size: 320, elements: !13)
!13 = !{!14, !31, !32, !34, !35, !37}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !12, file: !11, line: 74, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !11, line: 55, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !11, line: 44, size: 256, elements: !18)
!18 = !{!19, !21, !22, !23, !25, !26, !27, !28, !29, !30}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !17, file: !11, line: 45, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !11, line: 46, baseType: !20, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !17, file: !11, line: 47, baseType: !7, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !17, file: !11, line: 48, baseType: !24, size: 32, offset: 192)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !17, file: !11, line: 49, baseType: !24, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !17, file: !11, line: 50, baseType: !24, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !17, file: !11, line: 51, baseType: !24, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !17, file: !11, line: 52, baseType: !24, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !17, file: !11, line: 53, baseType: !24, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !17, file: !11, line: 54, baseType: !24, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !12, file: !11, line: 75, baseType: !15, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !12, file: !11, line: 76, baseType: !33, size: 64, offset: 128)
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !11, line: 77, baseType: !33, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !12, file: !11, line: 78, baseType: !36, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !12, file: !11, line: 79, baseType: !24, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !41, line: 51, size: 24, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !48, !49, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !41, line: 52, baseType: !44, size: 8)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 43, baseType: !8)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !41, line: 53, baseType: !44, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !41, line: 54, baseType: !8, size: 8, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !41, line: 55, baseType: !51, offset: 24)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: -1)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !41, line: 57, size: 40, elements: !56)
!56 = !{!57, !61, !62, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !41, line: 58, baseType: !58, size: 16)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 36, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !47, line: 57, baseType: !60)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !55, file: !41, line: 59, baseType: !58, size: 16, offset: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !41, line: 60, baseType: !8, size: 8, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !55, file: !41, line: 61, baseType: !51, offset: 40)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !41, line: 63, size: 72, elements: !66)
!66 = !{!67, !70, !71, !72}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !41, line: 64, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 48, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 79, baseType: !24)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !65, file: !41, line: 65, baseType: !68, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !41, line: 66, baseType: !8, size: 8, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !65, file: !41, line: 67, baseType: !51, offset: 72)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !41, line: 69, size: 136, elements: !75)
!75 = !{!76, !79, !80, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !41, line: 70, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 60, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !47, line: 105, baseType: !33)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !74, file: !41, line: 71, baseType: !77, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !41, line: 72, baseType: !8, size: 8, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !74, file: !41, line: 73, baseType: !51, offset: 136)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!86 = distinct !DISubprogram(name: "listTypePush", scope: !1, file: !1, line: 41, type: !87, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !99)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !89, !36}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !91, line: 622, baseType: !92)
!91 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !91, line: 614, size: 128, elements: !93)
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !91, line: 615, baseType: !24, size: 4, flags: DIFlagBitField, extraData: i64 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !92, file: !91, line: 616, baseType: !24, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !92, file: !91, line: 617, baseType: !24, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !92, file: !91, line: 620, baseType: !36, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, file: !91, line: 621, baseType: !38, size: 64, offset: 64)
!99 = !{!100, !101, !102, !103, !106}
!100 = !DILocalVariable(name: "subject", arg: 1, scope: !86, file: !1, line: 41, type: !89)
!101 = !DILocalVariable(name: "value", arg: 2, scope: !86, file: !1, line: 41, type: !89)
!102 = !DILocalVariable(name: "where", arg: 3, scope: !86, file: !1, line: 41, type: !36)
!103 = !DILocalVariable(name: "pos", scope: !104, file: !1, line: 43, type: !36)
!104 = distinct !DILexicalBlock(scope: !105, file: !1, line: 42, column: 54)
!105 = distinct !DILexicalBlock(scope: !86, file: !1, line: 42, column: 9)
!106 = !DILocalVariable(name: "len", scope: !104, file: !1, line: 45, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 40, baseType: !109)
!108 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !110, line: 129, baseType: !33)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!111 = !DILocation(line: 41, column: 25, scope: !86)
!112 = !DILocation(line: 41, column: 40, scope: !86)
!113 = !DILocation(line: 41, column: 51, scope: !86)
!114 = !DILocation(line: 42, column: 18, scope: !105)
!115 = !DILocation(line: 42, column: 27, scope: !105)
!116 = !DILocation(line: 42, column: 9, scope: !86)
!117 = !DILocation(line: 43, column: 26, scope: !104)
!118 = !DILocation(line: 43, column: 19, scope: !104)
!119 = !DILocation(line: 43, column: 13, scope: !104)
!120 = !DILocation(line: 44, column: 17, scope: !104)
!121 = !DILocation(line: 45, column: 36, scope: !104)
!122 = !{!123, !127, i64 8}
!123 = !{!"redisObject", !124, i64 0, !124, i64 0, !124, i64 1, !124, i64 4, !127, i64 8}
!124 = !{!"int", !125, i64 0}
!125 = !{!"omnipotent char", !126, i64 0}
!126 = !{!"Simple C/C++ TBAA"}
!127 = !{!"any pointer", !125, i64 0}
!128 = !DILocalVariable(name: "s", arg: 1, scope: !129, file: !41, line: 87, type: !134)
!129 = distinct !DISubprogram(name: "sdslen", scope: !41, file: !41, line: 87, type: !130, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !136)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 58, baseType: !33)
!133 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !41, line: 43, baseType: !4)
!136 = !{!128, !137}
!137 = !DILocalVariable(name: "flags", scope: !129, file: !41, line: 88, type: !8)
!138 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !139)
!139 = distinct !DILocation(line: 45, column: 22, scope: !104)
!140 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !139)
!141 = !{!125, !125, i64 0}
!142 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !139)
!143 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !139)
!144 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !139)
!145 = distinct !DILexicalBlock(scope: !129, file: !41, line: 89, column: 33)
!146 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !139)
!147 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !139)
!148 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !139)
!149 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !139)
!150 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !139)
!151 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !139)
!152 = !{!153, !153, i64 0}
!153 = !{!"short", !125, i64 0}
!154 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !139)
!155 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !139)
!156 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !139)
!157 = !{!124, !124, i64 0}
!158 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !139)
!159 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !139)
!160 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !139)
!161 = !{!162, !162, i64 0}
!162 = !{!"long", !125, i64 0}
!163 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !139)
!164 = !DILocation(line: 0, scope: !145, inlinedAt: !139)
!165 = !DILocation(line: 0, scope: !104)
!166 = !DILocation(line: 102, column: 1, scope: !129, inlinedAt: !139)
!167 = !DILocation(line: 45, column: 16, scope: !104)
!168 = !DILocation(line: 46, column: 32, scope: !104)
!169 = !DILocation(line: 46, column: 9, scope: !104)
!170 = !DILocation(line: 47, column: 9, scope: !104)
!171 = !DILocation(line: 51, column: 1, scope: !86)
!172 = !DILocation(line: 49, column: 9, scope: !173)
!173 = distinct !DILexicalBlock(scope: !105, file: !1, line: 48, column: 12)
!174 = distinct !DISubprogram(name: "listPopSaver", scope: !1, file: !1, line: 53, type: !175, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !177)
!175 = !DISubroutineType(types: !176)
!176 = !{!38, !7, !24}
!177 = !{!178, !179}
!178 = !DILocalVariable(name: "data", arg: 1, scope: !174, file: !1, line: 53, type: !7)
!179 = !DILocalVariable(name: "sz", arg: 2, scope: !174, file: !1, line: 53, type: !24)
!180 = !DILocation(line: 53, column: 35, scope: !174)
!181 = !DILocation(line: 53, column: 54, scope: !174)
!182 = !DILocation(line: 54, column: 43, scope: !174)
!183 = !DILocation(line: 54, column: 12, scope: !174)
!184 = !DILocation(line: 54, column: 5, scope: !174)
!185 = distinct !DISubprogram(name: "listTypePop", scope: !1, file: !1, line: 57, type: !186, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !188)
!186 = !DISubroutineType(types: !187)
!187 = !{!89, !89, !36}
!188 = !{!189, !190, !191, !193, !194}
!189 = !DILocalVariable(name: "subject", arg: 1, scope: !185, file: !1, line: 57, type: !89)
!190 = !DILocalVariable(name: "where", arg: 2, scope: !185, file: !1, line: 57, type: !36)
!191 = !DILocalVariable(name: "vlong", scope: !185, file: !1, line: 58, type: !192)
!192 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!193 = !DILocalVariable(name: "value", scope: !185, file: !1, line: 59, type: !89)
!194 = !DILocalVariable(name: "ql_where", scope: !185, file: !1, line: 61, type: !36)
!195 = !DILocation(line: 57, column: 25, scope: !185)
!196 = !DILocation(line: 57, column: 38, scope: !185)
!197 = !DILocation(line: 58, column: 5, scope: !185)
!198 = !DILocation(line: 59, column: 5, scope: !185)
!199 = !DILocation(line: 59, column: 11, scope: !185)
!200 = !{!127, !127, i64 0}
!201 = !DILocation(line: 62, column: 18, scope: !202)
!202 = distinct !DILexicalBlock(scope: !185, file: !1, line: 62, column: 9)
!203 = !DILocation(line: 62, column: 27, scope: !202)
!204 = !DILocation(line: 62, column: 9, scope: !185)
!205 = !DILocation(line: 61, column: 26, scope: !185)
!206 = !DILocation(line: 61, column: 20, scope: !185)
!207 = !DILocation(line: 61, column: 9, scope: !185)
!208 = !DILocation(line: 63, column: 41, scope: !209)
!209 = distinct !DILexicalBlock(scope: !210, file: !1, line: 63, column: 13)
!210 = distinct !DILexicalBlock(scope: !202, file: !1, line: 62, column: 54)
!211 = !DILocation(line: 63, column: 56, scope: !209)
!212 = !DILocation(line: 58, column: 15, scope: !185)
!213 = !DILocation(line: 63, column: 13, scope: !209)
!214 = !DILocation(line: 65, column: 18, scope: !215)
!215 = distinct !DILexicalBlock(scope: !216, file: !1, line: 65, column: 17)
!216 = distinct !DILexicalBlock(scope: !209, file: !1, line: 64, column: 61)
!217 = !DILocation(line: 63, column: 13, scope: !210)
!218 = !DILocation(line: 66, column: 56, scope: !215)
!219 = !{!220, !220, i64 0}
!220 = !{!"long long", !125, i64 0}
!221 = !DILocation(line: 66, column: 25, scope: !215)
!222 = !DILocation(line: 66, column: 23, scope: !215)
!223 = !DILocation(line: 66, column: 17, scope: !215)
!224 = !DILocation(line: 69, column: 9, scope: !225)
!225 = distinct !DILexicalBlock(scope: !202, file: !1, line: 68, column: 12)
!226 = !DILocation(line: 71, column: 12, scope: !185)
!227 = !DILocation(line: 72, column: 1, scope: !185)
!228 = !DILocation(line: 71, column: 5, scope: !185)
!229 = distinct !DISubprogram(name: "listTypeLength", scope: !1, file: !1, line: 74, type: !230, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !234)
!230 = !DISubroutineType(types: !231)
!231 = !{!33, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!234 = !{!235}
!235 = !DILocalVariable(name: "subject", arg: 1, scope: !229, file: !1, line: 74, type: !232)
!236 = !DILocation(line: 74, column: 42, scope: !229)
!237 = !DILocation(line: 75, column: 18, scope: !238)
!238 = distinct !DILexicalBlock(scope: !229, file: !1, line: 75, column: 9)
!239 = !DILocation(line: 75, column: 27, scope: !238)
!240 = !DILocation(line: 75, column: 9, scope: !229)
!241 = !DILocation(line: 76, column: 40, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !1, line: 75, column: 54)
!243 = !DILocation(line: 76, column: 16, scope: !242)
!244 = !DILocation(line: 76, column: 9, scope: !242)
!245 = !DILocation(line: 78, column: 9, scope: !246)
!246 = distinct !DILexicalBlock(scope: !238, file: !1, line: 77, column: 12)
!247 = distinct !DISubprogram(name: "listTypeInitIterator", scope: !1, file: !1, line: 83, type: !248, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !270)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !89, !268, !8}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeIterator", file: !91, line: 1347, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 1342, size: 192, elements: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !252, file: !91, line: 1343, baseType: !89, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !252, file: !91, line: 1344, baseType: !8, size: 8, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !252, file: !91, line: 1345, baseType: !8, size: 8, offset: 72)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !252, file: !91, line: 1346, baseType: !258, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistIter", file: !11, line: 88, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistIter", file: !11, line: 82, size: 320, elements: !261)
!261 = !{!262, !265, !266, !267, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !260, file: !11, line: 83, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !260, file: !11, line: 84, baseType: !15, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !260, file: !11, line: 85, baseType: !7, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !260, file: !11, line: 86, baseType: !268, size: 64, offset: 192)
!268 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !260, file: !11, line: 87, baseType: !36, size: 32, offset: 256)
!270 = !{!271, !272, !273, !274, !275}
!271 = !DILocalVariable(name: "subject", arg: 1, scope: !247, file: !1, line: 83, type: !89)
!272 = !DILocalVariable(name: "index", arg: 2, scope: !247, file: !1, line: 83, type: !268)
!273 = !DILocalVariable(name: "direction", arg: 3, scope: !247, file: !1, line: 84, type: !8)
!274 = !DILocalVariable(name: "li", scope: !247, file: !1, line: 85, type: !250)
!275 = !DILocalVariable(name: "iter_direction", scope: !247, file: !1, line: 92, type: !36)
!276 = !DILocation(line: 83, column: 46, scope: !247)
!277 = !DILocation(line: 83, column: 60, scope: !247)
!278 = !DILocation(line: 84, column: 54, scope: !247)
!279 = !DILocation(line: 85, column: 28, scope: !247)
!280 = !DILocation(line: 86, column: 9, scope: !247)
!281 = !DILocation(line: 86, column: 17, scope: !247)
!282 = !{!283, !127, i64 0}
!283 = !{!"", !127, i64 0, !125, i64 8, !125, i64 9, !127, i64 16}
!284 = !DILocation(line: 87, column: 29, scope: !247)
!285 = !DILocation(line: 87, column: 20, scope: !247)
!286 = !DILocation(line: 87, column: 9, scope: !247)
!287 = !DILocation(line: 87, column: 18, scope: !247)
!288 = !{!283, !125, i64 8}
!289 = !DILocation(line: 88, column: 9, scope: !247)
!290 = !DILocation(line: 88, column: 19, scope: !247)
!291 = !{!283, !125, i64 9}
!292 = !DILocation(line: 89, column: 9, scope: !247)
!293 = !DILocation(line: 89, column: 14, scope: !247)
!294 = !{!283, !127, i64 16}
!295 = !DILocation(line: 94, column: 22, scope: !296)
!296 = distinct !DILexicalBlock(scope: !247, file: !1, line: 94, column: 9)
!297 = !DILocation(line: 94, column: 9, scope: !247)
!298 = !DILocation(line: 93, column: 19, scope: !247)
!299 = !DILocation(line: 93, column: 9, scope: !247)
!300 = !DILocation(line: 92, column: 9, scope: !247)
!301 = !DILocation(line: 85, column: 23, scope: !247)
!302 = !DILocation(line: 95, column: 59, scope: !303)
!303 = distinct !DILexicalBlock(scope: !296, file: !1, line: 94, column: 49)
!304 = !DILocation(line: 95, column: 20, scope: !303)
!305 = !DILocation(line: 95, column: 18, scope: !303)
!306 = !DILocation(line: 100, column: 5, scope: !247)
!307 = !DILocation(line: 98, column: 9, scope: !308)
!308 = distinct !DILexicalBlock(scope: !296, file: !1, line: 97, column: 12)
!309 = distinct !DISubprogram(name: "listTypeReleaseIterator", scope: !1, file: !1, line: 104, type: !310, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !250}
!312 = !{!313}
!313 = !DILocalVariable(name: "li", arg: 1, scope: !309, file: !1, line: 104, type: !250)
!314 = !DILocation(line: 104, column: 48, scope: !309)
!315 = !DILocation(line: 105, column: 15, scope: !309)
!316 = !DILocation(line: 105, column: 5, scope: !309)
!317 = !DILocation(line: 106, column: 11, scope: !309)
!318 = !DILocation(line: 106, column: 5, scope: !309)
!319 = !DILocation(line: 107, column: 1, scope: !309)
!320 = distinct !DISubprogram(name: "listTypeNext", scope: !1, file: !1, line: 112, type: !321, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !339)
!321 = !DISubroutineType(types: !322)
!322 = !{!36, !250, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeEntry", file: !91, line: 1353, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 1350, size: 448, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "li", scope: !325, file: !91, line: 1351, baseType: !250, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !325, file: !91, line: 1352, baseType: !329, size: 384, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistEntry", file: !11, line: 98, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistEntry", file: !11, line: 90, size: 384, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !330, file: !11, line: 91, baseType: !263, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !330, file: !11, line: 92, baseType: !15, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !330, file: !11, line: 93, baseType: !7, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !330, file: !11, line: 94, baseType: !7, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "longval", scope: !330, file: !11, line: 95, baseType: !192, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !330, file: !11, line: 96, baseType: !24, size: 32, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !330, file: !11, line: 97, baseType: !36, size: 32, offset: 352)
!339 = !{!340, !341}
!340 = !DILocalVariable(name: "li", arg: 1, scope: !320, file: !1, line: 112, type: !250)
!341 = !DILocalVariable(name: "entry", arg: 2, scope: !320, file: !1, line: 112, type: !323)
!342 = !DILocation(line: 112, column: 36, scope: !320)
!343 = !DILocation(line: 112, column: 55, scope: !320)
!344 = !DILocation(line: 114, column: 5, scope: !320)
!345 = !DILocation(line: 116, column: 12, scope: !320)
!346 = !DILocation(line: 116, column: 15, scope: !320)
!347 = !{!348, !127, i64 0}
!348 = !{!"", !127, i64 0, !349, i64 8}
!349 = !{!"quicklistEntry", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !220, i64 32, !124, i64 40, !124, i64 44}
!350 = !DILocation(line: 117, column: 22, scope: !351)
!351 = distinct !DILexicalBlock(scope: !320, file: !1, line: 117, column: 9)
!352 = !DILocation(line: 117, column: 9, scope: !320)
!353 = !DILocation(line: 118, column: 34, scope: !354)
!354 = distinct !DILexicalBlock(scope: !351, file: !1, line: 117, column: 49)
!355 = !DILocation(line: 118, column: 48, scope: !354)
!356 = !DILocation(line: 118, column: 16, scope: !354)
!357 = !DILocation(line: 118, column: 9, scope: !354)
!358 = !DILocation(line: 120, column: 9, scope: !359)
!359 = distinct !DILexicalBlock(scope: !351, file: !1, line: 119, column: 12)
!360 = distinct !DISubprogram(name: "listTypeGet", scope: !1, file: !1, line: 126, type: !361, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!89, !323}
!363 = !{!364, !365}
!364 = !DILocalVariable(name: "entry", arg: 1, scope: !360, file: !1, line: 126, type: !323)
!365 = !DILocalVariable(name: "value", scope: !360, file: !1, line: 127, type: !89)
!366 = !DILocation(line: 126, column: 34, scope: !360)
!367 = !DILocation(line: 127, column: 11, scope: !360)
!368 = !DILocation(line: 128, column: 16, scope: !369)
!369 = distinct !DILexicalBlock(scope: !360, file: !1, line: 128, column: 9)
!370 = !DILocation(line: 128, column: 20, scope: !369)
!371 = !DILocation(line: 128, column: 29, scope: !369)
!372 = !DILocation(line: 128, column: 9, scope: !360)
!373 = !DILocation(line: 129, column: 26, scope: !374)
!374 = distinct !DILexicalBlock(scope: !375, file: !1, line: 129, column: 13)
!375 = distinct !DILexicalBlock(scope: !369, file: !1, line: 128, column: 56)
!376 = !{!348, !127, i64 32}
!377 = !DILocation(line: 129, column: 13, scope: !374)
!378 = !DILocation(line: 129, column: 13, scope: !375)
!379 = !DILocation(line: 131, column: 53, scope: !380)
!380 = distinct !DILexicalBlock(scope: !374, file: !1, line: 129, column: 33)
!381 = !{!348, !124, i64 48}
!382 = !DILocation(line: 131, column: 40, scope: !380)
!383 = !DILocation(line: 130, column: 21, scope: !380)
!384 = !DILocation(line: 132, column: 9, scope: !380)
!385 = !DILocation(line: 133, column: 65, scope: !386)
!386 = distinct !DILexicalBlock(scope: !374, file: !1, line: 132, column: 16)
!387 = !{!348, !220, i64 40}
!388 = !DILocation(line: 133, column: 21, scope: !386)
!389 = !DILocation(line: 136, column: 9, scope: !390)
!390 = distinct !DILexicalBlock(scope: !369, file: !1, line: 135, column: 12)
!391 = !DILocation(line: 0, scope: !386)
!392 = !DILocation(line: 138, column: 5, scope: !360)
!393 = distinct !DISubprogram(name: "listTypeInsert", scope: !1, file: !1, line: 141, type: !394, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !323, !89, !36}
!396 = !{!397, !398, !399, !400, !403}
!397 = !DILocalVariable(name: "entry", arg: 1, scope: !393, file: !1, line: 141, type: !323)
!398 = !DILocalVariable(name: "value", arg: 2, scope: !393, file: !1, line: 141, type: !89)
!399 = !DILocalVariable(name: "where", arg: 3, scope: !393, file: !1, line: 141, type: !36)
!400 = !DILocalVariable(name: "str", scope: !401, file: !1, line: 144, type: !135)
!401 = distinct !DILexicalBlock(scope: !402, file: !1, line: 142, column: 56)
!402 = distinct !DILexicalBlock(scope: !393, file: !1, line: 142, column: 9)
!403 = !DILocalVariable(name: "len", scope: !401, file: !1, line: 145, type: !107)
!404 = !DILocation(line: 141, column: 36, scope: !393)
!405 = !DILocation(line: 141, column: 49, scope: !393)
!406 = !DILocation(line: 141, column: 60, scope: !393)
!407 = !DILocation(line: 142, column: 16, scope: !402)
!408 = !DILocation(line: 142, column: 20, scope: !402)
!409 = !DILocation(line: 142, column: 29, scope: !402)
!410 = !DILocation(line: 142, column: 9, scope: !393)
!411 = !DILocation(line: 143, column: 17, scope: !401)
!412 = !DILocation(line: 144, column: 26, scope: !401)
!413 = !DILocation(line: 144, column: 13, scope: !401)
!414 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !415)
!415 = distinct !DILocation(line: 145, column: 22, scope: !401)
!416 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !415)
!417 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !415)
!418 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !415)
!419 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !415)
!420 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !415)
!421 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !415)
!422 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !415)
!423 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !415)
!424 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !415)
!425 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !415)
!426 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !415)
!427 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !415)
!428 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !415)
!429 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !415)
!430 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !415)
!431 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !415)
!432 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !415)
!433 = !DILocation(line: 0, scope: !145, inlinedAt: !415)
!434 = !DILocation(line: 0, scope: !401)
!435 = !DILocation(line: 102, column: 1, scope: !129, inlinedAt: !415)
!436 = !DILocation(line: 145, column: 16, scope: !401)
!437 = !DILocation(line: 146, column: 19, scope: !438)
!438 = distinct !DILexicalBlock(scope: !401, file: !1, line: 146, column: 13)
!439 = !DILocation(line: 146, column: 13, scope: !401)
!440 = !DILocation(line: 147, column: 54, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !1, line: 146, column: 33)
!442 = !DILocation(line: 147, column: 60, scope: !441)
!443 = !{!348, !127, i64 8}
!444 = !DILocation(line: 147, column: 13, scope: !441)
!445 = !DILocation(line: 149, column: 9, scope: !441)
!446 = !DILocation(line: 149, column: 26, scope: !447)
!447 = distinct !DILexicalBlock(scope: !438, file: !1, line: 149, column: 20)
!448 = !DILocation(line: 149, column: 20, scope: !438)
!449 = !DILocation(line: 150, column: 55, scope: !450)
!450 = distinct !DILexicalBlock(scope: !447, file: !1, line: 149, column: 40)
!451 = !DILocation(line: 150, column: 61, scope: !450)
!452 = !DILocation(line: 150, column: 13, scope: !450)
!453 = !DILocation(line: 152, column: 9, scope: !450)
!454 = !DILocation(line: 0, scope: !441)
!455 = !DILocation(line: 153, column: 9, scope: !401)
!456 = !DILocation(line: 157, column: 1, scope: !393)
!457 = !DILocation(line: 155, column: 9, scope: !458)
!458 = distinct !DILexicalBlock(scope: !402, file: !1, line: 154, column: 12)
!459 = distinct !DISubprogram(name: "listTypeEqual", scope: !1, file: !1, line: 160, type: !460, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!36, !323, !89}
!462 = !{!463, !464}
!463 = !DILocalVariable(name: "entry", arg: 1, scope: !459, file: !1, line: 160, type: !323)
!464 = !DILocalVariable(name: "o", arg: 2, scope: !459, file: !1, line: 160, type: !89)
!465 = !DILocation(line: 160, column: 34, scope: !459)
!466 = !DILocation(line: 160, column: 47, scope: !459)
!467 = !DILocation(line: 161, column: 16, scope: !468)
!468 = distinct !DILexicalBlock(scope: !459, file: !1, line: 161, column: 9)
!469 = !DILocation(line: 161, column: 20, scope: !468)
!470 = !DILocation(line: 161, column: 29, scope: !468)
!471 = !DILocation(line: 161, column: 9, scope: !459)
!472 = !DILocation(line: 162, column: 9, scope: !473)
!473 = distinct !DILexicalBlock(scope: !468, file: !1, line: 161, column: 56)
!474 = !DILocation(line: 163, column: 46, scope: !473)
!475 = !{!348, !127, i64 24}
!476 = !DILocation(line: 163, column: 52, scope: !473)
!477 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !478)
!478 = distinct !DILocation(line: 163, column: 56, scope: !473)
!479 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !478)
!480 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !478)
!481 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !478)
!482 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !478)
!483 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !478)
!484 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !478)
!485 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !478)
!486 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !478)
!487 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !478)
!488 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !478)
!489 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !478)
!490 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !478)
!491 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !478)
!492 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !478)
!493 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !478)
!494 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !478)
!495 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !478)
!496 = !DILocation(line: 0, scope: !145, inlinedAt: !478)
!497 = !DILocation(line: 0, scope: !473)
!498 = !DILocation(line: 102, column: 1, scope: !129, inlinedAt: !478)
!499 = !DILocation(line: 163, column: 56, scope: !473)
!500 = !DILocation(line: 163, column: 16, scope: !473)
!501 = !DILocation(line: 163, column: 9, scope: !473)
!502 = !DILocation(line: 165, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !468, file: !1, line: 164, column: 12)
!504 = distinct !DISubprogram(name: "listTypeDelete", scope: !1, file: !1, line: 170, type: !505, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !250, !323}
!507 = !{!508, !509}
!508 = !DILocalVariable(name: "iter", arg: 1, scope: !504, file: !1, line: 170, type: !250)
!509 = !DILocalVariable(name: "entry", arg: 2, scope: !504, file: !1, line: 170, type: !323)
!510 = !DILocation(line: 170, column: 39, scope: !504)
!511 = !DILocation(line: 170, column: 60, scope: !504)
!512 = !DILocation(line: 171, column: 16, scope: !513)
!513 = distinct !DILexicalBlock(scope: !504, file: !1, line: 171, column: 9)
!514 = !DILocation(line: 171, column: 20, scope: !513)
!515 = !DILocation(line: 171, column: 29, scope: !513)
!516 = !DILocation(line: 171, column: 9, scope: !504)
!517 = !DILocation(line: 172, column: 33, scope: !518)
!518 = distinct !DILexicalBlock(scope: !513, file: !1, line: 171, column: 56)
!519 = !DILocation(line: 172, column: 47, scope: !518)
!520 = !DILocation(line: 172, column: 9, scope: !518)
!521 = !DILocation(line: 176, column: 1, scope: !504)
!522 = !DILocation(line: 174, column: 9, scope: !523)
!523 = distinct !DILexicalBlock(scope: !513, file: !1, line: 173, column: 12)
!524 = distinct !DISubprogram(name: "listTypeConvert", scope: !1, file: !1, line: 179, type: !525, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !89, !36}
!527 = !{!528, !529, !530, !533}
!528 = !DILocalVariable(name: "subject", arg: 1, scope: !524, file: !1, line: 179, type: !89)
!529 = !DILocalVariable(name: "enc", arg: 2, scope: !524, file: !1, line: 179, type: !36)
!530 = !DILocalVariable(name: "zlen", scope: !531, file: !1, line: 184, type: !107)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 183, column: 40)
!532 = distinct !DILexicalBlock(scope: !524, file: !1, line: 183, column: 9)
!533 = !DILocalVariable(name: "depth", scope: !531, file: !1, line: 185, type: !36)
!534 = !DILocation(line: 179, column: 28, scope: !524)
!535 = !DILocation(line: 179, column: 41, scope: !524)
!536 = !DILocation(line: 180, column: 5, scope: !524)
!537 = !DILocation(line: 181, column: 5, scope: !524)
!538 = !DILocation(line: 183, column: 13, scope: !532)
!539 = !DILocation(line: 183, column: 9, scope: !524)
!540 = !DILocation(line: 184, column: 30, scope: !531)
!541 = !{!542, !124, i64 2864}
!542 = !{!"redisServer", !124, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !124, i64 32, !124, i64 36, !124, i64 40, !127, i64 48, !127, i64 56, !127, i64 64, !127, i64 72, !124, i64 80, !124, i64 84, !124, i64 88, !124, i64 92, !127, i64 96, !127, i64 104, !124, i64 112, !124, i64 116, !125, i64 120, !124, i64 164, !162, i64 168, !124, i64 176, !127, i64 184, !127, i64 192, !127, i64 200, !125, i64 208, !124, i64 216, !124, i64 220, !125, i64 224, !124, i64 352, !127, i64 360, !124, i64 368, !125, i64 372, !124, i64 436, !124, i64 440, !125, i64 444, !124, i64 508, !127, i64 512, !127, i64 520, !127, i64 528, !127, i64 536, !127, i64 544, !127, i64 552, !127, i64 560, !124, i64 568, !220, i64 576, !125, i64 584, !127, i64 840, !162, i64 848, !124, i64 856, !124, i64 860, !162, i64 864, !162, i64 872, !162, i64 880, !162, i64 888, !127, i64 896, !127, i64 904, !127, i64 912, !127, i64 920, !127, i64 928, !127, i64 936, !127, i64 944, !127, i64 952, !127, i64 960, !127, i64 968, !127, i64 976, !127, i64 984, !127, i64 992, !162, i64 1000, !220, i64 1008, !220, i64 1016, !220, i64 1024, !543, i64 1032, !220, i64 1040, !220, i64 1048, !220, i64 1056, !220, i64 1064, !220, i64 1072, !220, i64 1080, !220, i64 1088, !220, i64 1096, !220, i64 1104, !162, i64 1112, !220, i64 1120, !543, i64 1128, !220, i64 1136, !220, i64 1144, !220, i64 1152, !220, i64 1160, !127, i64 1168, !220, i64 1176, !220, i64 1184, !162, i64 1192, !544, i64 1200, !220, i64 1240, !220, i64 1248, !162, i64 1256, !162, i64 1264, !125, i64 1272, !124, i64 1728, !124, i64 1732, !124, i64 1736, !124, i64 1740, !124, i64 1744, !162, i64 1752, !124, i64 1760, !124, i64 1764, !124, i64 1768, !124, i64 1772, !162, i64 1776, !162, i64 1784, !124, i64 1792, !124, i64 1796, !124, i64 1800, !124, i64 1804, !125, i64 1808, !124, i64 1880, !124, i64 1884, !127, i64 1888, !124, i64 1896, !124, i64 1900, !162, i64 1904, !162, i64 1912, !162, i64 1920, !162, i64 1928, !124, i64 1936, !124, i64 1940, !127, i64 1944, !127, i64 1952, !124, i64 1960, !124, i64 1964, !162, i64 1968, !162, i64 1976, !162, i64 1984, !162, i64 1992, !124, i64 2000, !162, i64 2008, !124, i64 2016, !124, i64 2020, !124, i64 2024, !124, i64 2028, !124, i64 2032, !124, i64 2036, !124, i64 2040, !124, i64 2044, !124, i64 2048, !124, i64 2052, !124, i64 2056, !124, i64 2060, !124, i64 2064, !127, i64 2072, !220, i64 2080, !220, i64 2088, !124, i64 2096, !127, i64 2104, !124, i64 2112, !127, i64 2120, !124, i64 2128, !124, i64 2132, !162, i64 2136, !162, i64 2144, !162, i64 2152, !162, i64 2160, !124, i64 2168, !124, i64 2172, !124, i64 2176, !124, i64 2180, !124, i64 2184, !124, i64 2188, !125, i64 2192, !545, i64 2200, !546, i64 2224, !127, i64 2240, !124, i64 2248, !127, i64 2256, !124, i64 2264, !125, i64 2268, !125, i64 2309, !220, i64 2352, !220, i64 2360, !124, i64 2368, !124, i64 2372, !127, i64 2376, !220, i64 2384, !220, i64 2392, !220, i64 2400, !220, i64 2408, !162, i64 2416, !162, i64 2424, !124, i64 2432, !124, i64 2436, !124, i64 2440, !124, i64 2444, !124, i64 2448, !127, i64 2456, !127, i64 2464, !124, i64 2472, !124, i64 2476, !127, i64 2480, !127, i64 2488, !124, i64 2496, !124, i64 2500, !162, i64 2504, !162, i64 2512, !162, i64 2520, !124, i64 2528, !124, i64 2532, !127, i64 2536, !162, i64 2544, !124, i64 2552, !124, i64 2556, !124, i64 2560, !162, i64 2568, !124, i64 2576, !124, i64 2580, !124, i64 2584, !127, i64 2592, !125, i64 2600, !220, i64 2648, !124, i64 2656, !127, i64 2664, !127, i64 2672, !124, i64 2680, !127, i64 2688, !124, i64 2696, !124, i64 2700, !220, i64 2704, !124, i64 2712, !124, i64 2716, !124, i64 2720, !124, i64 2724, !220, i64 2728, !124, i64 2736, !125, i64 2740, !127, i64 2768, !127, i64 2776, !124, i64 2784, !124, i64 2788, !124, i64 2792, !124, i64 2796, !162, i64 2800, !162, i64 2808, !162, i64 2816, !162, i64 2824, !162, i64 2832, !162, i64 2840, !162, i64 2848, !162, i64 2856, !124, i64 2864, !124, i64 2868, !162, i64 2872, !162, i64 2880, !124, i64 2888, !220, i64 2896, !127, i64 2904, !127, i64 2912, !124, i64 2920, !124, i64 2924, !220, i64 2928, !127, i64 2936, !127, i64 2944, !124, i64 2952, !124, i64 2956, !124, i64 2960, !124, i64 2964, !127, i64 2968, !124, i64 2976, !124, i64 2980, !124, i64 2984, !127, i64 2992, !127, i64 3000, !127, i64 3008, !127, i64 3016, !220, i64 3024, !220, i64 3032, !220, i64 3040, !124, i64 3048, !124, i64 3052, !124, i64 3056, !124, i64 3060, !124, i64 3064, !124, i64 3068, !124, i64 3072, !124, i64 3076, !124, i64 3080, !124, i64 3084, !124, i64 3088, !220, i64 3096, !127, i64 3104, !127, i64 3112, !127, i64 3120, !124, i64 3128, !124, i64 3132, !124, i64 3136, !162, i64 3144, !127, i64 3152, !127, i64 3160, !127, i64 3168}
!543 = !{!"double", !125, i64 0}
!544 = !{!"malloc_stats", !162, i64 0, !162, i64 8, !162, i64 16, !162, i64 24, !162, i64 32}
!545 = !{!"", !124, i64 0, !162, i64 8, !220, i64 16}
!546 = !{!"redisOpArray", !127, i64 0, !124, i64 8}
!547 = !DILocation(line: 185, column: 28, scope: !531)
!548 = !{!542, !124, i64 2868}
!549 = !DILocation(line: 185, column: 13, scope: !531)
!550 = !DILocation(line: 186, column: 73, scope: !531)
!551 = !DILocation(line: 186, column: 24, scope: !531)
!552 = !DILocation(line: 186, column: 22, scope: !531)
!553 = !DILocation(line: 187, column: 27, scope: !531)
!554 = !DILocation(line: 191, column: 1, scope: !524)
!555 = !DILocation(line: 189, column: 9, scope: !556)
!556 = distinct !DILexicalBlock(scope: !532, file: !1, line: 188, column: 12)
!557 = distinct !DISubprogram(name: "pushGenericCommand", scope: !1, file: !1, line: 197, type: !558, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !786)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !560, !36}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !91, line: 780, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !91, line: 723, size: 135360, elements: !563)
!563 = !{!564, !565, !566, !669, !670, !671, !672, !673, !674, !675, !677, !701, !702, !703, !704, !705, !706, !708, !709, !712, !713, !714, !715, !716, !717, !718, !719, !724, !725, !726, !727, !728, !729, !730, !731, !735, !736, !740, !741, !757, !758, !775, !776, !777, !778, !779, !780, !781, !782}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !562, file: !91, line: 724, baseType: !77, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !562, file: !91, line: 725, baseType: !36, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !562, file: !91, line: 726, baseType: !567, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !91, line: 656, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !91, line: 647, size: 512, elements: !570)
!570 = !{!571, !634, !635, !636, !637, !638, !639, !640}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !569, file: !91, line: 648, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !574, line: 82, baseType: !575)
!574 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !574, line: 76, size: 768, elements: !576)
!576 = !{!577, !602, !603, !632, !633}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !575, file: !574, line: 77, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !574, line: 65, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !574, line: 58, size: 384, elements: !581)
!581 = !{!582, !588, !592, !593, !597, !601}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !580, file: !574, line: 59, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!77, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !580, file: !574, line: 60, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!38, !38, !586}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !580, file: !574, line: 61, baseType: !589, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !580, file: !574, line: 62, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!36, !38, !586, !586}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !580, file: !574, line: 63, baseType: !598, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !38, !38}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !580, file: !574, line: 64, baseType: !598, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !575, file: !574, line: 78, baseType: !38, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !575, file: !574, line: 79, baseType: !604, size: 512, offset: 128)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 512, elements: !630)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !574, line: 74, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !574, line: 69, size: 256, elements: !607)
!607 = !{!608, !627, !628, !629}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !606, file: !574, line: 70, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !574, line: 56, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !574, line: 47, size: 192, elements: !613)
!613 = !{!614, !615, !625}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !612, file: !574, line: 48, baseType: !38, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !612, file: !574, line: 54, baseType: !616, size: 64, offset: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !574, line: 49, size: 64, elements: !617)
!617 = !{!618, !619, !620, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !616, file: !574, line: 50, baseType: !38, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !616, file: !574, line: 51, baseType: !77, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !616, file: !574, line: 52, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !45, line: 56, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !47, line: 103, baseType: !268)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !616, file: !574, line: 53, baseType: !624, size: 64)
!624 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !574, line: 55, baseType: !626, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !574, line: 71, baseType: !33, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !606, file: !574, line: 72, baseType: !33, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !606, file: !574, line: 73, baseType: !33, size: 64, offset: 192)
!630 = !{!631}
!631 = !DISubrange(count: 2)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !575, file: !574, line: 80, baseType: !268, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !575, file: !574, line: 81, baseType: !33, size: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !569, file: !91, line: 649, baseType: !572, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !569, file: !91, line: 650, baseType: !572, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !569, file: !91, line: 651, baseType: !572, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !569, file: !91, line: 652, baseType: !572, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !569, file: !91, line: 653, baseType: !36, size: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !569, file: !91, line: 654, baseType: !192, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !569, file: !91, line: 655, baseType: !641, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !643, line: 54, baseType: !644)
!643 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !643, line: 47, size: 384, elements: !645)
!645 = !{!646, !655, !656, !660, !664, !668}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !644, file: !643, line: 48, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !643, line: 40, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !643, line: 36, size: 192, elements: !650)
!650 = !{!651, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !649, file: !643, line: 37, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !643, line: 38, baseType: !652, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !643, line: 39, baseType: !38, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !644, file: !643, line: 49, baseType: !647, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !644, file: !643, line: 50, baseType: !657, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!38, !38}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !644, file: !643, line: 51, baseType: !661, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !38}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !644, file: !643, line: 52, baseType: !665, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!36, !38, !38}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !644, file: !643, line: 53, baseType: !33, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !91, line: 727, baseType: !89, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !562, file: !91, line: 728, baseType: !135, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !562, file: !91, line: 729, baseType: !107, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !562, file: !91, line: 730, baseType: !135, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !562, file: !91, line: 734, baseType: !107, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !562, file: !91, line: 735, baseType: !36, size: 32, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !562, file: !91, line: 736, baseType: !676, size: 64, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !562, file: !91, line: 737, baseType: !678, size: 64, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !91, line: 1307, size: 640, elements: !680)
!680 = !{!681, !682, !687, !688, !689, !690, !696, !697, !698, !699, !700}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !91, line: 1308, baseType: !4, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !679, file: !91, line: 1309, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !91, line: 1305, baseType: !685)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !560}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !679, file: !91, line: 1310, baseType: !36, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !679, file: !91, line: 1311, baseType: !4, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !679, file: !91, line: 1312, baseType: !36, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !679, file: !91, line: 1315, baseType: !691, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !91, line: 1306, baseType: !693)
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !678, !676, !36, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !679, file: !91, line: 1317, baseType: !36, size: 32, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !679, file: !91, line: 1318, baseType: !36, size: 32, offset: 416)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !679, file: !91, line: 1319, baseType: !36, size: 32, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !679, file: !91, line: 1320, baseType: !192, size: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !679, file: !91, line: 1320, baseType: !192, size: 64, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !562, file: !91, line: 737, baseType: !678, size: 64, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !562, file: !91, line: 738, baseType: !36, size: 32, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !562, file: !91, line: 739, baseType: !36, size: 32, offset: 800)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !562, file: !91, line: 740, baseType: !268, size: 64, offset: 832)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !562, file: !91, line: 741, baseType: !641, size: 64, offset: 896)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !562, file: !91, line: 742, baseType: !707, size: 64, offset: 960)
!707 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !562, file: !91, line: 743, baseType: !107, size: 64, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !562, file: !91, line: 745, baseType: !710, size: 64, offset: 1088)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !711, line: 34, baseType: !268)
!711 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !562, file: !91, line: 746, baseType: !710, size: 64, offset: 1152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !562, file: !91, line: 747, baseType: !710, size: 64, offset: 1216)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !562, file: !91, line: 748, baseType: !36, size: 32, offset: 1280)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !562, file: !91, line: 749, baseType: !36, size: 32, offset: 1312)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !562, file: !91, line: 750, baseType: !36, size: 32, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !562, file: !91, line: 751, baseType: !36, size: 32, offset: 1376)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !562, file: !91, line: 752, baseType: !36, size: 32, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !562, file: !91, line: 753, baseType: !720, size: 64, offset: 1472)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !721, line: 173, baseType: !722)
!721 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !110, line: 100, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !110, line: 44, baseType: !268)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !562, file: !91, line: 754, baseType: !720, size: 64, offset: 1536)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !562, file: !91, line: 755, baseType: !135, size: 64, offset: 1600)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !562, file: !91, line: 756, baseType: !192, size: 64, offset: 1664)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !562, file: !91, line: 757, baseType: !192, size: 64, offset: 1728)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !562, file: !91, line: 758, baseType: !192, size: 64, offset: 1792)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !562, file: !91, line: 759, baseType: !192, size: 64, offset: 1856)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !562, file: !91, line: 760, baseType: !192, size: 64, offset: 1920)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !562, file: !91, line: 763, baseType: !732, size: 328, offset: 1984)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 328, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 41)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !562, file: !91, line: 764, baseType: !36, size: 32, offset: 2336)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !562, file: !91, line: 765, baseType: !737, size: 368, offset: 2368)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 368, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 46)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !562, file: !91, line: 766, baseType: !36, size: 32, offset: 2752)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !562, file: !91, line: 767, baseType: !742, size: 256, offset: 2816)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !91, line: 673, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !91, line: 665, size: 256, elements: !744)
!744 = !{!745, !753, !754, !755, !756}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !743, file: !91, line: 666, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !91, line: 663, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !91, line: 659, size: 192, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !748, file: !91, line: 660, baseType: !676, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !748, file: !91, line: 661, baseType: !36, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !748, file: !91, line: 662, baseType: !678, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !743, file: !91, line: 667, baseType: !36, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !743, file: !91, line: 668, baseType: !36, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !743, file: !91, line: 671, baseType: !36, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !743, file: !91, line: 672, baseType: !710, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !562, file: !91, line: 768, baseType: !36, size: 32, offset: 3072)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !562, file: !91, line: 769, baseType: !759, size: 704, offset: 3136)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !91, line: 703, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !91, line: 677, size: 704, elements: !761)
!761 = !{!762, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !760, file: !91, line: 679, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !91, line: 52, baseType: !192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !760, file: !91, line: 683, baseType: !572, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !760, file: !91, line: 685, baseType: !89, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !760, file: !91, line: 689, baseType: !107, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !760, file: !91, line: 690, baseType: !89, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !760, file: !91, line: 691, baseType: !89, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !760, file: !91, line: 692, baseType: !763, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !760, file: !91, line: 692, baseType: !763, size: 64, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !760, file: !91, line: 693, baseType: !36, size: 32, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !760, file: !91, line: 696, baseType: !36, size: 32, offset: 544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !760, file: !91, line: 697, baseType: !192, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !760, file: !91, line: 700, baseType: !38, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !562, file: !91, line: 770, baseType: !192, size: 64, offset: 3840)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !562, file: !91, line: 771, baseType: !641, size: 64, offset: 3904)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !562, file: !91, line: 772, baseType: !572, size: 64, offset: 3968)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !562, file: !91, line: 773, baseType: !641, size: 64, offset: 4032)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !562, file: !91, line: 774, baseType: !135, size: 64, offset: 4096)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !562, file: !91, line: 775, baseType: !647, size: 64, offset: 4160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !562, file: !91, line: 778, baseType: !36, size: 32, offset: 4224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !562, file: !91, line: 779, baseType: !783, size: 131072, offset: 4256)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 131072, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 16384)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DILocalVariable(name: "c", arg: 1, scope: !557, file: !1, line: 197, type: !560)
!788 = !DILocalVariable(name: "where", arg: 2, scope: !557, file: !1, line: 197, type: !36)
!789 = !DILocalVariable(name: "j", scope: !557, file: !1, line: 198, type: !36)
!790 = !DILocalVariable(name: "pushed", scope: !557, file: !1, line: 198, type: !36)
!791 = !DILocalVariable(name: "lobj", scope: !557, file: !1, line: 199, type: !89)
!792 = !DILocalVariable(name: "event", scope: !793, file: !1, line: 218, type: !4)
!793 = distinct !DILexicalBlock(scope: !794, file: !1, line: 217, column: 17)
!794 = distinct !DILexicalBlock(scope: !557, file: !1, line: 217, column: 9)
!795 = !DILocation(line: 197, column: 33, scope: !557)
!796 = !DILocation(line: 197, column: 40, scope: !557)
!797 = !DILocation(line: 198, column: 12, scope: !557)
!798 = !DILocation(line: 199, column: 36, scope: !557)
!799 = !{!800, !127, i64 16}
!800 = !{!"client", !162, i64 0, !124, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !162, i64 40, !127, i64 48, !162, i64 56, !124, i64 64, !127, i64 72, !127, i64 80, !127, i64 88, !124, i64 96, !124, i64 100, !162, i64 104, !127, i64 112, !220, i64 120, !162, i64 128, !162, i64 136, !162, i64 144, !162, i64 152, !124, i64 160, !124, i64 164, !124, i64 168, !124, i64 172, !124, i64 176, !162, i64 184, !162, i64 192, !127, i64 200, !220, i64 208, !220, i64 216, !220, i64 224, !220, i64 232, !220, i64 240, !125, i64 248, !124, i64 292, !125, i64 296, !124, i64 344, !801, i64 352, !124, i64 384, !802, i64 392, !220, i64 480, !127, i64 488, !127, i64 496, !127, i64 504, !127, i64 512, !127, i64 520, !124, i64 528, !125, i64 532}
!801 = !{!"multiState", !127, i64 0, !124, i64 8, !124, i64 12, !124, i64 16, !162, i64 24}
!802 = !{!"blockingState", !220, i64 0, !127, i64 8, !127, i64 16, !162, i64 24, !127, i64 32, !127, i64 40, !220, i64 48, !220, i64 56, !124, i64 64, !124, i64 68, !220, i64 72, !127, i64 80}
!803 = !DILocation(line: 199, column: 42, scope: !557)
!804 = !{!800, !127, i64 72}
!805 = !DILocation(line: 199, column: 39, scope: !557)
!806 = !DILocation(line: 199, column: 18, scope: !557)
!807 = !DILocation(line: 199, column: 11, scope: !557)
!808 = !DILocation(line: 201, column: 9, scope: !809)
!809 = distinct !DILexicalBlock(scope: !557, file: !1, line: 201, column: 9)
!810 = !DILocation(line: 201, column: 14, scope: !809)
!811 = !DILocation(line: 201, column: 23, scope: !809)
!812 = !DILocation(line: 201, column: 28, scope: !809)
!813 = !DILocation(line: 201, column: 9, scope: !557)
!814 = !DILocation(line: 202, column: 27, scope: !815)
!815 = distinct !DILexicalBlock(scope: !809, file: !1, line: 201, column: 41)
!816 = !{!817, !127, i64 112}
!817 = !{!"sharedObjectsStruct", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !127, i64 40, !127, i64 48, !127, i64 56, !127, i64 64, !127, i64 72, !127, i64 80, !127, i64 88, !127, i64 96, !127, i64 104, !127, i64 112, !127, i64 120, !127, i64 128, !127, i64 136, !127, i64 144, !127, i64 152, !127, i64 160, !127, i64 168, !127, i64 176, !127, i64 184, !127, i64 192, !127, i64 200, !127, i64 208, !127, i64 216, !127, i64 224, !127, i64 232, !127, i64 240, !127, i64 248, !127, i64 256, !127, i64 264, !127, i64 272, !127, i64 280, !127, i64 288, !127, i64 296, !127, i64 304, !127, i64 312, !127, i64 320, !127, i64 328, !127, i64 336, !127, i64 344, !127, i64 352, !127, i64 360, !125, i64 368, !125, i64 448, !125, i64 80448, !125, i64 80704, !127, i64 80960, !127, i64 80968}
!818 = !DILocation(line: 202, column: 9, scope: !815)
!819 = !DILocation(line: 203, column: 9, scope: !815)
!820 = !DILocation(line: 198, column: 9, scope: !557)
