; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.tcp_listen_pcbs_t = type { %struct.tcp_pcb_listen* }
%struct.tcp_pcb_listen = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8, %struct.tcp_pcb_listen*, i8*, i32, i8, i16, i8 (i8*, %struct.tcp_pcb*, i8)* }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.tcp_pcb = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8, %struct.tcp_pcb*, i8*, i32, i8, i16, i16, i16, i8, i8, i8, i32, i32, i32, i32, i32, i16, i16, i32, i32, i16, i16, i16, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, i32, %struct.tcp_seg*, %struct.tcp_seg*, %struct.tcp_seg*, %struct.pbuf*, %struct.tcp_pcb_listen*, i8 (i8*, %struct.tcp_pcb*, i16)*, i8 (i8*, %struct.tcp_pcb*, %struct.pbuf*, i8)*, i8 (i8*, %struct.tcp_pcb*, i8)*, i8 (i8*, %struct.tcp_pcb*)*, void (i8*, i8)*, i32, i8, i8, i8, i8, i8, i8 }
%struct.tcp_seg = type { %struct.tcp_seg*, %struct.pbuf*, i16, i8, %struct.tcp_hdr* }
%struct.tcp_hdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_swrand = type opaque

!47 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 53, baseType: !50, size: 32, elements: !51)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!52 = !DIEnumerator(name: "ERR_OK", value: 0)
!53 = !DIEnumerator(name: "ERR_MEM", value: -1)
!54 = !DIEnumerator(name: "ERR_BUF", value: -2)
!55 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!56 = !DIEnumerator(name: "ERR_RTE", value: -4)
!57 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!58 = !DIEnumerator(name: "ERR_VAL", value: -6)
!59 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!60 = !DIEnumerator(name: "ERR_USE", value: -8)
!61 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!62 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!63 = !DIEnumerator(name: "ERR_CONN", value: -11)
!64 = !DIEnumerator(name: "ERR_IF", value: -12)
!65 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!66 = !DIEnumerator(name: "ERR_RST", value: -14)
!67 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!68 = !DIEnumerator(name: "ERR_ARG", value: -16)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !70, line: 54, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !76, line: 156, baseType: !7, size: 32, elements: !77)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!80 = !{!81, !88, !89, !91, !95, !98, !145, !264, !167, !267, !171, !198, !269, !270, !272, !273}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !82, line: 127, baseType: !83)
!82 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !84, line: 36, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !86, line: 57, baseType: !87)
!86 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpflags_t", file: !90, line: 206, baseType: !81)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !82, line: 125, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 24, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !86, line: 43, baseType: !94)
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !82, line: 129, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 48, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !86, line: 79, baseType: !7)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb_listen", file: !90, line: 223, size: 704, elements: !100)
!100 = !{!101, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !99, file: !90, line: 225, baseType: !102, size: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !70, line: 76, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !70, line: 69, size: 192, elements: !104)
!104 = !{!105, !124}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !103, file: !70, line: 73, baseType: !106, size: 160)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !103, file: !70, line: 70, size: 160, elements: !107)
!107 = !{!108, !118}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !106, file: !70, line: 71, baseType: !109, size: 160)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !110, line: 67, baseType: !111)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !110, line: 59, size: 160, elements: !112)
!112 = !{!113, !117}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !111, file: !110, line: 60, baseType: !114, size: 128)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 4)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !111, file: !110, line: 62, baseType: !91, size: 8, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !106, file: !70, line: 72, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !120, line: 57, baseType: !121)
!120 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !120, line: 51, size: 32, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !121, file: !120, line: 52, baseType: !95, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !70, line: 75, baseType: !91, size: 8, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !99, file: !90, line: 225, baseType: !102, size: 192, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 392)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 400)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !90, line: 227, baseType: !98, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !99, file: !90, line: 227, baseType: !88, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !90, line: 227, baseType: !5, size: 32, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !99, file: !90, line: 227, baseType: !91, size: 8, offset: 608)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !99, file: !90, line: 227, baseType: !81, size: 16, offset: 624)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !99, file: !90, line: 231, baseType: !136, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_accept_fn", file: !90, line: 70, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !88, !145, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !49, line: 96, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !82, line: 126, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !84, line: 20, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !86, line: 41, baseType: !144)
!144 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb", file: !90, line: 242, size: 2240, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !231, !232, !233, !234, !235, !240, !245, !247, !252, !257, !258, !259, !260, !261, !262, !263}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !146, file: !90, line: 244, baseType: !102, size: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !146, file: !90, line: 244, baseType: !102, size: 192, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 392)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 400)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !90, line: 246, baseType: !145, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !146, file: !90, line: 246, baseType: !88, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !146, file: !90, line: 246, baseType: !5, size: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !146, file: !90, line: 246, baseType: !91, size: 8, offset: 608)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !146, file: !90, line: 246, baseType: !81, size: 16, offset: 624)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !146, file: !90, line: 249, baseType: !81, size: 16, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !90, line: 251, baseType: !89, size: 16, offset: 656)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "polltmr", scope: !146, file: !90, line: 278, baseType: !91, size: 8, offset: 672)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pollinterval", scope: !146, file: !90, line: 278, baseType: !91, size: 8, offset: 680)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "last_timer", scope: !146, file: !90, line: 279, baseType: !91, size: 8, offset: 688)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !146, file: !90, line: 280, baseType: !95, size: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !146, file: !90, line: 283, baseType: !95, size: 32, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wnd", scope: !146, file: !90, line: 284, baseType: !167, size: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpwnd_size_t", file: !6, line: 51, baseType: !95)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_wnd", scope: !146, file: !90, line: 285, baseType: !167, size: 32, offset: 800)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_right_edge", scope: !146, file: !90, line: 286, baseType: !95, size: 32, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rtime", scope: !146, file: !90, line: 295, baseType: !171, size: 16, offset: 864)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !82, line: 128, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !84, line: 32, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !86, line: 55, baseType: !174)
!174 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !146, file: !90, line: 297, baseType: !81, size: 16, offset: 880)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rttest", scope: !146, file: !90, line: 300, baseType: !95, size: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rtseq", scope: !146, file: !90, line: 301, baseType: !95, size: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !146, file: !90, line: 302, baseType: !171, size: 16, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !146, file: !90, line: 302, baseType: !171, size: 16, offset: 976)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rto", scope: !146, file: !90, line: 304, baseType: !171, size: 16, offset: 992)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nrtx", scope: !146, file: !90, line: 305, baseType: !91, size: 8, offset: 1008)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dupacks", scope: !146, file: !90, line: 308, baseType: !91, size: 8, offset: 1016)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lastack", scope: !146, file: !90, line: 309, baseType: !95, size: 32, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd", scope: !146, file: !90, line: 312, baseType: !167, size: 32, offset: 1056)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !146, file: !90, line: 313, baseType: !167, size: 32, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rto_end", scope: !146, file: !90, line: 316, baseType: !95, size: 32, offset: 1120)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !146, file: !90, line: 319, baseType: !95, size: 32, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl1", scope: !146, file: !90, line: 320, baseType: !95, size: 32, offset: 1184)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl2", scope: !146, file: !90, line: 320, baseType: !95, size: 32, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "snd_lbb", scope: !146, file: !90, line: 322, baseType: !95, size: 32, offset: 1248)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd", scope: !146, file: !90, line: 323, baseType: !167, size: 32, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd_max", scope: !146, file: !90, line: 324, baseType: !167, size: 32, offset: 1312)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "snd_buf", scope: !146, file: !90, line: 326, baseType: !167, size: 32, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "snd_queuelen", scope: !146, file: !90, line: 328, baseType: !81, size: 16, offset: 1376)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "unsent_oversize", scope: !146, file: !90, line: 332, baseType: !81, size: 16, offset: 1392)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !146, file: !90, line: 335, baseType: !167, size: 32, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "unsent", scope: !146, file: !90, line: 338, baseType: !198, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_seg", file: !200, line: 253, size: 256, elements: !201)
!200 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/tcp_priv.h", directory: "/root/.unikraft/apps/redis/build")
!201 = !{!202, !203, !216, !217, !218}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !200, line: 254, baseType: !198, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !199, file: !200, line: 255, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !206, line: 186, size: 192, elements: !207)
!206 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !206, line: 188, baseType: !204, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !205, file: !206, line: 191, baseType: !88, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !205, file: !206, line: 200, baseType: !81, size: 16, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !205, file: !206, line: 203, baseType: !81, size: 16, offset: 144)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !205, file: !206, line: 208, baseType: !91, size: 8, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !206, line: 211, baseType: !91, size: 8, offset: 168)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !205, file: !206, line: 218, baseType: !91, size: 8, offset: 176)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !205, file: !206, line: 221, baseType: !91, size: 8, offset: 184)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !199, file: !200, line: 256, baseType: !81, size: 16, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !199, file: !200, line: 266, baseType: !91, size: 8, offset: 144)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tcphdr", scope: !199, file: !200, line: 273, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_hdr", file: !221, line: 56, size: 160, elements: !222)
!221 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !220, file: !221, line: 57, baseType: !81, size: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !220, file: !221, line: 58, baseType: !81, size: 16, offset: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !220, file: !221, line: 59, baseType: !95, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ackno", scope: !220, file: !221, line: 60, baseType: !95, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_hdrlen_rsvd_flags", scope: !220, file: !221, line: 61, baseType: !81, size: 16, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "wnd", scope: !220, file: !221, line: 62, baseType: !81, size: 16, offset: 112)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !220, file: !221, line: 63, baseType: !81, size: 16, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "urgp", scope: !220, file: !221, line: 64, baseType: !81, size: 16, offset: 144)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "unacked", scope: !146, file: !90, line: 339, baseType: !198, size: 64, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ooseq", scope: !146, file: !90, line: 341, baseType: !198, size: 64, offset: 1600)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "refused_data", scope: !146, file: !90, line: 344, baseType: !204, size: 64, offset: 1664)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !146, file: !90, line: 347, baseType: !98, size: 64, offset: 1728)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !146, file: !90, line: 352, baseType: !236, size: 64, offset: 1792)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_sent_fn", file: !90, line: 96, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!140, !88, !145, !81}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !146, file: !90, line: 354, baseType: !241, size: 64, offset: 1856)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_recv_fn", file: !90, line: 82, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!140, !88, !145, !204, !140}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !146, file: !90, line: 356, baseType: !246, size: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connected_fn", file: !90, line: 134, baseType: !137)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !146, file: !90, line: 358, baseType: !248, size: 64, offset: 1984)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_poll_fn", file: !90, line: 108, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!140, !88, !145}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "errf", scope: !146, file: !90, line: 360, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_err_fn", file: !90, line: 120, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !88, !140}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "keep_idle", scope: !146, file: !90, line: 369, baseType: !95, size: 32, offset: 2112)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "persist_cnt", scope: !146, file: !90, line: 376, baseType: !91, size: 8, offset: 2144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "persist_backoff", scope: !146, file: !90, line: 378, baseType: !91, size: 8, offset: 2152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "persist_probe", scope: !146, file: !90, line: 380, baseType: !91, size: 8, offset: 2160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "keep_cnt_sent", scope: !146, file: !90, line: 383, baseType: !91, size: 8, offset: 2168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "snd_scale", scope: !146, file: !90, line: 386, baseType: !91, size: 8, offset: 2176)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_scale", scope: !146, file: !90, line: 387, baseType: !91, size: 8, offset: 2184)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32_t", file: !82, line: 130, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !84, line: 44, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !86, line: 77, baseType: !50)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!272 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!274 = !{!275, !280, !287, !289, !0, !291, !293, !295, !297, !299, !301, !303, !330, !335, !340, !345}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "tcp_pcb_lists", scope: !2, file: !3, line: 181, type: !277, isLocal: false, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !115)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "iss", scope: !282, file: !3, line: 2221, type: !95, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "tcp_next_iss", scope: !3, file: !3, line: 2215, type: !283, isLocal: false, isDefinition: true, scopeLine: 2216, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{!95, !145}
!285 = !{!286}
!286 = !DILocalVariable(name: "pcb", arg: 1, scope: !282, file: !3, line: 2215, type: !145)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "tcp_ticks", scope: !2, file: !3, line: 162, type: !95, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "tcp_bound_pcbs", scope: !2, file: !3, line: 171, type: !145, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "tcp_active_pcbs", scope: !2, file: !3, line: 176, type: !145, isLocal: false, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "tcp_tw_pcbs", scope: !2, file: !3, line: 178, type: !145, isLocal: false, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "tcp_active_pcbs_changed", scope: !2, file: !3, line: 185, type: !91, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "tcp_timer", scope: !2, file: !3, line: 188, type: !91, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "tcp_timer_ctr", scope: !2, file: !3, line: 189, type: !91, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "tcp_port", scope: !2, file: !3, line: 159, type: !81, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "__str", scope: !305, file: !306, line: 198, type: !327, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "uk_pr_crit", scope: !306, file: !306, line: 194, type: !307, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !312)
!306 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309, null}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!312 = !{!313, !314}
!313 = !DILocalVariable(name: "fmt", arg: 1, scope: !305, file: !306, line: 194, type: !309)
!314 = !DILocalVariable(name: "argp", scope: !305, file: !306, line: 196, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !316, line: 32, baseType: !317)
!316 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !318)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 192, elements: !325)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !320)
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !319, file: !3, line: 196, baseType: !7, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !319, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !319, file: !3, line: 196, baseType: !88, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !319, file: !3, line: 196, baseType: !88, size: 64, offset: 128)
!325 = !{!326}
!326 = !DISubrange(count: 1)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 64, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 8)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "__str", scope: !305, file: !306, line: 198, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 48, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 6)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "tcp_persist_backoff", scope: !2, file: !3, line: 166, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 56, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 7)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "tcp_backoff", scope: !2, file: !3, line: 163, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 104, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 13)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "tcp_state_str", scope: !2, file: !3, line: 144, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 704, elements: !349)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!349 = !{!350}
!350 = !DISubrange(count: 11)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tcp_listen_pcbs_t", file: !200, line: 331, size: 64, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "listen_pcbs", scope: !351, file: !200, line: 332, baseType: !98, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pcbs", scope: !351, file: !200, line: 333, baseType: !145, size: 64)
!355 = !{i32 2, !"Dwarf Version", i32 4}
!356 = !{i32 2, !"Debug Info Version", i32 3}
!357 = !{i32 1, !"wchar_size", i32 4}
!358 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!359 = distinct !DISubprogram(name: "tcp_init", scope: !3, file: !3, line: 201, type: !360, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{null}
!362 = !{}
!363 = !DILocation(line: 65, column: 2, scope: !364, inlinedAt: !381)
!364 = distinct !DISubprogram(name: "isolated_rand", scope: !365, file: !365, line: 63, type: !366, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !370)
!365 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/cc.h", directory: "/root/.unikraft/apps/redis/build")
!366 = !DISubroutineType(types: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !369, line: 88, baseType: !7)
!369 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!370 = !{!371, !372, !378}
!371 = !DILocalVariable(name: "randn", scope: !364, file: !365, line: 65, type: !368)
!372 = !DILocalVariable(name: "tid", scope: !373, file: !365, line: 66, type: !96)
!373 = distinct !DILexicalBlock(scope: !374, file: !365, line: 66, column: 2)
!374 = distinct !DILexicalBlock(scope: !375, file: !365, line: 66, column: 2)
!375 = distinct !DILexicalBlock(scope: !376, file: !365, line: 66, column: 2)
!376 = distinct !DILexicalBlock(scope: !377, file: !365, line: 66, column: 2)
!377 = distinct !DILexicalBlock(scope: !364, file: !365, line: 66, column: 2)
!378 = !DILocalVariable(name: "_ret", scope: !373, file: !365, line: 66, type: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !84, line: 60, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !86, line: 105, baseType: !272)
!381 = distinct !DILocation(line: 204, column: 14, scope: !359)
!382 = !DILocation(line: 120, column: 2, scope: !383, inlinedAt: !389)
!383 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !384, file: !384, line: 116, type: !385, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !387)
!384 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!385 = !DISubroutineType(types: !386)
!386 = !{!272}
!387 = !{!388}
!388 = !DILocalVariable(name: "sp", scope: !383, file: !384, line: 118, type: !272)
!389 = distinct !DILocation(line: 66, column: 2, scope: !376, inlinedAt: !381)
!390 = !{i32 601524}
!391 = !DILocation(line: 118, column: 16, scope: !383, inlinedAt: !389)
!392 = !DILocation(line: 121, column: 2, scope: !383, inlinedAt: !389)
!393 = !DILocation(line: 66, column: 2, scope: !376, inlinedAt: !381)
!394 = !DILocation(line: 120, column: 2, scope: !383, inlinedAt: !395)
!395 = distinct !DILocation(line: 66, column: 2, scope: !376, inlinedAt: !381)
!396 = !DILocation(line: 118, column: 16, scope: !383, inlinedAt: !395)
!397 = !DILocation(line: 121, column: 2, scope: !383, inlinedAt: !395)
!398 = !DILocation(line: 66, column: 2, scope: !377, inlinedAt: !381)
!399 = !DILocation(line: 65, column: 11, scope: !400, inlinedAt: !405)
!400 = distinct !DISubprogram(name: "uk_swrand_randr", scope: !401, file: !401, line: 60, type: !366, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !402)
!401 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukswrand/include/uk/swrand.h", directory: "/root/.unikraft/apps/redis/build")
!402 = !{!403, !404}
!403 = !DILocalVariable(name: "iflags", scope: !400, file: !401, line: 62, type: !272)
!404 = !DILocalVariable(name: "ret", scope: !400, file: !401, line: 63, type: !368)
!405 = distinct !DILocation(line: 66, column: 2, scope: !406, inlinedAt: !381)
!406 = distinct !DILexicalBlock(scope: !376, file: !365, line: 66, column: 2)
!407 = !DILocation(line: 62, column: 16, scope: !400, inlinedAt: !405)
!408 = !DILocation(line: 66, column: 8, scope: !400, inlinedAt: !405)
!409 = !DILocation(line: 63, column: 8, scope: !400, inlinedAt: !405)
!410 = !DILocation(line: 67, column: 2, scope: !400, inlinedAt: !405)
!411 = !DILocation(line: 69, column: 2, scope: !400, inlinedAt: !405)
!412 = !DILocation(line: 65, column: 8, scope: !364, inlinedAt: !381)
!413 = !DILocation(line: 66, column: 2, scope: !406, inlinedAt: !381)
!414 = !{!415, !415, i64 0}
!415 = !{!"int", !416, i64 0}
!416 = !{!"omnipotent char", !417, i64 0}
!417 = !{!"Simple C/C++ TBAA"}
!418 = !DILocation(line: 120, column: 2, scope: !383, inlinedAt: !419)
!419 = distinct !DILocation(line: 49, column: 21, scope: !420, inlinedAt: !426)
!420 = distinct !DISubprogram(name: "uk_thread_get_tid", scope: !421, file: !421, line: 47, type: !422, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !424)
!421 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku-impl.h", directory: "/root/.unikraft/apps/redis/build")
!422 = !DISubroutineType(types: !423)
!423 = !{!50}
!424 = !{!425}
!425 = !DILocalVariable(name: "sp", scope: !420, file: !421, line: 49, type: !272)
!426 = distinct !DILocation(line: 66, column: 2, scope: !373, inlinedAt: !381)
!427 = !DILocation(line: 118, column: 16, scope: !383, inlinedAt: !419)
!428 = !DILocation(line: 121, column: 2, scope: !383, inlinedAt: !419)
!429 = !DILocation(line: 49, column: 16, scope: !420, inlinedAt: !426)
!430 = !DILocation(line: 50, column: 19, scope: !420, inlinedAt: !426)
!431 = !DILocation(line: 50, column: 11, scope: !420, inlinedAt: !426)
!432 = !DILocation(line: 50, column: 9, scope: !420, inlinedAt: !426)
!433 = !DILocation(line: 50, column: 2, scope: !420, inlinedAt: !426)
!434 = !DILocation(line: 66, column: 2, scope: !373, inlinedAt: !381)
!435 = !{i32 -2146754758, i32 -2146754745, i32 -2146754720, i32 -2146754696, i32 -2146754671, i32 -2146754596, i32 -2146754571, i32 -2146754427, i32 -2146751334, i32 -2146751245, i32 -2146751124, i32 -2146751029, i32 -2146750928, i32 -2146750901, i32 -2146750818, i32 -2146750729, i32 -2146750608, i32 -2146750508, i32 -2146750402, i32 -2146750294, i32 -2146754144, i32 -2146754091, i32 -2146754060, i32 -2146754029, i32 -2146754008, i32 -2146753986, i32 -2146753937, i32 -2146753916, i32 -2146750211, i32 -2146750122, i32 -2146750001, i32 -2146749902, i32 -2146749796, i32 -2146749694, i32 -2146749661, i32 -2146749588, i32 -2146749520, i32 -2146753614, i32 -2146753555, i32 -2146753502, i32 -2146753471, i32 -2146753440, i32 -2146753419, i32 -2146753397, i32 -2146753348, i32 -2146753327, i32 -2146749469, i32 -2146749380, i32 -2146749259, i32 -2146749160, i32 -2146749054, i32 -2146748952, i32 -2146748919, i32 -2146748836, i32 -2146748747, i32 -2146748626, i32 -2146748526, i32 -2146748500, i32 -2146748397, i32 -2146748371, i32 -2146753069, i32 -2146753002, i32 -2146752977, i32 -2146752913, i32 -2146752831, i32 -2146752808, i32 -2146752783, i32 -2146752758}
!436 = !DILocation(line: 66, column: 2, scope: !437, inlinedAt: !381)
!437 = distinct !DILexicalBlock(scope: !438, file: !365, line: 66, column: 2)
!438 = distinct !DILexicalBlock(scope: !373, file: !365, line: 66, column: 2)
!439 = !{i32 -2146751811, i32 -2146751794}
!440 = !DILocation(line: 67, column: 9, scope: !364, inlinedAt: !381)
!441 = !DILocation(line: 68, column: 1, scope: !364, inlinedAt: !381)
!442 = !DILocation(line: 67, column: 2, scope: !364, inlinedAt: !381)
!443 = !DILocation(line: 204, column: 14, scope: !359)
!444 = !DILocation(line: 204, column: 12, scope: !359)
!445 = !{!446, !446, i64 0}
!446 = !{!"short", !416, i64 0}
!447 = !DILocation(line: 206, column: 1, scope: !359)
!448 = distinct !DISubprogram(name: "tcp_free", scope: !3, file: !3, line: 210, type: !449, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !145}
!451 = !{!452}
!452 = !DILocalVariable(name: "pcb", arg: 1, scope: !448, file: !3, line: 210, type: !145)
!453 = !DILocation(line: 210, column: 26, scope: !448)
!454 = !DILocation(line: 212, column: 3, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 212, column: 3)
!456 = distinct !DILexicalBlock(scope: !448, file: !3, line: 212, column: 3)
!457 = !{!458, !416, i64 72}
!458 = !{!"tcp_pcb", !459, i64 0, !459, i64 24, !416, i64 48, !416, i64 49, !416, i64 50, !416, i64 51, !460, i64 56, !460, i64 64, !416, i64 72, !416, i64 76, !446, i64 78, !446, i64 80, !446, i64 82, !416, i64 84, !416, i64 85, !416, i64 86, !415, i64 88, !415, i64 92, !415, i64 96, !415, i64 100, !415, i64 104, !446, i64 108, !446, i64 110, !415, i64 112, !415, i64 116, !446, i64 120, !446, i64 122, !446, i64 124, !416, i64 126, !416, i64 127, !415, i64 128, !415, i64 132, !415, i64 136, !415, i64 140, !415, i64 144, !415, i64 148, !415, i64 152, !415, i64 156, !415, i64 160, !415, i64 164, !415, i64 168, !446, i64 172, !446, i64 174, !415, i64 176, !460, i64 184, !460, i64 192, !460, i64 200, !460, i64 208, !460, i64 216, !460, i64 224, !460, i64 232, !460, i64 240, !460, i64 248, !460, i64 256, !415, i64 264, !416, i64 268, !416, i64 269, !416, i64 270, !416, i64 271, !416, i64 272, !416, i64 273}
!459 = !{!"ip_addr", !416, i64 0, !416, i64 20}
!460 = !{!"any pointer", !416, i64 0}
!461 = !DILocation(line: 212, column: 3, scope: !456)
!462 = !DILocation(line: 212, column: 3, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !3, line: 212, column: 3)
!464 = distinct !DILexicalBlock(scope: !455, file: !3, line: 212, column: 3)
!465 = !DILocation(line: 212, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !3, line: 212, column: 3)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 212, column: 3)
!468 = distinct !DILexicalBlock(scope: !463, file: !3, line: 212, column: 3)
!469 = !DILocation(line: 216, column: 27, scope: !448)
!470 = !DILocation(line: 216, column: 3, scope: !448)
!471 = !DILocation(line: 217, column: 1, scope: !448)
!472 = !DILocation(line: 194, column: 43, scope: !305)
!473 = !DILocation(line: 196, column: 2, scope: !305)
!474 = !DILocation(line: 196, column: 10, scope: !305)
!475 = !DILocation(line: 197, column: 2, scope: !305)
!476 = !DILocation(line: 198, column: 2, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !306, line: 198, column: 2)
!478 = distinct !DILexicalBlock(scope: !305, file: !306, line: 198, column: 2)
!479 = !DILocation(line: 199, column: 2, scope: !305)
!480 = !DILocation(line: 200, column: 1, scope: !305)
!481 = distinct !DISubprogram(name: "tcp_tmr", scope: !3, file: !3, line: 234, type: !360, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !362)
!482 = !DILocation(line: 237, column: 3, scope: !481)
!483 = !DILocation(line: 239, column: 7, scope: !484)
!484 = distinct !DILexicalBlock(scope: !481, file: !3, line: 239, column: 7)
!485 = !{!416, !416, i64 0}
!486 = !DILocation(line: 239, column: 19, scope: !484)
!487 = !DILocation(line: 239, column: 7, scope: !481)
!488 = !DILocation(line: 242, column: 5, scope: !489)
!489 = distinct !DILexicalBlock(scope: !484, file: !3, line: 239, column: 24)
!490 = !DILocation(line: 243, column: 3, scope: !489)
!491 = !DILocation(line: 244, column: 1, scope: !481)
!492 = distinct !DISubprogram(name: "tcp_fasttmr", scope: !3, file: !3, line: 1479, type: !360, isLocal: false, isDefinition: true, scopeLine: 1480, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !493)
!493 = !{!494, !495}
!494 = !DILocalVariable(name: "pcb", scope: !492, file: !3, line: 1481, type: !145)
!495 = !DILocalVariable(name: "next", scope: !496, file: !3, line: 1490, type: !145)
!496 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1489, column: 43)
!497 = distinct !DILexicalBlock(scope: !498, file: !3, line: 1489, column: 9)
!498 = distinct !DILexicalBlock(scope: !492, file: !3, line: 1488, column: 23)
!499 = !DILocation(line: 1483, column: 3, scope: !492)
!500 = !DILocation(line: 1486, column: 9, scope: !492)
!501 = !{!460, !460, i64 0}
!502 = !DILocation(line: 1481, column: 19, scope: !492)
!503 = !DILocation(line: 1488, column: 3, scope: !492)
!504 = !DILocation(line: 1488, column: 14, scope: !492)
!505 = !DILocation(line: 1489, column: 14, scope: !497)
!506 = !{!458, !416, i64 86}
!507 = !DILocation(line: 1489, column: 28, scope: !497)
!508 = !DILocation(line: 1489, column: 25, scope: !497)
!509 = !DILocation(line: 1489, column: 9, scope: !498)
!510 = !DILocation(line: 1491, column: 23, scope: !496)
!511 = !DILocation(line: 1493, column: 16, scope: !512)
!512 = distinct !DILexicalBlock(scope: !496, file: !3, line: 1493, column: 11)
!513 = !{!458, !446, i64 82}
!514 = !DILocation(line: 1493, column: 22, scope: !512)
!515 = !DILocation(line: 1493, column: 11, scope: !496)
!516 = !DILocation(line: 1495, column: 9, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1495, column: 9)
!518 = distinct !DILexicalBlock(scope: !512, file: !3, line: 1493, column: 38)
!519 = !DILocation(line: 1496, column: 9, scope: !518)
!520 = !DILocation(line: 1497, column: 9, scope: !521)
!521 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1497, column: 9)
!522 = !DILocation(line: 1498, column: 7, scope: !518)
!523 = !DILocation(line: 1500, column: 16, scope: !524)
!524 = distinct !DILexicalBlock(scope: !496, file: !3, line: 1500, column: 11)
!525 = !DILocation(line: 1500, column: 22, scope: !524)
!526 = !DILocation(line: 1500, column: 11, scope: !496)
!527 = !DILocation(line: 1502, column: 9, scope: !528)
!528 = distinct !DILexicalBlock(scope: !529, file: !3, line: 1502, column: 9)
!529 = distinct !DILexicalBlock(scope: !524, file: !3, line: 1500, column: 38)
!530 = !DILocation(line: 1503, column: 9, scope: !529)
!531 = !DILocation(line: 1504, column: 7, scope: !529)
!532 = !DILocation(line: 1506, column: 19, scope: !496)
!533 = !{!458, !460, i64 56}
!534 = !DILocation(line: 1490, column: 23, scope: !496)
!535 = !DILocation(line: 1509, column: 16, scope: !536)
!536 = distinct !DILexicalBlock(scope: !496, file: !3, line: 1509, column: 11)
!537 = !{!458, !460, i64 208}
!538 = !DILocation(line: 1509, column: 29, scope: !536)
!539 = !DILocation(line: 1509, column: 11, scope: !496)
!540 = !DILocation(line: 1510, column: 33, scope: !541)
!541 = distinct !DILexicalBlock(scope: !536, file: !3, line: 1509, column: 38)
!542 = !DILocation(line: 1511, column: 9, scope: !541)
!543 = !DILocation(line: 1512, column: 13, scope: !544)
!544 = distinct !DILexicalBlock(scope: !541, file: !3, line: 1512, column: 13)
!545 = !DILocation(line: 1512, column: 13, scope: !541)
!546 = !DILocation(line: 1518, column: 5, scope: !497)
!547 = !DILocation(line: 1514, column: 11, scope: !548)
!548 = distinct !DILexicalBlock(scope: !544, file: !3, line: 1512, column: 38)
!549 = !DILocation(line: 1519, column: 18, scope: !550)
!550 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1518, column: 12)
!551 = !DILocation(line: 0, scope: !550)
!552 = distinct !{!552, !503, !553}
!553 = !DILocation(line: 1521, column: 3, scope: !492)
!554 = !DILocation(line: 1522, column: 1, scope: !492)
!555 = distinct !DISubprogram(name: "tcp_slowtmr", scope: !3, file: !3, line: 1192, type: !360, isLocal: false, isDefinition: true, scopeLine: 1193, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !572, !575, !583, !584, !587, !588, !589, !590}
!557 = !DILocalVariable(name: "pcb", scope: !555, file: !3, line: 1194, type: !145)
!558 = !DILocalVariable(name: "prev", scope: !555, file: !3, line: 1194, type: !145)
!559 = !DILocalVariable(name: "eff_wnd", scope: !555, file: !3, line: 1195, type: !167)
!560 = !DILocalVariable(name: "pcb_remove", scope: !555, file: !3, line: 1196, type: !91)
!561 = !DILocalVariable(name: "pcb_reset", scope: !555, file: !3, line: 1197, type: !91)
!562 = !DILocalVariable(name: "err", scope: !555, file: !3, line: 1198, type: !140)
!563 = !DILocalVariable(name: "backoff_cnt", scope: !564, file: !3, line: 1241, type: !91)
!564 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1240, column: 16)
!565 = distinct !DILexicalBlock(scope: !566, file: !3, line: 1238, column: 13)
!566 = distinct !DILexicalBlock(scope: !567, file: !3, line: 1235, column: 37)
!567 = distinct !DILexicalBlock(scope: !568, file: !3, line: 1235, column: 11)
!568 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1234, column: 12)
!569 = distinct !DILexicalBlock(scope: !570, file: !3, line: 1231, column: 16)
!570 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1228, column: 9)
!571 = distinct !DILexicalBlock(scope: !555, file: !3, line: 1212, column: 23)
!572 = !DILocalVariable(name: "next_slot", scope: !573, file: !3, line: 1246, type: !50)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 1245, column: 48)
!574 = distinct !DILexicalBlock(scope: !564, file: !3, line: 1245, column: 15)
!575 = !DILocalVariable(name: "backoff_idx", scope: !576, file: !3, line: 1287, type: !91)
!576 = distinct !DILexicalBlock(scope: !577, file: !3, line: 1286, column: 41)
!577 = distinct !DILexicalBlock(scope: !578, file: !3, line: 1286, column: 17)
!578 = distinct !DILexicalBlock(scope: !579, file: !3, line: 1283, column: 109)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 1283, column: 15)
!580 = distinct !DILexicalBlock(scope: !581, file: !3, line: 1275, column: 37)
!581 = distinct !DILexicalBlock(scope: !582, file: !3, line: 1275, column: 13)
!582 = distinct !DILexicalBlock(scope: !567, file: !3, line: 1269, column: 14)
!583 = !DILocalVariable(name: "calc_rto", scope: !576, file: !3, line: 1288, type: !50)
!584 = !DILocalVariable(name: "pcb2", scope: !585, file: !3, line: 1380, type: !145)
!585 = distinct !DILexicalBlock(scope: !586, file: !3, line: 1379, column: 21)
!586 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1379, column: 9)
!587 = !DILocalVariable(name: "err_fn", scope: !585, file: !3, line: 1382, type: !253)
!588 = !DILocalVariable(name: "err_arg", scope: !585, file: !3, line: 1384, type: !88)
!589 = !DILocalVariable(name: "last_state", scope: !585, file: !3, line: 1385, type: !5)
!590 = !DILocalVariable(name: "pcb2", scope: !591, file: !3, line: 1451, type: !145)
!591 = distinct !DILexicalBlock(scope: !592, file: !3, line: 1450, column: 21)
!592 = distinct !DILexicalBlock(scope: !593, file: !3, line: 1450, column: 9)
!593 = distinct !DILexicalBlock(scope: !555, file: !3, line: 1440, column: 23)
!594 = !DILocation(line: 1198, column: 9, scope: !555)
!595 = !DILocation(line: 1202, column: 3, scope: !555)
!596 = !DILocation(line: 1203, column: 3, scope: !555)
!597 = !DILocation(line: 1194, column: 25, scope: !555)
!598 = !DILocation(line: 1208, column: 9, scope: !555)
!599 = !DILocation(line: 1194, column: 19, scope: !555)
!600 = !DILocation(line: 1212, column: 3, scope: !555)
!601 = !DILocation(line: 1212, column: 14, scope: !555)
!602 = !DILocation(line: 1214, column: 5, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !3, line: 1214, column: 5)
!604 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1214, column: 5)
!605 = !DILocation(line: 1214, column: 5, scope: !604)
!606 = !DILocation(line: 1214, column: 5, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !3, line: 1214, column: 5)
!608 = distinct !DILexicalBlock(scope: !603, file: !3, line: 1214, column: 5)
!609 = !DILocation(line: 1214, column: 5, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !3, line: 1214, column: 5)
!611 = distinct !DILexicalBlock(scope: !612, file: !3, line: 1214, column: 5)
!612 = distinct !DILexicalBlock(scope: !607, file: !3, line: 1214, column: 5)
!613 = !DILocation(line: 1215, column: 5, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !3, line: 1215, column: 5)
!615 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1215, column: 5)
!616 = !DILocation(line: 1215, column: 5, scope: !615)
!617 = !DILocation(line: 1215, column: 5, scope: !618)
!618 = distinct !DILexicalBlock(scope: !619, file: !3, line: 1215, column: 5)
!619 = distinct !DILexicalBlock(scope: !614, file: !3, line: 1215, column: 5)
!620 = !DILocation(line: 1215, column: 5, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 1215, column: 5)
!622 = distinct !DILexicalBlock(scope: !623, file: !3, line: 1215, column: 5)
!623 = distinct !DILexicalBlock(scope: !618, file: !3, line: 1215, column: 5)
!624 = !DILocation(line: 1216, column: 5, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !3, line: 1216, column: 5)
!626 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1216, column: 5)
!627 = !DILocation(line: 1216, column: 5, scope: !626)
!628 = !DILocation(line: 1216, column: 5, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !3, line: 1216, column: 5)
!630 = distinct !DILexicalBlock(scope: !625, file: !3, line: 1216, column: 5)
!631 = !DILocation(line: 1216, column: 5, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !3, line: 1216, column: 5)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 1216, column: 5)
!634 = distinct !DILexicalBlock(scope: !629, file: !3, line: 1216, column: 5)
!635 = !DILocation(line: 1217, column: 14, scope: !636)
!636 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1217, column: 9)
!637 = !DILocation(line: 1217, column: 28, scope: !636)
!638 = !DILocation(line: 1217, column: 25, scope: !636)
!639 = !DILocation(line: 1217, column: 9, scope: !571)
!640 = !DILocation(line: 1220, column: 18, scope: !641)
!641 = distinct !DILexicalBlock(scope: !636, file: !3, line: 1217, column: 43)
!642 = !DILocation(line: 1221, column: 7, scope: !641)
!643 = !DILocation(line: 0, scope: !555)
!644 = distinct !{!644, !600, !645}
!645 = !DILocation(line: 1434, column: 3, scope: !555)
!646 = !DILocation(line: 1223, column: 21, scope: !571)
!647 = !DILocation(line: 1196, column: 8, scope: !555)
!648 = !DILocation(line: 1197, column: 8, scope: !555)
!649 = !DILocation(line: 1228, column: 20, scope: !570)
!650 = !DILocation(line: 1228, column: 32, scope: !570)
!651 = !DILocation(line: 0, scope: !569)
!652 = !{!458, !416, i64 126}
!653 = !DILocation(line: 1228, column: 45, scope: !570)
!654 = !DILocation(line: 1228, column: 9, scope: !571)
!655 = !DILocation(line: 0, scope: !570)
!656 = !DILocation(line: 1231, column: 26, scope: !569)
!657 = !DILocation(line: 1231, column: 16, scope: !570)
!658 = !DILocation(line: 1234, column: 5, scope: !659)
!659 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1231, column: 41)
!660 = !DILocation(line: 1235, column: 16, scope: !567)
!661 = !{!458, !416, i64 269}
!662 = !DILocation(line: 1235, column: 11, scope: !567)
!663 = !DILocation(line: 1235, column: 32, scope: !567)
!664 = !DILocation(line: 1235, column: 11, scope: !568)
!665 = !DILocation(line: 1236, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !667, file: !3, line: 1236, column: 9)
!667 = distinct !DILexicalBlock(scope: !566, file: !3, line: 1236, column: 9)
!668 = !{!458, !460, i64 192}
!669 = !DILocation(line: 1236, column: 9, scope: !667)
!670 = !DILocation(line: 1236, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 1236, column: 9)
!672 = distinct !DILexicalBlock(scope: !666, file: !3, line: 1236, column: 9)
!673 = !DILocation(line: 1236, column: 9, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !3, line: 1236, column: 9)
!675 = distinct !DILexicalBlock(scope: !676, file: !3, line: 1236, column: 9)
!676 = distinct !DILexicalBlock(scope: !671, file: !3, line: 1236, column: 9)
!677 = !DILocation(line: 1237, column: 9, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !3, line: 1237, column: 9)
!679 = distinct !DILexicalBlock(scope: !566, file: !3, line: 1237, column: 9)
!680 = !{!458, !460, i64 184}
!681 = !DILocation(line: 1237, column: 9, scope: !679)
!682 = !DILocation(line: 1237, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !3, line: 1237, column: 9)
!684 = distinct !DILexicalBlock(scope: !678, file: !3, line: 1237, column: 9)
!685 = !DILocation(line: 1237, column: 9, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 1237, column: 9)
!687 = distinct !DILexicalBlock(scope: !688, file: !3, line: 1237, column: 9)
!688 = distinct !DILexicalBlock(scope: !683, file: !3, line: 1237, column: 9)
!689 = !DILocation(line: 1238, column: 18, scope: !565)
!690 = !{!458, !416, i64 270}
!691 = !DILocation(line: 1238, column: 32, scope: !565)
!692 = !DILocation(line: 1238, column: 13, scope: !566)
!693 = !DILocation(line: 1240, column: 9, scope: !694)
!694 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1238, column: 47)
!695 = !DILocation(line: 1241, column: 71, scope: !564)
!696 = !DILocation(line: 1241, column: 30, scope: !564)
!697 = !DILocation(line: 1241, column: 16, scope: !564)
!698 = !DILocation(line: 1242, column: 20, scope: !699)
!699 = distinct !DILexicalBlock(scope: !564, file: !3, line: 1242, column: 15)
!700 = !{!458, !416, i64 268}
!701 = !DILocation(line: 1242, column: 32, scope: !699)
!702 = !DILocation(line: 1242, column: 15, scope: !564)
!703 = !DILocation(line: 1243, column: 29, scope: !704)
!704 = distinct !DILexicalBlock(scope: !699, file: !3, line: 1242, column: 47)
!705 = !DILocation(line: 1244, column: 11, scope: !704)
!706 = !DILocation(line: 1245, column: 20, scope: !574)
!707 = !DILocation(line: 1245, column: 32, scope: !574)
!708 = !DILocation(line: 1245, column: 15, scope: !564)
!709 = !DILocation(line: 1246, column: 17, scope: !573)
!710 = !DILocation(line: 1248, column: 22, scope: !711)
!711 = distinct !DILexicalBlock(scope: !573, file: !3, line: 1248, column: 17)
!712 = !{!458, !415, i64 160}
!713 = !DILocation(line: 1248, column: 30, scope: !711)
!714 = !DILocation(line: 1248, column: 17, scope: !573)
!715 = !DILocation(line: 1249, column: 19, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !3, line: 1249, column: 19)
!717 = distinct !DILexicalBlock(scope: !711, file: !3, line: 1248, column: 36)
!718 = !DILocation(line: 1249, column: 46, scope: !716)
!719 = !DILocation(line: 1249, column: 19, scope: !717)
!720 = !DILocation(line: 0, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !3, line: 1249, column: 57)
!722 = !DILocation(line: 1254, column: 45, scope: !723)
!723 = distinct !DILexicalBlock(scope: !724, file: !3, line: 1254, column: 19)
!724 = distinct !DILexicalBlock(scope: !711, file: !3, line: 1253, column: 20)
!725 = !DILocation(line: 1254, column: 19, scope: !723)
!726 = !DILocation(line: 1254, column: 66, scope: !723)
!727 = !DILocation(line: 1254, column: 19, scope: !724)
!728 = !DILocation(line: 1255, column: 21, scope: !729)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 1255, column: 21)
!730 = distinct !DILexicalBlock(scope: !723, file: !3, line: 1254, column: 77)
!731 = !DILocation(line: 1255, column: 37, scope: !729)
!732 = !DILocation(line: 1255, column: 21, scope: !730)
!733 = !DILocation(line: 1258, column: 17, scope: !734)
!734 = distinct !DILexicalBlock(scope: !729, file: !3, line: 1255, column: 48)
!735 = !DILocation(line: 1261, column: 17, scope: !573)
!736 = !DILocation(line: 1262, column: 32, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1261, column: 28)
!738 = distinct !DILexicalBlock(scope: !573, file: !3, line: 1261, column: 17)
!739 = !DILocation(line: 1263, column: 24, scope: !740)
!740 = distinct !DILexicalBlock(scope: !737, file: !3, line: 1263, column: 19)
!741 = !DILocation(line: 1263, column: 40, scope: !740)
!742 = !DILocation(line: 1263, column: 19, scope: !737)
!743 = !DILocation(line: 1264, column: 37, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !3, line: 1263, column: 71)
!745 = !DILocation(line: 1265, column: 15, scope: !744)
!746 = !DILocation(line: 0, scope: !744)
!747 = !DILocation(line: 1267, column: 11, scope: !573)
!748 = !DILocation(line: 1271, column: 19, scope: !749)
!749 = distinct !DILexicalBlock(scope: !582, file: !3, line: 1271, column: 13)
!750 = !{!458, !446, i64 108}
!751 = !DILocation(line: 1271, column: 25, scope: !749)
!752 = !DILocation(line: 1271, column: 31, scope: !749)
!753 = !DILocation(line: 1271, column: 46, scope: !749)
!754 = !DILocation(line: 1271, column: 13, scope: !582)
!755 = !DILocation(line: 1275, column: 32, scope: !581)
!756 = !DILocation(line: 1275, column: 13, scope: !582)
!757 = !DILocation(line: 1272, column: 11, scope: !758)
!758 = distinct !DILexicalBlock(scope: !749, file: !3, line: 1271, column: 57)
!759 = !DILocation(line: 1273, column: 9, scope: !758)
!760 = !DILocation(line: 1275, column: 18, scope: !581)
!761 = !{!458, !446, i64 124}
!762 = !DILocation(line: 1275, column: 24, scope: !581)
!763 = !DILocation(line: 1283, column: 16, scope: !579)
!764 = !DILocation(line: 1283, column: 44, scope: !579)
!765 = !DILocation(line: 1283, column: 55, scope: !579)
!766 = !DILocation(line: 1283, column: 65, scope: !579)
!767 = !DILocation(line: 1283, column: 73, scope: !579)
!768 = !DILocation(line: 1283, column: 82, scope: !579)
!769 = !DILocation(line: 1283, column: 91, scope: !579)
!770 = !DILocation(line: 1283, column: 98, scope: !579)
!771 = !DILocation(line: 1283, column: 15, scope: !580)
!772 = !DILocation(line: 1286, column: 22, scope: !577)
!773 = !DILocation(line: 1286, column: 28, scope: !577)
!774 = !DILocation(line: 1286, column: 17, scope: !578)
!775 = !DILocation(line: 1287, column: 34, scope: !576)
!776 = !DILocation(line: 1287, column: 20, scope: !576)
!777 = !DILocation(line: 1288, column: 37, scope: !576)
!778 = !{!458, !446, i64 120}
!779 = !DILocation(line: 1288, column: 40, scope: !576)
!780 = !DILocation(line: 1288, column: 53, scope: !576)
!781 = !{!458, !446, i64 122}
!782 = !DILocation(line: 1288, column: 48, scope: !576)
!783 = !DILocation(line: 1288, column: 46, scope: !576)
!784 = !DILocation(line: 1288, column: 60, scope: !576)
!785 = !DILocation(line: 1288, column: 57, scope: !576)
!786 = !DILocation(line: 1288, column: 19, scope: !576)
!787 = !DILocation(line: 1289, column: 33, scope: !576)
!788 = !DILocation(line: 1289, column: 26, scope: !576)
!789 = !DILocation(line: 1289, column: 24, scope: !576)
!790 = !DILocation(line: 1290, column: 13, scope: !576)
!791 = !DILocation(line: 1293, column: 24, scope: !578)
!792 = !DILocation(line: 1296, column: 23, scope: !578)
!793 = !{!458, !415, i64 132}
!794 = !DILocation(line: 1195, column: 17, scope: !555)
!795 = !DILocation(line: 1297, column: 37, scope: !578)
!796 = !DILocation(line: 1297, column: 18, scope: !578)
!797 = !DILocation(line: 1297, column: 27, scope: !578)
!798 = !{!458, !415, i64 136}
!799 = !DILocation(line: 1298, column: 54, scope: !800)
!800 = distinct !DILexicalBlock(scope: !578, file: !3, line: 1298, column: 17)
!801 = !{!458, !446, i64 110}
!802 = !DILocation(line: 1298, column: 49, scope: !800)
!803 = !DILocation(line: 1298, column: 58, scope: !800)
!804 = !DILocation(line: 1298, column: 31, scope: !800)
!805 = !DILocation(line: 1298, column: 17, scope: !578)
!806 = !DILocation(line: 1299, column: 29, scope: !807)
!807 = distinct !DILexicalBlock(scope: !800, file: !3, line: 1298, column: 65)
!808 = !DILocation(line: 1300, column: 13, scope: !807)
!809 = !DILocation(line: 1301, column: 23, scope: !578)
!810 = !DILocation(line: 1305, column: 18, scope: !578)
!811 = !DILocation(line: 1305, column: 30, scope: !578)
!812 = !{!458, !415, i64 176}
!813 = !DILocation(line: 1309, column: 13, scope: !578)
!814 = !DILocation(line: 1310, column: 11, scope: !578)
!815 = !DILocation(line: 0, scope: !571)
!816 = !DILocation(line: 1315, column: 14, scope: !817)
!817 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1315, column: 9)
!818 = !DILocation(line: 1315, column: 20, scope: !817)
!819 = !DILocation(line: 1315, column: 9, scope: !571)
!820 = !DILocation(line: 1317, column: 16, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 1317, column: 11)
!822 = distinct !DILexicalBlock(scope: !817, file: !3, line: 1315, column: 35)
!823 = !DILocation(line: 1317, column: 22, scope: !821)
!824 = !DILocation(line: 1317, column: 11, scope: !822)
!825 = !DILocation(line: 1320, column: 21, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 1320, column: 13)
!827 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1317, column: 37)
!828 = !DILocation(line: 1320, column: 38, scope: !826)
!829 = !{!458, !415, i64 88}
!830 = !DILocation(line: 1320, column: 31, scope: !826)
!831 = !DILocation(line: 1320, column: 43, scope: !826)
!832 = !DILocation(line: 1320, column: 13, scope: !827)
!833 = !DILocation(line: 1322, column: 11, scope: !834)
!834 = distinct !DILexicalBlock(scope: !826, file: !3, line: 1321, column: 55)
!835 = !DILocation(line: 1324, column: 9, scope: !834)
!836 = !DILocation(line: 0, scope: !837)
!837 = distinct !DILexicalBlock(scope: !570, file: !3, line: 1228, column: 63)
!838 = !DILocation(line: 1329, column: 9, scope: !839)
!839 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1329, column: 9)
!840 = !{!458, !416, i64 49}
!841 = !DILocation(line: 1329, column: 43, scope: !839)
!842 = !DILocation(line: 1330, column: 22, scope: !839)
!843 = !DILocation(line: 1330, column: 38, scope: !839)
!844 = !DILocation(line: 1331, column: 22, scope: !839)
!845 = !DILocation(line: 1329, column: 9, scope: !571)
!846 = !DILocation(line: 1332, column: 19, scope: !847)
!847 = distinct !DILexicalBlock(scope: !848, file: !3, line: 1332, column: 11)
!848 = distinct !DILexicalBlock(scope: !839, file: !3, line: 1331, column: 39)
!849 = !DILocation(line: 1332, column: 36, scope: !847)
!850 = !DILocation(line: 1332, column: 29, scope: !847)
!851 = !DILocation(line: 1332, column: 11, scope: !847)
!852 = !DILocation(line: 1333, column: 17, scope: !847)
!853 = !{!458, !415, i64 264}
!854 = !DILocation(line: 1333, column: 12, scope: !847)
!855 = !DILocation(line: 1333, column: 27, scope: !847)
!856 = !DILocation(line: 1333, column: 48, scope: !847)
!857 = !DILocation(line: 1332, column: 41, scope: !847)
!858 = !DILocation(line: 1332, column: 11, scope: !848)
!859 = !DILocation(line: 1338, column: 9, scope: !860)
!860 = distinct !DILexicalBlock(scope: !847, file: !3, line: 1333, column: 69)
!861 = !DILocation(line: 1340, column: 7, scope: !860)
!862 = !DILocation(line: 1341, column: 41, scope: !863)
!863 = distinct !DILexicalBlock(scope: !847, file: !3, line: 1340, column: 18)
!864 = !{!458, !416, i64 271}
!865 = !DILocation(line: 1341, column: 36, scope: !863)
!866 = !DILocation(line: 1341, column: 55, scope: !863)
!867 = !DILocation(line: 1341, column: 34, scope: !863)
!868 = !DILocation(line: 1342, column: 18, scope: !863)
!869 = !DILocation(line: 1340, column: 48, scope: !863)
!870 = !DILocation(line: 1340, column: 18, scope: !847)
!871 = !DILocation(line: 1343, column: 15, scope: !872)
!872 = distinct !DILexicalBlock(scope: !863, file: !3, line: 1342, column: 39)
!873 = !DILocation(line: 1344, column: 17, scope: !874)
!874 = distinct !DILexicalBlock(scope: !872, file: !3, line: 1344, column: 13)
!875 = !DILocation(line: 1344, column: 13, scope: !872)
!876 = !DILocation(line: 1345, column: 29, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !3, line: 1344, column: 28)
!878 = !DILocation(line: 1346, column: 9, scope: !877)
!879 = !DILocation(line: 0, scope: !834)
!880 = !DILocation(line: 1354, column: 14, scope: !881)
!881 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1354, column: 9)
!882 = !{!458, !460, i64 200}
!883 = !DILocation(line: 1354, column: 20, scope: !881)
!884 = !DILocation(line: 1354, column: 28, scope: !881)
!885 = !DILocation(line: 1355, column: 10, scope: !881)
!886 = !DILocation(line: 1355, column: 27, scope: !881)
!887 = !DILocation(line: 1355, column: 20, scope: !881)
!888 = !DILocation(line: 1355, column: 46, scope: !881)
!889 = !DILocation(line: 1355, column: 34, scope: !881)
!890 = !DILocation(line: 1355, column: 50, scope: !881)
!891 = !DILocation(line: 1355, column: 31, scope: !881)
!892 = !DILocation(line: 1354, column: 9, scope: !571)
!893 = !DILocalVariable(name: "pcb", arg: 1, scope: !894, file: !3, line: 2386, type: !145)
!894 = distinct !DISubprogram(name: "tcp_free_ooseq", scope: !3, file: !3, line: 2386, type: !449, isLocal: false, isDefinition: true, scopeLine: 2387, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !895)
!895 = !{!893}
!896 = !DILocation(line: 2386, column: 32, scope: !894, inlinedAt: !897)
!897 = distinct !DILocation(line: 1357, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !881, file: !3, line: 1355, column: 72)
!899 = !DILocation(line: 2388, column: 7, scope: !894, inlinedAt: !897)
!900 = !DILocalVariable(name: "seg", arg: 1, scope: !901, file: !3, line: 1608, type: !198)
!901 = distinct !DISubprogram(name: "tcp_segs_free", scope: !3, file: !3, line: 1608, type: !902, isLocal: false, isDefinition: true, scopeLine: 1609, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !198}
!904 = !{!900, !905}
!905 = !DILocalVariable(name: "next", scope: !906, file: !3, line: 1611, type: !198)
!906 = distinct !DILexicalBlock(scope: !901, file: !3, line: 1610, column: 23)
!907 = !DILocation(line: 1608, column: 31, scope: !901, inlinedAt: !908)
!908 = distinct !DILocation(line: 2389, column: 5, scope: !909, inlinedAt: !897)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 2388, column: 19)
!910 = distinct !DILexicalBlock(scope: !894, file: !3, line: 2388, column: 7)
!911 = !DILocation(line: 1610, column: 3, scope: !901, inlinedAt: !908)
!912 = !DILocation(line: 1611, column: 33, scope: !906, inlinedAt: !908)
!913 = !{!914, !460, i64 0}
!914 = !{!"tcp_seg", !460, i64 0, !460, i64 8, !446, i64 16, !416, i64 18, !460, i64 24}
!915 = !DILocation(line: 1611, column: 21, scope: !906, inlinedAt: !908)
!916 = !DILocalVariable(name: "seg", arg: 1, scope: !917, file: !3, line: 1623, type: !198)
!917 = distinct !DISubprogram(name: "tcp_seg_free", scope: !3, file: !3, line: 1623, type: !902, isLocal: false, isDefinition: true, scopeLine: 1624, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !918)
!918 = !{!916}
!919 = !DILocation(line: 1623, column: 30, scope: !917, inlinedAt: !920)
!920 = distinct !DILocation(line: 1612, column: 5, scope: !906, inlinedAt: !908)
!921 = !DILocation(line: 1625, column: 7, scope: !917, inlinedAt: !920)
!922 = !DILocation(line: 1626, column: 14, scope: !923, inlinedAt: !920)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 1626, column: 9)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 1625, column: 20)
!925 = distinct !DILexicalBlock(scope: !917, file: !3, line: 1625, column: 7)
!926 = !{!914, !460, i64 8}
!927 = !DILocation(line: 1626, column: 16, scope: !923, inlinedAt: !920)
!928 = !DILocation(line: 1626, column: 9, scope: !924, inlinedAt: !920)
!929 = !DILocation(line: 1627, column: 7, scope: !930, inlinedAt: !920)
!930 = distinct !DILexicalBlock(scope: !923, file: !3, line: 1626, column: 25)
!931 = !DILocation(line: 1631, column: 5, scope: !930, inlinedAt: !920)
!932 = !DILocation(line: 1632, column: 29, scope: !924, inlinedAt: !920)
!933 = !DILocation(line: 1632, column: 5, scope: !924, inlinedAt: !920)
!934 = !DILocation(line: 1633, column: 3, scope: !924, inlinedAt: !920)
!935 = !DILocation(line: 1634, column: 1, scope: !917, inlinedAt: !920)
!936 = !DILocation(line: 1610, column: 14, scope: !901, inlinedAt: !908)
!937 = distinct !{!937, !938, !939}
!938 = !DILocation(line: 1610, column: 3, scope: !901)
!939 = !DILocation(line: 1614, column: 3, scope: !901)
!940 = !DILocation(line: 1615, column: 1, scope: !901, inlinedAt: !908)
!941 = !DILocation(line: 2390, column: 16, scope: !909, inlinedAt: !897)
!942 = !DILocation(line: 2394, column: 3, scope: !909, inlinedAt: !897)
!943 = !DILocation(line: 2395, column: 1, scope: !894, inlinedAt: !897)
!944 = !DILocation(line: 1358, column: 5, scope: !898)
!945 = !DILocation(line: 1362, column: 14, scope: !946)
!946 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1362, column: 9)
!947 = !DILocation(line: 1362, column: 20, scope: !946)
!948 = !DILocation(line: 1362, column: 9, scope: !571)
!949 = !DILocation(line: 1363, column: 19, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 1363, column: 11)
!951 = distinct !DILexicalBlock(scope: !946, file: !3, line: 1362, column: 33)
!952 = !DILocation(line: 1363, column: 36, scope: !950)
!953 = !DILocation(line: 1363, column: 29, scope: !950)
!954 = !DILocation(line: 1363, column: 41, scope: !950)
!955 = !DILocation(line: 1363, column: 11, scope: !951)
!956 = !DILocation(line: 1365, column: 9, scope: !957)
!957 = distinct !DILexicalBlock(scope: !950, file: !3, line: 1364, column: 53)
!958 = !DILocation(line: 1367, column: 7, scope: !957)
!959 = !DILocation(line: 1371, column: 9, scope: !571)
!960 = !DILocation(line: 1371, column: 20, scope: !961)
!961 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1371, column: 9)
!962 = !DILocation(line: 1372, column: 19, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 1372, column: 11)
!964 = distinct !DILexicalBlock(scope: !961, file: !3, line: 1371, column: 33)
!965 = !DILocation(line: 1372, column: 36, scope: !963)
!966 = !DILocation(line: 1372, column: 29, scope: !963)
!967 = !DILocation(line: 1372, column: 41, scope: !963)
!968 = !DILocation(line: 1372, column: 11, scope: !964)
!969 = !DILocation(line: 1373, column: 9, scope: !970)
!970 = distinct !DILexicalBlock(scope: !963, file: !3, line: 1372, column: 76)
!971 = !DILocation(line: 1375, column: 7, scope: !970)
!972 = !DILocation(line: 0, scope: !957)
!973 = !DILocation(line: 1379, column: 9, scope: !586)
!974 = !DILocation(line: 1379, column: 9, scope: !571)
!975 = !DILocation(line: 1382, column: 32, scope: !585)
!976 = !{!458, !460, i64 256}
!977 = !DILocation(line: 1382, column: 18, scope: !585)
!978 = !DILocation(line: 1386, column: 7, scope: !585)
!979 = !DILocation(line: 1388, column: 16, scope: !980)
!980 = distinct !DILexicalBlock(scope: !585, file: !3, line: 1388, column: 11)
!981 = !DILocation(line: 1388, column: 11, scope: !585)
!982 = !DILocation(line: 0, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1389, column: 9)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 1389, column: 9)
!985 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1388, column: 25)
!986 = !DILocation(line: 1389, column: 9, scope: !983)
!987 = !DILocation(line: 1389, column: 9, scope: !984)
!988 = !DILocation(line: 1389, column: 9, scope: !989)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1389, column: 9)
!990 = distinct !DILexicalBlock(scope: !983, file: !3, line: 1389, column: 9)
!991 = !DILocation(line: 1389, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 1389, column: 9)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 1389, column: 9)
!994 = distinct !DILexicalBlock(scope: !989, file: !3, line: 1389, column: 9)
!995 = !DILocation(line: 1390, column: 27, scope: !985)
!996 = !DILocation(line: 1390, column: 15, scope: !985)
!997 = !DILocation(line: 1390, column: 20, scope: !985)
!998 = !DILocation(line: 1391, column: 7, scope: !985)
!999 = !DILocation(line: 1393, column: 9, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 1393, column: 9)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1393, column: 9)
!1002 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1391, column: 14)
!1003 = !DILocation(line: 1393, column: 9, scope: !1001)
!1004 = !DILocation(line: 1393, column: 9, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1393, column: 9)
!1006 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 1393, column: 9)
!1007 = !DILocation(line: 1393, column: 9, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1393, column: 9)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 1393, column: 9)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1393, column: 9)
!1011 = !DILocation(line: 1394, column: 32, scope: !1002)
!1012 = !DILocation(line: 1394, column: 25, scope: !1002)
!1013 = !DILocation(line: 1397, column: 11, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !585, file: !3, line: 1397, column: 11)
!1015 = !DILocation(line: 1397, column: 11, scope: !585)
!1016 = !DILocation(line: 1398, column: 27, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1397, column: 22)
!1018 = !{!458, !415, i64 144}
!1019 = !DILocation(line: 1398, column: 41, scope: !1017)
!1020 = !{!458, !415, i64 92}
!1021 = !DILocation(line: 1398, column: 56, scope: !1017)
!1022 = !DILocation(line: 1398, column: 72, scope: !1017)
!1023 = !DILocation(line: 1399, column: 22, scope: !1017)
!1024 = !{!458, !446, i64 78}
!1025 = !DILocation(line: 1399, column: 39, scope: !1017)
!1026 = !{!458, !446, i64 80}
!1027 = !DILocation(line: 1398, column: 9, scope: !1017)
!1028 = !DILocation(line: 1400, column: 7, scope: !1017)
!1029 = !DILocation(line: 1402, column: 22, scope: !585)
!1030 = !{!458, !460, i64 64}
!1031 = !DILocation(line: 1384, column: 13, scope: !585)
!1032 = !DILocation(line: 1385, column: 22, scope: !585)
!1033 = !DILocation(line: 1380, column: 23, scope: !585)
!1034 = !DILocation(line: 1405, column: 18, scope: !585)
!1035 = !DILocation(line: 210, column: 26, scope: !448, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 1406, column: 7, scope: !585)
!1037 = !DILocation(line: 212, column: 3, scope: !455, inlinedAt: !1036)
!1038 = !DILocation(line: 212, column: 3, scope: !456, inlinedAt: !1036)
!1039 = !DILocation(line: 212, column: 3, scope: !463, inlinedAt: !1036)
!1040 = !DILocation(line: 212, column: 3, scope: !466, inlinedAt: !1036)
!1041 = !DILocation(line: 216, column: 27, scope: !448, inlinedAt: !1036)
!1042 = !DILocation(line: 216, column: 3, scope: !448, inlinedAt: !1036)
!1043 = !DILocation(line: 217, column: 1, scope: !448, inlinedAt: !1036)
!1044 = !DILocation(line: 1408, column: 31, scope: !585)
!1045 = !DILocation(line: 1409, column: 7, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 1409, column: 7)
!1047 = distinct !DILexicalBlock(scope: !585, file: !3, line: 1409, column: 7)
!1048 = !DILocation(line: 1409, column: 7, scope: !1047)
!1049 = !DILocation(line: 1410, column: 11, scope: !585)
!1050 = !DILocation(line: 0, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 1410, column: 36)
!1052 = distinct !DILexicalBlock(scope: !585, file: !3, line: 1410, column: 11)
!1053 = !DILocation(line: 1410, column: 11, scope: !1052)
!1054 = !DILocation(line: 1416, column: 18, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !586, file: !3, line: 1413, column: 12)
!1056 = !DILocation(line: 1419, column: 15, scope: !1055)
!1057 = !DILocation(line: 1419, column: 7, scope: !1055)
!1058 = !{!458, !416, i64 84}
!1059 = !DILocation(line: 1420, column: 34, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 1420, column: 11)
!1061 = !{!458, !416, i64 85}
!1062 = !DILocation(line: 1420, column: 25, scope: !1060)
!1063 = !DILocation(line: 1420, column: 11, scope: !1055)
!1064 = !DILocation(line: 1421, column: 23, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 1420, column: 48)
!1066 = !DILocation(line: 1423, column: 33, scope: !1065)
!1067 = !DILocation(line: 1424, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 1424, column: 9)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1424, column: 9)
!1070 = !{!458, !460, i64 248}
!1071 = !DILocation(line: 1424, column: 9, scope: !1069)
!1072 = !DILocation(line: 1425, column: 13, scope: !1065)
!1073 = !DILocation(line: 1429, column: 13, scope: !1065)
!1074 = !DILocation(line: 1425, column: 13, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1425, column: 13)
!1076 = !DILocation(line: 1429, column: 17, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1429, column: 13)
!1078 = !DILocation(line: 1430, column: 11, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 1429, column: 28)
!1080 = !DILocation(line: 1431, column: 9, scope: !1079)
!1081 = !DILocation(line: 1439, column: 9, scope: !555)
!1082 = !DILocation(line: 1440, column: 3, scope: !555)
!1083 = !DILocation(line: 1440, column: 14, scope: !555)
!1084 = !DILocation(line: 0, scope: !591)
!1085 = !DILocation(line: 1441, column: 5, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 1441, column: 5)
!1087 = distinct !DILexicalBlock(scope: !593, file: !3, line: 1441, column: 5)
!1088 = !DILocation(line: 1441, column: 5, scope: !1087)
!1089 = !DILocation(line: 1441, column: 5, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 1441, column: 5)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 1441, column: 5)
!1092 = !DILocation(line: 1441, column: 5, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 1441, column: 5)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 1441, column: 5)
!1095 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 1441, column: 5)
!1096 = !DILocation(line: 1445, column: 17, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !593, file: !3, line: 1445, column: 9)
!1098 = !DILocation(line: 1445, column: 34, scope: !1097)
!1099 = !DILocation(line: 1445, column: 27, scope: !1097)
!1100 = !DILocation(line: 1445, column: 39, scope: !1097)
!1101 = !DILocation(line: 1445, column: 9, scope: !593)
!1102 = !DILocation(line: 0, scope: !593)
!1103 = !DILocation(line: 1467, column: 18, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !592, file: !3, line: 1465, column: 12)
!1105 = !DILocation(line: 1450, column: 9, scope: !593)
!1106 = !DILocation(line: 1452, column: 7, scope: !591)
!1107 = !DILocation(line: 1454, column: 16, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !591, file: !3, line: 1454, column: 11)
!1109 = !DILocation(line: 1454, column: 11, scope: !591)
!1110 = !DILocation(line: 0, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 1455, column: 9)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 1455, column: 9)
!1113 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 1454, column: 25)
!1114 = !DILocation(line: 1455, column: 9, scope: !1111)
!1115 = !DILocation(line: 1455, column: 9, scope: !1112)
!1116 = !DILocation(line: 1455, column: 9, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 1455, column: 9)
!1118 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 1455, column: 9)
!1119 = !DILocation(line: 1455, column: 9, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 1455, column: 9)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 1455, column: 9)
!1122 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 1455, column: 9)
!1123 = !DILocation(line: 1456, column: 27, scope: !1113)
!1124 = !DILocation(line: 1456, column: 15, scope: !1113)
!1125 = !DILocation(line: 1456, column: 20, scope: !1113)
!1126 = !DILocation(line: 1457, column: 7, scope: !1113)
!1127 = !DILocation(line: 1463, column: 18, scope: !591)
!1128 = !DILocation(line: 1459, column: 9, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 1459, column: 9)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 1459, column: 9)
!1131 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 1457, column: 14)
!1132 = !DILocation(line: 1459, column: 9, scope: !1130)
!1133 = !DILocation(line: 1459, column: 9, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 1459, column: 9)
!1135 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 1459, column: 9)
!1136 = !DILocation(line: 1459, column: 9, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 1459, column: 9)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !3, line: 1459, column: 9)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 1459, column: 9)
!1140 = !DILocation(line: 1460, column: 28, scope: !1131)
!1141 = !DILocation(line: 1460, column: 21, scope: !1131)
!1142 = !DILocation(line: 1451, column: 23, scope: !591)
!1143 = !DILocation(line: 210, column: 26, scope: !448, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 1464, column: 7, scope: !591)
!1145 = !DILocation(line: 212, column: 3, scope: !455, inlinedAt: !1144)
!1146 = !DILocation(line: 212, column: 3, scope: !456, inlinedAt: !1144)
!1147 = !DILocation(line: 212, column: 3, scope: !463, inlinedAt: !1144)
!1148 = !DILocation(line: 212, column: 3, scope: !466, inlinedAt: !1144)
!1149 = !DILocation(line: 216, column: 3, scope: !448, inlinedAt: !1144)
!1150 = !DILocation(line: 217, column: 1, scope: !448, inlinedAt: !1144)
!1151 = !DILocation(line: 1465, column: 5, scope: !591)
!1152 = !DILocation(line: 0, scope: !1104)
!1153 = distinct !{!1153, !1082, !1154}
!1154 = !DILocation(line: 1469, column: 3, scope: !555)
!1155 = !DILocation(line: 1470, column: 1, scope: !555)
!1156 = distinct !DISubprogram(name: "tcp_close", scope: !3, file: !3, line: 484, type: !1157, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1159)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!140, !145}
!1159 = !{!1160}
!1160 = !DILocalVariable(name: "pcb", arg: 1, scope: !1156, file: !3, line: 484, type: !145)
!1161 = !DILocation(line: 484, column: 27, scope: !1156)
!1162 = !DILocation(line: 488, column: 3, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 488, column: 3)
!1164 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 488, column: 3)
!1165 = !DILocation(line: 488, column: 3, scope: !1164)
!1166 = !DILocation(line: 488, column: 3, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 488, column: 3)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 488, column: 3)
!1169 = !DILocation(line: 488, column: 3, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 488, column: 3)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 488, column: 3)
!1172 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 488, column: 3)
!1173 = !DILocation(line: 493, column: 12, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 493, column: 7)
!1175 = !DILocation(line: 493, column: 18, scope: !1174)
!1176 = !DILocation(line: 493, column: 7, scope: !1156)
!1177 = !DILocation(line: 495, column: 5, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1179, file: !3, line: 495, column: 5)
!1179 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 493, column: 29)
!1180 = !DILocation(line: 496, column: 3, scope: !1179)
!1181 = !DILocation(line: 498, column: 10, scope: !1156)
!1182 = !DILocation(line: 499, column: 1, scope: !1156)
!1183 = distinct !DISubprogram(name: "tcp_close_shutdown", scope: !3, file: !3, line: 348, type: !1184, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1186)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!140, !145, !91}
!1186 = !{!1187, !1188, !1189, !1198}
!1187 = !DILocalVariable(name: "pcb", arg: 1, scope: !1183, file: !3, line: 348, type: !145)
!1188 = !DILocalVariable(name: "rst_on_unacked_data", arg: 2, scope: !1183, file: !3, line: 348, type: !91)
!1189 = !DILocalVariable(name: "tcp_tmp_pcb", scope: !1190, file: !3, line: 364, type: !145)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 364, column: 7)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 364, column: 7)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 364, column: 7)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 364, column: 7)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 353, column: 76)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 353, column: 9)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 352, column: 91)
!1197 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 352, column: 7)
!1198 = !DILocalVariable(name: "tcp_tmp_pcb", scope: !1199, file: !3, line: 388, type: !145)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 388, column: 9)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 388, column: 9)
!1201 = distinct !DILexicalBlock(scope: !1202, file: !3, line: 388, column: 9)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 387, column: 33)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !3, line: 387, column: 11)
!1204 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 378, column: 23)
!1205 = !DILocation(line: 348, column: 36, scope: !1183)
!1206 = !DILocation(line: 348, column: 46, scope: !1183)
!1207 = !DILocation(line: 350, column: 3, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !3, line: 350, column: 3)
!1209 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 350, column: 3)
!1210 = !DILocation(line: 350, column: 3, scope: !1209)
!1211 = !DILocation(line: 350, column: 3, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 350, column: 3)
!1213 = distinct !DILexicalBlock(scope: !1208, file: !3, line: 350, column: 3)
!1214 = !DILocation(line: 350, column: 3, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !3, line: 350, column: 3)
!1216 = distinct !DILexicalBlock(scope: !1217, file: !3, line: 350, column: 3)
!1217 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 350, column: 3)
!1218 = !DILocation(line: 352, column: 7, scope: !1197)
!1219 = !DILocation(line: 352, column: 27, scope: !1197)
!1220 = !DILocation(line: 0, scope: !1197)
!1221 = !DILocation(line: 352, column: 43, scope: !1197)
!1222 = !DILocation(line: 352, column: 59, scope: !1197)
!1223 = !DILocation(line: 352, column: 74, scope: !1197)
!1224 = !DILocation(line: 352, column: 7, scope: !1183)
!1225 = !DILocation(line: 353, column: 15, scope: !1195)
!1226 = !DILocation(line: 353, column: 28, scope: !1195)
!1227 = !DILocation(line: 353, column: 37, scope: !1195)
!1228 = !DILocation(line: 356, column: 7, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 356, column: 7)
!1230 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 356, column: 7)
!1231 = !DILocation(line: 353, column: 46, scope: !1195)
!1232 = !{!458, !415, i64 96}
!1233 = !DILocation(line: 353, column: 57, scope: !1195)
!1234 = !DILocation(line: 353, column: 54, scope: !1195)
!1235 = !DILocation(line: 353, column: 9, scope: !1196)
!1236 = !DILocation(line: 356, column: 7, scope: !1230)
!1237 = !DILocation(line: 356, column: 7, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !3, line: 356, column: 7)
!1239 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 356, column: 7)
!1240 = !DILocation(line: 356, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 356, column: 7)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 356, column: 7)
!1243 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 356, column: 7)
!1244 = !DILocation(line: 360, column: 25, scope: !1194)
!1245 = !DILocation(line: 360, column: 39, scope: !1194)
!1246 = !DILocation(line: 360, column: 54, scope: !1194)
!1247 = !DILocation(line: 360, column: 70, scope: !1194)
!1248 = !DILocation(line: 361, column: 20, scope: !1194)
!1249 = !DILocation(line: 361, column: 37, scope: !1194)
!1250 = !DILocation(line: 360, column: 7, scope: !1194)
!1251 = !DILocation(line: 363, column: 7, scope: !1194)
!1252 = !DILocation(line: 364, column: 7, scope: !1191)
!1253 = !DILocation(line: 364, column: 7, scope: !1192)
!1254 = !DILocation(line: 364, column: 7, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 364, column: 7)
!1256 = !DILocation(line: 364, column: 7, scope: !1190)
!1257 = !DILocation(line: 364, column: 7, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 364, column: 7)
!1259 = !DILocation(line: 364, column: 7, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 364, column: 7)
!1261 = !DILocation(line: 364, column: 7, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 364, column: 7)
!1263 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 364, column: 7)
!1264 = !DILocation(line: 364, column: 7, scope: !1263)
!1265 = !DILocation(line: 364, column: 7, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 364, column: 7)
!1267 = distinct !{!1267, !1257, !1257}
!1268 = !DILocation(line: 364, column: 7, scope: !1193)
!1269 = !DILocation(line: 366, column: 11, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 366, column: 11)
!1271 = !DILocation(line: 366, column: 25, scope: !1270)
!1272 = !DILocation(line: 366, column: 11, scope: !1194)
!1273 = !DILocation(line: 368, column: 9, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 366, column: 33)
!1275 = !DILocation(line: 369, column: 7, scope: !1274)
!1276 = !DILocation(line: 210, column: 26, scope: !448, inlinedAt: !1277)
!1277 = distinct !DILocation(line: 370, column: 9, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 369, column: 14)
!1279 = !DILocation(line: 212, column: 3, scope: !455, inlinedAt: !1277)
!1280 = !DILocation(line: 212, column: 3, scope: !456, inlinedAt: !1277)
!1281 = !DILocation(line: 212, column: 3, scope: !463, inlinedAt: !1277)
!1282 = !DILocation(line: 212, column: 3, scope: !466, inlinedAt: !1277)
!1283 = !DILocation(line: 216, column: 27, scope: !448, inlinedAt: !1277)
!1284 = !DILocation(line: 216, column: 3, scope: !448, inlinedAt: !1277)
!1285 = !DILocation(line: 217, column: 1, scope: !448, inlinedAt: !1277)
!1286 = !DILocation(line: 372, column: 7, scope: !1194)
!1287 = !DILocation(line: 378, column: 3, scope: !1183)
!1288 = !DILocation(line: 387, column: 16, scope: !1203)
!1289 = !DILocation(line: 387, column: 27, scope: !1203)
!1290 = !DILocation(line: 387, column: 11, scope: !1204)
!1291 = !DILocation(line: 388, column: 9, scope: !1200)
!1292 = !DILocation(line: 388, column: 9, scope: !1201)
!1293 = !DILocation(line: 388, column: 9, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 388, column: 9)
!1295 = !DILocation(line: 210, column: 26, scope: !448, inlinedAt: !1296)
!1296 = distinct !DILocation(line: 390, column: 7, scope: !1204)
!1297 = !DILocation(line: 212, column: 3, scope: !456, inlinedAt: !1296)
!1298 = !DILocation(line: 388, column: 9, scope: !1199)
!1299 = !DILocation(line: 388, column: 9, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 388, column: 9)
!1301 = !DILocation(line: 388, column: 9, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 388, column: 9)
!1303 = !DILocation(line: 388, column: 9, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1305, file: !3, line: 388, column: 9)
!1305 = distinct !DILexicalBlock(scope: !1302, file: !3, line: 388, column: 9)
!1306 = !DILocation(line: 388, column: 9, scope: !1305)
!1307 = !DILocation(line: 388, column: 9, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1304, file: !3, line: 388, column: 9)
!1309 = distinct !{!1309, !1299, !1299}
!1310 = !DILocation(line: 389, column: 7, scope: !1202)
!1311 = !DILocation(line: 216, column: 27, scope: !448, inlinedAt: !1296)
!1312 = !DILocation(line: 216, column: 3, scope: !448, inlinedAt: !1296)
!1313 = !DILocation(line: 391, column: 7, scope: !1204)
!1314 = !DILocalVariable(name: "pcb", arg: 1, scope: !1315, file: !3, line: 269, type: !145)
!1315 = distinct !DISubprogram(name: "tcp_listen_closed", scope: !3, file: !3, line: 269, type: !449, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1316)
!1316 = !{!1314, !1317}
!1317 = !DILocalVariable(name: "i", scope: !1315, file: !3, line: 272, type: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1319, line: 40, baseType: !1320)
!1319 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !1321, line: 129, baseType: !272)
!1321 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!1322 = !DILocation(line: 269, column: 35, scope: !1315, inlinedAt: !1323)
!1323 = distinct !DILocation(line: 393, column: 7, scope: !1204)
!1324 = !DILocation(line: 273, column: 3, scope: !1325, inlinedAt: !1323)
!1325 = distinct !DILexicalBlock(scope: !1315, file: !3, line: 273, column: 3)
!1326 = !DILocation(line: 274, column: 3, scope: !1327, inlinedAt: !1323)
!1327 = distinct !DILexicalBlock(scope: !1315, file: !3, line: 274, column: 3)
!1328 = !DILocation(line: 272, column: 10, scope: !1315, inlinedAt: !1323)
!1329 = !DILocation(line: 275, column: 8, scope: !1330, inlinedAt: !1323)
!1330 = distinct !DILexicalBlock(scope: !1315, file: !3, line: 275, column: 3)
!1331 = !DILocation(line: 275, column: 3, scope: !1330, inlinedAt: !1323)
!1332 = !DILocation(line: 276, column: 25, scope: !1333, inlinedAt: !1323)
!1333 = distinct !DILexicalBlock(scope: !1334, file: !3, line: 275, column: 55)
!1334 = distinct !DILexicalBlock(scope: !1330, file: !3, line: 275, column: 3)
!1335 = !DILocalVariable(name: "list", arg: 1, scope: !1336, file: !3, line: 251, type: !145)
!1336 = distinct !DISubprogram(name: "tcp_remove_listener", scope: !3, file: !3, line: 251, type: !1337, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1339)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !145, !98}
!1339 = !{!1335, !1340, !1341}
!1340 = !DILocalVariable(name: "lpcb", arg: 2, scope: !1336, file: !3, line: 251, type: !98)
!1341 = !DILocalVariable(name: "pcb", scope: !1336, file: !3, line: 253, type: !145)
!1342 = !DILocation(line: 251, column: 37, scope: !1336, inlinedAt: !1343)
!1343 = distinct !DILocation(line: 276, column: 5, scope: !1333, inlinedAt: !1323)
!1344 = !DILocation(line: 251, column: 66, scope: !1336, inlinedAt: !1343)
!1345 = !DILocation(line: 255, column: 3, scope: !1346, inlinedAt: !1343)
!1346 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 255, column: 3)
