; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp_in.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp_in.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.tcp_hdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !59, globals: !264)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp_in.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !11, !25, !32, !38}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !6, line: 156, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tcp_state", file: !12, line: 56, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcpbase.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "CLOSED", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "LISTEN", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "SYN_SENT", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "SYN_RCVD", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "ESTABLISHED", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "FIN_WAIT_1", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "FIN_WAIT_2", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "CLOSE_WAIT", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "CLOSING", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "LAST_ACK", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "TIME_WAIT", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !26, line: 68, baseType: !7, size: 32, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !33, line: 54, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!37 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 53, baseType: !40, size: 32, elements: !41)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!42 = !DIEnumerator(name: "ERR_OK", value: 0)
!43 = !DIEnumerator(name: "ERR_MEM", value: -1)
!44 = !DIEnumerator(name: "ERR_BUF", value: -2)
!45 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!46 = !DIEnumerator(name: "ERR_RTE", value: -4)
!47 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!48 = !DIEnumerator(name: "ERR_VAL", value: -6)
!49 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!50 = !DIEnumerator(name: "ERR_USE", value: -8)
!51 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!52 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!53 = !DIEnumerator(name: "ERR_CONN", value: -11)
!54 = !DIEnumerator(name: "ERR_IF", value: -12)
!55 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!56 = !DIEnumerator(name: "ERR_RST", value: -14)
!57 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!58 = !DIEnumerator(name: "ERR_ARG", value: -16)
!59 = !{!60, !61, !75, !83, !66, !87, !88, !191, !135, !244, !128, !246, !139, !249, !7}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_hdr", file: !63, line: 56, size: 160, elements: !64)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !{!65, !73, !74, !78, !79, !80, !81, !82}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !62, file: !63, line: 57, baseType: !66, size: 16)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !67, line: 127, baseType: !68)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !69, line: 36, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !71, line: 57, baseType: !72)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !62, file: !63, line: 58, baseType: !66, size: 16, offset: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !62, file: !63, line: 59, baseType: !75, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !67, line: 129, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !69, line: 48, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !71, line: 79, baseType: !7)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ackno", scope: !62, file: !63, line: 60, baseType: !75, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_hdrlen_rsvd_flags", scope: !62, file: !63, line: 61, baseType: !66, size: 16, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "wnd", scope: !62, file: !63, line: 62, baseType: !66, size: 16, offset: 112)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !62, file: !63, line: 63, baseType: !66, size: 16, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "urgp", scope: !62, file: !63, line: 64, baseType: !66, size: 16, offset: 144)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !67, line: 125, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !69, line: 24, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !71, line: 43, baseType: !86)
!86 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb", file: !90, line: 242, size: 2240, elements: !91)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !{!92, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !129, !130, !131, !132, !133, !134, !136, !137, !138, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !187, !188, !189, !190, !215, !220, !225, !227, !232, !237, !238, !239, !240, !241, !242, !243}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !89, file: !90, line: 244, baseType: !93, size: 192)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !33, line: 76, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !33, line: 69, size: 192, elements: !95)
!95 = !{!96, !115}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !94, file: !33, line: 73, baseType: !97, size: 160)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !33, line: 70, size: 160, elements: !98)
!98 = !{!99, !109}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !97, file: !33, line: 71, baseType: !100, size: 160)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !101, line: 67, baseType: !102)
!101 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !101, line: 59, size: 160, elements: !103)
!103 = !{!104, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !102, file: !101, line: 60, baseType: !105, size: 128)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 4)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !102, file: !101, line: 62, baseType: !83, size: 8, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !97, file: !33, line: 72, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !111, line: 57, baseType: !112)
!111 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !111, line: 51, size: 32, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !112, file: !111, line: 52, baseType: !75, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !33, line: 75, baseType: !83, size: 8, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !89, file: !90, line: 244, baseType: !93, size: 192, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !89, file: !90, line: 244, baseType: !83, size: 8, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !89, file: !90, line: 244, baseType: !83, size: 8, offset: 392)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !89, file: !90, line: 244, baseType: !83, size: 8, offset: 400)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !89, file: !90, line: 244, baseType: !83, size: 8, offset: 408)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !90, line: 246, baseType: !88, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !89, file: !90, line: 246, baseType: !60, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !89, file: !90, line: 246, baseType: !11, size: 32, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !89, file: !90, line: 246, baseType: !83, size: 8, offset: 608)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !89, file: !90, line: 246, baseType: !66, size: 16, offset: 624)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !89, file: !90, line: 249, baseType: !66, size: 16, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !90, line: 251, baseType: !128, size: 16, offset: 656)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpflags_t", file: !90, line: 206, baseType: !66)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "polltmr", scope: !89, file: !90, line: 278, baseType: !83, size: 8, offset: 672)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pollinterval", scope: !89, file: !90, line: 278, baseType: !83, size: 8, offset: 680)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "last_timer", scope: !89, file: !90, line: 279, baseType: !83, size: 8, offset: 688)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !89, file: !90, line: 280, baseType: !75, size: 32, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !89, file: !90, line: 283, baseType: !75, size: 32, offset: 736)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wnd", scope: !89, file: !90, line: 284, baseType: !135, size: 32, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpwnd_size_t", file: !12, line: 51, baseType: !75)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_wnd", scope: !89, file: !90, line: 285, baseType: !135, size: 32, offset: 800)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_right_edge", scope: !89, file: !90, line: 286, baseType: !75, size: 32, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rtime", scope: !89, file: !90, line: 295, baseType: !139, size: 16, offset: 864)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !67, line: 128, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !69, line: 32, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !71, line: 55, baseType: !142)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !89, file: !90, line: 297, baseType: !66, size: 16, offset: 880)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rttest", scope: !89, file: !90, line: 300, baseType: !75, size: 32, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rtseq", scope: !89, file: !90, line: 301, baseType: !75, size: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !89, file: !90, line: 302, baseType: !139, size: 16, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !89, file: !90, line: 302, baseType: !139, size: 16, offset: 976)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rto", scope: !89, file: !90, line: 304, baseType: !139, size: 16, offset: 992)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nrtx", scope: !89, file: !90, line: 305, baseType: !83, size: 8, offset: 1008)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dupacks", scope: !89, file: !90, line: 308, baseType: !83, size: 8, offset: 1016)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "lastack", scope: !89, file: !90, line: 309, baseType: !75, size: 32, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd", scope: !89, file: !90, line: 312, baseType: !135, size: 32, offset: 1056)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !89, file: !90, line: 313, baseType: !135, size: 32, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rto_end", scope: !89, file: !90, line: 316, baseType: !75, size: 32, offset: 1120)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !89, file: !90, line: 319, baseType: !75, size: 32, offset: 1152)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl1", scope: !89, file: !90, line: 320, baseType: !75, size: 32, offset: 1184)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl2", scope: !89, file: !90, line: 320, baseType: !75, size: 32, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "snd_lbb", scope: !89, file: !90, line: 322, baseType: !75, size: 32, offset: 1248)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd", scope: !89, file: !90, line: 323, baseType: !135, size: 32, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd_max", scope: !89, file: !90, line: 324, baseType: !135, size: 32, offset: 1312)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "snd_buf", scope: !89, file: !90, line: 326, baseType: !135, size: 32, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "snd_queuelen", scope: !89, file: !90, line: 328, baseType: !66, size: 16, offset: 1376)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "unsent_oversize", scope: !89, file: !90, line: 332, baseType: !66, size: 16, offset: 1392)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !89, file: !90, line: 335, baseType: !135, size: 32, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "unsent", scope: !89, file: !90, line: 338, baseType: !166, size: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_seg", file: !168, line: 253, size: 256, elements: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/tcp_priv.h", directory: "/root/.unikraft/apps/redis/build")
!169 = !{!170, !171, !184, !185, !186}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 254, baseType: !166, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !167, file: !168, line: 255, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !174, line: 186, size: 192, elements: !175)
!174 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !174, line: 188, baseType: !172, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !173, file: !174, line: 191, baseType: !60, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !173, file: !174, line: 200, baseType: !66, size: 16, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !173, file: !174, line: 203, baseType: !66, size: 16, offset: 144)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !173, file: !174, line: 208, baseType: !83, size: 8, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !173, file: !174, line: 211, baseType: !83, size: 8, offset: 168)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !173, file: !174, line: 218, baseType: !83, size: 8, offset: 176)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !173, file: !174, line: 221, baseType: !83, size: 8, offset: 184)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !167, file: !168, line: 256, baseType: !66, size: 16, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !168, line: 266, baseType: !83, size: 8, offset: 144)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tcphdr", scope: !167, file: !168, line: 273, baseType: !61, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "unacked", scope: !89, file: !90, line: 339, baseType: !166, size: 64, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ooseq", scope: !89, file: !90, line: 341, baseType: !166, size: 64, offset: 1600)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "refused_data", scope: !89, file: !90, line: 344, baseType: !172, size: 64, offset: 1664)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !89, file: !90, line: 347, baseType: !191, size: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb_listen", file: !90, line: 223, size: 704, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !192, file: !90, line: 225, baseType: !93, size: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !192, file: !90, line: 225, baseType: !93, size: 192, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !192, file: !90, line: 225, baseType: !83, size: 8, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !192, file: !90, line: 225, baseType: !83, size: 8, offset: 392)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !192, file: !90, line: 225, baseType: !83, size: 8, offset: 400)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !192, file: !90, line: 225, baseType: !83, size: 8, offset: 408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !90, line: 227, baseType: !191, size: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !192, file: !90, line: 227, baseType: !60, size: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !192, file: !90, line: 227, baseType: !11, size: 32, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !90, line: 227, baseType: !83, size: 8, offset: 608)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !192, file: !90, line: 227, baseType: !66, size: 16, offset: 624)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !192, file: !90, line: 231, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_accept_fn", file: !90, line: 70, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !60, !88, !210}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !39, line: 96, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !67, line: 126, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !69, line: 20, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !71, line: 41, baseType: !214)
!214 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !89, file: !90, line: 352, baseType: !216, size: 64, offset: 1792)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_sent_fn", file: !90, line: 96, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!210, !60, !88, !66}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !89, file: !90, line: 354, baseType: !221, size: 64, offset: 1856)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_recv_fn", file: !90, line: 82, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!210, !60, !88, !172, !210}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !89, file: !90, line: 356, baseType: !226, size: 64, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connected_fn", file: !90, line: 134, baseType: !207)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !89, file: !90, line: 358, baseType: !228, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_poll_fn", file: !90, line: 108, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!210, !60, !88}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errf", scope: !89, file: !90, line: 360, baseType: !233, size: 64, offset: 2048)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_err_fn", file: !90, line: 120, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !60, !210}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "keep_idle", scope: !89, file: !90, line: 369, baseType: !75, size: 32, offset: 2112)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "persist_cnt", scope: !89, file: !90, line: 376, baseType: !83, size: 8, offset: 2144)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "persist_backoff", scope: !89, file: !90, line: 378, baseType: !83, size: 8, offset: 2152)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "persist_probe", scope: !89, file: !90, line: 380, baseType: !83, size: 8, offset: 2160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "keep_cnt_sent", scope: !89, file: !90, line: 383, baseType: !83, size: 8, offset: 2168)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "snd_scale", scope: !89, file: !90, line: 386, baseType: !83, size: 8, offset: 2176)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_scale", scope: !89, file: !90, line: 387, baseType: !83, size: 8, offset: 2184)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32_t", file: !67, line: 130, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !69, line: 44, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !71, line: 77, baseType: !40)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !252, line: 80, size: 320, elements: !253)
!252 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!253 = !{!254, !255, !256, !257, !258, !263}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_v_tc_fl", scope: !251, file: !252, line: 82, baseType: !75, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_plen", scope: !251, file: !252, line: 84, baseType: !66, size: 16, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !251, file: !252, line: 86, baseType: !83, size: 8, offset: 48)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_hoplim", scope: !251, file: !252, line: 88, baseType: !83, size: 8, offset: 56)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !251, file: !252, line: 90, baseType: !259, size: 128, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !252, line: 60, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !252, line: 53, size: 128, elements: !261)
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !260, file: !252, line: 54, baseType: !105, size: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !251, file: !252, line: 91, baseType: !259, size: 128, offset: 192)
!264 = !{!265, !0, !267, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !289, !316, !321}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "inseg", scope: !2, file: !3, line: 74, type: !167, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "tcphdr_optlen", scope: !2, file: !3, line: 76, type: !66, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "tcphdr_opt1len", scope: !2, file: !3, line: 77, type: !66, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "tcphdr_opt2", scope: !2, file: !3, line: 78, type: !87, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "seqno", scope: !2, file: !3, line: 80, type: !75, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "ackno", scope: !2, file: !3, line: 80, type: !75, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "recv_acked", scope: !2, file: !3, line: 81, type: !135, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "tcplen", scope: !2, file: !3, line: 82, type: !66, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !3, line: 83, type: !83, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "recv_flags", scope: !2, file: !3, line: 85, type: !83, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "recv_data", scope: !2, file: !3, line: 86, type: !172, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "tcp_input_pcb", scope: !2, file: !3, line: 88, type: !88, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "__str", scope: !291, file: !292, line: 198, type: !313, isLocal: true, isDefinition: true)
!291 = distinct !DISubprogram(name: "uk_pr_crit", scope: !292, file: !292, line: 194, type: !293, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !298)
!292 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295, null}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!298 = !{!299, !300}
!299 = !DILocalVariable(name: "fmt", arg: 1, scope: !291, file: !292, line: 194, type: !295)
!300 = !DILocalVariable(name: "argp", scope: !291, file: !292, line: 196, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !302, line: 32, baseType: !303)
!302 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 192, elements: !311)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !305, file: !3, line: 196, baseType: !7, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !305, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !305, file: !3, line: 196, baseType: !60, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !305, file: !3, line: 196, baseType: !60, size: 64, offset: 128)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 64, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 8)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "__str", scope: !291, file: !292, line: 198, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 72, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 9)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "tcp_optidx", scope: !2, file: !3, line: 79, type: !66, isLocal: true, isDefinition: true)
!323 = !{i32 2, !"Dwarf Version", i32 4}
!324 = !{i32 2, !"Debug Info Version", i32 3}
!325 = !{i32 1, !"wchar_size", i32 4}
!326 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!327 = distinct !DISubprogram(name: "tcp_input", scope: !3, file: !3, line: 118, type: !328, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !400)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !172, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !341, !343, !345, !346, !351, !358, !363, !370, !375, !376, !377, !379, !380, !381, !382, !386, !387, !388, !392, !393, !394, !395}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !6, line: 263, baseType: !330, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !331, file: !6, line: 268, baseType: !93, size: 192, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !331, file: !6, line: 269, baseType: !93, size: 192, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !331, file: !6, line: 270, baseType: !93, size: 192, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !331, file: !6, line: 274, baseType: !338, size: 576, offset: 640)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 576, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 3)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !331, file: !6, line: 277, baseType: !342, size: 24, offset: 1216)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 24, elements: !339)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !331, file: !6, line: 282, baseType: !344, size: 96, offset: 1248)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 96, elements: !339)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !331, file: !6, line: 283, baseType: !344, size: 96, offset: 1344)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !331, file: !6, line: 288, baseType: !347, size: 64, offset: 1472)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!210, !172, !330}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !331, file: !6, line: 294, baseType: !352, size: 64, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!210, !330, !172, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !331, file: !6, line: 299, baseType: !359, size: 64, offset: 1600)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!210, !330, !172}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !331, file: !6, line: 305, baseType: !364, size: 64, offset: 1664)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!210, !330, !172, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !331, file: !6, line: 310, baseType: !371, size: 64, offset: 1728)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !330}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !331, file: !6, line: 319, baseType: !371, size: 64, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !331, file: !6, line: 323, baseType: !60, size: 64, offset: 1856)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !331, file: !6, line: 325, baseType: !378, size: 64, offset: 1920)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !311)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !331, file: !6, line: 332, baseType: !66, size: 16, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !331, file: !6, line: 335, baseType: !66, size: 16, offset: 2000)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !331, file: !6, line: 338, baseType: !66, size: 16, offset: 2016)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !331, file: !6, line: 341, baseType: !383, size: 48, offset: 2032)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 48, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 6)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !331, file: !6, line: 343, baseType: !83, size: 8, offset: 2080)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !6, line: 345, baseType: !83, size: 8, offset: 2088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !6, line: 347, baseType: !389, size: 16, offset: 2096)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 16, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 2)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !331, file: !6, line: 350, baseType: !83, size: 8, offset: 2112)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !331, file: !6, line: 353, baseType: !83, size: 8, offset: 2120)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !331, file: !6, line: 357, baseType: !83, size: 8, offset: 2128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !331, file: !6, line: 377, baseType: !396, size: 64, offset: 2176)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!210, !330, !368, !5}
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !413, !416, !425, !426}
!401 = !DILocalVariable(name: "p", arg: 1, scope: !327, file: !3, line: 118, type: !172)
!402 = !DILocalVariable(name: "inp", arg: 2, scope: !327, file: !3, line: 118, type: !330)
!403 = !DILocalVariable(name: "pcb", scope: !327, file: !3, line: 120, type: !88)
!404 = !DILocalVariable(name: "prev", scope: !327, file: !3, line: 120, type: !88)
!405 = !DILocalVariable(name: "lpcb", scope: !327, file: !3, line: 121, type: !191)
!406 = !DILocalVariable(name: "lpcb_prev", scope: !327, file: !3, line: 123, type: !88)
!407 = !DILocalVariable(name: "lpcb_any", scope: !327, file: !3, line: 124, type: !191)
!408 = !DILocalVariable(name: "hdrlen_bytes", scope: !327, file: !3, line: 126, type: !83)
!409 = !DILocalVariable(name: "err", scope: !327, file: !3, line: 127, type: !210)
!410 = !DILocalVariable(name: "chksum", scope: !411, file: !3, line: 162, type: !66)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 160, column: 61)
!412 = distinct !DILexicalBlock(scope: !327, file: !3, line: 160, column: 3)
!413 = !DILocalVariable(name: "opt2len", scope: !414, file: !3, line: 191, type: !66)
!414 = distinct !DILexicalBlock(scope: !415, file: !3, line: 190, column: 10)
!415 = distinct !DILexicalBlock(scope: !327, file: !3, line: 186, column: 7)
!416 = !DILocalVariable(name: "acked16", scope: !417, file: !3, line: 456, type: !66)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 455, column: 29)
!418 = distinct !DILexicalBlock(scope: !419, file: !3, line: 455, column: 13)
!419 = distinct !DILexicalBlock(scope: !420, file: !3, line: 450, column: 14)
!420 = distinct !DILexicalBlock(scope: !421, file: !3, line: 442, column: 11)
!421 = distinct !DILexicalBlock(scope: !422, file: !3, line: 441, column: 26)
!422 = distinct !DILexicalBlock(scope: !423, file: !3, line: 441, column: 9)
!423 = distinct !DILexicalBlock(scope: !424, file: !3, line: 401, column: 20)
!424 = distinct !DILexicalBlock(scope: !327, file: !3, line: 401, column: 7)
!425 = !DILocalVariable(name: "acked", scope: !417, file: !3, line: 460, type: !75)
!426 = !DILocalVariable(name: "rest", scope: !427, file: !3, line: 480, type: !172)
!427 = distinct !DILexicalBlock(scope: !419, file: !3, line: 479, column: 35)
!428 = !DILocation(line: 118, column: 24, scope: !327)
!429 = !DILocation(line: 118, column: 41, scope: !327)
!430 = !DILocation(line: 123, column: 19, scope: !327)
!431 = !DILocation(line: 124, column: 26, scope: !327)
!432 = !DILocation(line: 131, column: 3, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !3, line: 131, column: 3)
!434 = distinct !DILexicalBlock(scope: !327, file: !3, line: 131, column: 3)
!435 = !DILocation(line: 131, column: 3, scope: !434)
!436 = !DILocation(line: 131, column: 3, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 131, column: 3)
!438 = distinct !DILexicalBlock(scope: !433, file: !3, line: 131, column: 3)
!439 = !DILocation(line: 131, column: 3, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !3, line: 131, column: 3)
!441 = distinct !DILexicalBlock(scope: !442, file: !3, line: 131, column: 3)
!442 = distinct !DILexicalBlock(scope: !437, file: !3, line: 131, column: 3)
!443 = !DILocation(line: 135, column: 3, scope: !327)
!444 = !{!445, !447, i64 146}
!445 = !{!"stats_", !446, i64 0, !446, i64 24, !446, i64 48, !446, i64 72, !446, i64 96, !446, i64 120, !446, i64 144, !450, i64 168, !446, i64 186, !446, i64 210, !446, i64 234, !452, i64 258, !446, i64 286}
