; ModuleID = '/root/.unikraft/apps/redis/build/libtlsf/origin/TLSF-2.4.6/src/tlsf.c'
source_filename = "/root/.unikraft/apps/redis/build/libtlsf/origin/TLSF-2.4.6/src/tlsf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bhdr_struct = type { %struct.bhdr_struct*, i64, %union.anon }
%union.anon = type { %struct.free_ptr_struct }
%struct.free_ptr_struct = type { %struct.bhdr_struct*, %struct.bhdr_struct* }
%struct.area_info_struct = type { %struct.bhdr_struct*, %struct.area_info_struct* }
%struct.TLSF_struct = type { i32, %struct.area_info_struct*, i32, [24 x i32], [24 x [32 x %struct.bhdr_struct*]] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 256, type: !60, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !59)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libtlsf/origin/TLSF-2.4.6/src/tlsf.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !20, !56, !15, !58, !13}
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "tlsf_t", file: !3, line: 238, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TLSF_struct", file: !3, line: 212, size: 50112, elements: !10)
!10 = !{!11, !14, !47, !48, !52}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "tlsf_signature", scope: !9, file: !3, line: 214, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !3, line: 184, baseType: !13)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "area_head", scope: !9, file: !3, line: 228, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "area_info_t", file: !3, line: 210, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "area_info_struct", file: !3, line: 207, size: 128, elements: !18)
!18 = !{!19, !45}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !17, file: !3, line: 208, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_t", file: !3, line: 202, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bhdr_struct", file: !3, line: 192, size: 256, elements: !23)
!23 = !{!24, !26, !31}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev_hdr", scope: !22, file: !3, line: 194, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !3, line: 196, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 40, baseType: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !30, line: 129, baseType: !6)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, file: !3, line: 201, baseType: !32, size: 128, offset: 128)
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !22, file: !3, line: 198, size: 128, elements: !33)
!33 = !{!34, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "free_ptr", scope: !32, file: !3, line: 199, baseType: !35, size: 128)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "free_ptr_struct", file: !3, line: 187, size: 128, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !35, file: !3, line: 188, baseType: !25, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !35, file: !3, line: 189, baseType: !25, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !32, file: !3, line: 200, baseType: !40, size: 8)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !43)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !3, line: 185, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !{!44}
!44 = !DISubrange(count: 1)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !3, line: 209, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fl_bitmap", scope: !9, file: !3, line: 232, baseType: !12, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sl_bitmap", scope: !9, file: !3, line: 235, baseType: !49, size: 768, offset: 160)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 24)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !9, file: !3, line: 237, baseType: !53, size: 49152, offset: 960)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 49152, elements: !54)
!54 = !{!51, !55}
!55 = !DISubrange(count: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !{!0}
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8192, elements: !63)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !{!64}
!64 = !DISubrange(count: 256)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 1, !"wchar_size", i32 4}
!68 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!69 = distinct !DISubprogram(name: "init_memory_pool", scope: !3, file: !3, line: 456, type: !70, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!27, !27, !58}
!72 = !{!73, !74, !75, !76, !77}
!73 = !DILocalVariable(name: "mem_pool_size", arg: 1, scope: !69, file: !3, line: 456, type: !27)
!74 = !DILocalVariable(name: "mem_pool", arg: 2, scope: !69, file: !3, line: 456, type: !58)
!75 = !DILocalVariable(name: "tlsf", scope: !69, file: !3, line: 459, type: !7)
!76 = !DILocalVariable(name: "b", scope: !69, file: !3, line: 460, type: !20)
!77 = !DILocalVariable(name: "ib", scope: !69, file: !3, line: 460, type: !20)
!78 = !DILocation(line: 456, column: 32, scope: !69)
!79 = !DILocation(line: 456, column: 53, scope: !69)
!80 = !DILocation(line: 462, column: 10, scope: !81)
!81 = distinct !DILexicalBlock(scope: !69, file: !3, line: 462, column: 9)
!82 = !DILocation(line: 462, column: 54, scope: !81)
!83 = !DILocation(line: 462, column: 19, scope: !81)
!84 = !DILocation(line: 467, column: 10, scope: !85)
!85 = distinct !DILexicalBlock(scope: !69, file: !3, line: 467, column: 9)
!86 = !DILocation(line: 467, column: 35, scope: !85)
!87 = !DILocation(line: 467, column: 9, scope: !69)
!88 = !DILocation(line: 473, column: 15, scope: !89)
!89 = distinct !DILexicalBlock(scope: !69, file: !3, line: 473, column: 9)
!90 = !{!91, !92, i64 0}
!91 = !{!"TLSF_struct", !92, i64 0, !95, i64 8, !92, i64 16, !93, i64 20, !93, i64 120}
!92 = !{!"int", !93, i64 0}
!93 = !{!"omnipotent char", !94, i64 0}
!94 = !{!"Simple C/C++ TBAA"}
!95 = !{!"any pointer", !93, i64 0}
!96 = !DILocation(line: 473, column: 30, scope: !89)
!97 = !DILocation(line: 473, column: 9, scope: !69)
!98 = !DILocation(line: 460, column: 13, scope: !69)
!99 = !DILocation(line: 475, column: 19, scope: !100)
!100 = distinct !DILexicalBlock(scope: !89, file: !3, line: 473, column: 49)
!101 = !{!102, !103, i64 8}
!102 = !{!"bhdr_struct", !95, i64 0, !103, i64 8, !93, i64 16}
!103 = !{!"long", !93, i64 0}
!104 = !DILocation(line: 475, column: 24, scope: !100)
!105 = !DILocation(line: 475, column: 9, scope: !100)
!106 = !DILocation(line: 459, column: 13, scope: !69)
!107 = !DILocation(line: 479, column: 5, scope: !69)
!108 = !DILocation(line: 481, column: 26, scope: !69)
!109 = !DILocalVariable(name: "area", arg: 1, scope: !110, file: !3, line: 430, type: !58)
!110 = distinct !DISubprogram(name: "process_area", scope: !3, file: !3, line: 430, type: !111, isLocal: true, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{!20, !58, !27}
!113 = !{!109, !114, !115, !116, !117, !118}
!114 = !DILocalVariable(name: "size", arg: 2, scope: !110, file: !3, line: 430, type: !27)
!115 = !DILocalVariable(name: "b", scope: !110, file: !3, line: 432, type: !20)
!116 = !DILocalVariable(name: "lb", scope: !110, file: !3, line: 432, type: !20)
