; ModuleID = '/root/.unikraft/libs/lwip/uknetdev.c'
source_filename = "/root/.unikraft/libs/lwip/uknetdev.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_netdev = type { i32 (%struct.uk_netdev*, %struct.uk_netdev_tx_queue*, %struct.uk_netbuf*)*, i32 (%struct.uk_netdev*, %struct.uk_netdev_rx_queue*, %struct.uk_netbuf**)*, %struct.uk_netdev_data*, %struct.uk_netdev_ops*, [1 x %struct.uk_netdev_rx_queue*], [1 x %struct.uk_netdev_tx_queue*], %struct.anon.4, %struct.uk_netdev_einfo*, i8* }
%struct.uk_netdev_tx_queue = type opaque
%struct.uk_netbuf = type { %struct.uk_netbuf*, %struct.uk_netbuf*, i8*, i16, %struct.__atomic, i8*, i8*, i64, void (%struct.uk_netbuf*)*, %struct.uk_alloc*, i8* }
%struct.__atomic = type { i32 }
%struct.uk_netdev_rx_queue = type opaque
%struct.uk_netdev_data = type { i32, %struct.uk_netdev_event_handler*, i16, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 258, type: !872, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "__uknetdev_input", scope: !3, file: !3, line: 223, type: !4, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, unit: !698, retainedNodes: !928)
!3 = !DIFile(filename: "/root/.unikraft/libs/lwip/uknetdev.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !27, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev", file: !8, line: 450, size: 640, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uknetdev/include/uk/netdev_core.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !115, !123, !536, !680, !682, !684, !690, !697}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "tx_one", scope: !7, file: !8, line: 452, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_tx_one_t", file: !8, line: 367, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !6, !16, !18}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_tx_queue", file: !8, line: 175, flags: DIFlagFwdDecl)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netbuf", file: !20, line: 104, size: 640, elements: !21)
!20 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uknetdev/include/uk/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !{!22, !23, !24, !26, !32, !40, !41, !42, !48, !53, !114}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !20, line: 105, baseType: !18, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !19, file: !20, line: 106, baseType: !18, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !20, line: 108, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !19, file: !20, line: 109, baseType: !27, size: 16, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 36, baseType: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !30, line: 57, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !19, file: !20, line: 110, baseType: !33, size: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic", file: !34, line: 253, baseType: !35)
!34 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 251, size: 32, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !35, file: !34, line: 252, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !34, line: 88, baseType: !39)
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !19, file: !20, line: 112, baseType: !25, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !19, file: !20, line: 114, baseType: !25, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !19, file: !20, line: 115, baseType: !43, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 40, baseType: !45)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !46, line: 129, baseType: !47)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !19, file: !20, line: 117, baseType: !49, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netbuf_dtor_t", file: !20, line: 51, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !18}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_a", scope: !19, file: !20, line: 118, baseType: !54, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !56, line: 77, size: 832, elements: !57)
!56 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !{!58, !65, !70, !75, !81, !83, !88, !89, !90, !95, !100, !105, !106, !107}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !55, file: !56, line: 79, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !56, line: 54, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!25, !54, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 58, baseType: !47)
!64 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !55, file: !56, line: 80, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !56, line: 56, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!25, !54, !63, !63}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !55, file: !56, line: 81, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !56, line: 62, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!25, !54, !25, !63}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !55, file: !56, line: 82, baseType: !76, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !56, line: 58, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!15, !54, !80, !63, !63}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !55, file: !56, line: 83, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !56, line: 60, baseType: !67)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !55, file: !56, line: 84, baseType: !84, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !56, line: 64, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !54, !25}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !55, file: !56, line: 87, baseType: !84, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !55, file: !56, line: 88, baseType: !59, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !55, file: !56, line: 92, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !56, line: 66, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!25, !54, !47}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !55, file: !56, line: 93, baseType: !96, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !56, line: 68, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !54, !25, !47}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !55, file: !56, line: 99, baseType: !101, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !56, line: 70, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!15, !54, !25, !63}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !56, line: 100, baseType: !63, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !56, line: 103, baseType: !54, size: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !55, file: !56, line: 104, baseType: !108, offset: 832)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, elements: !112)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !28, line: 20, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !30, line: 41, baseType: !111)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !{!113}
!113 = !DISubrange(count: -1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_b", scope: !19, file: !20, line: 119, baseType: !25, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rx_one", scope: !7, file: !8, line: 455, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rx_one_t", file: !8, line: 362, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!15, !6, !120, !122}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_rx_queue", file: !8, line: 176, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !7, file: !8, line: 458, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_data", file: !8, line: 426, size: 256, elements: !126)
!126 = !{!127, !134, !533, !535}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !8, line: 427, baseType: !128, size: 32)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_netdev_state", file: !8, line: 181, baseType: !39, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIEnumerator(name: "UK_NETDEV_INVALID", value: 0, isUnsigned: true)
!131 = !DIEnumerator(name: "UK_NETDEV_UNCONFIGURED", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "UK_NETDEV_CONFIGURED", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "UK_NETDEV_RUNNING", value: 3, isUnsigned: true)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_handler", scope: !125, file: !8, line: 429, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_event_handler", file: !8, line: 408, size: 640, elements: !137)
!137 = !{!138, !141, !142, !528, !529, !530, !531, !532}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !136, file: !8, line: 409, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_queue_event_t", file: !8, line: 235, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !136, file: !8, line: 410, baseType: !25, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !136, file: !8, line: 413, baseType: !143, size: 192, offset: 128)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !144, line: 51, size: 192, elements: !145)
!144 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !143, file: !144, line: 52, baseType: !147, size: 64)
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !143, file: !144, line: 53, baseType: !149, size: 128, offset: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !150, line: 42, size: 128, elements: !151)
!150 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!151 = !{!152, !526}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !149, file: !150, line: 42, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !150, line: 35, size: 192, elements: !155)
!155 = !{!156, !157, !522}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !154, file: !150, line: 36, baseType: !15, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !154, file: !150, line: 37, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !160, line: 59, size: 1024, elements: !161)
!160 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!161 = !{!162, !166, !167, !168, !169, !175, !178, !182, !184, !185, !273, !274, !275, !486}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !160, line: 60, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !159, file: !160, line: 61, baseType: !25, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !159, file: !160, line: 62, baseType: !25, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !159, file: !160, line: 63, baseType: !25, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !159, file: !160, line: 64, baseType: !170, size: 128, offset: 256)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !159, file: !160, line: 64, size: 128, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !170, file: !160, line: 64, baseType: !158, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !170, file: !160, line: 64, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !159, file: !160, line: 65, baseType: !176, size: 32, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 48, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !30, line: 79, baseType: !39)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !159, file: !160, line: 66, baseType: !179, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !180, line: 49, baseType: !181)
!180 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !34, line: 128, baseType: !147)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !159, file: !160, line: 67, baseType: !183, size: 8, offset: 512)
!183 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !159, file: !160, line: 68, baseType: !149, size: 128, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !159, file: !160, line: 69, baseType: !186, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !188, line: 90, size: 2176, elements: !189)
!188 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!189 = !{!190, !195, !212, !217, !219, !221, !226, !234, !239, !245, !246, !247, !252, !270, !271, !272}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !187, file: !188, line: 91, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !188, line: 68, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !186}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !187, file: !188, line: 93, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !188, line: 71, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!15, !186, !158, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !203, line: 62, baseType: !204)
!203 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !203, line: 55, size: 128, elements: !205)
!205 = !{!206, !207, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !204, file: !203, line: 57, baseType: !183, size: 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !204, file: !203, line: 59, baseType: !208, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !203, line: 53, baseType: !15)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !204, file: !203, line: 61, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !180, line: 48, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !34, line: 129, baseType: !47)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !187, file: !188, line: 94, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !188, line: 74, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !186, !158}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !187, file: !188, line: 95, baseType: !218, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !188, line: 76, baseType: !214)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !187, file: !188, line: 96, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !188, line: 78, baseType: !214)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !187, file: !188, line: 98, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !188, line: 81, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!15, !186, !158, !208}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !187, file: !188, line: 99, baseType: !227, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !188, line: 83, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!15, !186, !231, !233}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !187, file: !188, line: 100, baseType: !235, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !188, line: 85, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!15, !186, !158, !15}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !187, file: !188, line: 101, baseType: !240, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !188, line: 87, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!15, !186, !231, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !187, file: !188, line: 104, baseType: !183, size: 8, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !187, file: !188, line: 105, baseType: !159, size: 1024, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !187, file: !188, line: 106, baseType: !248, size: 128, offset: 1664)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !160, line: 93, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !248, file: !160, line: 93, baseType: !158, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !248, file: !160, line: 93, baseType: !174, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !187, file: !188, line: 107, baseType: !253, size: 192, offset: 1792)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !254, line: 59, size: 192, elements: !255)
!254 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!255 = !{!256, !261, !265}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !253, file: !254, line: 61, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !254, line: 51, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!25, !54, !47, !47}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !253, file: !254, line: 63, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !25}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !253, file: !254, line: 65, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !254, line: 56, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !25, !25}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !187, file: !188, line: 108, baseType: !54, size: 64, offset: 1984)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !188, line: 109, baseType: !186, size: 64, offset: 2048)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !187, file: !188, line: 110, baseType: !25, size: 64, offset: 2112)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !159, file: !160, line: 70, baseType: !25, size: 64, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !159, file: !160, line: 72, baseType: !15, size: 32, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !159, file: !160, line: 82, baseType: !276, size: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !278, line: 569, size: 14912, elements: !279)
!278 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!279 = !{!280, !281, !355, !356, !357, !358, !362, !363, !366, !367, !371, !383, !384, !385, !387, !388, !389, !450, !471, !472, !477, !484}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !277, file: !278, line: 571, baseType: !15, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !277, file: !278, line: 576, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !278, line: 287, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !278, line: 181, size: 1408, elements: !285)
!285 = !{!286, !289, !290, !291, !293, !294, !299, !300, !301, !307, !311, !316, !320, !321, !322, !323, !327, !331, !332, !333, !335, !336, !340, !354}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !284, file: !278, line: 182, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !284, file: !278, line: 183, baseType: !15, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !284, file: !278, line: 184, baseType: !15, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !284, file: !278, line: 185, baseType: !292, size: 16, offset: 128)
!292 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !284, file: !278, line: 186, baseType: !292, size: 16, offset: 144)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !284, file: !278, line: 187, baseType: !295, size: 128, offset: 192)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !278, line: 117, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !295, file: !278, line: 118, baseType: !287, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !295, file: !278, line: 119, baseType: !15, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !284, file: !278, line: 188, baseType: !15, size: 32, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !284, file: !278, line: 195, baseType: !25, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !284, file: !278, line: 197, baseType: !302, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !276, !25, !306, !15}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !46, line: 145, baseType: !147)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !284, file: !278, line: 199, baseType: !308, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!305, !276, !25, !163, !15}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !284, file: !278, line: 202, baseType: !312, size: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !276, !25, !315, !15}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !46, line: 114, baseType: !147)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !284, file: !278, line: 203, baseType: !317, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!15, !276, !25}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !284, file: !278, line: 206, baseType: !295, size: 128, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !284, file: !278, line: 207, baseType: !287, size: 64, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !284, file: !278, line: 208, baseType: !15, size: 32, offset: 896)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !284, file: !278, line: 211, baseType: !324, size: 24, offset: 928)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 24, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 3)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !284, file: !278, line: 212, baseType: !328, size: 8, offset: 952)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 1)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !284, file: !278, line: 215, baseType: !295, size: 128, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !284, file: !278, line: 218, baseType: !15, size: 32, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !284, file: !278, line: 219, baseType: !334, size: 64, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !46, line: 44, baseType: !147)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !284, file: !278, line: 222, baseType: !276, size: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !284, file: !278, line: 226, baseType: !337, size: 32, offset: 1280)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !46, line: 175, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !339, line: 12, baseType: !15)
!339 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !284, file: !278, line: 228, baseType: !341, size: 64, offset: 1312)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !46, line: 171, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 163, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !46, line: 165, baseType: !15, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !46, line: 170, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !46, line: 166, size: 32, elements: !347)
!347 = !{!348, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !346, file: !46, line: 168, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !64, line: 124, baseType: !39)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !346, file: !46, line: 169, baseType: !351, size: 32)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 32, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 4)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !284, file: !278, line: 229, baseType: !15, size: 32, offset: 1376)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !277, file: !278, line: 576, baseType: !282, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !277, file: !278, line: 576, baseType: !282, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !277, file: !278, line: 578, baseType: !15, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !277, file: !278, line: 579, baseType: !359, size: 200, offset: 288)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 200, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 25)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !277, file: !278, line: 582, baseType: !15, size: 32, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !277, file: !278, line: 583, baseType: !364, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !278, line: 40, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !277, file: !278, line: 585, baseType: !15, size: 32, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !277, file: !278, line: 587, baseType: !368, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !276}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !277, file: !278, line: 590, baseType: !372, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !278, line: 47, size: 256, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !373, file: !278, line: 49, baseType: !372, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !373, file: !278, line: 50, baseType: !15, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !373, file: !278, line: 50, baseType: !15, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !373, file: !278, line: 50, baseType: !15, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !373, file: !278, line: 50, baseType: !15, size: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !373, file: !278, line: 51, baseType: !381, size: 32, offset: 192)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 32, elements: !329)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !278, line: 25, baseType: !39)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !277, file: !278, line: 591, baseType: !15, size: 32, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !277, file: !278, line: 592, baseType: !372, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !277, file: !278, line: 593, baseType: !386, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !277, file: !278, line: 596, baseType: !15, size: 32, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !277, file: !278, line: 597, baseType: !306, size: 64, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !277, file: !278, line: 632, baseType: !390, size: 2880, offset: 1152)
!390 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !277, file: !278, line: 599, size: 2880, elements: !391)
!391 = !{!392, !441}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !390, file: !278, line: 622, baseType: !393, size: 1728)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !278, line: 601, size: 1728, elements: !394)
!394 = !{!395, !396, !397, !401, !413, !414, !416, !423, !424, !425, !426, !430, !434, !435, !436, !437, !438, !439, !440}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !393, file: !278, line: 603, baseType: !39, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !393, file: !278, line: 604, baseType: !306, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !393, file: !278, line: 605, baseType: !398, size: 208, offset: 128)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 208, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 26)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !393, file: !278, line: 606, baseType: !402, size: 288, offset: 352)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !278, line: 55, size: 288, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !402, file: !278, line: 57, baseType: !15, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !402, file: !278, line: 58, baseType: !15, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !402, file: !278, line: 59, baseType: !15, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !402, file: !278, line: 60, baseType: !15, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !402, file: !278, line: 61, baseType: !15, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !402, file: !278, line: 62, baseType: !15, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !402, file: !278, line: 63, baseType: !15, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !402, file: !278, line: 64, baseType: !15, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !402, file: !278, line: 65, baseType: !15, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !393, file: !278, line: 607, baseType: !15, size: 32, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !393, file: !278, line: 608, baseType: !415, size: 64, offset: 704)
!415 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !393, file: !278, line: 609, baseType: !417, size: 112, offset: 768)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !278, line: 319, size: 112, elements: !418)
!418 = !{!419, !421, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !417, file: !278, line: 320, baseType: !420, size: 48)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !325)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !417, file: !278, line: 321, baseType: !420, size: 48, offset: 48)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !417, file: !278, line: 322, baseType: !31, size: 16, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !393, file: !278, line: 610, baseType: !341, size: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !393, file: !278, line: 611, baseType: !341, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !393, file: !278, line: 612, baseType: !341, size: 64, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !393, file: !278, line: 613, baseType: !427, size: 64, offset: 1088)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !393, file: !278, line: 614, baseType: !431, size: 192, offset: 1152)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 192, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 24)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !393, file: !278, line: 615, baseType: !15, size: 32, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !393, file: !278, line: 616, baseType: !341, size: 64, offset: 1376)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !393, file: !278, line: 617, baseType: !341, size: 64, offset: 1440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !393, file: !278, line: 618, baseType: !341, size: 64, offset: 1504)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !393, file: !278, line: 619, baseType: !341, size: 64, offset: 1568)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !393, file: !278, line: 620, baseType: !341, size: 64, offset: 1632)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !393, file: !278, line: 621, baseType: !15, size: 32, offset: 1696)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !390, file: !278, line: 631, baseType: !442, size: 2880)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !278, line: 626, size: 2880, elements: !443)
!443 = !{!444, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !442, file: !278, line: 629, baseType: !445, size: 1920)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 1920, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 30)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !442, file: !278, line: 630, baseType: !449, size: 960, offset: 1920)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 960, elements: !446)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !277, file: !278, line: 636, baseType: !451, size: 64, offset: 4032)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !278, line: 93, size: 6336, elements: !453)
!453 = !{!454, !455, !456, !463}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !452, file: !278, line: 94, baseType: !451, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !452, file: !278, line: 95, baseType: !15, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !452, file: !278, line: 97, baseType: !457, size: 2048, offset: 128)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 2048, elements: !461)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null}
!461 = !{!462}
!462 = !DISubrange(count: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !452, file: !278, line: 98, baseType: !464, size: 4160, offset: 2176)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !278, line: 74, size: 4160, elements: !465)
!465 = !{!466, !468, !469, !470}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !464, file: !278, line: 75, baseType: !467, size: 2048)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !461)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !464, file: !278, line: 76, baseType: !467, size: 2048, offset: 2048)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !464, file: !278, line: 78, baseType: !382, size: 32, offset: 4096)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !464, file: !278, line: 81, baseType: !382, size: 32, offset: 4128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !277, file: !278, line: 637, baseType: !452, size: 6336, offset: 4096)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !277, file: !278, line: 641, baseType: !473, size: 64, offset: 10432)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !15}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !277, file: !278, line: 646, baseType: !478, size: 192, offset: 10496)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !278, line: 291, size: 192, elements: !479)
!479 = !{!480, !482, !483}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !478, file: !278, line: 293, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !478, file: !278, line: 294, baseType: !15, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !478, file: !278, line: 295, baseType: !282, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !277, file: !278, line: 648, baseType: !485, size: 4224, offset: 10688)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 4224, elements: !325)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !159, file: !160, line: 85, baseType: !487, size: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !489, line: 114, size: 640, elements: !490)
!489 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!490 = !{!491, !495, !496, !503, !521}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !488, file: !489, line: 116, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !493, line: 64, baseType: !494)
!493 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !493, line: 63, baseType: !47)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !488, file: !489, line: 118, baseType: !492, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !488, file: !489, line: 120, baseType: !497, size: 128, offset: 128)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !498, line: 51, size: 128, elements: !499)
!498 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!499 = !{!500, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !498, line: 52, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !497, file: !498, line: 53, baseType: !501, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !488, file: !489, line: 122, baseType: !504, size: 256, offset: 256)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !489, line: 98, size: 256, elements: !505)
!505 = !{!506, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !504, file: !489, line: 107, baseType: !507, size: 32)
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !489, line: 92, baseType: !39, size: 32, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!510 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!511 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !504, file: !489, line: 109, baseType: !492, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !504, file: !489, line: 111, baseType: !514, size: 96, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !493, line: 72, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 68, size: 96, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !515, file: !493, line: 69, baseType: !15, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !515, file: !493, line: 70, baseType: !15, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !515, file: !493, line: 71, baseType: !520, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !493, line: 61, baseType: !15)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !488, file: !489, line: 124, baseType: !497, size: 128, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !154, file: !150, line: 38, baseType: !523, size: 64, offset: 128)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !154, file: !150, line: 38, size: 64, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !523, file: !150, line: 38, baseType: !153, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !149, file: !150, line: 42, baseType: !527, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !136, file: !8, line: 414, baseType: !6, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "queue_id", scope: !136, file: !8, line: 415, baseType: !27, size: 16, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher", scope: !136, file: !8, line: 416, baseType: !158, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher_name", scope: !136, file: !8, line: 417, baseType: !306, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher_s", scope: !136, file: !8, line: 418, baseType: !186, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !8, line: 431, baseType: !534, size: 16, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "drv_name", scope: !125, file: !8, line: 432, baseType: !163, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !7, file: !8, line: 461, baseType: !537, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_ops", file: !8, line: 374, size: 1024, elements: !540)
!540 = !{!541, !546, !548, !563, !568, !573, !578, !583, !588, !604, !616, !618, !637, !648, !657, !675}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_intr_enable", scope: !539, file: !8, line: 376, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_intr_enable_t", file: !8, line: 341, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!15, !6, !120}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_intr_disable", scope: !539, file: !8, line: 377, baseType: !547, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_intr_disable_t", file: !8, line: 345, baseType: !543)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_get", scope: !539, file: !8, line: 380, baseType: !549, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_hwaddr_get_t", file: !8, line: 320, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !6}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_hwaddr", file: !8, line: 122, size: 48, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "addr_bytes", scope: !555, file: !8, line: 123, baseType: !558, size: 48)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 48, elements: !561)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !28, line: 24, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !30, line: 43, baseType: !288)
!561 = !{!562}
!562 = !DISubrange(count: 6)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_set", scope: !539, file: !8, line: 381, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_hwaddr_set_t", file: !8, line: 324, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!15, !6, !553}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_get", scope: !539, file: !8, line: 384, baseType: !569, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_mtu_get_t", file: !8, line: 335, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!27, !6}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_set", scope: !539, file: !8, line: 385, baseType: !574, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_mtu_set_t", file: !8, line: 338, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!15, !6, !27}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "promiscuous_set", scope: !539, file: !8, line: 388, baseType: !579, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_promiscuous_set_t", file: !8, line: 331, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!15, !6, !39}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "promiscuous_get", scope: !539, file: !8, line: 389, baseType: !584, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_promiscuous_get_t", file: !8, line: 328, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!39, !6}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "info_get", scope: !539, file: !8, line: 392, baseType: !589, size: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_info_get_t", file: !8, line: 283, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !6, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_info", file: !8, line: 141, size: 160, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_rx_queues", scope: !594, file: !8, line: 142, baseType: !27, size: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_queues", scope: !594, file: !8, line: 143, baseType: !27, size: 16, offset: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "in_queue_pairs", scope: !594, file: !8, line: 144, baseType: !15, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !594, file: !8, line: 145, baseType: !27, size: 16, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nb_encap_tx", scope: !594, file: !8, line: 146, baseType: !27, size: 16, offset: 80)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nb_encap_rx", scope: !594, file: !8, line: 147, baseType: !27, size: 16, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ioalign", scope: !594, file: !8, line: 148, baseType: !27, size: 16, offset: 112)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !594, file: !8, line: 149, baseType: !176, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "txq_info_get", scope: !539, file: !8, line: 393, baseType: !605, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_txq_info_get_t", file: !8, line: 303, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!15, !6, !27, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_queue_info", file: !8, line: 155, size: 96, elements: !611)
!611 = !{!612, !613, !614, !615}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nb_max", scope: !610, file: !8, line: 156, baseType: !27, size: 16)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nb_min", scope: !610, file: !8, line: 157, baseType: !27, size: 16, offset: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nb_align", scope: !610, file: !8, line: 158, baseType: !27, size: 16, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nb_is_power_of_two", scope: !610, file: !8, line: 159, baseType: !15, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_info_get", scope: !539, file: !8, line: 394, baseType: !617, size: 64, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_info_get_t", file: !8, line: 297, baseType: !606)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "einfo_get", scope: !539, file: !8, line: 395, baseType: !619, size: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_einfo_get_t", file: !8, line: 287, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!623, !6, !625}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_netdev_einfo_type", file: !8, line: 205, baseType: !39, size: 32, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!627 = !DIEnumerator(name: "UK_NETDEV_IPV4_ADDR_NINT16", value: 0, isUnsigned: true)
!628 = !DIEnumerator(name: "UK_NETDEV_IPV4_ADDR_STR", value: 1, isUnsigned: true)
!629 = !DIEnumerator(name: "UK_NETDEV_IPV4_MASK_NINT16", value: 2, isUnsigned: true)
!630 = !DIEnumerator(name: "UK_NETDEV_IPV4_MASK_STR", value: 3, isUnsigned: true)
!631 = !DIEnumerator(name: "UK_NETDEV_IPV4_GW_NINT16", value: 4, isUnsigned: true)
!632 = !DIEnumerator(name: "UK_NETDEV_IPV4_GW_STR", value: 5, isUnsigned: true)
!633 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS0_NINT16", value: 6, isUnsigned: true)
!634 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS0_STR", value: 7, isUnsigned: true)
!635 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS1_NINT16", value: 8, isUnsigned: true)
!636 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS1_STR", value: 9, isUnsigned: true)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !539, file: !8, line: 398, baseType: !638, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_configure_t", file: !8, line: 291, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!15, !6, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_conf", file: !8, line: 165, size: 32, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rx_queues", scope: !644, file: !8, line: 166, baseType: !27, size: 16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nb_tx_queues", scope: !644, file: !8, line: 167, baseType: !27, size: 16, offset: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "txq_configure", scope: !539, file: !8, line: 399, baseType: !649, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_txq_configure_t", file: !8, line: 307, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!16, !6, !27, !27, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_txqueue_conf", file: !8, line: 276, size: 64, elements: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !654, file: !8, line: 277, baseType: !54, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_configure", scope: !539, file: !8, line: 400, baseType: !658, size: 64, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_configure_t", file: !8, line: 312, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!120, !6, !27, !27, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_rxqueue_conf", file: !8, line: 260, size: 384, elements: !664)
!664 = !{!665, !666, !667, !668, !673, !674}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !663, file: !8, line: 261, baseType: !139, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "callback_cookie", scope: !663, file: !8, line: 262, baseType: !25, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !663, file: !8, line: 264, baseType: !54, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_rxpkts", scope: !663, file: !8, line: 266, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_alloc_rxpkts", file: !8, line: 253, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!27, !25, !122, !27}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_rxpkts_argp", scope: !663, file: !8, line: 267, baseType: !25, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !663, file: !8, line: 269, baseType: !186, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !539, file: !8, line: 401, baseType: !676, size: 64, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_start_t", file: !8, line: 317, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!15, !6}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_rx_queue", scope: !7, file: !8, line: 464, baseType: !681, size: 64, offset: 256)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !329)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_tx_queue", scope: !7, file: !8, line: 465, baseType: !683, size: 64, offset: 320)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !329)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_list", scope: !7, file: !8, line: 467, baseType: !685, size: 128, offset: 384)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !7, file: !8, line: 467, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !685, file: !8, line: 467, baseType: !6, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !685, file: !8, line: 467, baseType: !689, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_einfo", scope: !7, file: !8, line: 470, baseType: !691, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_einfo", file: !8, line: 435, size: 192, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_addr", scope: !692, file: !8, line: 436, baseType: !163, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_net_mask", scope: !692, file: !8, line: 437, baseType: !163, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_gw_addr", scope: !692, file: !8, line: 438, baseType: !163, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_pad", scope: !7, file: !8, line: 473, baseType: !306, size: 64, offset: 576)
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !699, retainedTypes: !732, globals: !869)
!699 = !{!128, !507, !625, !700, !705, !712}
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !701, line: 156, baseType: !39, size: 32, elements: !702)
!701 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!702 = !{!703, !704}
!703 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!704 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !706, line: 68, baseType: !39, size: 32, elements: !707)
!706 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!707 = !{!708, !709, !710, !711}
!708 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!709 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!710 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!711 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !713, line: 53, baseType: !15, size: 32, elements: !714)
!713 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!715 = !DIEnumerator(name: "ERR_OK", value: 0)
!716 = !DIEnumerator(name: "ERR_MEM", value: -1)
!717 = !DIEnumerator(name: "ERR_BUF", value: -2)
!718 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!719 = !DIEnumerator(name: "ERR_RTE", value: -4)
!720 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!721 = !DIEnumerator(name: "ERR_VAL", value: -6)
!722 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!723 = !DIEnumerator(name: "ERR_USE", value: -8)
!724 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!725 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!726 = !DIEnumerator(name: "ERR_CONN", value: -11)
!727 = !DIEnumerator(name: "ERR_IF", value: -12)
!728 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!729 = !DIEnumerator(name: "ERR_RST", value: -14)
!730 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!731 = !DIEnumerator(name: "ERR_ARG", value: -16)
!732 = !{!733, !122, !839, !47, !841, !15, !6, !689, !843, !662, !653, !25, !755, !844, !846, !244, !847, !174, !861, !43}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !701, line: 260, size: 2240, elements: !735)
!735 = !{!736, !737, !763, !764, !765, !767, !769, !771, !772, !792, !799, !804, !811, !816, !817, !818, !820, !821, !822, !823, !825, !826, !827, !831, !832, !833, !834}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !701, line: 263, baseType: !733, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !734, file: !701, line: 268, baseType: !738, size: 192, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !739, line: 76, baseType: !740)
!739 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !739, line: 69, size: 192, elements: !741)
!741 = !{!742, !762}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !740, file: !739, line: 73, baseType: !743, size: 160)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !740, file: !739, line: 70, size: 160, elements: !744)
!744 = !{!745, !756}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !743, file: !739, line: 71, baseType: !746, size: 160)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !747, line: 67, baseType: !748)
!747 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !747, line: 59, size: 160, elements: !749)
!749 = !{!750, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !748, file: !747, line: 60, baseType: !751, size: 128)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 128, elements: !352)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !753, line: 129, baseType: !176)
!753 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!754 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !748, file: !747, line: 62, baseType: !755, size: 8, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !753, line: 125, baseType: !559)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !743, file: !739, line: 72, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !758, line: 57, baseType: !759)
!758 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !758, line: 51, size: 32, elements: !760)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !759, file: !758, line: 52, baseType: !752, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !740, file: !739, line: 75, baseType: !755, size: 8, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !734, file: !701, line: 269, baseType: !738, size: 192, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !734, file: !701, line: 270, baseType: !738, size: 192, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !734, file: !701, line: 274, baseType: !766, size: 576, offset: 640)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 576, elements: !325)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !734, file: !701, line: 277, baseType: !768, size: 24, offset: 1216)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 24, elements: !325)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !734, file: !701, line: 282, baseType: !770, size: 96, offset: 1248)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 96, elements: !325)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !734, file: !701, line: 283, baseType: !770, size: 96, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !734, file: !701, line: 288, baseType: !773, size: 64, offset: 1472)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !701, line: 178, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !779, !733}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !713, line: 96, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !753, line: 126, baseType: !109)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !781, line: 186, size: 192, elements: !782)
!781 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!782 = !{!783, !784, !785, !787, !788, !789, !790, !791}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !780, file: !781, line: 188, baseType: !779, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !780, file: !781, line: 191, baseType: !25, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !780, file: !781, line: 200, baseType: !786, size: 16, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !753, line: 127, baseType: !27)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !780, file: !781, line: 203, baseType: !786, size: 16, offset: 144)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !780, file: !781, line: 208, baseType: !755, size: 8, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !780, file: !781, line: 211, baseType: !755, size: 8, offset: 168)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !780, file: !781, line: 218, baseType: !755, size: 8, offset: 176)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !780, file: !781, line: 221, baseType: !755, size: 8, offset: 184)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !734, file: !701, line: 294, baseType: !793, size: 64, offset: 1536)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !701, line: 189, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!777, !733, !779, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !734, file: !701, line: 299, baseType: !800, size: 64, offset: 1600)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !701, line: 212, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!777, !733, !779}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !734, file: !701, line: 305, baseType: !805, size: 64, offset: 1664)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !701, line: 202, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!777, !733, !779, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !734, file: !701, line: 310, baseType: !812, size: 64, offset: 1728)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !701, line: 214, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !733}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !734, file: !701, line: 319, baseType: !812, size: 64, offset: 1792)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !734, file: !701, line: 323, baseType: !25, size: 64, offset: 1856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !734, file: !701, line: 325, baseType: !819, size: 64, offset: 1920)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !329)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !734, file: !701, line: 332, baseType: !786, size: 16, offset: 1984)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !734, file: !701, line: 335, baseType: !786, size: 16, offset: 2000)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !734, file: !701, line: 338, baseType: !786, size: 16, offset: 2016)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !734, file: !701, line: 341, baseType: !824, size: 48, offset: 2032)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 48, elements: !561)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !734, file: !701, line: 343, baseType: !755, size: 8, offset: 2080)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !701, line: 345, baseType: !755, size: 8, offset: 2088)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !701, line: 347, baseType: !828, size: 16, offset: 2096)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 16, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 2)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !734, file: !701, line: 350, baseType: !755, size: 8, offset: 2112)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !734, file: !701, line: 353, baseType: !755, size: 8, offset: 2120)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !734, file: !701, line: 357, baseType: !755, size: 8, offset: 2128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !734, file: !701, line: 377, baseType: !835, size: 64, offset: 2176)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !701, line: 222, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!777, !733, !809, !700}
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !28, line: 82, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !30, line: 232, baseType: !47)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !28, line: 60, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !30, line: 105, baseType: !47)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sptr", file: !34, line: 186, baseType: !181)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_netbuf_pbuf", file: !849, line: 50, size: 320, elements: !850)
!849 = !DIFile(filename: "/root/.unikraft/libs/lwip/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!850 = !{!851, !860}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf_custom", scope: !848, file: !849, line: 51, baseType: !852, size: 256)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf_custom", file: !781, line: 242, size: 256, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf", scope: !852, file: !781, line: 244, baseType: !780, size: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "custom_free_function", scope: !852, file: !781, line: 246, baseType: !856, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "pbuf_free_custom_fn", file: !781, line: 239, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !779}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "netbuf", scope: !848, file: !849, line: 52, baseType: !18, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwip_netdev_data", file: !3, line: 82, size: 448, elements: !863)
!863 = !{!864, !865, !866, !867, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_a", scope: !862, file: !3, line: 90, baseType: !54, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dev_info", scope: !862, file: !3, line: 91, baseType: !594, size: 160, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "poll_thread", scope: !862, file: !3, line: 93, baseType: !158, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_name", scope: !862, file: !3, line: 94, baseType: !306, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !862, file: !3, line: 95, baseType: !186, size: 64, offset: 384)
!869 = !{!0, !870, !875, !880, !882, !896, !915, !920, !926}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 258, type: !872, isLocal: true, isDefinition: true)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 392, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 49)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 303, type: !877, isLocal: true, isDefinition: true)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 368, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 46)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 303, type: !877, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "pethernet_input", scope: !884, file: !3, line: 766, type: !623, isLocal: true, isDefinition: true)
!884 = distinct !DISubprogram(name: "uknetdev_addif", scope: !3, file: !3, line: 745, type: !885, isLocal: false, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: true, unit: !698, retainedNodes: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{!733, !6, !797, !797, !797}
!887 = !{!888, !889, !890, !891, !892, !893, !894}
!888 = !DILocalVariable(name: "n", arg: 1, scope: !884, file: !3, line: 745, type: !6)
!889 = !DILocalVariable(name: "ipaddr", arg: 2, scope: !884, file: !3, line: 748, type: !797)
!890 = !DILocalVariable(name: "netmask", arg: 3, scope: !884, file: !3, line: 749, type: !797)
!891 = !DILocalVariable(name: "gw", arg: 4, scope: !884, file: !3, line: 750, type: !797)
!892 = !DILocalVariable(name: "nf", scope: !884, file: !3, line: 767, type: !733)
!893 = !DILocalVariable(name: "ret", scope: !884, file: !3, line: 768, type: !733)
!894 = !DILocalVariable(name: "__var", scope: !895, file: !3, line: 779, type: !623)
!895 = distinct !DILexicalBlock(scope: !884, file: !3, line: 779, column: 22)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "__str", scope: !898, file: !899, line: 198, type: !427, isLocal: true, isDefinition: true)
!898 = distinct !DISubprogram(name: "uk_pr_crit", scope: !899, file: !899, line: 194, type: !900, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !698, retainedNodes: !902)
!899 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!900 = !DISubroutineType(types: !901)
!901 = !{null, !163, null}
!902 = !{!903, !904}
!903 = !DILocalVariable(name: "fmt", arg: 1, scope: !898, file: !899, line: 194, type: !163)
!904 = !DILocalVariable(name: "argp", scope: !898, file: !899, line: 196, type: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !906, line: 32, baseType: !907)
!906 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !908)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 192, elements: !329)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !910)
!910 = !{!911, !912, !913, !914}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !909, file: !3, line: 196, baseType: !39, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !909, file: !3, line: 196, baseType: !39, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !909, file: !3, line: 196, baseType: !25, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !909, file: !3, line: 196, baseType: !25, size: 64, offset: 128)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "__str", scope: !898, file: !899, line: 198, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 88, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 11)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__str", scope: !922, file: !899, line: 190, type: !427, isLocal: true, isDefinition: true)
!922 = distinct !DISubprogram(name: "uk_pr_err", scope: !899, file: !899, line: 186, type: !900, isLocal: true, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, unit: !698, retainedNodes: !923)
!923 = !{!924, !925}
!924 = !DILocalVariable(name: "fmt", arg: 1, scope: !922, file: !899, line: 186, type: !163)
!925 = !DILocalVariable(name: "argp", scope: !922, file: !899, line: 188, type: !905)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "__str", scope: !922, file: !899, line: 190, type: !917, isLocal: true, isDefinition: true)
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !945, !946, !947, !955, !956, !957, !958, !968, !974, !975, !976}
!929 = !DILocalVariable(name: "dev", arg: 1, scope: !2, file: !3, line: 223, type: !6)
!930 = !DILocalVariable(name: "queue_id", arg: 2, scope: !2, file: !3, line: 223, type: !27)
!931 = !DILocalVariable(name: "argp", arg: 3, scope: !2, file: !3, line: 223, type: !25)
!932 = !DILocalVariable(name: "nf", scope: !2, file: !3, line: 224, type: !733)
!933 = !DILocalVariable(name: "nb", scope: !2, file: !3, line: 225, type: !18)
!934 = !DILocalVariable(name: "_dss_nb", scope: !2, file: !3, line: 226, type: !122)
!935 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 227, type: !779)
!936 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 228, type: !777)
!937 = !DILocalVariable(name: "ret", scope: !2, file: !3, line: 229, type: !15)
!938 = !DILocalVariable(name: "tid", scope: !939, file: !3, line: 238, type: !176)
!939 = distinct !DILexicalBlock(scope: !940, file: !3, line: 238, column: 3)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 238, column: 3)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 238, column: 3)
!942 = distinct !DILexicalBlock(scope: !943, file: !3, line: 238, column: 3)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 238, column: 3)
!944 = distinct !DILexicalBlock(scope: !2, file: !3, line: 237, column: 5)
!945 = !DILocalVariable(name: "_ret", scope: !939, file: !3, line: 238, type: !841)
!946 = !DILocalVariable(name: "_arg3", scope: !939, file: !3, line: 238, type: !841)
!947 = !DILocalVariable(name: "tid", scope: !948, file: !3, line: 258, type: !176)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 258, column: 4)
!949 = distinct !DILexicalBlock(scope: !950, file: !3, line: 258, column: 4)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 258, column: 4)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 258, column: 4)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 258, column: 4)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 252, column: 26)
!954 = distinct !DILexicalBlock(scope: !944, file: !3, line: 252, column: 7)
!955 = !DILocalVariable(name: "_arg3", scope: !948, file: !3, line: 258, type: !841)
!956 = !DILocalVariable(name: "_arg4", scope: !948, file: !3, line: 258, type: !841)
!957 = !DILocalVariable(name: "_arg5", scope: !948, file: !3, line: 258, type: !841)
!958 = !DILocalVariable(name: "tid", scope: !959, file: !3, line: 293, type: !176)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 293, column: 5)
!960 = distinct !DILexicalBlock(scope: !961, file: !3, line: 293, column: 5)
