; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vfprintf.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vfprintf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "blanks", scope: !2, file: !3, line: 739, type: !315, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_svfiprintf_r", scope: !3, file: !3, line: 663, type: !4, isLocal: false, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: true, unit: !296, retainedNodes: !318)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vfprintf.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !286, !46, !289}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !9, line: 569, size: 14912, elements: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !{!11, !12, !94, !95, !96, !97, !101, !102, !167, !168, !172, !184, !185, !186, !188, !189, !190, !252, !271, !272, !277, !284}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !8, file: !9, line: 571, baseType: !6, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !8, file: !9, line: 576, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !9, line: 287, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 181, size: 1408, elements: !16)
!16 = !{!17, !20, !21, !22, !24, !25, !30, !31, !33, !42, !48, !53, !57, !58, !59, !60, !64, !68, !69, !70, !72, !73, !77, !93}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !15, file: !9, line: 182, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !15, file: !9, line: 183, baseType: !6, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !15, file: !9, line: 184, baseType: !6, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !9, line: 185, baseType: !23, size: 16, offset: 128)
!23 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !15, file: !9, line: 186, baseType: !23, size: 16, offset: 144)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !15, file: !9, line: 187, baseType: !26, size: 128, offset: 192)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 117, size: 128, elements: !27)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !26, file: !9, line: 118, baseType: !18, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !26, file: !9, line: 119, baseType: !6, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !15, file: !9, line: 188, baseType: !6, size: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !15, file: !9, line: 195, baseType: !32, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !15, file: !9, line: 197, baseType: !34, size: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !7, !32, !40, !6}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !38, line: 145, baseType: !39)
!38 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!39 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !15, file: !9, line: 199, baseType: !43, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!37, !7, !32, !46, !6}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !15, file: !9, line: 202, baseType: !49, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !7, !32, !52, !6}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !38, line: 114, baseType: !39)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !15, file: !9, line: 203, baseType: !54, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!6, !7, !32}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !15, file: !9, line: 206, baseType: !26, size: 128, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !15, file: !9, line: 207, baseType: !18, size: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !15, file: !9, line: 208, baseType: !6, size: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !15, file: !9, line: 211, baseType: !61, size: 24, offset: 928)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 3)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !15, file: !9, line: 212, baseType: !65, size: 8, offset: 952)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 1)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !15, file: !9, line: 215, baseType: !26, size: 128, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !15, file: !9, line: 218, baseType: !6, size: 32, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !9, line: 219, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !38, line: 44, baseType: !39)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !15, file: !9, line: 222, baseType: !7, size: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !9, line: 226, baseType: !74, size: 32, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !38, line: 175, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !76, line: 12, baseType: !6)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !15, file: !9, line: 228, baseType: !78, size: 64, offset: 1312)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !38, line: 171, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 163, size: 64, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !79, file: !38, line: 165, baseType: !6, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !79, file: !38, line: 170, baseType: !83, size: 32, offset: 32)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !79, file: !38, line: 166, size: 32, elements: !84)
!84 = !{!85, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !83, file: !38, line: 168, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !87, line: 124, baseType: !88)
!87 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !83, file: !38, line: 169, baseType: !90, size: 32)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !9, line: 229, baseType: !6, size: 32, offset: 1376)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !8, file: !9, line: 576, baseType: !13, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !8, file: !9, line: 576, baseType: !13, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !8, file: !9, line: 578, baseType: !6, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !8, file: !9, line: 579, baseType: !98, size: 200, offset: 288)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 200, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 25)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !8, file: !9, line: 582, baseType: !6, size: 32, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !8, file: !9, line: 583, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !105, line: 178, size: 3392, elements: !106)
!105 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/../stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!106 = !{!107, !112, !120, !129, !130, !131, !159, !163, !166}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !104, file: !105, line: 180, baseType: !108, size: 1792)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1792, elements: !109)
!109 = !{!110, !111}
!110 = !DISubrange(count: 7)
!111 = !DISubrange(count: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !104, file: !105, line: 181, baseType: !113, size: 64, offset: 1792)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!6, !7, !40, !116, !117}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !87, line: 83, baseType: !6)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !119, line: 86, baseType: !78)
!119 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !104, file: !105, line: 183, baseType: !121, size: 64, offset: 1856)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!6, !7, !124, !46, !125, !117}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !126, line: 40, baseType: !127)
!126 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !38, line: 129, baseType: !128)
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !104, file: !105, line: 185, baseType: !6, size: 32, offset: 1920)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !104, file: !105, line: 186, baseType: !40, size: 64, offset: 1984)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !104, file: !105, line: 187, baseType: !132, size: 768, offset: 2048)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !133, line: 42, size: 768, elements: !134)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !132, file: !133, line: 44, baseType: !40, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !132, file: !133, line: 45, baseType: !40, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !132, file: !133, line: 46, baseType: !40, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !132, file: !133, line: 47, baseType: !40, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !132, file: !133, line: 48, baseType: !40, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !132, file: !133, line: 49, baseType: !40, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !132, file: !133, line: 50, baseType: !40, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !132, file: !133, line: 51, baseType: !40, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !132, file: !133, line: 52, baseType: !40, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !132, file: !133, line: 53, baseType: !40, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !132, file: !133, line: 54, baseType: !41, size: 8, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !132, file: !133, line: 55, baseType: !41, size: 8, offset: 648)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !132, file: !133, line: 56, baseType: !41, size: 8, offset: 656)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !132, file: !133, line: 57, baseType: !41, size: 8, offset: 664)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !132, file: !133, line: 58, baseType: !41, size: 8, offset: 672)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !132, file: !133, line: 59, baseType: !41, size: 8, offset: 680)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !132, file: !133, line: 60, baseType: !41, size: 8, offset: 688)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !132, file: !133, line: 61, baseType: !41, size: 8, offset: 696)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !132, file: !133, line: 62, baseType: !41, size: 8, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !132, file: !133, line: 63, baseType: !41, size: 8, offset: 712)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !132, file: !133, line: 64, baseType: !41, size: 8, offset: 720)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !132, file: !133, line: 65, baseType: !41, size: 8, offset: 728)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !132, file: !133, line: 66, baseType: !41, size: 8, offset: 736)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !132, file: !133, line: 67, baseType: !41, size: 8, offset: 744)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !104, file: !105, line: 189, baseType: !160, size: 16, offset: 2816)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 16, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 2)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !104, file: !105, line: 190, baseType: !164, size: 256, offset: 2832)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !165)
!165 = !{!111}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !104, file: !105, line: 191, baseType: !164, size: 256, offset: 3088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !8, file: !9, line: 585, baseType: !6, size: 32, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !8, file: !9, line: 587, baseType: !169, size: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !7}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !8, file: !9, line: 590, baseType: !173, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !9, line: 47, size: 256, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !174, file: !9, line: 49, baseType: !173, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !174, file: !9, line: 51, baseType: !182, size: 32, offset: 192)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 32, elements: !66)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !9, line: 25, baseType: !88)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !8, file: !9, line: 591, baseType: !6, size: 32, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !8, file: !9, line: 592, baseType: !173, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !8, file: !9, line: 593, baseType: !187, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !8, file: !9, line: 596, baseType: !6, size: 32, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !8, file: !9, line: 597, baseType: !40, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !8, file: !9, line: 632, baseType: !191, size: 2880, offset: 1152)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !9, line: 599, size: 2880, elements: !192)
!192 = !{!193, !243}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !191, file: !9, line: 622, baseType: !194, size: 1728)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !9, line: 601, size: 1728, elements: !195)
!195 = !{!196, !197, !198, !202, !214, !215, !217, !225, !226, !227, !228, !232, !236, !237, !238, !239, !240, !241, !242}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !194, file: !9, line: 603, baseType: !88, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !194, file: !9, line: 604, baseType: !40, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !194, file: !9, line: 605, baseType: !199, size: 208, offset: 128)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 208, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 26)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !194, file: !9, line: 606, baseType: !203, size: 288, offset: 352)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !9, line: 55, size: 288, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !203, file: !9, line: 57, baseType: !6, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !203, file: !9, line: 58, baseType: !6, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !203, file: !9, line: 59, baseType: !6, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !203, file: !9, line: 60, baseType: !6, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !203, file: !9, line: 61, baseType: !6, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !203, file: !9, line: 62, baseType: !6, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !203, file: !9, line: 63, baseType: !6, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !203, file: !9, line: 64, baseType: !6, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !203, file: !9, line: 65, baseType: !6, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !194, file: !9, line: 607, baseType: !6, size: 32, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !194, file: !9, line: 608, baseType: !216, size: 64, offset: 704)
!216 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !194, file: !9, line: 609, baseType: !218, size: 112, offset: 768)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !9, line: 319, size: 112, elements: !219)
!219 = !{!220, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !218, file: !9, line: 320, baseType: !221, size: 48)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 48, elements: !62)
!222 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !218, file: !9, line: 321, baseType: !221, size: 48, offset: 48)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !218, file: !9, line: 322, baseType: !222, size: 16, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !194, file: !9, line: 610, baseType: !78, size: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !194, file: !9, line: 611, baseType: !78, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !194, file: !9, line: 612, baseType: !78, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !194, file: !9, line: 613, baseType: !229, size: 64, offset: 1088)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !194, file: !9, line: 614, baseType: !233, size: 192, offset: 1152)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 24)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !194, file: !9, line: 615, baseType: !6, size: 32, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !194, file: !9, line: 616, baseType: !78, size: 64, offset: 1376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !194, file: !9, line: 617, baseType: !78, size: 64, offset: 1440)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !194, file: !9, line: 618, baseType: !78, size: 64, offset: 1504)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !194, file: !9, line: 619, baseType: !78, size: 64, offset: 1568)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !194, file: !9, line: 620, baseType: !78, size: 64, offset: 1632)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !194, file: !9, line: 621, baseType: !6, size: 32, offset: 1696)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !191, file: !9, line: 631, baseType: !244, size: 2880)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !9, line: 626, size: 2880, elements: !245)
!245 = !{!246, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !244, file: !9, line: 629, baseType: !247, size: 1920)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1920, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 30)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !244, file: !9, line: 630, baseType: !251, size: 960, offset: 1920)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 960, elements: !248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !8, file: !9, line: 636, baseType: !253, size: 64, offset: 4032)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !9, line: 93, size: 6336, elements: !255)
!255 = !{!256, !257, !258, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !254, file: !9, line: 94, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !254, file: !9, line: 95, baseType: !6, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !254, file: !9, line: 97, baseType: !259, size: 2048, offset: 128)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 2048, elements: !165)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !254, file: !9, line: 98, baseType: !264, size: 4160, offset: 2176)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !9, line: 74, size: 4160, elements: !265)
!265 = !{!266, !268, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !264, file: !9, line: 75, baseType: !267, size: 2048)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !165)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !264, file: !9, line: 76, baseType: !267, size: 2048, offset: 2048)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !264, file: !9, line: 78, baseType: !183, size: 32, offset: 4096)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !264, file: !9, line: 81, baseType: !183, size: 32, offset: 4128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !8, file: !9, line: 637, baseType: !254, size: 6336, offset: 4096)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !8, file: !9, line: 641, baseType: !273, size: 64, offset: 10432)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !6}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !8, file: !9, line: 646, baseType: !278, size: 192, offset: 10496)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !9, line: 291, size: 192, elements: !279)
!279 = !{!280, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !278, file: !9, line: 293, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !278, file: !9, line: 294, baseType: !6, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !278, file: !9, line: 295, baseType: !13, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !8, file: !9, line: 648, baseType: !285, size: 4224, offset: 10688)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 4224, elements: !62)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !288, line: 66, baseType: !14)
!288 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 359, size: 192, elements: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !290, file: !3, line: 359, baseType: !88, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !290, file: !3, line: 359, baseType: !88, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !290, file: !3, line: 359, baseType: !32, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !290, file: !3, line: 359, baseType: !32, size: 64, offset: 128)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !297, retainedTypes: !303, globals: !312)
!297 = !{!298}
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !3, line: 714, baseType: !88, size: 32, elements: !299)
!299 = !{!300, !301, !302}
!300 = !DIEnumerator(name: "OCT", value: 0, isUnsigned: true)
!301 = !DIEnumerator(name: "DEC", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "HEX", value: 2, isUnsigned: true)
!303 = !{!18, !32, !125, !40, !88, !39, !23, !304, !305, !307, !19, !308, !6}
!304 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !306, line: 99, baseType: !128)
!306 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !306, line: 91, baseType: !222)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !309, line: 82, baseType: !310)
!309 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !311, line: 232, baseType: !128)
!311 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!312 = !{!0, !313}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "zeroes", scope: !2, file: !3, line: 741, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 16)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350}
!319 = !DILocalVariable(name: "data", arg: 1, scope: !2, file: !3, line: 663, type: !7)
!320 = !DILocalVariable(name: "fp", arg: 2, scope: !2, file: !3, line: 663, type: !286)
!321 = !DILocalVariable(name: "fmt0", arg: 3, scope: !2, file: !3, line: 663, type: !46)
!322 = !DILocalVariable(name: "ap", arg: 4, scope: !2, file: !3, line: 663, type: !289)
!323 = !DILocalVariable(name: "fmt", scope: !2, file: !3, line: 669, type: !40)
!324 = !DILocalVariable(name: "ch", scope: !2, file: !3, line: 670, type: !6)
!325 = !DILocalVariable(name: "n", scope: !2, file: !3, line: 671, type: !6)
!326 = !DILocalVariable(name: "m", scope: !2, file: !3, line: 671, type: !6)
!327 = !DILocalVariable(name: "cp", scope: !2, file: !3, line: 672, type: !40)
!328 = !DILocalVariable(name: "flags", scope: !2, file: !3, line: 673, type: !6)
!329 = !DILocalVariable(name: "fmt_anchor", scope: !2, file: !3, line: 674, type: !40)
!330 = !DILocalVariable(name: "ret", scope: !2, file: !3, line: 685, type: !6)
!331 = !DILocalVariable(name: "width", scope: !2, file: !3, line: 686, type: !6)
!332 = !DILocalVariable(name: "prec", scope: !2, file: !3, line: 687, type: !6)
!333 = !DILocalVariable(name: "sign", scope: !2, file: !3, line: 688, type: !41)
!334 = !DILocalVariable(name: "thousands_sep", scope: !2, file: !3, line: 691, type: !40)
!335 = !DILocalVariable(name: "thsnd_len", scope: !2, file: !3, line: 692, type: !125)
!336 = !DILocalVariable(name: "grouping", scope: !2, file: !3, line: 693, type: !46)
!337 = !DILocalVariable(name: "ndig", scope: !2, file: !3, line: 707, type: !6)
!338 = !DILocalVariable(name: "_uquad", scope: !2, file: !3, line: 713, type: !128)
!339 = !DILocalVariable(name: "base", scope: !2, file: !3, line: 714, type: !298)
!340 = !DILocalVariable(name: "dprec", scope: !2, file: !3, line: 715, type: !6)
!341 = !DILocalVariable(name: "realsz", scope: !2, file: !3, line: 716, type: !6)
!342 = !DILocalVariable(name: "size", scope: !2, file: !3, line: 717, type: !6)
!343 = !DILocalVariable(name: "xdigs", scope: !2, file: !3, line: 718, type: !40)
!344 = !DILocalVariable(name: "buf", scope: !2, file: !3, line: 725, type: !345)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 800, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 100)
!348 = !DILocalVariable(name: "ox", scope: !2, file: !3, line: 726, type: !160)
!349 = !DILocalVariable(name: "malloc_buf", scope: !2, file: !3, line: 731, type: !40)
!350 = !DILocalVariable(name: "p", scope: !351, file: !3, line: 1528, type: !40)
!351 = distinct !DILexicalBlock(scope: !352, file: !3, line: 1522, column: 19)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 1522, column: 8)
!353 = distinct !DILexicalBlock(scope: !354, file: !3, line: 1453, column: 8)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 959, column: 23)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 910, column: 11)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 910, column: 2)
!357 = distinct !DILexicalBlock(scope: !2, file: !3, line: 910, column: 2)
!358 = !{i32 2, !"Dwarf Version", i32 4}
!359 = !{i32 2, !"Debug Info Version", i32 3}
!360 = !{i32 1, !"wchar_size", i32 4}
!361 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!362 = distinct !DISubprogram(name: "__ssputs_r", scope: !3, file: !3, line: 201, type: !363, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, unit: !296, retainedNodes: !365)
!363 = !DISubroutineType(types: !364)
!364 = !{!6, !7, !286, !46, !125}
!365 = !{!366, !367, !368, !369, !370, !371, !374, !375}
!366 = !DILocalVariable(name: "ptr", arg: 1, scope: !362, file: !3, line: 201, type: !7)
!367 = !DILocalVariable(name: "fp", arg: 2, scope: !362, file: !3, line: 201, type: !286)
!368 = !DILocalVariable(name: "buf", arg: 3, scope: !362, file: !3, line: 201, type: !46)
!369 = !DILocalVariable(name: "len", arg: 4, scope: !362, file: !3, line: 201, type: !125)
!370 = !DILocalVariable(name: "w", scope: !362, file: !3, line: 207, type: !6)
!371 = !DILocalVariable(name: "str", scope: !372, file: !3, line: 212, type: !18)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 210, column: 50)
!373 = distinct !DILexicalBlock(scope: !362, file: !3, line: 210, column: 6)
!374 = !DILocalVariable(name: "curpos", scope: !372, file: !3, line: 213, type: !6)
!375 = !DILocalVariable(name: "newsize", scope: !372, file: !3, line: 221, type: !6)
!376 = !DILocation(line: 201, column: 1, scope: !362)
!377 = !DILocation(line: 209, column: 10, scope: !362)
!378 = !{!379, !383, i64 12}
!379 = !{!"__sFILE", !380, i64 0, !383, i64 8, !383, i64 12, !384, i64 16, !384, i64 18, !385, i64 24, !383, i64 40, !380, i64 48, !380, i64 56, !380, i64 64, !380, i64 72, !380, i64 80, !385, i64 88, !380, i64 104, !383, i64 112, !381, i64 116, !381, i64 119, !385, i64 120, !383, i64 136, !386, i64 144, !380, i64 152, !383, i64 160, !387, i64 164, !383, i64 172}
!380 = !{!"any pointer", !381, i64 0}
!381 = !{!"omnipotent char", !382, i64 0}
!382 = !{!"Simple C/C++ TBAA"}
!383 = !{!"int", !381, i64 0}
!384 = !{!"short", !381, i64 0}
!385 = !{!"__sbuf", !380, i64 0, !383, i64 8}
!386 = !{!"long", !381, i64 0}
!387 = !{!"", !383, i64 0, !381, i64 4}
!388 = !DILocation(line: 207, column: 15, scope: !362)
!389 = !DILocation(line: 210, column: 13, scope: !373)
!390 = !DILocation(line: 210, column: 10, scope: !373)
!391 = !DILocation(line: 210, column: 15, scope: !373)
!392 = !DILocation(line: 210, column: 22, scope: !373)
!393 = !{!379, !384, i64 16}
!394 = !DILocation(line: 210, column: 29, scope: !373)
!395 = !DILocation(line: 210, column: 6, scope: !362)
!396 = !DILocation(line: 213, column: 21, scope: !372)
!397 = !{!379, !380, i64 0}
!398 = !DILocation(line: 213, column: 30, scope: !372)
!399 = !DILocation(line: 213, column: 34, scope: !372)
!400 = !{!379, !380, i64 24}
!401 = !DILocation(line: 213, column: 24, scope: !372)
!402 = !DILocation(line: 213, column: 16, scope: !372)
!403 = !DILocation(line: 213, column: 7, scope: !372)
!404 = !DILocation(line: 221, column: 25, scope: !372)
!405 = !{!379, !383, i64 32}
!406 = !DILocation(line: 221, column: 31, scope: !372)
!407 = !DILocation(line: 221, column: 35, scope: !372)
!408 = !DILocation(line: 221, column: 7, scope: !372)
!409 = !DILocation(line: 222, column: 7, scope: !410)
!410 = distinct !DILexicalBlock(scope: !372, file: !3, line: 222, column: 7)
!411 = !DILocation(line: 222, column: 17, scope: !410)
!412 = !DILocation(line: 222, column: 24, scope: !410)
!413 = !DILocation(line: 222, column: 30, scope: !410)
!414 = !DILocation(line: 222, column: 15, scope: !410)
!415 = !DILocation(line: 222, column: 7, scope: !372)
!416 = !DILocation(line: 223, column: 14, scope: !410)
!417 = !DILocation(line: 223, column: 4, scope: !410)
!418 = !DILocation(line: 0, scope: !372)
!419 = !DILocation(line: 224, column: 18, scope: !420)
!420 = distinct !DILexicalBlock(scope: !372, file: !3, line: 224, column: 7)
!421 = !DILocation(line: 224, column: 7, scope: !372)
!422 = !DILocation(line: 0, scope: !423)
!423 = distinct !DILexicalBlock(scope: !420, file: !3, line: 225, column: 3)
!424 = !DILocation(line: 227, column: 27, scope: !423)
!425 = !DILocation(line: 212, column: 18, scope: !372)
!426 = !DILocation(line: 228, column: 9, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !3, line: 228, column: 8)
!428 = !DILocation(line: 228, column: 8, scope: !423)
!429 = !DILocation(line: 233, column: 25, scope: !423)
!430 = !DILocation(line: 233, column: 4, scope: !423)
!431 = !DILocation(line: 234, column: 22, scope: !423)
!432 = !DILocation(line: 234, column: 29, scope: !423)
!433 = !DILocation(line: 234, column: 40, scope: !423)
!434 = !DILocation(line: 234, column: 15, scope: !423)
!435 = !DILocation(line: 235, column: 3, scope: !423)
!436 = !DILocation(line: 238, column: 27, scope: !437)
!437 = distinct !DILexicalBlock(scope: !420, file: !3, line: 237, column: 3)
!438 = !DILocation(line: 240, column: 9, scope: !439)
!439 = distinct !DILexicalBlock(scope: !437, file: !3, line: 240, column: 8)
!440 = !DILocation(line: 240, column: 8, scope: !437)
!441 = !DILocation(line: 242, column: 5, scope: !442)
!442 = distinct !DILexicalBlock(scope: !439, file: !3, line: 240, column: 14)
!443 = !DILocation(line: 246, column: 5, scope: !442)
!444 = !DILocation(line: 0, scope: !437)
!445 = !DILocation(line: 249, column: 17, scope: !372)
!446 = !DILocation(line: 250, column: 16, scope: !372)
!447 = !DILocation(line: 250, column: 10, scope: !372)
!448 = !DILocation(line: 251, column: 17, scope: !372)
!449 = !DILocation(line: 252, column: 7, scope: !372)
!450 = !DILocation(line: 253, column: 20, scope: !372)
!451 = !DILocation(line: 253, column: 10, scope: !372)
!452 = !DILocation(line: 254, column: 2, scope: !373)
!453 = !DILocation(line: 255, column: 12, scope: !454)
!454 = distinct !DILexicalBlock(scope: !362, file: !3, line: 255, column: 6)
!455 = !DILocation(line: 0, scope: !362)
!456 = !DILocation(line: 255, column: 10, scope: !454)
!457 = !DILocation(line: 255, column: 6, scope: !362)
!458 = !DILocation(line: 256, column: 7, scope: !454)
!459 = !DILocation(line: 256, column: 3, scope: !454)
!460 = !DILocation(line: 257, column: 44, scope: !362)
!461 = !DILocation(line: 257, column: 28, scope: !362)
!462 = !DILocation(line: 257, column: 8, scope: !362)
!463 = !DILocation(line: 258, column: 9, scope: !362)
!464 = !DILocation(line: 259, column: 9, scope: !362)
!465 = !DILocation(line: 261, column: 2, scope: !362)
!466 = !DILocation(line: 0, scope: !442)
!467 = !{!468, !383, i64 0}
!468 = !{!"_reent", !383, i64 0, !380, i64 8, !380, i64 16, !380, i64 24, !383, i64 32, !381, i64 36, !383, i64 64, !380, i64 72, !383, i64 80, !380, i64 88, !380, i64 96, !383, i64 104, !380, i64 112, !380, i64 120, !383, i64 128, !380, i64 136, !381, i64 144, !380, i64 504, !469, i64 512, !380, i64 1304, !471, i64 1312, !381, i64 1336}
!469 = !{!"_atexit", !380, i64 0, !383, i64 8, !381, i64 16, !470, i64 272}
!470 = !{!"_on_exit_args", !381, i64 0, !381, i64 256, !383, i64 512, !383, i64 516}
!471 = !{!"_glue", !380, i64 0, !383, i64 8, !380, i64 16}
!472 = !DILocation(line: 264, column: 13, scope: !362)
!473 = !DILocation(line: 265, column: 2, scope: !362)
!474 = !DILocation(line: 266, column: 1, scope: !362)
!475 = distinct !DISubprogram(name: "__ssprint_r", scope: !3, file: !3, line: 270, type: !476, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, unit: !296, retainedNodes: !492)
!476 = !DISubroutineType(types: !477)
!477 = !{!6, !7, !286, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__suio", file: !480, line: 28, size: 192, elements: !481)
!480 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/fvwrite.h", directory: "/root/.unikraft/apps/redis/build")
!481 = !{!482, !490, !491}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "uio_iov", scope: !479, file: !480, line: 29, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__siov", file: !480, line: 24, size: 128, elements: !485)
!485 = !{!486, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !484, file: !480, line: 25, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !484, file: !480, line: 26, baseType: !125, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "uio_iovcnt", scope: !479, file: !480, line: 30, baseType: !6, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "uio_resid", scope: !479, file: !480, line: 31, baseType: !125, size: 64, offset: 128)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !504, !505}
!493 = !DILocalVariable(name: "ptr", arg: 1, scope: !475, file: !3, line: 270, type: !7)
!494 = !DILocalVariable(name: "fp", arg: 2, scope: !475, file: !3, line: 270, type: !286)
!495 = !DILocalVariable(name: "uio", arg: 3, scope: !475, file: !3, line: 270, type: !478)
!496 = !DILocalVariable(name: "len", scope: !475, file: !3, line: 275, type: !125)
!497 = !DILocalVariable(name: "w", scope: !475, file: !3, line: 276, type: !6)
!498 = !DILocalVariable(name: "iov", scope: !475, file: !3, line: 277, type: !483)
!499 = !DILocalVariable(name: "p", scope: !475, file: !3, line: 278, type: !46)
!500 = !DILocalVariable(name: "str", scope: !501, file: !3, line: 297, type: !18)
!501 = distinct !DILexicalBlock(scope: !502, file: !3, line: 295, column: 51)
!502 = distinct !DILexicalBlock(scope: !503, file: !3, line: 295, column: 7)
!503 = distinct !DILexicalBlock(scope: !475, file: !3, line: 288, column: 12)
!504 = !DILocalVariable(name: "curpos", scope: !501, file: !3, line: 298, type: !6)
!505 = !DILocalVariable(name: "newsize", scope: !501, file: !3, line: 306, type: !6)
!506 = !DILocation(line: 270, column: 1, scope: !475)
!507 = !DILocation(line: 278, column: 24, scope: !475)
!508 = !DILocation(line: 280, column: 13, scope: !475)
!509 = !{!510, !380, i64 0}
!510 = !{!"__suio", !380, i64 0, !383, i64 8, !386, i64 16}
!511 = !DILocation(line: 277, column: 26, scope: !475)
!512 = !DILocation(line: 275, column: 18, scope: !475)
!513 = !DILocation(line: 283, column: 11, scope: !514)
!514 = distinct !DILexicalBlock(scope: !475, file: !3, line: 283, column: 6)
!515 = !{!510, !386, i64 16}
!516 = !DILocation(line: 283, column: 21, scope: !514)
!517 = !DILocation(line: 283, column: 6, scope: !475)
!518 = !DILocation(line: 289, column: 3, scope: !503)
!519 = !DILocation(line: 0, scope: !503)
!520 = !DILocation(line: 280, column: 6, scope: !475)
!521 = !DILocation(line: 289, column: 14, scope: !503)
!522 = !DILocation(line: 291, column: 15, scope: !523)
!523 = distinct !DILexicalBlock(scope: !503, file: !3, line: 289, column: 20)
!524 = !{!525, !386, i64 8}
!525 = !{!"__siov", !380, i64 0, !386, i64 8}
!526 = !DILocation(line: 292, column: 7, scope: !523)
!527 = distinct !{!527, !518, !528}
!528 = !DILocation(line: 293, column: 3, scope: !503)
!529 = !DILocation(line: 290, column: 13, scope: !523)
!530 = !{!525, !380, i64 0}
!531 = !DILocation(line: 0, scope: !523)
!532 = !DILocation(line: 294, column: 11, scope: !503)
!533 = !DILocation(line: 276, column: 15, scope: !475)
!534 = !DILocation(line: 295, column: 14, scope: !502)
!535 = !DILocation(line: 295, column: 11, scope: !502)
!536 = !DILocation(line: 295, column: 16, scope: !502)
!537 = !DILocation(line: 295, column: 23, scope: !502)
!538 = !DILocation(line: 295, column: 30, scope: !502)
!539 = !DILocation(line: 295, column: 7, scope: !503)
!540 = !DILocation(line: 298, column: 22, scope: !501)
!541 = !DILocation(line: 298, column: 35, scope: !501)
!542 = !DILocation(line: 298, column: 25, scope: !501)
!543 = !DILocation(line: 298, column: 17, scope: !501)
!544 = !DILocation(line: 298, column: 8, scope: !501)
!545 = !DILocation(line: 306, column: 26, scope: !501)
!546 = !DILocation(line: 306, column: 32, scope: !501)
!547 = !DILocation(line: 306, column: 36, scope: !501)
!548 = !DILocation(line: 306, column: 8, scope: !501)
!549 = !DILocation(line: 307, column: 8, scope: !550)
!550 = distinct !DILexicalBlock(scope: !501, file: !3, line: 307, column: 8)
!551 = !DILocation(line: 307, column: 18, scope: !550)
!552 = !DILocation(line: 307, column: 25, scope: !550)
!553 = !DILocation(line: 307, column: 31, scope: !550)
!554 = !DILocation(line: 307, column: 16, scope: !550)
!555 = !DILocation(line: 307, column: 8, scope: !501)
!556 = !DILocation(line: 308, column: 15, scope: !550)
