; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/wcsftime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/wcsftime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_time_T = type { [12 x i8*], [12 x i8*], [7 x i8*], [7 x i8*], i8*, i8*, i8*, [2 x i8*], i8*, [12 x i8*], i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/wcsftime.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !9, !12, !11}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 40, baseType: !6)
!5 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !7, line: 129, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !10, line: 124, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 4}
!16 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!17 = distinct !DISubprogram(name: "__ctloc", scope: !18, file: !18, line: 331, type: !19, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !30)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/../time/strftime.c", directory: "/root/.unikraft/apps/redis/build")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !25, !26, !29}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !10, line: 83, baseType: !24)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!30 = !{!31, !32, !33}
!31 = !DILocalVariable(name: "buf", arg: 1, scope: !17, file: !18, line: 331, type: !25)
!32 = !DILocalVariable(name: "elem", arg: 2, scope: !17, file: !18, line: 331, type: !26)
!33 = !DILocalVariable(name: "len_ret", arg: 3, scope: !17, file: !18, line: 331, type: !29)
!34 = !DILocation(line: 331, column: 23, scope: !17)
!35 = !DILocation(line: 331, column: 40, scope: !17)
!36 = !DILocation(line: 331, column: 54, scope: !17)
!37 = !DILocation(line: 333, column: 7, scope: !17)
!38 = !DILocation(line: 333, column: 28, scope: !17)
!39 = !{!40, !40, i64 0}
!40 = !{!"int", !41, i64 0}
!41 = !{!"omnipotent char", !42, i64 0}
!42 = !{!"Simple C/C++ TBAA"}
!43 = !DILocation(line: 334, column: 18, scope: !17)
!44 = !DILocation(line: 334, column: 16, scope: !17)
!45 = !{!46, !46, i64 0}
!46 = !{!"long", !41, i64 0}
!47 = !DILocation(line: 335, column: 20, scope: !48)
!48 = distinct !DILexicalBlock(scope: !17, file: !18, line: 335, column: 11)
!49 = !DILocation(line: 335, column: 11, scope: !17)
!50 = !DILocation(line: 336, column: 11, scope: !48)
!51 = !DILocation(line: 336, column: 2, scope: !48)
!52 = !DILocation(line: 337, column: 7, scope: !17)
!53 = distinct !DISubprogram(name: "wcsftime", scope: !18, file: !18, line: 1442, type: !54, isLocal: false, isDefinition: true, scopeLine: 1447, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !77)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !57, !4, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 58, baseType: !8)
!57 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !25)
!58 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !21)
!59 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !63, line: 31, size: 448, elements: !64)
!63 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !76}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !62, file: !63, line: 32, baseType: !24, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !62, file: !63, line: 33, baseType: !24, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !62, file: !63, line: 34, baseType: !24, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !62, file: !63, line: 35, baseType: !24, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !62, file: !63, line: 36, baseType: !24, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !62, file: !63, line: 37, baseType: !24, size: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !62, file: !63, line: 38, baseType: !24, size: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !62, file: !63, line: 39, baseType: !24, size: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !62, file: !63, line: 40, baseType: !24, size: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !62, file: !63, line: 41, baseType: !75, size: 64, offset: 320)
!75 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !62, file: !63, line: 42, baseType: !26, size: 64, offset: 384)
!77 = !{!78, !79, !80, !81}
!78 = !DILocalVariable(name: "s", arg: 1, scope: !53, file: !18, line: 1442, type: !57)
!79 = !DILocalVariable(name: "maxsize", arg: 2, scope: !53, file: !18, line: 1442, type: !4)
!80 = !DILocalVariable(name: "format", arg: 3, scope: !53, file: !18, line: 1442, type: !58)
!81 = !DILocalVariable(name: "tim_p", arg: 4, scope: !53, file: !18, line: 1442, type: !59)
!82 = !DILocation(line: 1442, column: 1, scope: !53)
!83 = !DILocation(line: 230, column: 10, scope: !84, inlinedAt: !352)
!84 = distinct !DISubprogram(name: "__get_current_locale", scope: !85, file: !85, line: 228, type: !86, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !2)
!85 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!86 = !DISubroutineType(types: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !85, line: 178, size: 3392, elements: !90)
!90 = !{!91, !96, !311, !315, !316, !317, !345, !349, !351}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !89, file: !85, line: 180, baseType: !92, size: 1792)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1792, elements: !93)
!93 = !{!94, !95}
!94 = !DISubrange(count: 7)
!95 = !DISubrange(count: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !89, file: !85, line: 181, baseType: !97, size: 64, offset: 1792)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!24, !100, !131, !23, !308}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !102, line: 569, size: 14912, elements: !103)
!102 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!103 = !{!104, !105, !179, !180, !181, !182, !186, !187, !188, !189, !193, !205, !206, !207, !209, !210, !211, !273, !293, !294, !299, !306}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !101, file: !102, line: 571, baseType: !24, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !101, file: !102, line: 576, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !102, line: 287, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !102, line: 181, size: 1408, elements: !109)
!109 = !{!110, !113, !114, !115, !117, !118, !123, !124, !126, !132, !136, !141, !145, !146, !147, !148, !152, !156, !157, !158, !160, !161, !165, !178}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !108, file: !102, line: 182, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !108, file: !102, line: 183, baseType: !24, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !108, file: !102, line: 184, baseType: !24, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !108, file: !102, line: 185, baseType: !116, size: 16, offset: 128)
!116 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !108, file: !102, line: 186, baseType: !116, size: 16, offset: 144)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !108, file: !102, line: 187, baseType: !119, size: 128, offset: 192)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !102, line: 117, size: 128, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !119, file: !102, line: 118, baseType: !111, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !119, file: !102, line: 119, baseType: !24, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !108, file: !102, line: 188, baseType: !24, size: 32, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !108, file: !102, line: 195, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !108, file: !102, line: 197, baseType: !127, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !100, !125, !131, !24}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !7, line: 145, baseType: !75)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !108, file: !102, line: 199, baseType: !133, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!130, !100, !125, !26, !24}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !108, file: !102, line: 202, baseType: !137, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !100, !125, !140, !24}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !7, line: 114, baseType: !75)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !108, file: !102, line: 203, baseType: !142, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!24, !100, !125}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !108, file: !102, line: 206, baseType: !119, size: 128, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !108, file: !102, line: 207, baseType: !111, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !108, file: !102, line: 208, baseType: !24, size: 32, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !108, file: !102, line: 211, baseType: !149, size: 24, offset: 928)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 24, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 3)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !108, file: !102, line: 212, baseType: !153, size: 8, offset: 952)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !108, file: !102, line: 215, baseType: !119, size: 128, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !108, file: !102, line: 218, baseType: !24, size: 32, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !108, file: !102, line: 219, baseType: !159, size: 64, offset: 1152)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !7, line: 44, baseType: !75)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !108, file: !102, line: 222, baseType: !100, size: 64, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !108, file: !102, line: 226, baseType: !162, size: 32, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !7, line: 175, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !164, line: 12, baseType: !24)
!164 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !108, file: !102, line: 228, baseType: !166, size: 64, offset: 1312)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !7, line: 171, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 163, size: 64, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !167, file: !7, line: 165, baseType: !24, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !167, file: !7, line: 170, baseType: !171, size: 32, offset: 32)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !167, file: !7, line: 166, size: 32, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !171, file: !7, line: 168, baseType: !9, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !171, file: !7, line: 169, baseType: !175, size: 32)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 32, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 4)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !108, file: !102, line: 229, baseType: !24, size: 32, offset: 1376)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !101, file: !102, line: 576, baseType: !106, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !101, file: !102, line: 576, baseType: !106, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !101, file: !102, line: 578, baseType: !24, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !101, file: !102, line: 579, baseType: !183, size: 200, offset: 288)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 200, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 25)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !101, file: !102, line: 582, baseType: !24, size: 32, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !101, file: !102, line: 583, baseType: !88, size: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !101, file: !102, line: 585, baseType: !24, size: 32, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !101, file: !102, line: 587, baseType: !190, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !100}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !101, file: !102, line: 590, baseType: !194, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !102, line: 47, size: 256, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !195, file: !102, line: 49, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !195, file: !102, line: 50, baseType: !24, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !195, file: !102, line: 50, baseType: !24, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !195, file: !102, line: 50, baseType: !24, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !195, file: !102, line: 50, baseType: !24, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !195, file: !102, line: 51, baseType: !203, size: 32, offset: 192)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 32, elements: !154)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !102, line: 25, baseType: !11)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !101, file: !102, line: 591, baseType: !24, size: 32, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !101, file: !102, line: 592, baseType: !194, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !101, file: !102, line: 593, baseType: !208, size: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !101, file: !102, line: 596, baseType: !24, size: 32, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !101, file: !102, line: 597, baseType: !131, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !101, file: !102, line: 632, baseType: !212, size: 2880, offset: 1152)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !101, file: !102, line: 599, size: 2880, elements: !213)
!213 = !{!214, !264}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !212, file: !102, line: 622, baseType: !215, size: 1728)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !102, line: 601, size: 1728, elements: !216)
!216 = !{!217, !218, !219, !223, !235, !236, !238, !246, !247, !248, !249, !253, !257, !258, !259, !260, !261, !262, !263}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !215, file: !102, line: 603, baseType: !11, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !215, file: !102, line: 604, baseType: !131, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !215, file: !102, line: 605, baseType: !220, size: 208, offset: 128)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 208, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 26)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !215, file: !102, line: 606, baseType: !224, size: 288, offset: 352)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !102, line: 55, size: 288, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !224, file: !102, line: 57, baseType: !24, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !224, file: !102, line: 58, baseType: !24, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !224, file: !102, line: 59, baseType: !24, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !224, file: !102, line: 60, baseType: !24, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !224, file: !102, line: 61, baseType: !24, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !224, file: !102, line: 62, baseType: !24, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !224, file: !102, line: 63, baseType: !24, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !224, file: !102, line: 64, baseType: !24, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !224, file: !102, line: 65, baseType: !24, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !215, file: !102, line: 607, baseType: !24, size: 32, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !215, file: !102, line: 608, baseType: !237, size: 64, offset: 704)
!237 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !215, file: !102, line: 609, baseType: !239, size: 112, offset: 768)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !102, line: 319, size: 112, elements: !240)
!240 = !{!241, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !239, file: !102, line: 320, baseType: !242, size: 48)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 48, elements: !150)
!243 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !239, file: !102, line: 321, baseType: !242, size: 48, offset: 48)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !239, file: !102, line: 322, baseType: !243, size: 16, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !215, file: !102, line: 610, baseType: !166, size: 64, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !215, file: !102, line: 611, baseType: !166, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !215, file: !102, line: 612, baseType: !166, size: 64, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !215, file: !102, line: 613, baseType: !250, size: 64, offset: 1088)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !215, file: !102, line: 614, baseType: !254, size: 192, offset: 1152)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 24)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !215, file: !102, line: 615, baseType: !24, size: 32, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !215, file: !102, line: 616, baseType: !166, size: 64, offset: 1376)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !215, file: !102, line: 617, baseType: !166, size: 64, offset: 1440)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !215, file: !102, line: 618, baseType: !166, size: 64, offset: 1504)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !215, file: !102, line: 619, baseType: !166, size: 64, offset: 1568)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !215, file: !102, line: 620, baseType: !166, size: 64, offset: 1632)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !215, file: !102, line: 621, baseType: !24, size: 32, offset: 1696)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !212, file: !102, line: 631, baseType: !265, size: 2880)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !102, line: 626, size: 2880, elements: !266)
!266 = !{!267, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !265, file: !102, line: 629, baseType: !268, size: 1920)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 1920, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 30)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !265, file: !102, line: 630, baseType: !272, size: 960, offset: 1920)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 960, elements: !269)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !101, file: !102, line: 636, baseType: !274, size: 64, offset: 4032)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !102, line: 93, size: 6336, elements: !276)
!276 = !{!277, !278, !279, !285}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !275, file: !102, line: 94, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !275, file: !102, line: 95, baseType: !24, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !275, file: !102, line: 97, baseType: !280, size: 2048, offset: 128)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 2048, elements: !284)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null}
!284 = !{!95}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !275, file: !102, line: 98, baseType: !286, size: 4160, offset: 2176)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !102, line: 74, size: 4160, elements: !287)
!287 = !{!288, !290, !291, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !286, file: !102, line: 75, baseType: !289, size: 2048)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2048, elements: !284)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !286, file: !102, line: 76, baseType: !289, size: 2048, offset: 2048)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !286, file: !102, line: 78, baseType: !204, size: 32, offset: 4096)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !286, file: !102, line: 81, baseType: !204, size: 32, offset: 4128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !101, file: !102, line: 637, baseType: !275, size: 6336, offset: 4096)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !101, file: !102, line: 641, baseType: !295, size: 64, offset: 10432)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !24}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !101, file: !102, line: 646, baseType: !300, size: 192, offset: 10496)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !102, line: 291, size: 192, elements: !301)
!301 = !{!302, !304, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !300, file: !102, line: 293, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !300, file: !102, line: 294, baseType: !24, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !300, file: !102, line: 295, baseType: !106, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !101, file: !102, line: 648, baseType: !307, size: 4224, offset: 10688)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 4224, elements: !150)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !310, line: 86, baseType: !166)
!310 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !89, file: !85, line: 183, baseType: !312, size: 64, offset: 1856)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!24, !100, !25, !26, !4, !308}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !89, file: !85, line: 185, baseType: !24, size: 32, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !89, file: !85, line: 186, baseType: !131, size: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !89, file: !85, line: 187, baseType: !318, size: 768, offset: 2048)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !319, line: 42, size: 768, elements: !320)
!319 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !318, file: !319, line: 44, baseType: !131, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !318, file: !319, line: 45, baseType: !131, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !318, file: !319, line: 46, baseType: !131, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !318, file: !319, line: 47, baseType: !131, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !318, file: !319, line: 48, baseType: !131, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !318, file: !319, line: 49, baseType: !131, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !318, file: !319, line: 50, baseType: !131, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !318, file: !319, line: 51, baseType: !131, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !318, file: !319, line: 52, baseType: !131, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !318, file: !319, line: 53, baseType: !131, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !318, file: !319, line: 54, baseType: !28, size: 8, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !318, file: !319, line: 55, baseType: !28, size: 8, offset: 648)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !318, file: !319, line: 56, baseType: !28, size: 8, offset: 656)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !318, file: !319, line: 57, baseType: !28, size: 8, offset: 664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !318, file: !319, line: 58, baseType: !28, size: 8, offset: 672)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !318, file: !319, line: 59, baseType: !28, size: 8, offset: 680)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !318, file: !319, line: 60, baseType: !28, size: 8, offset: 688)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !318, file: !319, line: 61, baseType: !28, size: 8, offset: 696)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !318, file: !319, line: 62, baseType: !28, size: 8, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !318, file: !319, line: 63, baseType: !28, size: 8, offset: 712)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !318, file: !319, line: 64, baseType: !28, size: 8, offset: 720)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !318, file: !319, line: 65, baseType: !28, size: 8, offset: 728)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !318, file: !319, line: 66, baseType: !28, size: 8, offset: 736)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !318, file: !319, line: 67, baseType: !28, size: 8, offset: 744)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !89, file: !85, line: 189, baseType: !346, size: 16, offset: 2816)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 16, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !89, file: !85, line: 190, baseType: !350, size: 256, offset: 2832)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !284)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !89, file: !85, line: 191, baseType: !350, size: 256, offset: 3088)
!352 = distinct !DILocation(line: 1459, column: 10, scope: !53)
!353 = !DILocation(line: 230, column: 18, scope: !84, inlinedAt: !352)
!354 = !{!355, !356, i64 72}
!355 = !{!"_reent", !40, i64 0, !356, i64 8, !356, i64 16, !356, i64 24, !40, i64 32, !41, i64 36, !40, i64 64, !356, i64 72, !40, i64 80, !356, i64 88, !356, i64 96, !40, i64 104, !356, i64 112, !356, i64 120, !40, i64 128, !356, i64 136, !41, i64 144, !356, i64 504, !357, i64 512, !356, i64 1304, !359, i64 1312, !41, i64 1336}
!356 = !{!"any pointer", !41, i64 0}
!357 = !{!"_atexit", !356, i64 0, !40, i64 8, !41, i64 16, !358, i64 272}
!358 = !{!"_on_exit_args", !41, i64 0, !41, i64 256, !40, i64 512, !40, i64 516}
!359 = !{!"_glue", !356, i64 0, !40, i64 8, !356, i64 16}
!360 = !DILocation(line: 213, column: 3, scope: !361, inlinedAt: !362)
!361 = distinct !DISubprogram(name: "__get_global_locale", scope: !85, file: !85, line: 210, type: !86, isLocal: true, isDefinition: true, scopeLine: 211, isOptimized: true, unit: !0, retainedNodes: !2)
!362 = distinct !DILocation(line: 230, column: 29, scope: !84, inlinedAt: !352)
!363 = !DILocation(line: 230, column: 3, scope: !84, inlinedAt: !352)
!364 = !DILocation(line: 1459, column: 10, scope: !53)
!365 = !DILocation(line: 1459, column: 3, scope: !53)
!366 = distinct !DISubprogram(name: "__strftime", scope: !18, file: !18, line: 685, type: !367, isLocal: true, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!4, !25, !4, !21, !60, !88}
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !382, !383, !384, !385, !386, !387, !388, !416, !422, !426, !427, !428, !429, !432, !433, !435, !436, !438, !439, !440, !441, !445, !446, !447, !449, !451, !475, !477, !478, !479, !481, !484, !486, !487, !488, !489, !492, !493, !496}
!370 = !DILocalVariable(name: "s", arg: 1, scope: !366, file: !18, line: 685, type: !25)
!371 = !DILocalVariable(name: "maxsize", arg: 2, scope: !366, file: !18, line: 685, type: !4)
!372 = !DILocalVariable(name: "format", arg: 3, scope: !366, file: !18, line: 685, type: !21)
!373 = !DILocalVariable(name: "tim_p", arg: 4, scope: !366, file: !18, line: 686, type: !60)
!374 = !DILocalVariable(name: "locale", arg: 5, scope: !366, file: !18, line: 686, type: !88)
!375 = !DILocalVariable(name: "count", scope: !366, file: !18, line: 691, type: !4)
!376 = !DILocalVariable(name: "len", scope: !366, file: !18, line: 692, type: !24)
!377 = !DILocalVariable(name: "ctloc", scope: !366, file: !18, line: 693, type: !21)
!378 = !DILocalVariable(name: "ctlocbuf", scope: !366, file: !18, line: 695, type: !379)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 256)
!382 = !DILocalVariable(name: "i", scope: !366, file: !18, line: 697, type: !4)
!383 = !DILocalVariable(name: "ctloclen", scope: !366, file: !18, line: 697, type: !4)
!384 = !DILocalVariable(name: "alt", scope: !366, file: !18, line: 698, type: !23)
!385 = !DILocalVariable(name: "pad", scope: !366, file: !18, line: 699, type: !23)
!386 = !DILocalVariable(name: "width", scope: !366, file: !18, line: 700, type: !8)
!387 = !DILocalVariable(name: "tzset_called", scope: !366, file: !18, line: 701, type: !24)
!388 = !DILocalVariable(name: "_CurrentTimeLocale", scope: !366, file: !18, line: 703, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_time_T", file: !85, line: 116, size: 4032, elements: !392)
!392 = !{!393, !397, !398, !401, !402, !403, !404, !405, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !391, file: !85, line: 118, baseType: !394, size: 768)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 768, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 12)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !391, file: !85, line: 119, baseType: !394, size: 768, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wday", scope: !391, file: !85, line: 120, baseType: !399, size: 448, offset: 1536)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 448, elements: !400)
!400 = !{!94}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !391, file: !85, line: 121, baseType: !399, size: 448, offset: 1984)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "X_fmt", scope: !391, file: !85, line: 122, baseType: !26, size: 64, offset: 2432)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "x_fmt", scope: !391, file: !85, line: 123, baseType: !26, size: 64, offset: 2496)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "c_fmt", scope: !391, file: !85, line: 124, baseType: !26, size: 64, offset: 2560)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "am_pm", scope: !391, file: !85, line: 125, baseType: !406, size: 128, offset: 2624)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !347)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "date_fmt", scope: !391, file: !85, line: 126, baseType: !26, size: 64, offset: 2752)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "alt_month", scope: !391, file: !85, line: 127, baseType: !394, size: 768, offset: 2816)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "md_order", scope: !391, file: !85, line: 128, baseType: !26, size: 64, offset: 3584)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ampm_fmt", scope: !391, file: !85, line: 129, baseType: !26, size: 64, offset: 3648)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !391, file: !85, line: 130, baseType: !26, size: 64, offset: 3712)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !391, file: !85, line: 131, baseType: !26, size: 64, offset: 3776)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !391, file: !85, line: 132, baseType: !26, size: 64, offset: 3840)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !391, file: !85, line: 133, baseType: !26, size: 64, offset: 3904)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !391, file: !85, line: 134, baseType: !26, size: 64, offset: 3968)
!416 = !DILocalVariable(name: "fp", scope: !417, file: !18, line: 727, type: !25)
!417 = distinct !DILexicalBlock(scope: !418, file: !18, line: 726, column: 8)
!418 = distinct !DILexicalBlock(scope: !419, file: !18, line: 725, column: 11)
!419 = distinct !DILexicalBlock(scope: !420, file: !18, line: 705, column: 5)
!420 = distinct !DILexicalBlock(scope: !421, file: !18, line: 704, column: 3)
!421 = distinct !DILexicalBlock(scope: !366, file: !18, line: 704, column: 3)
!422 = !DILocalVariable(name: "fmt", scope: !423, file: !18, line: 870, type: !25)
!423 = distinct !DILexicalBlock(scope: !424, file: !18, line: 869, column: 8)
!424 = distinct !DILexicalBlock(scope: !425, file: !18, line: 842, column: 4)
!425 = distinct !DILexicalBlock(scope: !419, file: !18, line: 761, column: 2)
!426 = !DILocalVariable(name: "pos", scope: !423, file: !18, line: 871, type: !131)
!427 = !DILocalVariable(name: "neg", scope: !423, file: !18, line: 872, type: !24)
!428 = !DILocalVariable(name: "century", scope: !423, file: !18, line: 873, type: !24)
!429 = !DILocalVariable(name: "fmtbuf", scope: !430, file: !18, line: 931, type: !431)
!430 = distinct !DILexicalBlock(scope: !425, file: !18, line: 929, column: 4)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1024, elements: !284)
!432 = !DILocalVariable(name: "fmt", scope: !430, file: !18, line: 931, type: !25)
!433 = !DILocalVariable(name: "adjust", scope: !434, file: !18, line: 962, type: !24)
!434 = distinct !DILexicalBlock(scope: !425, file: !18, line: 961, column: 4)
!435 = !DILocalVariable(name: "year", scope: !434, file: !18, line: 963, type: !24)
!436 = !DILocalVariable(name: "sign", scope: !437, file: !18, line: 979, type: !24)
!437 = distinct !DILexicalBlock(scope: !425, file: !18, line: 975, column: 4)
!438 = !DILocalVariable(name: "adjust", scope: !437, file: !18, line: 980, type: !24)
!439 = !DILocalVariable(name: "century", scope: !437, file: !18, line: 981, type: !24)
!440 = !DILocalVariable(name: "year", scope: !437, file: !18, line: 984, type: !24)
!441 = !DILocalVariable(name: "fmtbuf", scope: !437, file: !18, line: 1001, type: !442)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 320, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 10)
!445 = !DILocalVariable(name: "fmt", scope: !437, file: !18, line: 1001, type: !25)
!446 = !DILocalVariable(name: "p_year", scope: !437, file: !18, line: 1003, type: !11)
!447 = !DILocalVariable(name: "h12", scope: !448, file: !18, line: 1046, type: !24)
!448 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1045, column: 4)
!449 = !DILocalVariable(name: "offset", scope: !450, file: !18, line: 1134, type: !75)
!450 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1133, column: 4)
!451 = !DILocalVariable(name: "tz", scope: !452, file: !18, line: 1157, type: !454)
!452 = distinct !DILexicalBlock(scope: !453, file: !18, line: 1138, column: 8)
!453 = distinct !DILexicalBlock(scope: !450, file: !18, line: 1137, column: 10)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzinfo_type", file: !456, line: 65, baseType: !457)
!456 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzinfo_struct", file: !456, line: 60, size: 704, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__tznorth", scope: !457, file: !456, line: 62, baseType: !24, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__tzyear", scope: !457, file: !456, line: 63, baseType: !24, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__tzrule", scope: !457, file: !456, line: 64, baseType: !462, size: 640, offset: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 640, elements: !347)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzrule_type", file: !456, line: 58, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzrule_struct", file: !456, line: 49, size: 320, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !474}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !464, file: !456, line: 51, baseType: !28, size: 8)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !464, file: !456, line: 52, baseType: !24, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !464, file: !456, line: 53, baseType: !24, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !464, file: !456, line: 54, baseType: !24, size: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !464, file: !456, line: 55, baseType: !24, size: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !464, file: !456, line: 56, baseType: !472, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !473, line: 34, baseType: !75)
!473 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !464, file: !456, line: 57, baseType: !75, size: 64, offset: 256)
!475 = !DILocalVariable(name: "adjust", scope: !476, file: !18, line: 1234, type: !24)
!476 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1233, column: 4)
!477 = !DILocalVariable(name: "wday", scope: !476, file: !18, line: 1235, type: !24)
!478 = !DILocalVariable(name: "week", scope: !476, file: !18, line: 1236, type: !24)
!479 = !DILocalVariable(name: "wday", scope: !480, file: !18, line: 1275, type: !24)
!480 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1274, column: 4)
!481 = !DILocalVariable(name: "year", scope: !482, file: !18, line: 1297, type: !24)
!482 = distinct !DILexicalBlock(scope: !483, file: !18, line: 1294, column: 3)
!483 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1287, column: 6)
!484 = !DILocalVariable(name: "fmtbuf", scope: !485, file: !18, line: 1320, type: !442)
!485 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1319, column: 6)
!486 = !DILocalVariable(name: "fmt", scope: !485, file: !18, line: 1320, type: !25)
!487 = !DILocalVariable(name: "sign", scope: !485, file: !18, line: 1321, type: !24)
!488 = !DILocalVariable(name: "year", scope: !485, file: !18, line: 1323, type: !11)
!489 = !DILocalVariable(name: "offset", scope: !490, file: !18, line: 1349, type: !75)
!490 = distinct !DILexicalBlock(scope: !491, file: !18, line: 1348, column: 13)
!491 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1347, column: 15)
!492 = !DILocalVariable(name: "tz", scope: !490, file: !18, line: 1369, type: !454)
!493 = !DILocalVariable(name: "size", scope: !494, file: !18, line: 1385, type: !4)
!494 = distinct !DILexicalBlock(scope: !495, file: !18, line: 1384, column: 6)
!495 = distinct !DILexicalBlock(scope: !425, file: !18, line: 1383, column: 8)
!496 = !DILocalVariable(name: "tznam", scope: !494, file: !18, line: 1386, type: !26)
!497 = !DILocation(line: 685, column: 19, scope: !366)
!498 = !DILocation(line: 685, column: 29, scope: !366)
!499 = !DILocation(line: 685, column: 50, scope: !366)
!500 = !DILocation(line: 686, column: 23, scope: !366)
!501 = !DILocation(line: 686, column: 49, scope: !366)
!502 = !DILocation(line: 691, column: 10, scope: !366)
!503 = !DILocation(line: 692, column: 7, scope: !366)
!504 = !DILocation(line: 695, column: 3, scope: !366)
!505 = !DILocation(line: 695, column: 8, scope: !366)
!506 = !DILocation(line: 701, column: 7, scope: !366)
!507 = !DILocalVariable(name: "locale", arg: 1, scope: !508, file: !85, line: 364, type: !88)
!508 = distinct !DISubprogram(name: "__get_time_locale", scope: !85, file: !85, line: 364, type: !509, isLocal: true, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!389, !88}
!511 = !{!507}
!512 = !DILocation(line: 364, column: 39, scope: !508, inlinedAt: !513)
!513 = distinct !DILocation(line: 703, column: 48, scope: !366)
!514 = !DILocation(line: 366, column: 3, scope: !508, inlinedAt: !513)
!515 = !DILocation(line: 703, column: 27, scope: !366)
!516 = !DILocation(line: 704, column: 3, scope: !366)
!517 = !DILocation(line: 706, column: 7, scope: !419)
!518 = !DILocation(line: 706, column: 14, scope: !419)
!519 = !DILocation(line: 706, column: 22, scope: !419)
!520 = !DILocation(line: 706, column: 33, scope: !419)
!521 = !DILocation(line: 708, column: 14, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !18, line: 708, column: 8)
!523 = distinct !DILexicalBlock(scope: !419, file: !18, line: 707, column: 2)
!524 = !DILocation(line: 708, column: 8, scope: !523)
!525 = !DILocation(line: 709, column: 26, scope: !522)
!526 = !DILocation(line: 709, column: 13, scope: !522)
!527 = !DILocation(line: 709, column: 6, scope: !522)
!528 = !DILocation(line: 709, column: 17, scope: !522)
!529 = distinct !{!529, !517, !530}
!530 = !DILocation(line: 712, column: 2, scope: !419)
