; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/wctob.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/wctob.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/wctob.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !7, !9}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !5, line: 124, baseType: !6)
!5 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{i32 1, !"wchar_size", i32 4}
!13 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!14 = distinct !DISubprogram(name: "wctob", scope: !1, file: !1, line: 9, type: !15, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !17)
!15 = !DISubroutineType(types: !16)
!16 = !{!9, !4}
!17 = !{!18, !19, !294, !295}
!18 = !DILocalVariable(name: "wc", arg: 1, scope: !14, file: !1, line: 9, type: !4)
!19 = !DILocalVariable(name: "reent", scope: !14, file: !1, line: 11, type: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !22, line: 569, size: 14912, elements: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !{!24, !25, !102, !103, !104, !105, !109, !110, !175, !176, !180, !192, !193, !194, !196, !197, !198, !260, !279, !280, !285, !292}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !21, file: !22, line: 571, baseType: !9, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !21, file: !22, line: 576, baseType: !26, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !22, line: 287, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 181, size: 1408, elements: !29)
!29 = !{!30, !33, !34, !35, !37, !38, !43, !44, !46, !53, !59, !64, !68, !69, !70, !71, !75, !79, !80, !81, !83, !84, !88, !101}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !28, file: !22, line: 182, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !28, file: !22, line: 183, baseType: !9, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !28, file: !22, line: 184, baseType: !9, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !22, line: 185, baseType: !36, size: 16, offset: 128)
!36 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !28, file: !22, line: 186, baseType: !36, size: 16, offset: 144)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !28, file: !22, line: 187, baseType: !39, size: 128, offset: 192)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 117, size: 128, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !39, file: !22, line: 118, baseType: !31, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !39, file: !22, line: 119, baseType: !9, size: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !28, file: !22, line: 188, baseType: !9, size: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !28, file: !22, line: 195, baseType: !45, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !28, file: !22, line: 197, baseType: !47, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !20, !45, !7, !9}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !51, line: 145, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !28, file: !22, line: 199, baseType: !54, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!50, !20, !45, !57, !9}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !28, file: !22, line: 202, baseType: !60, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !20, !45, !63, !9}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !51, line: 114, baseType: !52)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !28, file: !22, line: 203, baseType: !65, size: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!9, !20, !45}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !28, file: !22, line: 206, baseType: !39, size: 128, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !28, file: !22, line: 207, baseType: !31, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !28, file: !22, line: 208, baseType: !9, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !28, file: !22, line: 211, baseType: !72, size: 24, offset: 928)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 24, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !28, file: !22, line: 212, baseType: !76, size: 8, offset: 952)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !28, file: !22, line: 215, baseType: !39, size: 128, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !28, file: !22, line: 218, baseType: !9, size: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !22, line: 219, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !51, line: 44, baseType: !52)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !28, file: !22, line: 222, baseType: !20, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !22, line: 226, baseType: !85, size: 32, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !51, line: 175, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !87, line: 12, baseType: !9)
!87 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !28, file: !22, line: 228, baseType: !89, size: 64, offset: 1312)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !51, line: 171, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 163, size: 64, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !90, file: !51, line: 165, baseType: !9, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !90, file: !51, line: 170, baseType: !94, size: 32, offset: 32)
!94 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !90, file: !51, line: 166, size: 32, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !94, file: !51, line: 168, baseType: !4, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !94, file: !51, line: 169, baseType: !98, size: 32)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 4)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !22, line: 229, baseType: !9, size: 32, offset: 1376)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !21, file: !22, line: 576, baseType: !26, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !21, file: !22, line: 576, baseType: !26, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !21, file: !22, line: 578, baseType: !9, size: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !21, file: !22, line: 579, baseType: !106, size: 200, offset: 288)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 25)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !21, file: !22, line: 582, baseType: !9, size: 32, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !21, file: !22, line: 583, baseType: !111, size: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !113, line: 178, size: 3392, elements: !114)
!113 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!114 = !{!115, !120, !128, !137, !138, !139, !167, !171, !174}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !112, file: !113, line: 180, baseType: !116, size: 1792)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1792, elements: !117)
!117 = !{!118, !119}
!118 = !DISubrange(count: 7)
!119 = !DISubrange(count: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !112, file: !113, line: 181, baseType: !121, size: 64, offset: 1792)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!9, !20, !7, !124, !125}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !5, line: 83, baseType: !9)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !127, line: 86, baseType: !89)
!127 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !112, file: !113, line: 183, baseType: !129, size: 64, offset: 1856)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!9, !20, !132, !57, !133, !125}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 40, baseType: !135)
!134 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !51, line: 129, baseType: !136)
!136 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !112, file: !113, line: 185, baseType: !9, size: 32, offset: 1920)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !112, file: !113, line: 186, baseType: !7, size: 64, offset: 1984)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !112, file: !113, line: 187, baseType: !140, size: 768, offset: 2048)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !141, line: 42, size: 768, elements: !142)
!141 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !140, file: !141, line: 44, baseType: !7, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !140, file: !141, line: 45, baseType: !7, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !140, file: !141, line: 46, baseType: !7, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !140, file: !141, line: 47, baseType: !7, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !140, file: !141, line: 48, baseType: !7, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !140, file: !141, line: 49, baseType: !7, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !140, file: !141, line: 50, baseType: !7, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !140, file: !141, line: 51, baseType: !7, size: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !140, file: !141, line: 52, baseType: !7, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !140, file: !141, line: 53, baseType: !7, size: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !140, file: !141, line: 54, baseType: !8, size: 8, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !140, file: !141, line: 55, baseType: !8, size: 8, offset: 648)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !140, file: !141, line: 56, baseType: !8, size: 8, offset: 656)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !140, file: !141, line: 57, baseType: !8, size: 8, offset: 664)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !140, file: !141, line: 58, baseType: !8, size: 8, offset: 672)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !140, file: !141, line: 59, baseType: !8, size: 8, offset: 680)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !140, file: !141, line: 60, baseType: !8, size: 8, offset: 688)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !140, file: !141, line: 61, baseType: !8, size: 8, offset: 696)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !140, file: !141, line: 62, baseType: !8, size: 8, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !140, file: !141, line: 63, baseType: !8, size: 8, offset: 712)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !140, file: !141, line: 64, baseType: !8, size: 8, offset: 720)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !140, file: !141, line: 65, baseType: !8, size: 8, offset: 728)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !140, file: !141, line: 66, baseType: !8, size: 8, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !140, file: !141, line: 67, baseType: !8, size: 8, offset: 744)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !112, file: !113, line: 189, baseType: !168, size: 16, offset: 2816)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 2)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !112, file: !113, line: 190, baseType: !172, size: 256, offset: 2832)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !173)
!173 = !{!119}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !112, file: !113, line: 191, baseType: !172, size: 256, offset: 3088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !21, file: !22, line: 585, baseType: !9, size: 32, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !21, file: !22, line: 587, baseType: !177, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !20}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !21, file: !22, line: 590, baseType: !181, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !22, line: 47, size: 256, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !182, file: !22, line: 49, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !182, file: !22, line: 50, baseType: !9, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !182, file: !22, line: 50, baseType: !9, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !182, file: !22, line: 50, baseType: !9, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !182, file: !22, line: 50, baseType: !9, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !182, file: !22, line: 51, baseType: !190, size: 32, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 32, elements: !77)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !22, line: 25, baseType: !6)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !21, file: !22, line: 591, baseType: !9, size: 32, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !21, file: !22, line: 592, baseType: !181, size: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !21, file: !22, line: 593, baseType: !195, size: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !21, file: !22, line: 596, baseType: !9, size: 32, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !21, file: !22, line: 597, baseType: !7, size: 64, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !21, file: !22, line: 632, baseType: !199, size: 2880, offset: 1152)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !22, line: 599, size: 2880, elements: !200)
!200 = !{!201, !251}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !199, file: !22, line: 622, baseType: !202, size: 1728)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !22, line: 601, size: 1728, elements: !203)
!203 = !{!204, !205, !206, !210, !222, !223, !225, !233, !234, !235, !236, !240, !244, !245, !246, !247, !248, !249, !250}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !202, file: !22, line: 603, baseType: !6, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !202, file: !22, line: 604, baseType: !7, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !202, file: !22, line: 605, baseType: !207, size: 208, offset: 128)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 208, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 26)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !202, file: !22, line: 606, baseType: !211, size: 288, offset: 352)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !22, line: 55, size: 288, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !211, file: !22, line: 57, baseType: !9, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !211, file: !22, line: 58, baseType: !9, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !211, file: !22, line: 59, baseType: !9, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !211, file: !22, line: 60, baseType: !9, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !211, file: !22, line: 61, baseType: !9, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !211, file: !22, line: 62, baseType: !9, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !211, file: !22, line: 63, baseType: !9, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !211, file: !22, line: 64, baseType: !9, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !211, file: !22, line: 65, baseType: !9, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !202, file: !22, line: 607, baseType: !9, size: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !202, file: !22, line: 608, baseType: !224, size: 64, offset: 704)
!224 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !202, file: !22, line: 609, baseType: !226, size: 112, offset: 768)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !22, line: 319, size: 112, elements: !227)
!227 = !{!228, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !226, file: !22, line: 320, baseType: !229, size: 48)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 48, elements: !73)
!230 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !226, file: !22, line: 321, baseType: !229, size: 48, offset: 48)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !226, file: !22, line: 322, baseType: !230, size: 16, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !202, file: !22, line: 610, baseType: !89, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !202, file: !22, line: 611, baseType: !89, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !202, file: !22, line: 612, baseType: !89, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !202, file: !22, line: 613, baseType: !237, size: 64, offset: 1088)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !202, file: !22, line: 614, baseType: !241, size: 192, offset: 1152)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 24)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !202, file: !22, line: 615, baseType: !9, size: 32, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !202, file: !22, line: 616, baseType: !89, size: 64, offset: 1376)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !202, file: !22, line: 617, baseType: !89, size: 64, offset: 1440)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !202, file: !22, line: 618, baseType: !89, size: 64, offset: 1504)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !202, file: !22, line: 619, baseType: !89, size: 64, offset: 1568)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !202, file: !22, line: 620, baseType: !89, size: 64, offset: 1632)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !202, file: !22, line: 621, baseType: !9, size: 32, offset: 1696)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !199, file: !22, line: 631, baseType: !252, size: 2880)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !22, line: 626, size: 2880, elements: !253)
!253 = !{!254, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !252, file: !22, line: 629, baseType: !255, size: 1920)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1920, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 30)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !252, file: !22, line: 630, baseType: !259, size: 960, offset: 1920)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 960, elements: !256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !21, file: !22, line: 636, baseType: !261, size: 64, offset: 4032)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !22, line: 93, size: 6336, elements: !263)
!263 = !{!264, !265, !266, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !262, file: !22, line: 94, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !262, file: !22, line: 95, baseType: !9, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !262, file: !22, line: 97, baseType: !267, size: 2048, offset: 128)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 2048, elements: !173)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !262, file: !22, line: 98, baseType: !272, size: 4160, offset: 2176)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !22, line: 74, size: 4160, elements: !273)
!273 = !{!274, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !272, file: !22, line: 75, baseType: !275, size: 2048)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !173)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !272, file: !22, line: 76, baseType: !275, size: 2048, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !272, file: !22, line: 78, baseType: !191, size: 32, offset: 4096)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !272, file: !22, line: 81, baseType: !191, size: 32, offset: 4128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !21, file: !22, line: 637, baseType: !262, size: 6336, offset: 4096)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !21, file: !22, line: 641, baseType: !281, size: 64, offset: 10432)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !9}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !21, file: !22, line: 646, baseType: !286, size: 192, offset: 10496)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !22, line: 291, size: 192, elements: !287)
!287 = !{!288, !290, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !286, file: !22, line: 293, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !286, file: !22, line: 294, baseType: !9, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !286, file: !22, line: 295, baseType: !26, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !21, file: !22, line: 648, baseType: !293, size: 4224, offset: 10688)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 4224, elements: !73)
!294 = !DILocalVariable(name: "mbs", scope: !14, file: !1, line: 12, type: !126)
!295 = !DILocalVariable(name: "pmb", scope: !14, file: !1, line: 13, type: !76)
!296 = !DILocation(line: 9, column: 15, scope: !14)
!297 = !DILocation(line: 12, column: 3, scope: !14)
!298 = !DILocation(line: 13, column: 3, scope: !14)
!299 = !DILocation(line: 13, column: 17, scope: !14)
!300 = !DILocation(line: 15, column: 10, scope: !301)
!301 = distinct !DILexicalBlock(scope: !14, file: !1, line: 15, column: 7)
!302 = !DILocation(line: 15, column: 7, scope: !14)
!303 = !DILocation(line: 19, column: 3, scope: !14)
!304 = !DILocation(line: 21, column: 11, scope: !14)
!305 = !DILocation(line: 11, column: 18, scope: !14)
!306 = !DILocation(line: 230, column: 10, scope: !307, inlinedAt: !310)
!307 = distinct !DISubprogram(name: "__get_current_locale", scope: !113, file: !113, line: 228, type: !308, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !2)
!308 = !DISubroutineType(types: !309)
!309 = !{!111}
!310 = distinct !DILocation(line: 24, column: 10, scope: !14)
!311 = !DILocation(line: 230, column: 18, scope: !307, inlinedAt: !310)
!312 = !{!313, !317, i64 72}
!313 = !{!"_reent", !314, i64 0, !317, i64 8, !317, i64 16, !317, i64 24, !314, i64 32, !315, i64 36, !314, i64 64, !317, i64 72, !314, i64 80, !317, i64 88, !317, i64 96, !314, i64 104, !317, i64 112, !317, i64 120, !314, i64 128, !317, i64 136, !315, i64 144, !317, i64 504, !318, i64 512, !317, i64 1304, !320, i64 1312, !315, i64 1336}
!314 = !{!"int", !315, i64 0}
!315 = !{!"omnipotent char", !316, i64 0}
!316 = !{!"Simple C/C++ TBAA"}
!317 = !{!"any pointer", !315, i64 0}
!318 = !{!"_atexit", !317, i64 0, !314, i64 8, !315, i64 16, !319, i64 272}
!319 = !{!"_on_exit_args", !315, i64 0, !315, i64 256, !314, i64 512, !314, i64 516}
!320 = !{!"_glue", !317, i64 0, !314, i64 8, !317, i64 16}
!321 = !DILocation(line: 213, column: 3, scope: !322, inlinedAt: !323)
!322 = distinct !DISubprogram(name: "__get_global_locale", scope: !113, file: !113, line: 210, type: !308, isLocal: true, isDefinition: true, scopeLine: 211, isOptimized: true, unit: !0, retainedNodes: !2)
!323 = distinct !DILocation(line: 230, column: 29, scope: !307, inlinedAt: !310)
!324 = !DILocation(line: 230, column: 3, scope: !307, inlinedAt: !310)
!325 = !DILocation(line: 24, column: 10, scope: !14)
!326 = !{!327, !317, i64 224}
!327 = !{!"__locale_t", !315, i64 0, !317, i64 224, !317, i64 232, !314, i64 240, !317, i64 248, !328, i64 256, !315, i64 352, !315, i64 354, !315, i64 386}
!328 = !{!"lconv", !317, i64 0, !317, i64 8, !317, i64 16, !317, i64 24, !317, i64 32, !317, i64 40, !317, i64 48, !317, i64 56, !317, i64 64, !317, i64 72, !315, i64 80, !315, i64 81, !315, i64 82, !315, i64 83, !315, i64 84, !315, i64 85, !315, i64 86, !315, i64 87, !315, i64 88, !315, i64 89, !315, i64 90, !315, i64 91, !315, i64 92, !315, i64 93}
!329 = !DILocation(line: 12, column: 13, scope: !14)
!330 = !DILocation(line: 24, column: 51, scope: !14)
!331 = !DILocation(line: 24, column: 64, scope: !14)
!332 = !DILocation(line: 24, column: 58, scope: !14)
!333 = !DILocation(line: 24, column: 3, scope: !14)
!334 = !DILocation(line: 0, scope: !14)
!335 = !DILocation(line: 0, scope: !301)
!336 = !DILocation(line: 25, column: 1, scope: !14)
