; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "last_write_error_log", scope: !2, file: !3, line: 409, type: !79, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "flushAppendOnlyFile", scope: !3, file: !3, line: 337, type: !4, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !69)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !68)
!8 = !{}
!9 = !{!10, !11, !15, !16, !17, !18, !6, !20, !22, !23, !24, !39, !49, !59}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !12, line: 200, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !14, line: 145, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !26, line: 51, size: 24, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !33, !34, !35}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, file: !26, line: 52, baseType: !29, size: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 24, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !32, line: 43, baseType: !19)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !25, file: !26, line: 53, baseType: !29, size: 8, offset: 8)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !25, file: !26, line: 54, baseType: !19, size: 8, offset: 16)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !25, file: !26, line: 55, baseType: !36, offset: 24)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: -1)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !26, line: 57, size: 40, elements: !41)
!41 = !{!42, !46, !47, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !26, line: 58, baseType: !43, size: 16)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 36, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !32, line: 57, baseType: !45)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !26, line: 59, baseType: !43, size: 16, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !26, line: 60, baseType: !19, size: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !26, line: 61, baseType: !36, offset: 40)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !26, line: 63, size: 72, elements: !51)
!51 = !{!52, !56, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !26, line: 64, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 48, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !32, line: 79, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !50, file: !26, line: 65, baseType: !53, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !26, line: 66, baseType: !19, size: 8, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !50, file: !26, line: 67, baseType: !36, offset: 72)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !26, line: 69, size: 136, elements: !61)
!61 = !{!62, !65, !66, !67}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, file: !26, line: 70, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 60, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !32, line: 105, baseType: !17)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !60, file: !26, line: 71, baseType: !63, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !26, line: 72, baseType: !19, size: 8, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !60, file: !26, line: 73, baseType: !36, offset: 136)
!68 = !{!0}
!69 = !{!70, !71, !72, !73, !76}
!70 = !DILocalVariable(name: "force", arg: 1, scope: !2, file: !3, line: 337, type: !6)
!71 = !DILocalVariable(name: "nwritten", scope: !2, file: !3, line: 338, type: !11)
!72 = !DILocalVariable(name: "sync_in_progress", scope: !2, file: !3, line: 339, type: !6)
!73 = !DILocalVariable(name: "latency", scope: !2, file: !3, line: 340, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !75, line: 52, baseType: !16)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DILocalVariable(name: "can_log", scope: !77, file: !3, line: 410, type: !6)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 408, column: 54)
!78 = distinct !DILexicalBlock(scope: !2, file: !3, line: 408, column: 9)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !80, line: 34, baseType: !15)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!85 = distinct !DISubprogram(name: "aofRewriteBufferReset", scope: !3, file: !3, line: 70, type: !86, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!86 = !DISubroutineType(types: !87)
!87 = !{null}
!88 = !DILocation(line: 71, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !85, file: !3, line: 71, column: 9)
!90 = !{!91, !95, i64 1944}
!91 = !{!"redisServer", !92, i64 0, !95, i64 8, !95, i64 16, !95, i64 24, !92, i64 32, !92, i64 36, !92, i64 40, !95, i64 48, !95, i64 56, !95, i64 64, !95, i64 72, !92, i64 80, !92, i64 84, !92, i64 88, !92, i64 92, !95, i64 96, !95, i64 104, !92, i64 112, !92, i64 116, !93, i64 120, !92, i64 164, !96, i64 168, !92, i64 176, !95, i64 184, !95, i64 192, !95, i64 200, !93, i64 208, !92, i64 216, !92, i64 220, !93, i64 224, !92, i64 352, !95, i64 360, !92, i64 368, !93, i64 372, !92, i64 436, !92, i64 440, !93, i64 444, !92, i64 508, !95, i64 512, !95, i64 520, !95, i64 528, !95, i64 536, !95, i64 544, !95, i64 552, !95, i64 560, !92, i64 568, !97, i64 576, !93, i64 584, !95, i64 840, !96, i64 848, !92, i64 856, !92, i64 860, !96, i64 864, !96, i64 872, !96, i64 880, !96, i64 888, !95, i64 896, !95, i64 904, !95, i64 912, !95, i64 920, !95, i64 928, !95, i64 936, !95, i64 944, !95, i64 952, !95, i64 960, !95, i64 968, !95, i64 976, !95, i64 984, !95, i64 992, !96, i64 1000, !97, i64 1008, !97, i64 1016, !97, i64 1024, !98, i64 1032, !97, i64 1040, !97, i64 1048, !97, i64 1056, !97, i64 1064, !97, i64 1072, !97, i64 1080, !97, i64 1088, !97, i64 1096, !97, i64 1104, !96, i64 1112, !97, i64 1120, !98, i64 1128, !97, i64 1136, !97, i64 1144, !97, i64 1152, !97, i64 1160, !95, i64 1168, !97, i64 1176, !97, i64 1184, !96, i64 1192, !99, i64 1200, !97, i64 1240, !97, i64 1248, !96, i64 1256, !96, i64 1264, !93, i64 1272, !92, i64 1728, !92, i64 1732, !92, i64 1736, !92, i64 1740, !92, i64 1744, !96, i64 1752, !92, i64 1760, !92, i64 1764, !92, i64 1768, !92, i64 1772, !96, i64 1776, !96, i64 1784, !92, i64 1792, !92, i64 1796, !92, i64 1800, !92, i64 1804, !93, i64 1808, !92, i64 1880, !92, i64 1884, !95, i64 1888, !92, i64 1896, !92, i64 1900, !96, i64 1904, !96, i64 1912, !96, i64 1920, !96, i64 1928, !92, i64 1936, !92, i64 1940, !95, i64 1944, !95, i64 1952, !92, i64 1960, !92, i64 1964, !96, i64 1968, !96, i64 1976, !96, i64 1984, !96, i64 1992, !92, i64 2000, !96, i64 2008, !92, i64 2016, !92, i64 2020, !92, i64 2024, !92, i64 2028, !92, i64 2032, !92, i64 2036, !92, i64 2040, !92, i64 2044, !92, i64 2048, !92, i64 2052, !92, i64 2056, !92, i64 2060, !92, i64 2064, !95, i64 2072, !97, i64 2080, !97, i64 2088, !92, i64 2096, !95, i64 2104, !92, i64 2112, !95, i64 2120, !92, i64 2128, !92, i64 2132, !96, i64 2136, !96, i64 2144, !96, i64 2152, !96, i64 2160, !92, i64 2168, !92, i64 2172, !92, i64 2176, !92, i64 2180, !92, i64 2184, !92, i64 2188, !93, i64 2192, !100, i64 2200, !101, i64 2224, !95, i64 2240, !92, i64 2248, !95, i64 2256, !92, i64 2264, !93, i64 2268, !93, i64 2309, !97, i64 2352, !97, i64 2360, !92, i64 2368, !92, i64 2372, !95, i64 2376, !97, i64 2384, !97, i64 2392, !97, i64 2400, !97, i64 2408, !96, i64 2416, !96, i64 2424, !92, i64 2432, !92, i64 2436, !92, i64 2440, !92, i64 2444, !92, i64 2448, !95, i64 2456, !95, i64 2464, !92, i64 2472, !92, i64 2476, !95, i64 2480, !95, i64 2488, !92, i64 2496, !92, i64 2500, !96, i64 2504, !96, i64 2512, !96, i64 2520, !92, i64 2528, !92, i64 2532, !95, i64 2536, !96, i64 2544, !92, i64 2552, !92, i64 2556, !92, i64 2560, !96, i64 2568, !92, i64 2576, !92, i64 2580, !92, i64 2584, !95, i64 2592, !93, i64 2600, !97, i64 2648, !92, i64 2656, !95, i64 2664, !95, i64 2672, !92, i64 2680, !95, i64 2688, !92, i64 2696, !92, i64 2700, !97, i64 2704, !92, i64 2712, !92, i64 2716, !92, i64 2720, !92, i64 2724, !97, i64 2728, !92, i64 2736, !93, i64 2740, !95, i64 2768, !95, i64 2776, !92, i64 2784, !92, i64 2788, !92, i64 2792, !92, i64 2796, !96, i64 2800, !96, i64 2808, !96, i64 2816, !96, i64 2824, !96, i64 2832, !96, i64 2840, !96, i64 2848, !96, i64 2856, !92, i64 2864, !92, i64 2868, !96, i64 2872, !96, i64 2880, !92, i64 2888, !97, i64 2896, !95, i64 2904, !95, i64 2912, !92, i64 2920, !92, i64 2924, !97, i64 2928, !95, i64 2936, !95, i64 2944, !92, i64 2952, !92, i64 2956, !92, i64 2960, !92, i64 2964, !95, i64 2968, !92, i64 2976, !92, i64 2980, !92, i64 2984, !95, i64 2992, !95, i64 3000, !95, i64 3008, !95, i64 3016, !97, i64 3024, !97, i64 3032, !97, i64 3040, !92, i64 3048, !92, i64 3052, !92, i64 3056, !92, i64 3060, !92, i64 3064, !92, i64 3068, !92, i64 3072, !92, i64 3076, !92, i64 3080, !92, i64 3084, !92, i64 3088, !97, i64 3096, !95, i64 3104, !95, i64 3112, !95, i64 3120, !92, i64 3128, !92, i64 3132, !92, i64 3136, !96, i64 3144, !95, i64 3152, !95, i64 3160, !95, i64 3168}
!92 = !{!"int", !93, i64 0}
!93 = !{!"omnipotent char", !94, i64 0}
!94 = !{!"Simple C/C++ TBAA"}
!95 = !{!"any pointer", !93, i64 0}
!96 = !{!"long", !93, i64 0}
!97 = !{!"long long", !93, i64 0}
!98 = !{!"double", !93, i64 0}
!99 = !{!"malloc_stats", !96, i64 0, !96, i64 8, !96, i64 16, !96, i64 24, !96, i64 32}
!100 = !{!"", !92, i64 0, !96, i64 8, !97, i64 16}
!101 = !{!"redisOpArray", !95, i64 0, !92, i64 8}
!102 = !DILocation(line: 71, column: 9, scope: !89)
!103 = !DILocation(line: 71, column: 9, scope: !85)
!104 = !DILocation(line: 72, column: 9, scope: !89)
!105 = !DILocation(line: 74, column: 37, scope: !85)
!106 = !DILocation(line: 74, column: 35, scope: !85)
!107 = !DILocation(line: 75, column: 5, scope: !85)
!108 = !{!109, !95, i64 24}
!109 = !{!"list", !95, i64 0, !95, i64 8, !95, i64 16, !95, i64 24, !95, i64 32, !96, i64 40}
!110 = !DILocation(line: 76, column: 1, scope: !85)
!111 = distinct !DISubprogram(name: "aofRewriteBufferSize", scope: !3, file: !3, line: 79, type: !112, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!17}
!114 = !{!115, !125, !131, !132}
!115 = !DILocalVariable(name: "ln", scope: !111, file: !3, line: 80, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !118, line: 40, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !118, line: 36, size: 192, elements: !120)
!120 = !{!121, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !118, line: 37, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !118, line: 38, baseType: !122, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !118, line: 39, baseType: !10, size: 64, offset: 128)
!125 = !DILocalVariable(name: "li", scope: !111, file: !3, line: 81, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !118, line: 45, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !118, line: 42, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !118, line: 43, baseType: !116, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !127, file: !118, line: 44, baseType: !6, size: 32, offset: 64)
!131 = !DILocalVariable(name: "size", scope: !111, file: !3, line: 82, type: !17)
!132 = !DILocalVariable(name: "block", scope: !133, file: !3, line: 86, type: !134)
!133 = distinct !DILexicalBlock(scope: !111, file: !3, line: 85, column: 33)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "aofrwblock", file: !3, line: 65, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aofrwblock", file: !3, line: 62, size: 83886208, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !136, file: !3, line: 63, baseType: !17, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !136, file: !3, line: 63, baseType: !17, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !136, file: !3, line: 64, baseType: !141, size: 83886080, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 83886080, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 10485760)
!144 = !DILocation(line: 81, column: 5, scope: !111)
!145 = !DILocation(line: 82, column: 19, scope: !111)
!146 = !DILocation(line: 84, column: 23, scope: !111)
!147 = !DILocation(line: 81, column: 14, scope: !111)
!148 = !DILocation(line: 84, column: 5, scope: !111)
!149 = !DILocation(line: 85, column: 17, scope: !111)
!150 = !DILocation(line: 80, column: 15, scope: !111)
!151 = !DILocation(line: 85, column: 5, scope: !111)
!152 = !DILocation(line: 86, column: 29, scope: !133)
!153 = !{!154, !95, i64 16}
!154 = !{!"listNode", !95, i64 0, !95, i64 8, !95, i64 16}
!155 = !DILocation(line: 86, column: 21, scope: !133)
!156 = !DILocation(line: 87, column: 24, scope: !133)
!157 = !{!158, !96, i64 0}
!158 = !{!"aofrwblock", !96, i64 0, !96, i64 8, !93, i64 16}
!159 = !DILocation(line: 87, column: 14, scope: !133)
!160 = distinct !{!160, !151, !161}
!161 = !DILocation(line: 88, column: 5, scope: !111)
!162 = !DILocation(line: 0, scope: !133)
!163 = !DILocation(line: 90, column: 1, scope: !111)
!164 = !DILocation(line: 89, column: 5, scope: !111)
!165 = distinct !DISubprogram(name: "aofChildWriteDiffData", scope: !3, file: !3, line: 95, type: !166, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !228)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !6, !10, !6}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !170, line: 109, baseType: !171)
!170 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !170, line: 97, size: 640, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !191, !198, !220, !221, !222, !227}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !171, file: !170, line: 98, baseType: !6, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !171, file: !170, line: 99, baseType: !6, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !171, file: !170, line: 100, baseType: !16, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !171, file: !170, line: 101, baseType: !79, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !171, file: !170, line: 102, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !170, line: 76, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !170, line: 71, size: 256, elements: !181)
!181 = !{!182, !183, !189, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !180, file: !170, line: 72, baseType: !6, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !180, file: !170, line: 73, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !170, line: 65, baseType: !186)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !188, !6, !10, !6}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !180, file: !170, line: 74, baseType: !184, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !180, file: !170, line: 75, baseType: !10, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !171, file: !170, line: 103, baseType: !192, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !170, line: 94, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !170, line: 91, size: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !194, file: !170, line: 92, baseType: !6, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !194, file: !170, line: 93, baseType: !6, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !171, file: !170, line: 104, baseType: !199, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !170, line: 88, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !170, line: 79, size: 512, elements: !202)
!202 = !{!203, !204, !205, !206, !211, !216, !217, !219}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !170, line: 80, baseType: !16, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !201, file: !170, line: 81, baseType: !15, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !201, file: !170, line: 82, baseType: !15, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !201, file: !170, line: 83, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !170, line: 66, baseType: !209)
!209 = !DISubroutineType(types: !210)
!210 = !{!6, !188, !16, !10}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !201, file: !170, line: 84, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !170, line: 67, baseType: !214)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !188, !10}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !201, file: !170, line: 85, baseType: !10, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !170, line: 86, baseType: !218, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !170, line: 87, baseType: !218, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !171, file: !170, line: 105, baseType: !6, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !171, file: !170, line: 106, baseType: !10, size: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !171, file: !170, line: 107, baseType: !223, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !170, line: 68, baseType: !225)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !188}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !171, file: !170, line: 108, baseType: !223, size: 64, offset: 576)
!228 = !{!229, !230, !231, !232, !233, !234, !235}
!229 = !DILocalVariable(name: "el", arg: 1, scope: !165, file: !3, line: 95, type: !168)
!230 = !DILocalVariable(name: "fd", arg: 2, scope: !165, file: !3, line: 95, type: !6)
!231 = !DILocalVariable(name: "privdata", arg: 3, scope: !165, file: !3, line: 95, type: !10)
!232 = !DILocalVariable(name: "mask", arg: 4, scope: !165, file: !3, line: 95, type: !6)
!233 = !DILocalVariable(name: "ln", scope: !165, file: !3, line: 96, type: !116)
!234 = !DILocalVariable(name: "block", scope: !165, file: !3, line: 97, type: !134)
!235 = !DILocalVariable(name: "nwritten", scope: !165, file: !3, line: 98, type: !11)
!236 = !DILocation(line: 95, column: 41, scope: !165)
!237 = !DILocation(line: 95, column: 49, scope: !165)
!238 = !DILocation(line: 95, column: 59, scope: !165)
!239 = !DILocation(line: 95, column: 73, scope: !165)
!240 = !DILocation(line: 105, column: 14, scope: !241)
!241 = distinct !DILexicalBlock(scope: !165, file: !3, line: 104, column: 14)
!242 = !{!109, !95, i64 0}
!243 = !DILocation(line: 96, column: 15, scope: !165)
!244 = !DILocation(line: 106, column: 17, scope: !241)
!245 = !DILocation(line: 106, column: 26, scope: !241)
!246 = !DILocation(line: 97, column: 17, scope: !165)
!247 = !DILocation(line: 107, column: 20, scope: !248)
!248 = distinct !DILexicalBlock(scope: !241, file: !3, line: 107, column: 13)
!249 = !{!91, !92, i64 2064}
!250 = !DILocation(line: 107, column: 13, scope: !248)
!251 = !DILocation(line: 107, column: 46, scope: !248)
!252 = !DILocation(line: 107, column: 42, scope: !248)
!253 = !DILocation(line: 108, column: 38, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !3, line: 107, column: 53)
!255 = !{!91, !95, i64 72}
!256 = !DILocation(line: 108, column: 48, scope: !254)
!257 = !{!91, !92, i64 2040}
!258 = !DILocation(line: 108, column: 13, scope: !254)
!259 = !DILocation(line: 110, column: 13, scope: !254)
!260 = !DILocation(line: 112, column: 20, scope: !261)
!261 = distinct !DILexicalBlock(scope: !241, file: !3, line: 112, column: 13)
!262 = !DILocation(line: 112, column: 25, scope: !261)
!263 = !DILocation(line: 112, column: 13, scope: !241)
!264 = !DILocation(line: 113, column: 37, scope: !265)
!265 = distinct !DILexicalBlock(scope: !261, file: !3, line: 112, column: 30)
!266 = !DILocation(line: 114, column: 30, scope: !265)
!267 = !DILocation(line: 113, column: 24, scope: !265)
!268 = !DILocation(line: 98, column: 13, scope: !165)
!269 = !DILocation(line: 115, column: 26, scope: !270)
!270 = distinct !DILexicalBlock(scope: !265, file: !3, line: 115, column: 17)
!271 = !DILocation(line: 115, column: 17, scope: !265)
!272 = !DILocation(line: 116, column: 42, scope: !265)
!273 = !DILocation(line: 116, column: 59, scope: !265)
!274 = !DILocation(line: 116, column: 63, scope: !265)
!275 = !DILocation(line: 116, column: 13, scope: !265)
!276 = !DILocation(line: 117, column: 25, scope: !265)
!277 = !DILocation(line: 118, column: 20, scope: !265)
!278 = !DILocation(line: 118, column: 25, scope: !265)
!279 = !{!158, !96, i64 8}
!280 = !DILocation(line: 120, column: 25, scope: !281)
!281 = distinct !DILexicalBlock(scope: !241, file: !3, line: 120, column: 13)
!282 = !DILocation(line: 120, column: 13, scope: !241)
!283 = !DILocation(line: 120, column: 50, scope: !281)
!284 = !DILocation(line: 120, column: 31, scope: !281)
!285 = distinct !{!285, !286, !287}
!286 = !DILocation(line: 104, column: 5, scope: !165)
!287 = !DILocation(line: 121, column: 5, scope: !165)
!288 = !DILocation(line: 122, column: 1, scope: !165)
!289 = distinct !DISubprogram(name: "aofRewriteBufferAppend", scope: !3, file: !3, line: 125, type: !290, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !18, !17}
!292 = !{!293, !294, !295, !296, !297, !301, !304}
!293 = !DILocalVariable(name: "s", arg: 1, scope: !289, file: !3, line: 125, type: !18)
!294 = !DILocalVariable(name: "len", arg: 2, scope: !289, file: !3, line: 125, type: !17)
!295 = !DILocalVariable(name: "ln", scope: !289, file: !3, line: 126, type: !116)
!296 = !DILocalVariable(name: "block", scope: !289, file: !3, line: 127, type: !134)
!297 = !DILocalVariable(name: "thislen", scope: !298, file: !3, line: 133, type: !17)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 132, column: 20)
!299 = distinct !DILexicalBlock(scope: !300, file: !3, line: 132, column: 13)
!300 = distinct !DILexicalBlock(scope: !289, file: !3, line: 129, column: 16)
!301 = !DILocalVariable(name: "numblocks", scope: !302, file: !3, line: 144, type: !6)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 143, column: 18)
!303 = distinct !DILexicalBlock(scope: !300, file: !3, line: 143, column: 13)
!304 = !DILocalVariable(name: "level", scope: !305, file: !3, line: 155, type: !6)
!305 = distinct !DILexicalBlock(scope: !306, file: !3, line: 154, column: 44)
!306 = distinct !DILexicalBlock(scope: !302, file: !3, line: 154, column: 17)
!307 = !DILocation(line: 125, column: 44, scope: !289)
!308 = !DILocation(line: 125, column: 61, scope: !289)
!309 = !DILocation(line: 126, column: 20, scope: !289)
!310 = !{!109, !95, i64 8}
!311 = !DILocation(line: 126, column: 15, scope: !289)
!312 = !DILocation(line: 127, column: 25, scope: !289)
!313 = !DILocation(line: 127, column: 34, scope: !289)
!314 = !DILocation(line: 127, column: 17, scope: !289)
!315 = !DILocation(line: 129, column: 5, scope: !289)
!316 = !DILocation(line: 132, column: 13, scope: !299)
!317 = !DILocation(line: 132, column: 13, scope: !300)
!318 = !DILocation(line: 133, column: 45, scope: !298)
!319 = !DILocation(line: 133, column: 50, scope: !298)
!320 = !DILocation(line: 133, column: 37, scope: !298)
!321 = !DILocation(line: 133, column: 27, scope: !298)
!322 = !DILocation(line: 134, column: 17, scope: !323)
!323 = distinct !DILexicalBlock(scope: !298, file: !3, line: 134, column: 17)
!324 = !DILocation(line: 134, column: 17, scope: !298)
!325 = !DILocation(line: 135, column: 42, scope: !326)
!326 = distinct !DILexicalBlock(scope: !323, file: !3, line: 134, column: 26)
!327 = !DILocation(line: 135, column: 34, scope: !326)
!328 = !DILocation(line: 135, column: 17, scope: !326)
!329 = !DILocation(line: 136, column: 29, scope: !326)
!330 = !DILocation(line: 137, column: 29, scope: !326)
!331 = !DILocation(line: 138, column: 19, scope: !326)
!332 = !DILocation(line: 139, column: 21, scope: !326)
!333 = !DILocation(line: 143, column: 13, scope: !303)
!334 = !DILocation(line: 143, column: 13, scope: !300)
!335 = !DILocation(line: 146, column: 21, scope: !302)
!336 = !DILocation(line: 148, column: 25, scope: !302)
!337 = !{!96, !96, i64 0}
!338 = !DILocation(line: 149, column: 36, scope: !302)
!339 = !DILocation(line: 149, column: 13, scope: !302)
!340 = !DILocation(line: 153, column: 25, scope: !302)
!341 = !{!109, !96, i64 40}
!342 = !DILocation(line: 144, column: 17, scope: !302)
!343 = !DILocation(line: 154, column: 28, scope: !306)
!344 = !DILocation(line: 154, column: 32, scope: !306)
!345 = !DILocation(line: 154, column: 38, scope: !306)
!346 = !DILocation(line: 154, column: 17, scope: !302)
!347 = !DILocation(line: 155, column: 44, scope: !305)
!348 = !DILocation(line: 155, column: 51, scope: !305)
!349 = !DILocation(line: 155, column: 29, scope: !305)
!350 = !DILocation(line: 155, column: 21, scope: !305)
!351 = !DILocation(line: 81, column: 5, scope: !111, inlinedAt: !352)
!352 = distinct !DILocation(line: 158, column: 21, scope: !305)
!353 = !DILocation(line: 82, column: 19, scope: !111, inlinedAt: !352)
!354 = !DILocation(line: 81, column: 14, scope: !111, inlinedAt: !352)
!355 = !DILocation(line: 84, column: 5, scope: !111, inlinedAt: !352)
!356 = !DILocation(line: 85, column: 17, scope: !111, inlinedAt: !352)
!357 = !DILocation(line: 80, column: 15, scope: !111, inlinedAt: !352)
!358 = !DILocation(line: 85, column: 5, scope: !111, inlinedAt: !352)
!359 = !DILocation(line: 86, column: 29, scope: !133, inlinedAt: !352)
!360 = !DILocation(line: 86, column: 21, scope: !133, inlinedAt: !352)
!361 = !DILocation(line: 87, column: 24, scope: !133, inlinedAt: !352)
!362 = !DILocation(line: 87, column: 14, scope: !133, inlinedAt: !352)
!363 = !DILocation(line: 0, scope: !133, inlinedAt: !352)
!364 = !DILocation(line: 90, column: 1, scope: !111, inlinedAt: !352)
!365 = !DILocation(line: 89, column: 5, scope: !111, inlinedAt: !352)
!366 = !DILocation(line: 158, column: 43, scope: !305)
!367 = !DILocation(line: 157, column: 17, scope: !305)
!368 = !DILocation(line: 159, column: 13, scope: !305)
!369 = distinct !{!369, !315, !370}
!370 = !DILocation(line: 161, column: 5, scope: !289)
!371 = !DILocation(line: 165, column: 32, scope: !372)
!372 = distinct !DILexicalBlock(scope: !289, file: !3, line: 165, column: 9)
!373 = !DILocation(line: 165, column: 42, scope: !372)
!374 = !DILocation(line: 165, column: 9, scope: !372)
!375 = !DILocation(line: 165, column: 72, scope: !372)
!376 = !DILocation(line: 165, column: 9, scope: !289)
!377 = !DILocation(line: 166, column: 34, scope: !378)
!378 = distinct !DILexicalBlock(scope: !372, file: !3, line: 165, column: 78)
!379 = !DILocation(line: 166, column: 45, scope: !378)
!380 = !DILocation(line: 166, column: 9, scope: !378)
!381 = !DILocation(line: 168, column: 5, scope: !378)
!382 = !DILocation(line: 169, column: 1, scope: !289)
!383 = distinct !DISubprogram(name: "aofRewriteBufferWrite", scope: !3, file: !3, line: 174, type: !384, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{!11, !6}
!386 = !{!387, !388, !389, !390, !391, !393}
!387 = !DILocalVariable(name: "fd", arg: 1, scope: !383, file: !3, line: 174, type: !6)
!388 = !DILocalVariable(name: "ln", scope: !383, file: !3, line: 175, type: !116)
!389 = !DILocalVariable(name: "li", scope: !383, file: !3, line: 176, type: !126)
!390 = !DILocalVariable(name: "count", scope: !383, file: !3, line: 177, type: !11)
!391 = !DILocalVariable(name: "block", scope: !392, file: !3, line: 181, type: !134)
!392 = distinct !DILexicalBlock(scope: !383, file: !3, line: 180, column: 33)
!393 = !DILocalVariable(name: "nwritten", scope: !392, file: !3, line: 182, type: !11)
!394 = !DILocation(line: 174, column: 35, scope: !383)
!395 = !DILocation(line: 176, column: 5, scope: !383)
!396 = !DILocation(line: 177, column: 13, scope: !383)
!397 = !DILocation(line: 179, column: 23, scope: !383)
!398 = !DILocation(line: 176, column: 14, scope: !383)
!399 = !DILocation(line: 179, column: 5, scope: !383)
!400 = !DILocation(line: 180, column: 17, scope: !383)
!401 = !DILocation(line: 175, column: 15, scope: !383)
!402 = !DILocation(line: 180, column: 5, scope: !383)
!403 = !DILocation(line: 181, column: 29, scope: !392)
!404 = !DILocation(line: 181, column: 21, scope: !392)
!405 = !DILocation(line: 184, column: 20, scope: !406)
!406 = distinct !DILexicalBlock(scope: !392, file: !3, line: 184, column: 13)
!407 = !DILocation(line: 184, column: 13, scope: !406)
!408 = !DILocation(line: 184, column: 13, scope: !392)
!409 = !DILocation(line: 185, column: 33, scope: !410)
!410 = distinct !DILexicalBlock(scope: !406, file: !3, line: 184, column: 26)
!411 = !DILocation(line: 185, column: 24, scope: !410)
!412 = !DILocation(line: 182, column: 17, scope: !392)
!413 = !DILocation(line: 186, column: 45, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !3, line: 186, column: 17)
!415 = !DILocation(line: 186, column: 26, scope: !414)
!416 = !DILocation(line: 186, column: 17, scope: !410)
!417 = !DILocation(line: 187, column: 30, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !3, line: 187, column: 21)
!419 = distinct !DILexicalBlock(scope: !414, file: !3, line: 186, column: 51)
!420 = !DILocation(line: 187, column: 21, scope: !419)
!421 = !DILocation(line: 187, column: 36, scope: !418)
!422 = !DILocation(line: 187, column: 42, scope: !418)
!423 = !{!92, !92, i64 0}
!424 = !DILocation(line: 190, column: 19, scope: !410)
!425 = !DILocation(line: 191, column: 9, scope: !410)
!426 = !DILocation(line: 0, scope: !410)
!427 = !DILocation(line: 0, scope: !383)
!428 = !DILocation(line: 194, column: 1, scope: !383)
!429 = distinct !DISubprogram(name: "aofFsyncInProgress", scope: !3, file: !3, line: 202, type: !430, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!430 = !DISubroutineType(types: !431)
!431 = !{!6}
!432 = !DILocation(line: 203, column: 12, scope: !429)
!433 = !DILocation(line: 203, column: 48, scope: !429)
!434 = !DILocation(line: 203, column: 5, scope: !429)
!435 = distinct !DISubprogram(name: "aof_background_fsync", scope: !3, file: !3, line: 208, type: !4, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !436)
!436 = !{!437}
!437 = !DILocalVariable(name: "fd", arg: 1, scope: !435, file: !3, line: 208, type: !6)
!438 = !DILocation(line: 208, column: 31, scope: !435)
!439 = !DILocation(line: 209, column: 49, scope: !435)
!440 = !DILocation(line: 209, column: 42, scope: !435)
!441 = !DILocation(line: 209, column: 5, scope: !435)
!442 = !DILocation(line: 210, column: 1, scope: !435)
!443 = distinct !DISubprogram(name: "stopAppendOnly", scope: !3, file: !3, line: 234, type: !86, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!444 = !DILocation(line: 235, column: 5, scope: !443)
!445 = !{!91, !92, i64 1880}
!446 = !DILocation(line: 236, column: 5, scope: !443)
!447 = !DILocation(line: 237, column: 24, scope: !443)
!448 = !{!91, !92, i64 1960}
!449 = !DILocation(line: 237, column: 5, scope: !443)
!450 = !DILocation(line: 238, column: 18, scope: !443)
!451 = !DILocation(line: 238, column: 5, scope: !443)
!452 = !DILocation(line: 240, column: 19, scope: !443)
!453 = !DILocation(line: 241, column: 28, scope: !443)
!454 = !{!91, !92, i64 1964}
!455 = !DILocation(line: 242, column: 22, scope: !443)
!456 = !DILocation(line: 243, column: 5, scope: !443)
!457 = !DILocation(line: 244, column: 1, scope: !443)
!458 = !DILocation(line: 337, column: 30, scope: !2)
!459 = !DILocation(line: 339, column: 9, scope: !2)
!460 = !DILocation(line: 342, column: 23, scope: !461)
!461 = distinct !DILexicalBlock(scope: !2, file: !3, line: 342, column: 9)
!462 = !{!91, !95, i64 1952}
!463 = !DILocalVariable(name: "s", arg: 1, scope: !464, file: !26, line: 87, type: !469)
!464 = distinct !DISubprogram(name: "sdslen", scope: !26, file: !26, line: 87, type: !465, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !471)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !469}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !468, line: 58, baseType: !17)
!468 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !26, line: 43, baseType: !20)
!471 = !{!463, !472}
!472 = !DILocalVariable(name: "flags", scope: !464, file: !26, line: 88, type: !19)
!473 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !474)
!474 = distinct !DILocation(line: 342, column: 9, scope: !461)
!475 = !DILocation(line: 88, column: 27, scope: !464, inlinedAt: !474)
!476 = !{!93, !93, i64 0}
!477 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !474)
!478 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !474)
!479 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !474)
!480 = !DILocation(line: 0, scope: !481)
!481 = distinct !DILexicalBlock(scope: !2, file: !3, line: 358, column: 9)
!482 = !{!91, !92, i64 1884}
!483 = !DILocation(line: 348, column: 52, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !3, line: 348, column: 13)
!485 = distinct !DILexicalBlock(scope: !461, file: !3, line: 342, column: 38)
!486 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !474)
!487 = distinct !DILexicalBlock(scope: !464, file: !26, line: 89, column: 33)
!488 = !DILocation(line: 91, column: 13, scope: !487, inlinedAt: !474)
!489 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !474)
!490 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !474)
!491 = !DILocation(line: 93, column: 13, scope: !487, inlinedAt: !474)
!492 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !474)
!493 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !474)
!494 = !{!495, !495, i64 0}
!495 = !{!"short", !93, i64 0}
!496 = !DILocation(line: 95, column: 13, scope: !487, inlinedAt: !474)
!497 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !474)
!498 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !474)
!499 = !DILocation(line: 97, column: 13, scope: !487, inlinedAt: !474)
!500 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !474)
!501 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !474)
!502 = !DILocation(line: 99, column: 13, scope: !487, inlinedAt: !474)
!503 = !DILocation(line: 0, scope: !487, inlinedAt: !474)
!504 = !DILocation(line: 342, column: 32, scope: !461)
!505 = !DILocation(line: 342, column: 9, scope: !2)
!506 = !DILocation(line: 349, column: 20, scope: !484)
!507 = !{!91, !96, i64 1928}
!508 = !DILocation(line: 349, column: 47, scope: !484)
!509 = !{!91, !96, i64 1920}
!510 = !DILocation(line: 349, column: 37, scope: !484)
!511 = !DILocation(line: 349, column: 64, scope: !484)
!512 = !DILocation(line: 350, column: 20, scope: !484)
!513 = !{!91, !96, i64 2872}
!514 = !DILocation(line: 350, column: 38, scope: !484)
!515 = !{!91, !96, i64 1976}
!516 = !DILocation(line: 350, column: 29, scope: !484)
!517 = !DILocation(line: 350, column: 53, scope: !484)
!518 = !DILocation(line: 203, column: 12, scope: !429, inlinedAt: !519)
!519 = distinct !DILocation(line: 351, column: 34, scope: !484)
!520 = !DILocation(line: 203, column: 48, scope: !429, inlinedAt: !519)
!521 = !DILocation(line: 203, column: 5, scope: !429, inlinedAt: !519)
!522 = !DILocation(line: 348, column: 13, scope: !485)
!523 = !DILocation(line: 358, column: 9, scope: !2)
!524 = !DILocation(line: 203, column: 12, scope: !429, inlinedAt: !525)
!525 = distinct !DILocation(line: 359, column: 28, scope: !481)
!526 = !DILocation(line: 203, column: 48, scope: !429, inlinedAt: !525)
!527 = !DILocation(line: 203, column: 5, scope: !429, inlinedAt: !525)
!528 = !DILocation(line: 361, column: 16, scope: !529)
!529 = distinct !DILexicalBlock(scope: !2, file: !3, line: 361, column: 9)
!530 = !DILocation(line: 361, column: 26, scope: !529)
!531 = !DILocation(line: 361, column: 52, scope: !529)
!532 = !DILocation(line: 361, column: 48, scope: !529)
!533 = !DILocation(line: 366, column: 24, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !3, line: 366, column: 17)
!535 = distinct !DILexicalBlock(scope: !536, file: !3, line: 365, column: 31)
!536 = distinct !DILexicalBlock(scope: !537, file: !3, line: 365, column: 13)
!537 = distinct !DILexicalBlock(scope: !529, file: !3, line: 361, column: 59)
!538 = !{!91, !96, i64 1968}
!539 = !DILocation(line: 366, column: 50, scope: !534)
!540 = !DILocation(line: 0, scope: !541)
!541 = distinct !DILexicalBlock(scope: !534, file: !3, line: 371, column: 24)
!542 = !DILocation(line: 366, column: 17, scope: !535)
!543 = !DILocation(line: 369, column: 50, scope: !544)
!544 = distinct !DILexicalBlock(scope: !534, file: !3, line: 366, column: 56)
!545 = !DILocation(line: 370, column: 17, scope: !544)
!546 = !DILocation(line: 371, column: 40, scope: !541)
!547 = !DILocation(line: 371, column: 75, scope: !541)
!548 = !DILocation(line: 371, column: 24, scope: !534)
!549 = !DILocation(line: 378, column: 37, scope: !535)
!550 = !{!91, !96, i64 2008}
!551 = !DILocation(line: 379, column: 13, scope: !535)
!552 = !DILocation(line: 380, column: 9, scope: !535)
!553 = !DILocation(line: 388, column: 5, scope: !554)
!554 = distinct !DILexicalBlock(scope: !2, file: !3, line: 388, column: 5)
!555 = !{!91, !97, i64 3096}
!556 = !DILocation(line: 388, column: 5, scope: !2)
!557 = !DILocation(line: 388, column: 5, scope: !558)
!558 = distinct !DILexicalBlock(scope: !554, file: !3, line: 388, column: 5)
!559 = !DILocation(line: 340, column: 14, scope: !2)
!560 = !DILocation(line: 389, column: 32, scope: !2)
!561 = !DILocation(line: 389, column: 46, scope: !2)
!562 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !563)
!563 = distinct !DILocation(line: 389, column: 54, scope: !2)
!564 = !DILocation(line: 88, column: 27, scope: !464, inlinedAt: !563)
!565 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !563)
!566 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !563)
!567 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !563)
!568 = !DILocation(line: 91, column: 13, scope: !487, inlinedAt: !563)
!569 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !563)
!570 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !563)
!571 = !DILocation(line: 93, column: 13, scope: !487, inlinedAt: !563)
!572 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !563)
!573 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !563)
!574 = !DILocation(line: 95, column: 13, scope: !487, inlinedAt: !563)
!575 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !563)
!576 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !563)
!577 = !DILocation(line: 97, column: 13, scope: !487, inlinedAt: !563)
!578 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !563)
!579 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !563)
!580 = !DILocation(line: 99, column: 13, scope: !487, inlinedAt: !563)
!581 = !DILocation(line: 0, scope: !487, inlinedAt: !563)
!582 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !563)
!583 = !DILocalVariable(name: "fd", arg: 1, scope: !584, file: !3, line: 297, type: !6)
!584 = distinct !DISubprogram(name: "aofWrite", scope: !3, file: !3, line: 297, type: !585, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !592)
!585 = !DISubroutineType(types: !586)
!586 = !{!11, !6, !587, !589}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !590, line: 40, baseType: !591)
!590 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !14, line: 129, baseType: !17)
!592 = !{!583, !593, !594, !595, !596}
!593 = !DILocalVariable(name: "buf", arg: 2, scope: !584, file: !3, line: 297, type: !587)
!594 = !DILocalVariable(name: "len", arg: 3, scope: !584, file: !3, line: 297, type: !589)
!595 = !DILocalVariable(name: "nwritten", scope: !584, file: !3, line: 298, type: !11)
!596 = !DILocalVariable(name: "totwritten", scope: !584, file: !3, line: 298, type: !11)
!597 = !DILocation(line: 297, column: 22, scope: !584, inlinedAt: !598)
!598 = distinct !DILocation(line: 389, column: 16, scope: !2)
!599 = !DILocation(line: 297, column: 38, scope: !584, inlinedAt: !598)
!600 = !DILocation(line: 297, column: 50, scope: !584, inlinedAt: !598)
!601 = !DILocation(line: 298, column: 13, scope: !584, inlinedAt: !598)
!602 = !DILocation(line: 298, column: 27, scope: !584, inlinedAt: !598)
!603 = !DILocation(line: 300, column: 5, scope: !584, inlinedAt: !598)
!604 = !DILocation(line: 301, column: 20, scope: !605, inlinedAt: !598)
!605 = distinct !DILexicalBlock(scope: !584, file: !3, line: 300, column: 16)
!606 = !DILocation(line: 303, column: 22, scope: !607, inlinedAt: !598)
!607 = distinct !DILexicalBlock(scope: !605, file: !3, line: 303, column: 13)
!608 = !DILocation(line: 303, column: 13, scope: !605, inlinedAt: !598)
!609 = !DILocation(line: 304, column: 17, scope: !610, inlinedAt: !598)
!610 = distinct !DILexicalBlock(scope: !611, file: !3, line: 304, column: 17)
!611 = distinct !DILexicalBlock(scope: !607, file: !3, line: 303, column: 27)
!612 = !DILocation(line: 304, column: 23, scope: !610, inlinedAt: !598)
!613 = !DILocation(line: 304, column: 17, scope: !611, inlinedAt: !598)
!614 = distinct !{!614, !615, !616}
!615 = !DILocation(line: 300, column: 5, scope: !584)
!616 = !DILocation(line: 313, column: 5, scope: !584)
!617 = !DILocation(line: 307, column: 20, scope: !611, inlinedAt: !598)
!618 = !DILocation(line: 307, column: 13, scope: !611, inlinedAt: !598)
!619 = !DILocation(line: 310, column: 13, scope: !605, inlinedAt: !598)
!620 = !DILocation(line: 311, column: 13, scope: !605, inlinedAt: !598)
!621 = !DILocation(line: 312, column: 20, scope: !605, inlinedAt: !598)
!622 = !DILocation(line: 0, scope: !584, inlinedAt: !598)
!623 = !DILocation(line: 316, column: 1, scope: !584, inlinedAt: !598)
!624 = !DILocation(line: 338, column: 13, scope: !2)
!625 = !DILocation(line: 390, column: 5, scope: !626)
!626 = distinct !DILexicalBlock(scope: !2, file: !3, line: 390, column: 5)
!627 = !DILocation(line: 390, column: 5, scope: !2)
!628 = !DILocation(line: 390, column: 5, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !3, line: 390, column: 5)
!630 = !DILocation(line: 0, scope: !558)
!631 = !DILocation(line: 396, column: 9, scope: !2)
!632 = !DILocation(line: 397, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 397, column: 9)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 396, column: 27)
!635 = distinct !DILexicalBlock(scope: !2, file: !3, line: 396, column: 9)
!636 = !DILocation(line: 398, column: 23, scope: !637)
!637 = distinct !DILexicalBlock(scope: !635, file: !3, line: 398, column: 16)
!638 = !{!91, !92, i64 1940}
!639 = !DILocation(line: 398, column: 53, scope: !637)
!640 = !DILocation(line: 398, column: 43, scope: !637)
!641 = !DILocation(line: 0, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !3, line: 401, column: 9)
!643 = distinct !DILexicalBlock(scope: !637, file: !3, line: 400, column: 12)
!644 = !DILocation(line: 0, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !3, line: 399, column: 9)
!646 = distinct !DILexicalBlock(scope: !637, file: !3, line: 398, column: 74)
!647 = !DILocation(line: 399, column: 9, scope: !645)
!648 = !DILocation(line: 401, column: 9, scope: !642)
!649 = !DILocation(line: 403, column: 5, scope: !650)
!650 = distinct !DILexicalBlock(scope: !2, file: !3, line: 403, column: 5)
!651 = !DILocation(line: 406, column: 38, scope: !2)
!652 = !DILocation(line: 408, column: 44, scope: !78)
!653 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !654)
!654 = distinct !DILocation(line: 408, column: 30, scope: !78)
!655 = !DILocation(line: 88, column: 27, scope: !464, inlinedAt: !654)
!656 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !654)
!657 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !654)
!658 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !654)
!659 = !DILocation(line: 91, column: 13, scope: !487, inlinedAt: !654)
!660 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !654)
!661 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !654)
!662 = !DILocation(line: 93, column: 13, scope: !487, inlinedAt: !654)
!663 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !654)
!664 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !654)
!665 = !DILocation(line: 95, column: 13, scope: !487, inlinedAt: !654)
!666 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !654)
!667 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !654)
!668 = !DILocation(line: 97, column: 13, scope: !487, inlinedAt: !654)
!669 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !654)
!670 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !654)
!671 = !DILocation(line: 99, column: 13, scope: !487, inlinedAt: !654)
!672 = !DILocation(line: 0, scope: !487, inlinedAt: !654)
!673 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !654)
!674 = !DILocation(line: 408, column: 18, scope: !78)
!675 = !DILocation(line: 408, column: 9, scope: !2)
!676 = !DILocation(line: 410, column: 13, scope: !77)
!677 = !DILocation(line: 413, column: 21, scope: !678)
!678 = distinct !DILexicalBlock(scope: !77, file: !3, line: 413, column: 13)
!679 = !DILocation(line: 413, column: 32, scope: !678)
!680 = !DILocation(line: 413, column: 30, scope: !678)
!681 = !DILocation(line: 413, column: 54, scope: !678)
!682 = !DILocation(line: 413, column: 13, scope: !77)
!683 = !DILocation(line: 415, column: 34, scope: !684)
!684 = distinct !DILexicalBlock(scope: !678, file: !3, line: 413, column: 82)
!685 = !DILocation(line: 416, column: 9, scope: !684)
!686 = !DILocation(line: 419, column: 22, scope: !687)
!687 = distinct !DILexicalBlock(scope: !77, file: !3, line: 419, column: 13)
!688 = !DILocation(line: 419, column: 13, scope: !77)
!689 = !DILocation(line: 420, column: 17, scope: !690)
!690 = distinct !DILexicalBlock(scope: !687, file: !3, line: 419, column: 29)
!691 = !DILocation(line: 422, column: 30, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !3, line: 420, column: 26)
!693 = distinct !DILexicalBlock(scope: !690, file: !3, line: 420, column: 17)
!694 = !DILocation(line: 422, column: 21, scope: !692)
!695 = !DILocation(line: 421, column: 17, scope: !692)
!696 = !DILocation(line: 423, column: 47, scope: !692)
!697 = !DILocation(line: 424, column: 13, scope: !692)
!698 = !DILocation(line: 426, column: 17, scope: !699)
!699 = distinct !DILexicalBlock(scope: !687, file: !3, line: 425, column: 16)
!700 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !701)
!701 = distinct !DILocation(line: 431, column: 51, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !3, line: 426, column: 26)
!703 = distinct !DILexicalBlock(scope: !699, file: !3, line: 426, column: 17)
!704 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !701)
!705 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !701)
!706 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !701)
!707 = !DILocation(line: 91, column: 13, scope: !487, inlinedAt: !701)
!708 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !701)
!709 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !701)
!710 = !DILocation(line: 93, column: 13, scope: !487, inlinedAt: !701)
!711 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !701)
!712 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !701)
!713 = !DILocation(line: 95, column: 13, scope: !487, inlinedAt: !701)
!714 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !701)
!715 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !701)
!716 = !DILocation(line: 97, column: 13, scope: !487, inlinedAt: !701)
!717 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !701)
!718 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !701)
!719 = !DILocation(line: 99, column: 13, scope: !487, inlinedAt: !701)
!720 = !DILocation(line: 0, scope: !487, inlinedAt: !701)
!721 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !701)
!722 = !DILocation(line: 427, column: 17, scope: !702)
!723 = !DILocation(line: 432, column: 13, scope: !702)
!724 = !DILocation(line: 434, column: 34, scope: !725)
!725 = distinct !DILexicalBlock(scope: !699, file: !3, line: 434, column: 17)
!726 = !DILocation(line: 434, column: 49, scope: !725)
!727 = !DILocation(line: 434, column: 17, scope: !725)
!728 = !DILocation(line: 434, column: 67, scope: !725)
!729 = !DILocation(line: 434, column: 17, scope: !699)
!730 = !DILocation(line: 439, column: 56, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 435, column: 30)
!732 = distinct !DILexicalBlock(scope: !733, file: !3, line: 435, column: 21)
!733 = distinct !DILexicalBlock(scope: !725, file: !3, line: 434, column: 74)
!734 = !DILocation(line: 439, column: 47, scope: !731)
!735 = !DILocation(line: 436, column: 21, scope: !731)
!736 = !DILocation(line: 440, column: 17, scope: !731)
!737 = !DILocation(line: 0, scope: !699)
!738 = !{!91, !92, i64 2028}
!739 = !DILocation(line: 450, column: 20, scope: !740)
!740 = distinct !DILexicalBlock(scope: !77, file: !3, line: 450, column: 13)
!741 = !DILocation(line: 389, column: 14, scope: !2)
!742 = !DILocation(line: 450, column: 30, scope: !740)
!743 = !DILocation(line: 450, column: 13, scope: !77)
!744 = !DILocation(line: 455, column: 13, scope: !745)
!745 = distinct !DILexicalBlock(scope: !740, file: !3, line: 450, column: 51)
!746 = !DILocation(line: 456, column: 13, scope: !745)
!747 = !DILocation(line: 461, column: 42, scope: !748)
!748 = distinct !DILexicalBlock(scope: !740, file: !3, line: 457, column: 16)
!749 = !{!91, !92, i64 2024}
!750 = !DILocation(line: 465, column: 26, scope: !751)
!751 = distinct !DILexicalBlock(scope: !748, file: !3, line: 465, column: 17)
!752 = !DILocation(line: 465, column: 17, scope: !748)
!753 = !DILocation(line: 466, column: 41, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 465, column: 31)
!755 = !DILocation(line: 467, column: 33, scope: !754)
!756 = !DILocation(line: 467, column: 17, scope: !754)
!757 = !DILocation(line: 468, column: 13, scope: !754)
!758 = !DILocation(line: 474, column: 20, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 474, column: 13)
!760 = distinct !DILexicalBlock(scope: !78, file: !3, line: 471, column: 12)
!761 = !DILocation(line: 474, column: 42, scope: !759)
!762 = !DILocation(line: 474, column: 13, scope: !760)
!763 = !DILocation(line: 475, column: 13, scope: !764)
!764 = distinct !DILexicalBlock(scope: !759, file: !3, line: 474, column: 52)
!765 = !DILocation(line: 477, column: 42, scope: !764)
!766 = !DILocation(line: 484, column: 24, scope: !767)
!767 = distinct !DILexicalBlock(scope: !2, file: !3, line: 484, column: 9)
!768 = !DILocation(line: 88, column: 27, scope: !464, inlinedAt: !769)
!769 = distinct !DILocation(line: 484, column: 10, scope: !767)
!770 = !DILocation(line: 478, column: 9, scope: !764)
!771 = !DILocation(line: 480, column: 29, scope: !2)
!772 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !769)
!773 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !769)
!774 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !769)
!775 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !769)
!776 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !769)
!777 = !DILocalVariable(name: "s", arg: 1, scope: !778, file: !26, line: 104, type: !469)
!778 = distinct !DISubprogram(name: "sdsavail", scope: !26, file: !26, line: 104, type: !465, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !779)
!779 = !{!777, !780, !781, !784, !786, !788}
!780 = !DILocalVariable(name: "flags", scope: !778, file: !26, line: 105, type: !19)
!781 = !DILocalVariable(name: "sh", scope: !782, file: !26, line: 111, type: !24)
!782 = distinct !DILexicalBlock(scope: !783, file: !26, line: 110, column: 26)
!783 = distinct !DILexicalBlock(scope: !778, file: !26, line: 106, column: 33)
!784 = !DILocalVariable(name: "sh", scope: !785, file: !26, line: 115, type: !39)
!785 = distinct !DILexicalBlock(scope: !783, file: !26, line: 114, column: 27)
!786 = !DILocalVariable(name: "sh", scope: !787, file: !26, line: 119, type: !49)
!787 = distinct !DILexicalBlock(scope: !783, file: !26, line: 118, column: 27)
!788 = !DILocalVariable(name: "sh", scope: !789, file: !26, line: 123, type: !59)
!789 = distinct !DILexicalBlock(scope: !783, file: !26, line: 122, column: 27)
!790 = !DILocation(line: 104, column: 41, scope: !778, inlinedAt: !791)
!791 = distinct !DILocation(line: 484, column: 33, scope: !767)
!792 = !DILocation(line: 105, column: 19, scope: !778, inlinedAt: !791)
!793 = !DILocation(line: 106, column: 5, scope: !778, inlinedAt: !791)
!794 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !769)
!795 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !769)
!796 = !DILocation(line: 111, column: 13, scope: !782, inlinedAt: !791)
!797 = !DILocation(line: 112, column: 24, scope: !782, inlinedAt: !791)
!798 = !DILocation(line: 112, column: 20, scope: !782, inlinedAt: !791)
!799 = !DILocation(line: 112, column: 30, scope: !782, inlinedAt: !791)
!800 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !769)
!801 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !769)
!802 = !DILocation(line: 115, column: 13, scope: !785, inlinedAt: !791)
!803 = !DILocation(line: 116, column: 24, scope: !785, inlinedAt: !791)
!804 = !DILocation(line: 116, column: 20, scope: !785, inlinedAt: !791)
!805 = !DILocation(line: 116, column: 30, scope: !785, inlinedAt: !791)
!806 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !769)
!807 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !769)
!808 = !DILocation(line: 119, column: 13, scope: !787, inlinedAt: !791)
!809 = !DILocation(line: 120, column: 24, scope: !787, inlinedAt: !791)
!810 = !DILocation(line: 120, column: 30, scope: !787, inlinedAt: !791)
!811 = !DILocation(line: 120, column: 20, scope: !787, inlinedAt: !791)
!812 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !769)
!813 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !769)
!814 = !DILocation(line: 123, column: 13, scope: !789, inlinedAt: !791)
!815 = !DILocation(line: 124, column: 24, scope: !789, inlinedAt: !791)
!816 = !DILocation(line: 124, column: 30, scope: !789, inlinedAt: !791)
!817 = !DILocation(line: 0, scope: !818, inlinedAt: !791)
!818 = distinct !DILexicalBlock(scope: !783, file: !26, line: 107, column: 26)
!819 = !DILocation(line: 128, column: 1, scope: !778, inlinedAt: !791)
!820 = !DILocation(line: 484, column: 32, scope: !767)
!821 = !DILocation(line: 484, column: 59, scope: !767)
!822 = !DILocation(line: 484, column: 9, scope: !2)
!823 = !DILocation(line: 485, column: 9, scope: !824)
!824 = distinct !DILexicalBlock(scope: !767, file: !3, line: 484, column: 67)
!825 = !DILocation(line: 486, column: 5, scope: !824)
!826 = !DILocation(line: 487, column: 9, scope: !827)
!827 = distinct !DILexicalBlock(scope: !767, file: !3, line: 486, column: 12)
!828 = !DILocation(line: 488, column: 26, scope: !827)
!829 = !DILocation(line: 488, column: 24, scope: !827)
!830 = !DILocation(line: 494, column: 16, scope: !831)
!831 = distinct !DILexicalBlock(scope: !2, file: !3, line: 494, column: 9)
!832 = !{!91, !92, i64 1896}
!833 = !DILocation(line: 494, column: 9, scope: !831)
!834 = !DILocation(line: 494, column: 40, scope: !831)
!835 = !DILocation(line: 495, column: 17, scope: !831)
!836 = !DILocation(line: 495, column: 47, scope: !831)
!837 = !DILocation(line: 495, column: 37, scope: !831)
!838 = !DILocation(line: 499, column: 16, scope: !839)
!839 = distinct !DILexicalBlock(scope: !2, file: !3, line: 499, column: 9)
!840 = !DILocation(line: 499, column: 9, scope: !2)
!841 = !DILocation(line: 502, column: 9, scope: !842)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 502, column: 9)
!843 = distinct !DILexicalBlock(scope: !839, file: !3, line: 499, column: 47)
!844 = !DILocation(line: 502, column: 9, scope: !843)
!845 = !DILocation(line: 502, column: 9, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !3, line: 502, column: 9)
!847 = !DILocation(line: 503, column: 28, scope: !843)
!848 = !DILocation(line: 503, column: 9, scope: !843)
!849 = !DILocation(line: 504, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !843, file: !3, line: 504, column: 9)
!851 = !DILocation(line: 504, column: 9, scope: !843)
!852 = !DILocation(line: 504, column: 9, scope: !853)
!853 = distinct !DILexicalBlock(scope: !850, file: !3, line: 504, column: 9)
!854 = !DILocation(line: 505, column: 9, scope: !855)
!855 = distinct !DILexicalBlock(scope: !843, file: !3, line: 505, column: 9)
!856 = !DILocation(line: 506, column: 42, scope: !843)
!857 = !DILocation(line: 506, column: 33, scope: !843)
!858 = !DILocation(line: 507, column: 40, scope: !843)
!859 = !DILocation(line: 507, column: 31, scope: !843)
!860 = !DILocation(line: 508, column: 5, scope: !843)
!861 = !DILocation(line: 509, column: 24, scope: !862)
!862 = distinct !DILexicalBlock(scope: !839, file: !3, line: 508, column: 16)
!863 = !DILocation(line: 509, column: 42, scope: !862)
!864 = !DILocation(line: 509, column: 33, scope: !862)
!865 = !DILocation(line: 508, column: 16, scope: !839)
!866 = !DILocation(line: 510, column: 14, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 510, column: 13)
!868 = distinct !DILexicalBlock(scope: !862, file: !3, line: 509, column: 59)
!869 = !DILocation(line: 510, column: 13, scope: !868)
!870 = !DILocation(line: 511, column: 41, scope: !871)
!871 = distinct !DILexicalBlock(scope: !867, file: !3, line: 510, column: 32)
!872 = !DILocation(line: 208, column: 31, scope: !435, inlinedAt: !873)
!873 = distinct !DILocation(line: 511, column: 13, scope: !871)
!874 = !DILocation(line: 209, column: 49, scope: !435, inlinedAt: !873)
!875 = !DILocation(line: 209, column: 42, scope: !435, inlinedAt: !873)
!876 = !DILocation(line: 209, column: 5, scope: !435, inlinedAt: !873)
!877 = !DILocation(line: 210, column: 1, scope: !435, inlinedAt: !873)
!878 = !DILocation(line: 512, column: 46, scope: !871)
!879 = !DILocation(line: 512, column: 37, scope: !871)
!880 = !DILocation(line: 514, column: 40, scope: !868)
!881 = !DILocation(line: 513, column: 9, scope: !871)
!882 = !DILocation(line: 514, column: 31, scope: !868)
!883 = !DILocation(line: 515, column: 5, scope: !868)
!884 = !DILocation(line: 516, column: 1, scope: !2)
!885 = distinct !DISubprogram(name: "killAppendOnlyChild", scope: !3, file: !3, line: 213, type: !86, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !886)
!886 = !{!887}
!887 = !DILocalVariable(name: "statloc", scope: !885, file: !3, line: 214, type: !6)
!888 = !DILocalVariable(name: "tmpfile", scope: !889, file: !3, line: 1633, type: !896)
!889 = distinct !DISubprogram(name: "aofRemoveTempFile", scope: !3, file: !3, line: 1632, type: !890, isLocal: false, isDefinition: true, scopeLine: 1632, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !894)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !892}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !893, line: 61, baseType: !6)
!893 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!894 = !{!895, !888}
!895 = !DILocalVariable(name: "childpid", arg: 1, scope: !889, file: !3, line: 1632, type: !892)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 256)
!899 = !DILocation(line: 1633, column: 10, scope: !889, inlinedAt: !900)
!900 = distinct !DILocation(line: 225, column: 5, scope: !885)
!901 = !DILocation(line: 214, column: 5, scope: !885)
!902 = !DILocation(line: 216, column: 16, scope: !903)
!903 = distinct !DILexicalBlock(scope: !885, file: !3, line: 216, column: 9)
!904 = !DILocation(line: 216, column: 30, scope: !903)
!905 = !DILocation(line: 216, column: 9, scope: !885)
!906 = !DILocation(line: 219, column: 9, scope: !885)
!907 = !DILocation(line: 218, column: 5, scope: !885)
!908 = !DILocation(line: 220, column: 21, scope: !909)
!909 = distinct !DILexicalBlock(scope: !885, file: !3, line: 220, column: 9)
!910 = !DILocation(line: 220, column: 9, scope: !909)
!911 = !DILocation(line: 220, column: 44, scope: !909)
!912 = !DILocation(line: 220, column: 9, scope: !885)
!913 = !DILocation(line: 214, column: 9, scope: !885)
!914 = !DILocation(line: 221, column: 15, scope: !915)
!915 = distinct !DILexicalBlock(scope: !909, file: !3, line: 220, column: 51)
!916 = !DILocation(line: 221, column: 48, scope: !915)
!917 = !DILocation(line: 221, column: 38, scope: !915)
!918 = !DILocation(line: 221, column: 9, scope: !915)
!919 = distinct !{!919, !918, !920}
!920 = !DILocation(line: 221, column: 62, scope: !915)
!921 = !DILocation(line: 71, column: 16, scope: !89, inlinedAt: !922)
!922 = distinct !DILocation(line: 224, column: 5, scope: !885)
!923 = !DILocation(line: 71, column: 9, scope: !89, inlinedAt: !922)
!924 = !DILocation(line: 71, column: 9, scope: !85, inlinedAt: !922)
!925 = !DILocation(line: 72, column: 9, scope: !89, inlinedAt: !922)
!926 = !DILocation(line: 74, column: 37, scope: !85, inlinedAt: !922)
!927 = !DILocation(line: 74, column: 35, scope: !85, inlinedAt: !922)
!928 = !DILocation(line: 75, column: 5, scope: !85, inlinedAt: !922)
!929 = !DILocation(line: 76, column: 1, scope: !85, inlinedAt: !922)
!930 = !DILocation(line: 225, column: 30, scope: !885)
!931 = !DILocation(line: 1632, column: 30, scope: !889, inlinedAt: !900)
!932 = !DILocation(line: 1633, column: 5, scope: !889, inlinedAt: !900)
!933 = !DILocation(line: 1635, column: 5, scope: !889, inlinedAt: !900)
!934 = !DILocation(line: 1636, column: 5, scope: !889, inlinedAt: !900)
!935 = !DILocation(line: 1637, column: 1, scope: !889, inlinedAt: !900)
!936 = !DILocation(line: 226, column: 26, scope: !885)
!937 = !DILocation(line: 227, column: 35, scope: !885)
!938 = !{!91, !96, i64 1992}
!939 = !DILocation(line: 1533, column: 30, scope: !940, inlinedAt: !941)
!940 = distinct !DISubprogram(name: "aofClosePipes", scope: !3, file: !3, line: 1532, type: !86, isLocal: false, isDefinition: true, scopeLine: 1532, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!941 = distinct !DILocation(line: 229, column: 5, scope: !885)
!942 = !DILocation(line: 1533, column: 40, scope: !940, inlinedAt: !941)
!943 = !{!91, !92, i64 2052}
!944 = !DILocation(line: 1533, column: 5, scope: !940, inlinedAt: !941)
!945 = !DILocation(line: 1534, column: 30, scope: !940, inlinedAt: !941)
!946 = !DILocation(line: 1534, column: 40, scope: !940, inlinedAt: !941)
!947 = !DILocation(line: 1534, column: 5, scope: !940, inlinedAt: !941)
!948 = !DILocation(line: 1535, column: 18, scope: !940, inlinedAt: !941)
!949 = !DILocation(line: 1535, column: 5, scope: !940, inlinedAt: !941)
!950 = !DILocation(line: 1536, column: 18, scope: !940, inlinedAt: !941)
!951 = !{!91, !92, i64 2044}
!952 = !DILocation(line: 1536, column: 5, scope: !940, inlinedAt: !941)
!953 = !DILocation(line: 1537, column: 18, scope: !940, inlinedAt: !941)
!954 = !{!91, !92, i64 2048}
!955 = !DILocation(line: 1537, column: 5, scope: !940, inlinedAt: !941)
!956 = !DILocation(line: 1538, column: 18, scope: !940, inlinedAt: !941)
!957 = !DILocation(line: 1538, column: 5, scope: !940, inlinedAt: !941)
!958 = !DILocation(line: 1539, column: 18, scope: !940, inlinedAt: !941)
!959 = !{!91, !92, i64 2056}
!960 = !DILocation(line: 1539, column: 5, scope: !940, inlinedAt: !941)
!961 = !DILocation(line: 1540, column: 18, scope: !940, inlinedAt: !941)
!962 = !{!91, !92, i64 2060}
!963 = !DILocation(line: 1540, column: 5, scope: !940, inlinedAt: !941)
!964 = !DILocation(line: 1541, column: 1, scope: !940, inlinedAt: !941)
!965 = !DILocation(line: 230, column: 1, scope: !885)
!966 = distinct !DISubprogram(name: "startAppendOnly", scope: !3, file: !3, line: 248, type: !430, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !967)
!967 = !{!968, !972, !973}
!968 = !DILocalVariable(name: "cwd", scope: !966, file: !3, line: 249, type: !969)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 1024)
!972 = !DILocalVariable(name: "newfd", scope: !966, file: !3, line: 250, type: !6)
!973 = !DILocalVariable(name: "cwdp", scope: !974, file: !3, line: 255, type: !20)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 254, column: 22)
!975 = distinct !DILexicalBlock(scope: !966, file: !3, line: 254, column: 9)
!976 = !DILocation(line: 249, column: 5, scope: !966)
!977 = !DILocation(line: 249, column: 10, scope: !966)
!978 = !DILocation(line: 252, column: 25, scope: !966)
!979 = !{!91, !95, i64 1888}
!980 = !DILocation(line: 252, column: 13, scope: !966)
!981 = !DILocation(line: 250, column: 9, scope: !966)
!982 = !DILocation(line: 253, column: 5, scope: !966)
!983 = !DILocation(line: 254, column: 15, scope: !975)
!984 = !DILocation(line: 254, column: 9, scope: !966)
!985 = !DILocation(line: 255, column: 22, scope: !974)
!986 = !DILocation(line: 255, column: 15, scope: !974)
!987 = !DILocation(line: 260, column: 20, scope: !974)
!988 = !DILocation(line: 261, column: 13, scope: !974)
!989 = !DILocation(line: 262, column: 22, scope: !974)
!990 = !DILocation(line: 262, column: 13, scope: !974)
!991 = !DILocation(line: 257, column: 9, scope: !974)
!992 = !DILocation(line: 265, column: 16, scope: !993)
!993 = distinct !DILexicalBlock(scope: !966, file: !3, line: 265, column: 9)
!994 = !{!91, !92, i64 2096}
!995 = !DILocation(line: 265, column: 30, scope: !993)
!996 = !DILocation(line: 265, column: 9, scope: !966)
!997 = !DILocation(line: 266, column: 38, scope: !998)
!998 = distinct !DILexicalBlock(scope: !993, file: !3, line: 265, column: 37)
!999 = !{!91, !92, i64 1936}
!1000 = !DILocation(line: 267, column: 9, scope: !998)
!1001 = !DILocation(line: 268, column: 5, scope: !998)
!1002 = !DILocation(line: 272, column: 20, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 272, column: 13)
!1004 = distinct !DILexicalBlock(scope: !993, file: !3, line: 268, column: 12)
!1005 = !DILocation(line: 272, column: 34, scope: !1003)
!1006 = !DILocation(line: 272, column: 13, scope: !1004)
!1007 = !DILocation(line: 273, column: 13, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 272, column: 41)
!1009 = !DILocation(line: 274, column: 13, scope: !1008)
!1010 = !DILocation(line: 275, column: 9, scope: !1008)
!1011 = !DILocation(line: 276, column: 13, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 276, column: 13)
!1013 = !DILocation(line: 276, column: 47, scope: !1012)
!1014 = !DILocation(line: 276, column: 13, scope: !1004)
!1015 = !DILocation(line: 277, column: 13, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 276, column: 57)
!1017 = !DILocation(line: 278, column: 13, scope: !1016)
!1018 = !DILocation(line: 279, column: 13, scope: !1016)
!1019 = !DILocation(line: 284, column: 22, scope: !966)
!1020 = !DILocation(line: 285, column: 36, scope: !966)
!1021 = !DILocation(line: 285, column: 27, scope: !966)
!1022 = !DILocation(line: 286, column: 19, scope: !966)
!1023 = !DILocation(line: 287, column: 5, scope: !966)
!1024 = !DILocation(line: 0, scope: !1016)
!1025 = !DILocation(line: 288, column: 1, scope: !966)
!1026 = distinct !DISubprogram(name: "rewriteAppendOnlyFileBackground", scope: !3, file: !3, line: 1559, type: !430, isLocal: false, isDefinition: true, scopeLine: 1559, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1027)
!1027 = !{!1028, !1029, !1030, !1033}
!1028 = !DILocalVariable(name: "childpid", scope: !1026, file: !3, line: 1560, type: !892)
!1029 = !DILocalVariable(name: "start", scope: !1026, file: !3, line: 1561, type: !16)
!1030 = !DILocalVariable(name: "tmpfile", scope: !1031, file: !3, line: 1568, type: !896)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1567, column: 35)
!1032 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1567, column: 9)
!1033 = !DILocalVariable(name: "private_dirty", scope: !1034, file: !3, line: 1575, type: !589)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1574, column: 53)
!1035 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1574, column: 13)
!1036 = !DILocation(line: 1563, column: 16, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1563, column: 9)
!1038 = !DILocation(line: 1563, column: 46, scope: !1037)
!1039 = !DILocation(line: 1563, column: 36, scope: !1037)
!1040 = !DILocation(line: 1564, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1564, column: 9)
!1042 = !DILocation(line: 1564, column: 26, scope: !1041)
!1043 = !DILocation(line: 1564, column: 9, scope: !1026)
!1044 = !DILocation(line: 1565, column: 5, scope: !1026)
!1045 = !DILocation(line: 1566, column: 13, scope: !1026)
!1046 = !DILocation(line: 1561, column: 15, scope: !1026)
!1047 = !DILocation(line: 1567, column: 21, scope: !1032)
!1048 = !DILocation(line: 1560, column: 11, scope: !1026)
!1049 = !DILocation(line: 1567, column: 29, scope: !1032)
!1050 = !DILocation(line: 1567, column: 9, scope: !1026)
!1051 = !DILocation(line: 1568, column: 9, scope: !1031)
!1052 = !DILocation(line: 1568, column: 14, scope: !1031)
!1053 = !DILocation(line: 1571, column: 9, scope: !1031)
!1054 = !DILocation(line: 1572, column: 9, scope: !1031)
!1055 = !DILocation(line: 1573, column: 65, scope: !1031)
!1056 = !DILocation(line: 1573, column: 9, scope: !1031)
!1057 = !DILocation(line: 1574, column: 13, scope: !1035)
!1058 = !DILocation(line: 1574, column: 44, scope: !1035)
!1059 = !DILocation(line: 1574, column: 13, scope: !1031)
!1060 = !DILocation(line: 1575, column: 36, scope: !1034)
!1061 = !DILocation(line: 1575, column: 20, scope: !1034)
!1062 = !DILocation(line: 1577, column: 17, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 1577, column: 17)
!1064 = !DILocation(line: 1577, column: 17, scope: !1034)
!1065 = !DILocation(line: 1580, column: 34, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 1577, column: 32)
!1067 = !DILocation(line: 1578, column: 17, scope: !1066)
!1068 = !DILocation(line: 1581, column: 13, scope: !1066)
!1069 = !DILocation(line: 1583, column: 45, scope: !1034)
!1070 = !{!91, !96, i64 2208}
!1071 = !DILocation(line: 1584, column: 13, scope: !1034)
!1072 = !DILocation(line: 1585, column: 13, scope: !1034)
!1073 = !DILocation(line: 1586, column: 9, scope: !1034)
!1074 = !DILocation(line: 1587, column: 13, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1586, column: 16)
!1076 = !DILocation(line: 1589, column: 5, scope: !1032)
!1077 = !DILocation(line: 1616, column: 5, scope: !1026)
!1078 = !DILocation(line: 1591, column: 33, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1589, column: 12)
!1080 = !DILocation(line: 1591, column: 41, scope: !1079)
!1081 = !DILocation(line: 1591, column: 31, scope: !1079)
!1082 = !{!91, !97, i64 1120}
!1083 = !DILocation(line: 1592, column: 42, scope: !1079)
!1084 = !DILocation(line: 1592, column: 33, scope: !1079)
!1085 = !DILocation(line: 1592, column: 64, scope: !1079)
!1086 = !DILocation(line: 1592, column: 83, scope: !1079)
!1087 = !DILocation(line: 1592, column: 76, scope: !1079)
!1088 = !DILocation(line: 1592, column: 74, scope: !1079)
!1089 = !DILocation(line: 1592, column: 98, scope: !1079)
!1090 = !DILocation(line: 1592, column: 31, scope: !1079)
!1091 = !{!91, !98, i64 1128}
!1092 = !DILocation(line: 1593, column: 9, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 1593, column: 9)
!1094 = !DILocation(line: 1593, column: 9, scope: !1079)
!1095 = !DILocation(line: 1594, column: 22, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 1594, column: 13)
!1097 = !DILocation(line: 1594, column: 13, scope: !1079)
!1098 = !DILocation(line: 1595, column: 13, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 1594, column: 29)
!1100 = !DILocation(line: 1598, column: 26, scope: !1099)
!1101 = !DILocation(line: 1598, column: 17, scope: !1099)
!1102 = !DILocation(line: 1596, column: 13, scope: !1099)
!1103 = !DILocation(line: 1533, column: 30, scope: !940, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 1599, column: 13, scope: !1099)
!1105 = !DILocation(line: 1533, column: 40, scope: !940, inlinedAt: !1104)
!1106 = !DILocation(line: 1533, column: 5, scope: !940, inlinedAt: !1104)
!1107 = !DILocation(line: 1534, column: 30, scope: !940, inlinedAt: !1104)
!1108 = !DILocation(line: 1534, column: 40, scope: !940, inlinedAt: !1104)
!1109 = !DILocation(line: 1534, column: 5, scope: !940, inlinedAt: !1104)
!1110 = !DILocation(line: 1535, column: 18, scope: !940, inlinedAt: !1104)
!1111 = !DILocation(line: 1535, column: 5, scope: !940, inlinedAt: !1104)
!1112 = !DILocation(line: 1536, column: 18, scope: !940, inlinedAt: !1104)
!1113 = !DILocation(line: 1536, column: 5, scope: !940, inlinedAt: !1104)
!1114 = !DILocation(line: 1537, column: 18, scope: !940, inlinedAt: !1104)
!1115 = !DILocation(line: 1537, column: 5, scope: !940, inlinedAt: !1104)
!1116 = !DILocation(line: 1538, column: 18, scope: !940, inlinedAt: !1104)
!1117 = !DILocation(line: 1538, column: 5, scope: !940, inlinedAt: !1104)
!1118 = !DILocation(line: 1539, column: 18, scope: !940, inlinedAt: !1104)
!1119 = !DILocation(line: 1539, column: 5, scope: !940, inlinedAt: !1104)
!1120 = !DILocation(line: 1540, column: 18, scope: !940, inlinedAt: !1104)
!1121 = !DILocation(line: 1540, column: 5, scope: !940, inlinedAt: !1104)
!1122 = !DILocation(line: 1541, column: 1, scope: !940, inlinedAt: !1104)
!1123 = !DILocation(line: 1600, column: 13, scope: !1099)
!1124 = !DILocation(line: 1602, column: 9, scope: !1079)
!1125 = !DILocation(line: 1604, column: 38, scope: !1079)
!1126 = !DILocation(line: 1605, column: 41, scope: !1079)
!1127 = !DILocation(line: 1605, column: 39, scope: !1079)
!1128 = !DILocation(line: 1606, column: 30, scope: !1079)
!1129 = !DILocation(line: 1607, column: 9, scope: !1079)
!1130 = !DILocation(line: 1612, column: 32, scope: !1079)
!1131 = !DILocation(line: 1613, column: 9, scope: !1079)
!1132 = !DILocation(line: 1614, column: 9, scope: !1079)
!1133 = !DILocation(line: 0, scope: !1079)
!1134 = !DILocation(line: 1617, column: 1, scope: !1026)
!1135 = !DILocation(line: 297, column: 22, scope: !584)
!1136 = !DILocation(line: 297, column: 38, scope: !584)
!1137 = !DILocation(line: 297, column: 50, scope: !584)
!1138 = !DILocation(line: 298, column: 13, scope: !584)
!1139 = !DILocation(line: 298, column: 27, scope: !584)
!1140 = !DILocation(line: 301, column: 20, scope: !605)
!1141 = !DILocation(line: 303, column: 22, scope: !607)
!1142 = !DILocation(line: 303, column: 13, scope: !605)
!1143 = !DILocation(line: 304, column: 17, scope: !610)
!1144 = !DILocation(line: 304, column: 23, scope: !610)
!1145 = !DILocation(line: 304, column: 17, scope: !611)
!1146 = !DILocation(line: 307, column: 20, scope: !611)
!1147 = !DILocation(line: 307, column: 13, scope: !611)
!1148 = !DILocation(line: 310, column: 13, scope: !605)
!1149 = !DILocation(line: 311, column: 13, scope: !605)
!1150 = !DILocation(line: 312, column: 20, scope: !605)
!1151 = !DILocation(line: 0, scope: !584)
!1152 = !DILocation(line: 316, column: 1, scope: !584)
!1153 = distinct !DISubprogram(name: "catAppendOnlyGenericCommand", scope: !3, file: !3, line: 518, type: !1154, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1166)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!470, !470, !6, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !75, line: 622, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !75, line: 614, size: 128, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1159, file: !75, line: 615, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1159, file: !75, line: 616, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1159, file: !75, line: 617, baseType: !55, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1159, file: !75, line: 620, baseType: !6, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1159, file: !75, line: 621, baseType: !10, size: 64, offset: 64)
!1166 = !{!1167, !1168, !1169, !1170, !1174, !1175, !1176}
!1167 = !DILocalVariable(name: "dst", arg: 1, scope: !1153, file: !3, line: 518, type: !470)
!1168 = !DILocalVariable(name: "argc", arg: 2, scope: !1153, file: !3, line: 518, type: !6)
!1169 = !DILocalVariable(name: "argv", arg: 3, scope: !1153, file: !3, line: 518, type: !1156)
!1170 = !DILocalVariable(name: "buf", scope: !1153, file: !3, line: 519, type: !1171)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !1172)
!1172 = !{!1173}
!1173 = !DISubrange(count: 32)
!1174 = !DILocalVariable(name: "len", scope: !1153, file: !3, line: 520, type: !6)
!1175 = !DILocalVariable(name: "j", scope: !1153, file: !3, line: 520, type: !6)
!1176 = !DILocalVariable(name: "o", scope: !1153, file: !3, line: 521, type: !1157)
!1177 = !DILocation(line: 518, column: 37, scope: !1153)
!1178 = !DILocation(line: 518, column: 46, scope: !1153)
!1179 = !DILocation(line: 518, column: 59, scope: !1153)
!1180 = !DILocation(line: 519, column: 5, scope: !1153)
!1181 = !DILocation(line: 519, column: 10, scope: !1153)
!1182 = !DILocation(line: 523, column: 12, scope: !1153)
!1183 = !DILocation(line: 524, column: 26, scope: !1153)
!1184 = !DILocation(line: 524, column: 43, scope: !1153)
!1185 = !DILocation(line: 524, column: 13, scope: !1153)
!1186 = !DILocation(line: 524, column: 12, scope: !1153)
!1187 = !DILocation(line: 520, column: 9, scope: !1153)
!1188 = !DILocation(line: 525, column: 12, scope: !1153)
!1189 = !DILocation(line: 525, column: 5, scope: !1153)
!1190 = !DILocation(line: 525, column: 16, scope: !1153)
!1191 = !DILocation(line: 526, column: 12, scope: !1153)
!1192 = !DILocation(line: 526, column: 5, scope: !1153)
!1193 = !DILocation(line: 526, column: 16, scope: !1153)
!1194 = !DILocation(line: 527, column: 29, scope: !1153)
!1195 = !DILocation(line: 527, column: 11, scope: !1153)
!1196 = !DILocation(line: 520, column: 14, scope: !1153)
!1197 = !DILocation(line: 529, column: 19, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 529, column: 5)
!1199 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 529, column: 5)
!1200 = !DILocation(line: 529, column: 5, scope: !1199)
!1201 = !DILocation(line: 530, column: 30, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 529, column: 32)
!1203 = !{!95, !95, i64 0}
!1204 = !DILocation(line: 530, column: 13, scope: !1202)
!1205 = !DILocation(line: 521, column: 11, scope: !1153)
!1206 = !DILocation(line: 531, column: 16, scope: !1202)
!1207 = !DILocation(line: 532, column: 57, scope: !1202)
!1208 = !{!1209, !95, i64 8}
!1209 = !{!"redisObject", !92, i64 0, !92, i64 0, !92, i64 1, !92, i64 4, !95, i64 8}
!1210 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !1211)
!1211 = distinct !DILocation(line: 532, column: 47, scope: !1202)
!1212 = !DILocation(line: 88, column: 27, scope: !464, inlinedAt: !1211)
!1213 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !1211)
!1214 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !1211)
!1215 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !1211)
!1216 = !DILocation(line: 91, column: 13, scope: !487, inlinedAt: !1211)
!1217 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !1211)
!1218 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !1211)
!1219 = !DILocation(line: 93, column: 13, scope: !487, inlinedAt: !1211)
!1220 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !1211)
!1221 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !1211)
!1222 = !DILocation(line: 95, column: 13, scope: !487, inlinedAt: !1211)
!1223 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !1211)
!1224 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !1211)
!1225 = !DILocation(line: 97, column: 13, scope: !487, inlinedAt: !1211)
!1226 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !1211)
!1227 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !1211)
!1228 = !DILocation(line: 99, column: 13, scope: !487, inlinedAt: !1211)
!1229 = !DILocation(line: 0, scope: !487, inlinedAt: !1211)
!1230 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !1211)
!1231 = !DILocation(line: 532, column: 17, scope: !1202)
!1232 = !DILocation(line: 532, column: 16, scope: !1202)
!1233 = !DILocation(line: 533, column: 16, scope: !1202)
!1234 = !DILocation(line: 533, column: 9, scope: !1202)
!1235 = !DILocation(line: 533, column: 20, scope: !1202)
!1236 = !DILocation(line: 534, column: 16, scope: !1202)
!1237 = !DILocation(line: 534, column: 9, scope: !1202)
!1238 = !DILocation(line: 534, column: 20, scope: !1202)
!1239 = !DILocation(line: 535, column: 33, scope: !1202)
!1240 = !DILocation(line: 535, column: 15, scope: !1202)
!1241 = !DILocation(line: 536, column: 32, scope: !1202)
!1242 = !DILocation(line: 87, column: 39, scope: !464, inlinedAt: !1243)
!1243 = distinct !DILocation(line: 536, column: 36, scope: !1202)
!1244 = !DILocation(line: 88, column: 27, scope: !464, inlinedAt: !1243)
!1245 = !DILocation(line: 88, column: 19, scope: !464, inlinedAt: !1243)
!1246 = !DILocation(line: 89, column: 5, scope: !464, inlinedAt: !1243)
!1247 = !DILocation(line: 91, column: 20, scope: !487, inlinedAt: !1243)
!1248 = !DILocation(line: 91, column: 13, scope: !487, inlinedAt: !1243)
!1249 = !DILocation(line: 93, column: 20, scope: !487, inlinedAt: !1243)
!1250 = !DILocation(line: 93, column: 34, scope: !487, inlinedAt: !1243)
!1251 = !DILocation(line: 93, column: 13, scope: !487, inlinedAt: !1243)
!1252 = !DILocation(line: 95, column: 20, scope: !487, inlinedAt: !1243)
!1253 = !DILocation(line: 95, column: 35, scope: !487, inlinedAt: !1243)
!1254 = !DILocation(line: 95, column: 13, scope: !487, inlinedAt: !1243)
!1255 = !DILocation(line: 97, column: 20, scope: !487, inlinedAt: !1243)
!1256 = !DILocation(line: 97, column: 35, scope: !487, inlinedAt: !1243)
!1257 = !DILocation(line: 97, column: 13, scope: !487, inlinedAt: !1243)
!1258 = !DILocation(line: 99, column: 20, scope: !487, inlinedAt: !1243)
!1259 = !DILocation(line: 99, column: 35, scope: !487, inlinedAt: !1243)
!1260 = !DILocation(line: 99, column: 13, scope: !487, inlinedAt: !1243)
!1261 = !DILocation(line: 0, scope: !487, inlinedAt: !1243)
!1262 = !DILocation(line: 102, column: 1, scope: !464, inlinedAt: !1243)
!1263 = !DILocation(line: 536, column: 15, scope: !1202)
!1264 = !DILocation(line: 537, column: 15, scope: !1202)
!1265 = !DILocation(line: 538, column: 9, scope: !1202)
!1266 = !DILocation(line: 529, column: 28, scope: !1198)
!1267 = distinct !{!1267, !1200, !1268}
!1268 = !DILocation(line: 539, column: 5, scope: !1199)
!1269 = !DILocation(line: 0, scope: !1202)
!1270 = !DILocation(line: 541, column: 1, scope: !1153)
!1271 = !DILocation(line: 540, column: 5, scope: !1153)
!1272 = distinct !DISubprogram(name: "catAppendOnlyExpireAtCommand", scope: !3, file: !3, line: 550, type: !1273, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1485)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!470, !470, !1275, !1157, !1157}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !75, line: 1307, size: 640, elements: !1277)
!1277 = !{!1278, !1279, !1471, !1472, !1473, !1474, !1480, !1481, !1482, !1483, !1484}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !75, line: 1308, baseType: !20, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !1276, file: !75, line: 1309, baseType: !1280, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !75, line: 1305, baseType: !1282)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !1284}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !75, line: 780, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !75, line: 723, size: 135360, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1421, !1422, !1426, !1427, !1443, !1444, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1286, file: !75, line: 724, baseType: !63, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1286, file: !75, line: 725, baseType: !6, size: 32, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !1286, file: !75, line: 726, baseType: !1291, size: 64, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !75, line: 656, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !75, line: 647, size: 512, elements: !1294)
!1294 = !{!1295, !1357, !1358, !1359, !1360, !1361, !1362, !1363}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !1293, file: !75, line: 648, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !1298, line: 82, baseType: !1299)
!1298 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !1298, line: 76, size: 768, elements: !1300)
!1300 = !{!1301, !1326, !1327, !1355, !1356}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1299, file: !1298, line: 77, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !1298, line: 65, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !1298, line: 58, size: 384, elements: !1305)
!1305 = !{!1306, !1312, !1316, !1317, !1321, !1325}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !1304, file: !1298, line: 59, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!63, !1310}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !1304, file: !1298, line: 60, baseType: !1313, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!10, !10, !1310}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !1304, file: !1298, line: 61, baseType: !1313, size: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !1304, file: !1298, line: 62, baseType: !1318, size: 64, offset: 192)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!6, !10, !1310, !1310}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !1304, file: !1298, line: 63, baseType: !1322, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{null, !10, !10}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !1304, file: !1298, line: 64, baseType: !1322, size: 64, offset: 320)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !1299, file: !1298, line: 78, baseType: !10, size: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1299, file: !1298, line: 79, baseType: !1328, size: 512, offset: 128)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1329, size: 512, elements: !1353)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !1298, line: 74, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !1298, line: 69, size: 256, elements: !1331)
!1331 = !{!1332, !1350, !1351, !1352}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1330, file: !1298, line: 70, baseType: !1333, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !1298, line: 56, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !1298, line: 47, size: 192, elements: !1337)
!1337 = !{!1338, !1339, !1348}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1336, file: !1298, line: 48, baseType: !10, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1336, file: !1298, line: 54, baseType: !1340, size: 64, offset: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1336, file: !1298, line: 49, size: 64, elements: !1341)
!1341 = !{!1342, !1343, !1344, !1347}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1340, file: !1298, line: 50, baseType: !10, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !1340, file: !1298, line: 51, baseType: !63, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !1340, file: !1298, line: 52, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !30, line: 56, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !32, line: 103, baseType: !15)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !1340, file: !1298, line: 53, baseType: !23, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1336, file: !1298, line: 55, baseType: !1349, size: 64, offset: 128)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1330, file: !1298, line: 71, baseType: !17, size: 64, offset: 64)
