; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bio.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bio.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pthread_mutex_t_ = type opaque
%struct.pthread_cond_t_ = type opaque
%struct.list = type { %struct.listNode*, %struct.listNode*, i8* (i8*)*, void (i8*)*, i32 (i8*, i8*)*, i64 }
%struct.listNode = type { %struct.listNode*, %struct.listNode*, i8* }
%struct.pte_handle_t = type { i8*, i32 }
%struct.pthread_attr_t_ = type opaque
%struct.pthread_mutexattr_t_ = type opaque
%struct.pthread_condattr_t_ = type opaque
%struct.redisObject = type { i32, i32, i8* }
%struct.dict = type { %struct.dictType*, i8*, [2 x %struct.dictht], i64, i64 }
%struct.dictType = type { i64 (i8*)*, i8* (i8*, i8*)*, i8* (i8*, i8*)*, i32 (i8*, i8*, i8*)*, void (i8*, i8*)*, void (i8*, i8*)* }
%struct.dictht = type { %struct.dictEntry**, i64, i64, i64 }
%struct.dictEntry = type { i8*, %union.anon, %struct.dictEntry* }
%union.anon = type { i8* }
%struct.zskiplist = type { %struct.zskiplistNode*, %struct.zskiplistNode*, i64, i32 }
%struct.zskiplistNode = type { i8*, double, %struct.zskiplistNode*, [0 x %struct.zskiplistLevel] }
%struct.zskiplistLevel = type { %struct.zskiplistNode*, i64 }

@bio_mutex = internal global [3 x %struct.pthread_mutex_t_*] zeroinitializer, align 16, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bio_mutex", scope: !2, file: !3, line: 65, type: !83, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !27)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bio.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 435, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22}
!9 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!10 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!11 = !DIEnumerator(name: "PTHREAD_INHERIT_SCHED", value: 0)
!12 = !DIEnumerator(name: "PTHREAD_EXPLICIT_SCHED", value: 1)
!13 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS", value: 0)
!14 = !DIEnumerator(name: "PTHREAD_SCOPE_SYSTEM", value: 1)
!15 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS_VFPU", value: 2)
!16 = !DIEnumerator(name: "PTHREAD_CANCEL_ENABLE", value: 0)
!17 = !DIEnumerator(name: "PTHREAD_CANCEL_DISABLE", value: 1)
!18 = !DIEnumerator(name: "PTHREAD_CANCEL_ASYNCHRONOUS", value: 0)
!19 = !DIEnumerator(name: "PTHREAD_CANCEL_DEFERRED", value: 1)
!20 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!21 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!22 = !DIEnumerator(name: "PTHREAD_BARRIER_SERIAL_THREAD", value: -1)
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!27 = !{!28, !0, !40, !46, !48, !79}
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "bio_threads", scope: !2, file: !3, line: 64, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 384, elements: !38)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !6, line: 413, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !6, line: 411, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 395, size: 128, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !33, file: !6, line: 398, baseType: !24, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !6, line: 399, baseType: !37, size: 32, offset: 64)
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !{!39}
!39 = !DISubrange(count: 3)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "bio_newjob_cond", scope: !2, file: !3, line: 66, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 192, elements: !38)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !6, line: 419, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_cond_t_", file: !6, line: 419, flags: DIFlagFwdDecl)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "bio_step_cond", scope: !2, file: !3, line: 67, type: !42, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "bio_jobs", scope: !2, file: !3, line: 68, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 192, elements: !38)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !53, line: 54, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !53, line: 47, size: 384, elements: !55)
!55 = !{!56, !65, !66, !70, !74, !78}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !54, file: !53, line: 48, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !53, line: 40, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !53, line: 36, size: 192, elements: !60)
!60 = !{!61, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !53, line: 37, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !53, line: 38, baseType: !62, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !59, file: !53, line: 39, baseType: !24, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !54, file: !53, line: 49, baseType: !57, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !54, file: !53, line: 50, baseType: !67, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!24, !24}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !54, file: !53, line: 51, baseType: !71, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !24}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !54, file: !53, line: 52, baseType: !75, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!7, !24, !24}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !53, line: 53, baseType: !25, size: 64, offset: 320)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "bio_pending", scope: !2, file: !3, line: 75, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 192, elements: !38)
!82 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !38)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !6, line: 417, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !6, line: 417, flags: DIFlagFwdDecl)
!87 = !{i32 2, !"Dwarf Version", i32 4}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{i32 1, !"wchar_size", i32 4}
!90 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!91 = distinct !DISubprogram(name: "bioInit", scope: !3, file: !3, line: 96, type: !92, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !94)
!92 = !DISubroutineType(types: !93)
!93 = !{null}
!94 = !{!95, !99, !100, !105, !106}
!95 = !DILocalVariable(name: "attr", scope: !91, file: !3, line: 97, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !6, line: 414, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_attr_t_", file: !6, line: 414, flags: DIFlagFwdDecl)
!99 = !DILocalVariable(name: "thread", scope: !91, file: !3, line: 98, type: !31)
!100 = !DILocalVariable(name: "stacksize", scope: !91, file: !3, line: 99, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 40, baseType: !103)
!102 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !104, line: 129, baseType: !25)
!104 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!105 = !DILocalVariable(name: "j", scope: !91, file: !3, line: 100, type: !7)
!106 = !DILocalVariable(name: "arg", scope: !107, file: !3, line: 122, type: !24)
!107 = distinct !DILexicalBlock(scope: !108, file: !3, line: 121, column: 39)
!108 = distinct !DILexicalBlock(scope: !109, file: !3, line: 121, column: 5)
!109 = distinct !DILexicalBlock(scope: !91, file: !3, line: 121, column: 5)
!110 = !DILocation(line: 97, column: 5, scope: !91)
!111 = !DILocation(line: 98, column: 5, scope: !91)
!112 = !DILocation(line: 99, column: 5, scope: !91)
!113 = !DILocation(line: 100, column: 9, scope: !91)
!114 = !DILocation(line: 104, column: 9, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 103, column: 39)
!116 = distinct !DILexicalBlock(scope: !117, file: !3, line: 103, column: 5)
!117 = distinct !DILexicalBlock(scope: !91, file: !3, line: 103, column: 5)
!118 = !DILocation(line: 105, column: 9, scope: !115)
!119 = !DILocation(line: 106, column: 9, scope: !115)
!120 = !DILocation(line: 107, column: 23, scope: !115)
!121 = !DILocation(line: 107, column: 21, scope: !115)
!122 = !{!123, !123, i64 0}
!123 = !{!"any pointer", !124, i64 0}
!124 = !{!"omnipotent char", !125, i64 0}
!125 = !{!"Simple C/C++ TBAA"}
!126 = !DILocation(line: 108, column: 24, scope: !115)
!127 = !{!128, !128, i64 0}
!128 = !{!"long long", !124, i64 0}
!129 = !DILocation(line: 97, column: 20, scope: !91)
!130 = !DILocation(line: 112, column: 5, scope: !91)
!131 = !DILocation(line: 99, column: 12, scope: !91)
!132 = !DILocation(line: 113, column: 5, scope: !91)
!133 = !DILocation(line: 114, column: 10, scope: !134)
!134 = distinct !DILexicalBlock(scope: !91, file: !3, line: 114, column: 9)
!135 = !{!136, !136, i64 0}
!136 = !{!"long", !124, i64 0}
!137 = !DILocation(line: 114, column: 9, scope: !91)
!138 = !DILocation(line: 114, column: 31, scope: !134)
!139 = !DILocation(line: 115, column: 5, scope: !91)
!140 = !DILocation(line: 115, column: 22, scope: !91)
!141 = !DILocation(line: 115, column: 59, scope: !91)
!142 = distinct !{!142, !139, !143}
!143 = !DILocation(line: 115, column: 62, scope: !91)
!144 = !DILocation(line: 115, column: 12, scope: !91)
!145 = !DILocation(line: 116, column: 5, scope: !91)
!146 = !DILocation(line: 122, column: 15, scope: !107)
!147 = !DILocation(line: 98, column: 15, scope: !91)
!148 = !DILocation(line: 123, column: 13, scope: !149)
!149 = distinct !DILexicalBlock(scope: !107, file: !3, line: 123, column: 13)
!150 = !DILocation(line: 123, column: 72, scope: !149)
!151 = !DILocation(line: 123, column: 13, scope: !107)
!152 = !DILocation(line: 124, column: 13, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !3, line: 123, column: 78)
!154 = !DILocation(line: 125, column: 13, scope: !153)
!155 = !DILocation(line: 127, column: 26, scope: !107)
!156 = !{i64 0, i64 8, !122, i64 8, i64 4, !157}
!157 = !{!158, !158, i64 0}
!158 = !{!"int", !124, i64 0}
!159 = !DILocation(line: 129, column: 1, scope: !91)
!160 = distinct !DISubprogram(name: "bioProcessBackgroundJobs", scope: !3, file: !3, line: 145, type: !68, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !161)
!161 = !{!162, !163, !173, !174, !178}
!162 = !DILocalVariable(name: "arg", arg: 1, scope: !160, file: !3, line: 145, type: !24)
!163 = !DILocalVariable(name: "job", scope: !160, file: !3, line: 146, type: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_job", file: !3, line: 79, size: 256, elements: !166)
!166 = !{!167, !170, !171, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !165, file: !3, line: 80, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !169, line: 34, baseType: !26)
!169 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "arg1", scope: !165, file: !3, line: 83, baseType: !24, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "arg2", scope: !165, file: !3, line: 83, baseType: !24, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "arg3", scope: !165, file: !3, line: 83, baseType: !24, size: 64, offset: 192)
!173 = !DILocalVariable(name: "type", scope: !160, file: !3, line: 147, type: !25)
!174 = !DILocalVariable(name: "sigset", scope: !160, file: !3, line: 148, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !176, line: 64, baseType: !177)
!176 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !176, line: 63, baseType: !25)
!178 = !DILocalVariable(name: "ln", scope: !179, file: !3, line: 172, type: !57)
!179 = distinct !DILexicalBlock(scope: !160, file: !3, line: 171, column: 14)
!180 = !DILocation(line: 145, column: 38, scope: !160)
!181 = !DILocation(line: 147, column: 26, scope: !160)
!182 = !DILocation(line: 147, column: 19, scope: !160)
!183 = !DILocation(line: 148, column: 5, scope: !160)
!184 = !DILocation(line: 151, column: 14, scope: !185)
!185 = distinct !DILexicalBlock(scope: !160, file: !3, line: 151, column: 9)
!186 = !DILocation(line: 151, column: 9, scope: !160)
!187 = !DILocation(line: 152, column: 9, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !3, line: 151, column: 30)
!189 = !DILocation(line: 216, column: 1, scope: !160)
!190 = !DILocation(line: 154, column: 9, scope: !188)
!191 = !DILocation(line: 159, column: 5, scope: !160)
!192 = !DILocation(line: 160, column: 5, scope: !160)
!193 = !DILocation(line: 162, column: 25, scope: !160)
!194 = !DILocation(line: 162, column: 5, scope: !160)
!195 = !DILocation(line: 148, column: 14, scope: !160)
!196 = !DILocation(line: 165, column: 5, scope: !160)
!197 = !DILocation(line: 166, column: 5, scope: !160)
!198 = !DILocation(line: 167, column: 9, scope: !199)
!199 = distinct !DILexicalBlock(scope: !160, file: !3, line: 167, column: 9)
!200 = !DILocation(line: 167, column: 9, scope: !160)
!201 = !DILocation(line: 169, column: 73, scope: !199)
!202 = !DILocation(line: 169, column: 64, scope: !199)
!203 = !DILocation(line: 168, column: 9, scope: !199)
!204 = !DILocation(line: 171, column: 5, scope: !160)
!205 = !DILocation(line: 175, column: 13, scope: !206)
!206 = distinct !DILexicalBlock(scope: !179, file: !3, line: 175, column: 13)
!207 = !{!208, !136, i64 40}
!208 = !{!"list", !123, i64 0, !123, i64 8, !123, i64 16, !123, i64 24, !123, i64 32, !136, i64 40}
!209 = !DILocation(line: 175, column: 40, scope: !206)
!210 = !DILocation(line: 175, column: 13, scope: !179)
!211 = !DILocation(line: 176, column: 13, scope: !212)
!212 = distinct !DILexicalBlock(scope: !206, file: !3, line: 175, column: 46)
!213 = !DILocation(line: 177, column: 13, scope: !212)
!214 = !DILocation(line: 180, column: 14, scope: !179)
!215 = !{!208, !123, i64 0}
!216 = !DILocation(line: 172, column: 19, scope: !179)
!217 = !DILocation(line: 181, column: 19, scope: !179)
!218 = !{!219, !123, i64 16}
!219 = !{!"listNode", !123, i64 0, !123, i64 8, !123, i64 16}
!220 = !DILocation(line: 184, column: 9, scope: !179)
!221 = !DILocation(line: 187, column: 13, scope: !179)
!222 = !DILocation(line: 146, column: 21, scope: !160)
!223 = !DILocation(line: 188, column: 30, scope: !224)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 187, column: 37)
!225 = distinct !DILexicalBlock(scope: !179, file: !3, line: 187, column: 13)
!226 = !{!227, !123, i64 8}
!227 = !{!"bio_job", !136, i64 0, !123, i64 8, !123, i64 16, !123, i64 24}
!228 = !DILocation(line: 188, column: 19, scope: !224)
!229 = !DILocation(line: 188, column: 13, scope: !224)
!230 = !DILocation(line: 189, column: 9, scope: !224)
!231 = !DILocation(line: 190, column: 36, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 189, column: 43)
!233 = distinct !DILexicalBlock(scope: !225, file: !3, line: 189, column: 20)
!234 = !DILocation(line: 190, column: 25, scope: !232)
!235 = !DILocation(line: 190, column: 13, scope: !232)
