; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/ces/cesbi.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/ces/cesbi.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.iconv_to_ucs_ces_t = type { i8**, %struct.iconv_to_ucs_ces_handlers_t* }
%struct.iconv_to_ucs_ces_handlers_t = type { i8* (%struct._reent*, i8*)*, i64 (%struct._reent*, i8*)*, i32 (i8*)*, void (i8*, %struct._mbstate_t*)*, i32 (i8*, %struct._mbstate_t*)*, i32 (i8*)*, i32 (i8*, i8**, i64*)* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_iconv_to_ucs_ces", scope: !2, file: !3, line: 307, type: !278, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/ces/cesbi.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!0, !6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "_iconv_from_ucs_ces", scope: !2, file: !3, line: 357, type: !8, isLocal: false, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, elements: !86)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_from_ucs_ces_t", file: !11, line: 315, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/ces/../lib/ucsconv.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 305, size: 128, elements: !13)
!13 = !{!14, !19}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !12, file: !11, line: 311, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !12, file: !11, line: 314, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_from_ucs_ces_handlers_t", file: !11, line: 222, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 172, size: 448, elements: !24)
!24 = !{!25, !246, !252, !256, !263, !267, !268}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !23, file: !11, line: 175, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !30, !16}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !32, line: 569, size: 14912, elements: !33)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !{!34, !36, !114, !115, !116, !117, !121, !122, !125, !126, !130, !142, !143, !144, !146, !147, !148, !210, !231, !232, !237, !244}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !31, file: !32, line: 571, baseType: !35, size: 32)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !31, file: !32, line: 576, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !32, line: 287, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !32, line: 181, size: 1408, elements: !40)
!40 = !{!41, !44, !45, !46, !48, !49, !54, !55, !56, !64, !68, !73, !77, !78, !79, !80, !84, !88, !89, !90, !92, !93, !97, !113}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !39, file: !32, line: 182, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !39, file: !32, line: 183, baseType: !35, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !39, file: !32, line: 184, baseType: !35, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !32, line: 185, baseType: !47, size: 16, offset: 128)
!47 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !39, file: !32, line: 186, baseType: !47, size: 16, offset: 144)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !39, file: !32, line: 187, baseType: !50, size: 128, offset: 192)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !32, line: 117, size: 128, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !50, file: !32, line: 118, baseType: !42, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !50, file: !32, line: 119, baseType: !35, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !39, file: !32, line: 188, baseType: !35, size: 32, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !39, file: !32, line: 195, baseType: !29, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !39, file: !32, line: 197, baseType: !57, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !30, !29, !63, !35}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !61, line: 145, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !39, file: !32, line: 199, baseType: !65, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!60, !30, !29, !16, !35}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !39, file: !32, line: 202, baseType: !69, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !30, !29, !72, !35}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !61, line: 114, baseType: !62)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !39, file: !32, line: 203, baseType: !74, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!35, !30, !29}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !39, file: !32, line: 206, baseType: !50, size: 128, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !39, file: !32, line: 207, baseType: !42, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !39, file: !32, line: 208, baseType: !35, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !39, file: !32, line: 211, baseType: !81, size: 24, offset: 928)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 24, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 3)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !39, file: !32, line: 212, baseType: !85, size: 8, offset: 952)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !39, file: !32, line: 215, baseType: !50, size: 128, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !39, file: !32, line: 218, baseType: !35, size: 32, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !32, line: 219, baseType: !91, size: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !61, line: 44, baseType: !62)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !39, file: !32, line: 222, baseType: !30, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !32, line: 226, baseType: !94, size: 32, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !61, line: 175, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !96, line: 12, baseType: !35)
!96 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !39, file: !32, line: 228, baseType: !98, size: 64, offset: 1312)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !61, line: 171, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 163, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !99, file: !61, line: 165, baseType: !35, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !99, file: !61, line: 170, baseType: !103, size: 32, offset: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !61, line: 166, size: 32, elements: !104)
!104 = !{!105, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !103, file: !61, line: 168, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !107, line: 124, baseType: !108)
!107 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!108 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !103, file: !61, line: 169, baseType: !110, size: 32)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 32, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 4)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !32, line: 229, baseType: !35, size: 32, offset: 1376)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !31, file: !32, line: 576, baseType: !37, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !31, file: !32, line: 576, baseType: !37, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !31, file: !32, line: 578, baseType: !35, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !31, file: !32, line: 579, baseType: !118, size: 200, offset: 288)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 200, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 25)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !31, file: !32, line: 582, baseType: !35, size: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !31, file: !32, line: 583, baseType: !123, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !32, line: 40, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !31, file: !32, line: 585, baseType: !35, size: 32, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !31, file: !32, line: 587, baseType: !127, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !30}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !31, file: !32, line: 590, baseType: !131, size: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !32, line: 47, size: 256, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !132, file: !32, line: 49, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !132, file: !32, line: 50, baseType: !35, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !132, file: !32, line: 50, baseType: !35, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !132, file: !32, line: 50, baseType: !35, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !132, file: !32, line: 50, baseType: !35, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !132, file: !32, line: 51, baseType: !140, size: 32, offset: 192)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 32, elements: !86)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !32, line: 25, baseType: !108)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !31, file: !32, line: 591, baseType: !35, size: 32, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !31, file: !32, line: 592, baseType: !131, size: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !31, file: !32, line: 593, baseType: !145, size: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !31, file: !32, line: 596, baseType: !35, size: 32, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !31, file: !32, line: 597, baseType: !63, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !31, file: !32, line: 632, baseType: !149, size: 2880, offset: 1152)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !31, file: !32, line: 599, size: 2880, elements: !150)
!150 = !{!151, !201}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !149, file: !32, line: 622, baseType: !152, size: 1728)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !149, file: !32, line: 601, size: 1728, elements: !153)
!153 = !{!154, !155, !156, !160, !172, !173, !175, !183, !184, !185, !186, !190, !194, !195, !196, !197, !198, !199, !200}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !152, file: !32, line: 603, baseType: !108, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !152, file: !32, line: 604, baseType: !63, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !152, file: !32, line: 605, baseType: !157, size: 208, offset: 128)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 208, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 26)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !152, file: !32, line: 606, baseType: !161, size: 288, offset: 352)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !32, line: 55, size: 288, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !161, file: !32, line: 57, baseType: !35, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !161, file: !32, line: 58, baseType: !35, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !161, file: !32, line: 59, baseType: !35, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !161, file: !32, line: 60, baseType: !35, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !161, file: !32, line: 61, baseType: !35, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !161, file: !32, line: 62, baseType: !35, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !161, file: !32, line: 63, baseType: !35, size: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !161, file: !32, line: 64, baseType: !35, size: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !161, file: !32, line: 65, baseType: !35, size: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !152, file: !32, line: 607, baseType: !35, size: 32, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !152, file: !32, line: 608, baseType: !174, size: 64, offset: 704)
!174 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !152, file: !32, line: 609, baseType: !176, size: 112, offset: 768)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !32, line: 319, size: 112, elements: !177)
!177 = !{!178, !181, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !176, file: !32, line: 320, baseType: !179, size: 48)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 48, elements: !82)
!180 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !176, file: !32, line: 321, baseType: !179, size: 48, offset: 48)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !176, file: !32, line: 322, baseType: !180, size: 16, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !152, file: !32, line: 610, baseType: !98, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !152, file: !32, line: 611, baseType: !98, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !152, file: !32, line: 612, baseType: !98, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !152, file: !32, line: 613, baseType: !187, size: 64, offset: 1088)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !152, file: !32, line: 614, baseType: !191, size: 192, offset: 1152)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 24)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !152, file: !32, line: 615, baseType: !35, size: 32, offset: 1344)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !152, file: !32, line: 616, baseType: !98, size: 64, offset: 1376)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !152, file: !32, line: 617, baseType: !98, size: 64, offset: 1440)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !152, file: !32, line: 618, baseType: !98, size: 64, offset: 1504)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !152, file: !32, line: 619, baseType: !98, size: 64, offset: 1568)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !152, file: !32, line: 620, baseType: !98, size: 64, offset: 1632)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !152, file: !32, line: 621, baseType: !35, size: 32, offset: 1696)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !149, file: !32, line: 631, baseType: !202, size: 2880)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !149, file: !32, line: 626, size: 2880, elements: !203)
!203 = !{!204, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !202, file: !32, line: 629, baseType: !205, size: 1920)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1920, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 30)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !202, file: !32, line: 630, baseType: !209, size: 960, offset: 1920)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 960, elements: !206)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !31, file: !32, line: 636, baseType: !211, size: 64, offset: 4032)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !32, line: 93, size: 6336, elements: !213)
!213 = !{!214, !215, !216, !223}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !212, file: !32, line: 94, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !212, file: !32, line: 95, baseType: !35, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !212, file: !32, line: 97, baseType: !217, size: 2048, offset: 128)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2048, elements: !221)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null}
!221 = !{!222}
!222 = !DISubrange(count: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !212, file: !32, line: 98, baseType: !224, size: 4160, offset: 2176)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !32, line: 74, size: 4160, elements: !225)
!225 = !{!226, !228, !229, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !224, file: !32, line: 75, baseType: !227, size: 2048)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !221)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !224, file: !32, line: 76, baseType: !227, size: 2048, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !224, file: !32, line: 78, baseType: !141, size: 32, offset: 4096)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !224, file: !32, line: 81, baseType: !141, size: 32, offset: 4128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !31, file: !32, line: 637, baseType: !212, size: 6336, offset: 4096)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !31, file: !32, line: 641, baseType: !233, size: 64, offset: 10432)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !35}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !31, file: !32, line: 646, baseType: !238, size: 192, offset: 10496)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !32, line: 291, size: 192, elements: !239)
!239 = !{!240, !242, !243}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !238, file: !32, line: 293, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !238, file: !32, line: 294, baseType: !35, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !238, file: !32, line: 295, baseType: !37, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !31, file: !32, line: 648, baseType: !245, size: 4224, offset: 10688)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 4224, elements: !82)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !23, file: !11, line: 179, baseType: !247, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !30, !29}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 58, baseType: !251)
!251 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_cur_max", scope: !23, file: !11, line: 183, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!35, !29}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "get_state", scope: !23, file: !11, line: 186, baseType: !257, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !29, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !262, line: 86, baseType: !98)
!262 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !23, file: !11, line: 190, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!35, !29, !260}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "is_stateful", scope: !23, file: !11, line: 194, baseType: !253, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "convert_from_ucs", scope: !23, file: !11, line: 218, baseType: !269, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!250, !29, !272, !276, !277}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs4_t", file: !273, line: 61, baseType: !274)
!273 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/ces/../lib/local.h", directory: "/root/.unikraft/apps/redis/build")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !275, line: 79, baseType: !108)
!275 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !86)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_to_ucs_ces_t", file: !11, line: 297, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 287, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !281, file: !11, line: 293, baseType: !15, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !281, file: !11, line: 296, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_to_ucs_ces_handlers_t", file: !11, line: 161, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 53, size: 448, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !288, file: !11, line: 71, baseType: !26, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !288, file: !11, line: 87, baseType: !247, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_cur_max", scope: !288, file: !11, line: 99, baseType: !253, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "get_state", scope: !288, file: !11, line: 111, baseType: !257, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !288, file: !11, line: 126, baseType: !264, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "is_stateful", scope: !288, file: !11, line: 138, baseType: !253, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "convert_to_ucs", scope: !288, file: !11, line: 158, baseType: !297, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!272, !29, !300, !277}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!303 = !{i32 2, !"Dwarf Version", i32 4}
!304 = !{i32 2, !"Debug Info Version", i32 3}
!305 = !{i32 1, !"wchar_size", i32 4}
!306 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
