; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/collate.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/collate.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__collate_st_char_pri = type { i32, i32 }
%struct.__collate_st_chain_pri = type { [10 x i8], i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__collate_load_error", scope: !2, file: !3, line: 43, type: !18, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/collate.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !10, !14}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !12, line: 87, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!15 = !{!0, !16, !19, !24, !29, !38}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "__collate_substitute_nontrivial", scope: !2, file: !3, line: 44, type: !18, isLocal: false, isDefinition: true)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "__collate_version", scope: !2, file: !3, line: 45, type: !21, isLocal: false, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 80, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 10)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "__collate_substitute_table", scope: !2, file: !3, line: 46, type: !26, isLocal: false, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 20480, elements: !27)
!27 = !{!28, !23}
!28 = !DISubrange(count: 256)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "__collate_char_pri_table", scope: !2, file: !3, line: 47, type: !31, isLocal: false, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 16384, elements: !37)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__collate_st_char_pri", file: !33, line: 41, size: 64, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/collate.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prim", scope: !32, file: !33, line: 42, baseType: !18, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !32, file: !33, line: 42, baseType: !18, size: 32, offset: 32)
!37 = !{!28}
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__collate_chain_pri_table", scope: !2, file: !3, line: 48, type: !40, isLocal: false, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 16000, elements: !47)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__collate_st_chain_pri", file: !33, line: 44, size: 160, elements: !42)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !41, file: !33, line: 45, baseType: !44, size: 80)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 80, elements: !22)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "prim", scope: !41, file: !33, line: 46, baseType: !18, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !41, file: !33, line: 46, baseType: !18, size: 32, offset: 128)
!47 = !{!48}
!48 = !DISubrange(count: 100)
!49 = !{i32 2, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!53 = distinct !DISubprogram(name: "__collate_load_tables", scope: !3, file: !3, line: 61, type: !54, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: true, unit: !2, retainedNodes: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{!18, !14}
!56 = !{!57, !58, !62, !279, !280}
!57 = !DILocalVariable(name: "encoding", arg: 1, scope: !53, file: !3, line: 62, type: !14)
!58 = !DILocalVariable(name: "buf", scope: !53, file: !3, line: 64, type: !59)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8192, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1024)
!62 = !DILocalVariable(name: "fp", scope: !53, file: !3, line: 65, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 66, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !67, line: 287, baseType: !68)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !67, line: 181, size: 1408, elements: !69)
!69 = !{!70, !72, !73, !74, !76, !77, !82, !83, !84, !248, !252, !257, !261, !262, !263, !264, !266, !268, !269, !270, !272, !273, !277, !278}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !68, file: !67, line: 182, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !68, file: !67, line: 183, baseType: !18, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !68, file: !67, line: 184, baseType: !18, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !67, line: 185, baseType: !75, size: 16, offset: 128)
!75 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !68, file: !67, line: 186, baseType: !75, size: 16, offset: 144)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !68, file: !67, line: 187, baseType: !78, size: 128, offset: 192)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !67, line: 117, size: 128, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !78, file: !67, line: 118, baseType: !71, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !78, file: !67, line: 119, baseType: !18, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !68, file: !67, line: 188, baseType: !18, size: 32, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !68, file: !67, line: 195, baseType: !6, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !68, file: !67, line: 197, baseType: !85, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !91, !6, !14, !18}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !89, line: 145, baseType: !90)
!89 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !67, line: 569, size: 14912, elements: !93)
!93 = !{!94, !95, !97, !98, !99, !100, !104, !105, !108, !109, !113, !128, !129, !130, !132, !133, !134, !212, !233, !234, !239, !246}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !92, file: !67, line: 571, baseType: !18, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !92, file: !67, line: 576, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !92, file: !67, line: 576, baseType: !96, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !92, file: !67, line: 576, baseType: !96, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !92, file: !67, line: 578, baseType: !18, size: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !92, file: !67, line: 579, baseType: !101, size: 200, offset: 288)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 200, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 25)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !92, file: !67, line: 582, baseType: !18, size: 32, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !92, file: !67, line: 583, baseType: !106, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !67, line: 40, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !92, file: !67, line: 585, baseType: !18, size: 32, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !92, file: !67, line: 587, baseType: !110, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !91}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !92, file: !67, line: 590, baseType: !114, size: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !67, line: 47, size: 256, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !115, file: !67, line: 49, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !115, file: !67, line: 50, baseType: !18, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !115, file: !67, line: 50, baseType: !18, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !115, file: !67, line: 50, baseType: !18, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !115, file: !67, line: 50, baseType: !18, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !115, file: !67, line: 51, baseType: !123, size: 32, offset: 192)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !126)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !67, line: 25, baseType: !125)
!125 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !92, file: !67, line: 591, baseType: !18, size: 32, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !92, file: !67, line: 592, baseType: !114, size: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !92, file: !67, line: 593, baseType: !131, size: 64, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !92, file: !67, line: 596, baseType: !18, size: 32, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !92, file: !67, line: 597, baseType: !14, size: 64, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !92, file: !67, line: 632, baseType: !135, size: 2880, offset: 1152)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !67, line: 599, size: 2880, elements: !136)
!136 = !{!137, !203}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !135, file: !67, line: 622, baseType: !138, size: 1728)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !135, file: !67, line: 601, size: 1728, elements: !139)
!139 = !{!140, !141, !142, !146, !158, !159, !161, !171, !186, !187, !188, !192, !196, !197, !198, !199, !200, !201, !202}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !138, file: !67, line: 603, baseType: !125, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !138, file: !67, line: 604, baseType: !14, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !138, file: !67, line: 605, baseType: !143, size: 208, offset: 128)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 208, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 26)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !138, file: !67, line: 606, baseType: !147, size: 288, offset: 352)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !67, line: 55, size: 288, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !147, file: !67, line: 57, baseType: !18, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !147, file: !67, line: 58, baseType: !18, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !147, file: !67, line: 59, baseType: !18, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !147, file: !67, line: 60, baseType: !18, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !147, file: !67, line: 61, baseType: !18, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !147, file: !67, line: 62, baseType: !18, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !147, file: !67, line: 63, baseType: !18, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !147, file: !67, line: 64, baseType: !18, size: 32, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !147, file: !67, line: 65, baseType: !18, size: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !138, file: !67, line: 607, baseType: !18, size: 32, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !138, file: !67, line: 608, baseType: !160, size: 64, offset: 704)
!160 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !138, file: !67, line: 609, baseType: !162, size: 112, offset: 768)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !67, line: 319, size: 112, elements: !163)
!163 = !{!164, !169, !170}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !162, file: !67, line: 320, baseType: !165, size: 48)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 48, elements: !167)
!166 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!167 = !{!168}
!168 = !DISubrange(count: 3)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !162, file: !67, line: 321, baseType: !165, size: 48, offset: 48)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !162, file: !67, line: 322, baseType: !166, size: 16, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !138, file: !67, line: 610, baseType: !172, size: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !89, line: 171, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 163, size: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !173, file: !89, line: 165, baseType: !18, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !173, file: !89, line: 170, baseType: !177, size: 32, offset: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !89, line: 166, size: 32, elements: !178)
!178 = !{!179, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !177, file: !89, line: 168, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !181, line: 124, baseType: !125)
!181 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !177, file: !89, line: 169, baseType: !183, size: 32)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 32, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 4)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !138, file: !67, line: 611, baseType: !172, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !138, file: !67, line: 612, baseType: !172, size: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !138, file: !67, line: 613, baseType: !189, size: 64, offset: 1088)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !138, file: !67, line: 614, baseType: !193, size: 192, offset: 1152)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 24)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !138, file: !67, line: 615, baseType: !18, size: 32, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !138, file: !67, line: 616, baseType: !172, size: 64, offset: 1376)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !138, file: !67, line: 617, baseType: !172, size: 64, offset: 1440)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !138, file: !67, line: 618, baseType: !172, size: 64, offset: 1504)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !138, file: !67, line: 619, baseType: !172, size: 64, offset: 1568)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !138, file: !67, line: 620, baseType: !172, size: 64, offset: 1632)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !138, file: !67, line: 621, baseType: !18, size: 32, offset: 1696)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !135, file: !67, line: 631, baseType: !204, size: 2880)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !135, file: !67, line: 626, size: 2880, elements: !205)
!205 = !{!206, !210}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !204, file: !67, line: 629, baseType: !207, size: 1920)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1920, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 30)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !204, file: !67, line: 630, baseType: !211, size: 960, offset: 1920)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 960, elements: !208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !92, file: !67, line: 636, baseType: !213, size: 64, offset: 4032)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !67, line: 93, size: 6336, elements: !215)
!215 = !{!216, !217, !218, !225}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !214, file: !67, line: 94, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !214, file: !67, line: 95, baseType: !18, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !214, file: !67, line: 97, baseType: !219, size: 2048, offset: 128)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 2048, elements: !223)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !{!224}
!224 = !DISubrange(count: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !214, file: !67, line: 98, baseType: !226, size: 4160, offset: 2176)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !67, line: 74, size: 4160, elements: !227)
!227 = !{!228, !230, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !226, file: !67, line: 75, baseType: !229, size: 2048)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2048, elements: !223)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !226, file: !67, line: 76, baseType: !229, size: 2048, offset: 2048)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !226, file: !67, line: 78, baseType: !124, size: 32, offset: 4096)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !226, file: !67, line: 81, baseType: !124, size: 32, offset: 4128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !92, file: !67, line: 637, baseType: !214, size: 6336, offset: 4096)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !92, file: !67, line: 641, baseType: !235, size: 64, offset: 10432)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !18}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !92, file: !67, line: 646, baseType: !240, size: 192, offset: 10496)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !67, line: 291, size: 192, elements: !241)
!241 = !{!242, !244, !245}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !240, file: !67, line: 293, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !240, file: !67, line: 294, baseType: !18, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !240, file: !67, line: 295, baseType: !96, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !92, file: !67, line: 648, baseType: !247, size: 4224, offset: 10688)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 4224, elements: !167)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !68, file: !67, line: 199, baseType: !249, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!88, !91, !6, !7, !18}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !68, file: !67, line: 202, baseType: !253, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !91, !6, !256, !18}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !89, line: 114, baseType: !90)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !68, file: !67, line: 203, baseType: !258, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!18, !91, !6}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !68, file: !67, line: 206, baseType: !78, size: 128, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !68, file: !67, line: 207, baseType: !71, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !68, file: !67, line: 208, baseType: !18, size: 32, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !68, file: !67, line: 211, baseType: !265, size: 24, offset: 928)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 24, elements: !167)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !68, file: !67, line: 212, baseType: !267, size: 8, offset: 952)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !126)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !68, file: !67, line: 215, baseType: !78, size: 128, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !68, file: !67, line: 218, baseType: !18, size: 32, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !67, line: 219, baseType: !271, size: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !89, line: 44, baseType: !90)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !68, file: !67, line: 222, baseType: !91, size: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !67, line: 226, baseType: !274, size: 32, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !89, line: 175, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !276, line: 12, baseType: !18)
!276 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !68, file: !67, line: 228, baseType: !172, size: 64, offset: 1312)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !67, line: 229, baseType: !18, size: 32, offset: 1376)
!279 = !DILocalVariable(name: "i", scope: !53, file: !3, line: 66, type: !18)
!280 = !DILocalVariable(name: "save_load_error", scope: !53, file: !3, line: 66, type: !18)
!281 = !DILocation(line: 62, column: 8, scope: !53)
!282 = !DILocation(line: 64, column: 2, scope: !53)
!283 = !DILocation(line: 64, column: 7, scope: !53)
!284 = !DILocation(line: 68, column: 20, scope: !53)
!285 = !{!286, !286, i64 0}
!286 = !{!"int", !287, i64 0}
!287 = !{!"omnipotent char", !288, i64 0}
!288 = !{!"Simple C/C++ TBAA"}
!289 = !DILocation(line: 66, column: 9, scope: !53)
!290 = !DILocation(line: 69, column: 23, scope: !53)
!291 = !DILocation(line: 70, column: 7, scope: !292)
!292 = distinct !DILexicalBlock(scope: !53, file: !3, line: 70, column: 6)
!293 = !DILocation(line: 70, column: 6, scope: !53)
!294 = !DILocation(line: 71, column: 24, scope: !295)
!295 = distinct !DILexicalBlock(scope: !292, file: !3, line: 70, column: 17)
!296 = !DILocation(line: 72, column: 3, scope: !295)
!297 = !DILocation(line: 74, column: 7, scope: !298)
!298 = distinct !DILexicalBlock(scope: !53, file: !3, line: 74, column: 6)
!299 = !DILocation(line: 74, column: 29, scope: !298)
!300 = !DILocation(line: 74, column: 33, scope: !298)
!301 = !DILocation(line: 74, column: 6, scope: !53)
!302 = !DILocation(line: 76, column: 7, scope: !303)
!303 = distinct !DILexicalBlock(scope: !53, file: !3, line: 76, column: 6)
!304 = !{!305, !305, i64 0}
!305 = !{!"any pointer", !287, i64 0}
!306 = !DILocation(line: 76, column: 6, scope: !53)
!307 = !DILocation(line: 77, column: 24, scope: !308)
!308 = distinct !DILexicalBlock(scope: !303, file: !3, line: 76, column: 20)
!309 = !DILocation(line: 78, column: 3, scope: !308)
!310 = !DILocation(line: 81, column: 9, scope: !53)
!311 = !DILocation(line: 82, column: 9, scope: !53)
!312 = !DILocation(line: 83, column: 9, scope: !53)
!313 = !DILocation(line: 84, column: 9, scope: !53)
!314 = !DILocation(line: 85, column: 12, scope: !315)
!315 = distinct !DILexicalBlock(scope: !53, file: !3, line: 85, column: 6)
!316 = !DILocation(line: 65, column: 8, scope: !53)
!317 = !DILocation(line: 85, column: 29, scope: !315)
!318 = !DILocation(line: 85, column: 6, scope: !53)
!319 = !DILocation(line: 86, column: 24, scope: !320)
!320 = distinct !DILexicalBlock(scope: !315, file: !3, line: 85, column: 38)
!321 = !DILocation(line: 87, column: 3, scope: !320)
!322 = !DILocation(line: 89, column: 2, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !3, line: 89, column: 2)
!324 = distinct !DILexicalBlock(scope: !53, file: !3, line: 89, column: 2)
!325 = !DILocation(line: 89, column: 2, scope: !324)
!326 = !DILocation(line: 89, column: 2, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !3, line: 89, column: 2)
!328 = !DILocation(line: 90, column: 6, scope: !329)
!329 = distinct !DILexicalBlock(scope: !53, file: !3, line: 90, column: 6)
!330 = !DILocation(line: 90, column: 49, scope: !329)
!331 = !DILocation(line: 90, column: 6, scope: !53)
!332 = !DILocation(line: 91, column: 3, scope: !333)
!333 = distinct !DILexicalBlock(scope: !329, file: !3, line: 90, column: 55)
!334 = !DILocation(line: 92, column: 3, scope: !333)
!335 = !DILocation(line: 94, column: 2, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !3, line: 94, column: 2)
!337 = distinct !DILexicalBlock(scope: !53, file: !3, line: 94, column: 2)
!338 = !DILocation(line: 94, column: 2, scope: !337)
!339 = !DILocation(line: 94, column: 2, scope: !340)
!340 = distinct !DILexicalBlock(scope: !336, file: !3, line: 94, column: 2)
!341 = !DILocation(line: 96, column: 2, scope: !342)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 96, column: 2)
!343 = distinct !DILexicalBlock(scope: !53, file: !3, line: 96, column: 2)
!344 = !DILocation(line: 96, column: 2, scope: !343)
!345 = !DILocation(line: 96, column: 2, scope: !346)
