; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/debug.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/debug.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/debug.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !7, !8, !9, !10, !109, !112, !123, !133, !143}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !13, line: 829, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !13, line: 826, size: 128, elements: !15)
!15 = !{!16, !84}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !14, file: !13, line: 827, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !19, line: 82, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !19, line: 76, size: 768, elements: !21)
!21 = !{!22, !52, !53, !82, !83}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !19, line: 77, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !19, line: 65, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !19, line: 58, size: 384, elements: !26)
!26 = !{!27, !38, !42, !43, !47, !51}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !25, file: !19, line: 59, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !36}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 60, baseType: !33)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !34, line: 105, baseType: !35)
!34 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !25, file: !19, line: 60, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!4, !4, !36}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !25, file: !19, line: 61, baseType: !39, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !25, file: !19, line: 62, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!9, !4, !36, !36}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !25, file: !19, line: 63, baseType: !48, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !4, !4}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !25, file: !19, line: 64, baseType: !48, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !20, file: !19, line: 78, baseType: !4, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !20, file: !19, line: 79, baseType: !54, size: 512, offset: 128)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 512, elements: !80)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !19, line: 74, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !19, line: 69, size: 256, elements: !57)
!57 = !{!58, !77, !78, !79}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !56, file: !19, line: 70, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !19, line: 56, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !19, line: 47, size: 192, elements: !63)
!63 = !{!64, !65, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !62, file: !19, line: 48, baseType: !4, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !62, file: !19, line: 54, baseType: !66, size: 64, offset: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !19, line: 49, size: 64, elements: !67)
!67 = !{!68, !69, !70, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !66, file: !19, line: 50, baseType: !4, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !66, file: !19, line: 51, baseType: !31, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !66, file: !19, line: 52, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !32, line: 56, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !34, line: 103, baseType: !73)
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !66, file: !19, line: 53, baseType: !7, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !19, line: 55, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !19, line: 71, baseType: !35, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !56, file: !19, line: 72, baseType: !35, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !56, file: !19, line: 73, baseType: !35, size: 64, offset: 192)
!80 = !{!81}
!81 = !DISubrange(count: 2)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !20, file: !19, line: 80, baseType: !73, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !20, file: !19, line: 81, baseType: !35, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !14, file: !13, line: 828, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !13, line: 824, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !13, line: 820, size: 256, elements: !88)
!88 = !{!89, !106, !107, !108}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !87, file: !13, line: 821, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !13, line: 810, size: 192, elements: !92)
!92 = !{!93, !96, !97, !98}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !91, file: !13, line: 811, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !95, line: 43, baseType: !5)
!95 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !91, file: !13, line: 812, baseType: !7, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !91, file: !13, line: 813, baseType: !90, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !91, file: !13, line: 817, baseType: !99, offset: 192)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, elements: !104)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !13, line: 814, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !100, file: !13, line: 815, baseType: !90, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !100, file: !13, line: 816, baseType: !35, size: 64, offset: 64)
!104 = !{!105}
!105 = !DISubrange(count: -1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !13, line: 821, baseType: !90, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !87, file: !13, line: 822, baseType: !35, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !87, file: !13, line: 823, baseType: !9, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !9}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !95, line: 51, size: 24, elements: !114)
!114 = !{!115, !119, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !95, line: 52, baseType: !116, size: 8)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 43, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !113, file: !95, line: 53, baseType: !116, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !95, line: 54, baseType: !118, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !113, file: !95, line: 55, baseType: !122, offset: 24)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, elements: !104)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !95, line: 57, size: 40, elements: !125)
!125 = !{!126, !130, !131, !132}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !124, file: !95, line: 58, baseType: !127, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 36, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !34, line: 57, baseType: !129)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !95, line: 59, baseType: !127, size: 16, offset: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !124, file: !95, line: 60, baseType: !118, size: 8, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !124, file: !95, line: 61, baseType: !122, offset: 40)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !95, line: 63, size: 72, elements: !135)
!135 = !{!136, !140, !141, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !95, line: 64, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 48, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 79, baseType: !139)
!139 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !134, file: !95, line: 65, baseType: !137, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !95, line: 66, baseType: !118, size: 8, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !134, file: !95, line: 67, baseType: !122, offset: 72)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !95, line: 69, size: 136, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !144, file: !95, line: 70, baseType: !31, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !144, file: !95, line: 71, baseType: !31, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !95, line: 72, baseType: !118, size: 8, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !144, file: !95, line: 73, baseType: !122, offset: 136)
!150 = !{i32 2, !"Dwarf Version", i32 4}
!151 = !{i32 2, !"Debug Info Version", i32 3}
!152 = !{i32 1, !"wchar_size", i32 4}
!153 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!154 = distinct !DISubprogram(name: "xorDigest", scope: !1, file: !1, line: 64, type: !155, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !162)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157, !4, !158}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !159, line: 40, baseType: !160)
!159 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !161, line: 129, baseType: !35)
!161 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!162 = !{!163, !164, !165, !166, !181, !185, !186}
!163 = !DILocalVariable(name: "digest", arg: 1, scope: !154, file: !1, line: 64, type: !157)
!164 = !DILocalVariable(name: "ptr", arg: 2, scope: !154, file: !1, line: 64, type: !4)
!165 = !DILocalVariable(name: "len", arg: 3, scope: !154, file: !1, line: 64, type: !158)
!166 = !DILocalVariable(name: "ctx", scope: !154, file: !1, line: 65, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA1_CTX", file: !168, line: 14, baseType: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sha1.h", directory: "/root/.unikraft/apps/redis/build")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 10, size: 736, elements: !170)
!170 = !{!171, !175, !177}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !168, line: 11, baseType: !172, size: 160)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 5)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !169, file: !168, line: 12, baseType: !176, size: 64, offset: 160)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !80)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !169, file: !168, line: 13, baseType: !178, size: 512, offset: 224)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 512, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DILocalVariable(name: "hash", scope: !154, file: !1, line: 66, type: !182)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 160, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 20)
!185 = !DILocalVariable(name: "s", scope: !154, file: !1, line: 66, type: !157)
!186 = !DILocalVariable(name: "j", scope: !154, file: !1, line: 67, type: !9)
!187 = !DILocation(line: 64, column: 31, scope: !154)
!188 = !DILocation(line: 64, column: 45, scope: !154)
!189 = !DILocation(line: 64, column: 57, scope: !154)
!190 = !DILocation(line: 65, column: 5, scope: !154)
!191 = !DILocation(line: 66, column: 5, scope: !154)
!192 = !DILocation(line: 66, column: 19, scope: !154)
!193 = !DILocation(line: 66, column: 30, scope: !154)
!194 = !DILocation(line: 65, column: 14, scope: !154)
!195 = !DILocation(line: 69, column: 5, scope: !154)
!196 = !DILocation(line: 70, column: 23, scope: !154)
!197 = !DILocation(line: 70, column: 5, scope: !154)
!198 = !DILocation(line: 71, column: 5, scope: !154)
!199 = !DILocation(line: 67, column: 9, scope: !154)
!200 = !DILocation(line: 74, column: 22, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !1, line: 73, column: 5)
!202 = distinct !DILexicalBlock(scope: !154, file: !1, line: 73, column: 5)
!203 = !{!204, !204, i64 0}
!204 = !{!"omnipotent char", !205, i64 0}
!205 = !{!"Simple C/C++ TBAA"}
!206 = !DILocation(line: 74, column: 19, scope: !201)
!207 = !DILocation(line: 74, column: 9, scope: !201)
!208 = !DILocation(line: 75, column: 1, scope: !154)
!209 = distinct !DISubprogram(name: "xorStringObjectDigest", scope: !1, file: !1, line: 77, type: !210, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !221)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !157, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !13, line: 622, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !13, line: 614, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219, !220}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !13, line: 615, baseType: !139, size: 4, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !214, file: !13, line: 616, baseType: !139, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !214, file: !13, line: 617, baseType: !139, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !214, file: !13, line: 620, baseType: !9, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !214, file: !13, line: 621, baseType: !4, size: 64, offset: 64)
!221 = !{!222, !223}
!222 = !DILocalVariable(name: "digest", arg: 1, scope: !209, file: !1, line: 77, type: !157)
!223 = !DILocalVariable(name: "o", arg: 2, scope: !209, file: !1, line: 77, type: !212)
!224 = !DILocation(line: 77, column: 43, scope: !209)
!225 = !DILocation(line: 77, column: 57, scope: !209)
!226 = !DILocation(line: 78, column: 9, scope: !209)
!227 = !DILocation(line: 79, column: 25, scope: !209)
!228 = !{!229, !231, i64 8}
!229 = !{!"redisObject", !230, i64 0, !230, i64 0, !230, i64 1, !230, i64 4, !231, i64 8}
!230 = !{!"int", !204, i64 0}
!231 = !{!"any pointer", !204, i64 0}
!232 = !DILocalVariable(name: "s", arg: 1, scope: !233, file: !95, line: 87, type: !238)
!233 = distinct !DISubprogram(name: "sdslen", scope: !95, file: !95, line: 87, type: !234, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !239)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !238}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !237, line: 58, baseType: !35)
!237 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!239 = !{!232, !240}
!240 = !DILocalVariable(name: "flags", scope: !233, file: !95, line: 88, type: !118)
!241 = !DILocation(line: 87, column: 39, scope: !233, inlinedAt: !242)
!242 = distinct !DILocation(line: 79, column: 29, scope: !209)
!243 = !DILocation(line: 88, column: 27, scope: !233, inlinedAt: !242)
!244 = !DILocation(line: 88, column: 19, scope: !233, inlinedAt: !242)
!245 = !DILocation(line: 89, column: 5, scope: !233, inlinedAt: !242)
!246 = !DILocation(line: 91, column: 20, scope: !247, inlinedAt: !242)
!247 = distinct !DILexicalBlock(scope: !233, file: !95, line: 89, column: 33)
!248 = !DILocation(line: 91, column: 13, scope: !247, inlinedAt: !242)
!249 = !DILocation(line: 93, column: 20, scope: !247, inlinedAt: !242)
!250 = !DILocation(line: 93, column: 34, scope: !247, inlinedAt: !242)
!251 = !DILocation(line: 93, column: 13, scope: !247, inlinedAt: !242)
!252 = !DILocation(line: 95, column: 20, scope: !247, inlinedAt: !242)
!253 = !DILocation(line: 95, column: 35, scope: !247, inlinedAt: !242)
!254 = !{!255, !255, i64 0}
!255 = !{!"short", !204, i64 0}
!256 = !DILocation(line: 95, column: 13, scope: !247, inlinedAt: !242)
!257 = !DILocation(line: 97, column: 20, scope: !247, inlinedAt: !242)
!258 = !DILocation(line: 97, column: 35, scope: !247, inlinedAt: !242)
!259 = !{!230, !230, i64 0}
!260 = !DILocation(line: 97, column: 13, scope: !247, inlinedAt: !242)
!261 = !DILocation(line: 99, column: 20, scope: !247, inlinedAt: !242)
!262 = !DILocation(line: 99, column: 35, scope: !247, inlinedAt: !242)
!263 = !{!264, !264, i64 0}
!264 = !{!"long", !204, i64 0}
!265 = !DILocation(line: 99, column: 13, scope: !247, inlinedAt: !242)
!266 = !DILocation(line: 0, scope: !247, inlinedAt: !242)
!267 = !DILocation(line: 102, column: 1, scope: !233, inlinedAt: !242)
!268 = !DILocation(line: 79, column: 5, scope: !209)
!269 = !DILocation(line: 80, column: 5, scope: !209)
!270 = !DILocation(line: 81, column: 1, scope: !209)
!271 = distinct !DISubprogram(name: "mixDigest", scope: !1, file: !1, line: 97, type: !155, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !272)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DILocalVariable(name: "digest", arg: 1, scope: !271, file: !1, line: 97, type: !157)
!274 = !DILocalVariable(name: "ptr", arg: 2, scope: !271, file: !1, line: 97, type: !4)
!275 = !DILocalVariable(name: "len", arg: 3, scope: !271, file: !1, line: 97, type: !158)
!276 = !DILocalVariable(name: "ctx", scope: !271, file: !1, line: 98, type: !167)
!277 = !DILocalVariable(name: "s", scope: !271, file: !1, line: 99, type: !5)
!278 = !DILocation(line: 97, column: 31, scope: !271)
!279 = !DILocation(line: 97, column: 45, scope: !271)
!280 = !DILocation(line: 97, column: 57, scope: !271)
!281 = !DILocation(line: 98, column: 5, scope: !271)
!282 = !DILocation(line: 99, column: 11, scope: !271)
!283 = !DILocation(line: 101, column: 5, scope: !271)
!284 = !DILocation(line: 98, column: 14, scope: !271)
!285 = !DILocation(line: 102, column: 5, scope: !271)
!286 = !DILocation(line: 103, column: 5, scope: !271)
!287 = !DILocation(line: 104, column: 5, scope: !271)
!288 = !DILocation(line: 105, column: 1, scope: !271)
!289 = distinct !DISubprogram(name: "mixStringObjectDigest", scope: !1, file: !1, line: 107, type: !210, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !290)
!290 = !{!291, !292}
!291 = !DILocalVariable(name: "digest", arg: 1, scope: !289, file: !1, line: 107, type: !157)
!292 = !DILocalVariable(name: "o", arg: 2, scope: !289, file: !1, line: 107, type: !212)
!293 = !DILocation(line: 107, column: 43, scope: !289)
!294 = !DILocation(line: 107, column: 57, scope: !289)
!295 = !DILocation(line: 108, column: 9, scope: !289)
!296 = !DILocation(line: 109, column: 25, scope: !289)
!297 = !DILocation(line: 87, column: 39, scope: !233, inlinedAt: !298)
!298 = distinct !DILocation(line: 109, column: 29, scope: !289)
!299 = !DILocation(line: 88, column: 27, scope: !233, inlinedAt: !298)
!300 = !DILocation(line: 88, column: 19, scope: !233, inlinedAt: !298)
!301 = !DILocation(line: 89, column: 5, scope: !233, inlinedAt: !298)
!302 = !DILocation(line: 91, column: 20, scope: !247, inlinedAt: !298)
!303 = !DILocation(line: 91, column: 13, scope: !247, inlinedAt: !298)
!304 = !DILocation(line: 93, column: 20, scope: !247, inlinedAt: !298)
!305 = !DILocation(line: 93, column: 34, scope: !247, inlinedAt: !298)
!306 = !DILocation(line: 93, column: 13, scope: !247, inlinedAt: !298)
!307 = !DILocation(line: 95, column: 20, scope: !247, inlinedAt: !298)
!308 = !DILocation(line: 95, column: 35, scope: !247, inlinedAt: !298)
!309 = !DILocation(line: 95, column: 13, scope: !247, inlinedAt: !298)
!310 = !DILocation(line: 97, column: 20, scope: !247, inlinedAt: !298)
!311 = !DILocation(line: 97, column: 35, scope: !247, inlinedAt: !298)
!312 = !DILocation(line: 97, column: 13, scope: !247, inlinedAt: !298)
!313 = !DILocation(line: 99, column: 20, scope: !247, inlinedAt: !298)
!314 = !DILocation(line: 99, column: 35, scope: !247, inlinedAt: !298)
!315 = !DILocation(line: 99, column: 13, scope: !247, inlinedAt: !298)
!316 = !DILocation(line: 0, scope: !247, inlinedAt: !298)
!317 = !DILocation(line: 102, column: 1, scope: !233, inlinedAt: !298)
!318 = !DILocation(line: 97, column: 31, scope: !271, inlinedAt: !319)
!319 = distinct !DILocation(line: 109, column: 5, scope: !289)
!320 = !DILocation(line: 97, column: 45, scope: !271, inlinedAt: !319)
!321 = !DILocation(line: 97, column: 57, scope: !271, inlinedAt: !319)
!322 = !DILocation(line: 98, column: 5, scope: !271, inlinedAt: !319)
!323 = !DILocation(line: 99, column: 11, scope: !271, inlinedAt: !319)
!324 = !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !319)
!325 = !DILocation(line: 98, column: 14, scope: !271, inlinedAt: !319)
!326 = !DILocation(line: 102, column: 5, scope: !271, inlinedAt: !319)
!327 = !DILocation(line: 103, column: 5, scope: !271, inlinedAt: !319)
!328 = !DILocation(line: 104, column: 5, scope: !271, inlinedAt: !319)
!329 = !DILocation(line: 105, column: 1, scope: !271, inlinedAt: !319)
!330 = !DILocation(line: 110, column: 5, scope: !289)
!331 = !DILocation(line: 111, column: 1, scope: !289)
!332 = distinct !DISubprogram(name: "xorObjectDigest", scope: !1, file: !1, line: 121, type: !333, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !375)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !335, !212, !157, !212}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !13, line: 656, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !13, line: 647, size: 512, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !337, file: !13, line: 648, baseType: !17, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !337, file: !13, line: 649, baseType: !17, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !337, file: !13, line: 650, baseType: !17, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !337, file: !13, line: 651, baseType: !17, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !337, file: !13, line: 652, baseType: !17, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !337, file: !13, line: 653, baseType: !9, size: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !337, file: !13, line: 654, baseType: !8, size: 64, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !337, file: !13, line: 655, baseType: !347, size: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !349, line: 54, baseType: !350)
!349 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !349, line: 47, size: 384, elements: !351)
!351 = !{!352, !361, !362, !366, !370, !374}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !350, file: !349, line: 48, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !349, line: 40, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !349, line: 36, size: 192, elements: !356)
!356 = !{!357, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !349, line: 37, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !349, line: 38, baseType: !358, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !355, file: !349, line: 39, baseType: !4, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !350, file: !349, line: 49, baseType: !353, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !350, file: !349, line: 50, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!4, !4}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !350, file: !349, line: 51, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !4}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !350, file: !349, line: 52, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!9, !4, !4}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !350, file: !349, line: 53, baseType: !35, size: 64, offset: 320)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !386, !434, !450, !452, !474, !475, !478, !481, !482, !483, !484, !485, !486, !487, !491, !492, !493, !495, !497, !510, !512, !513, !601, !602, !603, !605, !607, !608, !609, !610, !618, !950}
!376 = !DILocalVariable(name: "db", arg: 1, scope: !332, file: !1, line: 121, type: !335)
!377 = !DILocalVariable(name: "keyobj", arg: 2, scope: !332, file: !1, line: 121, type: !212)
!378 = !DILocalVariable(name: "digest", arg: 3, scope: !332, file: !1, line: 121, type: !157)
!379 = !DILocalVariable(name: "o", arg: 4, scope: !332, file: !1, line: 121, type: !212)
!380 = !DILocalVariable(name: "aux", scope: !332, file: !1, line: 122, type: !137)
!381 = !DILocalVariable(name: "expiretime", scope: !332, file: !1, line: 124, type: !8)
!382 = !DILocalVariable(name: "buf", scope: !332, file: !1, line: 125, type: !383)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 128)
!386 = !DILocalVariable(name: "li", scope: !387, file: !1, line: 131, type: !390)
!387 = distinct !DILexicalBlock(scope: !388, file: !1, line: 130, column: 37)
!388 = distinct !DILexicalBlock(scope: !389, file: !1, line: 130, column: 16)
!389 = distinct !DILexicalBlock(scope: !332, file: !1, line: 128, column: 9)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeIterator", file: !13, line: 1347, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1342, size: 192, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !392, file: !13, line: 1343, baseType: !212, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !392, file: !13, line: 1344, baseType: !118, size: 8, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !392, file: !13, line: 1345, baseType: !118, size: 8, offset: 72)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !392, file: !13, line: 1346, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistIter", file: !400, line: 88, baseType: !401)
!400 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistIter", file: !400, line: 82, size: 320, elements: !402)
!402 = !{!403, !430, !431, !432, !433}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !401, file: !400, line: 83, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !400, line: 80, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !400, line: 73, size: 320, elements: !408)
!408 = !{!409, !425, !426, !427, !428, !429}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !407, file: !400, line: 74, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !400, line: 55, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !400, line: 44, size: 256, elements: !413)
!413 = !{!414, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !412, file: !400, line: 45, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !400, line: 46, baseType: !415, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !412, file: !400, line: 47, baseType: !157, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !412, file: !400, line: 48, baseType: !139, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !412, file: !400, line: 49, baseType: !139, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !412, file: !400, line: 50, baseType: !139, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !412, file: !400, line: 51, baseType: !139, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !412, file: !400, line: 52, baseType: !139, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !412, file: !400, line: 53, baseType: !139, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !412, file: !400, line: 54, baseType: !139, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !407, file: !400, line: 75, baseType: !410, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !407, file: !400, line: 76, baseType: !35, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !407, file: !400, line: 77, baseType: !35, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !407, file: !400, line: 78, baseType: !9, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !407, file: !400, line: 79, baseType: !139, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !401, file: !400, line: 84, baseType: !410, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !401, file: !400, line: 85, baseType: !157, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !401, file: !400, line: 86, baseType: !73, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !401, file: !400, line: 87, baseType: !9, size: 32, offset: 256)
!434 = !DILocalVariable(name: "entry", scope: !387, file: !1, line: 132, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeEntry", file: !13, line: 1353, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1350, size: 448, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "li", scope: !436, file: !13, line: 1351, baseType: !390, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !436, file: !13, line: 1352, baseType: !440, size: 384, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistEntry", file: !400, line: 98, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistEntry", file: !400, line: 90, size: 384, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !441, file: !400, line: 91, baseType: !404, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !441, file: !400, line: 92, baseType: !410, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !441, file: !400, line: 93, baseType: !157, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !441, file: !400, line: 94, baseType: !157, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "longval", scope: !441, file: !400, line: 95, baseType: !8, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !441, file: !400, line: 96, baseType: !139, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !441, file: !400, line: 97, baseType: !9, size: 32, offset: 352)
!450 = !DILocalVariable(name: "eleobj", scope: !451, file: !1, line: 134, type: !212)
!451 = distinct !DILexicalBlock(scope: !387, file: !1, line: 133, column: 40)
!452 = !DILocalVariable(name: "si", scope: !453, file: !1, line: 140, type: !455)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 139, column: 36)
!454 = distinct !DILexicalBlock(scope: !388, file: !1, line: 139, column: 16)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "setTypeIterator", file: !13, line: 1361, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1356, size: 192, elements: !458)
!458 = !{!459, !460, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !457, file: !13, line: 1357, baseType: !212, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !457, file: !13, line: 1358, baseType: !9, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ii", scope: !457, file: !13, line: 1359, baseType: !9, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !457, file: !13, line: 1360, baseType: !463, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !19, line: 95, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !19, line: 88, size: 384, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !465, file: !19, line: 89, baseType: !17, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !465, file: !19, line: 90, baseType: !73, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !465, file: !19, line: 91, baseType: !9, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !465, file: !19, line: 91, baseType: !9, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !465, file: !19, line: 92, baseType: !60, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !465, file: !19, line: 92, baseType: !60, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !465, file: !19, line: 94, baseType: !8, size: 64, offset: 320)
!474 = !DILocalVariable(name: "sdsele", scope: !453, file: !1, line: 141, type: !94)
!475 = !DILocalVariable(name: "eledigest", scope: !476, file: !1, line: 148, type: !182)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 147, column: 37)
!477 = distinct !DILexicalBlock(scope: !454, file: !1, line: 147, column: 16)
!478 = !DILocalVariable(name: "zl", scope: !479, file: !1, line: 151, type: !157)
!479 = distinct !DILexicalBlock(scope: !480, file: !1, line: 150, column: 50)
!480 = distinct !DILexicalBlock(scope: !476, file: !1, line: 150, column: 13)
!481 = !DILocalVariable(name: "eptr", scope: !479, file: !1, line: 152, type: !157)
!482 = !DILocalVariable(name: "sptr", scope: !479, file: !1, line: 152, type: !157)
!483 = !DILocalVariable(name: "vstr", scope: !479, file: !1, line: 153, type: !157)
!484 = !DILocalVariable(name: "vlen", scope: !479, file: !1, line: 154, type: !139)
!485 = !DILocalVariable(name: "vll", scope: !479, file: !1, line: 155, type: !8)
!486 = !DILocalVariable(name: "score", scope: !479, file: !1, line: 156, type: !7)
!487 = !DILocalVariable(name: "zs", scope: !488, file: !1, line: 181, type: !490)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 180, column: 58)
!489 = distinct !DILexicalBlock(scope: !480, file: !1, line: 180, column: 20)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!491 = !DILocalVariable(name: "di", scope: !488, file: !1, line: 182, type: !463)
!492 = !DILocalVariable(name: "de", scope: !488, file: !1, line: 183, type: !60)
!493 = !DILocalVariable(name: "sdsele", scope: !494, file: !1, line: 186, type: !94)
!494 = distinct !DILexicalBlock(scope: !488, file: !1, line: 185, column: 48)
!495 = !DILocalVariable(name: "score", scope: !494, file: !1, line: 187, type: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!497 = !DILocalVariable(name: "hi", scope: !498, file: !1, line: 200, type: !500)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 199, column: 37)
!499 = distinct !DILexicalBlock(scope: !477, file: !1, line: 199, column: 16)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashTypeIterator", file: !13, line: 1375, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1367, size: 384, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !502, file: !13, line: 1368, baseType: !212, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !502, file: !13, line: 1369, baseType: !9, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", scope: !502, file: !13, line: 1371, baseType: !157, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vptr", scope: !502, file: !13, line: 1371, baseType: !157, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !502, file: !13, line: 1373, baseType: !463, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "de", scope: !502, file: !13, line: 1374, baseType: !60, size: 64, offset: 320)
!510 = !DILocalVariable(name: "eledigest", scope: !511, file: !1, line: 202, type: !182)
!511 = distinct !DILexicalBlock(scope: !498, file: !1, line: 201, column: 43)
!512 = !DILocalVariable(name: "sdsele", scope: !511, file: !1, line: 203, type: !94)
!513 = !DILocalVariable(name: "si", scope: !514, file: !1, line: 216, type: !516)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 215, column: 39)
!515 = distinct !DILexicalBlock(scope: !499, file: !1, line: 215, column: 16)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamIterator", file: !517, line: 48, baseType: !518)
!517 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamIterator", file: !517, line: 29, size: 5120, elements: !519)
!519 = !{!520, !552, !553, !554, !555, !556, !557, !558, !560, !561, !593, !594, !595, !596, !600}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !518, file: !517, line: 30, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !517, line: 21, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !517, line: 16, size: 320, elements: !524)
!524 = !{!525, !544, !545, !551}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !523, file: !517, line: 17, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !528, line: 137, baseType: !529)
!528 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !528, line: 133, size: 192, elements: !530)
!530 = !{!531, !542, !543}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !529, file: !528, line: 134, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !528, line: 131, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !528, line: 98, size: 32, elements: !535)
!535 = !{!536, !537, !538, !539, !540}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !534, file: !528, line: 99, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !534, file: !528, line: 100, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !534, file: !528, line: 101, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !528, line: 102, baseType: !137, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !528, line: 130, baseType: !541, offset: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, elements: !104)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !529, file: !528, line: 135, baseType: !31, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !529, file: !528, line: 136, baseType: !31, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !523, file: !517, line: 18, baseType: !31, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !523, file: !517, line: 19, baseType: !546, size: 128, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !517, line: 14, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !517, line: 11, size: 128, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !547, file: !517, line: 12, baseType: !31, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !547, file: !517, line: 13, baseType: !31, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !523, file: !517, line: 20, baseType: !526, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "master_id", scope: !518, file: !517, line: 31, baseType: !546, size: 128, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "master_fields_count", scope: !518, file: !517, line: 32, baseType: !31, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "master_fields_start", scope: !518, file: !517, line: 33, baseType: !157, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "master_fields_ptr", scope: !518, file: !517, line: 34, baseType: !157, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "entry_flags", scope: !518, file: !517, line: 35, baseType: !9, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rev", scope: !518, file: !517, line: 36, baseType: !9, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "start_key", scope: !518, file: !517, line: 37, baseType: !559, size: 128, offset: 448)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !80)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "end_key", scope: !518, file: !517, line: 38, baseType: !559, size: 128, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !518, file: !517, line: 39, baseType: !562, size: 3840, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxIterator", file: !528, line: 186, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxIterator", file: !528, line: 175, size: 3840, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !573, !574, !587}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !528, line: 176, baseType: !9, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !563, file: !528, line: 177, baseType: !526, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !563, file: !528, line: 178, baseType: !157, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !563, file: !528, line: 179, baseType: !4, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !563, file: !528, line: 180, baseType: !158, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "key_max", scope: !563, file: !528, line: 181, baseType: !158, size: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "key_static_string", scope: !563, file: !528, line: 182, baseType: !572, size: 1024, offset: 384)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 1024, elements: !384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !563, file: !528, line: 183, baseType: !532, size: 64, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !563, file: !528, line: 184, baseType: !575, size: 2304, offset: 1472)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxStack", file: !528, line: 150, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxStack", file: !528, line: 143, size: 2304, elements: !577)
!577 = !{!578, !580, !581, !582, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !576, file: !528, line: 144, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !576, file: !528, line: 145, baseType: !158, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "maxitems", scope: !576, file: !528, line: 145, baseType: !158, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "static_items", scope: !576, file: !528, line: 148, baseType: !583, size: 2048, offset: 192)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "oom", scope: !576, file: !528, line: 149, baseType: !9, size: 32, offset: 2240)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "node_cb", scope: !563, file: !528, line: 185, baseType: !588, size: 64, offset: 3776)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNodeCallback", file: !528, line: 165, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!9, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !518, file: !517, line: 40, baseType: !157, size: 64, offset: 4544)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lp_ele", scope: !518, file: !517, line: 41, baseType: !157, size: 64, offset: 4608)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lp_flags", scope: !518, file: !517, line: 42, baseType: !157, size: 64, offset: 4672)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "field_buf", scope: !518, file: !517, line: 46, baseType: !597, size: 168, offset: 4736)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 168, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 21)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "value_buf", scope: !518, file: !517, line: 47, baseType: !597, size: 168, offset: 4904)
!601 = !DILocalVariable(name: "id", scope: !514, file: !1, line: 218, type: !546)
!602 = !DILocalVariable(name: "numfields", scope: !514, file: !1, line: 219, type: !71)
!603 = !DILocalVariable(name: "itemid", scope: !604, file: !1, line: 222, type: !94)
!604 = distinct !DILexicalBlock(scope: !514, file: !1, line: 221, column: 56)
!605 = !DILocalVariable(name: "field", scope: !606, file: !1, line: 227, type: !157)
!606 = distinct !DILexicalBlock(scope: !604, file: !1, line: 226, column: 32)
!607 = !DILocalVariable(name: "value", scope: !606, file: !1, line: 227, type: !157)
!608 = !DILocalVariable(name: "field_len", scope: !606, file: !1, line: 228, type: !71)
!609 = !DILocalVariable(name: "value_len", scope: !606, file: !1, line: 228, type: !71)
!610 = !DILocalVariable(name: "md", scope: !611, file: !1, line: 237, type: !613)
!611 = distinct !DILexicalBlock(scope: !612, file: !1, line: 236, column: 39)
!612 = distinct !DILexicalBlock(scope: !515, file: !1, line: 236, column: 16)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleDigest", file: !13, line: 586, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleDigest", file: !13, line: 583, size: 320, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !614, file: !13, line: 584, baseType: !182, size: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !614, file: !13, line: 585, baseType: !182, size: 160, offset: 160)
!618 = !DILocalVariable(name: "mv", scope: !611, file: !1, line: 238, type: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleValue", file: !13, line: 550, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "moduleValue", file: !13, line: 547, size: 128, elements: !622)
!622 = !{!623, !949}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !13, line: 548, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleType", file: !13, line: 530, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleType", file: !13, line: 517, size: 768, elements: !627)
!627 = !{!628, !629, !632, !911, !916, !921, !926, !932, !934, !939, !944, !945}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !626, file: !13, line: 518, baseType: !31, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !626, file: !13, line: 519, baseType: !630, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModule", file: !13, line: 496, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !626, file: !13, line: 520, baseType: !633, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeLoadFunc", file: !13, line: 506, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!4, !637, !9}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleIO", file: !13, line: 555, size: 384, elements: !639)
!639 = !{!640, !641, !903, !904, !905, !906, !909}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !638, file: !13, line: 556, baseType: !158, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !638, file: !13, line: 557, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !644, line: 87, baseType: !645)
!644 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !644, line: 39, size: 832, elements: !646)
!646 = !{!647, !652, !656, !664, !668, !672, !673, !674, !675}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !645, file: !644, line: 43, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!236, !651, !4, !236}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !645, file: !644, line: 44, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!236, !651, !36, !236}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !645, file: !644, line: 45, baseType: !657, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !651}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !661, line: 173, baseType: !662)
!661 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !161, line: 100, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !161, line: 44, baseType: !73)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !645, file: !644, line: 46, baseType: !665, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!9, !651}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !645, file: !644, line: 52, baseType: !669, size: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !651, !36, !236}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !645, file: !644, line: 55, baseType: !31, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !645, file: !644, line: 58, baseType: !236, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !645, file: !644, line: 61, baseType: !236, size: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !645, file: !644, line: 84, baseType: !676, size: 320, offset: 512)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !645, file: !644, line: 64, size: 320, elements: !677)
!677 = !{!678, !683, !894}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !676, file: !644, line: 69, baseType: !679, size: 128)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !644, line: 66, size: 128, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !679, file: !644, line: 67, baseType: !94, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !679, file: !644, line: 68, baseType: !660, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !676, file: !644, line: 75, baseType: !684, size: 192)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !644, line: 71, size: 192, elements: !685)
!685 = !{!686, !892, !893}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !684, file: !644, line: 72, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !689, line: 66, baseType: !690)
!689 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !691, line: 287, baseType: !692)
!691 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !691, line: 181, size: 1408, elements: !693)
!693 = !{!694, !695, !696, !697, !699, !700, !705, !706, !707, !860, !866, !871, !875, !876, !877, !878, !880, !882, !883, !884, !885, !886, !890, !891}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !692, file: !691, line: 182, baseType: !157, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !692, file: !691, line: 183, baseType: !9, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !692, file: !691, line: 184, baseType: !9, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !692, file: !691, line: 185, baseType: !698, size: 16, offset: 128)
!698 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !692, file: !691, line: 186, baseType: !698, size: 16, offset: 144)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !692, file: !691, line: 187, baseType: !701, size: 128, offset: 192)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !691, line: 117, size: 128, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !701, file: !691, line: 118, baseType: !157, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !701, file: !691, line: 119, baseType: !9, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !692, file: !691, line: 188, baseType: !9, size: 32, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !692, file: !691, line: 195, baseType: !4, size: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !692, file: !691, line: 197, baseType: !708, size: 64, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !712, !4, !5, !9}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !161, line: 145, baseType: !73)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !691, line: 569, size: 14912, elements: !714)
!714 = !{!715, !716, !718, !719, !720, !721, !725, !726, !729, !730, !734, !748, !749, !750, !752, !753, !754, !830, !848, !849, !851, !858}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !713, file: !691, line: 571, baseType: !9, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !713, file: !691, line: 576, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !713, file: !691, line: 576, baseType: !717, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !713, file: !691, line: 576, baseType: !717, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !713, file: !691, line: 578, baseType: !9, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !713, file: !691, line: 579, baseType: !722, size: 200, offset: 288)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 200, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 25)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !713, file: !691, line: 582, baseType: !9, size: 32, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !713, file: !691, line: 583, baseType: !727, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !691, line: 40, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !713, file: !691, line: 585, baseType: !9, size: 32, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !713, file: !691, line: 587, baseType: !731, size: 64, offset: 704)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !712}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !713, file: !691, line: 590, baseType: !735, size: 64, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !691, line: 47, size: 256, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !736, file: !691, line: 49, baseType: !735, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !736, file: !691, line: 50, baseType: !9, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !736, file: !691, line: 50, baseType: !9, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !736, file: !691, line: 50, baseType: !9, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !736, file: !691, line: 50, baseType: !9, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !736, file: !691, line: 51, baseType: !744, size: 32, offset: 192)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 32, elements: !746)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !691, line: 25, baseType: !139)
!746 = !{!747}
!747 = !DISubrange(count: 1)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !713, file: !691, line: 591, baseType: !9, size: 32, offset: 832)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !713, file: !691, line: 592, baseType: !735, size: 64, offset: 896)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !713, file: !691, line: 593, baseType: !751, size: 64, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !713, file: !691, line: 596, baseType: !9, size: 32, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !713, file: !691, line: 597, baseType: !5, size: 64, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !713, file: !691, line: 632, baseType: !755, size: 2880, offset: 1152)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !713, file: !691, line: 599, size: 2880, elements: !756)
!756 = !{!757, !821}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !755, file: !691, line: 622, baseType: !758, size: 1728)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !691, line: 601, size: 1728, elements: !759)
!759 = !{!760, !761, !762, !766, !778, !779, !781, !790, !804, !805, !806, !810, !814, !815, !816, !817, !818, !819, !820}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !758, file: !691, line: 603, baseType: !139, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !758, file: !691, line: 604, baseType: !5, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !758, file: !691, line: 605, baseType: !763, size: 208, offset: 128)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 208, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 26)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !758, file: !691, line: 606, baseType: !767, size: 288, offset: 352)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !691, line: 55, size: 288, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !767, file: !691, line: 57, baseType: !9, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !767, file: !691, line: 58, baseType: !9, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !767, file: !691, line: 59, baseType: !9, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !767, file: !691, line: 60, baseType: !9, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !767, file: !691, line: 61, baseType: !9, size: 32, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !767, file: !691, line: 62, baseType: !9, size: 32, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !767, file: !691, line: 63, baseType: !9, size: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !767, file: !691, line: 64, baseType: !9, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !767, file: !691, line: 65, baseType: !9, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !758, file: !691, line: 607, baseType: !9, size: 32, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !758, file: !691, line: 608, baseType: !780, size: 64, offset: 704)
!780 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !758, file: !691, line: 609, baseType: !782, size: 112, offset: 768)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !691, line: 319, size: 112, elements: !783)
!783 = !{!784, !788, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !782, file: !691, line: 320, baseType: !785, size: 48)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 48, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 3)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !782, file: !691, line: 321, baseType: !785, size: 48, offset: 48)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !782, file: !691, line: 322, baseType: !129, size: 16, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !758, file: !691, line: 610, baseType: !791, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !161, line: 171, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 163, size: 64, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !792, file: !161, line: 165, baseType: !9, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !792, file: !161, line: 170, baseType: !796, size: 32, offset: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !161, line: 166, size: 32, elements: !797)
!797 = !{!798, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !796, file: !161, line: 168, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !237, line: 124, baseType: !139)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !796, file: !161, line: 169, baseType: !801, size: 32)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 4)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !758, file: !691, line: 611, baseType: !791, size: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !758, file: !691, line: 612, baseType: !791, size: 64, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !758, file: !691, line: 613, baseType: !807, size: 64, offset: 1088)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !758, file: !691, line: 614, baseType: !811, size: 192, offset: 1152)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 24)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !758, file: !691, line: 615, baseType: !9, size: 32, offset: 1344)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !758, file: !691, line: 616, baseType: !791, size: 64, offset: 1376)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !758, file: !691, line: 617, baseType: !791, size: 64, offset: 1440)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !758, file: !691, line: 618, baseType: !791, size: 64, offset: 1504)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !758, file: !691, line: 619, baseType: !791, size: 64, offset: 1568)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !758, file: !691, line: 620, baseType: !791, size: 64, offset: 1632)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !758, file: !691, line: 621, baseType: !9, size: 32, offset: 1696)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !755, file: !691, line: 631, baseType: !822, size: 2880)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !691, line: 626, size: 2880, elements: !823)
!823 = !{!824, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !822, file: !691, line: 629, baseType: !825, size: 1920)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 1920, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 30)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !822, file: !691, line: 630, baseType: !829, size: 960, offset: 1920)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 960, elements: !826)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !713, file: !691, line: 636, baseType: !831, size: 64, offset: 4032)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !691, line: 93, size: 6336, elements: !833)
!833 = !{!834, !835, !836, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !832, file: !691, line: 94, baseType: !831, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !832, file: !691, line: 95, baseType: !9, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !832, file: !691, line: 97, baseType: !837, size: 2048, offset: 128)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 2048, elements: !584)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !832, file: !691, line: 98, baseType: !842, size: 4160, offset: 2176)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !691, line: 74, size: 4160, elements: !843)
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !842, file: !691, line: 75, baseType: !583, size: 2048)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !842, file: !691, line: 76, baseType: !583, size: 2048, offset: 2048)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !842, file: !691, line: 78, baseType: !745, size: 32, offset: 4096)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !842, file: !691, line: 81, baseType: !745, size: 32, offset: 4128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !713, file: !691, line: 637, baseType: !832, size: 6336, offset: 4096)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !713, file: !691, line: 641, baseType: !850, size: 64, offset: 10432)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !713, file: !691, line: 646, baseType: !852, size: 192, offset: 10496)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !691, line: 291, size: 192, elements: !853)
!853 = !{!854, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !852, file: !691, line: 293, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !852, file: !691, line: 294, baseType: !9, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !852, file: !691, line: 295, baseType: !717, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !713, file: !691, line: 648, baseType: !859, size: 4224, offset: 10688)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 4224, elements: !786)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !692, file: !691, line: 199, baseType: !861, size: 64, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!711, !712, !4, !864, !9}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !692, file: !691, line: 202, baseType: !867, size: 64, offset: 576)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!870, !712, !4, !870, !9}
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !161, line: 114, baseType: !73)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !692, file: !691, line: 203, baseType: !872, size: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!9, !712, !4}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !692, file: !691, line: 206, baseType: !701, size: 128, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !692, file: !691, line: 207, baseType: !157, size: 64, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !692, file: !691, line: 208, baseType: !9, size: 32, offset: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !692, file: !691, line: 211, baseType: !879, size: 24, offset: 928)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 24, elements: !786)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !692, file: !691, line: 212, baseType: !881, size: 8, offset: 952)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8, elements: !746)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !692, file: !691, line: 215, baseType: !701, size: 128, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !692, file: !691, line: 218, baseType: !9, size: 32, offset: 1088)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !692, file: !691, line: 219, baseType: !663, size: 64, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !692, file: !691, line: 222, baseType: !712, size: 64, offset: 1216)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !692, file: !691, line: 226, baseType: !887, size: 32, offset: 1280)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !161, line: 175, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !889, line: 12, baseType: !9)
!889 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !692, file: !691, line: 228, baseType: !791, size: 64, offset: 1312)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !692, file: !691, line: 229, baseType: !9, size: 32, offset: 1376)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !684, file: !644, line: 73, baseType: !660, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "autosync", scope: !684, file: !644, line: 74, baseType: !660, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fdset", scope: !676, file: !644, line: 83, baseType: !895, size: 320)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !644, line: 77, size: 320, elements: !896)
!896 = !{!897, !899, !900, !901, !902}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !895, file: !644, line: 78, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !895, file: !644, line: 79, baseType: !898, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "numfds", scope: !895, file: !644, line: 80, baseType: !9, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !895, file: !644, line: 81, baseType: !660, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !895, file: !644, line: 82, baseType: !94, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !13, line: 558, baseType: !624, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !638, file: !13, line: 559, baseType: !9, size: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !638, file: !13, line: 560, baseType: !9, size: 32, offset: 224)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !638, file: !13, line: 562, baseType: !907, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleCtx", file: !13, line: 499, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !638, file: !13, line: 563, baseType: !910, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save", scope: !626, file: !13, line: 521, baseType: !912, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeSaveFunc", file: !13, line: 507, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !637, !4}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite", scope: !626, file: !13, line: 522, baseType: !917, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeRewriteFunc", file: !13, line: 510, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !637, !910, !4}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "mem_usage", scope: !626, file: !13, line: 523, baseType: !922, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeMemUsageFunc", file: !13, line: 512, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!158, !36}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !626, file: !13, line: 524, baseType: !927, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeDigestFunc", file: !13, line: 511, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !931, !4}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !626, file: !13, line: 525, baseType: !933, size: 64, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeFreeFunc", file: !13, line: 513, baseType: !367)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "aux_load", scope: !626, file: !13, line: 526, baseType: !935, size: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeAuxLoadFunc", file: !13, line: 508, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!9, !637, !9, !9}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save", scope: !626, file: !13, line: 527, baseType: !940, size: 64, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeAuxSaveFunc", file: !13, line: 509, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !637, !9}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save_triggers", scope: !626, file: !13, line: 528, baseType: !9, size: 32, offset: 640)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !13, line: 529, baseType: !946, size: 80, offset: 672)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 80, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 10)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !621, file: !13, line: 549, baseType: !4, size: 64, offset: 64)
!950 = !DILocalVariable(name: "mt", scope: !611, file: !1, line: 239, type: !624)
!951 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !952)
!952 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !953)
!953 = distinct !DILocation(line: 210, column: 13, scope: !511)
!954 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !955)
!955 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !956)
!956 = distinct !DILocation(line: 207, column: 13, scope: !511)
!957 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !958)
!958 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !959)
!959 = distinct !DILocation(line: 192, column: 17, scope: !494)
!960 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !961)
!961 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !962)
!962 = distinct !DILocation(line: 191, column: 17, scope: !494)
!963 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !964)
!964 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !965)
!965 = distinct !DILocation(line: 176, column: 17, scope: !966)
!966 = distinct !DILexicalBlock(scope: !479, file: !1, line: 163, column: 34)
!967 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !968)
!968 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !969)
!969 = distinct !DILocation(line: 172, column: 21, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !1, line: 170, column: 24)
!971 = distinct !DILexicalBlock(scope: !966, file: !1, line: 168, column: 21)
!972 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !973)
!973 = distinct !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !974)
!974 = distinct !DILocation(line: 169, column: 21, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !1, line: 168, column: 35)
!976 = !DILocation(line: 121, column: 31, scope: !332)
!977 = !DILocation(line: 121, column: 41, scope: !332)
!978 = !DILocation(line: 121, column: 64, scope: !332)
!979 = !DILocation(line: 121, column: 78, scope: !332)
!980 = !DILocation(line: 122, column: 5, scope: !332)
!981 = !DILocation(line: 122, column: 20, scope: !332)
!982 = !DILocation(line: 122, column: 14, scope: !332)
!983 = !DILocation(line: 97, column: 31, scope: !271, inlinedAt: !984)
!984 = distinct !DILocation(line: 123, column: 5, scope: !332)
!985 = !DILocation(line: 97, column: 45, scope: !271, inlinedAt: !984)
!986 = !DILocation(line: 97, column: 57, scope: !271, inlinedAt: !984)
!987 = !DILocation(line: 98, column: 5, scope: !271, inlinedAt: !984)
!988 = !DILocation(line: 99, column: 11, scope: !271, inlinedAt: !984)
!989 = !DILocation(line: 101, column: 5, scope: !271, inlinedAt: !984)
!990 = !DILocation(line: 98, column: 14, scope: !271, inlinedAt: !984)
!991 = !DILocation(line: 102, column: 5, scope: !271, inlinedAt: !984)
!992 = !DILocation(line: 103, column: 5, scope: !271, inlinedAt: !984)
!993 = !DILocation(line: 104, column: 5, scope: !271, inlinedAt: !984)
!994 = !DILocation(line: 105, column: 1, scope: !271, inlinedAt: !984)
!995 = !DILocation(line: 124, column: 28, scope: !332)
!996 = !DILocation(line: 124, column: 15, scope: !332)
!997 = !DILocation(line: 125, column: 5, scope: !332)
!998 = !DILocation(line: 125, column: 10, scope: !332)
!999 = !DILocation(line: 128, column: 12, scope: !389)
!1000 = !DILocation(line: 128, column: 9, scope: !332)
!1001 = !DILocation(line: 129, column: 9, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !389, file: !1, line: 128, column: 32)
!1003 = !DILocation(line: 130, column: 5, scope: !1002)
!1004 = !DILocation(line: 131, column: 32, scope: !387)
!1005 = !DILocation(line: 131, column: 27, scope: !387)
!1006 = !DILocation(line: 132, column: 9, scope: !387)
!1007 = !DILocation(line: 132, column: 23, scope: !387)
!1008 = !DILocation(line: 133, column: 15, scope: !387)
!1009 = !DILocation(line: 133, column: 9, scope: !387)
!1010 = !DILocation(line: 134, column: 28, scope: !451)
!1011 = !DILocation(line: 134, column: 19, scope: !451)
!1012 = !DILocation(line: 135, column: 13, scope: !451)
!1013 = !DILocation(line: 136, column: 13, scope: !451)
!1014 = distinct !{!1014, !1009, !1015}
!1015 = !DILocation(line: 137, column: 9, scope: !387)
!1016 = !DILocation(line: 138, column: 9, scope: !387)
!1017 = !DILocation(line: 139, column: 5, scope: !388)
!1018 = !DILocation(line: 139, column: 5, scope: !387)
!1019 = !DILocation(line: 140, column: 31, scope: !453)
!1020 = !DILocation(line: 140, column: 26, scope: !453)
!1021 = !DILocation(line: 142, column: 25, scope: !453)
!1022 = !DILocation(line: 141, column: 13, scope: !453)
!1023 = !DILocation(line: 142, column: 48, scope: !453)
!1024 = !DILocation(line: 142, column: 9, scope: !453)
!1025 = !DILocation(line: 87, column: 39, scope: !233, inlinedAt: !1026)
!1026 = distinct !DILocation(line: 143, column: 37, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !453, file: !1, line: 142, column: 57)
!1028 = !DILocation(line: 88, column: 27, scope: !233, inlinedAt: !1026)
!1029 = !DILocation(line: 88, column: 19, scope: !233, inlinedAt: !1026)
!1030 = !DILocation(line: 89, column: 5, scope: !233, inlinedAt: !1026)
!1031 = !DILocation(line: 91, column: 20, scope: !247, inlinedAt: !1026)
!1032 = !DILocation(line: 91, column: 13, scope: !247, inlinedAt: !1026)
!1033 = !DILocation(line: 93, column: 20, scope: !247, inlinedAt: !1026)
!1034 = !DILocation(line: 93, column: 34, scope: !247, inlinedAt: !1026)
!1035 = !DILocation(line: 93, column: 13, scope: !247, inlinedAt: !1026)
!1036 = !DILocation(line: 95, column: 20, scope: !247, inlinedAt: !1026)
!1037 = !DILocation(line: 95, column: 35, scope: !247, inlinedAt: !1026)
!1038 = !DILocation(line: 95, column: 13, scope: !247, inlinedAt: !1026)
!1039 = !DILocation(line: 97, column: 20, scope: !247, inlinedAt: !1026)
!1040 = !DILocation(line: 97, column: 35, scope: !247, inlinedAt: !1026)
!1041 = !DILocation(line: 97, column: 13, scope: !247, inlinedAt: !1026)
!1042 = !DILocation(line: 99, column: 20, scope: !247, inlinedAt: !1026)
!1043 = !DILocation(line: 99, column: 35, scope: !247, inlinedAt: !1026)
!1044 = !DILocation(line: 99, column: 13, scope: !247, inlinedAt: !1026)
!1045 = !DILocation(line: 0, scope: !247, inlinedAt: !1026)
!1046 = !DILocation(line: 102, column: 1, scope: !233, inlinedAt: !1026)
!1047 = !DILocation(line: 143, column: 13, scope: !1027)
!1048 = !DILocation(line: 144, column: 13, scope: !1027)
!1049 = distinct !{!1049, !1024, !1050}
!1050 = !DILocation(line: 145, column: 9, scope: !453)
!1051 = !DILocation(line: 146, column: 9, scope: !453)
!1052 = !DILocation(line: 147, column: 5, scope: !453)
!1053 = !DILocation(line: 148, column: 9, scope: !476)
!1054 = !DILocation(line: 148, column: 23, scope: !476)
!1055 = !DILocation(line: 150, column: 16, scope: !480)
!1056 = !DILocation(line: 150, column: 13, scope: !476)
!1057 = !DILocation(line: 151, column: 36, scope: !479)
!1058 = !DILocation(line: 151, column: 28, scope: !479)
!1059 = !DILocation(line: 152, column: 13, scope: !479)
!1060 = !DILocation(line: 153, column: 13, scope: !479)
!1061 = !DILocation(line: 154, column: 13, scope: !479)
!1062 = !DILocation(line: 155, column: 13, scope: !479)
!1063 = !DILocation(line: 158, column: 20, scope: !479)
!1064 = !DILocation(line: 152, column: 28, scope: !479)
!1065 = !DILocation(line: 158, column: 18, scope: !479)
!1066 = !{!231, !231, i64 0}
!1067 = !DILocation(line: 159, column: 13, scope: !479)
!1068 = !DILocation(line: 160, column: 20, scope: !479)
!1069 = !DILocation(line: 152, column: 35, scope: !479)
!1070 = !DILocation(line: 160, column: 18, scope: !479)
!1071 = !DILocation(line: 161, column: 13, scope: !479)
!1072 = !DILocation(line: 163, column: 13, scope: !479)
!1073 = !DILocation(line: 153, column: 28, scope: !479)
!1074 = !DILocation(line: 154, column: 26, scope: !479)
!1075 = !DILocation(line: 155, column: 23, scope: !479)
!1076 = !DILocation(line: 164, column: 17, scope: !966)
!1077 = !DILocation(line: 165, column: 37, scope: !966)
!1078 = !DILocation(line: 165, column: 25, scope: !966)
!1079 = !DILocation(line: 156, column: 20, scope: !479)
!1080 = !DILocation(line: 167, column: 17, scope: !966)
!1081 = !DILocation(line: 168, column: 21, scope: !971)
!1082 = !DILocation(line: 168, column: 26, scope: !971)
!1083 = !DILocation(line: 168, column: 21, scope: !966)
!1084 = !DILocation(line: 169, column: 46, scope: !975)
!1085 = !DILocation(line: 97, column: 31, scope: !271, inlinedAt: !974)
!1086 = !DILocation(line: 97, column: 45, scope: !271, inlinedAt: !974)
!1087 = !DILocation(line: 98, column: 5, scope: !271, inlinedAt: !974)
!1088 = !DILocation(line: 99, column: 11, scope: !271, inlinedAt: !974)
!1089 = !DILocation(line: 64, column: 31, scope: !154, inlinedAt: !973)
!1090 = !DILocation(line: 64, column: 45, scope: !154, inlinedAt: !973)
!1091 = !DILocation(line: 65, column: 5, scope: !154, inlinedAt: !973)
!1092 = !DILocation(line: 66, column: 5, scope: !154, inlinedAt: !973)
!1093 = !DILocation(line: 66, column: 30, scope: !154, inlinedAt: !973)
!1094 = !DILocation(line: 65, column: 14, scope: !154, inlinedAt: !973)
!1095 = !DILocation(line: 69, column: 5, scope: !154, inlinedAt: !973)
!1096 = !DILocation(line: 70, column: 5, scope: !154, inlinedAt: !973)
!1097 = !DILocation(line: 71, column: 5, scope: !154, inlinedAt: !973)
!1098 = !DILocation(line: 67, column: 9, scope: !154, inlinedAt: !973)
!1099 = !DILocation(line: 74, column: 22, scope: !201, inlinedAt: !973)
!1100 = !DILocation(line: 74, column: 19, scope: !201, inlinedAt: !973)
!1101 = !DILocation(line: 75, column: 1, scope: !154, inlinedAt: !973)
!1102 = !DILocation(line: 98, column: 14, scope: !271, inlinedAt: !974)
!1103 = !DILocation(line: 102, column: 5, scope: !271, inlinedAt: !974)
!1104 = !DILocation(line: 103, column: 5, scope: !271, inlinedAt: !974)
!1105 = !DILocation(line: 104, column: 5, scope: !271, inlinedAt: !974)
!1106 = !DILocation(line: 105, column: 1, scope: !271, inlinedAt: !974)
!1107 = !DILocation(line: 170, column: 17, scope: !975)
!1108 = !DILocation(line: 171, column: 47, scope: !970)
!1109 = !{!1110, !1110, i64 0}
!1110 = !{!"long long", !204, i64 0}
!1111 = !DILocation(line: 171, column: 21, scope: !970)
!1112 = !DILocation(line: 172, column: 45, scope: !970)
!1113 = !DILocation(line: 97, column: 31, scope: !271, inlinedAt: !969)
!1114 = !DILocation(line: 97, column: 45, scope: !271, inlinedAt: !969)
!1115 = !DILocation(line: 97, column: 57, scope: !271, inlinedAt: !969)
!1116 = !DILocation(line: 98, column: 5, scope: !271, inlinedAt: !969)
