; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/dns.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/dns.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.dns_table_entry = type { i32, %struct.ip_addr, i16, i8, i8, i8, i8, i8, i8, [256 x i8], i8 }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_swrand = type opaque
%struct.udp_pcb = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8, %struct.udp_pcb*, i8, i16, i16, %struct.ip4_addr, i8, i8, void (i8*, %struct.udp_pcb*, %struct.pbuf*, %struct.ip_addr*, i16)*, i8* }
%struct.ip4_addr = type { i32 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.dns_req_entry = type { void (i8*, %struct.ip_addr*, i8*)*, i8*, i8, i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dns_hdr = type { i16, i8, i8, i16, i16, i16, i16 }
%struct.dns_query = type { i16, i16 }
%struct.dns_answer = type { i16, i16, i32, i16 }

@dns_mquery_v4group = dso_local local_unnamed_addr constant %struct.ip_addr { %union.anon { %struct.ip6_addr { [4 x i32] [i32 -83885856, i32 0, i32 0, i32 0], i8 0 } }, i8 0 }, align 4, !dbg !0

!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !27, line: 54, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !34, line: 68, baseType: !28, size: 32, elements: !35)
!34 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 212, baseType: !28, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45}
!42 = !DIEnumerator(name: "DNS_STATE_UNUSED", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "DNS_STATE_NEW", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "DNS_STATE_ASKING", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "DNS_STATE_DONE", value: 3, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 89, baseType: !28, size: 32, elements: !48)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !{!49, !50, !51, !52, !53}
!49 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!50 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!51 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!52 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 145, baseType: !28, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!57 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!59 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!60 = !{!61, !62, !68, !72, !73, !74, !7, !77}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !63, line: 129, baseType: !64)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !65, line: 48, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !67, line: 79, baseType: !28)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !63, line: 127, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !65, line: 36, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !67, line: 57, baseType: !71)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !63, line: 125, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !65, line: 24, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !67, line: 43, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!0, !79, !105, !110, !132, !158, !163, !201, !215, !217}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "dns_mquery_v6group", scope: !2, file: !3, line: 307, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !27, line: 76, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !27, line: 69, size: 192, elements: !84)
!84 = !{!85, !104}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !83, file: !27, line: 73, baseType: !86, size: 160)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !27, line: 70, size: 160, elements: !87)
!87 = !{!88, !98}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !86, file: !27, line: 71, baseType: !89, size: 160)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !90, line: 67, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !90, line: 59, size: 160, elements: !92)
!92 = !{!93, !97}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !91, file: !90, line: 60, baseType: !94, size: 128)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 4)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !91, file: !90, line: 62, baseType: !74, size: 8, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !86, file: !27, line: 72, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !100, line: 57, baseType: !101)
!100 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !100, line: 51, size: 32, elements: !102)
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !101, file: !100, line: 52, baseType: !62, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !27, line: 75, baseType: !74, size: 8, offset: 160)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "dns_servers", scope: !2, file: !3, line: 301, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 384, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 2)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dns_table", scope: !2, file: !3, line: 299, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 75776, elements: !130)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_table_entry", file: !3, line: 220, size: 2368, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !129}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !113, file: !3, line: 221, baseType: !62, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !113, file: !3, line: 222, baseType: !82, size: 192, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "txid", scope: !113, file: !3, line: 223, baseType: !68, size: 16, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !113, file: !3, line: 224, baseType: !74, size: 8, offset: 240)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "server_idx", scope: !113, file: !3, line: 225, baseType: !74, size: 8, offset: 248)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !113, file: !3, line: 226, baseType: !74, size: 8, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !113, file: !3, line: 227, baseType: !74, size: 8, offset: 264)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !113, file: !3, line: 228, baseType: !74, size: 8, offset: 272)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pcb_idx", scope: !113, file: !3, line: 230, baseType: !74, size: 8, offset: 280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !3, line: 232, baseType: !125, size: 2048, offset: 288)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !127)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !{!128}
!128 = !DISubrange(count: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reqaddrtype", scope: !113, file: !3, line: 234, baseType: !74, size: 8, offset: 2336)
!130 = !{!131}
!131 = !DISubrange(count: 32)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "__str", scope: !134, file: !135, line: 198, type: !155, isLocal: true, isDefinition: true)
!134 = distinct !DISubprogram(name: "uk_pr_crit", scope: !135, file: !135, line: 194, type: !136, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !140)
!135 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, null}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!140 = !{!141, !142}
!141 = !DILocalVariable(name: "fmt", arg: 1, scope: !134, file: !135, line: 194, type: !138)
!142 = !DILocalVariable(name: "argp", scope: !134, file: !135, line: 196, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !144, line: 32, baseType: !145)
!144 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 192, elements: !153)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !147, file: !3, line: 196, baseType: !28, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !147, file: !3, line: 196, baseType: !28, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !147, file: !3, line: 196, baseType: !61, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !147, file: !3, line: 196, baseType: !61, size: 64, offset: 128)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 8)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "__str", scope: !134, file: !135, line: 198, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 48, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 6)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "dns_pcbs", scope: !2, file: !3, line: 294, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 2048, elements: !130)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_pcb", file: !168, line: 81, size: 768, elements: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/udp.h", directory: "/root/.unikraft/apps/redis/build")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !200}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !167, file: !168, line: 83, baseType: !82, size: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !167, file: !168, line: 83, baseType: !82, size: 192, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 392)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 400)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 87, baseType: !166, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !168, line: 89, baseType: !74, size: 8, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !167, file: !168, line: 91, baseType: !68, size: 16, offset: 528)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !167, file: !168, line: 91, baseType: !68, size: 16, offset: 544)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ip4", scope: !167, file: !168, line: 96, baseType: !99, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ifindex", scope: !167, file: !168, line: 99, baseType: !74, size: 8, offset: 608)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !167, file: !168, line: 101, baseType: !74, size: 8, offset: 616)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !167, file: !168, line: 110, baseType: !184, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "udp_recv_fn", file: !168, line: 77, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !61, !166, !188, !199, !68}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !47, line: 186, size: 192, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !47, line: 188, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !189, file: !47, line: 191, baseType: !61, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !189, file: !47, line: 200, baseType: !68, size: 16, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !189, file: !47, line: 203, baseType: !68, size: 16, offset: 144)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !189, file: !47, line: 208, baseType: !74, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !47, line: 211, baseType: !74, size: 8, offset: 168)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !189, file: !47, line: 218, baseType: !74, size: 8, offset: 176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !189, file: !47, line: 221, baseType: !74, size: 8, offset: 184)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "recv_arg", scope: !167, file: !168, line: 112, baseType: !61, size: 64, offset: 704)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "dns_requests", scope: !2, file: !3, line: 300, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 6144, elements: !130)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_req_entry", file: !3, line: 243, size: 192, elements: !205)
!205 = !{!206, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "found", scope: !204, file: !3, line: 245, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_found_callback", file: !208, line: 103, baseType: !209)
!208 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/dns.h", directory: "/root/.unikraft/apps/redis/build")
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !138, !199, !61}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !204, file: !3, line: 247, baseType: !61, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dns_table_idx", scope: !204, file: !3, line: 249, baseType: !74, size: 8, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reqaddrtype", scope: !204, file: !3, line: 252, baseType: !74, size: 8, offset: 136)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "dns_seqno", scope: !2, file: !3, line: 298, type: !74, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "dns_last_pcb_idx", scope: !2, file: !3, line: 296, type: !74, isLocal: true, isDefinition: true)
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!223 = distinct !DISubprogram(name: "dns_init", scope: !3, file: !3, line: 315, type: !224, isLocal: false, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{null}
!226 = !{}
!227 = !DILocation(line: 351, column: 1, scope: !223)
!228 = distinct !DISubprogram(name: "dns_setserver", scope: !3, file: !3, line: 361, type: !229, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !74, !199}
!231 = !{!232, !233}
!232 = !DILocalVariable(name: "numdns", arg: 1, scope: !228, file: !3, line: 361, type: !74)
!233 = !DILocalVariable(name: "dnsserver", arg: 2, scope: !228, file: !3, line: 361, type: !199)
!234 = !DILocation(line: 361, column: 20, scope: !228)
!235 = !DILocation(line: 361, column: 45, scope: !228)
!236 = !DILocation(line: 363, column: 14, scope: !237)
!237 = distinct !DILexicalBlock(scope: !228, file: !3, line: 363, column: 7)
!238 = !DILocation(line: 363, column: 7, scope: !228)
!239 = !DILocation(line: 364, column: 19, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 364, column: 9)
!241 = distinct !DILexicalBlock(scope: !237, file: !3, line: 363, column: 33)
!242 = !DILocation(line: 0, scope: !243)
!243 = distinct !DILexicalBlock(scope: !240, file: !3, line: 366, column: 12)
!244 = !DILocation(line: 0, scope: !245)
!245 = distinct !DILexicalBlock(scope: !240, file: !3, line: 364, column: 28)
!246 = !DILocation(line: 364, column: 9, scope: !241)
!247 = !DILocation(line: 365, column: 30, scope: !245)
!248 = !{i64 0, i64 16, !249, i64 16, i64 1, !249, i64 0, i64 4, !252, i64 20, i64 1, !249}
!249 = !{!250, !250, i64 0}
!250 = !{!"omnipotent char", !251, i64 0}
!251 = !{!"Simple C/C++ TBAA"}
!252 = !{!253, !253, i64 0}
!253 = !{!"int", !250, i64 0}
!254 = !DILocation(line: 366, column: 5, scope: !245)
!255 = !DILocation(line: 367, column: 29, scope: !243)
!256 = !DILocation(line: 370, column: 1, scope: !228)
!257 = distinct !DISubprogram(name: "dns_getserver", scope: !3, file: !3, line: 381, type: !258, isLocal: false, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!199, !74}
!260 = !{!261}
!261 = !DILocalVariable(name: "numdns", arg: 1, scope: !257, file: !3, line: 381, type: !74)
!262 = !DILocation(line: 381, column: 20, scope: !257)
!263 = !DILocation(line: 383, column: 14, scope: !264)
!264 = distinct !DILexicalBlock(scope: !257, file: !3, line: 383, column: 7)
!265 = !DILocation(line: 384, column: 13, scope: !266)
!266 = distinct !DILexicalBlock(scope: !264, file: !3, line: 383, column: 33)
!267 = !DILocation(line: 383, column: 7, scope: !257)
!268 = !DILocation(line: 388, column: 1, scope: !257)
!269 = distinct !DISubprogram(name: "dns_tmr", scope: !3, file: !3, line: 395, type: !224, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !226)
!270 = !DILocalVariable(name: "i", scope: !271, file: !3, line: 1126, type: !74)
!271 = distinct !DISubprogram(name: "dns_check_entries", scope: !3, file: !3, line: 1124, type: !224, isLocal: true, isDefinition: true, scopeLine: 1125, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !272)
!272 = !{!270}
!273 = !DILocation(line: 1126, column: 8, scope: !271, inlinedAt: !274)
!274 = distinct !DILocation(line: 398, column: 3, scope: !269)
!275 = !DILocation(line: 1129, column: 5, scope: !276, inlinedAt: !274)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 1128, column: 40)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 1128, column: 3)
!278 = distinct !DILexicalBlock(scope: !271, file: !3, line: 1128, column: 3)
!279 = !DILocation(line: 1131, column: 1, scope: !271, inlinedAt: !274)
!280 = !DILocation(line: 399, column: 1, scope: !269)
!281 = distinct !DISubprogram(name: "dns_gethostbyname", scope: !3, file: !3, line: 1526, type: !282, isLocal: false, isDefinition: true, scopeLine: 1528, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !290)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !138, !289, !207, !61}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !6, line: 96, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !63, line: 126, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !65, line: 20, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !67, line: 41, baseType: !288)
!288 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!290 = !{!291, !292, !293, !294}
!291 = !DILocalVariable(name: "hostname", arg: 1, scope: !281, file: !3, line: 1526, type: !138)
!292 = !DILocalVariable(name: "addr", arg: 2, scope: !281, file: !3, line: 1526, type: !289)
!293 = !DILocalVariable(name: "found", arg: 3, scope: !281, file: !3, line: 1526, type: !207)
!294 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !281, file: !3, line: 1527, type: !61)
!295 = !DILocation(line: 1526, column: 31, scope: !281)
!296 = !DILocation(line: 1526, column: 52, scope: !281)
!297 = !DILocation(line: 1526, column: 77, scope: !281)
!298 = !DILocation(line: 1527, column: 25, scope: !281)
!299 = !DILocation(line: 1529, column: 10, scope: !281)
!300 = !DILocation(line: 1529, column: 3, scope: !281)
!301 = distinct !DISubprogram(name: "dns_gethostbyname_addrtype", scope: !3, file: !3, line: 1547, type: !302, isLocal: false, isDefinition: true, scopeLine: 1549, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!284, !138, !289, !207, !61, !74}
!304 = !{!305, !306, !307, !308, !309, !310, !315}
!305 = !DILocalVariable(name: "hostname", arg: 1, scope: !301, file: !3, line: 1547, type: !138)
!306 = !DILocalVariable(name: "addr", arg: 2, scope: !301, file: !3, line: 1547, type: !289)
!307 = !DILocalVariable(name: "found", arg: 3, scope: !301, file: !3, line: 1547, type: !207)
!308 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !301, file: !3, line: 1548, type: !61)
!309 = !DILocalVariable(name: "dns_addrtype", arg: 5, scope: !301, file: !3, line: 1548, type: !74)
!310 = !DILocalVariable(name: "hostnamelen", scope: !301, file: !3, line: 1550, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !312, line: 40, baseType: !313)
!312 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !314, line: 129, baseType: !72)
!314 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!315 = !DILocalVariable(name: "fallback", scope: !316, file: !3, line: 1596, type: !74)
!316 = distinct !DILexicalBlock(scope: !317, file: !3, line: 1594, column: 103)
!317 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1594, column: 7)
!318 = !DILocation(line: 1547, column: 40, scope: !301)
!319 = !DILocation(line: 1547, column: 61, scope: !301)
!320 = !DILocation(line: 1547, column: 86, scope: !301)
!321 = !DILocation(line: 1548, column: 34, scope: !301)
!322 = !DILocation(line: 1548, column: 53, scope: !301)
!323 = !DILocation(line: 1556, column: 13, scope: !324)
!324 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1556, column: 7)
!325 = !DILocation(line: 1557, column: 9, scope: !324)
!326 = !DILocation(line: 1556, column: 22, scope: !324)
!327 = !DILocation(line: 1557, column: 24, scope: !324)
!328 = !DILocation(line: 1556, column: 7, scope: !301)
!329 = !DILocation(line: 1565, column: 17, scope: !301)
!330 = !DILocation(line: 1550, column: 10, scope: !301)
!331 = !DILocation(line: 1566, column: 19, scope: !332)
!332 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1566, column: 7)
!333 = !DILocation(line: 1566, column: 7, scope: !301)
!334 = !DILocation(line: 1580, column: 7, scope: !335)
!335 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1580, column: 7)
!336 = !DILocation(line: 1580, column: 7, scope: !301)
!337 = !DILocation(line: 1582, column: 10, scope: !338)
!338 = distinct !DILexicalBlock(scope: !339, file: !3, line: 1582, column: 9)
!339 = distinct !DILexicalBlock(scope: !335, file: !3, line: 1580, column: 36)
!340 = !{!341, !250, i64 20}
!341 = !{!"ip_addr", !250, i64 0, !250, i64 20}
!342 = !DILocation(line: 1582, column: 42, scope: !338)
!343 = !DILocation(line: 1582, column: 25, scope: !338)
!344 = !DILocation(line: 1583, column: 10, scope: !338)
!345 = !DILocation(line: 1583, column: 42, scope: !338)
!346 = !DILocation(line: 1583, column: 25, scope: !338)
!347 = !DILocation(line: 1590, column: 7, scope: !348)
!348 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1590, column: 7)
!349 = !DILocation(line: 1590, column: 70, scope: !348)
!350 = !DILocation(line: 1590, column: 7, scope: !301)
!351 = !DILocation(line: 1594, column: 53, scope: !317)
!352 = !DILocation(line: 1594, column: 21, scope: !317)
!353 = !DILocation(line: 1599, column: 5, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 1597, column: 54)
!355 = distinct !DILexicalBlock(scope: !316, file: !3, line: 1597, column: 9)
!356 = !DILocation(line: 1596, column: 10, scope: !316)
!357 = !DILocation(line: 1602, column: 9, scope: !358)
!358 = distinct !DILexicalBlock(scope: !316, file: !3, line: 1602, column: 9)
!359 = !DILocation(line: 1602, column: 68, scope: !358)
!360 = !DILocation(line: 1621, column: 9, scope: !361)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 1621, column: 9)
!362 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1619, column: 3)
!363 = !DILocation(line: 1621, column: 9, scope: !362)
!364 = !DILocation(line: 1388, column: 23, scope: !365, inlinedAt: !393)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 1388, column: 9)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 1387, column: 40)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1387, column: 3)
!368 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1387, column: 3)
!369 = distinct !DISubprogram(name: "dns_enqueue", scope: !3, file: !3, line: 1375, type: !370, isLocal: true, isDefinition: true, scopeLine: 1377, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{!284, !138, !311, !207, !61, !74}
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !383, !384, !386, !387}
!373 = !DILocalVariable(name: "name", arg: 1, scope: !369, file: !3, line: 1375, type: !138)
!374 = !DILocalVariable(name: "hostnamelen", arg: 2, scope: !369, file: !3, line: 1375, type: !311)
!375 = !DILocalVariable(name: "found", arg: 3, scope: !369, file: !3, line: 1375, type: !207)
!376 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !369, file: !3, line: 1376, type: !61)
!377 = !DILocalVariable(name: "dns_addrtype", arg: 5, scope: !369, file: !3, line: 1376, type: !74)
!378 = !DILocalVariable(name: "i", scope: !369, file: !3, line: 1378, type: !74)
!379 = !DILocalVariable(name: "lseq", scope: !369, file: !3, line: 1379, type: !74)
!380 = !DILocalVariable(name: "lseqi", scope: !369, file: !3, line: 1379, type: !74)
!381 = !DILocalVariable(name: "entry", scope: !369, file: !3, line: 1380, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!383 = !DILocalVariable(name: "namelen", scope: !369, file: !3, line: 1381, type: !311)
!384 = !DILocalVariable(name: "req", scope: !369, file: !3, line: 1382, type: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!386 = !DILocalVariable(name: "r", scope: !369, file: !3, line: 1385, type: !74)
!387 = !DILocalVariable(name: "age", scope: !388, file: !3, line: 1425, type: !74)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 1424, column: 41)
!389 = distinct !DILexicalBlock(scope: !390, file: !3, line: 1424, column: 9)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 1417, column: 40)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 1417, column: 3)
!392 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1417, column: 3)
!393 = distinct !DILocation(line: 1627, column: 10, scope: !301)
!394 = !DILocation(line: 1378, column: 8, scope: !369, inlinedAt: !393)
!395 = !DILocation(line: 1380, column: 27, scope: !369, inlinedAt: !393)
!396 = !DILocation(line: 1379, column: 14, scope: !369, inlinedAt: !393)
!397 = !DILocation(line: 1379, column: 8, scope: !369, inlinedAt: !393)
!398 = !DILocation(line: 1417, column: 3, scope: !392, inlinedAt: !393)
!399 = !{!400, !250, i64 30}
!400 = !{!"dns_table_entry", !253, i64 0, !341, i64 4, !401, i64 28, !250, i64 30, !250, i64 31, !250, i64 32, !250, i64 33, !250, i64 34, !250, i64 35, !250, i64 36, !250, i64 292}
!401 = !{!"short", !250, i64 0}
!402 = !DILocation(line: 1388, column: 29, scope: !365, inlinedAt: !393)
!403 = !DILocation(line: 1388, column: 50, scope: !365, inlinedAt: !393)
!404 = !DILocation(line: 1389, column: 30, scope: !365, inlinedAt: !393)
!405 = !DILocation(line: 1389, column: 10, scope: !365, inlinedAt: !393)
!406 = !DILocation(line: 1389, column: 76, scope: !365, inlinedAt: !393)
!407 = !DILocation(line: 1388, column: 9, scope: !366, inlinedAt: !393)
!408 = !DILocation(line: 1391, column: 24, scope: !409, inlinedAt: !393)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 1391, column: 11)
!410 = distinct !DILexicalBlock(scope: !365, file: !3, line: 1389, column: 83)
!411 = !{!400, !250, i64 292}
!412 = !DILocation(line: 1391, column: 36, scope: !409, inlinedAt: !393)
!413 = !DILocation(line: 1391, column: 11, scope: !410, inlinedAt: !393)
!414 = !DILocation(line: 1385, column: 8, scope: !369, inlinedAt: !393)
!415 = !DILocation(line: 1400, column: 29, scope: !416, inlinedAt: !393)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 1400, column: 13)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 1399, column: 46)
!418 = distinct !DILexicalBlock(scope: !419, file: !3, line: 1399, column: 7)
!419 = distinct !DILexicalBlock(scope: !410, file: !3, line: 1399, column: 7)
!420 = !{!421, !422, i64 0}
!421 = !{!"dns_req_entry", !422, i64 0, !422, i64 8, !250, i64 16, !250, i64 17}
!422 = !{!"any pointer", !250, i64 0}
!423 = !DILocation(line: 1400, column: 35, scope: !416, inlinedAt: !393)
!424 = !DILocation(line: 1399, column: 42, scope: !418, inlinedAt: !393)
!425 = !DILocation(line: 1400, column: 13, scope: !417, inlinedAt: !393)
!426 = !DILocation(line: 1401, column: 33, scope: !427, inlinedAt: !393)
!427 = distinct !DILexicalBlock(scope: !416, file: !3, line: 1400, column: 41)
!428 = !DILocation(line: 1402, column: 27, scope: !427, inlinedAt: !393)
!429 = !DILocation(line: 1402, column: 31, scope: !427, inlinedAt: !393)
!430 = !{!421, !422, i64 8}
!431 = !DILocation(line: 1403, column: 27, scope: !427, inlinedAt: !393)
!432 = !DILocation(line: 1403, column: 41, scope: !427, inlinedAt: !393)
!433 = !{!421, !250, i64 16}
!434 = !DILocation(line: 1404, column: 11, scope: !435, inlinedAt: !393)
!435 = distinct !DILexicalBlock(scope: !427, file: !3, line: 1404, column: 11)
!436 = !{!421, !250, i64 17}
!437 = !DILocation(line: 1406, column: 11, scope: !427, inlinedAt: !393)
!438 = !DILocation(line: 1387, column: 36, scope: !367, inlinedAt: !393)
!439 = !DILocation(line: 1387, column: 17, scope: !367, inlinedAt: !393)
!440 = !DILocation(line: 1387, column: 3, scope: !368, inlinedAt: !393)
!441 = distinct !{!441, !442, !443}
!442 = !DILocation(line: 1387, column: 3, scope: !368)
!443 = !DILocation(line: 1410, column: 3, scope: !368)
!444 = !DILocation(line: 1420, column: 16, scope: !445, inlinedAt: !393)
!445 = distinct !DILexicalBlock(scope: !390, file: !3, line: 1420, column: 9)
!446 = !DILocation(line: 1420, column: 9, scope: !390, inlinedAt: !393)
!447 = !DILocation(line: 1425, column: 44, scope: !388, inlinedAt: !393)
!448 = !{!400, !250, i64 34}
!449 = !DILocation(line: 1425, column: 35, scope: !388, inlinedAt: !393)
!450 = !DILocation(line: 1425, column: 12, scope: !388, inlinedAt: !393)
!451 = !DILocation(line: 1426, column: 15, scope: !452, inlinedAt: !393)
!452 = distinct !DILexicalBlock(scope: !388, file: !3, line: 1426, column: 11)
!453 = !DILocation(line: 1426, column: 11, scope: !388, inlinedAt: !393)
!454 = !DILocation(line: 1430, column: 5, scope: !388, inlinedAt: !393)
!455 = !DILocation(line: 0, scope: !369, inlinedAt: !393)
!456 = !DILocation(line: 1417, column: 35, scope: !391, inlinedAt: !393)
!457 = !DILocation(line: 1418, column: 14, scope: !390, inlinedAt: !393)
!458 = !DILocation(line: 1434, column: 9, scope: !459, inlinedAt: !393)
!459 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1434, column: 7)
!460 = !DILocation(line: 1434, column: 7, scope: !369, inlinedAt: !393)
!461 = !DILocation(line: 1435, column: 16, scope: !462, inlinedAt: !393)
!462 = distinct !DILexicalBlock(scope: !463, file: !3, line: 1435, column: 9)
!463 = distinct !DILexicalBlock(scope: !459, file: !3, line: 1434, column: 28)
!464 = !DILocation(line: 1435, column: 35, scope: !462, inlinedAt: !393)
!465 = !DILocation(line: 1435, column: 39, scope: !462, inlinedAt: !393)
!466 = !DILocation(line: 1435, column: 56, scope: !462, inlinedAt: !393)
!467 = !DILocation(line: 1435, column: 62, scope: !462, inlinedAt: !393)
!468 = !DILocation(line: 1435, column: 9, scope: !463, inlinedAt: !393)
!469 = !DILocation(line: 1444, column: 3, scope: !463, inlinedAt: !393)
!470 = !DILocation(line: 1449, column: 8, scope: !471, inlinedAt: !393)
!471 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1449, column: 3)
!472 = !DILocation(line: 0, scope: !390, inlinedAt: !393)
!473 = !DILocation(line: 0, scope: !392, inlinedAt: !393)
!474 = !DILocation(line: 1382, column: 25, scope: !369, inlinedAt: !393)
!475 = !DILocation(line: 1449, column: 3, scope: !471, inlinedAt: !393)
!476 = !DILocation(line: 1450, column: 25, scope: !477, inlinedAt: !393)
!477 = distinct !DILexicalBlock(scope: !478, file: !3, line: 1450, column: 9)
!478 = distinct !DILexicalBlock(scope: !479, file: !3, line: 1449, column: 42)
!479 = distinct !DILexicalBlock(scope: !471, file: !3, line: 1449, column: 3)
!480 = !DILocation(line: 1450, column: 31, scope: !477, inlinedAt: !393)
!481 = !DILocation(line: 1449, column: 38, scope: !479, inlinedAt: !393)
!482 = !DILocation(line: 1450, column: 9, scope: !478, inlinedAt: !393)
!483 = !DILocation(line: 1460, column: 8, scope: !369, inlinedAt: !393)
!484 = !DILocation(line: 1460, column: 22, scope: !369, inlinedAt: !393)
!485 = !DILocation(line: 1470, column: 10, scope: !369, inlinedAt: !393)
!486 = !DILocation(line: 1470, column: 16, scope: !369, inlinedAt: !393)
!487 = !DILocation(line: 1471, column: 10, scope: !369, inlinedAt: !393)
!488 = !DILocation(line: 1471, column: 16, scope: !369, inlinedAt: !393)
!489 = !DILocation(line: 1472, column: 3, scope: !490, inlinedAt: !393)
!490 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1472, column: 3)
!491 = !DILocation(line: 1473, column: 3, scope: !492, inlinedAt: !393)
!492 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1473, column: 3)
!493 = !DILocation(line: 1474, column: 14, scope: !369, inlinedAt: !393)
!494 = !DILocation(line: 1475, column: 8, scope: !369, inlinedAt: !393)
!495 = !DILocation(line: 1475, column: 14, scope: !369, inlinedAt: !393)
!496 = !DILocation(line: 1476, column: 13, scope: !369, inlinedAt: !393)
!497 = !DILocation(line: 1381, column: 10, scope: !369, inlinedAt: !393)
!498 = !DILocation(line: 1477, column: 3, scope: !369, inlinedAt: !393)
!499 = !DILocation(line: 1478, column: 3, scope: !369, inlinedAt: !393)
!500 = !DILocation(line: 1478, column: 24, scope: !369, inlinedAt: !393)
!501 = !DILocalVariable(name: "i", scope: !502, file: !3, line: 902, type: !74)
!502 = distinct !DISubprogram(name: "dns_alloc_pcb", scope: !3, file: !3, line: 900, type: !503, isLocal: true, isDefinition: true, scopeLine: 901, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{!74}
!505 = !{!501, !506}
!506 = !DILocalVariable(name: "idx", scope: !502, file: !3, line: 903, type: !74)
!507 = !DILocation(line: 902, column: 8, scope: !502, inlinedAt: !508)
!508 = distinct !DILocation(line: 1481, column: 20, scope: !369, inlinedAt: !393)
!509 = !DILocation(line: 906, column: 9, scope: !510, inlinedAt: !508)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 906, column: 9)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 905, column: 46)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 905, column: 3)
!513 = distinct !DILexicalBlock(scope: !502, file: !3, line: 905, column: 3)
!514 = !{!422, !422, i64 0}
!515 = !DILocation(line: 906, column: 21, scope: !510, inlinedAt: !508)
!516 = !DILocation(line: 906, column: 9, scope: !511, inlinedAt: !508)
!517 = !DILocation(line: 871, column: 9, scope: !518, inlinedAt: !526)
!518 = distinct !DISubprogram(name: "dns_alloc_random_port", scope: !3, file: !3, line: 866, type: !519, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!166}
!521 = !{!522, !523, !524}
!522 = !DILocalVariable(name: "err", scope: !518, file: !3, line: 868, type: !284)
!523 = !DILocalVariable(name: "pcb", scope: !518, file: !3, line: 869, type: !166)
!524 = !DILocalVariable(name: "port", scope: !525, file: !3, line: 877, type: !68)
!525 = distinct !DILexicalBlock(scope: !518, file: !3, line: 876, column: 6)
!526 = distinct !DILocation(line: 911, column: 19, scope: !527, inlinedAt: !508)
!527 = distinct !DILexicalBlock(scope: !528, file: !3, line: 910, column: 33)
!528 = distinct !DILexicalBlock(scope: !502, file: !3, line: 910, column: 7)
!529 = !DILocation(line: 869, column: 19, scope: !518, inlinedAt: !526)
!530 = !DILocation(line: 872, column: 11, scope: !531, inlinedAt: !526)
!531 = distinct !DILexicalBlock(scope: !518, file: !3, line: 872, column: 7)
!532 = !DILocation(line: 872, column: 7, scope: !518, inlinedAt: !526)
!533 = !DILocation(line: 65, column: 2, scope: !534, inlinedAt: !551)
!534 = distinct !DISubprogram(name: "isolated_rand", scope: !535, file: !535, line: 63, type: !536, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!535 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/cc.h", directory: "/root/.unikraft/apps/redis/build")
!536 = !DISubroutineType(types: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !539, line: 88, baseType: !28)
!539 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!540 = !{!541, !542, !548}
!541 = !DILocalVariable(name: "randn", scope: !534, file: !535, line: 65, type: !538)
!542 = !DILocalVariable(name: "tid", scope: !543, file: !535, line: 66, type: !64)
!543 = distinct !DILexicalBlock(scope: !544, file: !535, line: 66, column: 2)
!544 = distinct !DILexicalBlock(scope: !545, file: !535, line: 66, column: 2)
!545 = distinct !DILexicalBlock(scope: !546, file: !535, line: 66, column: 2)
!546 = distinct !DILexicalBlock(scope: !547, file: !535, line: 66, column: 2)
!547 = distinct !DILexicalBlock(scope: !534, file: !535, line: 66, column: 2)
!548 = !DILocalVariable(name: "_ret", scope: !543, file: !535, line: 66, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !65, line: 60, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !67, line: 105, baseType: !72)
!551 = distinct !DILocation(line: 877, column: 25, scope: !525, inlinedAt: !526)
!552 = !DILocation(line: 120, column: 2, scope: !553, inlinedAt: !559)
!553 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !554, file: !554, line: 116, type: !555, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !557)
!554 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!555 = !DISubroutineType(types: !556)
!556 = !{!72}
!557 = !{!558}
!558 = !DILocalVariable(name: "sp", scope: !553, file: !554, line: 118, type: !72)
!559 = distinct !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !551)
!560 = !{i32 567311}
!561 = !DILocation(line: 118, column: 16, scope: !553, inlinedAt: !559)
!562 = !DILocation(line: 121, column: 2, scope: !553, inlinedAt: !559)
!563 = !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !551)
!564 = !DILocation(line: 120, column: 2, scope: !553, inlinedAt: !565)
!565 = distinct !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !551)
!566 = !DILocation(line: 118, column: 16, scope: !553, inlinedAt: !565)
!567 = !DILocation(line: 121, column: 2, scope: !553, inlinedAt: !565)
!568 = !DILocation(line: 66, column: 2, scope: !547, inlinedAt: !551)
!569 = !DILocation(line: 65, column: 11, scope: !570, inlinedAt: !575)
!570 = distinct !DISubprogram(name: "uk_swrand_randr", scope: !571, file: !571, line: 60, type: !536, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !572)
!571 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukswrand/include/uk/swrand.h", directory: "/root/.unikraft/apps/redis/build")
!572 = !{!573, !574}
!573 = !DILocalVariable(name: "iflags", scope: !570, file: !571, line: 62, type: !72)
!574 = !DILocalVariable(name: "ret", scope: !570, file: !571, line: 63, type: !538)
!575 = distinct !DILocation(line: 66, column: 2, scope: !576, inlinedAt: !551)
!576 = distinct !DILexicalBlock(scope: !546, file: !535, line: 66, column: 2)
!577 = !DILocation(line: 62, column: 16, scope: !570, inlinedAt: !575)
!578 = !DILocation(line: 66, column: 8, scope: !570, inlinedAt: !575)
!579 = !DILocation(line: 63, column: 8, scope: !570, inlinedAt: !575)
!580 = !DILocation(line: 67, column: 2, scope: !570, inlinedAt: !575)
!581 = !DILocation(line: 69, column: 2, scope: !570, inlinedAt: !575)
!582 = !DILocation(line: 65, column: 8, scope: !534, inlinedAt: !551)
!583 = !DILocation(line: 66, column: 2, scope: !576, inlinedAt: !551)
!584 = !DILocation(line: 120, column: 2, scope: !553, inlinedAt: !585)
!585 = distinct !DILocation(line: 49, column: 21, scope: !586, inlinedAt: !592)
!586 = distinct !DISubprogram(name: "uk_thread_get_tid", scope: !587, file: !587, line: 47, type: !588, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !590)
!587 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku-impl.h", directory: "/root/.unikraft/apps/redis/build")
!588 = !DISubroutineType(types: !589)
!589 = !{!7}
!590 = !{!591}
!591 = !DILocalVariable(name: "sp", scope: !586, file: !587, line: 49, type: !72)
!592 = distinct !DILocation(line: 66, column: 2, scope: !543, inlinedAt: !551)
!593 = !DILocation(line: 118, column: 16, scope: !553, inlinedAt: !585)
!594 = !DILocation(line: 121, column: 2, scope: !553, inlinedAt: !585)
!595 = !DILocation(line: 49, column: 16, scope: !586, inlinedAt: !592)
!596 = !DILocation(line: 50, column: 19, scope: !586, inlinedAt: !592)
!597 = !DILocation(line: 50, column: 11, scope: !586, inlinedAt: !592)
!598 = !DILocation(line: 50, column: 9, scope: !586, inlinedAt: !592)
!599 = !DILocation(line: 50, column: 2, scope: !586, inlinedAt: !592)
!600 = !DILocation(line: 66, column: 2, scope: !543, inlinedAt: !551)
!601 = !{i32 -2146788971, i32 -2146788958, i32 -2146788933, i32 -2146788909, i32 -2146788884, i32 -2146788809, i32 -2146788784, i32 -2146788640, i32 -2146785547, i32 -2146785458, i32 -2146785337, i32 -2146785242, i32 -2146785141, i32 -2146785114, i32 -2146785031, i32 -2146784942, i32 -2146784821, i32 -2146784721, i32 -2146784615, i32 -2146784507, i32 -2146788357, i32 -2146788304, i32 -2146788273, i32 -2146788242, i32 -2146788221, i32 -2146788199, i32 -2146788150, i32 -2146788129, i32 -2146784424, i32 -2146784335, i32 -2146784214, i32 -2146784115, i32 -2146784009, i32 -2146783907, i32 -2146783874, i32 -2146783801, i32 -2146783733, i32 -2146787827, i32 -2146787768, i32 -2146787715, i32 -2146787684, i32 -2146787653, i32 -2146787632, i32 -2146787610, i32 -2146787561, i32 -2146787540, i32 -2146783682, i32 -2146783593, i32 -2146783472, i32 -2146783373, i32 -2146783267, i32 -2146783165, i32 -2146783132, i32 -2146783049, i32 -2146782960, i32 -2146782839, i32 -2146782739, i32 -2146782713, i32 -2146782610, i32 -2146782584, i32 -2146787282, i32 -2146787215, i32 -2146787190, i32 -2146787126, i32 -2146787044, i32 -2146787021, i32 -2146786996, i32 -2146786971}
!602 = !DILocation(line: 66, column: 2, scope: !603, inlinedAt: !551)
!603 = distinct !DILexicalBlock(scope: !604, file: !535, line: 66, column: 2)
!604 = distinct !DILexicalBlock(scope: !543, file: !535, line: 66, column: 2)
!605 = !{i32 -2146786024, i32 -2146786007}
!606 = !DILocation(line: 67, column: 9, scope: !534, inlinedAt: !551)
!607 = !DILocation(line: 68, column: 1, scope: !534, inlinedAt: !551)
!608 = !DILocation(line: 67, column: 2, scope: !534, inlinedAt: !551)
!609 = !DILocation(line: 878, column: 9, scope: !610, inlinedAt: !526)
!610 = distinct !DILexicalBlock(scope: !525, file: !3, line: 878, column: 9)
!611 = !DILocation(line: 878, column: 9, scope: !525, inlinedAt: !526)
!612 = !DILocation(line: 877, column: 18, scope: !525, inlinedAt: !526)
!613 = !DILocation(line: 877, column: 11, scope: !525, inlinedAt: !526)
!614 = !DILocation(line: 879, column: 13, scope: !615, inlinedAt: !526)
!615 = distinct !DILexicalBlock(scope: !610, file: !3, line: 878, column: 33)
!616 = !DILocation(line: 868, column: 9, scope: !518, inlinedAt: !526)
!617 = !DILocation(line: 880, column: 5, scope: !615, inlinedAt: !526)
!618 = !DILocation(line: 0, scope: !619, inlinedAt: !526)
!619 = distinct !DILexicalBlock(scope: !610, file: !3, line: 880, column: 12)
!620 = !DILocation(line: 884, column: 3, scope: !525, inlinedAt: !526)
!621 = !DILocation(line: 886, column: 5, scope: !622, inlinedAt: !526)
!622 = distinct !DILexicalBlock(scope: !623, file: !3, line: 885, column: 22)
!623 = distinct !DILexicalBlock(scope: !518, file: !3, line: 885, column: 7)
!624 = !DILocation(line: 887, column: 5, scope: !622, inlinedAt: !526)
!625 = !DILocation(line: 891, column: 1, scope: !518, inlinedAt: !526)
!626 = !DILocation(line: 911, column: 17, scope: !527, inlinedAt: !508)
!627 = !DILocation(line: 912, column: 9, scope: !527, inlinedAt: !508)
!628 = !DILocation(line: 920, column: 28, scope: !629, inlinedAt: !508)
!629 = distinct !DILexicalBlock(scope: !502, file: !3, line: 920, column: 3)
!630 = !DILocation(line: 903, column: 8, scope: !502, inlinedAt: !508)
!631 = !DILocation(line: 920, column: 3, scope: !629, inlinedAt: !508)
!632 = !DILocation(line: 0, scope: !633, inlinedAt: !508)
!633 = distinct !DILexicalBlock(scope: !629, file: !3, line: 920, column: 3)
!634 = !DILocation(line: 921, column: 13, scope: !635, inlinedAt: !508)
!635 = distinct !DILexicalBlock(scope: !636, file: !3, line: 921, column: 9)
!636 = distinct !DILexicalBlock(scope: !633, file: !3, line: 920, column: 89)
!637 = !DILocation(line: 921, column: 9, scope: !636, inlinedAt: !508)
!638 = !DILocation(line: 924, column: 9, scope: !639, inlinedAt: !508)
!639 = distinct !DILexicalBlock(scope: !636, file: !3, line: 924, column: 9)
!640 = !DILocation(line: 924, column: 23, scope: !639, inlinedAt: !508)
!641 = !DILocation(line: 920, column: 78, scope: !633, inlinedAt: !508)
!642 = !DILocation(line: 924, column: 9, scope: !636, inlinedAt: !508)
!643 = !DILocation(line: 889, column: 3, scope: !518, inlinedAt: !526)
!644 = !DILocation(line: 1482, column: 7, scope: !369, inlinedAt: !393)
!645 = !DILocation(line: 930, column: 1, scope: !502, inlinedAt: !508)
!646 = !DILocation(line: 1481, column: 10, scope: !369, inlinedAt: !393)
!647 = !DILocation(line: 1481, column: 18, scope: !369, inlinedAt: !393)
!648 = !{!400, !250, i64 35}
!649 = !DILocation(line: 1485, column: 18, scope: !650, inlinedAt: !393)
!650 = distinct !DILexicalBlock(scope: !651, file: !3, line: 1482, column: 47)
!651 = distinct !DILexicalBlock(scope: !369, file: !3, line: 1482, column: 7)
!652 = !DILocation(line: 1486, column: 16, scope: !650, inlinedAt: !393)
!653 = !DILocation(line: 1487, column: 5, scope: !650, inlinedAt: !393)
!654 = !DILocation(line: 1496, column: 12, scope: !369, inlinedAt: !393)
!655 = !DILocation(line: 1499, column: 3, scope: !369, inlinedAt: !393)
!656 = !DILocation(line: 1502, column: 3, scope: !369, inlinedAt: !393)
!657 = !DILocation(line: 1503, column: 1, scope: !369, inlinedAt: !393)
!658 = !DILocation(line: 1627, column: 3, scope: !301)
!659 = !DILocation(line: 0, scope: !660)
!660 = distinct !DILexicalBlock(scope: !324, file: !3, line: 1557, column: 38)
!661 = !DILocation(line: 1629, column: 1, scope: !301)
!662 = !DILocation(line: 920, column: 53, scope: !633, inlinedAt: !508)
!663 = distinct !{!663, !664, !665}
!664 = !DILocation(line: 920, column: 3, scope: !629)
!665 = !DILocation(line: 928, column: 3, scope: !629)
!666 = !DILocation(line: 1449, column: 17, scope: !479, inlinedAt: !393)
!667 = distinct !{!667, !668, !669}
!668 = !DILocation(line: 1449, column: 3, scope: !471)
!669 = !DILocation(line: 1454, column: 3, scope: !471)
!670 = !DILocation(line: 1417, column: 17, scope: !391, inlinedAt: !393)
!671 = distinct !{!671, !672, !673}
!672 = !DILocation(line: 1417, column: 3, scope: !392)
!673 = !DILocation(line: 1431, column: 3, scope: !392)
!674 = !DILocation(line: 1399, column: 21, scope: !418, inlinedAt: !393)
!675 = !DILocation(line: 1399, column: 7, scope: !419, inlinedAt: !393)
!676 = distinct !{!676, !677, !678}
!677 = !DILocation(line: 1399, column: 7, scope: !419)
!678 = !DILocation(line: 1408, column: 7, scope: !419)
!679 = distinct !DISubprogram(name: "dns_lookup", scope: !3, file: !3, line: 602, type: !680, isLocal: true, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{!284, !138, !289, !74}
!682 = !{!683, !684, !685, !686}
!683 = !DILocalVariable(name: "name", arg: 1, scope: !679, file: !3, line: 602, type: !138)
!684 = !DILocalVariable(name: "addr", arg: 2, scope: !679, file: !3, line: 602, type: !289)
!685 = !DILocalVariable(name: "dns_addrtype", arg: 3, scope: !679, file: !3, line: 602, type: !74)
!686 = !DILocalVariable(name: "i", scope: !679, file: !3, line: 604, type: !74)
!687 = !DILocation(line: 602, column: 24, scope: !679)
!688 = !DILocation(line: 602, column: 41, scope: !679)
!689 = !DILocation(line: 602, column: 46, scope: !679)
!690 = !DILocation(line: 604, column: 8, scope: !679)
!691 = !DILocation(line: 617, column: 3, scope: !692)
!692 = distinct !DILexicalBlock(scope: !679, file: !3, line: 617, column: 3)
!693 = !DILocation(line: 618, column: 23, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 618, column: 9)
!695 = distinct !DILexicalBlock(scope: !696, file: !3, line: 617, column: 40)
!696 = distinct !DILexicalBlock(scope: !692, file: !3, line: 617, column: 3)
!697 = !DILocation(line: 618, column: 29, scope: !694)
!698 = !DILocation(line: 618, column: 48, scope: !694)
!699 = !DILocation(line: 619, column: 30, scope: !694)
!700 = !DILocation(line: 619, column: 10, scope: !694)
!701 = !DILocation(line: 619, column: 76, scope: !694)
!702 = !DILocation(line: 619, column: 82, scope: !694)
!703 = !DILocation(line: 620, column: 9, scope: !694)
!704 = !{!400, !250, i64 24}
!705 = !DILocation(line: 618, column: 9, scope: !695)
!706 = !DILocation(line: 624, column: 11, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 624, column: 11)
!708 = distinct !DILexicalBlock(scope: !694, file: !3, line: 620, column: 72)
!709 = !DILocation(line: 624, column: 11, scope: !708)
!710 = !DILocation(line: 625, column: 9, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !3, line: 625, column: 9)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 625, column: 9)
!713 = distinct !DILexicalBlock(scope: !707, file: !3, line: 624, column: 17)
!714 = !DILocation(line: 625, column: 9, scope: !715)
!715 = distinct !DILexicalBlock(scope: !712, file: !3, line: 625, column: 9)
!716 = !DILocation(line: 625, column: 9, scope: !717)
!717 = distinct !DILexicalBlock(scope: !718, file: !3, line: 625, column: 9)
!718 = distinct !DILexicalBlock(scope: !715, file: !3, line: 625, column: 9)
!719 = !DILocation(line: 625, column: 9, scope: !712)
!720 = !DILocation(line: 625, column: 9, scope: !718)
!721 = !DILocation(line: 625, column: 9, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 625, column: 9)
!723 = distinct !DILexicalBlock(scope: !715, file: !3, line: 625, column: 9)
!724 = !DILocation(line: 617, column: 35, scope: !696)
!725 = !DILocation(line: 617, column: 17, scope: !696)
!726 = distinct !{!726, !691, !727}
!727 = !DILocation(line: 629, column: 3, scope: !692)
!728 = !DILocation(line: 0, scope: !679)
!729 = !DILocation(line: 632, column: 1, scope: !679)
!730 = distinct !DISubprogram(name: "dns_check_entry", scope: !3, file: !3, line: 1047, type: !731, isLocal: true, isDefinition: true, scopeLine: 1048, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !74}
!733 = !{!734, !735, !736}
!734 = !DILocalVariable(name: "i", arg: 1, scope: !730, file: !3, line: 1047, type: !74)
!735 = !DILocalVariable(name: "err", scope: !730, file: !3, line: 1049, type: !284)
!736 = !DILocalVariable(name: "entry", scope: !730, file: !3, line: 1050, type: !382)
!737 = !DILocation(line: 1047, column: 22, scope: !730)
!738 = !DILocation(line: 1050, column: 36, scope: !730)
!739 = !DILocation(line: 1052, column: 3, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !3, line: 1052, column: 3)
!741 = distinct !DILexicalBlock(scope: !730, file: !3, line: 1052, column: 3)
!742 = !DILocation(line: 1052, column: 3, scope: !741)
!743 = !DILocation(line: 1052, column: 3, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !3, line: 1052, column: 3)
!745 = distinct !DILexicalBlock(scope: !740, file: !3, line: 1052, column: 3)
!746 = !DILocation(line: 1052, column: 3, scope: !747)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 1052, column: 3)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 1052, column: 3)
!749 = distinct !DILexicalBlock(scope: !744, file: !3, line: 1052, column: 3)
!750 = !DILocation(line: 1054, column: 18, scope: !730)
!751 = !DILocation(line: 1054, column: 3, scope: !730)
!752 = !DILocation(line: 1003, column: 3, scope: !753, inlinedAt: !759)
!753 = distinct !DISubprogram(name: "dns_create_txid", scope: !3, file: !3, line: 1000, type: !754, isLocal: true, isDefinition: true, scopeLine: 1001, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!68}
!756 = !{!757, !758}
!757 = !DILocalVariable(name: "txid", scope: !753, file: !3, line: 1002, type: !68)
!758 = !DILocalVariable(name: "i", scope: !753, file: !3, line: 1003, type: !74)
!759 = distinct !DILocation(line: 1057, column: 21, scope: !760)
!760 = distinct !DILexicalBlock(scope: !730, file: !3, line: 1054, column: 25)
!761 = !DILocation(line: 65, column: 2, scope: !534, inlinedAt: !762)
!762 = distinct !DILocation(line: 1006, column: 17, scope: !753, inlinedAt: !759)
!763 = !DILocation(line: 120, column: 2, scope: !553, inlinedAt: !764)
!764 = distinct !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !762)
!765 = !DILocation(line: 118, column: 16, scope: !553, inlinedAt: !764)
!766 = !DILocation(line: 121, column: 2, scope: !553, inlinedAt: !764)
!767 = !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !762)
!768 = !DILocation(line: 120, column: 2, scope: !553, inlinedAt: !769)
!769 = distinct !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !762)
!770 = !DILocation(line: 118, column: 16, scope: !553, inlinedAt: !769)
!771 = !DILocation(line: 121, column: 2, scope: !553, inlinedAt: !769)
!772 = !DILocation(line: 66, column: 2, scope: !547, inlinedAt: !762)
!773 = !DILocation(line: 65, column: 11, scope: !570, inlinedAt: !774)
!774 = distinct !DILocation(line: 66, column: 2, scope: !576, inlinedAt: !762)
!775 = !DILocation(line: 62, column: 16, scope: !570, inlinedAt: !774)
!776 = !DILocation(line: 66, column: 8, scope: !570, inlinedAt: !774)
!777 = !DILocation(line: 63, column: 8, scope: !570, inlinedAt: !774)
!778 = !DILocation(line: 67, column: 2, scope: !570, inlinedAt: !774)
!779 = !DILocation(line: 69, column: 2, scope: !570, inlinedAt: !774)
!780 = !DILocation(line: 65, column: 8, scope: !534, inlinedAt: !762)
!781 = !DILocation(line: 66, column: 2, scope: !576, inlinedAt: !762)
!782 = !DILocation(line: 120, column: 2, scope: !553, inlinedAt: !783)
!783 = distinct !DILocation(line: 49, column: 21, scope: !586, inlinedAt: !784)
!784 = distinct !DILocation(line: 66, column: 2, scope: !543, inlinedAt: !762)
!785 = !DILocation(line: 118, column: 16, scope: !553, inlinedAt: !783)
!786 = !DILocation(line: 121, column: 2, scope: !553, inlinedAt: !783)
!787 = !DILocation(line: 49, column: 16, scope: !586, inlinedAt: !784)
!788 = !DILocation(line: 50, column: 19, scope: !586, inlinedAt: !784)
!789 = !DILocation(line: 50, column: 11, scope: !586, inlinedAt: !784)
!790 = !DILocation(line: 50, column: 9, scope: !586, inlinedAt: !784)
!791 = !DILocation(line: 50, column: 2, scope: !586, inlinedAt: !784)
!792 = !DILocation(line: 66, column: 2, scope: !543, inlinedAt: !762)
!793 = !DILocation(line: 66, column: 2, scope: !603, inlinedAt: !762)
!794 = !DILocation(line: 67, column: 9, scope: !534, inlinedAt: !762)
!795 = !DILocation(line: 68, column: 1, scope: !534, inlinedAt: !762)
!796 = !DILocation(line: 67, column: 2, scope: !534, inlinedAt: !762)
!797 = !DILocation(line: 1006, column: 10, scope: !753, inlinedAt: !759)
!798 = !DILocation(line: 1002, column: 9, scope: !753, inlinedAt: !759)
!799 = !DILocation(line: 1003, column: 8, scope: !753, inlinedAt: !759)
!800 = !DILocation(line: 1009, column: 3, scope: !801, inlinedAt: !759)
!801 = distinct !DILexicalBlock(scope: !753, file: !3, line: 1009, column: 3)
!802 = !DILocation(line: 1010, column: 23, scope: !803, inlinedAt: !759)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 1010, column: 9)
!804 = distinct !DILexicalBlock(scope: !805, file: !3, line: 1009, column: 40)
!805 = distinct !DILexicalBlock(scope: !801, file: !3, line: 1009, column: 3)
!806 = !DILocation(line: 1010, column: 29, scope: !803, inlinedAt: !759)
!807 = !DILocation(line: 1010, column: 50, scope: !803, inlinedAt: !759)
!808 = !DILocation(line: 1011, column: 23, scope: !803, inlinedAt: !759)
!809 = !{!400, !401, i64 28}
!810 = !DILocation(line: 1011, column: 28, scope: !803, inlinedAt: !759)
!811 = !DILocation(line: 1010, column: 9, scope: !804, inlinedAt: !759)
!812 = !DILocation(line: 1009, column: 36, scope: !805, inlinedAt: !759)
!813 = !DILocation(line: 1017, column: 3, scope: !753, inlinedAt: !759)
!814 = !DILocation(line: 1057, column: 14, scope: !760)
!815 = !DILocation(line: 1057, column: 19, scope: !760)
!816 = !DILocation(line: 1058, column: 20, scope: !760)
!817 = !DILocation(line: 1059, column: 14, scope: !760)
!818 = !DILocation(line: 1059, column: 25, scope: !760)
!819 = !{!400, !250, i64 31}
!820 = !DILocation(line: 1060, column: 14, scope: !760)
!821 = !DILocation(line: 1060, column: 18, scope: !760)
!822 = !{!400, !250, i64 32}
!823 = !DILocation(line: 1061, column: 14, scope: !760)
!824 = !DILocation(line: 1061, column: 22, scope: !760)
!825 = !{!400, !250, i64 33}
!826 = !DILocation(line: 1064, column: 13, scope: !760)
!827 = !DILocation(line: 1049, column: 9, scope: !730)
!828 = !DILocation(line: 1069, column: 7, scope: !760)
!829 = !DILocation(line: 1071, column: 20, scope: !830)
!830 = distinct !DILexicalBlock(scope: !760, file: !3, line: 1071, column: 11)
!831 = !DILocation(line: 1071, column: 11, scope: !830)
!832 = !DILocation(line: 1071, column: 24, scope: !830)
!833 = !DILocation(line: 1071, column: 11, scope: !760)
!834 = !DILocation(line: 1072, column: 22, scope: !835)
!835 = distinct !DILexicalBlock(scope: !836, file: !3, line: 1072, column: 13)
!836 = distinct !DILexicalBlock(scope: !830, file: !3, line: 1071, column: 30)
!837 = !DILocation(line: 1072, column: 13, scope: !835)
!838 = !DILocation(line: 1072, column: 30, scope: !835)
!839 = !DILocation(line: 1072, column: 13, scope: !836)
!840 = !DILocalVariable(name: "ret", scope: !841, file: !3, line: 1026, type: !74)
!841 = distinct !DISubprogram(name: "dns_backupserver_available", scope: !3, file: !3, line: 1024, type: !842, isLocal: true, isDefinition: true, scopeLine: 1025, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{!74, !382}
!844 = !{!845, !840}
!845 = !DILocalVariable(name: "pentry", arg: 1, scope: !841, file: !3, line: 1024, type: !382)
!846 = !DILocation(line: 1026, column: 8, scope: !841, inlinedAt: !847)
!847 = distinct !DILocation(line: 1073, column: 15, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !3, line: 1073, column: 15)
!849 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1072, column: 50)
!850 = !DILocation(line: 1029, column: 18, scope: !851, inlinedAt: !847)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 1029, column: 9)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 1028, column: 15)
!853 = distinct !DILexicalBlock(scope: !841, file: !3, line: 1028, column: 7)
!854 = !DILocation(line: 1029, column: 10, scope: !851, inlinedAt: !847)
!855 = !DILocation(line: 1029, column: 29, scope: !851, inlinedAt: !847)
!856 = !DILocation(line: 1029, column: 33, scope: !851, inlinedAt: !847)
!857 = !DILocation(line: 1029, column: 52, scope: !851, inlinedAt: !847)
!858 = !DILocation(line: 1029, column: 56, scope: !851, inlinedAt: !847)
!859 = !DILocation(line: 1029, column: 9, scope: !852, inlinedAt: !847)
!860 = !DILocation(line: 1034, column: 3, scope: !841, inlinedAt: !847)
!861 = !DILocation(line: 1079, column: 30, scope: !862)
!862 = distinct !DILexicalBlock(scope: !848, file: !3, line: 1077, column: 16)
!863 = !DILocation(line: 1080, column: 24, scope: !862)
!864 = !DILocation(line: 1081, column: 28, scope: !862)
!865 = !DILocation(line: 1090, column: 9, scope: !849)
!866 = !DILocalVariable(name: "idx", arg: 1, scope: !867, file: !3, line: 942, type: !74)
!867 = distinct !DISubprogram(name: "dns_call_found", scope: !3, file: !3, line: 942, type: !868, isLocal: true, isDefinition: true, scopeLine: 943, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !870)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !74, !289}
!870 = !{!866, !871, !872}
!871 = !DILocalVariable(name: "addr", arg: 2, scope: !867, file: !3, line: 942, type: !289)
!872 = !DILocalVariable(name: "i", scope: !867, file: !3, line: 945, type: !74)
!873 = !DILocation(line: 942, column: 21, scope: !867, inlinedAt: !874)
!874 = distinct !DILocation(line: 1085, column: 13, scope: !875)
!875 = distinct !DILexicalBlock(scope: !848, file: !3, line: 1082, column: 18)
!876 = !DILocation(line: 942, column: 37, scope: !867, inlinedAt: !874)
!877 = !DILocation(line: 945, column: 8, scope: !867, inlinedAt: !874)
!878 = !DILocation(line: 962, column: 3, scope: !879, inlinedAt: !874)
!879 = distinct !DILexicalBlock(scope: !867, file: !3, line: 962, column: 3)
!880 = !DILocation(line: 977, column: 3, scope: !881, inlinedAt: !874)
!881 = distinct !DILexicalBlock(scope: !867, file: !3, line: 977, column: 3)
!882 = !DILocation(line: 963, column: 25, scope: !883, inlinedAt: !874)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 963, column: 9)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 962, column: 42)
!885 = distinct !DILexicalBlock(scope: !879, file: !3, line: 962, column: 3)
!886 = !DILocation(line: 963, column: 9, scope: !883, inlinedAt: !874)
!887 = !DILocation(line: 963, column: 31, scope: !883, inlinedAt: !874)
!888 = !DILocation(line: 963, column: 51, scope: !883, inlinedAt: !874)
!889 = !DILocation(line: 963, column: 65, scope: !883, inlinedAt: !874)
!890 = !DILocation(line: 963, column: 9, scope: !884, inlinedAt: !874)
!891 = !DILocation(line: 964, column: 75, scope: !892, inlinedAt: !874)
!892 = distinct !DILexicalBlock(scope: !883, file: !3, line: 963, column: 74)
!893 = !DILocation(line: 964, column: 7, scope: !892, inlinedAt: !874)
!894 = !DILocation(line: 966, column: 29, scope: !892, inlinedAt: !874)
!895 = !DILocation(line: 967, column: 5, scope: !892, inlinedAt: !874)
!896 = !DILocation(line: 962, column: 38, scope: !885, inlinedAt: !874)
!897 = !DILocation(line: 962, column: 17, scope: !885, inlinedAt: !874)
!898 = distinct !{!898, !899, !900}
!899 = !DILocation(line: 962, column: 3, scope: !879)
!900 = !DILocation(line: 968, column: 3, scope: !879)
!901 = !DILocation(line: 978, column: 11, scope: !902, inlinedAt: !874)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 978, column: 9)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 977, column: 42)
!904 = distinct !DILexicalBlock(scope: !881, file: !3, line: 977, column: 3)
!905 = !DILocation(line: 978, column: 9, scope: !903, inlinedAt: !874)
!906 = !DILocation(line: 981, column: 22, scope: !907, inlinedAt: !874)
!907 = distinct !DILexicalBlock(scope: !903, file: !3, line: 981, column: 9)
!908 = !DILocation(line: 981, column: 28, scope: !907, inlinedAt: !874)
!909 = !DILocation(line: 981, column: 9, scope: !903, inlinedAt: !874)
!910 = !DILocation(line: 982, column: 24, scope: !911, inlinedAt: !874)
!911 = distinct !DILexicalBlock(scope: !912, file: !3, line: 982, column: 11)
!912 = distinct !DILexicalBlock(scope: !907, file: !3, line: 981, column: 49)
!913 = !DILocation(line: 982, column: 50, scope: !911, inlinedAt: !874)
!914 = !DILocation(line: 982, column: 32, scope: !911, inlinedAt: !874)
!915 = !DILocation(line: 982, column: 11, scope: !912, inlinedAt: !874)
!916 = !DILocation(line: 977, column: 38, scope: !904, inlinedAt: !874)
!917 = !DILocation(line: 989, column: 22, scope: !918, inlinedAt: !874)
!918 = distinct !DILexicalBlock(scope: !867, file: !3, line: 989, column: 7)
!919 = !DILocation(line: 989, column: 30, scope: !918, inlinedAt: !874)
!920 = !DILocation(line: 989, column: 7, scope: !867, inlinedAt: !874)
!921 = !DILocation(line: 991, column: 16, scope: !922, inlinedAt: !874)
!922 = distinct !DILexicalBlock(scope: !918, file: !3, line: 989, column: 54)
!923 = !DILocation(line: 991, column: 5, scope: !922, inlinedAt: !874)
!924 = !DILocation(line: 992, column: 29, scope: !922, inlinedAt: !874)
!925 = !DILocation(line: 992, column: 5, scope: !922, inlinedAt: !874)
!926 = !DILocation(line: 992, column: 38, scope: !922, inlinedAt: !874)
!927 = !DILocation(line: 994, column: 3, scope: !922, inlinedAt: !874)
!928 = !DILocation(line: 0, scope: !875)
!929 = !DILocation(line: 996, column: 1, scope: !867, inlinedAt: !874)
!930 = !DILocation(line: 1087, column: 26, scope: !875)
!931 = !DILocation(line: 1088, column: 13, scope: !875)
!932 = !DILocation(line: 1092, column: 22, scope: !933)
!933 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1090, column: 16)
!934 = !DILocation(line: 1096, column: 15, scope: !836)
!935 = !DILocation(line: 1101, column: 7, scope: !836)
!936 = !DILocation(line: 1105, column: 19, scope: !937)
!937 = distinct !DILexicalBlock(scope: !760, file: !3, line: 1105, column: 11)
!938 = !{!400, !253, i64 0}
!939 = !DILocation(line: 1105, column: 23, scope: !937)
!940 = !DILocation(line: 1105, column: 29, scope: !937)
!941 = !DILocation(line: 1105, column: 33, scope: !937)
!942 = !DILocation(line: 1105, column: 46, scope: !937)
!943 = !DILocation(line: 1105, column: 11, scope: !760)
!944 = !DILocation(line: 1108, column: 22, scope: !945)
!945 = distinct !DILexicalBlock(scope: !937, file: !3, line: 1105, column: 53)
!946 = !DILocation(line: 1109, column: 7, scope: !945)
!947 = !DILocation(line: 1115, column: 7, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 1115, column: 7)
!949 = distinct !DILexicalBlock(scope: !950, file: !3, line: 1115, column: 7)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 1115, column: 7)
!951 = distinct !DILexicalBlock(scope: !760, file: !3, line: 1115, column: 7)
!952 = !DILocation(line: 1115, column: 7, scope: !953)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 1115, column: 7)
!954 = distinct !DILexicalBlock(scope: !955, file: !3, line: 1115, column: 7)
!955 = distinct !DILexicalBlock(scope: !948, file: !3, line: 1115, column: 7)
!956 = !DILocation(line: 1118, column: 1, scope: !730)
!957 = !DILocation(line: 1009, column: 17, scope: !805, inlinedAt: !759)
!958 = distinct !{!958, !959, !960}
!959 = !DILocation(line: 1009, column: 3, scope: !801)
!960 = !DILocation(line: 1015, column: 3, scope: !801)
!961 = !DILocation(line: 977, column: 17, scope: !904, inlinedAt: !874)
!962 = distinct !{!962, !963, !964}
!963 = !DILocation(line: 977, column: 3, scope: !881)
!964 = !DILocation(line: 988, column: 3, scope: !881)
!965 = !DILocation(line: 194, column: 43, scope: !134)
!966 = !DILocation(line: 196, column: 2, scope: !134)
!967 = !DILocation(line: 196, column: 10, scope: !134)
!968 = !DILocation(line: 197, column: 2, scope: !134)
!969 = !DILocation(line: 198, column: 2, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !135, line: 198, column: 2)
!971 = distinct !DILexicalBlock(scope: !134, file: !135, line: 198, column: 2)
!972 = !DILocation(line: 199, column: 2, scope: !134)
!973 = !DILocation(line: 200, column: 1, scope: !134)
!974 = distinct !DISubprogram(name: "dns_send", scope: !3, file: !3, line: 748, type: !975, isLocal: true, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{!284, !74}
!977 = !{!978, !979, !980, !991, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1007}
!978 = !DILocalVariable(name: "idx", arg: 1, scope: !974, file: !3, line: 748, type: !74)
!979 = !DILocalVariable(name: "err", scope: !974, file: !3, line: 750, type: !284)
!980 = !DILocalVariable(name: "hdr", scope: !974, file: !3, line: 751, type: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_hdr", file: !982, line: 103, size: 96, elements: !983)
!982 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/dns.h", directory: "/root/.unikraft/apps/redis/build")
!983 = !{!984, !985, !986, !987, !988, !989, !990}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !981, file: !982, line: 104, baseType: !68, size: 16)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flags1", scope: !981, file: !982, line: 105, baseType: !74, size: 8, offset: 16)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !981, file: !982, line: 106, baseType: !74, size: 8, offset: 24)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "numquestions", scope: !981, file: !982, line: 107, baseType: !68, size: 16, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "numanswers", scope: !981, file: !982, line: 108, baseType: !68, size: 16, offset: 48)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "numauthrr", scope: !981, file: !982, line: 109, baseType: !68, size: 16, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "numextrarr", scope: !981, file: !982, line: 110, baseType: !68, size: 16, offset: 80)
!991 = !DILocalVariable(name: "qry", scope: !974, file: !3, line: 752, type: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_query", file: !3, line: 189, size: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !992, file: !3, line: 192, baseType: !68, size: 16)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "cls", scope: !992, file: !3, line: 193, baseType: !68, size: 16, offset: 16)
!996 = !DILocalVariable(name: "p", scope: !974, file: !3, line: 753, type: !188)
!997 = !DILocalVariable(name: "query_idx", scope: !974, file: !3, line: 754, type: !68)
!998 = !DILocalVariable(name: "copy_len", scope: !974, file: !3, line: 754, type: !68)
!999 = !DILocalVariable(name: "hostname", scope: !974, file: !3, line: 755, type: !138)
!1000 = !DILocalVariable(name: "hostname_part", scope: !974, file: !3, line: 755, type: !138)
!1001 = !DILocalVariable(name: "n", scope: !974, file: !3, line: 756, type: !74)
!1002 = !DILocalVariable(name: "pcb_idx", scope: !974, file: !3, line: 757, type: !74)
!1003 = !DILocalVariable(name: "entry", scope: !974, file: !3, line: 758, type: !382)
!1004 = !DILocalVariable(name: "dst", scope: !1005, file: !3, line: 780, type: !199)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 779, column: 18)
!1006 = distinct !DILexicalBlock(scope: !974, file: !3, line: 779, column: 7)
!1007 = !DILocalVariable(name: "dst_port", scope: !1005, file: !3, line: 781, type: !68)
!1008 = !DILocation(line: 748, column: 15, scope: !974)
!1009 = !DILocation(line: 751, column: 3, scope: !974)
!1010 = !DILocation(line: 752, column: 3, scope: !974)
!1011 = !DILocation(line: 758, column: 36, scope: !974)
!1012 = !DILocation(line: 762, column: 3, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 762, column: 3)
!1014 = distinct !DILexicalBlock(scope: !974, file: !3, line: 762, column: 3)
!1015 = !DILocation(line: 762, column: 3, scope: !1014)
!1016 = !DILocation(line: 762, column: 3, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 762, column: 3)
!1018 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 762, column: 3)
!1019 = !DILocation(line: 762, column: 3, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 762, column: 3)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 762, column: 3)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 762, column: 3)
!1023 = !DILocation(line: 763, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !974, file: !3, line: 763, column: 7)
!1025 = !DILocation(line: 763, column: 7, scope: !974)
!1026 = !DILocation(line: 942, column: 21, scope: !867, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 770, column: 5, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 767, column: 8)
!1029 = !DILocation(line: 942, column: 37, scope: !867, inlinedAt: !1027)
!1030 = !DILocation(line: 945, column: 8, scope: !867, inlinedAt: !1027)
!1031 = !DILocation(line: 962, column: 3, scope: !879, inlinedAt: !1027)
!1032 = !DILocation(line: 977, column: 3, scope: !881, inlinedAt: !1027)
!1033 = !DILocation(line: 963, column: 25, scope: !883, inlinedAt: !1027)
!1034 = !DILocation(line: 963, column: 9, scope: !883, inlinedAt: !1027)
!1035 = !DILocation(line: 963, column: 31, scope: !883, inlinedAt: !1027)
!1036 = !DILocation(line: 963, column: 51, scope: !883, inlinedAt: !1027)
!1037 = !DILocation(line: 963, column: 65, scope: !883, inlinedAt: !1027)
!1038 = !DILocation(line: 963, column: 9, scope: !884, inlinedAt: !1027)
!1039 = !DILocation(line: 964, column: 75, scope: !892, inlinedAt: !1027)
!1040 = !DILocation(line: 964, column: 7, scope: !892, inlinedAt: !1027)
!1041 = !DILocation(line: 966, column: 29, scope: !892, inlinedAt: !1027)
!1042 = !DILocation(line: 967, column: 5, scope: !892, inlinedAt: !1027)
!1043 = !DILocation(line: 962, column: 38, scope: !885, inlinedAt: !1027)
!1044 = !DILocation(line: 962, column: 17, scope: !885, inlinedAt: !1027)
!1045 = !DILocation(line: 978, column: 11, scope: !902, inlinedAt: !1027)
!1046 = !DILocation(line: 978, column: 9, scope: !903, inlinedAt: !1027)
!1047 = !DILocation(line: 981, column: 22, scope: !907, inlinedAt: !1027)
!1048 = !DILocation(line: 981, column: 28, scope: !907, inlinedAt: !1027)
!1049 = !DILocation(line: 981, column: 9, scope: !903, inlinedAt: !1027)
!1050 = !DILocation(line: 982, column: 24, scope: !911, inlinedAt: !1027)
!1051 = !DILocation(line: 982, column: 50, scope: !911, inlinedAt: !1027)
!1052 = !DILocation(line: 982, column: 32, scope: !911, inlinedAt: !1027)
!1053 = !DILocation(line: 982, column: 11, scope: !912, inlinedAt: !1027)
!1054 = !DILocation(line: 977, column: 38, scope: !904, inlinedAt: !1027)
!1055 = !DILocation(line: 989, column: 22, scope: !918, inlinedAt: !1027)
!1056 = !DILocation(line: 989, column: 30, scope: !918, inlinedAt: !1027)
!1057 = !DILocation(line: 989, column: 7, scope: !867, inlinedAt: !1027)
!1058 = !DILocation(line: 991, column: 16, scope: !922, inlinedAt: !1027)
!1059 = !DILocation(line: 991, column: 5, scope: !922, inlinedAt: !1027)
!1060 = !DILocation(line: 992, column: 29, scope: !922, inlinedAt: !1027)
!1061 = !DILocation(line: 992, column: 5, scope: !922, inlinedAt: !1027)
!1062 = !DILocation(line: 992, column: 38, scope: !922, inlinedAt: !1027)
!1063 = !DILocation(line: 994, column: 3, scope: !922, inlinedAt: !1027)
!1064 = !DILocation(line: 0, scope: !1028)
!1065 = !DILocation(line: 996, column: 1, scope: !867, inlinedAt: !1027)
!1066 = !DILocation(line: 772, column: 12, scope: !1028)
!1067 = !DILocation(line: 772, column: 18, scope: !1028)
!1068 = !DILocation(line: 773, column: 5, scope: !1028)
!1069 = !DILocation(line: 777, column: 66, scope: !974)
!1070 = !DILocation(line: 777, column: 59, scope: !974)
!1071 = !DILocation(line: 777, column: 34, scope: !974)
!1072 = !DILocation(line: 777, column: 7, scope: !974)
!1073 = !DILocation(line: 753, column: 16, scope: !974)
!1074 = !DILocation(line: 779, column: 9, scope: !1006)
!1075 = !DILocation(line: 779, column: 7, scope: !974)
!1076 = !DILocation(line: 783, column: 5, scope: !1005)
!1077 = !DILocation(line: 784, column: 32, scope: !1005)
!1078 = !DILocation(line: 784, column: 14, scope: !1005)
!1079 = !DILocation(line: 784, column: 9, scope: !1005)
!1080 = !DILocation(line: 784, column: 12, scope: !1005)
!1081 = !{!1082, !401, i64 0}
!1082 = !{!"dns_hdr", !401, i64 0, !250, i64 2, !250, i64 3, !401, i64 4, !401, i64 6, !401, i64 8, !401, i64 10}
!1083 = !DILocation(line: 785, column: 9, scope: !1005)
!1084 = !DILocation(line: 785, column: 16, scope: !1005)
!1085 = !{!1082, !250, i64 2}
!1086 = !DILocation(line: 786, column: 9, scope: !1005)
!1087 = !DILocation(line: 786, column: 22, scope: !1005)
!1088 = !{!1082, !401, i64 4}
!1089 = !DILocation(line: 787, column: 5, scope: !1005)
!1090 = !DILocation(line: 755, column: 15, scope: !974)
!1091 = !DILocation(line: 789, column: 5, scope: !1005)
!1092 = !DILocation(line: 754, column: 9, scope: !974)
!1093 = !DILocation(line: 793, column: 5, scope: !1005)
!1094 = !DILocation(line: 0, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 793, column: 8)
!1096 = !DILocation(line: 794, column: 7, scope: !1095)
!1097 = !DILocation(line: 755, column: 26, scope: !974)
!1098 = !DILocation(line: 756, column: 8, scope: !974)
!1099 = !DILocation(line: 796, column: 12, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 796, column: 7)
!1101 = !DILocation(line: 0, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 796, column: 67)
!1103 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 796, column: 7)
!1104 = !DILocation(line: 0, scope: !1103)
!1105 = !DILocation(line: 796, column: 19, scope: !1103)
!1106 = !DILocation(line: 796, column: 36, scope: !1103)
!1107 = !DILocation(line: 797, column: 9, scope: !1102)
!1108 = !DILocation(line: 796, column: 55, scope: !1103)
!1109 = !DILocation(line: 796, column: 7, scope: !1103)
!1110 = distinct !{!1110, !1111, !1112}
!1111 = !DILocation(line: 796, column: 7, scope: !1100)
!1112 = !DILocation(line: 798, column: 7, scope: !1100)
!1113 = !DILocation(line: 800, column: 11, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 800, column: 11)
!1115 = !DILocation(line: 800, column: 23, scope: !1114)
!1116 = !DILocation(line: 800, column: 21, scope: !1114)
!1117 = !DILocation(line: 800, column: 29, scope: !1114)
!1118 = !DILocation(line: 800, column: 11, scope: !1095)
!1119 = !DILocation(line: 799, column: 35, scope: !1095)
!1120 = !DILocation(line: 799, column: 18, scope: !1095)
!1121 = !DILocation(line: 754, column: 20, scope: !974)
!1122 = !DILocation(line: 804, column: 7, scope: !1095)
!1123 = !DILocation(line: 805, column: 66, scope: !1095)
!1124 = !DILocation(line: 805, column: 7, scope: !1095)
!1125 = !DILocation(line: 806, column: 19, scope: !1095)
!1126 = !DILocation(line: 807, column: 14, scope: !1005)
!1127 = !DILocation(line: 807, column: 24, scope: !1005)
!1128 = !DILocation(line: 807, column: 5, scope: !1095)
!1129 = distinct !{!1129, !1093, !1130}
!1130 = !DILocation(line: 807, column: 28, scope: !1005)
!1131 = !DILocation(line: 808, column: 5, scope: !1005)
!1132 = !DILocation(line: 809, column: 14, scope: !1005)
!1133 = !DILocation(line: 812, column: 9, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 812, column: 9)
!1135 = !DILocation(line: 0, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 814, column: 12)
!1137 = !{!1138, !401, i64 0}
!1138 = !{!"dns_query", !401, i64 0, !401, i64 2}
!1139 = !DILocation(line: 817, column: 9, scope: !1005)
!1140 = !DILocation(line: 817, column: 13, scope: !1005)
!1141 = !{!1138, !401, i64 2}
!1142 = !DILocation(line: 818, column: 5, scope: !1005)
!1143 = !DILocation(line: 821, column: 22, scope: !1005)
!1144 = !DILocation(line: 757, column: 8, scope: !974)
!1145 = !DILocation(line: 781, column: 11, scope: !1005)
!1146 = !DILocation(line: 848, column: 33, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 846, column: 5)
!1148 = !DILocation(line: 848, column: 14, scope: !1147)
!1149 = !DILocation(line: 780, column: 22, scope: !1005)
!1150 = !DILocation(line: 850, column: 22, scope: !1005)
!1151 = !DILocation(line: 850, column: 11, scope: !1005)
!1152 = !DILocation(line: 750, column: 9, scope: !974)
!1153 = !DILocation(line: 853, column: 5, scope: !1005)
!1154 = !DILocation(line: 860, column: 3, scope: !974)
!1155 = !DILocation(line: 861, column: 3, scope: !974)
!1156 = !DILocation(line: 862, column: 1, scope: !974)
!1157 = !DILocation(line: 977, column: 17, scope: !904, inlinedAt: !1027)
!1158 = !DILocation(line: 942, column: 21, scope: !867)
!1159 = !DILocation(line: 942, column: 37, scope: !867)
!1160 = !DILocation(line: 949, column: 12, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !867, file: !3, line: 949, column: 7)
!1162 = !DILocation(line: 949, column: 7, scope: !867)
!1163 = !DILocation(line: 951, column: 9, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 951, column: 9)
!1165 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 949, column: 21)
!1166 = !DILocation(line: 0, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 955, column: 7)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 955, column: 7)
!1169 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 954, column: 12)
!1170 = !DILocation(line: 951, column: 9, scope: !1165)
!1171 = !DILocation(line: 952, column: 7, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 952, column: 7)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 952, column: 7)
!1174 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 951, column: 30)
!1175 = !DILocation(line: 952, column: 7, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 952, column: 7)
!1177 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 952, column: 7)
!1178 = !DILocation(line: 952, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 952, column: 7)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 952, column: 7)
!1181 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 952, column: 7)
!1182 = !DILocation(line: 953, column: 34, scope: !1174)
!1183 = !DILocation(line: 954, column: 5, scope: !1174)
!1184 = !DILocation(line: 955, column: 7, scope: !1167)
!1185 = !DILocation(line: 955, column: 7, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 955, column: 7)
!1187 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 955, column: 7)
!1188 = !DILocation(line: 955, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 955, column: 7)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 955, column: 7)
!1191 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 955, column: 7)
!1192 = !DILocation(line: 956, column: 34, scope: !1169)
!1193 = !DILocation(line: 945, column: 8, scope: !867)
!1194 = !DILocation(line: 963, column: 25, scope: !883)
!1195 = !DILocation(line: 963, column: 9, scope: !883)
!1196 = !DILocation(line: 963, column: 31, scope: !883)
!1197 = !DILocation(line: 963, column: 51, scope: !883)
!1198 = !DILocation(line: 963, column: 65, scope: !883)
!1199 = !DILocation(line: 963, column: 9, scope: !884)
!1200 = !DILocation(line: 964, column: 75, scope: !892)
!1201 = !DILocation(line: 964, column: 7, scope: !892)
!1202 = !DILocation(line: 966, column: 29, scope: !892)
!1203 = !DILocation(line: 967, column: 5, scope: !892)
!1204 = !DILocation(line: 962, column: 38, scope: !885)
!1205 = !DILocation(line: 962, column: 17, scope: !885)
!1206 = !DILocation(line: 978, column: 11, scope: !902)
!1207 = !DILocation(line: 978, column: 9, scope: !903)
!1208 = !DILocation(line: 981, column: 22, scope: !907)
!1209 = !DILocation(line: 981, column: 28, scope: !907)
!1210 = !DILocation(line: 981, column: 9, scope: !903)
!1211 = !DILocation(line: 982, column: 24, scope: !911)
!1212 = !DILocation(line: 982, column: 50, scope: !911)
!1213 = !DILocation(line: 982, column: 32, scope: !911)
!1214 = !DILocation(line: 982, column: 11, scope: !912)
!1215 = !DILocation(line: 977, column: 38, scope: !904)
!1216 = !DILocation(line: 989, column: 22, scope: !918)
!1217 = !DILocation(line: 989, column: 30, scope: !918)
!1218 = !DILocation(line: 989, column: 7, scope: !867)
!1219 = !DILocation(line: 991, column: 16, scope: !922)
!1220 = !DILocation(line: 991, column: 5, scope: !922)
!1221 = !DILocation(line: 992, column: 29, scope: !922)
!1222 = !DILocation(line: 992, column: 5, scope: !922)
!1223 = !DILocation(line: 992, column: 38, scope: !922)
!1224 = !DILocation(line: 994, column: 3, scope: !922)
!1225 = !DILocation(line: 0, scope: !922)
!1226 = !DILocation(line: 996, column: 1, scope: !867)
!1227 = !DILocation(line: 977, column: 17, scope: !904)
!1228 = !DILocation(line: 65, column: 11, scope: !570)
!1229 = !DILocation(line: 62, column: 16, scope: !570)
!1230 = !DILocation(line: 66, column: 8, scope: !570)
!1231 = !DILocation(line: 63, column: 8, scope: !570)
!1232 = !DILocation(line: 67, column: 2, scope: !570)
!1233 = !DILocation(line: 69, column: 2, scope: !570)
!1234 = distinct !DISubprogram(name: "dns_recv", scope: !3, file: !3, line: 1170, type: !186, isLocal: true, isDefinition: true, scopeLine: 1171, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1252, !1253, !1254, !1255, !1261, !1273}
!1236 = !DILocalVariable(name: "arg", arg: 1, scope: !1234, file: !3, line: 1170, type: !61)
!1237 = !DILocalVariable(name: "pcb", arg: 2, scope: !1234, file: !3, line: 1170, type: !166)
!1238 = !DILocalVariable(name: "p", arg: 3, scope: !1234, file: !3, line: 1170, type: !188)
!1239 = !DILocalVariable(name: "addr", arg: 4, scope: !1234, file: !3, line: 1170, type: !199)
!1240 = !DILocalVariable(name: "port", arg: 5, scope: !1234, file: !3, line: 1170, type: !68)
!1241 = !DILocalVariable(name: "i", scope: !1234, file: !3, line: 1172, type: !74)
!1242 = !DILocalVariable(name: "txid", scope: !1234, file: !3, line: 1173, type: !68)
!1243 = !DILocalVariable(name: "res_idx", scope: !1234, file: !3, line: 1174, type: !68)
!1244 = !DILocalVariable(name: "hdr", scope: !1234, file: !3, line: 1175, type: !981)
!1245 = !DILocalVariable(name: "ans", scope: !1234, file: !3, line: 1176, type: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_answer", file: !3, line: 199, size: 96, elements: !1247)
!1247 = !{!1248, !1249, !1250, !1251}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1246, file: !3, line: 202, baseType: !68, size: 16)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "cls", scope: !1246, file: !3, line: 203, baseType: !68, size: 16, offset: 16)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !1246, file: !3, line: 204, baseType: !62, size: 32, offset: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1246, file: !3, line: 205, baseType: !68, size: 16, offset: 64)
!1252 = !DILocalVariable(name: "qry", scope: !1234, file: !3, line: 1177, type: !992)
!1253 = !DILocalVariable(name: "nquestions", scope: !1234, file: !3, line: 1178, type: !68)
!1254 = !DILocalVariable(name: "nanswers", scope: !1234, file: !3, line: 1178, type: !68)
!1255 = !DILocalVariable(name: "entry", scope: !1256, file: !3, line: 1196, type: !382)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !3, line: 1195, column: 42)
!1257 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 1195, column: 5)
!1258 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 1195, column: 5)
!1259 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 1192, column: 72)
!1260 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 1192, column: 7)
!1261 = !DILocalVariable(name: "ip4addr", scope: !1262, file: !3, line: 1291, type: !99)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 1290, column: 17)
!1263 = distinct !DILexicalBlock(scope: !1264, file: !3, line: 1288, column: 21)
!1264 = distinct !DILexicalBlock(scope: !1265, file: !3, line: 1286, column: 102)
!1265 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 1286, column: 19)
!1266 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 1284, column: 54)
!1267 = distinct !DILexicalBlock(scope: !1268, file: !3, line: 1284, column: 17)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 1268, column: 60)
!1269 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 1267, column: 16)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 1251, column: 13)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 1198, column: 34)
!1272 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 1197, column: 11)
!1273 = !DILocalVariable(name: "ip6addr", scope: !1274, file: !3, line: 1310, type: !1278)
!1274 = distinct !DILexicalBlock(scope: !1275, file: !3, line: 1309, column: 17)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 1307, column: 21)
!1276 = distinct !DILexicalBlock(scope: !1277, file: !3, line: 1305, column: 107)
!1277 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 1305, column: 19)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !1279, line: 60, baseType: !1280)
!1279 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !1279, line: 53, size: 128, elements: !1281)
!1281 = !{!1282}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !1280, file: !1279, line: 54, baseType: !94, size: 128)
!1283 = !DILocation(line: 1170, column: 16, scope: !1234)
!1284 = !DILocation(line: 1170, column: 37, scope: !1234)
!1285 = !DILocation(line: 1170, column: 55, scope: !1234)
!1286 = !DILocation(line: 1170, column: 75, scope: !1234)
!1287 = !DILocation(line: 1170, column: 87, scope: !1234)
!1288 = !DILocation(line: 1175, column: 3, scope: !1234)
!1289 = !DILocation(line: 1176, column: 3, scope: !1234)
!1290 = !DILocation(line: 1177, column: 3, scope: !1234)
!1291 = !DILocation(line: 1185, column: 10, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 1185, column: 7)
!1293 = !{!1294, !401, i64 16}
!1294 = !{!"pbuf", !422, i64 0, !422, i64 8, !401, i64 16, !401, i64 18, !250, i64 20, !250, i64 21, !250, i64 22, !250, i64 23}
!1295 = !DILocation(line: 1185, column: 18, scope: !1292)
!1296 = !DILocation(line: 1185, column: 7, scope: !1234)
!1297 = !DILocation(line: 1192, column: 7, scope: !1260)
!1298 = !DILocation(line: 1192, column: 53, scope: !1260)
!1299 = !DILocation(line: 1192, column: 7, scope: !1234)
!1300 = !DILocation(line: 1194, column: 27, scope: !1259)
!1301 = !DILocation(line: 1194, column: 12, scope: !1259)
