; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/envlock.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/envlock.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, {}*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local void @__env_lock(%struct._reent* nocapture readnone) local_unnamed_addr #0 !dbg !7 {
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !231
  ret void, !dbg !231
}

; Function Attrs: noredzone nounwind
define dso_local void @__env_unlock(%struct._reent* nocapture readnone) local_unnamed_addr #0 !dbg !232 {
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !236
  ret void, !dbg !236
}

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { nounwind readnone speculatable }

!llvm.module.flags = !{!3, !4, !5}
!llvm.ident = !{!6}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/envlock.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "__env_lock", scope: !1, file: !1, line: 46, type: !8, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: true, unit: !0, retainedNodes: !228)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !12, line: 569, size: 14912, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !16, !98, !99, !100, !101, !105, !106, !109, !110, !112, !124, !125, !126, !128, !129, !130, !192, !213, !214, !219, !226}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !11, file: !12, line: 571, baseType: !15, size: 32)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !11, file: !12, line: 576, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !12, line: 287, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !12, line: 181, size: 1408, elements: !20)
!20 = !{!21, !24, !25, !26, !28, !29, !34, !35, !37, !46, !52, !57, !61, !62, !63, !64, !68, !72, !73, !74, !76, !77, !81, !97}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !19, file: !12, line: 182, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !19, file: !12, line: 183, baseType: !15, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !19, file: !12, line: 184, baseType: !15, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !12, line: 185, baseType: !27, size: 16, offset: 128)
!27 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !19, file: !12, line: 186, baseType: !27, size: 16, offset: 144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !19, file: !12, line: 187, baseType: !30, size: 128, offset: 192)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !12, line: 117, size: 128, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !30, file: !12, line: 118, baseType: !22, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !30, file: !12, line: 119, baseType: !15, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !19, file: !12, line: 188, baseType: !15, size: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !19, file: !12, line: 195, baseType: !36, size: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !19, file: !12, line: 197, baseType: !38, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !10, !36, !44, !15}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !42, line: 145, baseType: !43)
!42 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !19, file: !12, line: 199, baseType: !47, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!41, !10, !36, !50, !15}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !19, file: !12, line: 202, baseType: !53, size: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !10, !36, !56, !15}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !42, line: 114, baseType: !43)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !19, file: !12, line: 203, baseType: !58, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!15, !10, !36}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !19, file: !12, line: 206, baseType: !30, size: 128, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !19, file: !12, line: 207, baseType: !22, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !19, file: !12, line: 208, baseType: !15, size: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !19, file: !12, line: 211, baseType: !65, size: 24, offset: 928)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 24, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !19, file: !12, line: 212, baseType: !69, size: 8, offset: 952)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !19, file: !12, line: 215, baseType: !30, size: 128, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !19, file: !12, line: 218, baseType: !15, size: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !12, line: 219, baseType: !75, size: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !42, line: 44, baseType: !43)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !19, file: !12, line: 222, baseType: !10, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !19, file: !12, line: 226, baseType: !78, size: 32, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !42, line: 175, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !80, line: 12, baseType: !15)
!80 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !19, file: !12, line: 228, baseType: !82, size: 64, offset: 1312)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !42, line: 171, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 163, size: 64, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !83, file: !42, line: 165, baseType: !15, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !83, file: !42, line: 170, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !42, line: 166, size: 32, elements: !88)
!88 = !{!89, !93}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !87, file: !42, line: 168, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !91, line: 124, baseType: !92)
!91 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!92 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !87, file: !42, line: 169, baseType: !94, size: 32)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 4)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !19, file: !12, line: 229, baseType: !15, size: 32, offset: 1376)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !11, file: !12, line: 576, baseType: !17, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !11, file: !12, line: 576, baseType: !17, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !11, file: !12, line: 578, baseType: !15, size: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !11, file: !12, line: 579, baseType: !102, size: 200, offset: 288)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 200, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 25)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !11, file: !12, line: 582, baseType: !15, size: 32, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !11, file: !12, line: 583, baseType: !107, size: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !12, line: 40, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !11, file: !12, line: 585, baseType: !15, size: 32, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !11, file: !12, line: 587, baseType: !111, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !11, file: !12, line: 590, baseType: !113, size: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !12, line: 47, size: 256, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !114, file: !12, line: 49, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !114, file: !12, line: 50, baseType: !15, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !114, file: !12, line: 50, baseType: !15, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !114, file: !12, line: 50, baseType: !15, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !114, file: !12, line: 50, baseType: !15, size: 32, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !114, file: !12, line: 51, baseType: !122, size: 32, offset: 192)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 32, elements: !70)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !12, line: 25, baseType: !92)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !11, file: !12, line: 591, baseType: !15, size: 32, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !11, file: !12, line: 592, baseType: !113, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !11, file: !12, line: 593, baseType: !127, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !11, file: !12, line: 596, baseType: !15, size: 32, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !11, file: !12, line: 597, baseType: !44, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !11, file: !12, line: 632, baseType: !131, size: 2880, offset: 1152)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !11, file: !12, line: 599, size: 2880, elements: !132)
!132 = !{!133, !183}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !131, file: !12, line: 622, baseType: !134, size: 1728)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !12, line: 601, size: 1728, elements: !135)
!135 = !{!136, !137, !138, !142, !154, !155, !157, !165, !166, !167, !168, !172, !176, !177, !178, !179, !180, !181, !182}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !134, file: !12, line: 603, baseType: !92, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !134, file: !12, line: 604, baseType: !44, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !134, file: !12, line: 605, baseType: !139, size: 208, offset: 128)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 208, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 26)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !134, file: !12, line: 606, baseType: !143, size: 288, offset: 352)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !12, line: 55, size: 288, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !143, file: !12, line: 57, baseType: !15, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !143, file: !12, line: 58, baseType: !15, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !143, file: !12, line: 59, baseType: !15, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !143, file: !12, line: 60, baseType: !15, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !143, file: !12, line: 61, baseType: !15, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !143, file: !12, line: 62, baseType: !15, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !143, file: !12, line: 63, baseType: !15, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !143, file: !12, line: 64, baseType: !15, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !143, file: !12, line: 65, baseType: !15, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !134, file: !12, line: 607, baseType: !15, size: 32, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !134, file: !12, line: 608, baseType: !156, size: 64, offset: 704)
!156 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !134, file: !12, line: 609, baseType: !158, size: 112, offset: 768)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !12, line: 319, size: 112, elements: !159)
!159 = !{!160, !163, !164}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !158, file: !12, line: 320, baseType: !161, size: 48)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 48, elements: !66)
!162 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !158, file: !12, line: 321, baseType: !161, size: 48, offset: 48)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !158, file: !12, line: 322, baseType: !162, size: 16, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !134, file: !12, line: 610, baseType: !82, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !134, file: !12, line: 611, baseType: !82, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !134, file: !12, line: 612, baseType: !82, size: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !134, file: !12, line: 613, baseType: !169, size: 64, offset: 1088)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !134, file: !12, line: 614, baseType: !173, size: 192, offset: 1152)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 192, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 24)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !134, file: !12, line: 615, baseType: !15, size: 32, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !134, file: !12, line: 616, baseType: !82, size: 64, offset: 1376)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !134, file: !12, line: 617, baseType: !82, size: 64, offset: 1440)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !134, file: !12, line: 618, baseType: !82, size: 64, offset: 1504)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !134, file: !12, line: 619, baseType: !82, size: 64, offset: 1568)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !134, file: !12, line: 620, baseType: !82, size: 64, offset: 1632)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !134, file: !12, line: 621, baseType: !15, size: 32, offset: 1696)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !131, file: !12, line: 631, baseType: !184, size: 2880)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !12, line: 626, size: 2880, elements: !185)
!185 = !{!186, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !184, file: !12, line: 629, baseType: !187, size: 1920)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1920, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 30)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !184, file: !12, line: 630, baseType: !191, size: 960, offset: 1920)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 960, elements: !188)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !11, file: !12, line: 636, baseType: !193, size: 64, offset: 4032)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !12, line: 93, size: 6336, elements: !195)
!195 = !{!196, !197, !198, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !194, file: !12, line: 94, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !194, file: !12, line: 95, baseType: !15, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !194, file: !12, line: 97, baseType: !199, size: 2048, offset: 128)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 2048, elements: !203)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !{!204}
!204 = !DISubrange(count: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !194, file: !12, line: 98, baseType: !206, size: 4160, offset: 2176)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !12, line: 74, size: 4160, elements: !207)
!207 = !{!208, !210, !211, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !206, file: !12, line: 75, baseType: !209, size: 2048)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !203)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !206, file: !12, line: 76, baseType: !209, size: 2048, offset: 2048)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !206, file: !12, line: 78, baseType: !123, size: 32, offset: 4096)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !206, file: !12, line: 81, baseType: !123, size: 32, offset: 4128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !11, file: !12, line: 637, baseType: !194, size: 6336, offset: 4096)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !11, file: !12, line: 641, baseType: !215, size: 64, offset: 10432)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !15}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !11, file: !12, line: 646, baseType: !220, size: 192, offset: 10496)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !12, line: 291, size: 192, elements: !221)
!221 = !{!222, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !220, file: !12, line: 293, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !220, file: !12, line: 294, baseType: !15, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !220, file: !12, line: 295, baseType: !17, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !11, file: !12, line: 648, baseType: !227, size: 4224, offset: 10688)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 4224, elements: !66)
!228 = !{!229}
!229 = !DILocalVariable(name: "ptr", arg: 1, scope: !7, file: !1, line: 47, type: !10)
!230 = !DILocation(line: 47, column: 21, scope: !7)
!231 = !DILocation(line: 52, column: 1, scope: !7)
!232 = distinct !DISubprogram(name: "__env_unlock", scope: !1, file: !1, line: 55, type: !8, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: true, unit: !0, retainedNodes: !233)
!233 = !{!234}
!234 = !DILocalVariable(name: "ptr", arg: 1, scope: !232, file: !1, line: 56, type: !10)
!235 = !DILocation(line: 56, column: 21, scope: !232)
!236 = !DILocation(line: 61, column: 1, scope: !232)
