; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/etharp.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/etharp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.etharp_entry = type { %struct.pbuf*, %struct.ip4_addr, %struct.netif*, %struct.eth_addr, i16, i8 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip4_addr = type { i32 }
%struct.netif = type { %struct.netif*, %struct.ip_addr, %struct.ip_addr, %struct.ip_addr, [3 x %struct.ip_addr], [3 x i8], [3 x i32], [3 x i32], i8 (%struct.pbuf*, %struct.netif*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip4_addr*)*, i8 (%struct.netif*, %struct.pbuf*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip6_addr*)*, void (%struct.netif*)*, void (%struct.netif*)*, i8*, [1 x i8*], i16, i16, i16, [6 x i8], i8, i8, [2 x i8], i8, i8, i8, i8 (%struct.netif*, %struct.ip6_addr*, i32)* }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.eth_addr = type { [6 x i8] }
%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }

!39 = !DIEnumerator(name: "ERR_ARG", value: -16)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !41, line: 68, baseType: !6, size: 32, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_iana_hwtype", file: !48, line: 52, baseType: !6, size: 32, elements: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/iana.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !{!50}
!50 = !DIEnumerator(name: "LWIP_IANA_HWTYPE_ETHERNET", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ieee_eth_type", file: !52, line: 52, baseType: !6, size: 32, elements: !53)
!52 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ieee.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!54 = !DIEnumerator(name: "ETHTYPE_IP", value: 2048, isUnsigned: true)
!55 = !DIEnumerator(name: "ETHTYPE_ARP", value: 2054, isUnsigned: true)
!56 = !DIEnumerator(name: "ETHTYPE_WOL", value: 2114, isUnsigned: true)
!57 = !DIEnumerator(name: "ETHTYPE_RARP", value: 32821, isUnsigned: true)
!58 = !DIEnumerator(name: "ETHTYPE_VLAN", value: 33024, isUnsigned: true)
!59 = !DIEnumerator(name: "ETHTYPE_IPV6", value: 34525, isUnsigned: true)
!60 = !DIEnumerator(name: "ETHTYPE_PPPOEDISC", value: 34915, isUnsigned: true)
!61 = !DIEnumerator(name: "ETHTYPE_PPPOE", value: 34916, isUnsigned: true)
!62 = !DIEnumerator(name: "ETHTYPE_JUMBO", value: 34928, isUnsigned: true)
!63 = !DIEnumerator(name: "ETHTYPE_PROFINET", value: 34962, isUnsigned: true)
!64 = !DIEnumerator(name: "ETHTYPE_ETHERCAT", value: 34980, isUnsigned: true)
!65 = !DIEnumerator(name: "ETHTYPE_LLDP", value: 35020, isUnsigned: true)
!66 = !DIEnumerator(name: "ETHTYPE_SERCOS", value: 35021, isUnsigned: true)
!67 = !DIEnumerator(name: "ETHTYPE_MRP", value: 35043, isUnsigned: true)
!68 = !DIEnumerator(name: "ETHTYPE_PTP", value: 35063, isUnsigned: true)
!69 = !DIEnumerator(name: "ETHTYPE_QINQ", value: 37120, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "etharp_opcode", file: !71, line: 105, baseType: !6, size: 32, elements: !72)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/etharp.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "ARP_REQUEST", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "ARP_REPLY", value: 2, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 89, baseType: !6, size: 32, elements: !77)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!79 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!80 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!81 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 145, baseType: !6, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!86 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!88 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!89 = !{!90, !91, !99, !103, !132, !139, !109, !142, !143, !145, !147, !152, !153}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !20, line: 96, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !93, line: 126, baseType: !94)
!93 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !95, line: 20, baseType: !96)
!95 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !97, line: 41, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!98 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "etharp_hdr", file: !71, line: 86, size: 224, elements: !101)
!101 = !{!102, !107, !108, !113, !114, !115, !123, !130, !131}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hwtype", scope: !100, file: !71, line: 87, baseType: !103, size: 16)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !93, line: 127, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !95, line: 36, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !97, line: 57, baseType: !106)
!106 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !100, file: !71, line: 88, baseType: !103, size: 16, offset: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hwlen", scope: !100, file: !71, line: 89, baseType: !109, size: 8, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !93, line: 125, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !95, line: 24, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !97, line: 43, baseType: !112)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "protolen", scope: !100, file: !71, line: 90, baseType: !109, size: 8, offset: 40)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !100, file: !71, line: 91, baseType: !103, size: 16, offset: 48)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "shwaddr", scope: !100, file: !71, line: 92, baseType: !116, size: 48, offset: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eth_addr", file: !117, line: 60, size: 48, elements: !118)
!117 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ethernet.h", directory: "/root/.unikraft/apps/redis/build")
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !116, file: !117, line: 61, baseType: !120, size: 48)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sipaddr", scope: !100, file: !71, line: 93, baseType: !124, size: 32, offset: 112)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr_wordaligned", file: !71, line: 59, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "addrw", scope: !124, file: !71, line: 60, baseType: !127, size: 32)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 32, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 2)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dhwaddr", scope: !100, file: !71, line: 94, baseType: !116, size: 48, offset: 144)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dipaddr", scope: !100, file: !71, line: 95, baseType: !124, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !135, line: 57, baseType: !136)
!135 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !135, line: 51, size: 32, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !136, file: !135, line: 52, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !93, line: 129, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !95, line: 48, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !97, line: 79, baseType: !6)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 40, baseType: !149)
!148 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !150, line: 129, baseType: !151)
!150 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_addr_idx_t", file: !15, line: 244, baseType: !109)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !93, line: 128, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !95, line: 32, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !97, line: 55, baseType: !156)
!156 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!157 = !{!0, !158, !160, !187}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "etharp_cached_entry", scope: !2, file: !3, line: 108, type: !152, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "__str", scope: !162, file: !163, line: 198, type: !184, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "uk_pr_crit", scope: !163, file: !163, line: 194, type: !164, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !169)
!163 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166, null}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!169 = !{!170, !171}
!170 = !DILocalVariable(name: "fmt", arg: 1, scope: !162, file: !163, line: 194, type: !166)
!171 = !DILocalVariable(name: "argp", scope: !162, file: !163, line: 196, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !173, line: 32, baseType: !174)
!173 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 192, elements: !182)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !176, file: !3, line: 196, baseType: !6, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !176, file: !3, line: 196, baseType: !6, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !176, file: !3, line: 196, baseType: !90, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !176, file: !3, line: 196, baseType: !90, size: 64, offset: 128)
!182 = !{!183}
!183 = !DISubrange(count: 1)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 8)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "__str", scope: !162, file: !163, line: 198, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 72, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 9)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 3200, elements: !294)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "etharp_entry", file: !3, line: 90, size: 320, elements: !194)
!194 = !{!195, !207, !208, !291, !292, !293}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !193, file: !3, line: 96, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !76, line: 186, size: 192, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !76, line: 188, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !197, file: !76, line: 191, baseType: !90, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !197, file: !76, line: 200, baseType: !103, size: 16, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !197, file: !76, line: 203, baseType: !103, size: 16, offset: 144)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !197, file: !76, line: 208, baseType: !109, size: 8, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !76, line: 211, baseType: !109, size: 8, offset: 168)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !197, file: !76, line: 218, baseType: !109, size: 8, offset: 176)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !197, file: !76, line: 221, baseType: !109, size: 8, offset: 184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !193, file: !3, line: 98, baseType: !134, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "netif", scope: !193, file: !3, line: 99, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !15, line: 260, size: 2240, elements: !211)
!211 = !{!212, !213, !233, !234, !235, !239, !241, !243, !244, !249, !254, !259, !266, !271, !272, !273, !275, !276, !277, !278, !279, !280, !281, !283, !284, !285, !286}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !15, line: 263, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !210, file: !15, line: 268, baseType: !214, size: 192, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !215, line: 76, baseType: !216)
!215 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !215, line: 69, size: 192, elements: !217)
!217 = !{!218, !232}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !216, file: !215, line: 73, baseType: !219, size: 160)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !216, file: !215, line: 70, size: 160, elements: !220)
!220 = !{!221, !231}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !219, file: !215, line: 71, baseType: !222, size: 160)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !223, line: 67, baseType: !224)
!223 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !223, line: 59, size: 160, elements: !225)
!225 = !{!226, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !224, file: !223, line: 60, baseType: !227, size: 128)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 128, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 4)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !224, file: !223, line: 62, baseType: !109, size: 8, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !219, file: !215, line: 72, baseType: !134, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !215, line: 75, baseType: !109, size: 8, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !210, file: !15, line: 269, baseType: !214, size: 192, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !210, file: !15, line: 270, baseType: !214, size: 192, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !210, file: !15, line: 274, baseType: !236, size: 576, offset: 640)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 576, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !210, file: !15, line: 277, baseType: !240, size: 24, offset: 1216)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 24, elements: !237)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !210, file: !15, line: 282, baseType: !242, size: 96, offset: 1248)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 96, elements: !237)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !210, file: !15, line: 283, baseType: !242, size: 96, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !210, file: !15, line: 288, baseType: !245, size: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !15, line: 178, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!91, !196, !209}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !210, file: !15, line: 294, baseType: !250, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !15, line: 189, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!91, !209, !196, !132}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !210, file: !15, line: 299, baseType: !255, size: 64, offset: 1600)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !15, line: 212, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!91, !209, !196}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !210, file: !15, line: 305, baseType: !260, size: 64, offset: 1664)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !15, line: 202, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!91, !209, !196, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !210, file: !15, line: 310, baseType: !267, size: 64, offset: 1728)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !15, line: 214, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !209}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !210, file: !15, line: 319, baseType: !267, size: 64, offset: 1792)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !210, file: !15, line: 323, baseType: !90, size: 64, offset: 1856)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !210, file: !15, line: 325, baseType: !274, size: 64, offset: 1920)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !182)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !210, file: !15, line: 332, baseType: !103, size: 16, offset: 1984)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !210, file: !15, line: 335, baseType: !103, size: 16, offset: 2000)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !210, file: !15, line: 338, baseType: !103, size: 16, offset: 2016)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !210, file: !15, line: 341, baseType: !120, size: 48, offset: 2032)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !210, file: !15, line: 343, baseType: !109, size: 8, offset: 2080)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !210, file: !15, line: 345, baseType: !109, size: 8, offset: 2088)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !15, line: 347, baseType: !282, size: 16, offset: 2096)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 16, elements: !128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !210, file: !15, line: 350, baseType: !109, size: 8, offset: 2112)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !210, file: !15, line: 353, baseType: !109, size: 8, offset: 2120)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !210, file: !15, line: 357, baseType: !109, size: 8, offset: 2128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !210, file: !15, line: 377, baseType: !287, size: 64, offset: 2176)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !15, line: 222, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!91, !209, !264, !14}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ethaddr", scope: !193, file: !3, line: 100, baseType: !116, size: 48, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !193, file: !3, line: 101, baseType: !103, size: 16, offset: 240)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !193, file: !3, line: 102, baseType: !109, size: 8, offset: 256)
!294 = !{!295}
!295 = !DISubrange(count: 10)
!296 = !{i32 2, !"Dwarf Version", i32 4}
!297 = !{i32 2, !"Debug Info Version", i32 3}
!298 = !{i32 1, !"wchar_size", i32 4}
!299 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!300 = distinct !DISubprogram(name: "etharp_tmr", scope: !3, file: !3, line: 197, type: !301, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{null}
!303 = !{!304, !305}
!304 = !DILocalVariable(name: "i", scope: !300, file: !3, line: 199, type: !21)
!305 = !DILocalVariable(name: "state", scope: !306, file: !3, line: 204, type: !109)
!306 = distinct !DILexicalBlock(scope: !307, file: !3, line: 203, column: 40)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 203, column: 3)
!308 = distinct !DILexicalBlock(scope: !300, file: !3, line: 203, column: 3)
!309 = !DILocation(line: 199, column: 7, scope: !300)
!310 = !DILocation(line: 203, column: 3, scope: !308)
!311 = !DILocation(line: 204, column: 31, scope: !306)
!312 = !{!313, !315, i64 32}
!313 = !{!"etharp_entry", !314, i64 0, !317, i64 8, !314, i64 16, !319, i64 24, !320, i64 30, !315, i64 32}
!314 = !{!"any pointer", !315, i64 0}
!315 = !{!"omnipotent char", !316, i64 0}
!316 = !{!"Simple C/C++ TBAA"}
!317 = !{!"ip4_addr", !318, i64 0}
!318 = !{!"int", !315, i64 0}
!319 = !{!"eth_addr", !315, i64 0}
!320 = !{!"short", !315, i64 0}
!321 = !DILocation(line: 204, column: 10, scope: !306)
!322 = !DILocation(line: 207, column: 9, scope: !323)
!323 = distinct !DILexicalBlock(scope: !306, file: !3, line: 205, column: 9)
!324 = !DILocation(line: 210, column: 20, scope: !325)
!325 = distinct !DILexicalBlock(scope: !323, file: !3, line: 209, column: 10)
!326 = !DILocation(line: 210, column: 25, scope: !325)
!327 = !{!313, !320, i64 30}
!328 = !DILocation(line: 211, column: 31, scope: !329)
!329 = distinct !DILexicalBlock(scope: !325, file: !3, line: 211, column: 11)
!330 = !DILocation(line: 211, column: 46, scope: !329)
!331 = !DILocation(line: 212, column: 32, scope: !329)
!332 = !DILocation(line: 213, column: 32, scope: !329)
!333 = !DILocation(line: 212, column: 58, scope: !329)
!334 = !DILocalVariable(name: "i", arg: 1, scope: !335, file: !3, line: 168, type: !21)
!335 = distinct !DISubprogram(name: "etharp_free_entry", scope: !3, file: !3, line: 168, type: !336, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !21}
!338 = !{!334}
!339 = !DILocation(line: 168, column: 23, scope: !335, inlinedAt: !340)
!340 = distinct !DILocation(line: 218, column: 9, scope: !341)
!341 = distinct !DILexicalBlock(scope: !329, file: !3, line: 213, column: 53)
!342 = !DILocation(line: 173, column: 20, scope: !343, inlinedAt: !340)
!343 = distinct !DILexicalBlock(scope: !335, file: !3, line: 173, column: 7)
!344 = !{!313, !314, i64 0}
!345 = !DILocation(line: 173, column: 22, scope: !343, inlinedAt: !340)
!346 = !DILocation(line: 173, column: 7, scope: !335, inlinedAt: !340)
!347 = !DILocation(line: 176, column: 5, scope: !348, inlinedAt: !340)
!348 = distinct !DILexicalBlock(scope: !343, file: !3, line: 173, column: 31)
!349 = !DILocation(line: 177, column: 20, scope: !348, inlinedAt: !340)
!350 = !DILocation(line: 178, column: 3, scope: !348, inlinedAt: !340)
!351 = !DILocation(line: 180, column: 22, scope: !335, inlinedAt: !340)
!352 = !DILocation(line: 188, column: 1, scope: !335, inlinedAt: !340)
!353 = !DILocation(line: 219, column: 7, scope: !341)
!354 = !DILocation(line: 219, column: 18, scope: !329)
!355 = !DILocation(line: 221, column: 28, scope: !356)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 219, column: 76)
