; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EvictionPoolLRU", scope: !2, file: !3, line: 61, type: !196, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !59)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !9, !10, !11, !28, !38, !48, !58}
!6 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !13, line: 51, size: 24, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !21, !22, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !13, line: 52, baseType: !16, size: 8)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 43, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !12, file: !13, line: 53, baseType: !16, size: 8, offset: 8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !13, line: 54, baseType: !20, size: 8, offset: 16)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !12, file: !13, line: 55, baseType: !24, offset: 24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: -1)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !13, line: 57, size: 40, elements: !30)
!30 = !{!31, !35, !36, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !29, file: !13, line: 58, baseType: !32, size: 16)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 36, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 57, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !29, file: !13, line: 59, baseType: !32, size: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !13, line: 60, baseType: !20, size: 8, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !29, file: !13, line: 61, baseType: !24, offset: 40)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !13, line: 63, size: 72, elements: !40)
!40 = !{!41, !45, !46, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !13, line: 64, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 48, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 79, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !39, file: !13, line: 65, baseType: !42, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !39, file: !13, line: 66, baseType: !20, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !13, line: 67, baseType: !24, offset: 72)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !13, line: 69, size: 136, elements: !50)
!50 = !{!51, !55, !56, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !13, line: 70, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 60, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 105, baseType: !54)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !49, file: !13, line: 71, baseType: !52, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !13, line: 72, baseType: !20, size: 8, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !49, file: !13, line: 73, baseType: !24, offset: 136)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!59 = !{!60, !0}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "next_db", scope: !62, file: !3, line: 471, type: !44, isLocal: true, isDefinition: true)
!62 = distinct !DISubprogram(name: "freeMemoryIfNeeded", scope: !3, file: !3, line: 446, type: !63, isLocal: false, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !66)
!63 = !DISubroutineType(types: !64)
!64 = !{!65}
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !{!67, !72, !73, !74, !77, !78, !79, !80, !82, !83, !84, !85, !88, !89, !191, !192, !193, !204, !206, !207}
!67 = !DILocalVariable(name: "mem_reported", scope: !62, file: !3, line: 451, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 40, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !71, line: 129, baseType: !54)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DILocalVariable(name: "mem_tofree", scope: !62, file: !3, line: 451, type: !68)
!73 = !DILocalVariable(name: "mem_freed", scope: !62, file: !3, line: 451, type: !68)
!74 = !DILocalVariable(name: "latency", scope: !62, file: !3, line: 452, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !76, line: 52, baseType: !10)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DILocalVariable(name: "eviction_latency", scope: !62, file: !3, line: 452, type: !75)
!78 = !DILocalVariable(name: "delta", scope: !62, file: !3, line: 453, type: !10)
!79 = !DILocalVariable(name: "slaves", scope: !62, file: !3, line: 454, type: !65)
!80 = !DILocalVariable(name: "j", scope: !81, file: !3, line: 470, type: !65)
!81 = distinct !DILexicalBlock(scope: !62, file: !3, line: 469, column: 36)
!82 = !DILocalVariable(name: "k", scope: !81, file: !3, line: 470, type: !65)
!83 = !DILocalVariable(name: "i", scope: !81, file: !3, line: 470, type: !65)
!84 = !DILocalVariable(name: "keys_freed", scope: !81, file: !3, line: 470, type: !65)
!85 = !DILocalVariable(name: "bestkey", scope: !81, file: !3, line: 472, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !13, line: 43, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!88 = !DILocalVariable(name: "bestdbid", scope: !81, file: !3, line: 473, type: !65)
!89 = !DILocalVariable(name: "db", scope: !81, file: !3, line: 474, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !76, line: 656, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !76, line: 647, size: 512, elements: !93)
!93 = !{!94, !156, !157, !158, !159, !160, !161, !162}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !92, file: !76, line: 648, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !97, line: 82, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !97, line: 76, size: 768, elements: !99)
!99 = !{!100, !125, !126, !154, !155}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !97, line: 77, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !97, line: 65, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !97, line: 58, size: 384, elements: !104)
!104 = !{!105, !111, !115, !116, !120, !124}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !103, file: !97, line: 59, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!52, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !103, file: !97, line: 60, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!7, !7, !109}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !103, file: !97, line: 61, baseType: !112, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !103, file: !97, line: 62, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!65, !7, !109, !109}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !103, file: !97, line: 63, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !7, !7}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !103, file: !97, line: 64, baseType: !121, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !98, file: !97, line: 78, baseType: !7, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !98, file: !97, line: 79, baseType: !127, size: 512, offset: 128)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !152)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !97, line: 74, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !97, line: 69, size: 256, elements: !130)
!130 = !{!131, !149, !150, !151}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !129, file: !97, line: 70, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !97, line: 56, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !97, line: 47, size: 192, elements: !136)
!136 = !{!137, !138, !147}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !135, file: !97, line: 48, baseType: !7, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !135, file: !97, line: 54, baseType: !139, size: 64, offset: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !97, line: 49, size: 64, elements: !140)
!140 = !{!141, !142, !143, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !139, file: !97, line: 50, baseType: !7, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !139, file: !97, line: 51, baseType: !52, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !139, file: !97, line: 52, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !17, line: 56, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !19, line: 103, baseType: !6)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !139, file: !97, line: 53, baseType: !8, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !97, line: 55, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !97, line: 71, baseType: !54, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !129, file: !97, line: 72, baseType: !54, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !129, file: !97, line: 73, baseType: !54, size: 64, offset: 192)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !98, file: !97, line: 80, baseType: !6, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !98, file: !97, line: 81, baseType: !54, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !92, file: !76, line: 649, baseType: !95, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !92, file: !76, line: 650, baseType: !95, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !92, file: !76, line: 651, baseType: !95, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !92, file: !76, line: 652, baseType: !95, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !76, line: 653, baseType: !65, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !92, file: !76, line: 654, baseType: !10, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !92, file: !76, line: 655, baseType: !163, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !165, line: 54, baseType: !166)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !165, line: 47, size: 384, elements: !167)
!167 = !{!168, !177, !178, !182, !186, !190}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !166, file: !165, line: 48, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !165, line: 40, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !165, line: 36, size: 192, elements: !172)
!172 = !{!173, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !165, line: 37, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !165, line: 38, baseType: !174, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !165, line: 39, baseType: !7, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !166, file: !165, line: 49, baseType: !169, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !166, file: !165, line: 50, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!7, !7}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !166, file: !165, line: 51, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !7}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !166, file: !165, line: 52, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!65, !7, !7}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !165, line: 53, baseType: !54, size: 64, offset: 320)
!191 = !DILocalVariable(name: "dict", scope: !81, file: !3, line: 475, type: !95)
!192 = !DILocalVariable(name: "de", scope: !81, file: !3, line: 476, type: !133)
!193 = !DILocalVariable(name: "pool", scope: !194, file: !3, line: 481, type: !196)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 480, column: 9)
!195 = distinct !DILexicalBlock(scope: !81, file: !3, line: 478, column: 13)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evictionPoolEntry", file: !3, line: 54, size: 256, elements: !198)
!198 = !{!199, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !197, file: !3, line: 55, baseType: !200, size: 64)
!200 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !3, line: 56, baseType: !86, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !197, file: !3, line: 57, baseType: !86, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dbid", scope: !197, file: !3, line: 58, baseType: !65, size: 32, offset: 192)
!204 = !DILocalVariable(name: "total_keys", scope: !205, file: !3, line: 484, type: !54)
!205 = distinct !DILexicalBlock(scope: !194, file: !3, line: 483, column: 36)
!206 = !DILocalVariable(name: "keys", scope: !205, file: !3, line: 484, type: !54)
!207 = !DILocalVariable(name: "keyobj", scope: !208, file: !3, line: 555, type: !210)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 553, column: 22)
!209 = distinct !DILexicalBlock(scope: !81, file: !3, line: 553, column: 13)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !76, line: 622, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !76, line: 614, size: 128, elements: !213)
!213 = !{!214, !215, !216, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !76, line: 615, baseType: !44, size: 4, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !212, file: !76, line: 616, baseType: !44, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !212, file: !76, line: 617, baseType: !44, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !212, file: !76, line: 620, baseType: !65, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !212, file: !76, line: 621, baseType: !7, size: 64, offset: 64)
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!223 = distinct !DISubprogram(name: "getLRUClock", scope: !3, file: !3, line: 70, type: !224, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{!44}
!226 = !DILocation(line: 71, column: 13, scope: !223)
!227 = !DILocation(line: 71, column: 21, scope: !223)
!228 = !DILocation(line: 71, column: 12, scope: !223)
!229 = !DILocation(line: 71, column: 5, scope: !223)
!230 = distinct !DISubprogram(name: "LRU_CLOCK", scope: !3, file: !3, line: 78, type: !224, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !231)
!231 = !{!232}
!232 = !DILocalVariable(name: "lruclock", scope: !230, file: !3, line: 79, type: !44)
!233 = !DILocation(line: 81, column: 9, scope: !234)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 81, column: 9)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 80, column: 49)
!236 = distinct !DILexicalBlock(scope: !230, file: !3, line: 80, column: 9)
!237 = !DILocation(line: 79, column: 18, scope: !230)
!238 = !DILocation(line: 85, column: 5, scope: !230)
!239 = distinct !DISubprogram(name: "estimateObjectIdleTime", scope: !3, file: !3, line: 90, type: !240, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{!200, !210}
!242 = !{!243, !244}
!243 = !DILocalVariable(name: "o", arg: 1, scope: !239, file: !3, line: 90, type: !210)
!244 = !DILocalVariable(name: "lruclock", scope: !239, file: !3, line: 91, type: !200)
!245 = !DILocation(line: 90, column: 49, scope: !239)
!246 = !DILocation(line: 81, column: 9, scope: !234, inlinedAt: !247)
!247 = distinct !DILocation(line: 91, column: 35, scope: !239)
!248 = !DILocation(line: 79, column: 18, scope: !230, inlinedAt: !247)
!249 = !DILocation(line: 85, column: 5, scope: !230, inlinedAt: !247)
!250 = !DILocation(line: 91, column: 35, scope: !239)
!251 = !DILocation(line: 91, column: 24, scope: !239)
!252 = !DILocation(line: 92, column: 24, scope: !253)
!253 = distinct !DILexicalBlock(scope: !239, file: !3, line: 92, column: 9)
!254 = !DILocation(line: 92, column: 18, scope: !253)
!255 = !DILocation(line: 92, column: 21, scope: !253)
!256 = !DILocation(line: 95, column: 43, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !3, line: 94, column: 12)
!258 = !DILocation(line: 95, column: 28, scope: !257)
!259 = !DILocation(line: 92, column: 9, scope: !239)
!260 = !DILocation(line: 0, scope: !257)
!261 = !DILocation(line: 98, column: 1, scope: !239)
!262 = distinct !DISubprogram(name: "evictionPoolAlloc", scope: !3, file: !3, line: 139, type: !263, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{null}
!265 = !{!266, !267}
!266 = !DILocalVariable(name: "ep", scope: !262, file: !3, line: 140, type: !196)
!267 = !DILocalVariable(name: "j", scope: !262, file: !3, line: 141, type: !65)
!268 = !DILocation(line: 143, column: 10, scope: !262)
!269 = !DILocation(line: 140, column: 31, scope: !262)
!270 = !DILocation(line: 141, column: 9, scope: !262)
!271 = !DILocation(line: 144, column: 5, scope: !272)
!272 = distinct !DILexicalBlock(scope: !262, file: !3, line: 144, column: 5)
!273 = !DILocation(line: 145, column: 15, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 144, column: 39)
!275 = distinct !DILexicalBlock(scope: !272, file: !3, line: 144, column: 5)
!276 = !DILocation(line: 145, column: 20, scope: !274)
!277 = !{!278, !279, i64 0}
!278 = !{!"evictionPoolEntry", !279, i64 0, !282, i64 8, !282, i64 16, !283, i64 24}
!279 = !{!"long long", !280, i64 0}
!280 = !{!"omnipotent char", !281, i64 0}
!281 = !{!"Simple C/C++ TBAA"}
!282 = !{!"any pointer", !280, i64 0}
!283 = !{!"int", !280, i64 0}
!284 = !DILocation(line: 146, column: 15, scope: !274)
!285 = !DILocation(line: 146, column: 19, scope: !274)
!286 = !{!278, !282, i64 8}
!287 = !DILocation(line: 147, column: 24, scope: !274)
!288 = !DILocation(line: 147, column: 15, scope: !274)
!289 = !DILocation(line: 147, column: 22, scope: !274)
!290 = !{!278, !282, i64 16}
!291 = !DILocation(line: 148, column: 15, scope: !274)
!292 = !DILocation(line: 148, column: 20, scope: !274)
!293 = !{!278, !283, i64 24}
!294 = !DILocation(line: 144, column: 35, scope: !275)
!295 = !DILocation(line: 144, column: 19, scope: !275)
!296 = distinct !{!296, !271, !297}
!297 = !DILocation(line: 149, column: 5, scope: !272)
!298 = !DILocation(line: 150, column: 21, scope: !262)
!299 = !{!282, !282, i64 0}
!300 = !DILocation(line: 151, column: 1, scope: !262)
!301 = distinct !DISubprogram(name: "evictionPoolPopulate", scope: !3, file: !3, line: 162, type: !302, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !65, !95, !95, !196}
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !317, !321, !322, !323, !324, !330, !332}
!305 = !DILocalVariable(name: "dbid", arg: 1, scope: !301, file: !3, line: 162, type: !65)
!306 = !DILocalVariable(name: "sampledict", arg: 2, scope: !301, file: !3, line: 162, type: !95)
!307 = !DILocalVariable(name: "keydict", arg: 3, scope: !301, file: !3, line: 162, type: !95)
!308 = !DILocalVariable(name: "pool", arg: 4, scope: !301, file: !3, line: 162, type: !196)
!309 = !DILocalVariable(name: "j", scope: !301, file: !3, line: 163, type: !65)
!310 = !DILocalVariable(name: "k", scope: !301, file: !3, line: 163, type: !65)
!311 = !DILocalVariable(name: "count", scope: !301, file: !3, line: 163, type: !65)
!312 = !DILocalVariable(scope: !301, type: !54, flags: DIFlagArtificial)
!313 = !DILocalVariable(name: "samples", scope: !301, file: !3, line: 164, type: !314)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: !312)
!317 = !DILocalVariable(name: "idle", scope: !318, file: !3, line: 168, type: !200)
!318 = distinct !DILexicalBlock(scope: !319, file: !3, line: 167, column: 33)
!319 = distinct !DILexicalBlock(scope: !320, file: !3, line: 167, column: 5)
!320 = distinct !DILexicalBlock(scope: !301, file: !3, line: 167, column: 5)
!321 = !DILocalVariable(name: "key", scope: !318, file: !3, line: 169, type: !86)
!322 = !DILocalVariable(name: "o", scope: !318, file: !3, line: 170, type: !210)
!323 = !DILocalVariable(name: "de", scope: !318, file: !3, line: 171, type: !133)
!324 = !DILocalVariable(name: "cached", scope: !325, file: !3, line: 226, type: !86)
!325 = distinct !DILexicalBlock(scope: !326, file: !3, line: 221, column: 50)
!326 = distinct !DILexicalBlock(scope: !327, file: !3, line: 221, column: 17)
!327 = distinct !DILexicalBlock(scope: !328, file: !3, line: 218, column: 16)
!328 = distinct !DILexicalBlock(scope: !329, file: !3, line: 216, column: 20)
!329 = distinct !DILexicalBlock(scope: !318, file: !3, line: 212, column: 13)
!330 = !DILocalVariable(name: "cached", scope: !331, file: !3, line: 235, type: !86)
!331 = distinct !DILexicalBlock(scope: !326, file: !3, line: 230, column: 20)
!332 = !DILocalVariable(name: "klen", scope: !318, file: !3, line: 246, type: !65)
!333 = !DILocation(line: 162, column: 31, scope: !301)
!334 = !DILocation(line: 162, column: 43, scope: !301)
!335 = !DILocation(line: 162, column: 61, scope: !301)
!336 = !DILocation(line: 162, column: 96, scope: !301)
!337 = !DILocation(line: 164, column: 31, scope: !301)
!338 = !{!339, !283, i64 2716}
!339 = !{!"redisServer", !283, i64 0, !282, i64 8, !282, i64 16, !282, i64 24, !283, i64 32, !283, i64 36, !283, i64 40, !282, i64 48, !282, i64 56, !282, i64 64, !282, i64 72, !283, i64 80, !283, i64 84, !283, i64 88, !283, i64 92, !282, i64 96, !282, i64 104, !283, i64 112, !283, i64 116, !280, i64 120, !283, i64 164, !340, i64 168, !283, i64 176, !282, i64 184, !282, i64 192, !282, i64 200, !280, i64 208, !283, i64 216, !283, i64 220, !280, i64 224, !283, i64 352, !282, i64 360, !283, i64 368, !280, i64 372, !283, i64 436, !283, i64 440, !280, i64 444, !283, i64 508, !282, i64 512, !282, i64 520, !282, i64 528, !282, i64 536, !282, i64 544, !282, i64 552, !282, i64 560, !283, i64 568, !279, i64 576, !280, i64 584, !282, i64 840, !340, i64 848, !283, i64 856, !283, i64 860, !340, i64 864, !340, i64 872, !340, i64 880, !340, i64 888, !282, i64 896, !282, i64 904, !282, i64 912, !282, i64 920, !282, i64 928, !282, i64 936, !282, i64 944, !282, i64 952, !282, i64 960, !282, i64 968, !282, i64 976, !282, i64 984, !282, i64 992, !340, i64 1000, !279, i64 1008, !279, i64 1016, !279, i64 1024, !341, i64 1032, !279, i64 1040, !279, i64 1048, !279, i64 1056, !279, i64 1064, !279, i64 1072, !279, i64 1080, !279, i64 1088, !279, i64 1096, !279, i64 1104, !340, i64 1112, !279, i64 1120, !341, i64 1128, !279, i64 1136, !279, i64 1144, !279, i64 1152, !279, i64 1160, !282, i64 1168, !279, i64 1176, !279, i64 1184, !340, i64 1192, !342, i64 1200, !279, i64 1240, !279, i64 1248, !340, i64 1256, !340, i64 1264, !280, i64 1272, !283, i64 1728, !283, i64 1732, !283, i64 1736, !283, i64 1740, !283, i64 1744, !340, i64 1752, !283, i64 1760, !283, i64 1764, !283, i64 1768, !283, i64 1772, !340, i64 1776, !340, i64 1784, !283, i64 1792, !283, i64 1796, !283, i64 1800, !283, i64 1804, !280, i64 1808, !283, i64 1880, !283, i64 1884, !282, i64 1888, !283, i64 1896, !283, i64 1900, !340, i64 1904, !340, i64 1912, !340, i64 1920, !340, i64 1928, !283, i64 1936, !283, i64 1940, !282, i64 1944, !282, i64 1952, !283, i64 1960, !283, i64 1964, !340, i64 1968, !340, i64 1976, !340, i64 1984, !340, i64 1992, !283, i64 2000, !340, i64 2008, !283, i64 2016, !283, i64 2020, !283, i64 2024, !283, i64 2028, !283, i64 2032, !283, i64 2036, !283, i64 2040, !283, i64 2044, !283, i64 2048, !283, i64 2052, !283, i64 2056, !283, i64 2060, !283, i64 2064, !282, i64 2072, !279, i64 2080, !279, i64 2088, !283, i64 2096, !282, i64 2104, !283, i64 2112, !282, i64 2120, !283, i64 2128, !283, i64 2132, !340, i64 2136, !340, i64 2144, !340, i64 2152, !340, i64 2160, !283, i64 2168, !283, i64 2172, !283, i64 2176, !283, i64 2180, !283, i64 2184, !283, i64 2188, !280, i64 2192, !343, i64 2200, !344, i64 2224, !282, i64 2240, !283, i64 2248, !282, i64 2256, !283, i64 2264, !280, i64 2268, !280, i64 2309, !279, i64 2352, !279, i64 2360, !283, i64 2368, !283, i64 2372, !282, i64 2376, !279, i64 2384, !279, i64 2392, !279, i64 2400, !279, i64 2408, !340, i64 2416, !340, i64 2424, !283, i64 2432, !283, i64 2436, !283, i64 2440, !283, i64 2444, !283, i64 2448, !282, i64 2456, !282, i64 2464, !283, i64 2472, !283, i64 2476, !282, i64 2480, !282, i64 2488, !283, i64 2496, !283, i64 2500, !340, i64 2504, !340, i64 2512, !340, i64 2520, !283, i64 2528, !283, i64 2532, !282, i64 2536, !340, i64 2544, !283, i64 2552, !283, i64 2556, !283, i64 2560, !340, i64 2568, !283, i64 2576, !283, i64 2580, !283, i64 2584, !282, i64 2592, !280, i64 2600, !279, i64 2648, !283, i64 2656, !282, i64 2664, !282, i64 2672, !283, i64 2680, !282, i64 2688, !283, i64 2696, !283, i64 2700, !279, i64 2704, !283, i64 2712, !283, i64 2716, !283, i64 2720, !283, i64 2724, !279, i64 2728, !283, i64 2736, !280, i64 2740, !282, i64 2768, !282, i64 2776, !283, i64 2784, !283, i64 2788, !283, i64 2792, !283, i64 2796, !340, i64 2800, !340, i64 2808, !340, i64 2816, !340, i64 2824, !340, i64 2832, !340, i64 2840, !340, i64 2848, !340, i64 2856, !283, i64 2864, !283, i64 2868, !340, i64 2872, !340, i64 2880, !283, i64 2888, !279, i64 2896, !282, i64 2904, !282, i64 2912, !283, i64 2920, !283, i64 2924, !279, i64 2928, !282, i64 2936, !282, i64 2944, !283, i64 2952, !283, i64 2956, !283, i64 2960, !283, i64 2964, !282, i64 2968, !283, i64 2976, !283, i64 2980, !283, i64 2984, !282, i64 2992, !282, i64 3000, !282, i64 3008, !282, i64 3016, !279, i64 3024, !279, i64 3032, !279, i64 3040, !283, i64 3048, !283, i64 3052, !283, i64 3056, !283, i64 3060, !283, i64 3064, !283, i64 3068, !283, i64 3072, !283, i64 3076, !283, i64 3080, !283, i64 3084, !283, i64 3088, !279, i64 3096, !282, i64 3104, !282, i64 3112, !282, i64 3120, !283, i64 3128, !283, i64 3132, !283, i64 3136, !340, i64 3144, !282, i64 3152, !282, i64 3160, !282, i64 3168}
!340 = !{!"long", !280, i64 0}
!341 = !{!"double", !280, i64 0}
!342 = !{!"malloc_stats", !340, i64 0, !340, i64 8, !340, i64 16, !340, i64 24, !340, i64 32}
!343 = !{!"", !283, i64 0, !340, i64 8, !279, i64 16}
!344 = !{!"redisOpArray", !282, i64 0, !283, i64 8}
!345 = !DILocation(line: 164, column: 5, scope: !301)
!346 = !DILocation(line: 0, scope: !301)
!347 = !DILocation(line: 164, column: 16, scope: !301)
!348 = !DILocation(line: 166, column: 13, scope: !301)
!349 = !DILocation(line: 163, column: 15, scope: !301)
!350 = !DILocation(line: 163, column: 9, scope: !301)
!351 = !DILocation(line: 170, column: 15, scope: !318)
!352 = !DILocation(line: 167, column: 19, scope: !319)
!353 = !DILocation(line: 167, column: 5, scope: !320)
!354 = !DILocation(line: 173, column: 14, scope: !318)
!355 = !DILocation(line: 171, column: 20, scope: !318)
!356 = !DILocation(line: 174, column: 15, scope: !318)
!357 = !{!358, !282, i64 0}
!358 = !{!"dictEntry", !282, i64 0, !280, i64 8, !282, i64 16}
!359 = !DILocation(line: 169, column: 13, scope: !318)
!360 = !DILocation(line: 179, column: 20, scope: !361)
!361 = distinct !DILexicalBlock(scope: !318, file: !3, line: 179, column: 13)
!362 = !{!339, !283, i64 2712}
!363 = !DILocation(line: 179, column: 37, scope: !361)
!364 = !DILocation(line: 179, column: 13, scope: !318)
!365 = !DILocation(line: 200, column: 39, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 198, column: 71)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 198, column: 20)
!368 = distinct !DILexicalBlock(scope: !369, file: !3, line: 189, column: 20)
!369 = distinct !DILexicalBlock(scope: !318, file: !3, line: 187, column: 13)
!370 = !DILocation(line: 180, column: 17, scope: !371)
!371 = distinct !DILexicalBlock(scope: !361, file: !3, line: 179, column: 64)
!372 = !DILocation(line: 180, column: 45, scope: !373)
!373 = distinct !DILexicalBlock(scope: !371, file: !3, line: 180, column: 17)
!374 = !DILocation(line: 187, column: 20, scope: !369)
!375 = !DILocation(line: 180, column: 40, scope: !373)
!376 = !DILocation(line: 0, scope: !318)
!377 = !DILocation(line: 181, column: 17, scope: !371)
!378 = !{!280, !280, i64 0}
!379 = !DILocation(line: 187, column: 37, scope: !369)
!380 = !DILocation(line: 187, column: 13, scope: !318)
!381 = !DILocation(line: 90, column: 49, scope: !239, inlinedAt: !382)
!382 = distinct !DILocation(line: 188, column: 20, scope: !383)
!383 = distinct !DILexicalBlock(scope: !369, file: !3, line: 187, column: 59)
!384 = !DILocation(line: 81, column: 9, scope: !234, inlinedAt: !385)
!385 = distinct !DILocation(line: 91, column: 35, scope: !239, inlinedAt: !382)
!386 = !DILocation(line: 79, column: 18, scope: !230, inlinedAt: !385)
!387 = !DILocation(line: 85, column: 5, scope: !230, inlinedAt: !385)
!388 = !DILocation(line: 91, column: 35, scope: !239, inlinedAt: !382)
!389 = !DILocation(line: 91, column: 24, scope: !239, inlinedAt: !382)
!390 = !DILocation(line: 92, column: 24, scope: !253, inlinedAt: !382)
!391 = !DILocation(line: 92, column: 18, scope: !253, inlinedAt: !382)
!392 = !DILocation(line: 92, column: 21, scope: !253, inlinedAt: !382)
!393 = !DILocation(line: 95, column: 43, scope: !257, inlinedAt: !382)
!394 = !DILocation(line: 95, column: 28, scope: !257, inlinedAt: !382)
!395 = !DILocation(line: 92, column: 9, scope: !239, inlinedAt: !382)
!396 = !DILocation(line: 0, scope: !257, inlinedAt: !382)
!397 = !DILocation(line: 98, column: 1, scope: !239, inlinedAt: !382)
!398 = !DILocation(line: 168, column: 28, scope: !318)
!399 = !DILocation(line: 189, column: 9, scope: !383)
!400 = !DILocation(line: 189, column: 44, scope: !368)
!401 = !DILocation(line: 189, column: 20, scope: !369)
!402 = !DILocalVariable(name: "o", arg: 1, scope: !403, file: !3, line: 335, type: !210)
!403 = distinct !DISubprogram(name: "LFUDecrAndReturn", scope: !3, file: !3, line: 335, type: !404, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!54, !210}
!406 = !{!402, !407, !408, !409}
!407 = !DILocalVariable(name: "ldt", scope: !403, file: !3, line: 336, type: !54)
!408 = !DILocalVariable(name: "counter", scope: !403, file: !3, line: 337, type: !54)
!409 = !DILocalVariable(name: "num_periods", scope: !403, file: !3, line: 338, type: !54)
!410 = !DILocation(line: 335, column: 38, scope: !403, inlinedAt: !411)
!411 = distinct !DILocation(line: 197, column: 24, scope: !412)
!412 = distinct !DILexicalBlock(scope: !368, file: !3, line: 189, column: 66)
!413 = !DILocation(line: 336, column: 28, scope: !403, inlinedAt: !411)
!414 = !DILocation(line: 337, column: 36, scope: !403, inlinedAt: !411)
!415 = !DILocation(line: 337, column: 29, scope: !403, inlinedAt: !411)
!416 = !DILocation(line: 337, column: 19, scope: !403, inlinedAt: !411)
!417 = !DILocation(line: 338, column: 40, scope: !403, inlinedAt: !411)
!418 = !{!339, !283, i64 2724}
!419 = !DILocation(line: 338, column: 33, scope: !403, inlinedAt: !411)
!420 = !DILocation(line: 336, column: 32, scope: !403, inlinedAt: !411)
!421 = !DILocation(line: 336, column: 25, scope: !403, inlinedAt: !411)
!422 = !DILocation(line: 336, column: 19, scope: !403, inlinedAt: !411)
!423 = !DILocalVariable(name: "ldt", arg: 1, scope: !424, file: !3, line: 307, type: !54)
!424 = distinct !DISubprogram(name: "LFUTimeElapsed", scope: !3, file: !3, line: 307, type: !425, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!54, !54}
!427 = !{!423, !428}
!428 = !DILocalVariable(name: "now", scope: !424, file: !3, line: 308, type: !54)
!429 = !DILocation(line: 307, column: 44, scope: !424, inlinedAt: !430)
!430 = distinct !DILocation(line: 338, column: 57, scope: !403, inlinedAt: !411)
!431 = !DILocation(line: 300, column: 20, scope: !432, inlinedAt: !435)
!432 = distinct !DISubprogram(name: "LFUGetTimeInMinutes", scope: !3, file: !3, line: 299, type: !433, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!433 = !DISubroutineType(types: !434)
!434 = !{!54}
!435 = distinct !DILocation(line: 308, column: 25, scope: !424, inlinedAt: !430)
!436 = !{!339, !340, i64 2872}
!437 = !DILocation(line: 300, column: 28, scope: !432, inlinedAt: !435)
!438 = !DILocation(line: 300, column: 33, scope: !432, inlinedAt: !435)
!439 = !DILocation(line: 300, column: 5, scope: !432, inlinedAt: !435)
!440 = !DILocation(line: 308, column: 19, scope: !424, inlinedAt: !430)
!441 = !DILocation(line: 309, column: 13, scope: !442, inlinedAt: !430)
!442 = distinct !DILexicalBlock(scope: !424, file: !3, line: 309, column: 9)
!443 = !DILocation(line: 309, column: 9, scope: !424, inlinedAt: !430)
!444 = !DILocation(line: 311, column: 1, scope: !424, inlinedAt: !430)
!445 = !DILocation(line: 338, column: 79, scope: !403, inlinedAt: !411)
!446 = !DILocation(line: 338, column: 77, scope: !403, inlinedAt: !411)
!447 = !DILocation(line: 338, column: 19, scope: !403, inlinedAt: !411)
!448 = !DILocation(line: 339, column: 9, scope: !449, inlinedAt: !411)
!449 = distinct !DILexicalBlock(scope: !403, file: !3, line: 339, column: 9)
!450 = !DILocation(line: 339, column: 9, scope: !403, inlinedAt: !411)
!451 = !DILocation(line: 340, column: 19, scope: !449, inlinedAt: !411)
!452 = !DILocation(line: 340, column: 9, scope: !449, inlinedAt: !411)
!453 = !DILocation(line: 0, scope: !403, inlinedAt: !411)
!454 = !DILocation(line: 341, column: 5, scope: !403, inlinedAt: !411)
!455 = !DILocation(line: 197, column: 23, scope: !412)
!456 = !DILocation(line: 198, column: 9, scope: !412)
!457 = !DILocation(line: 198, column: 44, scope: !367)
!458 = !DILocation(line: 198, column: 20, scope: !368)
!459 = !DILocation(line: 200, column: 31, scope: !366)
!460 = !DILocation(line: 202, column: 13, scope: !461)
!461 = distinct !DILexicalBlock(scope: !367, file: !3, line: 201, column: 16)
!462 = !DILocation(line: 0, scope: !366)
!463 = !DILocation(line: 163, column: 12, scope: !301)
!464 = !DILocation(line: 210, column: 24, scope: !318)
!465 = !DILocation(line: 210, column: 16, scope: !318)
!466 = !DILocation(line: 210, column: 28, scope: !318)
!467 = !DILocation(line: 211, column: 24, scope: !318)
!468 = !DILocation(line: 211, column: 29, scope: !318)
!469 = !DILocation(line: 209, column: 9, scope: !318)
!470 = !DILocation(line: 212, column: 43, scope: !329)
!471 = !DILocation(line: 212, column: 47, scope: !329)
!472 = !DILocation(line: 212, column: 13, scope: !318)
!473 = !DILocation(line: 216, column: 51, scope: !328)
!474 = !DILocation(line: 216, column: 20, scope: !329)
!475 = !DILocation(line: 221, column: 37, scope: !326)
!476 = !DILocation(line: 221, column: 41, scope: !326)
!477 = !DILocation(line: 221, column: 17, scope: !327)
!478 = !DILocation(line: 226, column: 50, scope: !325)
!479 = !DILocation(line: 226, column: 21, scope: !325)
!480 = !DILocation(line: 227, column: 29, scope: !325)
!481 = !DILocation(line: 227, column: 31, scope: !325)
!482 = !DILocation(line: 227, column: 25, scope: !325)
!483 = !DILocation(line: 227, column: 34, scope: !325)
!484 = !DILocation(line: 228, column: 36, scope: !325)
!485 = !DILocation(line: 227, column: 17, scope: !325)
!486 = !DILocation(line: 229, column: 25, scope: !325)
!487 = !DILocation(line: 229, column: 32, scope: !325)
!488 = !DILocation(line: 230, column: 13, scope: !325)
!489 = !DILocation(line: 232, column: 18, scope: !331)
!490 = !DILocation(line: 235, column: 38, scope: !331)
!491 = !DILocation(line: 235, column: 21, scope: !331)
!492 = !DILocation(line: 236, column: 33, scope: !493)
!493 = distinct !DILexicalBlock(scope: !331, file: !3, line: 236, column: 21)
!494 = !DILocation(line: 236, column: 21, scope: !331)
!495 = !DILocation(line: 236, column: 52, scope: !493)
!496 = !DILocation(line: 237, column: 53, scope: !331)
!497 = !DILocation(line: 237, column: 52, scope: !331)
!498 = !DILocation(line: 237, column: 17, scope: !331)
!499 = !DILocation(line: 238, column: 25, scope: !331)
!500 = !DILocation(line: 238, column: 32, scope: !331)
!501 = !DILocation(line: 0, scope: !331)
!502 = !DILocalVariable(name: "s", arg: 1, scope: !503, file: !13, line: 87, type: !508)
!503 = distinct !DISubprogram(name: "sdslen", scope: !13, file: !13, line: 87, type: !504, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !509)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !508}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !507, line: 58, baseType: !54)
!507 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!509 = !{!502, !510}
!510 = !DILocalVariable(name: "flags", scope: !503, file: !13, line: 88, type: !20)
!511 = !DILocation(line: 87, column: 39, scope: !503, inlinedAt: !512)
!512 = distinct !DILocation(line: 246, column: 20, scope: !318)
!513 = !DILocation(line: 88, column: 27, scope: !503, inlinedAt: !512)
!514 = !DILocation(line: 88, column: 19, scope: !503, inlinedAt: !512)
!515 = !DILocation(line: 89, column: 5, scope: !503, inlinedAt: !512)
!516 = !DILocation(line: 102, column: 1, scope: !503, inlinedAt: !512)
!517 = !DILocation(line: 246, column: 13, scope: !318)
!518 = !DILocation(line: 247, column: 13, scope: !318)
!519 = !DILocation(line: 91, column: 20, scope: !520, inlinedAt: !512)
!520 = distinct !DILexicalBlock(scope: !503, file: !13, line: 89, column: 33)
!521 = !DILocation(line: 91, column: 13, scope: !520, inlinedAt: !512)
!522 = !DILocation(line: 93, column: 20, scope: !520, inlinedAt: !512)
!523 = !DILocation(line: 93, column: 34, scope: !520, inlinedAt: !512)
!524 = !DILocation(line: 93, column: 13, scope: !520, inlinedAt: !512)
!525 = !DILocation(line: 95, column: 20, scope: !520, inlinedAt: !512)
!526 = !DILocation(line: 95, column: 35, scope: !520, inlinedAt: !512)
!527 = !{!528, !528, i64 0}
!528 = !{!"short", !280, i64 0}
!529 = !DILocation(line: 95, column: 13, scope: !520, inlinedAt: !512)
!530 = !DILocation(line: 97, column: 20, scope: !520, inlinedAt: !512)
!531 = !DILocation(line: 97, column: 35, scope: !520, inlinedAt: !512)
!532 = !{!283, !283, i64 0}
!533 = !DILocation(line: 97, column: 13, scope: !520, inlinedAt: !512)
!534 = !DILocation(line: 99, column: 20, scope: !520, inlinedAt: !512)
!535 = !DILocation(line: 99, column: 35, scope: !520, inlinedAt: !512)
!536 = !{!340, !340, i64 0}
!537 = !DILocation(line: 99, column: 13, scope: !520, inlinedAt: !512)
!538 = !DILocation(line: 0, scope: !520, inlinedAt: !512)
!539 = !DILocation(line: 246, column: 20, scope: !318)
!540 = !DILocation(line: 247, column: 18, scope: !541)
!541 = distinct !DILexicalBlock(scope: !318, file: !3, line: 247, column: 13)
!542 = !DILocation(line: 248, column: 27, scope: !543)
!543 = distinct !DILexicalBlock(scope: !541, file: !3, line: 247, column: 44)
!544 = !DILocation(line: 248, column: 13, scope: !543)
!545 = !DILocation(line: 248, column: 21, scope: !543)
!546 = !DILocation(line: 248, column: 25, scope: !543)
!547 = !DILocation(line: 249, column: 9, scope: !543)
!548 = !DILocation(line: 250, column: 20, scope: !549)
!549 = distinct !DILexicalBlock(scope: !541, file: !3, line: 249, column: 16)
!550 = !DILocation(line: 250, column: 28, scope: !549)
!551 = !DILocation(line: 250, column: 39, scope: !549)
!552 = !DILocation(line: 250, column: 13, scope: !549)
!553 = !DILocation(line: 251, column: 31, scope: !549)
!554 = !DILocation(line: 251, column: 38, scope: !549)
!555 = !DILocalVariable(name: "s", arg: 1, scope: !556, file: !13, line: 130, type: !86)
!556 = distinct !DISubprogram(name: "sdssetlen", scope: !13, file: !13, line: 130, type: !557, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !86, !506}
!559 = !{!555, !560, !561, !562}
!560 = !DILocalVariable(name: "newlen", arg: 2, scope: !556, file: !13, line: 130, type: !506)
!561 = !DILocalVariable(name: "flags", scope: !556, file: !13, line: 131, type: !20)
!562 = !DILocalVariable(name: "fp", scope: !563, file: !13, line: 135, type: !58)
!563 = distinct !DILexicalBlock(scope: !564, file: !13, line: 134, column: 13)
!564 = distinct !DILexicalBlock(scope: !556, file: !13, line: 132, column: 33)
!565 = !DILocation(line: 130, column: 34, scope: !556, inlinedAt: !566)
!566 = distinct !DILocation(line: 251, column: 13, scope: !549)
!567 = !DILocation(line: 130, column: 44, scope: !556, inlinedAt: !566)
!568 = !DILocation(line: 131, column: 27, scope: !556, inlinedAt: !566)
!569 = !DILocation(line: 131, column: 19, scope: !556, inlinedAt: !566)
!570 = !DILocation(line: 132, column: 5, scope: !556, inlinedAt: !566)
!571 = !DILocation(line: 135, column: 32, scope: !563, inlinedAt: !566)
!572 = !DILocation(line: 136, column: 23, scope: !563, inlinedAt: !566)
!573 = !DILocation(line: 136, column: 21, scope: !563, inlinedAt: !566)
!574 = !DILocation(line: 138, column: 13, scope: !564, inlinedAt: !566)
!575 = !DILocation(line: 140, column: 33, scope: !564, inlinedAt: !566)
!576 = !DILocation(line: 140, column: 13, scope: !564, inlinedAt: !566)
!577 = !DILocation(line: 140, column: 31, scope: !564, inlinedAt: !566)
!578 = !DILocation(line: 141, column: 13, scope: !564, inlinedAt: !566)
!579 = !DILocation(line: 143, column: 34, scope: !564, inlinedAt: !566)
!580 = !DILocation(line: 143, column: 13, scope: !564, inlinedAt: !566)
!581 = !DILocation(line: 143, column: 28, scope: !564, inlinedAt: !566)
!582 = !DILocation(line: 143, column: 32, scope: !564, inlinedAt: !566)
!583 = !DILocation(line: 144, column: 13, scope: !564, inlinedAt: !566)
!584 = !DILocation(line: 146, column: 34, scope: !564, inlinedAt: !566)
!585 = !DILocation(line: 146, column: 13, scope: !564, inlinedAt: !566)
!586 = !DILocation(line: 146, column: 28, scope: !564, inlinedAt: !566)
!587 = !DILocation(line: 146, column: 32, scope: !564, inlinedAt: !566)
!588 = !DILocation(line: 147, column: 13, scope: !564, inlinedAt: !566)
!589 = !DILocation(line: 149, column: 13, scope: !564, inlinedAt: !566)
!590 = !DILocation(line: 149, column: 28, scope: !564, inlinedAt: !566)
!591 = !DILocation(line: 149, column: 32, scope: !564, inlinedAt: !566)
!592 = !DILocation(line: 150, column: 13, scope: !564, inlinedAt: !566)
!593 = !DILocation(line: 152, column: 1, scope: !556, inlinedAt: !566)
!594 = !DILocation(line: 252, column: 35, scope: !549)
!595 = !DILocation(line: 252, column: 21, scope: !549)
!596 = !DILocation(line: 252, column: 25, scope: !549)
!597 = !DILocation(line: 254, column: 9, scope: !318)
!598 = !DILocation(line: 254, column: 17, scope: !318)
!599 = !DILocation(line: 254, column: 22, scope: !318)
!600 = !DILocation(line: 255, column: 17, scope: !318)
!601 = !DILocation(line: 255, column: 22, scope: !318)
!602 = !DILocation(line: 256, column: 5, scope: !319)
!603 = !DILocation(line: 167, column: 29, scope: !319)
!604 = distinct !{!604, !353, !605}
!605 = !DILocation(line: 256, column: 5, scope: !320)
!606 = !DILocation(line: 257, column: 1, scope: !301)
!607 = !DILocation(line: 335, column: 38, scope: !403)
!608 = !DILocation(line: 336, column: 28, scope: !403)
!609 = !DILocation(line: 337, column: 36, scope: !403)
!610 = !DILocation(line: 337, column: 29, scope: !403)
!611 = !DILocation(line: 337, column: 19, scope: !403)
!612 = !DILocation(line: 338, column: 40, scope: !403)
!613 = !DILocation(line: 338, column: 33, scope: !403)
!614 = !DILocation(line: 336, column: 32, scope: !403)
!615 = !DILocation(line: 336, column: 25, scope: !403)
!616 = !DILocation(line: 336, column: 19, scope: !403)
!617 = !DILocation(line: 307, column: 44, scope: !424, inlinedAt: !618)
!618 = distinct !DILocation(line: 338, column: 57, scope: !403)
!619 = !DILocation(line: 300, column: 20, scope: !432, inlinedAt: !620)
!620 = distinct !DILocation(line: 308, column: 25, scope: !424, inlinedAt: !618)
!621 = !DILocation(line: 300, column: 28, scope: !432, inlinedAt: !620)
!622 = !DILocation(line: 300, column: 33, scope: !432, inlinedAt: !620)
!623 = !DILocation(line: 300, column: 5, scope: !432, inlinedAt: !620)
!624 = !DILocation(line: 308, column: 19, scope: !424, inlinedAt: !618)
!625 = !DILocation(line: 309, column: 13, scope: !442, inlinedAt: !618)
!626 = !DILocation(line: 309, column: 9, scope: !424, inlinedAt: !618)
!627 = !DILocation(line: 311, column: 1, scope: !424, inlinedAt: !618)
!628 = !DILocation(line: 338, column: 79, scope: !403)
!629 = !DILocation(line: 338, column: 77, scope: !403)
!630 = !DILocation(line: 338, column: 19, scope: !403)
!631 = !DILocation(line: 339, column: 9, scope: !449)
!632 = !DILocation(line: 339, column: 9, scope: !403)
!633 = !DILocation(line: 340, column: 19, scope: !449)
!634 = !DILocation(line: 340, column: 9, scope: !449)
!635 = !DILocation(line: 0, scope: !403)
!636 = !DILocation(line: 341, column: 5, scope: !403)
!637 = !DILocation(line: 300, column: 20, scope: !432)
!638 = !DILocation(line: 300, column: 28, scope: !432)
!639 = !DILocation(line: 300, column: 33, scope: !432)
!640 = !DILocation(line: 300, column: 5, scope: !432)
!641 = !DILocation(line: 307, column: 44, scope: !424)
!642 = !DILocation(line: 300, column: 20, scope: !432, inlinedAt: !643)
!643 = distinct !DILocation(line: 308, column: 25, scope: !424)
!644 = !DILocation(line: 300, column: 28, scope: !432, inlinedAt: !643)
!645 = !DILocation(line: 300, column: 33, scope: !432, inlinedAt: !643)
!646 = !DILocation(line: 300, column: 5, scope: !432, inlinedAt: !643)
!647 = !DILocation(line: 308, column: 19, scope: !424)
!648 = !DILocation(line: 309, column: 13, scope: !442)
!649 = !DILocation(line: 309, column: 9, scope: !424)
!650 = !DILocation(line: 311, column: 1, scope: !424)
!651 = distinct !DISubprogram(name: "LFULogIncr", scope: !3, file: !3, line: 315, type: !652, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !654)
!652 = !DISubroutineType(types: !653)
!653 = !{!16, !16}
!654 = !{!655, !656, !657, !658}
!655 = !DILocalVariable(name: "counter", arg: 1, scope: !651, file: !3, line: 315, type: !16)
!656 = !DILocalVariable(name: "r", scope: !651, file: !3, line: 317, type: !8)
!657 = !DILocalVariable(name: "baseval", scope: !651, file: !3, line: 318, type: !8)
!658 = !DILocalVariable(name: "p", scope: !651, file: !3, line: 320, type: !8)
!659 = !DILocation(line: 315, column: 28, scope: !651)
!660 = !DILocation(line: 316, column: 17, scope: !661)
!661 = distinct !DILexicalBlock(scope: !651, file: !3, line: 316, column: 9)
!662 = !DILocation(line: 316, column: 9, scope: !651)
!663 = !DILocation(line: 316, column: 9, scope: !661)
!664 = !DILocation(line: 317, column: 24, scope: !651)
!665 = !DILocation(line: 317, column: 16, scope: !651)
!666 = !DILocation(line: 317, column: 12, scope: !651)
!667 = !DILocation(line: 318, column: 30, scope: !651)
!668 = !DILocation(line: 318, column: 22, scope: !651)
!669 = !DILocation(line: 318, column: 12, scope: !651)
!670 = !DILocation(line: 319, column: 17, scope: !671)
!671 = distinct !DILexicalBlock(scope: !651, file: !3, line: 319, column: 9)
!672 = !DILocation(line: 319, column: 9, scope: !651)
!673 = !DILocation(line: 320, column: 36, scope: !651)
!674 = !{!339, !283, i64 2720}
!675 = !DILocation(line: 320, column: 29, scope: !651)
!676 = !DILocation(line: 320, column: 28, scope: !651)
!677 = !DILocation(line: 320, column: 50, scope: !651)
!678 = !DILocation(line: 317, column: 30, scope: !651)
!679 = !DILocation(line: 320, column: 12, scope: !651)
!680 = !DILocation(line: 321, column: 11, scope: !681)
!681 = distinct !DILexicalBlock(scope: !651, file: !3, line: 321, column: 9)
!682 = !DILocation(line: 321, column: 9, scope: !651)
!683 = !DILocation(line: 0, scope: !651)
!684 = !DILocation(line: 323, column: 1, scope: !651)
!685 = distinct !DISubprogram(name: "freeMemoryGetNotCountedMemory", scope: !3, file: !3, line: 352, type: !686, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{!68}
!688 = !{!689, !690, !691, !699, !700}
!689 = !DILocalVariable(name: "overhead", scope: !685, file: !3, line: 353, type: !68)
!690 = !DILocalVariable(name: "slaves", scope: !685, file: !3, line: 354, type: !65)
!691 = !DILocalVariable(name: "li", scope: !692, file: !3, line: 357, type: !694)
!692 = distinct !DILexicalBlock(scope: !693, file: !3, line: 356, column: 17)
!693 = distinct !DILexicalBlock(scope: !685, file: !3, line: 356, column: 9)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !165, line: 45, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !165, line: 42, size: 128, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !695, file: !165, line: 43, baseType: !169, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !695, file: !165, line: 44, baseType: !65, size: 32, offset: 64)
!699 = !DILocalVariable(name: "ln", scope: !692, file: !3, line: 358, type: !169)
!700 = !DILocalVariable(name: "slave", scope: !701, file: !3, line: 362, type: !702)
!701 = distinct !DILexicalBlock(scope: !692, file: !3, line: 361, column: 37)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !76, line: 780, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !76, line: 723, size: 135360, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !717, !741, !742, !743, !744, !745, !746, !747, !748, !751, !752, !753, !754, !755, !756, !757, !758, !763, !764, !765, !766, !767, !768, !769, !770, !774, !775, !779, !780, !796, !797, !813, !814, !815, !816, !817, !818, !819, !820}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !704, file: !76, line: 724, baseType: !52, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !704, file: !76, line: 725, baseType: !65, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !704, file: !76, line: 726, baseType: !90, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !76, line: 727, baseType: !210, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !704, file: !76, line: 728, baseType: !86, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !704, file: !76, line: 729, baseType: !68, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !704, file: !76, line: 730, baseType: !86, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !704, file: !76, line: 734, baseType: !68, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !704, file: !76, line: 735, baseType: !65, size: 32, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !704, file: !76, line: 736, baseType: !716, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !704, file: !76, line: 737, baseType: !718, size: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !76, line: 1307, size: 640, elements: !720)
!720 = !{!721, !722, !727, !728, !729, !730, !736, !737, !738, !739, !740}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !76, line: 1308, baseType: !87, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !719, file: !76, line: 1309, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !76, line: 1305, baseType: !725)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !702}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !719, file: !76, line: 1310, baseType: !65, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !719, file: !76, line: 1311, baseType: !87, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !719, file: !76, line: 1312, baseType: !65, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !719, file: !76, line: 1315, baseType: !731, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !76, line: 1306, baseType: !733)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !718, !716, !65, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !719, file: !76, line: 1317, baseType: !65, size: 32, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !719, file: !76, line: 1318, baseType: !65, size: 32, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !719, file: !76, line: 1319, baseType: !65, size: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !719, file: !76, line: 1320, baseType: !10, size: 64, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !719, file: !76, line: 1320, baseType: !10, size: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !704, file: !76, line: 737, baseType: !718, size: 64, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !704, file: !76, line: 738, baseType: !65, size: 32, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !704, file: !76, line: 739, baseType: !65, size: 32, offset: 800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !704, file: !76, line: 740, baseType: !6, size: 64, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !704, file: !76, line: 741, baseType: !163, size: 64, offset: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !704, file: !76, line: 742, baseType: !200, size: 64, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !704, file: !76, line: 743, baseType: !68, size: 64, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !704, file: !76, line: 745, baseType: !749, size: 64, offset: 1088)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !750, line: 34, baseType: !6)
!750 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !704, file: !76, line: 746, baseType: !749, size: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !704, file: !76, line: 747, baseType: !749, size: 64, offset: 1216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !704, file: !76, line: 748, baseType: !65, size: 32, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !704, file: !76, line: 749, baseType: !65, size: 32, offset: 1312)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !704, file: !76, line: 750, baseType: !65, size: 32, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !704, file: !76, line: 751, baseType: !65, size: 32, offset: 1376)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !704, file: !76, line: 752, baseType: !65, size: 32, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !704, file: !76, line: 753, baseType: !759, size: 64, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !760, line: 173, baseType: !761)
!760 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 100, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !71, line: 44, baseType: !6)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !704, file: !76, line: 754, baseType: !759, size: 64, offset: 1536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !704, file: !76, line: 755, baseType: !86, size: 64, offset: 1600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !704, file: !76, line: 756, baseType: !10, size: 64, offset: 1664)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !704, file: !76, line: 757, baseType: !10, size: 64, offset: 1728)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !704, file: !76, line: 758, baseType: !10, size: 64, offset: 1792)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !704, file: !76, line: 759, baseType: !10, size: 64, offset: 1856)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !704, file: !76, line: 760, baseType: !10, size: 64, offset: 1920)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !704, file: !76, line: 763, baseType: !771, size: 328, offset: 1984)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 328, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 41)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !704, file: !76, line: 764, baseType: !65, size: 32, offset: 2336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !704, file: !76, line: 765, baseType: !776, size: 368, offset: 2368)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 368, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 46)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !704, file: !76, line: 766, baseType: !65, size: 32, offset: 2752)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !704, file: !76, line: 767, baseType: !781, size: 256, offset: 2816)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !76, line: 673, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !76, line: 665, size: 256, elements: !783)
!783 = !{!784, !792, !793, !794, !795}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !782, file: !76, line: 666, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !76, line: 663, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !76, line: 659, size: 192, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !787, file: !76, line: 660, baseType: !716, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !787, file: !76, line: 661, baseType: !65, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !787, file: !76, line: 662, baseType: !718, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !782, file: !76, line: 667, baseType: !65, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !782, file: !76, line: 668, baseType: !65, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !782, file: !76, line: 671, baseType: !65, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !782, file: !76, line: 672, baseType: !749, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !704, file: !76, line: 768, baseType: !65, size: 32, offset: 3072)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !704, file: !76, line: 769, baseType: !798, size: 704, offset: 3136)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !76, line: 703, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !76, line: 677, size: 704, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !799, file: !76, line: 679, baseType: !75, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !799, file: !76, line: 683, baseType: !95, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !799, file: !76, line: 685, baseType: !210, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !799, file: !76, line: 689, baseType: !68, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !799, file: !76, line: 690, baseType: !210, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !799, file: !76, line: 691, baseType: !210, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !799, file: !76, line: 692, baseType: !75, size: 64, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !799, file: !76, line: 692, baseType: !75, size: 64, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !799, file: !76, line: 693, baseType: !65, size: 32, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !799, file: !76, line: 696, baseType: !65, size: 32, offset: 544)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !799, file: !76, line: 697, baseType: !10, size: 64, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !799, file: !76, line: 700, baseType: !7, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !704, file: !76, line: 770, baseType: !10, size: 64, offset: 3840)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !704, file: !76, line: 771, baseType: !163, size: 64, offset: 3904)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !704, file: !76, line: 772, baseType: !95, size: 64, offset: 3968)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !704, file: !76, line: 773, baseType: !163, size: 64, offset: 4032)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !704, file: !76, line: 774, baseType: !86, size: 64, offset: 4096)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !704, file: !76, line: 775, baseType: !169, size: 64, offset: 4160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !704, file: !76, line: 778, baseType: !65, size: 32, offset: 4224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !704, file: !76, line: 779, baseType: !821, size: 131072, offset: 4256)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 131072, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 16384)
!824 = !DILocation(line: 353, column: 12, scope: !685)
!825 = !DILocation(line: 354, column: 18, scope: !685)
!826 = !{!339, !282, i64 536}
!827 = !{!828, !340, i64 40}
!828 = !{!"list", !282, i64 0, !282, i64 8, !282, i64 16, !282, i64 24, !282, i64 32, !340, i64 40}
!829 = !DILocation(line: 354, column: 9, scope: !685)
!830 = !DILocation(line: 356, column: 9, scope: !693)
!831 = !DILocation(line: 356, column: 9, scope: !685)
!832 = !DILocation(line: 357, column: 9, scope: !692)
!833 = !DILocation(line: 357, column: 18, scope: !692)
!834 = !DILocation(line: 360, column: 9, scope: !692)
!835 = !DILocation(line: 361, column: 21, scope: !692)
!836 = !DILocation(line: 358, column: 19, scope: !692)
!837 = !DILocation(line: 361, column: 9, scope: !692)
!838 = !DILocation(line: 362, column: 29, scope: !701)
!839 = !{!840, !282, i64 16}
!840 = !{!"listNode", !282, i64 0, !282, i64 8, !282, i64 16}
!841 = !DILocation(line: 362, column: 21, scope: !701)
!842 = !DILocation(line: 363, column: 25, scope: !701)
!843 = !DILocation(line: 363, column: 22, scope: !701)
!844 = distinct !{!844, !837, !845}
!845 = !DILocation(line: 364, column: 9, scope: !692)
!846 = !DILocation(line: 0, scope: !701)
!847 = !DILocation(line: 365, column: 5, scope: !693)
!848 = !DILocation(line: 365, column: 5, scope: !692)
!849 = !DILocation(line: 366, column: 16, scope: !850)
!850 = distinct !DILexicalBlock(scope: !685, file: !3, line: 366, column: 9)
!851 = !{!339, !283, i64 1880}
!852 = !DILocation(line: 366, column: 26, scope: !850)
!853 = !DILocation(line: 366, column: 9, scope: !685)
!854 = !DILocation(line: 367, column: 37, scope: !855)
!855 = distinct !DILexicalBlock(scope: !850, file: !3, line: 366, column: 38)
!856 = !{!339, !282, i64 1952}
!857 = !DILocalVariable(name: "s", arg: 1, scope: !858, file: !13, line: 180, type: !508)
!858 = distinct !DISubprogram(name: "sdsalloc", scope: !13, file: !13, line: 180, type: !504, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !859)
!859 = !{!857, !860}
!860 = !DILocalVariable(name: "flags", scope: !858, file: !13, line: 181, type: !20)
!861 = !DILocation(line: 180, column: 41, scope: !858, inlinedAt: !862)
!862 = distinct !DILocation(line: 367, column: 21, scope: !855)
!863 = !DILocation(line: 181, column: 27, scope: !858, inlinedAt: !862)
!864 = !DILocation(line: 181, column: 19, scope: !858, inlinedAt: !862)
!865 = !DILocation(line: 182, column: 5, scope: !858, inlinedAt: !862)
!866 = !DILocation(line: 184, column: 20, scope: !867, inlinedAt: !862)
!867 = distinct !DILexicalBlock(scope: !858, file: !13, line: 182, column: 33)
!868 = !DILocation(line: 184, column: 13, scope: !867, inlinedAt: !862)
!869 = !DILocation(line: 186, column: 34, scope: !867, inlinedAt: !862)
!870 = !DILocation(line: 186, column: 20, scope: !867, inlinedAt: !862)
!871 = !DILocation(line: 186, column: 13, scope: !867, inlinedAt: !862)
!872 = !DILocation(line: 188, column: 35, scope: !867, inlinedAt: !862)
!873 = !DILocation(line: 188, column: 20, scope: !867, inlinedAt: !862)
!874 = !DILocation(line: 188, column: 13, scope: !867, inlinedAt: !862)
!875 = !DILocation(line: 190, column: 35, scope: !867, inlinedAt: !862)
!876 = !DILocation(line: 190, column: 20, scope: !867, inlinedAt: !862)
!877 = !DILocation(line: 190, column: 13, scope: !867, inlinedAt: !862)
!878 = !DILocation(line: 192, column: 35, scope: !867, inlinedAt: !862)
!879 = !DILocation(line: 192, column: 13, scope: !867, inlinedAt: !862)
!880 = !DILocation(line: 0, scope: !867, inlinedAt: !862)
!881 = !DILocation(line: 195, column: 1, scope: !858, inlinedAt: !862)
!882 = !DILocation(line: 367, column: 46, scope: !855)
