; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/fmemopen.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/fmemopen.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/fmemopen.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 435, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!7 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!8 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!9 = !DIEnumerator(name: "PTHREAD_INHERIT_SCHED", value: 0)
!10 = !DIEnumerator(name: "PTHREAD_EXPLICIT_SCHED", value: 1)
!11 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS", value: 0)
!12 = !DIEnumerator(name: "PTHREAD_SCOPE_SYSTEM", value: 1)
!13 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS_VFPU", value: 2)
!14 = !DIEnumerator(name: "PTHREAD_CANCEL_ENABLE", value: 0)
!15 = !DIEnumerator(name: "PTHREAD_CANCEL_DISABLE", value: 1)
!16 = !DIEnumerator(name: "PTHREAD_CANCEL_ASYNCHRONOUS", value: 0)
!17 = !DIEnumerator(name: "PTHREAD_CANCEL_DEFERRED", value: 1)
!18 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!19 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!20 = !DIEnumerator(name: "PTHREAD_BARRIER_SERIAL_THREAD", value: -1)
!21 = !{!22, !23, !29, !42, !47}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmemcookie", file: !1, line: 81, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fmemcookie", file: !1, line: 72, size: 384, elements: !26)
!26 = !{!27, !28, !31, !37, !38, !39, !40, !41}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !25, file: !1, line: 73, baseType: !22, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !25, file: !1, line: 74, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !25, file: !1, line: 75, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 40, baseType: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !35, line: 129, baseType: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !25, file: !1, line: 76, baseType: !32, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !25, file: !1, line: 77, baseType: !32, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "append", scope: !25, file: !1, line: 78, baseType: !30, size: 8, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "writeonly", scope: !25, file: !1, line: 79, baseType: !30, size: 8, offset: 328)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !25, file: !1, line: 80, baseType: !30, size: 8, offset: 336)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !43, line: 173, baseType: !44)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !35, line: 100, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !35, line: 44, baseType: !46)
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !35, line: 114, baseType: !46)
!48 = !{i32 2, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!52 = distinct !DISubprogram(name: "_fmemopen_r", scope: !1, file: !1, line: 271, type: !53, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !272)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !82, !270, !32, !271}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !57, line: 66, baseType: !58)
!57 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !59, line: 287, baseType: !60)
!59 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !59, line: 181, size: 1408, elements: !61)
!61 = !{!62, !65, !66, !67, !69, !70, !75, !76, !77, !239, !245, !249, !253, !254, !255, !256, !258, !260, !261, !262, !263, !264, !268, !269}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !60, file: !59, line: 182, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !60, file: !59, line: 183, baseType: !5, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !60, file: !59, line: 184, baseType: !5, size: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !59, line: 185, baseType: !68, size: 16, offset: 128)
!68 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !60, file: !59, line: 186, baseType: !68, size: 16, offset: 144)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !60, file: !59, line: 187, baseType: !71, size: 128, offset: 192)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !59, line: 117, size: 128, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !71, file: !59, line: 118, baseType: !63, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !71, file: !59, line: 119, baseType: !5, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !60, file: !59, line: 188, baseType: !5, size: 32, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !60, file: !59, line: 195, baseType: !22, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !60, file: !59, line: 197, baseType: !78, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !82, !22, !29, !5}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !35, line: 145, baseType: !46)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !59, line: 569, size: 14912, elements: !84)
!84 = !{!85, !86, !88, !89, !90, !91, !95, !96, !99, !100, !104, !119, !120, !121, !123, !124, !125, !203, !224, !225, !230, !237}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !83, file: !59, line: 571, baseType: !5, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !83, file: !59, line: 576, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !83, file: !59, line: 576, baseType: !87, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !83, file: !59, line: 576, baseType: !87, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !83, file: !59, line: 578, baseType: !5, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !83, file: !59, line: 579, baseType: !92, size: 200, offset: 288)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 200, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 25)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !83, file: !59, line: 582, baseType: !5, size: 32, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !83, file: !59, line: 583, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !59, line: 40, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !83, file: !59, line: 585, baseType: !5, size: 32, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !83, file: !59, line: 587, baseType: !101, size: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !82}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !83, file: !59, line: 590, baseType: !105, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !59, line: 47, size: 256, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !106, file: !59, line: 49, baseType: !105, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !106, file: !59, line: 50, baseType: !5, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !106, file: !59, line: 50, baseType: !5, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !106, file: !59, line: 50, baseType: !5, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !106, file: !59, line: 50, baseType: !5, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !106, file: !59, line: 51, baseType: !114, size: 32, offset: 192)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, elements: !117)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !59, line: 25, baseType: !116)
!116 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !83, file: !59, line: 591, baseType: !5, size: 32, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !83, file: !59, line: 592, baseType: !105, size: 64, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !83, file: !59, line: 593, baseType: !122, size: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !83, file: !59, line: 596, baseType: !5, size: 32, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !83, file: !59, line: 597, baseType: !29, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !83, file: !59, line: 632, baseType: !126, size: 2880, offset: 1152)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !59, line: 599, size: 2880, elements: !127)
!127 = !{!128, !194}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !126, file: !59, line: 622, baseType: !129, size: 1728)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !59, line: 601, size: 1728, elements: !130)
!130 = !{!131, !132, !133, !137, !149, !150, !152, !162, !177, !178, !179, !183, !187, !188, !189, !190, !191, !192, !193}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !129, file: !59, line: 603, baseType: !116, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !129, file: !59, line: 604, baseType: !29, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !129, file: !59, line: 605, baseType: !134, size: 208, offset: 128)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 208, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 26)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !129, file: !59, line: 606, baseType: !138, size: 288, offset: 352)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !59, line: 55, size: 288, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !138, file: !59, line: 57, baseType: !5, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !138, file: !59, line: 58, baseType: !5, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !138, file: !59, line: 59, baseType: !5, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !138, file: !59, line: 60, baseType: !5, size: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !138, file: !59, line: 61, baseType: !5, size: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !138, file: !59, line: 62, baseType: !5, size: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !138, file: !59, line: 63, baseType: !5, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !138, file: !59, line: 64, baseType: !5, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !138, file: !59, line: 65, baseType: !5, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !129, file: !59, line: 607, baseType: !5, size: 32, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !129, file: !59, line: 608, baseType: !151, size: 64, offset: 704)
!151 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !129, file: !59, line: 609, baseType: !153, size: 112, offset: 768)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !59, line: 319, size: 112, elements: !154)
!154 = !{!155, !160, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !153, file: !59, line: 320, baseType: !156, size: 48)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 48, elements: !158)
!157 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!158 = !{!159}
!159 = !DISubrange(count: 3)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !153, file: !59, line: 321, baseType: !156, size: 48, offset: 48)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !153, file: !59, line: 322, baseType: !157, size: 16, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !129, file: !59, line: 610, baseType: !163, size: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !35, line: 171, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 163, size: 64, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !164, file: !35, line: 165, baseType: !5, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !164, file: !35, line: 170, baseType: !168, size: 32, offset: 32)
!168 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !164, file: !35, line: 166, size: 32, elements: !169)
!169 = !{!170, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !168, file: !35, line: 168, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !172, line: 124, baseType: !116)
!172 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !168, file: !35, line: 169, baseType: !174, size: 32)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 4)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !129, file: !59, line: 611, baseType: !163, size: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !129, file: !59, line: 612, baseType: !163, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !129, file: !59, line: 613, baseType: !180, size: 64, offset: 1088)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !129, file: !59, line: 614, baseType: !184, size: 192, offset: 1152)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 24)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !129, file: !59, line: 615, baseType: !5, size: 32, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !129, file: !59, line: 616, baseType: !163, size: 64, offset: 1376)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !129, file: !59, line: 617, baseType: !163, size: 64, offset: 1440)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !129, file: !59, line: 618, baseType: !163, size: 64, offset: 1504)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !129, file: !59, line: 619, baseType: !163, size: 64, offset: 1568)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !129, file: !59, line: 620, baseType: !163, size: 64, offset: 1632)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !129, file: !59, line: 621, baseType: !5, size: 32, offset: 1696)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !126, file: !59, line: 631, baseType: !195, size: 2880)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !59, line: 626, size: 2880, elements: !196)
!196 = !{!197, !201}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !195, file: !59, line: 629, baseType: !198, size: 1920)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1920, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 30)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !195, file: !59, line: 630, baseType: !202, size: 960, offset: 1920)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 960, elements: !199)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !83, file: !59, line: 636, baseType: !204, size: 64, offset: 4032)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !59, line: 93, size: 6336, elements: !206)
!206 = !{!207, !208, !209, !216}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !205, file: !59, line: 94, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !205, file: !59, line: 95, baseType: !5, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !205, file: !59, line: 97, baseType: !210, size: 2048, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 2048, elements: !214)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null}
!214 = !{!215}
!215 = !DISubrange(count: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !205, file: !59, line: 98, baseType: !217, size: 4160, offset: 2176)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !59, line: 74, size: 4160, elements: !218)
!218 = !{!219, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !217, file: !59, line: 75, baseType: !220, size: 2048)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !214)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !217, file: !59, line: 76, baseType: !220, size: 2048, offset: 2048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !217, file: !59, line: 78, baseType: !115, size: 32, offset: 4096)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !217, file: !59, line: 81, baseType: !115, size: 32, offset: 4128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !83, file: !59, line: 637, baseType: !205, size: 6336, offset: 4096)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !83, file: !59, line: 641, baseType: !226, size: 64, offset: 10432)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !5}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !83, file: !59, line: 646, baseType: !231, size: 192, offset: 10496)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !59, line: 291, size: 192, elements: !232)
!232 = !{!233, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !231, file: !59, line: 293, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !231, file: !59, line: 294, baseType: !5, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !231, file: !59, line: 295, baseType: !87, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !83, file: !59, line: 648, baseType: !238, size: 4224, offset: 10688)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 4224, elements: !158)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !60, file: !59, line: 199, baseType: !240, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!81, !82, !22, !243, !5}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !60, file: !59, line: 202, baseType: !246, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!47, !82, !22, !47, !5}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !60, file: !59, line: 203, baseType: !250, size: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!5, !82, !22}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !60, file: !59, line: 206, baseType: !71, size: 128, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !60, file: !59, line: 207, baseType: !63, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !60, file: !59, line: 208, baseType: !5, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !60, file: !59, line: 211, baseType: !257, size: 24, offset: 928)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 24, elements: !158)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !60, file: !59, line: 212, baseType: !259, size: 8, offset: 952)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !117)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !60, file: !59, line: 215, baseType: !71, size: 128, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !60, file: !59, line: 218, baseType: !5, size: 32, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !59, line: 219, baseType: !45, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !60, file: !59, line: 222, baseType: !82, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !59, line: 226, baseType: !265, size: 32, offset: 1280)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !35, line: 175, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !267, line: 12, baseType: !5)
!267 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !60, file: !59, line: 228, baseType: !163, size: 64, offset: 1312)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !59, line: 229, baseType: !5, size: 32, offset: 1376)
!270 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !22)
!271 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !243)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !285}
!273 = !DILocalVariable(name: "ptr", arg: 1, scope: !52, file: !1, line: 271, type: !82)
!274 = !DILocalVariable(name: "buf", arg: 2, scope: !52, file: !1, line: 271, type: !270)
!275 = !DILocalVariable(name: "size", arg: 3, scope: !52, file: !1, line: 271, type: !32)
!276 = !DILocalVariable(name: "mode", arg: 4, scope: !52, file: !1, line: 271, type: !271)
!277 = !DILocalVariable(name: "fp", scope: !52, file: !1, line: 277, type: !55)
!278 = !DILocalVariable(name: "c", scope: !52, file: !1, line: 278, type: !23)
!279 = !DILocalVariable(name: "flags", scope: !52, file: !1, line: 279, type: !5)
!280 = !DILocalVariable(name: "dummy", scope: !52, file: !1, line: 280, type: !5)
!281 = !DILocalVariable(name: "__oldsfpcancel", scope: !282, file: !1, line: 294, type: !5)
!282 = distinct !DILexicalBlock(scope: !283, file: !1, line: 294, column: 7)
!283 = distinct !DILexicalBlock(scope: !284, file: !1, line: 293, column: 5)
!284 = distinct !DILexicalBlock(scope: !52, file: !1, line: 291, column: 7)
!285 = !DILocalVariable(name: "__oldfpcancel", scope: !286, file: !1, line: 346, type: !5)
!286 = distinct !DILexicalBlock(scope: !52, file: !1, line: 346, column: 3)
!287 = !DILocation(line: 271, column: 1, scope: !52)
!288 = !DILocation(line: 280, column: 3, scope: !52)
!289 = !DILocation(line: 280, column: 7, scope: !52)
!290 = !DILocation(line: 282, column: 16, scope: !291)
!291 = distinct !DILexicalBlock(scope: !52, file: !1, line: 282, column: 7)
!292 = !DILocation(line: 279, column: 7, scope: !52)
!293 = !DILocation(line: 282, column: 46, scope: !291)
!294 = !DILocation(line: 282, column: 7, scope: !52)
!295 = !DILocation(line: 284, column: 8, scope: !296)
!296 = distinct !DILexicalBlock(scope: !52, file: !1, line: 284, column: 7)
!297 = !DILocation(line: 284, column: 13, scope: !296)
!298 = !DILocation(line: 284, column: 18, scope: !296)
!299 = !DILocation(line: 284, column: 22, scope: !296)
!300 = !DILocation(line: 284, column: 31, scope: !296)
!301 = !DILocation(line: 286, column: 12, scope: !302)
!302 = distinct !DILexicalBlock(scope: !296, file: !1, line: 285, column: 5)
!303 = !DILocation(line: 286, column: 19, scope: !302)
!304 = !{!305, !306, i64 0}
!305 = !{!"_reent", !306, i64 0, !309, i64 8, !309, i64 16, !309, i64 24, !306, i64 32, !307, i64 36, !306, i64 64, !309, i64 72, !306, i64 80, !309, i64 88, !309, i64 96, !306, i64 104, !309, i64 112, !309, i64 120, !306, i64 128, !309, i64 136, !307, i64 144, !309, i64 504, !310, i64 512, !309, i64 1304, !312, i64 1312, !307, i64 1336}
!306 = !{!"int", !307, i64 0}
!307 = !{!"omnipotent char", !308, i64 0}
!308 = !{!"Simple C/C++ TBAA"}
!309 = !{!"any pointer", !307, i64 0}
!310 = !{!"_atexit", !309, i64 0, !306, i64 8, !307, i64 16, !311, i64 272}
!311 = !{!"_on_exit_args", !307, i64 0, !307, i64 256, !306, i64 512, !306, i64 516}
!312 = !{!"_glue", !309, i64 0, !306, i64 8, !309, i64 16}
!313 = !DILocation(line: 287, column: 7, scope: !302)
!314 = !DILocation(line: 289, column: 13, scope: !315)
!315 = distinct !DILexicalBlock(scope: !52, file: !1, line: 289, column: 7)
!316 = !DILocation(line: 277, column: 9, scope: !52)
!317 = !DILocation(line: 289, column: 26, scope: !315)
!318 = !DILocation(line: 289, column: 7, scope: !52)
!319 = !DILocation(line: 291, column: 27, scope: !284)
!320 = !DILocation(line: 278, column: 15, scope: !52)
!321 = !DILocation(line: 292, column: 7, scope: !284)
!322 = !DILocation(line: 291, column: 7, scope: !52)
!323 = !DILocation(line: 294, column: 7, scope: !282)
!324 = !DILocation(line: 295, column: 11, scope: !282)
!325 = !DILocation(line: 295, column: 18, scope: !282)
!326 = !{!327, !328, i64 16}
