; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sharedObjectsStruct = type { %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, [10 x %struct.redisObject*], [10000 x %struct.redisObject*], [32 x %struct.redisObject*], [32 x %struct.redisObject*], i8*, i8* }
%struct.redisObject = type { i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !9, !10, !25, !35, !45}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !5, line: 60, baseType: !6)
!5 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !7, line: 105, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !12, line: 51, size: 24, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !18, !19, !20}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !12, line: 52, baseType: !15, size: 8)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5, line: 24, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !7, line: 43, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !11, file: !12, line: 53, baseType: !15, size: 8, offset: 8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !11, file: !12, line: 54, baseType: !17, size: 8, offset: 16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !11, file: !12, line: 55, baseType: !21, offset: 24)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !23)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: -1)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !12, line: 57, size: 40, elements: !27)
!27 = !{!28, !32, !33, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !12, line: 58, baseType: !29, size: 16)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !5, line: 36, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 57, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !26, file: !12, line: 59, baseType: !29, size: 16, offset: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !12, line: 60, baseType: !17, size: 8, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !26, file: !12, line: 61, baseType: !21, offset: 40)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !12, line: 63, size: 72, elements: !37)
!37 = !{!38, !42, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !12, line: 64, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5, line: 48, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !7, line: 79, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !36, file: !12, line: 65, baseType: !39, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !12, line: 66, baseType: !17, size: 8, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !36, file: !12, line: 67, baseType: !21, offset: 72)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !12, line: 69, size: 136, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !12, line: 70, baseType: !4, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !12, line: 71, baseType: !4, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !12, line: 72, baseType: !17, size: 8, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !12, line: 73, baseType: !21, offset: 136)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "geoArrayCreate", scope: !1, file: !1, line: 53, type: !57, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !81)
!57 = !DISubroutineType(types: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "geoArray", file: !61, line: 20, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.h", directory: "/root/.unikraft/apps/redis/build")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "geoArray", file: !61, line: 16, size: 192, elements: !63)
!63 = !{!64, !75, !80}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !62, file: !61, line: 17, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "geoPoint", file: !61, line: 8, size: 320, elements: !67)
!67 = !{!68, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !66, file: !61, line: 9, baseType: !69, size: 64)
!69 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !66, file: !61, line: 10, baseType: !69, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !66, file: !61, line: 11, baseType: !69, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !66, file: !61, line: 12, baseType: !69, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "member", scope: !66, file: !61, line: 13, baseType: !74, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !62, file: !61, line: 18, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 40, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !79, line: 129, baseType: !8)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !62, file: !61, line: 19, baseType: !76, size: 64, offset: 128)
!81 = !{!82}
!82 = !DILocalVariable(name: "ga", scope: !56, file: !1, line: 54, type: !59)
!83 = !DILocation(line: 54, column: 20, scope: !56)
!84 = !DILocation(line: 54, column: 15, scope: !56)
!85 = !DILocation(line: 56, column: 9, scope: !56)
!86 = !DILocation(line: 56, column: 15, scope: !56)
!87 = !{!88, !89, i64 0}
!88 = !{!"geoArray", !89, i64 0, !92, i64 8, !92, i64 16}
!89 = !{!"any pointer", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !{!"long", !90, i64 0}
!93 = !DILocation(line: 57, column: 9, scope: !56)
!94 = !DILocation(line: 57, column: 17, scope: !56)
!95 = !{!92, !92, i64 0}
!96 = !DILocation(line: 59, column: 5, scope: !56)
!97 = distinct !DISubprogram(name: "geoArrayAppend", scope: !1, file: !1, line: 64, type: !98, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !102)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !59}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "geoPoint", file: !61, line: 14, baseType: !66)
!102 = !{!103, !104}
!103 = !DILocalVariable(name: "ga", arg: 1, scope: !97, file: !1, line: 64, type: !59)
!104 = !DILocalVariable(name: "gp", scope: !97, file: !1, line: 69, type: !100)
!105 = !DILocation(line: 64, column: 36, scope: !97)
!106 = !DILocation(line: 65, column: 13, scope: !107)
!107 = distinct !DILexicalBlock(scope: !97, file: !1, line: 65, column: 9)
!108 = !{!88, !92, i64 16}
!109 = !DILocation(line: 65, column: 25, scope: !107)
!110 = !{!88, !92, i64 8}
!111 = !DILocation(line: 65, column: 18, scope: !107)
!112 = !DILocation(line: 65, column: 9, scope: !97)
!113 = !DILocation(line: 69, column: 24, scope: !97)
!114 = !DILocation(line: 66, column: 36, scope: !115)
!115 = distinct !DILexicalBlock(scope: !107, file: !1, line: 65, column: 34)
!116 = !DILocation(line: 66, column: 59, scope: !115)
!117 = !DILocation(line: 66, column: 23, scope: !115)
!118 = !DILocation(line: 66, column: 21, scope: !115)
!119 = !DILocation(line: 67, column: 34, scope: !115)
!120 = !DILocation(line: 67, column: 56, scope: !115)
!121 = !DILocation(line: 67, column: 21, scope: !115)
!122 = !DILocation(line: 67, column: 19, scope: !115)
!123 = !DILocation(line: 68, column: 5, scope: !115)
!124 = !DILocation(line: 69, column: 34, scope: !97)
!125 = !DILocation(line: 69, column: 29, scope: !97)
!126 = !DILocation(line: 69, column: 15, scope: !97)
!127 = !DILocation(line: 70, column: 13, scope: !97)
!128 = !DILocation(line: 71, column: 5, scope: !97)
!129 = distinct !DISubprogram(name: "geoArrayFree", scope: !1, file: !1, line: 75, type: !130, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !59}
!132 = !{!133, !134}
!133 = !DILocalVariable(name: "ga", arg: 1, scope: !129, file: !1, line: 75, type: !59)
!134 = !DILocalVariable(name: "i", scope: !129, file: !1, line: 76, type: !76)
!135 = !DILocation(line: 75, column: 29, scope: !129)
!136 = !DILocation(line: 76, column: 12, scope: !129)
!137 = !DILocation(line: 77, column: 25, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 77, column: 5)
!139 = distinct !DILexicalBlock(scope: !129, file: !1, line: 77, column: 5)
!140 = !DILocation(line: 77, column: 19, scope: !138)
!141 = !DILocation(line: 0, scope: !129)
!142 = !DILocation(line: 77, column: 5, scope: !139)
!143 = !DILocation(line: 77, column: 57, scope: !138)
!144 = !{!145, !89, i64 32}
!145 = !{!"geoPoint", !146, i64 0, !146, i64 8, !146, i64 16, !146, i64 24, !89, i64 32}
!146 = !{!"double", !90, i64 0}
!147 = !DILocation(line: 77, column: 36, scope: !138)
!148 = !DILocation(line: 77, column: 32, scope: !138)
!149 = distinct !{!149, !142, !150}
!150 = !DILocation(line: 77, column: 63, scope: !139)
!151 = !DILocation(line: 78, column: 11, scope: !129)
!152 = !DILocation(line: 78, column: 5, scope: !129)
!153 = !DILocation(line: 79, column: 11, scope: !129)
!154 = !DILocation(line: 79, column: 5, scope: !129)
!155 = !DILocation(line: 80, column: 1, scope: !129)
!156 = distinct !DISubprogram(name: "decodeGeohash", scope: !1, file: !1, line: 85, type: !157, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !161)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !69, !160}
!159 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!161 = !{!162, !163, !164}
!162 = !DILocalVariable(name: "bits", arg: 1, scope: !156, file: !1, line: 85, type: !69)
!163 = !DILocalVariable(name: "xy", arg: 2, scope: !156, file: !1, line: 85, type: !160)
!164 = !DILocalVariable(name: "hash", scope: !156, file: !1, line: 86, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashBits", file: !166, line: 69, baseType: !167)
!166 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash.h", directory: "/root/.unikraft/apps/redis/build")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 66, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !167, file: !166, line: 67, baseType: !4, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !167, file: !166, line: 68, baseType: !15, size: 8, offset: 64)
!171 = !DILocation(line: 85, column: 26, scope: !156)
!172 = !DILocation(line: 85, column: 40, scope: !156)
!173 = !DILocation(line: 86, column: 34, scope: !156)
!174 = !DILocation(line: 86, column: 17, scope: !156)
!175 = !DILocation(line: 87, column: 12, scope: !156)
!176 = !DILocation(line: 87, column: 5, scope: !156)
!177 = distinct !DISubprogram(name: "extractLongLatOrReply", scope: !1, file: !1, line: 93, type: !178, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !418)
!178 = !DISubroutineType(types: !179)
!179 = !{!159, !180, !308, !160}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !182, line: 780, baseType: !183)
!182 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !182, line: 723, size: 135360, elements: !184)
!184 = !{!185, !186, !187, !291, !301, !303, !304, !305, !306, !307, !309, !333, !334, !335, !336, !337, !338, !340, !341, !344, !345, !346, !347, !348, !349, !350, !351, !356, !357, !358, !359, !360, !361, !362, !363, !367, !368, !372, !373, !389, !390, !407, !408, !409, !410, !411, !412, !413, !414}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !183, file: !182, line: 724, baseType: !4, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !183, file: !182, line: 725, baseType: !159, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !183, file: !182, line: 726, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !182, line: 656, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !182, line: 647, size: 512, elements: !191)
!191 = !{!192, !255, !256, !257, !258, !259, !260, !262}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !190, file: !182, line: 648, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !195, line: 82, baseType: !196)
!195 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !195, line: 76, size: 768, elements: !197)
!197 = !{!198, !223, !224, !253, !254}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !195, line: 77, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !195, line: 65, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !195, line: 58, size: 384, elements: !202)
!202 = !{!203, !209, !213, !214, !218, !222}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !201, file: !195, line: 59, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!4, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !201, file: !195, line: 60, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!9, !9, !207}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !201, file: !195, line: 61, baseType: !210, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !201, file: !195, line: 62, baseType: !215, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!159, !9, !207, !207}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !201, file: !195, line: 63, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !9, !9}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !201, file: !195, line: 64, baseType: !219, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !196, file: !195, line: 78, baseType: !9, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !196, file: !195, line: 79, baseType: !225, size: 512, offset: 128)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 512, elements: !251)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !195, line: 74, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !195, line: 69, size: 256, elements: !228)
!228 = !{!229, !248, !249, !250}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !227, file: !195, line: 70, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !195, line: 56, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !195, line: 47, size: 192, elements: !234)
!234 = !{!235, !236, !246}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !233, file: !195, line: 48, baseType: !9, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !233, file: !195, line: 54, baseType: !237, size: 64, offset: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !195, line: 49, size: 64, elements: !238)
!238 = !{!239, !240, !241, !245}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !237, file: !195, line: 50, baseType: !9, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !237, file: !195, line: 51, baseType: !4, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !237, file: !195, line: 52, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !5, line: 56, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !7, line: 103, baseType: !244)
!244 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !237, file: !195, line: 53, baseType: !69, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !195, line: 55, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !227, file: !195, line: 71, baseType: !8, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !227, file: !195, line: 72, baseType: !8, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !227, file: !195, line: 73, baseType: !8, size: 64, offset: 192)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !196, file: !195, line: 80, baseType: !244, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !196, file: !195, line: 81, baseType: !8, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !190, file: !182, line: 649, baseType: !193, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !190, file: !182, line: 650, baseType: !193, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !190, file: !182, line: 651, baseType: !193, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !190, file: !182, line: 652, baseType: !193, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !182, line: 653, baseType: !159, size: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !190, file: !182, line: 654, baseType: !261, size: 64, offset: 384)
!261 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !190, file: !182, line: 655, baseType: !263, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !265, line: 54, baseType: !266)
!265 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !265, line: 47, size: 384, elements: !267)
!267 = !{!268, !277, !278, !282, !286, !290}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !266, file: !265, line: 48, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !265, line: 40, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !265, line: 36, size: 192, elements: !272)
!272 = !{!273, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !265, line: 37, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !265, line: 38, baseType: !274, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !271, file: !265, line: 39, baseType: !9, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !266, file: !265, line: 49, baseType: !269, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !266, file: !265, line: 50, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!9, !9}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !266, file: !265, line: 51, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !9}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !266, file: !265, line: 52, baseType: !287, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!159, !9, !9}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !266, file: !265, line: 53, baseType: !8, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !182, line: 727, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !182, line: 622, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !182, line: 614, size: 128, elements: !295)
!295 = !{!296, !297, !298, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !182, line: 615, baseType: !41, size: 4, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !294, file: !182, line: 616, baseType: !41, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !294, file: !182, line: 617, baseType: !41, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !294, file: !182, line: 620, baseType: !159, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !294, file: !182, line: 621, baseType: !9, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !183, file: !182, line: 728, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !12, line: 43, baseType: !74)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !183, file: !182, line: 729, baseType: !76, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !183, file: !182, line: 730, baseType: !302, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !183, file: !182, line: 734, baseType: !76, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !183, file: !182, line: 735, baseType: !159, size: 32, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !183, file: !182, line: 736, baseType: !308, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !183, file: !182, line: 737, baseType: !310, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !182, line: 1307, size: 640, elements: !312)
!312 = !{!313, !314, !319, !320, !321, !322, !328, !329, !330, !331, !332}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !182, line: 1308, baseType: !74, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !311, file: !182, line: 1309, baseType: !315, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !182, line: 1305, baseType: !317)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !180}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !311, file: !182, line: 1310, baseType: !159, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !311, file: !182, line: 1311, baseType: !74, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !182, line: 1312, baseType: !159, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !311, file: !182, line: 1315, baseType: !323, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !182, line: 1306, baseType: !325)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !310, !308, !159, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !311, file: !182, line: 1317, baseType: !159, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !311, file: !182, line: 1318, baseType: !159, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !311, file: !182, line: 1319, baseType: !159, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !311, file: !182, line: 1320, baseType: !261, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !311, file: !182, line: 1320, baseType: !261, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !183, file: !182, line: 737, baseType: !310, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !183, file: !182, line: 738, baseType: !159, size: 32, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !183, file: !182, line: 739, baseType: !159, size: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !183, file: !182, line: 740, baseType: !244, size: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !183, file: !182, line: 741, baseType: !263, size: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !183, file: !182, line: 742, baseType: !339, size: 64, offset: 960)
!339 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !183, file: !182, line: 743, baseType: !76, size: 64, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !183, file: !182, line: 745, baseType: !342, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !343, line: 34, baseType: !244)
!343 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !183, file: !182, line: 746, baseType: !342, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !183, file: !182, line: 747, baseType: !342, size: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !183, file: !182, line: 748, baseType: !159, size: 32, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !183, file: !182, line: 749, baseType: !159, size: 32, offset: 1312)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !183, file: !182, line: 750, baseType: !159, size: 32, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !183, file: !182, line: 751, baseType: !159, size: 32, offset: 1376)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !183, file: !182, line: 752, baseType: !159, size: 32, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !183, file: !182, line: 753, baseType: !352, size: 64, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !353, line: 173, baseType: !354)
!353 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 100, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !79, line: 44, baseType: !244)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !183, file: !182, line: 754, baseType: !352, size: 64, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !183, file: !182, line: 755, baseType: !302, size: 64, offset: 1600)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !183, file: !182, line: 756, baseType: !261, size: 64, offset: 1664)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !183, file: !182, line: 757, baseType: !261, size: 64, offset: 1728)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !183, file: !182, line: 758, baseType: !261, size: 64, offset: 1792)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !183, file: !182, line: 759, baseType: !261, size: 64, offset: 1856)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !183, file: !182, line: 760, baseType: !261, size: 64, offset: 1920)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !183, file: !182, line: 763, baseType: !364, size: 328, offset: 1984)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 328, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 41)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !183, file: !182, line: 764, baseType: !159, size: 32, offset: 2336)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !183, file: !182, line: 765, baseType: !369, size: 368, offset: 2368)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 368, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 46)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !183, file: !182, line: 766, baseType: !159, size: 32, offset: 2752)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !183, file: !182, line: 767, baseType: !374, size: 256, offset: 2816)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !182, line: 673, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !182, line: 665, size: 256, elements: !376)
!376 = !{!377, !385, !386, !387, !388}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !375, file: !182, line: 666, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !182, line: 663, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !182, line: 659, size: 192, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !380, file: !182, line: 660, baseType: !308, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !380, file: !182, line: 661, baseType: !159, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !380, file: !182, line: 662, baseType: !310, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !375, file: !182, line: 667, baseType: !159, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !375, file: !182, line: 668, baseType: !159, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !375, file: !182, line: 671, baseType: !159, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !375, file: !182, line: 672, baseType: !342, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !183, file: !182, line: 768, baseType: !159, size: 32, offset: 3072)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !183, file: !182, line: 769, baseType: !391, size: 704, offset: 3136)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !182, line: 703, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !182, line: 677, size: 704, elements: !393)
!393 = !{!394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !392, file: !182, line: 679, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !182, line: 52, baseType: !261)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !392, file: !182, line: 683, baseType: !193, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !392, file: !182, line: 685, baseType: !292, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !392, file: !182, line: 689, baseType: !76, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !392, file: !182, line: 690, baseType: !292, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !392, file: !182, line: 691, baseType: !292, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !392, file: !182, line: 692, baseType: !395, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !392, file: !182, line: 692, baseType: !395, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !392, file: !182, line: 693, baseType: !159, size: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !392, file: !182, line: 696, baseType: !159, size: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !392, file: !182, line: 697, baseType: !261, size: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !392, file: !182, line: 700, baseType: !9, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !183, file: !182, line: 770, baseType: !261, size: 64, offset: 3840)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !183, file: !182, line: 771, baseType: !263, size: 64, offset: 3904)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !183, file: !182, line: 772, baseType: !193, size: 64, offset: 3968)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !183, file: !182, line: 773, baseType: !263, size: 64, offset: 4032)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !183, file: !182, line: 774, baseType: !302, size: 64, offset: 4096)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !183, file: !182, line: 775, baseType: !269, size: 64, offset: 4160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !183, file: !182, line: 778, baseType: !159, size: 32, offset: 4224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !183, file: !182, line: 779, baseType: !415, size: 131072, offset: 4256)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 131072, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 16384)
!418 = !{!419, !420, !421, !422}
!419 = !DILocalVariable(name: "c", arg: 1, scope: !177, file: !1, line: 93, type: !180)
!420 = !DILocalVariable(name: "argv", arg: 2, scope: !177, file: !1, line: 93, type: !308)
!421 = !DILocalVariable(name: "xy", arg: 3, scope: !177, file: !1, line: 93, type: !160)
!422 = !DILocalVariable(name: "i", scope: !177, file: !1, line: 94, type: !159)
!423 = !DILocation(line: 93, column: 35, scope: !177)
!424 = !DILocation(line: 93, column: 45, scope: !177)
!425 = !DILocation(line: 93, column: 59, scope: !177)
!426 = !DILocation(line: 94, column: 9, scope: !177)
!427 = !DILocation(line: 96, column: 43, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 96, column: 13)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 95, column: 29)
!430 = distinct !DILexicalBlock(scope: !431, file: !1, line: 95, column: 5)
!431 = distinct !DILexicalBlock(scope: !177, file: !1, line: 95, column: 5)
!432 = !{!89, !89, i64 0}
!433 = !DILocation(line: 96, column: 13, scope: !428)
!434 = !DILocation(line: 96, column: 66, scope: !428)
!435 = !DILocation(line: 96, column: 13, scope: !429)
!436 = !DILocation(line: 96, column: 55, scope: !428)
!437 = !DILocation(line: 102, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !177, file: !1, line: 101, column: 9)
!439 = !{!146, !146, i64 0}
!440 = !DILocation(line: 102, column: 15, scope: !438)
!441 = !DILocation(line: 102, column: 39, scope: !438)
!442 = !DILocation(line: 102, column: 30, scope: !438)
!443 = !DILocation(line: 103, column: 37, scope: !444)
!444 = distinct !DILexicalBlock(scope: !438, file: !1, line: 102, column: 54)
!445 = !DILocation(line: 104, column: 62, scope: !444)
!446 = !DILocation(line: 104, column: 68, scope: !444)
!447 = !DILocation(line: 103, column: 24, scope: !444)
!448 = !DILocation(line: 103, column: 9, scope: !444)
!449 = !DILocation(line: 105, column: 9, scope: !444)
!450 = !DILocation(line: 0, scope: !177)
!451 = !DILocation(line: 108, column: 1, scope: !177)
!452 = !DILocation(line: 101, column: 9, scope: !438)
!453 = !DILocation(line: 101, column: 15, scope: !438)
!454 = !DILocation(line: 101, column: 39, scope: !438)
!455 = !DILocation(line: 101, column: 30, scope: !438)
!456 = distinct !DISubprogram(name: "longLatFromMember", scope: !1, file: !1, line: 113, type: !457, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{!159, !292, !292, !160}
!459 = !{!460, !461, !462, !463}
!460 = !DILocalVariable(name: "zobj", arg: 1, scope: !456, file: !1, line: 113, type: !292)
!461 = !DILocalVariable(name: "member", arg: 2, scope: !456, file: !1, line: 113, type: !292)
!462 = !DILocalVariable(name: "xy", arg: 3, scope: !456, file: !1, line: 113, type: !160)
!463 = !DILocalVariable(name: "score", scope: !456, file: !1, line: 114, type: !69)
!464 = !DILocation(line: 113, column: 29, scope: !456)
!465 = !DILocation(line: 113, column: 41, scope: !456)
!466 = !DILocation(line: 113, column: 57, scope: !456)
!467 = !DILocation(line: 114, column: 5, scope: !456)
!468 = !DILocation(line: 114, column: 12, scope: !456)
!469 = !DILocation(line: 116, column: 33, scope: !470)
!470 = distinct !DILexicalBlock(scope: !456, file: !1, line: 116, column: 9)
!471 = !{!472, !89, i64 8}
!472 = !{!"redisObject", !473, i64 0, !473, i64 0, !473, i64 1, !473, i64 4, !89, i64 8}
!473 = !{!"int", !90, i64 0}
!474 = !DILocation(line: 116, column: 9, scope: !470)
!475 = !DILocation(line: 116, column: 46, scope: !470)
!476 = !DILocation(line: 116, column: 9, scope: !456)
!477 = !DILocation(line: 117, column: 24, scope: !478)
!478 = distinct !DILexicalBlock(scope: !456, file: !1, line: 117, column: 9)
!479 = !DILocation(line: 85, column: 26, scope: !156, inlinedAt: !480)
!480 = distinct !DILocation(line: 117, column: 10, scope: !478)
!481 = !DILocation(line: 85, column: 40, scope: !156, inlinedAt: !480)
!482 = !DILocation(line: 86, column: 34, scope: !156, inlinedAt: !480)
!483 = !DILocation(line: 86, column: 17, scope: !156, inlinedAt: !480)
!484 = !DILocation(line: 87, column: 12, scope: !156, inlinedAt: !480)
!485 = !DILocation(line: 87, column: 5, scope: !156, inlinedAt: !480)
!486 = !DILocation(line: 117, column: 10, scope: !478)
!487 = !DILocation(line: 117, column: 36, scope: !478)
!488 = !DILocation(line: 0, scope: !478)
!489 = !DILocation(line: 119, column: 1, scope: !456)
!490 = distinct !DISubprogram(name: "extractUnitOrReply", scope: !1, file: !1, line: 127, type: !491, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{!69, !180, !292}
!493 = !{!494, !495, !496}
!494 = !DILocalVariable(name: "c", arg: 1, scope: !490, file: !1, line: 127, type: !180)
!495 = !DILocalVariable(name: "unit", arg: 2, scope: !490, file: !1, line: 127, type: !292)
!496 = !DILocalVariable(name: "u", scope: !490, file: !1, line: 128, type: !74)
!497 = !DILocation(line: 127, column: 35, scope: !490)
!498 = !DILocation(line: 127, column: 44, scope: !490)
!499 = !DILocation(line: 128, column: 21, scope: !490)
!500 = !DILocation(line: 128, column: 11, scope: !490)
!501 = !DILocation(line: 130, column: 10, scope: !502)
!502 = distinct !DILexicalBlock(scope: !490, file: !1, line: 130, column: 9)
!503 = !DILocation(line: 130, column: 9, scope: !490)
!504 = !DILocation(line: 132, column: 17, scope: !505)
!505 = distinct !DILexicalBlock(scope: !502, file: !1, line: 132, column: 16)
!506 = !DILocation(line: 132, column: 16, scope: !502)
!507 = !DILocation(line: 134, column: 17, scope: !508)
!508 = distinct !DILexicalBlock(scope: !505, file: !1, line: 134, column: 16)
!509 = !DILocation(line: 134, column: 16, scope: !505)
!510 = !DILocation(line: 136, column: 17, scope: !511)
!511 = distinct !DILexicalBlock(scope: !508, file: !1, line: 136, column: 16)
!512 = !DILocation(line: 136, column: 16, scope: !508)
!513 = !DILocation(line: 139, column: 9, scope: !514)
!514 = distinct !DILexicalBlock(scope: !511, file: !1, line: 138, column: 12)
!515 = !DILocation(line: 141, column: 9, scope: !514)
!516 = !DILocation(line: 0, scope: !517)
!517 = distinct !DILexicalBlock(scope: !502, file: !1, line: 130, column: 26)
!518 = !DILocation(line: 143, column: 1, scope: !490)
!519 = distinct !DISubprogram(name: "extractDistanceOrReply", scope: !1, file: !1, line: 152, type: !520, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!69, !180, !308, !160}
!522 = !{!523, !524, !525, !526, !527}
!523 = !DILocalVariable(name: "c", arg: 1, scope: !519, file: !1, line: 152, type: !180)
!524 = !DILocalVariable(name: "argv", arg: 2, scope: !519, file: !1, line: 152, type: !308)
!525 = !DILocalVariable(name: "conversion", arg: 3, scope: !519, file: !1, line: 153, type: !160)
!526 = !DILocalVariable(name: "distance", scope: !519, file: !1, line: 154, type: !69)
!527 = !DILocalVariable(name: "to_meters", scope: !519, file: !1, line: 165, type: !69)
!528 = !DILocation(line: 152, column: 39, scope: !519)
!529 = !DILocation(line: 152, column: 49, scope: !519)
!530 = !DILocation(line: 153, column: 46, scope: !519)
!531 = !DILocation(line: 154, column: 5, scope: !519)
!532 = !DILocation(line: 155, column: 39, scope: !533)
!533 = distinct !DILexicalBlock(scope: !519, file: !1, line: 155, column: 9)
!534 = !DILocation(line: 154, column: 12, scope: !519)
!535 = !DILocation(line: 155, column: 9, scope: !533)
!536 = !DILocation(line: 156, column: 59, scope: !533)
!537 = !DILocation(line: 155, column: 9, scope: !519)
!538 = !DILocation(line: 160, column: 9, scope: !539)
!539 = distinct !DILexicalBlock(scope: !519, file: !1, line: 160, column: 9)
!540 = !DILocation(line: 160, column: 18, scope: !539)
!541 = !DILocation(line: 160, column: 9, scope: !519)
!542 = !DILocation(line: 161, column: 9, scope: !543)
!543 = distinct !DILexicalBlock(scope: !539, file: !1, line: 160, column: 23)
!544 = !DILocation(line: 162, column: 9, scope: !543)
!545 = !DILocation(line: 165, column: 45, scope: !519)
!546 = !DILocation(line: 127, column: 35, scope: !490, inlinedAt: !547)
!547 = distinct !DILocation(line: 165, column: 24, scope: !519)
!548 = !DILocation(line: 127, column: 44, scope: !490, inlinedAt: !547)
!549 = !DILocation(line: 128, column: 21, scope: !490, inlinedAt: !547)
!550 = !DILocation(line: 128, column: 11, scope: !490, inlinedAt: !547)
!551 = !DILocation(line: 130, column: 10, scope: !502, inlinedAt: !547)
!552 = !DILocation(line: 130, column: 9, scope: !490, inlinedAt: !547)
!553 = !DILocation(line: 132, column: 17, scope: !505, inlinedAt: !547)
!554 = !DILocation(line: 132, column: 16, scope: !502, inlinedAt: !547)
!555 = !DILocation(line: 134, column: 17, scope: !508, inlinedAt: !547)
!556 = !DILocation(line: 134, column: 16, scope: !505, inlinedAt: !547)
!557 = !DILocation(line: 136, column: 17, scope: !511, inlinedAt: !547)
!558 = !DILocation(line: 136, column: 16, scope: !508, inlinedAt: !547)
!559 = !DILocation(line: 139, column: 9, scope: !514, inlinedAt: !547)
!560 = !DILocation(line: 143, column: 1, scope: !490, inlinedAt: !547)
!561 = !DILocation(line: 165, column: 12, scope: !519)
!562 = !DILocation(line: 166, column: 9, scope: !519)
!563 = !DILocation(line: 170, column: 9, scope: !564)
!564 = distinct !DILexicalBlock(scope: !519, file: !1, line: 170, column: 9)
!565 = !DILocation(line: 170, column: 9, scope: !519)
!566 = !DILocation(line: 170, column: 33, scope: !564)
!567 = !DILocation(line: 170, column: 21, scope: !564)
!568 = !DILocation(line: 171, column: 12, scope: !519)
!569 = !DILocation(line: 171, column: 21, scope: !519)
!570 = !DILocation(line: 171, column: 5, scope: !519)
!571 = !DILocation(line: 0, scope: !572)
!572 = distinct !DILexicalBlock(scope: !573, file: !1, line: 166, column: 24)
!573 = distinct !DILexicalBlock(scope: !519, file: !1, line: 166, column: 9)
!574 = !DILocation(line: 172, column: 1, scope: !519)
!575 = distinct !DISubprogram(name: "addReplyDoubleDistance", scope: !1, file: !1, line: 179, type: !576, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !180, !69}
!578 = !{!579, !580, !581, !585}
!579 = !DILocalVariable(name: "c", arg: 1, scope: !575, file: !1, line: 179, type: !180)
!580 = !DILocalVariable(name: "d", arg: 2, scope: !575, file: !1, line: 179, type: !69)
!581 = !DILocalVariable(name: "dbuf", scope: !575, file: !1, line: 180, type: !582)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 128)
!585 = !DILocalVariable(name: "dlen", scope: !575, file: !1, line: 181, type: !159)
!586 = !DILocation(line: 179, column: 37, scope: !575)
!587 = !DILocation(line: 179, column: 47, scope: !575)
!588 = !DILocation(line: 180, column: 5, scope: !575)
!589 = !DILocation(line: 180, column: 10, scope: !575)
!590 = !DILocation(line: 181, column: 16, scope: !575)
!591 = !DILocation(line: 181, column: 9, scope: !575)
!592 = !DILocation(line: 182, column: 34, scope: !575)
!593 = !DILocation(line: 182, column: 5, scope: !575)
!594 = !DILocation(line: 183, column: 1, scope: !575)
!595 = distinct !DISubprogram(name: "geoAppendIfWithinRadius", scope: !1, file: !1, line: 191, type: !596, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!159, !59, !69, !69, !69, !69, !302}
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !608}
!599 = !DILocalVariable(name: "ga", arg: 1, scope: !595, file: !1, line: 191, type: !59)
!600 = !DILocalVariable(name: "lon", arg: 2, scope: !595, file: !1, line: 191, type: !69)
!601 = !DILocalVariable(name: "lat", arg: 3, scope: !595, file: !1, line: 191, type: !69)
!602 = !DILocalVariable(name: "radius", arg: 4, scope: !595, file: !1, line: 191, type: !69)
!603 = !DILocalVariable(name: "score", arg: 5, scope: !595, file: !1, line: 191, type: !69)
!604 = !DILocalVariable(name: "member", arg: 6, scope: !595, file: !1, line: 191, type: !302)
!605 = !DILocalVariable(name: "distance", scope: !595, file: !1, line: 192, type: !69)
!606 = !DILocalVariable(name: "xy", scope: !595, file: !1, line: 192, type: !607)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !251)
!608 = !DILocalVariable(name: "gp", scope: !595, file: !1, line: 204, type: !100)
!609 = !DILocation(line: 191, column: 39, scope: !595)
!610 = !DILocation(line: 191, column: 50, scope: !595)
!611 = !DILocation(line: 191, column: 62, scope: !595)
!612 = !DILocation(line: 191, column: 74, scope: !595)
!613 = !DILocation(line: 191, column: 89, scope: !595)
!614 = !DILocation(line: 191, column: 100, scope: !595)
!615 = !DILocation(line: 192, column: 5, scope: !595)
!616 = !DILocation(line: 192, column: 22, scope: !595)
!617 = !DILocation(line: 194, column: 30, scope: !618)
!618 = distinct !DILexicalBlock(scope: !595, file: !1, line: 194, column: 9)
!619 = !DILocation(line: 85, column: 26, scope: !156, inlinedAt: !620)
!620 = distinct !DILocation(line: 194, column: 10, scope: !618)
!621 = !DILocation(line: 85, column: 40, scope: !156, inlinedAt: !620)
!622 = !DILocation(line: 86, column: 34, scope: !156, inlinedAt: !620)
!623 = !DILocation(line: 86, column: 17, scope: !156, inlinedAt: !620)
!624 = !DILocation(line: 87, column: 12, scope: !156, inlinedAt: !620)
!625 = !DILocation(line: 87, column: 5, scope: !156, inlinedAt: !620)
!626 = !DILocation(line: 194, column: 10, scope: !618)
!627 = !DILocation(line: 194, column: 9, scope: !595)
!628 = !DILocation(line: 197, column: 53, scope: !629)
!629 = distinct !DILexicalBlock(scope: !595, file: !1, line: 197, column: 9)
!630 = !DILocation(line: 197, column: 60, scope: !629)
!631 = !DILocation(line: 192, column: 12, scope: !595)
!632 = !DILocation(line: 197, column: 10, scope: !629)
!633 = !DILocation(line: 197, column: 9, scope: !595)
!634 = !DILocation(line: 64, column: 36, scope: !97, inlinedAt: !635)
!635 = distinct !DILocation(line: 204, column: 20, scope: !595)
!636 = !DILocation(line: 65, column: 13, scope: !107, inlinedAt: !635)
!637 = !DILocation(line: 65, column: 25, scope: !107, inlinedAt: !635)
!638 = !DILocation(line: 65, column: 18, scope: !107, inlinedAt: !635)
!639 = !DILocation(line: 65, column: 9, scope: !97, inlinedAt: !635)
!640 = !DILocation(line: 69, column: 24, scope: !97, inlinedAt: !635)
!641 = !DILocation(line: 66, column: 36, scope: !115, inlinedAt: !635)
!642 = !DILocation(line: 66, column: 59, scope: !115, inlinedAt: !635)
!643 = !DILocation(line: 66, column: 23, scope: !115, inlinedAt: !635)
!644 = !DILocation(line: 66, column: 21, scope: !115, inlinedAt: !635)
!645 = !DILocation(line: 67, column: 34, scope: !115, inlinedAt: !635)
!646 = !DILocation(line: 67, column: 56, scope: !115, inlinedAt: !635)
!647 = !DILocation(line: 67, column: 21, scope: !115, inlinedAt: !635)
!648 = !DILocation(line: 67, column: 19, scope: !115, inlinedAt: !635)
!649 = !DILocation(line: 68, column: 5, scope: !115, inlinedAt: !635)
!650 = !DILocation(line: 69, column: 34, scope: !97, inlinedAt: !635)
!651 = !DILocation(line: 69, column: 29, scope: !97, inlinedAt: !635)
!652 = !DILocation(line: 69, column: 15, scope: !97, inlinedAt: !635)
!653 = !DILocation(line: 70, column: 13, scope: !97, inlinedAt: !635)
!654 = !DILocation(line: 71, column: 5, scope: !97, inlinedAt: !635)
!655 = !DILocation(line: 204, column: 15, scope: !595)
!656 = !DILocation(line: 205, column: 21, scope: !595)
!657 = !DILocation(line: 205, column: 19, scope: !595)
!658 = !{!145, !146, i64 0}
!659 = !DILocation(line: 206, column: 20, scope: !595)
!660 = !DILocation(line: 206, column: 9, scope: !595)
!661 = !DILocation(line: 206, column: 18, scope: !595)
!662 = !{!145, !146, i64 8}
!663 = !DILocation(line: 207, column: 16, scope: !595)
!664 = !DILocation(line: 207, column: 9, scope: !595)
!665 = !DILocation(line: 207, column: 14, scope: !595)
!666 = !{!145, !146, i64 16}
!667 = !DILocation(line: 208, column: 9, scope: !595)
!668 = !DILocation(line: 208, column: 16, scope: !595)
!669 = !DILocation(line: 209, column: 9, scope: !595)
!670 = !DILocation(line: 209, column: 15, scope: !595)
!671 = !{!145, !146, i64 24}
!672 = !DILocation(line: 0, scope: !618)
!673 = !DILocation(line: 211, column: 1, scope: !595)
!674 = distinct !DISubprogram(name: "geoGetPointsInRange", scope: !1, file: !1, line: 225, type: !675, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !677)
!675 = !DISubroutineType(types: !676)
!676 = !{!159, !292, !69, !69, !69, !69, !69, !59}
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !693, !694, !695, !699, !700, !701, !702, !703, !704, !705, !734, !735, !738}
!678 = !DILocalVariable(name: "zobj", arg: 1, scope: !674, file: !1, line: 225, type: !292)
!679 = !DILocalVariable(name: "min", arg: 2, scope: !674, file: !1, line: 225, type: !69)
!680 = !DILocalVariable(name: "max", arg: 3, scope: !674, file: !1, line: 225, type: !69)
!681 = !DILocalVariable(name: "lon", arg: 4, scope: !674, file: !1, line: 225, type: !69)
!682 = !DILocalVariable(name: "lat", arg: 5, scope: !674, file: !1, line: 225, type: !69)
!683 = !DILocalVariable(name: "radius", arg: 6, scope: !674, file: !1, line: 225, type: !69)
!684 = !DILocalVariable(name: "ga", arg: 7, scope: !674, file: !1, line: 225, type: !59)
!685 = !DILocalVariable(name: "range", scope: !674, file: !1, line: 228, type: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "zrangespec", file: !182, line: 1675, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !182, line: 1672, size: 192, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !687, file: !182, line: 1673, baseType: !69, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !687, file: !182, line: 1673, baseType: !69, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "minex", scope: !687, file: !182, line: 1674, baseType: !159, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "maxex", scope: !687, file: !182, line: 1674, baseType: !159, size: 32, offset: 160)
!693 = !DILocalVariable(name: "origincount", scope: !674, file: !1, line: 229, type: !76)
!694 = !DILocalVariable(name: "member", scope: !674, file: !1, line: 230, type: !302)
!695 = !DILocalVariable(name: "zl", scope: !696, file: !1, line: 233, type: !698)
!696 = distinct !DILexicalBlock(scope: !697, file: !1, line: 232, column: 49)
!697 = distinct !DILexicalBlock(scope: !674, file: !1, line: 232, column: 9)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!699 = !DILocalVariable(name: "eptr", scope: !696, file: !1, line: 234, type: !698)
!700 = !DILocalVariable(name: "sptr", scope: !696, file: !1, line: 234, type: !698)
!701 = !DILocalVariable(name: "vstr", scope: !696, file: !1, line: 235, type: !698)
!702 = !DILocalVariable(name: "vlen", scope: !696, file: !1, line: 236, type: !41)
!703 = !DILocalVariable(name: "vlong", scope: !696, file: !1, line: 237, type: !261)
!704 = !DILocalVariable(name: "score", scope: !696, file: !1, line: 238, type: !69)
!705 = !DILocalVariable(name: "zs", scope: !706, file: !1, line: 262, type: !708)
!706 = distinct !DILexicalBlock(scope: !707, file: !1, line: 261, column: 57)
!707 = distinct !DILexicalBlock(scope: !697, file: !1, line: 261, column: 16)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !182, line: 829, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !182, line: 826, size: 128, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !710, file: !182, line: 827, baseType: !193, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !710, file: !182, line: 828, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !182, line: 824, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !182, line: 820, size: 256, elements: !717)
!717 = !{!718, !731, !732, !733}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !716, file: !182, line: 821, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !182, line: 810, size: 192, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !720, file: !182, line: 811, baseType: !302, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !720, file: !182, line: 812, baseType: !69, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !720, file: !182, line: 813, baseType: !719, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !720, file: !182, line: 817, baseType: !726, offset: 192)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, elements: !23)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !182, line: 814, size: 128, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !727, file: !182, line: 815, baseType: !719, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !727, file: !182, line: 816, baseType: !8, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !716, file: !182, line: 821, baseType: !719, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !716, file: !182, line: 822, baseType: !8, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !716, file: !182, line: 823, baseType: !159, size: 32, offset: 192)
!734 = !DILocalVariable(name: "zsl", scope: !706, file: !1, line: 263, type: !714)
!735 = !DILocalVariable(name: "ln", scope: !706, file: !1, line: 264, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplistNode", file: !182, line: 818, baseType: !720)
!738 = !DILocalVariable(name: "ele", scope: !739, file: !1, line: 272, type: !302)
!739 = distinct !DILexicalBlock(scope: !706, file: !1, line: 271, column: 20)
!740 = !DILocation(line: 225, column: 31, scope: !674)
!741 = !DILocation(line: 225, column: 44, scope: !674)
!742 = !DILocation(line: 225, column: 56, scope: !674)
!743 = !DILocation(line: 225, column: 68, scope: !674)
!744 = !DILocation(line: 225, column: 80, scope: !674)
!745 = !DILocation(line: 225, column: 92, scope: !674)
!746 = !DILocation(line: 225, column: 110, scope: !674)
!747 = !DILocation(line: 228, column: 5, scope: !674)
!748 = !DILocation(line: 228, column: 24, scope: !674)
!749 = !{!750, !146, i64 0}
!750 = !{!"", !146, i64 0, !146, i64 8, !473, i64 16, !473, i64 20}
!751 = !{!750, !146, i64 8}
!752 = !{!750, !473, i64 16}
!753 = !{!750, !473, i64 20}
!754 = !DILocation(line: 229, column: 30, scope: !674)
!755 = !DILocation(line: 229, column: 12, scope: !674)
!756 = !DILocation(line: 232, column: 15, scope: !697)
!757 = !DILocation(line: 232, column: 9, scope: !674)
!758 = !DILocation(line: 233, column: 35, scope: !696)
!759 = !DILocation(line: 233, column: 24, scope: !696)
!760 = !DILocation(line: 234, column: 9, scope: !696)
!761 = !DILocation(line: 235, column: 9, scope: !696)
!762 = !DILocation(line: 235, column: 24, scope: !696)
!763 = !DILocation(line: 236, column: 9, scope: !696)
!764 = !DILocation(line: 236, column: 22, scope: !696)
!765 = !{!473, !473, i64 0}
!766 = !DILocation(line: 237, column: 9, scope: !696)
!767 = !DILocation(line: 237, column: 19, scope: !696)
!768 = !{!769, !769, i64 0}
!769 = !{!"long long", !90, i64 0}
!770 = !DILocation(line: 238, column: 16, scope: !696)
!771 = !DILocation(line: 228, column: 16, scope: !674)
!772 = !DILocation(line: 240, column: 21, scope: !773)
!773 = distinct !DILexicalBlock(scope: !696, file: !1, line: 240, column: 13)
!774 = !DILocation(line: 234, column: 24, scope: !696)
!775 = !DILocation(line: 240, column: 19, scope: !773)
!776 = !DILocation(line: 240, column: 50, scope: !773)
!777 = !DILocation(line: 240, column: 13, scope: !696)
!778 = !DILocation(line: 245, column: 16, scope: !696)
!779 = !DILocation(line: 234, column: 31, scope: !696)
!780 = !DILocation(line: 245, column: 14, scope: !696)
!781 = !DILocation(line: 247, column: 21, scope: !782)
!782 = distinct !DILexicalBlock(scope: !696, file: !1, line: 246, column: 22)
!783 = !DILocation(line: 250, column: 18, scope: !784)
!784 = distinct !DILexicalBlock(scope: !782, file: !1, line: 250, column: 17)
!785 = !DILocation(line: 250, column: 17, scope: !782)
!786 = !DILocation(line: 254, column: 24, scope: !782)
!787 = !DILocation(line: 254, column: 13, scope: !782)
!788 = !DILocation(line: 255, column: 23, scope: !782)
!789 = !DILocation(line: 255, column: 28, scope: !782)
!790 = !DILocation(line: 255, column: 22, scope: !782)
!791 = !DILocation(line: 255, column: 55, scope: !782)
!792 = !DILocation(line: 255, column: 39, scope: !782)
!793 = !DILocation(line: 256, column: 54, scope: !782)
!794 = !DILocation(line: 256, column: 39, scope: !782)
!795 = !DILocation(line: 230, column: 9, scope: !674)
!796 = !DILocation(line: 257, column: 17, scope: !797)
!797 = distinct !DILexicalBlock(scope: !782, file: !1, line: 257, column: 17)
!798 = !DILocation(line: 258, column: 17, scope: !797)
!799 = !DILocation(line: 257, column: 17, scope: !782)
!800 = !DILocation(line: 258, column: 27, scope: !797)
!801 = !DILocation(line: 259, column: 13, scope: !782)
!802 = !DILocation(line: 246, column: 16, scope: !696)
!803 = !DILocation(line: 246, column: 9, scope: !696)
!804 = distinct !{!804, !803, !805}
!805 = !DILocation(line: 260, column: 9, scope: !696)
!806 = !DILocation(line: 247, column: 33, scope: !782)
!807 = !DILocation(line: 261, column: 5, scope: !697)
!808 = !DILocation(line: 262, column: 26, scope: !706)
!809 = !DILocation(line: 262, column: 15, scope: !706)
!810 = !DILocation(line: 263, column: 30, scope: !706)
!811 = !{!812, !89, i64 8}
!812 = !{!"zset", !89, i64 0, !89, i64 8}
!813 = !DILocation(line: 263, column: 20, scope: !706)
!814 = !DILocation(line: 266, column: 19, scope: !815)
!815 = distinct !DILexicalBlock(scope: !706, file: !1, line: 266, column: 13)
!816 = !DILocation(line: 264, column: 24, scope: !706)
!817 = !DILocation(line: 266, column: 49, scope: !815)
!818 = !DILocation(line: 266, column: 13, scope: !706)
!819 = !DILocation(line: 0, scope: !739)
!820 = !DILocation(line: 272, column: 27, scope: !739)
!821 = !DILocation(line: 272, column: 17, scope: !739)
!822 = !DILocation(line: 274, column: 37, scope: !823)
!823 = distinct !DILexicalBlock(scope: !739, file: !1, line: 274, column: 17)
!824 = !DILocation(line: 274, column: 18, scope: !823)
!825 = !DILocation(line: 274, column: 17, scope: !739)
!826 = !DILocation(line: 277, column: 19, scope: !739)
!827 = !DILocation(line: 278, column: 63, scope: !828)
!828 = distinct !DILexicalBlock(scope: !739, file: !1, line: 278, column: 17)
!829 = !DILocation(line: 278, column: 17, scope: !828)
!830 = !DILocation(line: 279, column: 17, scope: !828)
!831 = !DILocation(line: 278, column: 17, scope: !739)
!832 = !DILocation(line: 279, column: 27, scope: !828)
!833 = !DILocation(line: 280, column: 31, scope: !739)
!834 = !{!835, !89, i64 0}
!835 = !{!"zskiplistLevel", !89, i64 0, !92, i64 8}
!836 = !DILocation(line: 271, column: 9, scope: !706)
!837 = distinct !{!837, !836, !838}
!838 = !DILocation(line: 281, column: 9, scope: !706)
!839 = !DILocation(line: 283, column: 16, scope: !674)
!840 = !DILocation(line: 283, column: 21, scope: !674)
!841 = !DILocation(line: 283, column: 12, scope: !674)
!842 = !DILocation(line: 283, column: 5, scope: !674)
!843 = !DILocation(line: 0, scope: !844)
!844 = distinct !DILexicalBlock(scope: !815, file: !1, line: 266, column: 58)
!845 = !DILocation(line: 284, column: 1, scope: !674)
!846 = distinct !DISubprogram(name: "scoresOfGeoHashBox", scope: !1, file: !1, line: 289, type: !847, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !852)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !165, !849, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashFix52Bits", file: !851, line: 41, baseType: !4)
!851 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.h", directory: "/root/.unikraft/apps/redis/build")
!852 = !{!853, !854, !855}
!853 = !DILocalVariable(name: "hash", arg: 1, scope: !846, file: !1, line: 289, type: !165)
!854 = !DILocalVariable(name: "min", arg: 2, scope: !846, file: !1, line: 289, type: !849)
!855 = !DILocalVariable(name: "max", arg: 3, scope: !846, file: !1, line: 289, type: !849)
!856 = !DILocation(line: 289, column: 37, scope: !846)
!857 = !DILocation(line: 289, column: 61, scope: !846)
!858 = !DILocation(line: 289, column: 84, scope: !846)
!859 = !DILocation(line: 310, column: 12, scope: !846)
!860 = !DILocation(line: 310, column: 10, scope: !846)
!861 = !DILocation(line: 311, column: 14, scope: !846)
!862 = !DILocation(line: 312, column: 12, scope: !846)
!863 = !DILocation(line: 312, column: 10, scope: !846)
!864 = !DILocation(line: 313, column: 1, scope: !846)
!865 = distinct !DISubprogram(name: "membersOfGeoHashBox", scope: !1, file: !1, line: 318, type: !866, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{!159, !292, !165, !59, !69, !69, !69}
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876}
!869 = !DILocalVariable(name: "zobj", arg: 1, scope: !865, file: !1, line: 318, type: !292)
!870 = !DILocalVariable(name: "hash", arg: 2, scope: !865, file: !1, line: 318, type: !165)
!871 = !DILocalVariable(name: "ga", arg: 3, scope: !865, file: !1, line: 318, type: !59)
!872 = !DILocalVariable(name: "lon", arg: 4, scope: !865, file: !1, line: 318, type: !69)
!873 = !DILocalVariable(name: "lat", arg: 5, scope: !865, file: !1, line: 318, type: !69)
!874 = !DILocalVariable(name: "radius", arg: 6, scope: !865, file: !1, line: 318, type: !69)
!875 = !DILocalVariable(name: "min", scope: !865, file: !1, line: 319, type: !850)
!876 = !DILocalVariable(name: "max", scope: !865, file: !1, line: 319, type: !850)
!877 = !DILocation(line: 318, column: 49, scope: !865)
!878 = !DILocation(line: 318, column: 31, scope: !865)
!879 = !DILocation(line: 318, column: 65, scope: !865)
!880 = !DILocation(line: 318, column: 76, scope: !865)
!881 = !DILocation(line: 318, column: 88, scope: !865)
!882 = !DILocation(line: 318, column: 100, scope: !865)
!883 = !DILocation(line: 289, column: 37, scope: !846, inlinedAt: !884)
!884 = distinct !DILocation(line: 321, column: 5, scope: !865)
!885 = !DILocation(line: 310, column: 12, scope: !846, inlinedAt: !884)
!886 = !DILocation(line: 311, column: 14, scope: !846, inlinedAt: !884)
!887 = !DILocation(line: 312, column: 12, scope: !846, inlinedAt: !884)
!888 = !DILocation(line: 313, column: 1, scope: !846, inlinedAt: !884)
!889 = !DILocation(line: 319, column: 22, scope: !865)
!890 = !DILocation(line: 322, column: 38, scope: !865)
!891 = !DILocation(line: 319, column: 27, scope: !865)
!892 = !DILocation(line: 322, column: 43, scope: !865)
!893 = !DILocation(line: 322, column: 12, scope: !865)
!894 = !DILocation(line: 322, column: 5, scope: !865)
!895 = distinct !DISubprogram(name: "membersOfAllNeighbors", scope: !1, file: !1, line: 326, type: !896, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !926)
!896 = !DISubroutineType(types: !897)
!897 = !{!159, !292, !898, !69, !69, !69, !59}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRadius", file: !851, line: 48, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !851, line: 44, size: 1536, elements: !900)
!900 = !{!901, !902, !914}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !899, file: !851, line: 45, baseType: !165, size: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !899, file: !851, line: 46, baseType: !903, size: 384, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashArea", file: !166, line: 80, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 76, size: 384, elements: !905)
!905 = !{!906, !907, !913}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !904, file: !166, line: 77, baseType: !165, size: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !904, file: !166, line: 78, baseType: !908, size: 128, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRange", file: !166, line: 74, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 71, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !909, file: !166, line: 72, baseType: !69, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !909, file: !166, line: 73, baseType: !69, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !904, file: !166, line: 79, baseType: !908, size: 128, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !899, file: !851, line: 47, baseType: !915, size: 1024, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashNeighbors", file: !166, line: 91, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 82, size: 1024, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "north", scope: !916, file: !166, line: 83, baseType: !165, size: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "east", scope: !916, file: !166, line: 84, baseType: !165, size: 128, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "west", scope: !916, file: !166, line: 85, baseType: !165, size: 128, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "south", scope: !916, file: !166, line: 86, baseType: !165, size: 128, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "north_east", scope: !916, file: !166, line: 87, baseType: !165, size: 128, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "south_east", scope: !916, file: !166, line: 88, baseType: !165, size: 128, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "north_west", scope: !916, file: !166, line: 89, baseType: !165, size: 128, offset: 768)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "south_west", scope: !916, file: !166, line: 90, baseType: !165, size: 128, offset: 896)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !937, !938, !939, !940, !941, !1160, !1163, !1164, !1165, !1167, !1169, !1171, !1173, !1175, !1177}
!927 = !DILocalVariable(name: "zobj", arg: 1, scope: !895, file: !1, line: 326, type: !292)
!928 = !DILocalVariable(name: "n", arg: 2, scope: !895, file: !1, line: 326, type: !898)
!929 = !DILocalVariable(name: "lon", arg: 3, scope: !895, file: !1, line: 326, type: !69)
!930 = !DILocalVariable(name: "lat", arg: 4, scope: !895, file: !1, line: 326, type: !69)
!931 = !DILocalVariable(name: "radius", arg: 5, scope: !895, file: !1, line: 326, type: !69)
!932 = !DILocalVariable(name: "ga", arg: 6, scope: !895, file: !1, line: 326, type: !59)
!933 = !DILocalVariable(name: "neighbors", scope: !895, file: !1, line: 327, type: !934)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 1152, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 9)
!937 = !DILocalVariable(name: "i", scope: !895, file: !1, line: 328, type: !41)
!938 = !DILocalVariable(name: "count", scope: !895, file: !1, line: 328, type: !41)
!939 = !DILocalVariable(name: "last_processed", scope: !895, file: !1, line: 328, type: !41)
!940 = !DILocalVariable(name: "debugmsg", scope: !895, file: !1, line: 329, type: !159)
!941 = !DILocalVariable(name: "fp", scope: !942, file: !1, line: 345, type: !949)
!942 = distinct !DILexicalBlock(scope: !943, file: !1, line: 345, column: 27)
!943 = distinct !DILexicalBlock(scope: !944, file: !1, line: 345, column: 17)
!944 = distinct !DILexicalBlock(scope: !945, file: !1, line: 344, column: 39)
!945 = distinct !DILexicalBlock(scope: !946, file: !1, line: 344, column: 13)
!946 = distinct !DILexicalBlock(scope: !947, file: !1, line: 343, column: 66)
!947 = distinct !DILexicalBlock(scope: !948, file: !1, line: 343, column: 5)
!948 = distinct !DILexicalBlock(scope: !895, file: !1, line: 343, column: 5)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !951, line: 66, baseType: !952)
!951 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !953, line: 287, baseType: !954)
!953 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !953, line: 181, size: 1408, elements: !955)
!955 = !{!956, !957, !958, !959, !961, !962, !967, !968, !969, !1128, !1134, !1139, !1143, !1144, !1145, !1146, !1148, !1150, !1151, !1152, !1153, !1154, !1158, !1159}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !954, file: !953, line: 182, baseType: !698, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !954, file: !953, line: 183, baseType: !159, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !954, file: !953, line: 184, baseType: !159, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !954, file: !953, line: 185, baseType: !960, size: 16, offset: 128)
!960 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !954, file: !953, line: 186, baseType: !960, size: 16, offset: 144)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !954, file: !953, line: 187, baseType: !963, size: 128, offset: 192)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !953, line: 117, size: 128, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !963, file: !953, line: 118, baseType: !698, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !963, file: !953, line: 119, baseType: !159, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !954, file: !953, line: 188, baseType: !159, size: 32, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !954, file: !953, line: 195, baseType: !9, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !954, file: !953, line: 197, baseType: !970, size: 64, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !974, !9, !74, !159}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !79, line: 145, baseType: !244)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !953, line: 569, size: 14912, elements: !976)
!976 = !{!977, !978, !980, !981, !982, !983, !987, !988, !991, !992, !996, !1010, !1011, !1012, !1014, !1015, !1016, !1092, !1113, !1114, !1119, !1126}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !975, file: !953, line: 571, baseType: !159, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !975, file: !953, line: 576, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !975, file: !953, line: 576, baseType: !979, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !975, file: !953, line: 576, baseType: !979, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !975, file: !953, line: 578, baseType: !159, size: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !975, file: !953, line: 579, baseType: !984, size: 200, offset: 288)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 200, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 25)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !975, file: !953, line: 582, baseType: !159, size: 32, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !975, file: !953, line: 583, baseType: !989, size: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !953, line: 40, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !975, file: !953, line: 585, baseType: !159, size: 32, offset: 640)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !975, file: !953, line: 587, baseType: !993, size: 64, offset: 704)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !974}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !975, file: !953, line: 590, baseType: !997, size: 64, offset: 768)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !953, line: 47, size: 256, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !998, file: !953, line: 49, baseType: !997, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !998, file: !953, line: 50, baseType: !159, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !998, file: !953, line: 50, baseType: !159, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !998, file: !953, line: 50, baseType: !159, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !998, file: !953, line: 50, baseType: !159, size: 32, offset: 160)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !998, file: !953, line: 51, baseType: !1006, size: 32, offset: 192)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 32, elements: !1008)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !953, line: 25, baseType: !41)
!1008 = !{!1009}
!1009 = !DISubrange(count: 1)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !975, file: !953, line: 591, baseType: !159, size: 32, offset: 832)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !975, file: !953, line: 592, baseType: !997, size: 64, offset: 896)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !975, file: !953, line: 593, baseType: !1013, size: 64, offset: 960)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !975, file: !953, line: 596, baseType: !159, size: 32, offset: 1024)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !975, file: !953, line: 597, baseType: !74, size: 64, offset: 1088)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !975, file: !953, line: 632, baseType: !1017, size: 2880, offset: 1152)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !975, file: !953, line: 599, size: 2880, elements: !1018)
!1018 = !{!1019, !1083}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !1017, file: !953, line: 622, baseType: !1020, size: 1728)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1017, file: !953, line: 601, size: 1728, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1028, !1040, !1041, !1042, !1051, !1066, !1067, !1068, !1072, !1076, !1077, !1078, !1079, !1080, !1081, !1082}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !1020, file: !953, line: 603, baseType: !41, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1020, file: !953, line: 604, baseType: !74, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !1020, file: !953, line: 605, baseType: !1025, size: 208, offset: 128)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 208, elements: !1026)
!1026 = !{!1027}
!1027 = !DISubrange(count: 26)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !1020, file: !953, line: 606, baseType: !1029, size: 288, offset: 352)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !953, line: 55, size: 288, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1029, file: !953, line: 57, baseType: !159, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1029, file: !953, line: 58, baseType: !159, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1029, file: !953, line: 59, baseType: !159, size: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1029, file: !953, line: 60, baseType: !159, size: 32, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1029, file: !953, line: 61, baseType: !159, size: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1029, file: !953, line: 62, baseType: !159, size: 32, offset: 160)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1029, file: !953, line: 63, baseType: !159, size: 32, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1029, file: !953, line: 64, baseType: !159, size: 32, offset: 224)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1029, file: !953, line: 65, baseType: !159, size: 32, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !1020, file: !953, line: 607, baseType: !159, size: 32, offset: 640)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1020, file: !953, line: 608, baseType: !339, size: 64, offset: 704)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !1020, file: !953, line: 609, baseType: !1043, size: 112, offset: 768)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !953, line: 319, size: 112, elements: !1044)
!1044 = !{!1045, !1049, !1050}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1043, file: !953, line: 320, baseType: !1046, size: 48)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 3)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1043, file: !953, line: 321, baseType: !1046, size: 48, offset: 48)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1043, file: !953, line: 322, baseType: !31, size: 16, offset: 96)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1020, file: !953, line: 610, baseType: !1052, size: 64, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !79, line: 171, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 163, size: 64, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1053, file: !79, line: 165, baseType: !159, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1053, file: !79, line: 170, baseType: !1057, size: 32, offset: 32)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1053, file: !79, line: 166, size: 32, elements: !1058)
!1058 = !{!1059, !1062}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1057, file: !79, line: 168, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1061, line: 124, baseType: !41)
!1061 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1057, file: !79, line: 169, baseType: !1063, size: 32)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !1064)
!1064 = !{!1065}
!1065 = !DISubrange(count: 4)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1020, file: !953, line: 611, baseType: !1052, size: 64, offset: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1020, file: !953, line: 612, baseType: !1052, size: 64, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1020, file: !953, line: 613, baseType: !1069, size: 64, offset: 1088)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !1070)
!1070 = !{!1071}
!1071 = !DISubrange(count: 8)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !1020, file: !953, line: 614, baseType: !1073, size: 192, offset: 1152)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 24)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1020, file: !953, line: 615, baseType: !159, size: 32, offset: 1344)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1020, file: !953, line: 616, baseType: !1052, size: 64, offset: 1376)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1020, file: !953, line: 617, baseType: !1052, size: 64, offset: 1440)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1020, file: !953, line: 618, baseType: !1052, size: 64, offset: 1504)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1020, file: !953, line: 619, baseType: !1052, size: 64, offset: 1568)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1020, file: !953, line: 620, baseType: !1052, size: 64, offset: 1632)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !1020, file: !953, line: 621, baseType: !159, size: 32, offset: 1696)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !1017, file: !953, line: 631, baseType: !1084, size: 2880)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1017, file: !953, line: 626, size: 2880, elements: !1085)
!1085 = !{!1086, !1090}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !1084, file: !953, line: 629, baseType: !1087, size: 1920)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 1920, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 30)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !1084, file: !953, line: 630, baseType: !1091, size: 960, offset: 1920)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 960, elements: !1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !975, file: !953, line: 636, baseType: !1093, size: 64, offset: 4032)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !953, line: 93, size: 6336, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1105}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1094, file: !953, line: 94, baseType: !1093, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1094, file: !953, line: 95, baseType: !159, size: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1094, file: !953, line: 97, baseType: !1099, size: 2048, offset: 128)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 2048, elements: !1103)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null}
!1103 = !{!1104}
!1104 = !DISubrange(count: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !1094, file: !953, line: 98, baseType: !1106, size: 4160, offset: 2176)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !953, line: 74, size: 4160, elements: !1107)
!1107 = !{!1108, !1110, !1111, !1112}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1106, file: !953, line: 75, baseType: !1109, size: 2048)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !1103)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1106, file: !953, line: 76, baseType: !1109, size: 2048, offset: 2048)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1106, file: !953, line: 78, baseType: !1007, size: 32, offset: 4096)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1106, file: !953, line: 81, baseType: !1007, size: 32, offset: 4128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !975, file: !953, line: 637, baseType: !1094, size: 6336, offset: 4096)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !975, file: !953, line: 641, baseType: !1115, size: 64, offset: 10432)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{null, !159}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !975, file: !953, line: 646, baseType: !1120, size: 192, offset: 10496)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !953, line: 291, size: 192, elements: !1121)
!1121 = !{!1122, !1124, !1125}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1120, file: !953, line: 293, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !1120, file: !953, line: 294, baseType: !159, size: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !1120, file: !953, line: 295, baseType: !979, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !975, file: !953, line: 648, baseType: !1127, size: 4224, offset: 10688)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 4224, elements: !1047)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !954, file: !953, line: 199, baseType: !1129, size: 64, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!973, !974, !9, !1132, !159}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !954, file: !953, line: 202, baseType: !1135, size: 64, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!1138, !974, !9, !1138, !159}
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !79, line: 114, baseType: !244)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !954, file: !953, line: 203, baseType: !1140, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!159, !974, !9}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !954, file: !953, line: 206, baseType: !963, size: 128, offset: 704)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !954, file: !953, line: 207, baseType: !698, size: 64, offset: 832)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !954, file: !953, line: 208, baseType: !159, size: 32, offset: 896)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !954, file: !953, line: 211, baseType: !1147, size: 24, offset: 928)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !1047)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !954, file: !953, line: 212, baseType: !1149, size: 8, offset: 952)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !1008)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !954, file: !953, line: 215, baseType: !963, size: 128, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !954, file: !953, line: 218, baseType: !159, size: 32, offset: 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !954, file: !953, line: 219, baseType: !355, size: 64, offset: 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !954, file: !953, line: 222, baseType: !974, size: 64, offset: 1216)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !954, file: !953, line: 226, baseType: !1155, size: 32, offset: 1280)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !79, line: 175, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !1157, line: 12, baseType: !159)
