; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GeoHashRadius = type { %struct.GeoHashBits, %struct.GeoHashArea, %struct.GeoHashNeighbors }
%struct.GeoHashBits = type { i64, i8 }
%struct.GeoHashArea = type { %struct.GeoHashBits, %struct.GeoHashRange, %struct.GeoHashRange }
%struct.GeoHashRange = type { double, double }
%struct.GeoHashNeighbors = type { %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits }

@DEG_TO_RAD = dso_local local_unnamed_addr constant double 0x3F91DF46A2529D39, align 8, !dbg !0
@EARTH_RADIUS_IN_METERS = dso_local local_unnamed_addr constant double 0x41584F6F63E51090, align 8, !dbg !6
@MERCATOR_MAX = dso_local local_unnamed_addr constant double 0x41731C05E5EB851F, align 8, !dbg !10
@MERCATOR_MIN = dso_local local_unnamed_addr constant double 0xC1731C05E5EB851F, align 8, !dbg !12
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local zeroext i8 @geohashEstimateStepsByRadius(double, double) local_unnamed_addr #0 !dbg !18 {
  %3 = fcmp oeq double %0, 0.000000e+00, !dbg !33
  br i1 %3, label %31, label %4, !dbg !35


!60 = distinct !DISubprogram(name: "geohashBoundingBox", scope: !3, file: !3, line: 103, type: !61, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !64)
!61 = !DISubroutineType(types: !62)
!62 = !{!30, !9, !9, !9, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!64 = !{!65, !66, !67, !68}
!65 = !DILocalVariable(name: "longitude", arg: 1, scope: !60, file: !3, line: 103, type: !9)
!66 = !DILocalVariable(name: "latitude", arg: 2, scope: !60, file: !3, line: 103, type: !9)
!67 = !DILocalVariable(name: "radius_meters", arg: 3, scope: !60, file: !3, line: 103, type: !9)
!68 = !DILocalVariable(name: "bounds", arg: 4, scope: !60, file: !3, line: 104, type: !63)
!69 = !DILocation(line: 103, column: 31, scope: !60)
!70 = !DILocation(line: 103, column: 49, scope: !60)
!71 = !DILocation(line: 103, column: 66, scope: !60)
!72 = !DILocation(line: 104, column: 32, scope: !60)
!73 = !DILocation(line: 105, column: 10, scope: !74)
!74 = distinct !DILexicalBlock(scope: !60, file: !3, line: 105, column: 9)
!75 = !DILocation(line: 105, column: 9, scope: !60)
!76 = !DILocation(line: 107, column: 50, scope: !60)
!77 = !DILocalVariable(name: "ang", arg: 1, scope: !78, file: !3, line: 57, type: !9)
!78 = distinct !DISubprogram(name: "deg_rad", scope: !3, file: !3, line: 57, type: !79, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{!9, !9}
!81 = !{!77}
!82 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !83)
!83 = distinct !DILocation(line: 107, column: 78, scope: !60)
!84 = !DILocation(line: 57, column: 55, scope: !78, inlinedAt: !83)
!85 = !DILocation(line: 57, column: 44, scope: !78, inlinedAt: !83)
!86 = !DILocation(line: 107, column: 74, scope: !60)
!87 = !DILocation(line: 107, column: 73, scope: !60)
!88 = !DILocalVariable(name: "ang", arg: 1, scope: !89, file: !3, line: 58, type: !9)
!89 = distinct !DISubprogram(name: "rad_deg", scope: !3, file: !3, line: 58, type: !79, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !90)
!90 = !{!88}
!91 = !DILocation(line: 58, column: 37, scope: !89, inlinedAt: !92)
!92 = distinct !DILocation(line: 107, column: 29, scope: !60)
!93 = !DILocation(line: 58, column: 55, scope: !89, inlinedAt: !92)
!94 = !DILocation(line: 58, column: 44, scope: !89, inlinedAt: !92)
!95 = !DILocation(line: 107, column: 27, scope: !60)
!96 = !DILocation(line: 107, column: 15, scope: !60)
!97 = !{!98, !98, i64 0}
!98 = !{!"double", !99, i64 0}
!99 = !{!"omnipotent char", !100, i64 0}
!100 = !{!"Simple C/C++ TBAA"}
!101 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !102)
!102 = distinct !DILocation(line: 108, column: 78, scope: !60)
!103 = !DILocation(line: 57, column: 44, scope: !78, inlinedAt: !102)
!104 = !DILocation(line: 108, column: 74, scope: !60)
!105 = !DILocation(line: 108, column: 73, scope: !60)
!106 = !DILocation(line: 58, column: 37, scope: !89, inlinedAt: !107)
!107 = distinct !DILocation(line: 108, column: 29, scope: !60)
!108 = !DILocation(line: 58, column: 55, scope: !89, inlinedAt: !107)
!109 = !DILocation(line: 58, column: 44, scope: !89, inlinedAt: !107)
!110 = !DILocation(line: 108, column: 27, scope: !60)
!111 = !DILocation(line: 108, column: 5, scope: !60)
!112 = !DILocation(line: 108, column: 15, scope: !60)
!113 = !DILocation(line: 58, column: 37, scope: !89, inlinedAt: !114)
!114 = distinct !DILocation(line: 109, column: 28, scope: !60)
!115 = !DILocation(line: 58, column: 55, scope: !89, inlinedAt: !114)
!116 = !DILocation(line: 58, column: 44, scope: !89, inlinedAt: !114)
!117 = !DILocation(line: 109, column: 26, scope: !60)
!118 = !DILocation(line: 109, column: 5, scope: !60)
!119 = !DILocation(line: 109, column: 15, scope: !60)
!120 = !DILocation(line: 58, column: 37, scope: !89, inlinedAt: !121)
!121 = distinct !DILocation(line: 110, column: 28, scope: !60)
!122 = !DILocation(line: 58, column: 44, scope: !89, inlinedAt: !121)
!123 = !DILocation(line: 110, column: 26, scope: !60)
!124 = !DILocation(line: 110, column: 5, scope: !60)
!125 = !DILocation(line: 110, column: 15, scope: !60)
!126 = !DILocation(line: 111, column: 5, scope: !60)
!127 = !DILocation(line: 0, scope: !74)
!128 = !DILocation(line: 112, column: 1, scope: !60)
!129 = distinct !DISubprogram(name: "geohashGetAreasByRadius", scope: !3, file: !3, line: 116, type: !130, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !170)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !9, !9, !9}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRadius", file: !133, line: 48, baseType: !134)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.h", directory: "/root/.unikraft/apps/redis/build")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 44, size: 1536, elements: !135)
!135 = !{!136, !146, !158}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !134, file: !133, line: 45, baseType: !137, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashBits", file: !138, line: 69, baseType: !139)
!138 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash.h", directory: "/root/.unikraft/apps/redis/build")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 66, size: 128, elements: !140)
!140 = !{!141, !145}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !139, file: !138, line: 67, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 60, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 105, baseType: !144)
!144 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !139, file: !138, line: 68, baseType: !21, size: 8, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !134, file: !133, line: 46, baseType: !147, size: 384, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashArea", file: !138, line: 80, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 76, size: 384, elements: !149)
!149 = !{!150, !151, !157}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !148, file: !138, line: 77, baseType: !137, size: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !148, file: !138, line: 78, baseType: !152, size: 128, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRange", file: !138, line: 74, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 71, size: 128, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !153, file: !138, line: 72, baseType: !9, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !153, file: !138, line: 73, baseType: !9, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !148, file: !138, line: 79, baseType: !152, size: 128, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !134, file: !133, line: 47, baseType: !159, size: 1024, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashNeighbors", file: !138, line: 91, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 82, size: 1024, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "north", scope: !160, file: !138, line: 83, baseType: !137, size: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "east", scope: !160, file: !138, line: 84, baseType: !137, size: 128, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "west", scope: !160, file: !138, line: 85, baseType: !137, size: 128, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "south", scope: !160, file: !138, line: 86, baseType: !137, size: 128, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "north_east", scope: !160, file: !138, line: 87, baseType: !137, size: 128, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "south_east", scope: !160, file: !138, line: 88, baseType: !137, size: 128, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "north_west", scope: !160, file: !138, line: 89, baseType: !137, size: 128, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "south_west", scope: !160, file: !138, line: 90, baseType: !137, size: 128, offset: 896)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !188, !189, !190, !192, !193, !194}
!171 = !DILocalVariable(name: "longitude", arg: 1, scope: !129, file: !3, line: 116, type: !9)
!172 = !DILocalVariable(name: "latitude", arg: 2, scope: !129, file: !3, line: 116, type: !9)
!173 = !DILocalVariable(name: "radius_meters", arg: 3, scope: !129, file: !3, line: 116, type: !9)
!174 = !DILocalVariable(name: "long_range", scope: !129, file: !3, line: 117, type: !152)
!175 = !DILocalVariable(name: "lat_range", scope: !129, file: !3, line: 117, type: !152)
!176 = !DILocalVariable(name: "radius", scope: !129, file: !3, line: 118, type: !132)
!177 = !DILocalVariable(name: "hash", scope: !129, file: !3, line: 119, type: !137)
!178 = !DILocalVariable(name: "neighbors", scope: !129, file: !3, line: 120, type: !159)
!179 = !DILocalVariable(name: "area", scope: !129, file: !3, line: 121, type: !147)
!180 = !DILocalVariable(name: "min_lon", scope: !129, file: !3, line: 122, type: !9)
!181 = !DILocalVariable(name: "max_lon", scope: !129, file: !3, line: 122, type: !9)
!182 = !DILocalVariable(name: "min_lat", scope: !129, file: !3, line: 122, type: !9)
!183 = !DILocalVariable(name: "max_lat", scope: !129, file: !3, line: 122, type: !9)
!184 = !DILocalVariable(name: "bounds", scope: !129, file: !3, line: 123, type: !185)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 4)
!188 = !DILocalVariable(name: "steps", scope: !129, file: !3, line: 124, type: !30)
!189 = !DILocalVariable(name: "decrease_step", scope: !129, file: !3, line: 144, type: !30)
!190 = !DILocalVariable(name: "north", scope: !191, file: !3, line: 146, type: !147)
!191 = distinct !DILexicalBlock(scope: !129, file: !3, line: 145, column: 5)
!192 = !DILocalVariable(name: "south", scope: !191, file: !3, line: 146, type: !147)
!193 = !DILocalVariable(name: "east", scope: !191, file: !3, line: 146, type: !147)
!194 = !DILocalVariable(name: "west", scope: !191, file: !3, line: 146, type: !147)
!195 = !DILocation(line: 116, column: 46, scope: !129)
!196 = !DILocation(line: 116, column: 64, scope: !129)
!197 = !DILocation(line: 116, column: 81, scope: !129)
!198 = !DILocation(line: 117, column: 5, scope: !129)
!199 = !DILocation(line: 118, column: 19, scope: !129)
!200 = !DILocation(line: 119, column: 5, scope: !129)
!201 = !DILocation(line: 120, column: 5, scope: !129)
!202 = !DILocation(line: 121, column: 5, scope: !129)
!203 = !DILocation(line: 103, column: 31, scope: !60, inlinedAt: !204)
!204 = distinct !DILocation(line: 126, column: 5, scope: !129)
!205 = !DILocation(line: 103, column: 49, scope: !60, inlinedAt: !204)
!206 = !DILocation(line: 103, column: 66, scope: !60, inlinedAt: !204)
!207 = !DILocation(line: 104, column: 32, scope: !60, inlinedAt: !204)
!208 = !DILocation(line: 107, column: 50, scope: !60, inlinedAt: !204)
!209 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !210)
!210 = distinct !DILocation(line: 107, column: 78, scope: !60, inlinedAt: !204)
!211 = !DILocation(line: 57, column: 55, scope: !78, inlinedAt: !210)
!212 = !DILocation(line: 57, column: 44, scope: !78, inlinedAt: !210)
!213 = !DILocation(line: 107, column: 74, scope: !60, inlinedAt: !204)
!214 = !DILocation(line: 107, column: 73, scope: !60, inlinedAt: !204)
!215 = !DILocation(line: 58, column: 37, scope: !89, inlinedAt: !216)
!216 = distinct !DILocation(line: 107, column: 29, scope: !60, inlinedAt: !204)
!217 = !DILocation(line: 58, column: 55, scope: !89, inlinedAt: !216)
!218 = !DILocation(line: 58, column: 44, scope: !89, inlinedAt: !216)
!219 = !DILocation(line: 107, column: 27, scope: !60, inlinedAt: !204)
!220 = !DILocation(line: 123, column: 12, scope: !129)
!221 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !222)
