; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/getline.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/getline.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i64 @__getline(i8**, i64*, %struct.__sFILE*) local_unnamed_addr #0 !dbg !7 {
  %4 = tail call i64 @__getdelim(i8** %0, i64* %1, i32 10, %struct.__sFILE* %2) #3, !dbg !244
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !245
  ret i64 %4, !dbg !245
}

; Function Attrs: noredzone
declare dso_local i64 @__getdelim(i8**, i64*, i32, %struct.__sFILE*) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.module.flags = !{!3, !4, !5}
!llvm.ident = !{!6}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/getline.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "__getline", scope: !1, file: !1, line: 47, type: !8, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !239)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !15, !18, !22}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !11, line: 200, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !13, line: 145, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 58, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 66, baseType: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !26, line: 287, baseType: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !26, line: 181, size: 1408, elements: !28)
!28 = !{!29, !32, !34, !35, !37, !38, !43, !44, !46, !206, !212, !217, !221, !222, !223, !224, !226, !228, !229, !230, !232, !233, !237, !238}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !27, file: !26, line: 182, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !27, file: !26, line: 183, baseType: !33, size: 32, offset: 64)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !27, file: !26, line: 184, baseType: !33, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !26, line: 185, baseType: !36, size: 16, offset: 128)
!36 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !27, file: !26, line: 186, baseType: !36, size: 16, offset: 144)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !27, file: !26, line: 187, baseType: !39, size: 128, offset: 192)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !26, line: 117, size: 128, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !39, file: !26, line: 118, baseType: !30, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !39, file: !26, line: 119, baseType: !33, size: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !27, file: !26, line: 188, baseType: !33, size: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !27, file: !26, line: 195, baseType: !45, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !27, file: !26, line: 197, baseType: !47, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!12, !50, !45, !16, !33}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !26, line: 569, size: 14912, elements: !52)
!52 = !{!53, !54, !56, !57, !58, !59, !63, !64, !67, !68, !72, !87, !88, !89, !91, !92, !93, !170, !191, !192, !197, !204}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !51, file: !26, line: 571, baseType: !33, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !51, file: !26, line: 576, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !51, file: !26, line: 576, baseType: !55, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !51, file: !26, line: 576, baseType: !55, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !51, file: !26, line: 578, baseType: !33, size: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !51, file: !26, line: 579, baseType: !60, size: 200, offset: 288)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 200, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 25)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !51, file: !26, line: 582, baseType: !33, size: 32, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !51, file: !26, line: 583, baseType: !65, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !26, line: 40, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !51, file: !26, line: 585, baseType: !33, size: 32, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !51, file: !26, line: 587, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !50}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !51, file: !26, line: 590, baseType: !73, size: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !26, line: 47, size: 256, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !74, file: !26, line: 49, baseType: !73, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !74, file: !26, line: 50, baseType: !33, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !74, file: !26, line: 50, baseType: !33, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !74, file: !26, line: 50, baseType: !33, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !74, file: !26, line: 50, baseType: !33, size: 32, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !74, file: !26, line: 51, baseType: !82, size: 32, offset: 192)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32, elements: !85)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !26, line: 25, baseType: !84)
!84 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !51, file: !26, line: 591, baseType: !33, size: 32, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !51, file: !26, line: 592, baseType: !73, size: 64, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !51, file: !26, line: 593, baseType: !90, size: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !51, file: !26, line: 596, baseType: !33, size: 32, offset: 1024)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !51, file: !26, line: 597, baseType: !16, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !51, file: !26, line: 632, baseType: !94, size: 2880, offset: 1152)
!94 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !51, file: !26, line: 599, size: 2880, elements: !95)
!95 = !{!96, !161}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !94, file: !26, line: 622, baseType: !97, size: 1728)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !26, line: 601, size: 1728, elements: !98)
!98 = !{!99, !100, !101, !105, !117, !118, !120, !130, !144, !145, !146, !150, !154, !155, !156, !157, !158, !159, !160}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !97, file: !26, line: 603, baseType: !84, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !97, file: !26, line: 604, baseType: !16, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !97, file: !26, line: 605, baseType: !102, size: 208, offset: 128)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 208, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 26)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !97, file: !26, line: 606, baseType: !106, size: 288, offset: 352)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !26, line: 55, size: 288, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !106, file: !26, line: 57, baseType: !33, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !106, file: !26, line: 58, baseType: !33, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !106, file: !26, line: 59, baseType: !33, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !106, file: !26, line: 60, baseType: !33, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !106, file: !26, line: 61, baseType: !33, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !106, file: !26, line: 62, baseType: !33, size: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !106, file: !26, line: 63, baseType: !33, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !106, file: !26, line: 64, baseType: !33, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !106, file: !26, line: 65, baseType: !33, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !97, file: !26, line: 607, baseType: !33, size: 32, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !97, file: !26, line: 608, baseType: !119, size: 64, offset: 704)
!119 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !97, file: !26, line: 609, baseType: !121, size: 112, offset: 768)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !26, line: 319, size: 112, elements: !122)
!122 = !{!123, !128, !129}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !121, file: !26, line: 320, baseType: !124, size: 48)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 48, elements: !126)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !{!127}
!127 = !DISubrange(count: 3)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !121, file: !26, line: 321, baseType: !124, size: 48, offset: 48)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !121, file: !26, line: 322, baseType: !125, size: 16, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !97, file: !26, line: 610, baseType: !131, size: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !13, line: 171, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 163, size: 64, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !132, file: !13, line: 165, baseType: !33, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !132, file: !13, line: 170, baseType: !136, size: 32, offset: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !13, line: 166, size: 32, elements: !137)
!137 = !{!138, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !136, file: !13, line: 168, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !20, line: 124, baseType: !84)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !136, file: !13, line: 169, baseType: !141, size: 32)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !97, file: !26, line: 611, baseType: !131, size: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !97, file: !26, line: 612, baseType: !131, size: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !97, file: !26, line: 613, baseType: !147, size: 64, offset: 1088)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !97, file: !26, line: 614, baseType: !151, size: 192, offset: 1152)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 192, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 24)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !97, file: !26, line: 615, baseType: !33, size: 32, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !97, file: !26, line: 616, baseType: !131, size: 64, offset: 1376)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !97, file: !26, line: 617, baseType: !131, size: 64, offset: 1440)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !97, file: !26, line: 618, baseType: !131, size: 64, offset: 1504)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !97, file: !26, line: 619, baseType: !131, size: 64, offset: 1568)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !97, file: !26, line: 620, baseType: !131, size: 64, offset: 1632)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !97, file: !26, line: 621, baseType: !33, size: 32, offset: 1696)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !94, file: !26, line: 631, baseType: !162, size: 2880)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !26, line: 626, size: 2880, elements: !163)
!163 = !{!164, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !162, file: !26, line: 629, baseType: !165, size: 1920)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1920, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 30)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !162, file: !26, line: 630, baseType: !169, size: 960, offset: 1920)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 960, elements: !166)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !51, file: !26, line: 636, baseType: !171, size: 64, offset: 4032)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !26, line: 93, size: 6336, elements: !173)
!173 = !{!174, !175, !176, !183}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !172, file: !26, line: 94, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !172, file: !26, line: 95, baseType: !33, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !172, file: !26, line: 97, baseType: !177, size: 2048, offset: 128)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 2048, elements: !181)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null}
!181 = !{!182}
!182 = !DISubrange(count: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !172, file: !26, line: 98, baseType: !184, size: 4160, offset: 2176)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !26, line: 74, size: 4160, elements: !185)
!185 = !{!186, !188, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !184, file: !26, line: 75, baseType: !187, size: 2048)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !181)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !184, file: !26, line: 76, baseType: !187, size: 2048, offset: 2048)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !184, file: !26, line: 78, baseType: !83, size: 32, offset: 4096)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !184, file: !26, line: 81, baseType: !83, size: 32, offset: 4128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !51, file: !26, line: 637, baseType: !172, size: 6336, offset: 4096)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !51, file: !26, line: 641, baseType: !193, size: 64, offset: 10432)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !33}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !51, file: !26, line: 646, baseType: !198, size: 192, offset: 10496)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !26, line: 291, size: 192, elements: !199)
!199 = !{!200, !202, !203}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !198, file: !26, line: 293, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !198, file: !26, line: 294, baseType: !33, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !198, file: !26, line: 295, baseType: !55, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !51, file: !26, line: 648, baseType: !205, size: 4224, offset: 10688)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 4224, elements: !126)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !27, file: !26, line: 199, baseType: !207, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!12, !50, !45, !210, !33}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !27, file: !26, line: 202, baseType: !213, size: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !50, !45, !216, !33}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !13, line: 114, baseType: !14)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !27, file: !26, line: 203, baseType: !218, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!33, !50, !45}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !27, file: !26, line: 206, baseType: !39, size: 128, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !27, file: !26, line: 207, baseType: !30, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !27, file: !26, line: 208, baseType: !33, size: 32, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !27, file: !26, line: 211, baseType: !225, size: 24, offset: 928)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !126)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !27, file: !26, line: 212, baseType: !227, size: 8, offset: 952)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !85)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !27, file: !26, line: 215, baseType: !39, size: 128, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !27, file: !26, line: 218, baseType: !33, size: 32, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !26, line: 219, baseType: !231, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !13, line: 44, baseType: !14)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !27, file: !26, line: 222, baseType: !50, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !26, line: 226, baseType: !234, size: 32, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !13, line: 175, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !236, line: 12, baseType: !33)
!236 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !27, file: !26, line: 228, baseType: !131, size: 64, offset: 1312)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !26, line: 229, baseType: !33, size: 32, offset: 1376)
!239 = !{!240, !241, !242}
!240 = !DILocalVariable(name: "lptr", arg: 1, scope: !7, file: !1, line: 47, type: !15)
!241 = !DILocalVariable(name: "n", arg: 2, scope: !7, file: !1, line: 47, type: !18)
!242 = !DILocalVariable(name: "fp", arg: 3, scope: !7, file: !1, line: 47, type: !22)
!243 = !DILocation(line: 47, column: 1, scope: !7)
!244 = !DILocation(line: 52, column: 10, scope: !7)
!245 = !DILocation(line: 52, column: 3, scope: !7)
