; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/reent/gettimeofdayr.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/reent/gettimeofdayr.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/reent/gettimeofdayr.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !13, !18}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !6, line: 44, size: 128, elements: !7)
!6 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !{!8, !11}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !5, file: !6, line: 45, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 34, baseType: !10)
!10 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !5, file: !6, line: 46, baseType: !12, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !6, line: 39, baseType: !10)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 82, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !16, line: 232, baseType: !17)
!16 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !{i32 2, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 1, !"wchar_size", i32 4}
!22 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!23 = distinct !DISubprogram(name: "_gettimeofday_r", scope: !1, file: !1, line: 64, type: !24, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !244)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !4, !18}
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !29, line: 569, size: 14912, elements: !30)
!29 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!30 = !{!31, !32, !112, !113, !114, !115, !119, !120, !123, !124, !128, !140, !141, !142, !144, !145, !146, !208, !229, !230, !235, !242}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !28, file: !29, line: 571, baseType: !26, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !28, file: !29, line: 576, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !29, line: 287, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !29, line: 181, size: 1408, elements: !36)
!36 = !{!37, !40, !41, !42, !44, !45, !50, !51, !52, !60, !66, !71, !75, !76, !77, !78, !82, !86, !87, !88, !90, !91, !95, !111}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !35, file: !29, line: 182, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !35, file: !29, line: 183, baseType: !26, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !35, file: !29, line: 184, baseType: !26, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !29, line: 185, baseType: !43, size: 16, offset: 128)
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !35, file: !29, line: 186, baseType: !43, size: 16, offset: 144)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !35, file: !29, line: 187, baseType: !46, size: 128, offset: 192)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !29, line: 117, size: 128, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !46, file: !29, line: 118, baseType: !38, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !46, file: !29, line: 119, baseType: !26, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !35, file: !29, line: 188, baseType: !26, size: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !35, file: !29, line: 195, baseType: !18, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !35, file: !29, line: 197, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !27, !18, !58, !26}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !57, line: 145, baseType: !10)
!57 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !35, file: !29, line: 199, baseType: !61, size: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!56, !27, !18, !64, !26}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !35, file: !29, line: 202, baseType: !67, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !27, !18, !70, !26}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !57, line: 114, baseType: !10)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !35, file: !29, line: 203, baseType: !72, size: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!26, !27, !18}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !35, file: !29, line: 206, baseType: !46, size: 128, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !35, file: !29, line: 207, baseType: !38, size: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !35, file: !29, line: 208, baseType: !26, size: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !35, file: !29, line: 211, baseType: !79, size: 24, offset: 928)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 3)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !35, file: !29, line: 212, baseType: !83, size: 8, offset: 952)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !35, file: !29, line: 215, baseType: !46, size: 128, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !35, file: !29, line: 218, baseType: !26, size: 32, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !29, line: 219, baseType: !89, size: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !57, line: 44, baseType: !10)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !35, file: !29, line: 222, baseType: !27, size: 64, offset: 1216)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !29, line: 226, baseType: !92, size: 32, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !57, line: 175, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !94, line: 12, baseType: !26)
!94 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !35, file: !29, line: 228, baseType: !96, size: 64, offset: 1312)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !57, line: 171, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 163, size: 64, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !97, file: !57, line: 165, baseType: !26, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !97, file: !57, line: 170, baseType: !101, size: 32, offset: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !97, file: !57, line: 166, size: 32, elements: !102)
!102 = !{!103, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !101, file: !57, line: 168, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !105, line: 124, baseType: !106)
!105 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!106 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !101, file: !57, line: 169, baseType: !108, size: 32)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !29, line: 229, baseType: !26, size: 32, offset: 1376)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !28, file: !29, line: 576, baseType: !33, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !28, file: !29, line: 576, baseType: !33, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !28, file: !29, line: 578, baseType: !26, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !28, file: !29, line: 579, baseType: !116, size: 200, offset: 288)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 200, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 25)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !28, file: !29, line: 582, baseType: !26, size: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !28, file: !29, line: 583, baseType: !121, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !29, line: 40, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !28, file: !29, line: 585, baseType: !26, size: 32, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !28, file: !29, line: 587, baseType: !125, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !27}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !28, file: !29, line: 590, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !29, line: 47, size: 256, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !130, file: !29, line: 49, baseType: !129, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !130, file: !29, line: 50, baseType: !26, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !130, file: !29, line: 50, baseType: !26, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !130, file: !29, line: 50, baseType: !26, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !130, file: !29, line: 50, baseType: !26, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !130, file: !29, line: 51, baseType: !138, size: 32, offset: 192)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32, elements: !84)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !29, line: 25, baseType: !106)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !28, file: !29, line: 591, baseType: !26, size: 32, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !28, file: !29, line: 592, baseType: !129, size: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !28, file: !29, line: 593, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !28, file: !29, line: 596, baseType: !26, size: 32, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !28, file: !29, line: 597, baseType: !58, size: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !28, file: !29, line: 632, baseType: !147, size: 2880, offset: 1152)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !28, file: !29, line: 599, size: 2880, elements: !148)
!148 = !{!149, !199}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !147, file: !29, line: 622, baseType: !150, size: 1728)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !29, line: 601, size: 1728, elements: !151)
!151 = !{!152, !153, !154, !158, !170, !171, !173, !181, !182, !183, !184, !188, !192, !193, !194, !195, !196, !197, !198}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !150, file: !29, line: 603, baseType: !106, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !150, file: !29, line: 604, baseType: !58, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !150, file: !29, line: 605, baseType: !155, size: 208, offset: 128)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 208, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 26)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !150, file: !29, line: 606, baseType: !159, size: 288, offset: 352)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !29, line: 55, size: 288, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !159, file: !29, line: 57, baseType: !26, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !159, file: !29, line: 58, baseType: !26, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !159, file: !29, line: 59, baseType: !26, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !159, file: !29, line: 60, baseType: !26, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !159, file: !29, line: 61, baseType: !26, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !159, file: !29, line: 62, baseType: !26, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !159, file: !29, line: 63, baseType: !26, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !159, file: !29, line: 64, baseType: !26, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !159, file: !29, line: 65, baseType: !26, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !150, file: !29, line: 607, baseType: !26, size: 32, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !150, file: !29, line: 608, baseType: !172, size: 64, offset: 704)
!172 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !150, file: !29, line: 609, baseType: !174, size: 112, offset: 768)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !29, line: 319, size: 112, elements: !175)
!175 = !{!176, !179, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !174, file: !29, line: 320, baseType: !177, size: 48)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 48, elements: !80)
!178 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !174, file: !29, line: 321, baseType: !177, size: 48, offset: 48)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !174, file: !29, line: 322, baseType: !178, size: 16, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !150, file: !29, line: 610, baseType: !96, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !150, file: !29, line: 611, baseType: !96, size: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !150, file: !29, line: 612, baseType: !96, size: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !150, file: !29, line: 613, baseType: !185, size: 64, offset: 1088)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !150, file: !29, line: 614, baseType: !189, size: 192, offset: 1152)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 192, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 24)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !150, file: !29, line: 615, baseType: !26, size: 32, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !150, file: !29, line: 616, baseType: !96, size: 64, offset: 1376)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !150, file: !29, line: 617, baseType: !96, size: 64, offset: 1440)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !150, file: !29, line: 618, baseType: !96, size: 64, offset: 1504)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !150, file: !29, line: 619, baseType: !96, size: 64, offset: 1568)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !150, file: !29, line: 620, baseType: !96, size: 64, offset: 1632)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !150, file: !29, line: 621, baseType: !26, size: 32, offset: 1696)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !147, file: !29, line: 631, baseType: !200, size: 2880)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !29, line: 626, size: 2880, elements: !201)
!201 = !{!202, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !200, file: !29, line: 629, baseType: !203, size: 1920)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1920, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 30)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !200, file: !29, line: 630, baseType: !207, size: 960, offset: 1920)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 960, elements: !204)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !28, file: !29, line: 636, baseType: !209, size: 64, offset: 4032)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !29, line: 93, size: 6336, elements: !211)
!211 = !{!212, !213, !214, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !210, file: !29, line: 94, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !210, file: !29, line: 95, baseType: !26, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !210, file: !29, line: 97, baseType: !215, size: 2048, offset: 128)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 2048, elements: !219)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null}
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !210, file: !29, line: 98, baseType: !222, size: 4160, offset: 2176)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !29, line: 74, size: 4160, elements: !223)
!223 = !{!224, !226, !227, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !222, file: !29, line: 75, baseType: !225, size: 2048)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 2048, elements: !219)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !222, file: !29, line: 76, baseType: !225, size: 2048, offset: 2048)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !222, file: !29, line: 78, baseType: !139, size: 32, offset: 4096)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !222, file: !29, line: 81, baseType: !139, size: 32, offset: 4128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !28, file: !29, line: 637, baseType: !210, size: 6336, offset: 4096)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !28, file: !29, line: 641, baseType: !231, size: 64, offset: 10432)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !26}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !28, file: !29, line: 646, baseType: !236, size: 192, offset: 10496)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !29, line: 291, size: 192, elements: !237)
!237 = !{!238, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !236, file: !29, line: 293, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !236, file: !29, line: 294, baseType: !26, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !236, file: !29, line: 295, baseType: !33, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !28, file: !29, line: 648, baseType: !243, size: 4224, offset: 10688)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 4224, elements: !80)
!244 = !{!245, !246, !247, !248, !249, !250}
!245 = !DILocalVariable(name: "ptr", arg: 1, scope: !23, file: !1, line: 64, type: !27)
!246 = !DILocalVariable(name: "ptimeval", arg: 2, scope: !23, file: !1, line: 64, type: !4)
!247 = !DILocalVariable(name: "ptimezone", arg: 3, scope: !23, file: !1, line: 64, type: !18)
!248 = !DILocalVariable(name: "ret", scope: !23, file: !1, line: 69, type: !26)
!249 = !DILocalVariable(name: "_ptimeval", scope: !23, file: !1, line: 70, type: !5)
!250 = !DILocalVariable(name: "_dss__ptimeval", scope: !23, file: !1, line: 71, type: !4)
!251 = !DILocation(line: 64, column: 1, scope: !23)
!252 = !DILocation(line: 70, column: 3, scope: !23)
!253 = !DILocation(line: 71, column: 56, scope: !23)
!254 = !DILocation(line: 71, column: 81, scope: !23)
!255 = !DILocation(line: 71, column: 36, scope: !23)
!256 = !DILocation(line: 71, column: 19, scope: !23)
!257 = !DILocation(line: 75, column: 9, scope: !23)
!258 = !{!259, !259, i64 0}
!259 = !{!"int", !260, i64 0}
!260 = !{!"omnipotent char", !261, i64 0}
!261 = !{!"Simple C/C++ TBAA"}
!262 = !DILocation(line: 76, column: 3, scope: !23)
!263 = !DILocation(line: 69, column: 7, scope: !23)
!264 = !DILocation(line: 77, column: 40, scope: !23)
!265 = !{!266, !266, i64 0}
!266 = !{!"long", !260, i64 0}
!267 = !DILocation(line: 77, column: 20, scope: !23)
!268 = !DILocation(line: 79, column: 11, scope: !269)
!269 = distinct !DILexicalBlock(scope: !23, file: !1, line: 79, column: 7)
!270 = !DILocation(line: 79, column: 20, scope: !269)
!271 = !DILocation(line: 79, column: 26, scope: !269)
!272 = !DILocation(line: 79, column: 17, scope: !269)
!273 = !DILocation(line: 80, column: 10, scope: !269)
!274 = !DILocation(line: 80, column: 17, scope: !269)
!275 = !{!276, !259, i64 0}
!276 = !{!"_reent", !259, i64 0, !277, i64 8, !277, i64 16, !277, i64 24, !259, i64 32, !260, i64 36, !259, i64 64, !277, i64 72, !259, i64 80, !277, i64 88, !277, i64 96, !259, i64 104, !277, i64 112, !277, i64 120, !259, i64 128, !277, i64 136, !260, i64 144, !277, i64 504, !278, i64 512, !277, i64 1304, !280, i64 1312, !260, i64 1336}
!277 = !{!"any pointer", !260, i64 0}
!278 = !{!"_atexit", !277, i64 0, !259, i64 8, !260, i64 16, !279, i64 272}
!279 = !{!"_on_exit_args", !260, i64 0, !260, i64 256, !259, i64 512, !259, i64 516}
!280 = !{!"_glue", !277, i64 0, !259, i64 8, !277, i64 16}
!281 = !DILocation(line: 80, column: 5, scope: !269)
!282 = !DILocation(line: 82, column: 1, scope: !23)
!283 = !DILocation(line: 81, column: 3, scope: !23)
