; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/global.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/global.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pte_thread_t_ = type { %struct.uk_thread*, %struct.pte_handle_t, %struct.pte_thread_t_*, i32, i8*, i8*, i32, i32, %struct.pthread_mutex_t_*, i32, %struct.pthread_mutex_t_*, i32, i32, i32, [8 x i64], i8, i8*, i8* }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.anon.0 = type { %struct.uk_waitq_entry* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pte_processInitialized", scope: !2, file: !3, line: 48, type: !72, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !22)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/global.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !6, line: 92, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 61, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !16, !17, !18, !19, !20, !21}
!15 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!22 = !{!0, !23, !520, !522, !532, !534, !556, !558, !560, !562, !564, !574, !576, !578, !580, !582}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "pte_threadReuseTop", scope: !2, file: !3, line: 49, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !13, line: 83, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !13, line: 85, size: 1536, elements: !28)
!28 = !{!29, !474, !482, !483, !486, !487, !488, !489, !490, !507, !508, !509, !510, !511, !512, !517, !518, !519}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !27, file: !13, line: 87, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !31, line: 11, baseType: !32)
!31 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !34, line: 59, size: 1024, elements: !35)
!34 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !{!36, !40, !42, !43, !44, !50, !55, !61, !63, !80, !229, !230, !231, !444}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !34, line: 60, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !33, file: !34, line: 61, baseType: !41, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !33, file: !34, line: 62, baseType: !41, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !33, file: !34, line: 63, baseType: !41, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !33, file: !34, line: 64, baseType: !45, size: 128, offset: 256)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !33, file: !34, line: 64, size: 128, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !45, file: !34, line: 64, baseType: !32, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !45, file: !34, line: 64, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !34, line: 65, baseType: !51, size: 32, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !52, line: 48, baseType: !53)
!52 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !54, line: 79, baseType: !7)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !33, file: !34, line: 66, baseType: !56, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !57, line: 49, baseType: !58)
!57 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !59, line: 128, baseType: !60)
!59 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !33, file: !34, line: 67, baseType: !62, size: 8, offset: 512)
!62 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !33, file: !34, line: 68, baseType: !64, size: 128, offset: 576)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !65, line: 42, size: 128, elements: !66)
!65 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !{!67, !78}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !64, file: !65, line: 42, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !65, line: 35, size: 192, elements: !70)
!70 = !{!71, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !69, file: !65, line: 36, baseType: !72, size: 32)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !69, file: !65, line: 37, baseType: !32, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !69, file: !65, line: 38, baseType: !75, size: 64, offset: 128)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !69, file: !65, line: 38, size: 64, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !75, file: !65, line: 38, baseType: !68, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !64, file: !65, line: 42, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !33, file: !34, line: 69, baseType: !81, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !83, line: 90, size: 2176, elements: !84)
!83 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !{!85, !90, !108, !113, !115, !117, !122, !130, !135, !141, !142, !143, !148, !226, !227, !228}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !82, file: !83, line: 91, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !83, line: 68, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !81}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !82, file: !83, line: 93, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !83, line: 71, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!72, !81, !32, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !98, line: 62, baseType: !99)
!98 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !98, line: 55, size: 128, elements: !100)
!100 = !{!101, !102, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !99, file: !98, line: 57, baseType: !62, size: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !99, file: !98, line: 59, baseType: !103, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !98, line: 53, baseType: !72)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !99, file: !98, line: 61, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !57, line: 48, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !59, line: 129, baseType: !107)
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !82, file: !83, line: 94, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !83, line: 74, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !81, !32}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !82, file: !83, line: 95, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !83, line: 76, baseType: !110)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !82, file: !83, line: 96, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !83, line: 78, baseType: !110)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !82, file: !83, line: 98, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !83, line: 81, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!72, !81, !32, !103}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !82, file: !83, line: 99, baseType: !123, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !83, line: 83, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!72, !81, !127, !129}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !82, file: !83, line: 100, baseType: !131, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !83, line: 85, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!72, !81, !32, !72}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !82, file: !83, line: 101, baseType: !136, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !83, line: 87, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!72, !81, !127, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !82, file: !83, line: 104, baseType: !62, size: 8, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !82, file: !83, line: 105, baseType: !33, size: 1024, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !82, file: !83, line: 106, baseType: !144, size: 128, offset: 1664)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !34, line: 93, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !144, file: !34, line: 93, baseType: !32, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !144, file: !34, line: 93, baseType: !49, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !82, file: !83, line: 107, baseType: !149, size: 192, offset: 1792)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !150, line: 59, size: 192, elements: !151)
!150 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!151 = !{!152, !217, !221}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !149, file: !150, line: 61, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !150, line: 51, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!41, !157, !107, !107}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !159, line: 77, size: 832, elements: !160)
!159 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!160 = !{!161, !168, !173, !178, !184, !186, !191, !192, !193, !198, !203, !208, !209, !210}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !158, file: !159, line: 79, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !159, line: 54, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!41, !157, !166}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !167, line: 58, baseType: !107)
!167 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !158, file: !159, line: 80, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !159, line: 56, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!41, !157, !166, !166}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !158, file: !159, line: 81, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !159, line: 62, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!41, !157, !41, !166}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !158, file: !159, line: 82, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !159, line: 58, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!72, !157, !183, !166, !166}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !158, file: !159, line: 83, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !159, line: 60, baseType: !170)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !158, file: !159, line: 84, baseType: !187, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !159, line: 64, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !157, !41}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !158, file: !159, line: 87, baseType: !187, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !158, file: !159, line: 88, baseType: !162, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !158, file: !159, line: 92, baseType: !194, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !159, line: 66, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!41, !157, !107}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !158, file: !159, line: 93, baseType: !199, size: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !159, line: 68, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !157, !41, !107}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !158, file: !159, line: 99, baseType: !204, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !159, line: 70, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!72, !157, !41, !166}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !158, file: !159, line: 100, baseType: !166, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !159, line: 103, baseType: !157, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !158, file: !159, line: 104, baseType: !211, offset: 832)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, elements: !215)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !52, line: 20, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !54, line: 41, baseType: !214)
!214 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!215 = !{!216}
!216 = !DISubrange(count: -1)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !149, file: !150, line: 63, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !41}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !149, file: !150, line: 65, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !150, line: 56, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !41, !41}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !82, file: !83, line: 108, baseType: !157, size: 64, offset: 1984)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !83, line: 109, baseType: !81, size: 64, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !82, file: !83, line: 110, baseType: !41, size: 64, offset: 2112)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !33, file: !34, line: 70, baseType: !41, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !33, file: !34, line: 72, baseType: !72, size: 32, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !33, file: !34, line: 82, baseType: !232, size: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !234, line: 569, size: 14912, elements: !235)
!234 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!235 = !{!236, !237, !312, !313, !314, !315, !319, !320, !323, !324, !328, !340, !341, !342, !344, !345, !346, !408, !429, !430, !435, !442}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !233, file: !234, line: 571, baseType: !72, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !233, file: !234, line: 576, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !234, line: 287, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !234, line: 181, size: 1408, elements: !241)
!241 = !{!242, !245, !246, !247, !249, !250, !255, !256, !257, !264, !268, !273, !277, !278, !279, !280, !284, !288, !289, !290, !292, !293, !297, !311}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !240, file: !234, line: 182, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !240, file: !234, line: 183, baseType: !72, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !240, file: !234, line: 184, baseType: !72, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !240, file: !234, line: 185, baseType: !248, size: 16, offset: 128)
!248 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !240, file: !234, line: 186, baseType: !248, size: 16, offset: 144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !240, file: !234, line: 187, baseType: !251, size: 128, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !234, line: 117, size: 128, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !251, file: !234, line: 118, baseType: !243, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !251, file: !234, line: 119, baseType: !72, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !240, file: !234, line: 188, baseType: !72, size: 32, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !240, file: !234, line: 195, baseType: !41, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !240, file: !234, line: 197, baseType: !258, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !232, !41, !263, !72}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !262, line: 145, baseType: !60)
!262 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !240, file: !234, line: 199, baseType: !265, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!261, !232, !41, !37, !72}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !240, file: !234, line: 202, baseType: !269, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !232, !41, !272, !72}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !262, line: 114, baseType: !60)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !240, file: !234, line: 203, baseType: !274, size: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!72, !232, !41}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !240, file: !234, line: 206, baseType: !251, size: 128, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !240, file: !234, line: 207, baseType: !243, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !240, file: !234, line: 208, baseType: !72, size: 32, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !240, file: !234, line: 211, baseType: !281, size: 24, offset: 928)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 24, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 3)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !240, file: !234, line: 212, baseType: !285, size: 8, offset: 952)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !240, file: !234, line: 215, baseType: !251, size: 128, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !240, file: !234, line: 218, baseType: !72, size: 32, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !240, file: !234, line: 219, baseType: !291, size: 64, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !262, line: 44, baseType: !60)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !240, file: !234, line: 222, baseType: !232, size: 64, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !240, file: !234, line: 226, baseType: !294, size: 32, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !262, line: 175, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !296, line: 12, baseType: !72)
!296 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !240, file: !234, line: 228, baseType: !298, size: 64, offset: 1312)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !262, line: 171, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 163, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !299, file: !262, line: 165, baseType: !72, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !299, file: !262, line: 170, baseType: !303, size: 32, offset: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !299, file: !262, line: 166, size: 32, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !303, file: !262, line: 168, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !167, line: 124, baseType: !7)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !303, file: !262, line: 169, baseType: !308, size: 32)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 32, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 4)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !240, file: !234, line: 229, baseType: !72, size: 32, offset: 1376)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !233, file: !234, line: 576, baseType: !238, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !233, file: !234, line: 576, baseType: !238, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !233, file: !234, line: 578, baseType: !72, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !233, file: !234, line: 579, baseType: !316, size: 200, offset: 288)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 200, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 25)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !233, file: !234, line: 582, baseType: !72, size: 32, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !233, file: !234, line: 583, baseType: !321, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !234, line: 40, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !233, file: !234, line: 585, baseType: !72, size: 32, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !233, file: !234, line: 587, baseType: !325, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !232}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !233, file: !234, line: 590, baseType: !329, size: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !234, line: 47, size: 256, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !330, file: !234, line: 49, baseType: !329, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !330, file: !234, line: 50, baseType: !72, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !330, file: !234, line: 50, baseType: !72, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !330, file: !234, line: 50, baseType: !72, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !330, file: !234, line: 50, baseType: !72, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !330, file: !234, line: 51, baseType: !338, size: 32, offset: 192)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 32, elements: !286)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !234, line: 25, baseType: !7)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !233, file: !234, line: 591, baseType: !72, size: 32, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !233, file: !234, line: 592, baseType: !329, size: 64, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !233, file: !234, line: 593, baseType: !343, size: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !233, file: !234, line: 596, baseType: !72, size: 32, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !233, file: !234, line: 597, baseType: !263, size: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !233, file: !234, line: 632, baseType: !347, size: 2880, offset: 1152)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !234, line: 599, size: 2880, elements: !348)
!348 = !{!349, !399}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !347, file: !234, line: 622, baseType: !350, size: 1728)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !234, line: 601, size: 1728, elements: !351)
!351 = !{!352, !353, !354, !358, !370, !371, !373, !381, !382, !383, !384, !388, !392, !393, !394, !395, !396, !397, !398}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !350, file: !234, line: 603, baseType: !7, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !350, file: !234, line: 604, baseType: !263, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !350, file: !234, line: 605, baseType: !355, size: 208, offset: 128)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 208, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 26)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !350, file: !234, line: 606, baseType: !359, size: 288, offset: 352)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !234, line: 55, size: 288, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !359, file: !234, line: 57, baseType: !72, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !359, file: !234, line: 58, baseType: !72, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !359, file: !234, line: 59, baseType: !72, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !359, file: !234, line: 60, baseType: !72, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !359, file: !234, line: 61, baseType: !72, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !359, file: !234, line: 62, baseType: !72, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !359, file: !234, line: 63, baseType: !72, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !359, file: !234, line: 64, baseType: !72, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !359, file: !234, line: 65, baseType: !72, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !350, file: !234, line: 607, baseType: !72, size: 32, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !350, file: !234, line: 608, baseType: !372, size: 64, offset: 704)
!372 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !350, file: !234, line: 609, baseType: !374, size: 112, offset: 768)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !234, line: 319, size: 112, elements: !375)
!375 = !{!376, !379, !380}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !374, file: !234, line: 320, baseType: !377, size: 48)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 48, elements: !282)
!378 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !374, file: !234, line: 321, baseType: !377, size: 48, offset: 48)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !374, file: !234, line: 322, baseType: !378, size: 16, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !350, file: !234, line: 610, baseType: !298, size: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !350, file: !234, line: 611, baseType: !298, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !350, file: !234, line: 612, baseType: !298, size: 64, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !350, file: !234, line: 613, baseType: !385, size: 64, offset: 1088)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 8)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !350, file: !234, line: 614, baseType: !389, size: 192, offset: 1152)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 24)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !350, file: !234, line: 615, baseType: !72, size: 32, offset: 1344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !350, file: !234, line: 616, baseType: !298, size: 64, offset: 1376)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !350, file: !234, line: 617, baseType: !298, size: 64, offset: 1440)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !350, file: !234, line: 618, baseType: !298, size: 64, offset: 1504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !350, file: !234, line: 619, baseType: !298, size: 64, offset: 1568)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !350, file: !234, line: 620, baseType: !298, size: 64, offset: 1632)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !350, file: !234, line: 621, baseType: !72, size: 32, offset: 1696)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !347, file: !234, line: 631, baseType: !400, size: 2880)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !234, line: 626, size: 2880, elements: !401)
!401 = !{!402, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !400, file: !234, line: 629, baseType: !403, size: 1920)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 1920, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 30)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !400, file: !234, line: 630, baseType: !407, size: 960, offset: 1920)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !404)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !233, file: !234, line: 636, baseType: !409, size: 64, offset: 4032)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !234, line: 93, size: 6336, elements: !411)
!411 = !{!412, !413, !414, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !410, file: !234, line: 94, baseType: !409, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !410, file: !234, line: 95, baseType: !72, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !410, file: !234, line: 97, baseType: !415, size: 2048, offset: 128)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 2048, elements: !419)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{null}
!419 = !{!420}
!420 = !DISubrange(count: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !410, file: !234, line: 98, baseType: !422, size: 4160, offset: 2176)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !234, line: 74, size: 4160, elements: !423)
!423 = !{!424, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !422, file: !234, line: 75, baseType: !425, size: 2048)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !419)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !422, file: !234, line: 76, baseType: !425, size: 2048, offset: 2048)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !422, file: !234, line: 78, baseType: !339, size: 32, offset: 4096)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !422, file: !234, line: 81, baseType: !339, size: 32, offset: 4128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !233, file: !234, line: 637, baseType: !410, size: 6336, offset: 4096)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !233, file: !234, line: 641, baseType: !431, size: 64, offset: 10432)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !72}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !233, file: !234, line: 646, baseType: !436, size: 192, offset: 10496)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !234, line: 291, size: 192, elements: !437)
!437 = !{!438, !440, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !436, file: !234, line: 293, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !436, file: !234, line: 294, baseType: !72, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !436, file: !234, line: 295, baseType: !238, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !233, file: !234, line: 648, baseType: !443, size: 4224, offset: 10688)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 4224, elements: !282)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !33, file: !34, line: 85, baseType: !445, size: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !6, line: 114, size: 640, elements: !447)
!447 = !{!448, !452, !453, !460, !473}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !446, file: !6, line: 116, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !450, line: 64, baseType: !451)
!450 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !450, line: 63, baseType: !107)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !446, file: !6, line: 118, baseType: !449, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !446, file: !6, line: 120, baseType: !454, size: 128, offset: 128)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !455, line: 51, size: 128, elements: !456)
!455 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !454, file: !455, line: 52, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !454, file: !455, line: 53, baseType: !458, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !446, file: !6, line: 122, baseType: !461, size: 256, offset: 256)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !6, line: 98, size: 256, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !461, file: !6, line: 107, baseType: !5, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !461, file: !6, line: 109, baseType: !449, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !461, file: !6, line: 111, baseType: !466, size: 96, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !450, line: 72, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 68, size: 96, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !467, file: !450, line: 69, baseType: !72, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !467, file: !450, line: 70, baseType: !72, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !467, file: !450, line: 71, baseType: !472, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !450, line: 61, baseType: !72)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !446, file: !6, line: 124, baseType: !454, size: 128, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !27, file: !13, line: 88, baseType: !475, size: 128, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !476, line: 413, baseType: !477)
!476 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !476, line: 411, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 395, size: 128, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !478, file: !476, line: 398, baseType: !41, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !478, file: !476, line: 399, baseType: !7, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !27, file: !13, line: 89, baseType: !25, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !27, file: !13, line: 90, baseType: !484, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !13, line: 80, baseType: !12)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !27, file: !13, line: 91, baseType: !41, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !27, file: !13, line: 92, baseType: !41, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !27, file: !13, line: 93, baseType: !72, size: 32, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !27, file: !13, line: 94, baseType: !72, size: 32, offset: 480)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !27, file: !13, line: 95, baseType: !491, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !476, line: 417, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !13, line: 146, size: 320, elements: !494)
!494 = !{!495, !503, !504, !505, !506}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !493, file: !13, line: 148, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !31, line: 12, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !499, line: 51, size: 192, elements: !500)
!499 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !498, file: !499, line: 52, baseType: !60, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !498, file: !499, line: 53, baseType: !64, size: 128, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !493, file: !13, line: 149, baseType: !72, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !493, file: !13, line: 156, baseType: !72, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !493, file: !13, line: 159, baseType: !72, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !493, file: !13, line: 160, baseType: !475, size: 128, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !27, file: !13, line: 96, baseType: !72, size: 32, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !27, file: !13, line: 97, baseType: !491, size: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !27, file: !13, line: 98, baseType: !72, size: 32, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !27, file: !13, line: 99, baseType: !72, size: 32, offset: 736)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !27, file: !13, line: 100, baseType: !72, size: 32, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !27, file: !13, line: 102, baseType: !513, size: 512, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !514, line: 372, baseType: !515)
!514 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 512, elements: !386)
!516 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !27, file: !13, line: 104, baseType: !72, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !27, file: !13, line: 106, baseType: !41, size: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !27, file: !13, line: 107, baseType: !41, size: 64, offset: 1472)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "pte_threadReuseBottom", scope: !2, file: !3, line: 50, type: !25, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "pte_selfThreadKey", scope: !2, file: !3, line: 51, type: !524, isLocal: false, isDefinition: true)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !476, line: 416, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_key_t_", file: !13, line: 214, size: 256, elements: !527)
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !526, file: !13, line: 216, baseType: !7, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !526, file: !13, line: 217, baseType: !218, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "keyLock", scope: !526, file: !13, line: 218, baseType: !491, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !526, file: !13, line: 219, baseType: !41, size: 64, offset: 192)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "pte_cleanupKey", scope: !2, file: !3, line: 52, type: !524, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "pte_cond_list_head", scope: !2, file: !3, line: 53, type: !536, isLocal: false, isDefinition: true)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !476, line: 419, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_cond_t_", file: !13, line: 233, size: 512, elements: !539)
!539 = !{!540, !541, !542, !543, !552, !553, !554, !555}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nWaitersBlocked", scope: !538, file: !13, line: 235, baseType: !60, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nWaitersGone", scope: !538, file: !13, line: 236, baseType: !60, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nWaitersToUnblock", scope: !538, file: !13, line: 237, baseType: !60, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "semBlockQueue", scope: !538, file: !13, line: 238, baseType: !544, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !545, line: 78, baseType: !546)
!545 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_t_", file: !13, line: 136, size: 192, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !547, file: !13, line: 138, baseType: !72, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !547, file: !13, line: 139, baseType: !491, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !547, file: !13, line: 140, baseType: !496, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "semBlockLock", scope: !538, file: !13, line: 240, baseType: !544, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mtxUnblockLock", scope: !538, file: !13, line: 243, baseType: !491, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !13, line: 246, baseType: !536, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !538, file: !13, line: 247, baseType: !536, size: 64, offset: 448)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "pte_cond_list_tail", scope: !2, file: !3, line: 54, type: !536, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "pte_concurrency", scope: !2, file: !3, line: 56, type: !72, isLocal: false, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "pte_features", scope: !2, file: !3, line: 59, type: !72, isLocal: false, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "pte_smp_system", scope: !2, file: !3, line: 61, type: !244, isLocal: false, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "pte_thread_reuse_lock", scope: !2, file: !3, line: 66, type: !566, isLocal: false, isDefinition: true)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osMutexHandle", file: !31, line: 13, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_mutex", file: !569, line: 58, size: 256, elements: !570)
!569 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/mutex.h", directory: "/root/.unikraft/apps/redis/build")
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !568, file: !569, line: 59, baseType: !72, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !568, file: !569, line: 60, baseType: !32, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !568, file: !569, line: 61, baseType: !64, size: 128, offset: 128)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "pte_mutex_test_init_lock", scope: !2, file: !3, line: 71, type: !566, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "pte_cond_test_init_lock", scope: !2, file: !3, line: 77, type: !566, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "pte_rwlock_test_init_lock", scope: !2, file: !3, line: 83, type: !566, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "pte_spinlock_test_init_lock", scope: !2, file: !3, line: 89, type: !566, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "pte_cond_list_lock", scope: !2, file: !3, line: 96, type: !566, isLocal: false, isDefinition: true)
!584 = !{i32 2, !"Dwarf Version", i32 4}
!585 = !{i32 2, !"Debug Info Version", i32 3}
!586 = !{i32 1, !"wchar_size", i32 4}
!587 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
