; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/gmtime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/gmtime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.anon = type { i32, i8*, [26 x i8], %struct.__tm, i32, i64, %struct._rand48, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, [8 x i8], [24 x i8], i32, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, i32 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._rand48 = type { [3 x i16], [3 x i16], i16 }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local %struct.tm* @gmtime(i64*) local_unnamed_addr #0 !dbg !28 {
  call void @llvm.dbg.value(metadata i64* %0, metadata !36, metadata !DIExpression()), !dbg !253
  %2 = tail call %struct._reent* @__getreent() #3, !dbg !254
  call void @llvm.dbg.value(metadata %struct._reent* %2, metadata !37, metadata !DIExpression()), !dbg !255
  %3 = getelementptr inbounds %struct._reent, %struct._reent* %2, i64 0, i32 16, !dbg !256
  %4 = bitcast %union.anon.0* %3 to %struct.anon*, !dbg !256
  %5 = getelementptr inbounds %struct.anon, %struct.anon* %4, i64 0, i32 3, !dbg !256
  %6 = bitcast %struct.__tm* %5 to %struct.tm*, !dbg !257
  %7 = tail call %struct.tm* @gmtime_r(i64* %0, %struct.tm* nonnull %6) #3, !dbg !258
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !259
  ret %struct.tm* %7, !dbg !259
}

; Function Attrs: noredzone
declare dso_local %struct._reent* @__getreent() local_unnamed_addr #1

; Function Attrs: noredzone
declare dso_local %struct.tm* @gmtime_r(i64*, %struct.tm*) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.value(metadata, metadata, metadata) #2

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!24, !25, !26}
!llvm.ident = !{!27}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/gmtime.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !6, line: 31, size: 448, elements: !7)
!6 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !{!8, !10, !11, !12, !13, !14, !15, !16, !17, !18, !20}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !5, file: !6, line: 32, baseType: !9, size: 32)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !5, file: !6, line: 33, baseType: !9, size: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !5, file: !6, line: 34, baseType: !9, size: 32, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !5, file: !6, line: 35, baseType: !9, size: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !5, file: !6, line: 36, baseType: !9, size: 32, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !5, file: !6, line: 37, baseType: !9, size: 32, offset: 160)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !5, file: !6, line: 38, baseType: !9, size: 32, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !5, file: !6, line: 39, baseType: !9, size: 32, offset: 224)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !5, file: !6, line: 40, baseType: !9, size: 32, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !5, file: !6, line: 41, baseType: !19, size: 64, offset: 320)
!19 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !5, file: !6, line: 42, baseType: !21, size: 64, offset: 384)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!28 = distinct !DISubprogram(name: "gmtime", scope: !1, file: !1, line: 61, type: !29, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !35)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !34, line: 34, baseType: !19)
!34 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !{!36, !37}
!36 = !DILocalVariable(name: "tim_p", arg: 1, scope: !28, file: !1, line: 61, type: !31)
!37 = !DILocalVariable(name: "reent", scope: !28, file: !1, line: 64, type: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !40, line: 569, size: 14912, elements: !41)
!40 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !{!42, !43, !121, !122, !123, !124, !128, !129, !132, !133, !137, !149, !150, !151, !153, !154, !155, !217, !238, !239, !244, !251}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !39, file: !40, line: 571, baseType: !9, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !39, file: !40, line: 576, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !40, line: 287, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !40, line: 181, size: 1408, elements: !47)
!47 = !{!48, !51, !52, !53, !55, !56, !61, !62, !64, !71, !75, !80, !84, !85, !86, !87, !91, !95, !96, !97, !99, !100, !104, !120}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !46, file: !40, line: 182, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !46, file: !40, line: 183, baseType: !9, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !46, file: !40, line: 184, baseType: !9, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !40, line: 185, baseType: !54, size: 16, offset: 128)
!54 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !46, file: !40, line: 186, baseType: !54, size: 16, offset: 144)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !46, file: !40, line: 187, baseType: !57, size: 128, offset: 192)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !40, line: 117, size: 128, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !57, file: !40, line: 118, baseType: !49, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !57, file: !40, line: 119, baseType: !9, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !46, file: !40, line: 188, baseType: !9, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !46, file: !40, line: 195, baseType: !63, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !46, file: !40, line: 197, baseType: !65, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !38, !63, !70, !9}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !69, line: 145, baseType: !19)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !46, file: !40, line: 199, baseType: !72, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!68, !38, !63, !21, !9}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !46, file: !40, line: 202, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !38, !63, !79, !9}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !69, line: 114, baseType: !19)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !46, file: !40, line: 203, baseType: !81, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!9, !38, !63}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !46, file: !40, line: 206, baseType: !57, size: 128, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !46, file: !40, line: 207, baseType: !49, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !46, file: !40, line: 208, baseType: !9, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !46, file: !40, line: 211, baseType: !88, size: 24, offset: 928)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 24, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !46, file: !40, line: 212, baseType: !92, size: 8, offset: 952)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !46, file: !40, line: 215, baseType: !57, size: 128, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !46, file: !40, line: 218, baseType: !9, size: 32, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !40, line: 219, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !69, line: 44, baseType: !19)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !46, file: !40, line: 222, baseType: !38, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !40, line: 226, baseType: !101, size: 32, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !69, line: 175, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !103, line: 12, baseType: !9)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !46, file: !40, line: 228, baseType: !105, size: 64, offset: 1312)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !69, line: 171, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 163, size: 64, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !106, file: !69, line: 165, baseType: !9, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !106, file: !69, line: 170, baseType: !110, size: 32, offset: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !69, line: 166, size: 32, elements: !111)
!111 = !{!112, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !110, file: !69, line: 168, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !114, line: 124, baseType: !115)
!114 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!115 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !110, file: !69, line: 169, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !40, line: 229, baseType: !9, size: 32, offset: 1376)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !39, file: !40, line: 576, baseType: !44, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !39, file: !40, line: 576, baseType: !44, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !39, file: !40, line: 578, baseType: !9, size: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !39, file: !40, line: 579, baseType: !125, size: 200, offset: 288)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 200, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 25)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !39, file: !40, line: 582, baseType: !9, size: 32, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !39, file: !40, line: 583, baseType: !130, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !40, line: 40, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !39, file: !40, line: 585, baseType: !9, size: 32, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !39, file: !40, line: 587, baseType: !134, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !38}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !39, file: !40, line: 590, baseType: !138, size: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !40, line: 47, size: 256, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !139, file: !40, line: 49, baseType: !138, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !139, file: !40, line: 50, baseType: !9, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !139, file: !40, line: 50, baseType: !9, size: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !139, file: !40, line: 50, baseType: !9, size: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !139, file: !40, line: 50, baseType: !9, size: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !139, file: !40, line: 51, baseType: !147, size: 32, offset: 192)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 32, elements: !93)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !40, line: 25, baseType: !115)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !39, file: !40, line: 591, baseType: !9, size: 32, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !39, file: !40, line: 592, baseType: !138, size: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !39, file: !40, line: 593, baseType: !152, size: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !39, file: !40, line: 596, baseType: !9, size: 32, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !39, file: !40, line: 597, baseType: !70, size: 64, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !39, file: !40, line: 632, baseType: !156, size: 2880, offset: 1152)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !39, file: !40, line: 599, size: 2880, elements: !157)
!157 = !{!158, !208}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !156, file: !40, line: 622, baseType: !159, size: 1728)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !40, line: 601, size: 1728, elements: !160)
!160 = !{!161, !162, !163, !167, !179, !180, !182, !190, !191, !192, !193, !197, !201, !202, !203, !204, !205, !206, !207}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !159, file: !40, line: 603, baseType: !115, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !159, file: !40, line: 604, baseType: !70, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !159, file: !40, line: 605, baseType: !164, size: 208, offset: 128)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 208, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 26)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !159, file: !40, line: 606, baseType: !168, size: 288, offset: 352)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !40, line: 55, size: 288, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !168, file: !40, line: 57, baseType: !9, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !168, file: !40, line: 58, baseType: !9, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !168, file: !40, line: 59, baseType: !9, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !168, file: !40, line: 60, baseType: !9, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !168, file: !40, line: 61, baseType: !9, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !168, file: !40, line: 62, baseType: !9, size: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !168, file: !40, line: 63, baseType: !9, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !168, file: !40, line: 64, baseType: !9, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !168, file: !40, line: 65, baseType: !9, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !159, file: !40, line: 607, baseType: !9, size: 32, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !159, file: !40, line: 608, baseType: !181, size: 64, offset: 704)
!181 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !159, file: !40, line: 609, baseType: !183, size: 112, offset: 768)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !40, line: 319, size: 112, elements: !184)
!184 = !{!185, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !183, file: !40, line: 320, baseType: !186, size: 48)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 48, elements: !89)
!187 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !183, file: !40, line: 321, baseType: !186, size: 48, offset: 48)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !183, file: !40, line: 322, baseType: !187, size: 16, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !159, file: !40, line: 610, baseType: !105, size: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !159, file: !40, line: 611, baseType: !105, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !159, file: !40, line: 612, baseType: !105, size: 64, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !159, file: !40, line: 613, baseType: !194, size: 64, offset: 1088)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 8)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !159, file: !40, line: 614, baseType: !198, size: 192, offset: 1152)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 192, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 24)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !159, file: !40, line: 615, baseType: !9, size: 32, offset: 1344)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !159, file: !40, line: 616, baseType: !105, size: 64, offset: 1376)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !159, file: !40, line: 617, baseType: !105, size: 64, offset: 1440)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !159, file: !40, line: 618, baseType: !105, size: 64, offset: 1504)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !159, file: !40, line: 619, baseType: !105, size: 64, offset: 1568)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !159, file: !40, line: 620, baseType: !105, size: 64, offset: 1632)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !159, file: !40, line: 621, baseType: !9, size: 32, offset: 1696)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !156, file: !40, line: 631, baseType: !209, size: 2880)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !40, line: 626, size: 2880, elements: !210)
!210 = !{!211, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !209, file: !40, line: 629, baseType: !212, size: 1920)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1920, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 30)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !209, file: !40, line: 630, baseType: !216, size: 960, offset: 1920)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 960, elements: !213)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !39, file: !40, line: 636, baseType: !218, size: 64, offset: 4032)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !40, line: 93, size: 6336, elements: !220)
!220 = !{!221, !222, !223, !230}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !219, file: !40, line: 94, baseType: !218, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !219, file: !40, line: 95, baseType: !9, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !219, file: !40, line: 97, baseType: !224, size: 2048, offset: 128)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 2048, elements: !228)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null}
!228 = !{!229}
!229 = !DISubrange(count: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !219, file: !40, line: 98, baseType: !231, size: 4160, offset: 2176)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !40, line: 74, size: 4160, elements: !232)
!232 = !{!233, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !231, file: !40, line: 75, baseType: !234, size: 2048)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, elements: !228)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !231, file: !40, line: 76, baseType: !234, size: 2048, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !231, file: !40, line: 78, baseType: !148, size: 32, offset: 4096)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !231, file: !40, line: 81, baseType: !148, size: 32, offset: 4128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !39, file: !40, line: 637, baseType: !219, size: 6336, offset: 4096)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !39, file: !40, line: 641, baseType: !240, size: 64, offset: 10432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !9}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !39, file: !40, line: 646, baseType: !245, size: 192, offset: 10496)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !40, line: 291, size: 192, elements: !246)
!246 = !{!247, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !245, file: !40, line: 293, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !245, file: !40, line: 294, baseType: !9, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !245, file: !40, line: 295, baseType: !44, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !39, file: !40, line: 648, baseType: !252, size: 4224, offset: 10688)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 4224, elements: !89)
!253 = !DILocation(line: 61, column: 1, scope: !28)
!254 = !DILocation(line: 64, column: 26, scope: !28)
!255 = !DILocation(line: 64, column: 18, scope: !28)
!256 = !DILocation(line: 67, column: 40, scope: !28)
!257 = !DILocation(line: 67, column: 27, scope: !28)
!258 = !DILocation(line: 67, column: 10, scope: !28)
!259 = !DILocation(line: 67, column: 3, scope: !28)
