; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__db = type { i32, i32 (%struct.__db*)*, i32 (%struct.__db*, %struct.DBT*, i32)*, i32 (%struct.__db*, %struct.DBT*, %struct.DBT*, i32)*, i32 (%struct.__db*, %struct.DBT*, %struct.DBT*, i32)*, i32 (%struct.__db*, %struct.DBT*, %struct.DBT*, i32)*, i32 (%struct.__db*, i32)*, i8*, i32 (%struct.__db*)* }
%struct.DBT = type { i8*, i64 }
%struct.HASHINFO = type { i32, i32, i32, i32, i32 (i8*, i64)*, i32 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i64, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.htab = type { %struct.hashhdr, i32, i32, i32 (i8*, i64)*, i32, i32, i8*, i8*, %struct._bufhead*, i32, i32, i32, i32, i32, [32 x i32*], i32, i32, %struct._bufhead, %struct._bufhead*** }
%struct.hashhdr = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [32 x i32], [32 x i16] }
%struct._bufhead = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i32, i8*, i8 }

@__default_hash = external dso_local local_unnamed_addr global i32 (i8*, i64)*, align 8
@.str = private unnamed_addr constant [12 x i8] c"%$sniglet^&\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 76, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/db_local.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "DB_BTREE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "DB_HASH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "DB_RECNO", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 59, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "HASH_GET", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "HASH_PUT", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "HASH_PUTNEW", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "HASH_DELETE", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "HASH_FIRST", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "HASH_NEXT", value: 5, isUnsigned: true)
!19 = !{!20, !101, !113, !136, !99, !32, !160, !72, !142, !164, !165, !29, !98}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTAB", file: !11, line: 138, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !11, line: 111, size: 5248, elements: !23)
!23 = !{!24, !56, !57, !58, !69, !70, !71, !74, !75, !86, !87, !88, !89, !90, !91, !94, !95, !96, !97}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !22, file: !11, line: 112, baseType: !25, size: 2080)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASHHDR", file: !11, line: 109, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashhdr", file: !11, line: 84, size: 2080, elements: !27)
!27 = !{!28, !30, !31, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !52}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !26, file: !11, line: 85, baseType: !29, size: 32)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !26, file: !11, line: 86, baseType: !29, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lorder", scope: !26, file: !11, line: 87, baseType: !32, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 79, baseType: !5)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !26, file: !11, line: 88, baseType: !29, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !26, file: !11, line: 89, baseType: !29, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !26, file: !11, line: 90, baseType: !29, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ssize", scope: !26, file: !11, line: 91, baseType: !29, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sshift", scope: !26, file: !11, line: 92, baseType: !29, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl_point", scope: !26, file: !11, line: 93, baseType: !29, size: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "last_freed", scope: !26, file: !11, line: 95, baseType: !29, size: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "max_bucket", scope: !26, file: !11, line: 96, baseType: !29, size: 32, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "high_mask", scope: !26, file: !11, line: 97, baseType: !29, size: 32, offset: 352)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "low_mask", scope: !26, file: !11, line: 98, baseType: !29, size: 32, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ffactor", scope: !26, file: !11, line: 100, baseType: !29, size: 32, offset: 416)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !26, file: !11, line: 101, baseType: !29, size: 32, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hdrpages", scope: !26, file: !11, line: 102, baseType: !29, size: 32, offset: 480)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "h_charkey", scope: !26, file: !11, line: 103, baseType: !29, size: 32, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "spares", scope: !26, file: !11, line: 106, baseType: !49, size: 1024, offset: 544)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bitmaps", scope: !26, file: !11, line: 107, baseType: !53, size: 512, offset: 1568)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 512, elements: !50)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !33, line: 57, baseType: !55)
!55 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nsegs", scope: !22, file: !11, line: 113, baseType: !29, size: 32, offset: 2080)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "exsegs", scope: !22, file: !11, line: 114, baseType: !29, size: 32, offset: 2112)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !22, file: !11, line: 117, baseType: !59, size: 64, offset: 2176)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!32, !62, !64}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 40, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !67, line: 129, baseType: !68)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !22, file: !11, line: 118, baseType: !29, size: 32, offset: 2240)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !22, file: !11, line: 119, baseType: !29, size: 32, offset: 2272)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !22, file: !11, line: 120, baseType: !72, size: 64, offset: 2304)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_key", scope: !22, file: !11, line: 121, baseType: !72, size: 64, offset: 2368)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cpage", scope: !22, file: !11, line: 122, baseType: !76, size: 64, offset: 2432)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUFHEAD", file: !11, line: 64, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bufhead", file: !11, line: 66, size: 384, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !11, line: 67, baseType: !76, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !11, line: 68, baseType: !76, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl", scope: !78, file: !11, line: 69, baseType: !76, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !78, file: !11, line: 70, baseType: !32, size: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !78, file: !11, line: 71, baseType: !72, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !11, line: 72, baseType: !73, size: 8, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cbucket", scope: !22, file: !11, line: 123, baseType: !29, size: 32, offset: 2496)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cndx", scope: !22, file: !11, line: 124, baseType: !29, size: 32, offset: 2528)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !22, file: !11, line: 125, baseType: !29, size: 32, offset: 2560)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "new_file", scope: !22, file: !11, line: 127, baseType: !29, size: 32, offset: 2592)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "save_file", scope: !22, file: !11, line: 129, baseType: !29, size: 32, offset: 2624)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !22, file: !11, line: 132, baseType: !92, size: 2048, offset: 2688)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !50)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nmaps", scope: !22, file: !11, line: 133, baseType: !29, size: 32, offset: 4736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !22, file: !11, line: 134, baseType: !29, size: 32, offset: 4768)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bufhead", scope: !22, file: !11, line: 136, baseType: !77, size: 384, offset: 4800)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !22, file: !11, line: 137, baseType: !98, size: 64, offset: 5184)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEGMENT", file: !11, line: 81, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASHINFO", file: !4, line: 144, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 136, size: 256, elements: !104)
!104 = !{!105, !108, !109, !110, !111, !112}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !103, file: !4, line: 137, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !107, line: 95, baseType: !5)
!107 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ffactor", scope: !103, file: !4, line: 138, baseType: !106, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !103, file: !4, line: 139, baseType: !106, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cachesize", scope: !103, file: !4, line: 140, baseType: !106, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !103, file: !4, line: 142, baseType: !59, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "lorder", scope: !103, file: !4, line: 143, baseType: !29, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "DB", file: !4, line: 112, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__db", file: !4, line: 102, size: 576, elements: !116)
!116 = !{!117, !119, !124, !138, !143, !147, !151, !155, !156}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !4, line: 103, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBTYPE", file: !4, line: 76, baseType: !3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !115, file: !4, line: 104, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!29, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !115, file: !4, line: 105, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!29, !128, !130, !106}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBT", file: !4, line: 61, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 58, size: 128, elements: !134)
!134 = !{!135, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !4, line: 59, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !4, line: 60, baseType: !64, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !115, file: !4, line: 106, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!29, !128, !130, !142, !106}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !115, file: !4, line: 107, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!29, !128, !142, !130, !106}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !115, file: !4, line: 108, baseType: !148, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!29, !128, !142, !142, !106}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !115, file: !4, line: 109, baseType: !152, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!29, !128, !106}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !115, file: !4, line: 110, baseType: !136, size: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !115, file: !4, line: 111, baseType: !157, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!29, !128}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !107, line: 173, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !67, line: 100, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !67, line: 44, baseType: !163)
!163 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !107, line: 87, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !{i32 2, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!172 = distinct !DISubprogram(name: "__hash_open", scope: !1, file: !1, line: 107, type: !173, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !179)
!173 = !DISubroutineType(types: !174)
!174 = !{!113, !175, !29, !29, !29, !177}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !226, !227, !228, !229, !230, !231}
!180 = !DILocalVariable(name: "file", arg: 1, scope: !172, file: !1, line: 107, type: !175)
!181 = !DILocalVariable(name: "flags", arg: 2, scope: !172, file: !1, line: 107, type: !29)
!182 = !DILocalVariable(name: "mode", arg: 3, scope: !172, file: !1, line: 107, type: !29)
!183 = !DILocalVariable(name: "dflags", arg: 4, scope: !172, file: !1, line: 107, type: !29)
!184 = !DILocalVariable(name: "info", arg: 5, scope: !172, file: !1, line: 107, type: !177)
!185 = !DILocalVariable(name: "hashp", scope: !172, file: !1, line: 114, type: !20)
!186 = !DILocalVariable(name: "statbuf", scope: !172, file: !1, line: 119, type: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !188, line: 27, size: 704, elements: !189)
!188 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/stat.h", directory: "/root/.unikraft/apps/redis/build")
!189 = !{!190, !194, !197, !200, !203, !206, !209, !210, !211, !218, !219, !220, !223}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !187, file: !188, line: 29, baseType: !191, size: 16)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !107, line: 177, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !67, line: 54, baseType: !193)
!193 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !187, file: !188, line: 30, baseType: !195, size: 16, offset: 16)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !107, line: 155, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !67, line: 73, baseType: !55)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !187, file: !188, line: 31, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !107, line: 205, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !67, line: 88, baseType: !32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !187, file: !188, line: 32, baseType: !201, size: 16, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !107, line: 210, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !67, line: 210, baseType: !55)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !187, file: !188, line: 33, baseType: !204, size: 16, offset: 80)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !107, line: 181, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !67, line: 58, baseType: !55)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !187, file: !188, line: 34, baseType: !207, size: 16, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !107, line: 185, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !67, line: 61, baseType: !55)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !187, file: !188, line: 35, baseType: !191, size: 16, offset: 112)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !187, file: !188, line: 36, baseType: !160, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !187, file: !188, line: 37, baseType: !212, size: 128, offset: 192)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !213, line: 52, size: 128, elements: !214)
!213 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!214 = !{!215, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !212, file: !213, line: 53, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !213, line: 34, baseType: !163)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !212, file: !213, line: 54, baseType: !163, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !187, file: !188, line: 38, baseType: !212, size: 128, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !187, file: !188, line: 39, baseType: !212, size: 128, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !187, file: !188, line: 40, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !107, line: 118, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !67, line: 32, baseType: !163)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !187, file: !188, line: 41, baseType: !224, size: 64, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !107, line: 113, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !67, line: 28, baseType: !163)
!226 = !DILocalVariable(name: "dbp", scope: !172, file: !1, line: 121, type: !113)
!227 = !DILocalVariable(name: "bpages", scope: !172, file: !1, line: 122, type: !29)
!228 = !DILocalVariable(name: "hdrsize", scope: !172, file: !1, line: 122, type: !29)
!229 = !DILocalVariable(name: "new_table", scope: !172, file: !1, line: 122, type: !29)
!230 = !DILocalVariable(name: "nsegs", scope: !172, file: !1, line: 122, type: !29)
!231 = !DILocalVariable(name: "save_errno", scope: !172, file: !1, line: 122, type: !29)
!232 = !DILocation(line: 107, column: 1, scope: !172)
!233 = !DILocation(line: 119, column: 2, scope: !172)
!234 = !DILocation(line: 124, column: 13, scope: !235)
!235 = distinct !DILexicalBlock(scope: !172, file: !1, line: 124, column: 6)
!236 = !DILocation(line: 124, column: 26, scope: !235)
!237 = !DILocation(line: 124, column: 6, scope: !172)
!238 = !DILocation(line: 125, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !1, line: 124, column: 39)
!240 = !DILocation(line: 125, column: 9, scope: !239)
!241 = !{!242, !242, i64 0}
!242 = !{!"int", !243, i64 0}
!243 = !{!"omnipotent char", !244, i64 0}
!244 = !{!"Simple C/C++ TBAA"}
!245 = !DILocation(line: 126, column: 3, scope: !239)
!246 = !DILocation(line: 129, column: 24, scope: !247)
!247 = distinct !DILexicalBlock(scope: !172, file: !1, line: 129, column: 6)
!248 = !DILocation(line: 129, column: 16, scope: !247)
!249 = !DILocation(line: 114, column: 8, scope: !172)
!250 = !DILocation(line: 129, column: 14, scope: !247)
!251 = !DILocation(line: 129, column: 6, scope: !172)
!252 = !DILocation(line: 131, column: 9, scope: !172)
!253 = !DILocation(line: 131, column: 12, scope: !172)
!254 = !{!255, !242, i64 284}
!255 = !{!"htab", !256, i64 0, !242, i64 260, !242, i64 264, !257, i64 272, !242, i64 280, !242, i64 284, !257, i64 288, !257, i64 296, !257, i64 304, !242, i64 312, !242, i64 316, !242, i64 320, !242, i64 324, !242, i64 328, !243, i64 336, !242, i64 592, !242, i64 596, !258, i64 600, !257, i64 648}
!256 = !{!"hashhdr", !242, i64 0, !242, i64 4, !242, i64 8, !242, i64 12, !242, i64 16, !242, i64 20, !242, i64 24, !242, i64 28, !242, i64 32, !242, i64 36, !242, i64 40, !242, i64 44, !242, i64 48, !242, i64 52, !242, i64 56, !242, i64 60, !242, i64 64, !243, i64 68, !243, i64 196}
!257 = !{!"any pointer", !243, i64 0}
!258 = !{!"_bufhead", !257, i64 0, !257, i64 8, !257, i64 16, !242, i64 24, !257, i64 32, !243, i64 40}
!259 = !DILocation(line: 139, column: 9, scope: !172)
!260 = !DILocation(line: 139, column: 15, scope: !172)
!261 = !{!255, !242, i64 280}
!262 = !DILocation(line: 122, column: 23, scope: !172)
!263 = !DILocation(line: 142, column: 7, scope: !264)
!264 = distinct !DILexicalBlock(scope: !172, file: !1, line: 142, column: 6)
!265 = !DILocation(line: 142, column: 22, scope: !264)
!266 = !DILocation(line: 142, column: 12, scope: !264)
!267 = !DILocation(line: 119, column: 14, scope: !172)
!268 = !DILocation(line: 146, column: 7, scope: !264)
!269 = !DILocation(line: 146, column: 28, scope: !264)
!270 = !DILocation(line: 146, column: 32, scope: !264)
!271 = !DILocation(line: 146, column: 38, scope: !264)
!272 = !DILocation(line: 142, column: 6, scope: !172)
!273 = !DILocation(line: 148, column: 7, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !1, line: 148, column: 7)
!275 = distinct !DILexicalBlock(scope: !264, file: !1, line: 146, column: 51)
!276 = !DILocation(line: 148, column: 13, scope: !274)
!277 = !DILocation(line: 148, column: 7, scope: !275)
!278 = !DILocation(line: 149, column: 4, scope: !274)
!279 = !DILocation(line: 149, column: 10, scope: !274)
!280 = !DILocation(line: 0, scope: !172)
