; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_bigkey.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_bigkey.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.htab = type { %struct.hashhdr, i32, i32, i32 (i8*, i64)*, i32, i32, i8*, i8*, %struct._bufhead*, i32, i32, i32, i32, i32, [32 x i32*], i32, i32, %struct._bufhead, %struct._bufhead*** }
%struct.hashhdr = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [32 x i32], [32 x i16] }
%struct._bufhead = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i32, i8*, i8 }
%struct.DBT = type { i8*, i64 }
%struct.SPLIT_RETURN = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i16 }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @__big_insert(%struct.htab*, %struct._bufhead*, %struct.DBT* nocapture readonly, %struct.DBT* nocapture readonly) local_unnamed_addr #0 !dbg !20 {
  %5 = getelementptr inbounds %struct._bufhead, %struct._bufhead* %1, i64 0, i32 4, !dbg !127
  %6 = load i8*, i8** %5, align 8, !dbg !127, !tbaa !128
  %7 = bitcast i8* %6 to i16*, !dbg !135
  %8 = getelementptr inbounds %struct.DBT, %struct.DBT* %2, i64 0, i32 1, !dbg !137
  %9 = load i64, i64* %8, align 8, !dbg !137, !tbaa !138

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_bigkey.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !8, !10, !14, !5, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !6, line: 57, baseType: !7)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !12, line: 87, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!20 = distinct !DISubprogram(name: "__big_insert", scope: !1, file: !1, line: 90, type: !21, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: true, unit: !0, retainedNodes: !108)
!21 = !DISubroutineType(types: !22)
!22 = !{!14, !23, !75, !100, !100}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTAB", file: !25, line: 138, baseType: !26)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.h", directory: "/root/.unikraft/apps/redis/build")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !25, line: 111, size: 5248, elements: !27)
!27 = !{!28, !57, !58, !59, !70, !71, !72, !73, !74, !85, !86, !87, !88, !89, !90, !93, !94, !95, !96}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !26, file: !25, line: 112, baseType: !29, size: 2080)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASHHDR", file: !25, line: 109, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashhdr", file: !25, line: 84, size: 2080, elements: !31)
!31 = !{!32, !33, !34, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !55}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !30, file: !25, line: 85, baseType: !14, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !30, file: !25, line: 86, baseType: !14, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "lorder", scope: !30, file: !25, line: 87, baseType: !35, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !6, line: 79, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !30, file: !25, line: 88, baseType: !14, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !30, file: !25, line: 89, baseType: !14, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !30, file: !25, line: 90, baseType: !14, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ssize", scope: !30, file: !25, line: 91, baseType: !14, size: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sshift", scope: !30, file: !25, line: 92, baseType: !14, size: 32, offset: 224)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl_point", scope: !30, file: !25, line: 93, baseType: !14, size: 32, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "last_freed", scope: !30, file: !25, line: 95, baseType: !14, size: 32, offset: 288)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "max_bucket", scope: !30, file: !25, line: 96, baseType: !14, size: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "high_mask", scope: !30, file: !25, line: 97, baseType: !14, size: 32, offset: 352)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "low_mask", scope: !30, file: !25, line: 98, baseType: !14, size: 32, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ffactor", scope: !30, file: !25, line: 100, baseType: !14, size: 32, offset: 416)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !30, file: !25, line: 101, baseType: !14, size: 32, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hdrpages", scope: !30, file: !25, line: 102, baseType: !14, size: 32, offset: 480)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "h_charkey", scope: !30, file: !25, line: 103, baseType: !14, size: 32, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "spares", scope: !30, file: !25, line: 106, baseType: !52, size: 1024, offset: 544)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bitmaps", scope: !30, file: !25, line: 107, baseType: !56, size: 512, offset: 1568)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, elements: !53)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nsegs", scope: !26, file: !25, line: 113, baseType: !14, size: 32, offset: 2080)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "exsegs", scope: !26, file: !25, line: 114, baseType: !14, size: 32, offset: 2112)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !26, file: !25, line: 117, baseType: !60, size: 64, offset: 2176)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!35, !63, !65}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 40, baseType: !67)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !68, line: 129, baseType: !69)
!68 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !25, line: 118, baseType: !14, size: 32, offset: 2240)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !26, file: !25, line: 119, baseType: !14, size: 32, offset: 2272)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !26, file: !25, line: 120, baseType: !8, size: 64, offset: 2304)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_key", scope: !26, file: !25, line: 121, baseType: !8, size: 64, offset: 2368)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cpage", scope: !26, file: !25, line: 122, baseType: !75, size: 64, offset: 2432)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUFHEAD", file: !25, line: 64, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bufhead", file: !25, line: 66, size: 384, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !25, line: 67, baseType: !75, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !25, line: 68, baseType: !75, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl", scope: !77, file: !25, line: 69, baseType: !75, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !77, file: !25, line: 70, baseType: !35, size: 32, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !77, file: !25, line: 71, baseType: !8, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !25, line: 72, baseType: !9, size: 8, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cbucket", scope: !26, file: !25, line: 123, baseType: !14, size: 32, offset: 2496)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cndx", scope: !26, file: !25, line: 124, baseType: !14, size: 32, offset: 2528)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !26, file: !25, line: 125, baseType: !14, size: 32, offset: 2560)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "new_file", scope: !26, file: !25, line: 127, baseType: !14, size: 32, offset: 2592)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "save_file", scope: !26, file: !25, line: 129, baseType: !14, size: 32, offset: 2624)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !26, file: !25, line: 132, baseType: !91, size: 2048, offset: 2688)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2048, elements: !53)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nmaps", scope: !26, file: !25, line: 133, baseType: !14, size: 32, offset: 4736)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !26, file: !25, line: 134, baseType: !14, size: 32, offset: 4768)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bufhead", scope: !26, file: !25, line: 136, baseType: !76, size: 384, offset: 4800)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !26, file: !25, line: 137, baseType: !97, size: 64, offset: 5184)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEGMENT", file: !25, line: 81, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBT", file: !103, line: 61, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/db_local.h", directory: "/root/.unikraft/apps/redis/build")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 58, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !103, line: 59, baseType: !15, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !103, line: 60, baseType: !65, size: 64, offset: 64)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!109 = !DILocalVariable(name: "hashp", arg: 1, scope: !20, file: !1, line: 91, type: !23)
!110 = !DILocalVariable(name: "bufp", arg: 2, scope: !20, file: !1, line: 92, type: !75)
!111 = !DILocalVariable(name: "key", arg: 3, scope: !20, file: !1, line: 93, type: !100)
!112 = !DILocalVariable(name: "val", arg: 4, scope: !20, file: !1, line: 93, type: !100)
!113 = !DILocalVariable(name: "p", scope: !20, file: !1, line: 95, type: !4)
!114 = !DILocalVariable(name: "key_size", scope: !20, file: !1, line: 96, type: !14)
!115 = !DILocalVariable(name: "n", scope: !20, file: !1, line: 96, type: !14)
!116 = !DILocalVariable(name: "val_size", scope: !20, file: !1, line: 96, type: !14)
!117 = !DILocalVariable(name: "space", scope: !20, file: !1, line: 97, type: !5)
!118 = !DILocalVariable(name: "move_bytes", scope: !20, file: !1, line: 97, type: !5)
!119 = !DILocalVariable(name: "off", scope: !20, file: !1, line: 97, type: !5)
!120 = !DILocalVariable(name: "cp", scope: !20, file: !1, line: 98, type: !8)
!121 = !DILocalVariable(name: "key_data", scope: !20, file: !1, line: 98, type: !8)
!122 = !DILocalVariable(name: "val_data", scope: !20, file: !1, line: 98, type: !8)
!123 = !DILocation(line: 91, column: 8, scope: !20)
!124 = !DILocation(line: 92, column: 11, scope: !20)
!125 = !DILocation(line: 93, column: 13, scope: !20)
!126 = !DILocation(line: 93, column: 19, scope: !20)
!127 = !DILocation(line: 100, column: 13, scope: !20)
!128 = !{!129, !130, i64 32}
!129 = !{!"_bufhead", !130, i64 0, !130, i64 8, !130, i64 16, !133, i64 24, !130, i64 32, !131, i64 40}
!130 = !{!"any pointer", !131, i64 0}
!131 = !{!"omnipotent char", !132, i64 0}
!132 = !{!"Simple C/C++ TBAA"}
!133 = !{!"int", !131, i64 0}
!134 = !DILocation(line: 98, column: 8, scope: !20)
!135 = !DILocation(line: 101, column: 6, scope: !20)
!136 = !DILocation(line: 95, column: 14, scope: !20)
!137 = !DILocation(line: 104, column: 18, scope: !20)
!138 = !{!139, !140, i64 8}
!139 = !{!"", !130, i64 0, !140, i64 8}
!140 = !{!"long", !131, i64 0}
!141 = !DILocation(line: 104, column: 13, scope: !20)
!142 = !DILocation(line: 96, column: 6, scope: !20)
!143 = !DILocation(line: 105, column: 26, scope: !20)
!144 = !{!139, !130, i64 0}
!145 = !DILocation(line: 98, column: 24, scope: !20)
!146 = !DILocation(line: 106, column: 18, scope: !20)
!147 = !DILocation(line: 106, column: 13, scope: !20)
!148 = !DILocation(line: 96, column: 19, scope: !20)
!149 = !DILocation(line: 109, column: 15, scope: !150)
!150 = distinct !DILexicalBlock(scope: !20, file: !1, line: 109, column: 2)
!151 = !{!152, !152, i64 0}
!152 = !{!"short", !131, i64 0}
!153 = !DILocation(line: 97, column: 13, scope: !20)
!154 = !DILocation(line: 109, column: 2, scope: !150)
!155 = !DILocation(line: 103, column: 26, scope: !20)
!156 = !DILocation(line: 98, column: 13, scope: !20)
!157 = !DILocation(line: 0, scope: !158)
!158 = distinct !DILexicalBlock(scope: !150, file: !1, line: 109, column: 2)
!159 = !DILocation(line: 112, column: 9, scope: !160)
!160 = distinct !DILexicalBlock(scope: !158, file: !1, line: 110, column: 42)
!161 = !DILocation(line: 111, column: 16, scope: !160)
!162 = !DILocation(line: 112, column: 21, scope: !160)
!163 = !DILocation(line: 97, column: 32, scope: !20)
!164 = !DILocation(line: 113, column: 14, scope: !160)
!165 = !DILocation(line: 113, column: 31, scope: !160)
!166 = !DILocation(line: 113, column: 3, scope: !160)
!167 = !DILocation(line: 114, column: 12, scope: !160)
!168 = !DILocation(line: 115, column: 12, scope: !160)
!169 = !DILocation(line: 116, column: 7, scope: !160)
!170 = !DILocation(line: 96, column: 16, scope: !20)
!171 = !DILocation(line: 117, column: 5, scope: !160)
!172 = !DILocation(line: 117, column: 3, scope: !160)
!173 = !DILocation(line: 117, column: 10, scope: !160)
!174 = !DILocation(line: 118, column: 10, scope: !160)
!175 = !DILocation(line: 118, column: 8, scope: !160)
!176 = !DILocation(line: 119, column: 24, scope: !160)
!177 = !DILocation(line: 119, column: 22, scope: !160)
!178 = !DILocation(line: 119, column: 3, scope: !160)
!179 = !DILocation(line: 119, column: 16, scope: !160)
!180 = !DILocation(line: 120, column: 3, scope: !160)
!181 = !DILocation(line: 120, column: 13, scope: !160)
!182 = !DILocation(line: 121, column: 3, scope: !160)
!183 = !DILocation(line: 121, column: 8, scope: !160)
!184 = !DILocation(line: 122, column: 10, scope: !160)
!185 = !DILocation(line: 123, column: 8, scope: !186)
!186 = distinct !DILexicalBlock(scope: !160, file: !1, line: 123, column: 7)
!187 = !DILocation(line: 123, column: 7, scope: !160)
!188 = !DILocation(line: 125, column: 7, scope: !160)
!189 = !DILocation(line: 126, column: 8, scope: !190)
!190 = distinct !DILexicalBlock(scope: !160, file: !1, line: 126, column: 7)
!191 = !DILocation(line: 126, column: 7, scope: !160)
!192 = !DILocation(line: 127, column: 8, scope: !193)
!193 = distinct !DILexicalBlock(scope: !194, file: !1, line: 127, column: 8)
!194 = distinct !DILexicalBlock(scope: !190, file: !1, line: 126, column: 18)
!195 = !DILocation(line: 127, column: 8, scope: !194)
!196 = !DILocation(line: 128, column: 18, scope: !197)
!197 = distinct !DILexicalBlock(scope: !193, file: !1, line: 127, column: 22)
!198 = !DILocation(line: 129, column: 11, scope: !197)
!199 = !DILocation(line: 129, column: 23, scope: !197)
!200 = !DILocation(line: 130, column: 5, scope: !197)
!201 = !DILocation(line: 130, column: 10, scope: !197)
!202 = !DILocation(line: 131, column: 16, scope: !197)
!203 = !DILocation(line: 131, column: 33, scope: !197)
!204 = !DILocation(line: 131, column: 5, scope: !197)
!205 = !DILocation(line: 132, column: 14, scope: !197)
!206 = !DILocation(line: 133, column: 14, scope: !197)
!207 = !DILocation(line: 134, column: 9, scope: !197)
!208 = !DILocation(line: 134, column: 5, scope: !197)
!209 = !DILocation(line: 134, column: 14, scope: !197)
!210 = !DILocation(line: 135, column: 20, scope: !197)
!211 = !DILocation(line: 135, column: 18, scope: !197)
!212 = !DILocation(line: 136, column: 5, scope: !197)
!213 = !DILocation(line: 137, column: 4, scope: !197)
!214 = !DILocation(line: 138, column: 9, scope: !193)
!215 = !DILocation(line: 138, column: 5, scope: !193)
!216 = !DILocation(line: 0, scope: !193)
!217 = !DILocation(line: 140, column: 27, scope: !160)
!218 = !DILocation(line: 0, scope: !20)
!219 = !DILocation(line: 140, column: 7, scope: !160)
!220 = !DILocation(line: 142, column: 9, scope: !160)
!221 = !DILocation(line: 142, column: 15, scope: !160)
!222 = !{!129, !131, i64 40}
!223 = !DILocation(line: 110, column: 14, scope: !158)
!224 = distinct !{!224, !154, !225}
!225 = !DILocation(line: 143, column: 2, scope: !150)
!226 = !DILocation(line: 146, column: 2, scope: !227)
!227 = distinct !DILexicalBlock(scope: !20, file: !1, line: 146, column: 2)
!228 = !DILocation(line: 146, column: 15, scope: !227)
!229 = !DILocation(line: 0, scope: !160)
!230 = !DILocation(line: 106, column: 11, scope: !20)
!231 = !DILocation(line: 105, column: 11, scope: !20)
!232 = !DILocation(line: 0, scope: !233)
!233 = distinct !DILexicalBlock(scope: !227, file: !1, line: 146, column: 2)
!234 = !DILocation(line: 148, column: 16, scope: !235)
!235 = distinct !DILexicalBlock(scope: !233, file: !1, line: 147, column: 42)
!236 = !DILocation(line: 97, column: 20, scope: !20)
!237 = !DILocation(line: 153, column: 13, scope: !238)
!238 = distinct !DILexicalBlock(scope: !235, file: !1, line: 153, column: 7)
!239 = !DILocation(line: 153, column: 25, scope: !238)
!240 = !DILocation(line: 153, column: 28, scope: !238)
!241 = !DILocation(line: 153, column: 45, scope: !238)
!242 = !DILocation(line: 153, column: 37, scope: !238)
!243 = !DILocation(line: 153, column: 7, scope: !235)
!244 = !DILocation(line: 0, scope: !235)
!245 = !DILocation(line: 155, column: 9, scope: !235)
!246 = !DILocation(line: 155, column: 21, scope: !235)
!247 = !DILocation(line: 155, column: 19, scope: !235)
!248 = !DILocation(line: 156, column: 14, scope: !235)
!249 = !DILocation(line: 156, column: 31, scope: !235)
!250 = !DILocation(line: 156, column: 3, scope: !235)
!251 = !DILocation(line: 157, column: 12, scope: !235)
!252 = !DILocation(line: 158, column: 12, scope: !235)
!253 = !DILocation(line: 159, column: 7, scope: !235)
!254 = !DILocation(line: 160, column: 5, scope: !235)
!255 = !DILocation(line: 160, column: 3, scope: !235)
!256 = !DILocation(line: 160, column: 10, scope: !235)
!257 = !DILocation(line: 161, column: 10, scope: !235)
!258 = !DILocation(line: 161, column: 8, scope: !235)
!259 = !DILocation(line: 162, column: 24, scope: !235)
!260 = !DILocation(line: 162, column: 22, scope: !235)
!261 = !DILocation(line: 162, column: 3, scope: !235)
!262 = !DILocation(line: 162, column: 16, scope: !235)
!263 = !DILocation(line: 163, column: 3, scope: !235)
!264 = !DILocation(line: 163, column: 13, scope: !235)
!265 = !DILocation(line: 164, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !235, file: !1, line: 164, column: 7)
!267 = !DILocation(line: 0, scope: !266)
!268 = !DILocation(line: 164, column: 7, scope: !235)
!269 = !DILocation(line: 165, column: 9, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !1, line: 164, column: 17)
!271 = !DILocation(line: 166, column: 11, scope: !270)
!272 = !DILocation(line: 167, column: 9, scope: !273)
!273 = distinct !DILexicalBlock(scope: !270, file: !1, line: 167, column: 8)
!274 = !DILocation(line: 167, column: 8, scope: !270)
!275 = !DILocation(line: 169, column: 15, scope: !270)
!276 = !DILocation(line: 170, column: 8, scope: !270)
!277 = !DILocation(line: 147, column: 14, scope: !233)
!278 = !DILocation(line: 171, column: 3, scope: !270)
!279 = !DILocation(line: 172, column: 9, scope: !266)
!280 = !DILocation(line: 173, column: 9, scope: !235)
!281 = !DILocation(line: 173, column: 15, scope: !235)
!282 = distinct !{!282, !226, !283}
!283 = !DILocation(line: 174, column: 2, scope: !227)
!284 = !DILocation(line: 176, column: 1, scope: !20)
!285 = distinct !DISubprogram(name: "__big_delete", scope: !1, file: !1, line: 190, type: !286, isLocal: false, isDefinition: true, scopeLine: 193, isOptimized: true, unit: !0, retainedNodes: !288)
!286 = !DISubroutineType(types: !287)
!287 = !{!14, !23, !75}
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296}
!289 = !DILocalVariable(name: "hashp", arg: 1, scope: !285, file: !1, line: 191, type: !23)
!290 = !DILocalVariable(name: "bufp", arg: 2, scope: !285, file: !1, line: 192, type: !75)
!291 = !DILocalVariable(name: "last_bfp", scope: !285, file: !1, line: 194, type: !75)
!292 = !DILocalVariable(name: "rbufp", scope: !285, file: !1, line: 194, type: !75)
!293 = !DILocalVariable(name: "bp", scope: !285, file: !1, line: 195, type: !4)
!294 = !DILocalVariable(name: "pageno", scope: !285, file: !1, line: 195, type: !5)
!295 = !DILocalVariable(name: "key_done", scope: !285, file: !1, line: 196, type: !14)
!296 = !DILocalVariable(name: "n", scope: !285, file: !1, line: 196, type: !14)
!297 = !DILocation(line: 191, column: 8, scope: !285)
!298 = !DILocation(line: 192, column: 11, scope: !285)
!299 = !DILocation(line: 194, column: 22, scope: !285)
!300 = !DILocation(line: 194, column: 11, scope: !285)
!301 = !DILocation(line: 200, column: 27, scope: !285)
!302 = !DILocation(line: 195, column: 14, scope: !285)
!303 = !DILocation(line: 195, column: 18, scope: !285)
!304 = !DILocation(line: 196, column: 6, scope: !285)
!305 = !DILocation(line: 204, column: 2, scope: !285)
!306 = !DILocation(line: 0, scope: !307)
!307 = distinct !DILexicalBlock(scope: !285, file: !1, line: 204, column: 48)
!308 = !DILocation(line: 0, scope: !309)
!309 = distinct !DILexicalBlock(scope: !307, file: !1, line: 205, column: 7)
!310 = !DILocation(line: 204, column: 10, scope: !285)
!311 = !DILocation(line: 0, scope: !285)
!312 = !DILocation(line: 204, column: 19, scope: !285)
!313 = !DILocation(line: 204, column: 29, scope: !285)
!314 = !DILocation(line: 205, column: 25, scope: !309)
!315 = !DILocation(line: 213, column: 30, scope: !316)
!316 = distinct !DILexicalBlock(scope: !307, file: !1, line: 213, column: 7)
!317 = !DILocation(line: 234, column: 6, scope: !285)
!318 = !DILocation(line: 213, column: 13, scope: !316)
!319 = !DILocation(line: 215, column: 15, scope: !307)
!320 = !DILocation(line: 213, column: 33, scope: !316)
!321 = !DILocation(line: 213, column: 7, scope: !307)
!322 = !DILocation(line: 215, column: 21, scope: !307)
!323 = !DILocation(line: 215, column: 12, scope: !307)
!324 = !DILocation(line: 216, column: 10, scope: !307)
!325 = !DILocation(line: 216, column: 16, scope: !307)
!326 = !DILocation(line: 217, column: 28, scope: !307)
!327 = !DILocation(line: 217, column: 11, scope: !307)
!328 = !DILocation(line: 218, column: 7, scope: !329)
!329 = distinct !DILexicalBlock(scope: !307, file: !1, line: 218, column: 7)
!330 = !DILocation(line: 218, column: 7, scope: !307)
!331 = !DILocation(line: 219, column: 4, scope: !329)
!332 = !DILocation(line: 221, column: 8, scope: !333)
!333 = distinct !DILexicalBlock(scope: !307, file: !1, line: 221, column: 7)
!334 = !DILocation(line: 223, column: 29, scope: !307)
!335 = !DILocation(line: 221, column: 7, scope: !307)
!336 = distinct !{!336, !305, !337}
!337 = !DILocation(line: 224, column: 2, scope: !285)
!338 = !DILocation(line: 238, column: 27, scope: !285)
!339 = !DILocation(line: 239, column: 8, scope: !340)
!340 = distinct !DILexicalBlock(scope: !285, file: !1, line: 239, column: 6)
!341 = !DILocation(line: 239, column: 6, scope: !285)
!342 = !DILocation(line: 235, column: 16, scope: !285)
!343 = !DILocation(line: 235, column: 11, scope: !285)
!344 = !DILocation(line: 241, column: 3, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !1, line: 239, column: 13)
!346 = !DILocation(line: 241, column: 9, scope: !345)
!347 = !DILocation(line: 242, column: 3, scope: !345)
!348 = !DILocation(line: 242, column: 9, scope: !345)
!349 = !DILocation(line: 243, column: 23, scope: !345)
!350 = !{!129, !130, i64 16}
!351 = !DILocation(line: 243, column: 9, scope: !345)
!352 = !DILocation(line: 243, column: 14, scope: !345)
!353 = !DILocation(line: 244, column: 2, scope: !345)
!354 = !DILocation(line: 246, column: 9, scope: !340)
!355 = !DILocation(line: 246, column: 14, scope: !340)
!356 = !DILocation(line: 247, column: 4, scope: !285)
!357 = !DILocation(line: 248, column: 8, scope: !285)
!358 = !DILocation(line: 249, column: 25, scope: !285)
!359 = !{!360, !133, i64 12}
!360 = !{!"htab", !361, i64 0, !133, i64 260, !133, i64 264, !130, i64 272, !133, i64 280, !133, i64 284, !130, i64 288, !130, i64 296, !130, i64 304, !133, i64 312, !133, i64 316, !133, i64 320, !133, i64 324, !133, i64 328, !131, i64 336, !133, i64 592, !133, i64 596, !129, i64 600, !130, i64 648}
!361 = !{!"hashhdr", !133, i64 0, !133, i64 4, !133, i64 8, !133, i64 12, !133, i64 16, !133, i64 20, !133, i64 24, !133, i64 28, !133, i64 32, !133, i64 36, !133, i64 40, !133, i64 44, !133, i64 48, !133, i64 52, !133, i64 56, !133, i64 60, !133, i64 64, !131, i64 68, !131, i64 196}
!362 = !DILocation(line: 249, column: 18, scope: !285)
!363 = !DILocation(line: 249, column: 33, scope: !285)
!364 = !DILocation(line: 249, column: 31, scope: !285)
!365 = !DILocation(line: 249, column: 2, scope: !285)
!366 = !DILocation(line: 249, column: 16, scope: !285)
!367 = !DILocation(line: 250, column: 15, scope: !285)
!368 = !DILocation(line: 250, column: 2, scope: !285)
!369 = !DILocation(line: 250, column: 13, scope: !285)
!370 = !DILocation(line: 252, column: 8, scope: !285)
!371 = !DILocation(line: 252, column: 14, scope: !285)
!372 = !DILocation(line: 253, column: 6, scope: !373)
!373 = distinct !DILexicalBlock(scope: !285, file: !1, line: 253, column: 6)
!374 = !DILocation(line: 253, column: 6, scope: !285)
!375 = !DILocation(line: 254, column: 3, scope: !373)
!376 = !DILocation(line: 255, column: 15, scope: !377)
!377 = distinct !DILexicalBlock(scope: !285, file: !1, line: 255, column: 6)
!378 = !DILocation(line: 255, column: 6, scope: !285)
!379 = !DILocation(line: 256, column: 3, scope: !377)
!380 = !DILocation(line: 258, column: 9, scope: !285)
!381 = !DILocation(line: 258, column: 14, scope: !285)
!382 = !{!360, !133, i64 56}
!383 = !DILocation(line: 259, column: 2, scope: !285)
!384 = !DILocation(line: 0, scope: !333)
!385 = !DILocation(line: 260, column: 1, scope: !285)
!386 = distinct !DISubprogram(name: "__find_bigpair", scope: !1, file: !1, line: 269, type: !387, isLocal: false, isDefinition: true, scopeLine: 275, isOptimized: true, unit: !0, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!14, !23, !75, !14, !8, !14}
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!390 = !DILocalVariable(name: "hashp", arg: 1, scope: !386, file: !1, line: 270, type: !23)
!391 = !DILocalVariable(name: "bufp", arg: 2, scope: !386, file: !1, line: 271, type: !75)
!392 = !DILocalVariable(name: "ndx", arg: 3, scope: !386, file: !1, line: 272, type: !14)
!393 = !DILocalVariable(name: "key", arg: 4, scope: !386, file: !1, line: 273, type: !8)
!394 = !DILocalVariable(name: "size", arg: 5, scope: !386, file: !1, line: 274, type: !14)
!395 = !DILocalVariable(name: "bp", scope: !386, file: !1, line: 276, type: !4)
!396 = !DILocalVariable(name: "p", scope: !386, file: !1, line: 277, type: !8)
!397 = !DILocalVariable(name: "ksize", scope: !386, file: !1, line: 278, type: !14)
!398 = !DILocalVariable(name: "bytes", scope: !386, file: !1, line: 279, type: !5)
!399 = !DILocalVariable(name: "kkey", scope: !386, file: !1, line: 280, type: !8)
!400 = !DILocation(line: 270, column: 8, scope: !386)
!401 = !DILocation(line: 271, column: 11, scope: !386)
!402 = !DILocation(line: 272, column: 6, scope: !386)
!403 = !DILocation(line: 273, column: 8, scope: !386)
!404 = !DILocation(line: 274, column: 6, scope: !386)
!405 = !DILocation(line: 282, column: 27, scope: !386)
!406 = !DILocation(line: 282, column: 7, scope: !386)
!407 = !DILocation(line: 276, column: 14, scope: !386)
!408 = !DILocation(line: 277, column: 8, scope: !386)
!409 = !DILocation(line: 278, column: 6, scope: !386)
!410 = !DILocation(line: 280, column: 8, scope: !386)
!411 = !DILocation(line: 287, column: 22, scope: !412)
!412 = distinct !DILexicalBlock(scope: !386, file: !1, line: 287, column: 2)
!413 = !DILocation(line: 287, column: 30, scope: !412)
!414 = !DILocation(line: 287, column: 15, scope: !412)
!415 = !DILocation(line: 279, column: 13, scope: !386)
!416 = !DILocation(line: 288, column: 6, scope: !417)
!417 = distinct !DILexicalBlock(scope: !412, file: !1, line: 287, column: 2)
!418 = !DILocation(line: 288, column: 12, scope: !417)
!419 = !DILocation(line: 288, column: 20, scope: !417)
!420 = !DILocation(line: 288, column: 30, scope: !417)
!421 = !DILocation(line: 288, column: 23, scope: !417)
!422 = !DILocation(line: 288, column: 35, scope: !417)
!423 = !DILocation(line: 287, column: 2, scope: !412)
!424 = !DILocation(line: 290, column: 18, scope: !425)
!425 = distinct !DILexicalBlock(scope: !426, file: !1, line: 290, column: 7)
!426 = distinct !DILexicalBlock(scope: !417, file: !1, line: 289, column: 38)
!427 = !DILocation(line: 290, column: 16, scope: !425)
!428 = !DILocation(line: 290, column: 33, scope: !425)
!429 = !DILocation(line: 290, column: 7, scope: !425)
!430 = !DILocation(line: 290, column: 7, scope: !426)
!431 = !DILocation(line: 294, column: 34, scope: !426)
!432 = !DILocation(line: 294, column: 27, scope: !426)
!433 = !DILocation(line: 294, column: 10, scope: !426)
!434 = !DILocation(line: 295, column: 8, scope: !435)
!435 = distinct !DILexicalBlock(scope: !426, file: !1, line: 295, column: 7)
!436 = !DILocation(line: 295, column: 7, scope: !426)
!437 = !DILocation(line: 293, column: 9, scope: !426)
!438 = !DILocation(line: 292, column: 8, scope: !426)
!439 = !DILocation(line: 297, column: 13, scope: !426)
!440 = !DILocation(line: 298, column: 8, scope: !426)
!441 = !DILocation(line: 289, column: 21, scope: !417)
!442 = !DILocation(line: 289, column: 29, scope: !417)
!443 = !DILocation(line: 289, column: 14, scope: !417)
!444 = distinct !{!444, !423, !445}
!445 = !DILocation(line: 300, column: 2, scope: !412)
!446 = !DILocation(line: 302, column: 12, scope: !447)
!447 = distinct !DILexicalBlock(scope: !386, file: !1, line: 302, column: 6)
!448 = !DILocation(line: 0, scope: !426)
!449 = !DILocation(line: 0, scope: !417)
!450 = !DILocation(line: 302, column: 21, scope: !447)
!451 = !DILocation(line: 302, column: 35, scope: !447)
!452 = !DILocation(line: 302, column: 33, scope: !447)
!453 = !DILocation(line: 302, column: 50, scope: !447)
!454 = !DILocation(line: 302, column: 24, scope: !447)
!455 = !DILocation(line: 302, column: 6, scope: !386)
!456 = !DILocation(line: 0, scope: !447)
!457 = !DILocation(line: 309, column: 1, scope: !386)
!458 = distinct !DISubprogram(name: "__find_last_page", scope: !1, file: !1, line: 321, type: !459, isLocal: false, isDefinition: true, scopeLine: 324, isOptimized: true, unit: !0, retainedNodes: !461)
!459 = !DISubroutineType(types: !460)
!460 = !{!5, !23, !99}
!461 = !{!462, !463, !464, !465, !466, !467}
!462 = !DILocalVariable(name: "hashp", arg: 1, scope: !458, file: !1, line: 322, type: !23)
!463 = !DILocalVariable(name: "bpp", arg: 2, scope: !458, file: !1, line: 323, type: !99)
!464 = !DILocalVariable(name: "bufp", scope: !458, file: !1, line: 325, type: !75)
!465 = !DILocalVariable(name: "bp", scope: !458, file: !1, line: 326, type: !4)
!466 = !DILocalVariable(name: "pageno", scope: !458, file: !1, line: 326, type: !5)
!467 = !DILocalVariable(name: "n", scope: !458, file: !1, line: 327, type: !14)
!468 = !DILocation(line: 322, column: 8, scope: !458)
!469 = !DILocation(line: 323, column: 12, scope: !458)
!470 = !DILocation(line: 329, column: 9, scope: !458)
!471 = !{!130, !130, i64 0}
!472 = !DILocation(line: 325, column: 11, scope: !458)
!473 = !DILocation(line: 326, column: 14, scope: !458)
!474 = !DILocation(line: 331, column: 2, scope: !458)
!475 = !DILocation(line: 0, scope: !476)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 331, column: 11)
!477 = distinct !DILexicalBlock(scope: !478, file: !1, line: 331, column: 2)
!478 = distinct !DILexicalBlock(scope: !458, file: !1, line: 331, column: 2)
!479 = !DILocation(line: 332, column: 7, scope: !476)
!480 = !DILocation(line: 327, column: 6, scope: !458)
!481 = !DILocation(line: 339, column: 7, scope: !482)
!482 = distinct !DILexicalBlock(scope: !476, file: !1, line: 339, column: 7)
!483 = !DILocation(line: 339, column: 13, scope: !482)
!484 = !DILocation(line: 339, column: 30, scope: !482)
!485 = !DILocation(line: 340, column: 11, scope: !482)
!486 = !DILocation(line: 340, column: 17, scope: !482)
!487 = !DILocation(line: 350, column: 7, scope: !458)
!488 = !DILocation(line: 351, column: 6, scope: !458)
!489 = !DILocation(line: 340, column: 21, scope: !482)
!490 = !DILocation(line: 340, column: 27, scope: !482)
!491 = !DILocation(line: 340, column: 40, scope: !482)
!492 = !DILocation(line: 340, column: 44, scope: !482)
!493 = !DILocation(line: 340, column: 43, scope: !482)
!494 = !DILocation(line: 339, column: 7, scope: !476)
!495 = !DILocation(line: 343, column: 17, scope: !476)
!496 = !DILocation(line: 343, column: 12, scope: !476)
!497 = !DILocation(line: 326, column: 18, scope: !458)
!498 = !DILocation(line: 344, column: 27, scope: !476)
!499 = !DILocation(line: 344, column: 10, scope: !476)
!500 = !DILocation(line: 345, column: 8, scope: !501)
!501 = distinct !DILexicalBlock(scope: !476, file: !1, line: 345, column: 7)
!502 = !DILocation(line: 345, column: 7, scope: !476)
!503 = distinct !{!503, !504, !505}
!504 = !DILocation(line: 331, column: 2, scope: !478)
!505 = !DILocation(line: 348, column: 2, scope: !478)
!506 = !DILocation(line: 351, column: 12, scope: !507)
!507 = distinct !DILexicalBlock(scope: !458, file: !1, line: 351, column: 6)
!508 = !DILocation(line: 352, column: 11, scope: !507)
!509 = !DILocation(line: 352, column: 3, scope: !507)
!510 = !DILocation(line: 0, scope: !501)
!511 = !DILocation(line: 355, column: 1, scope: !458)
!512 = distinct !DISubprogram(name: "__big_return", scope: !1, file: !1, line: 362, type: !513, isLocal: false, isDefinition: true, scopeLine: 368, isOptimized: true, unit: !0, retainedNodes: !516)
!513 = !DISubroutineType(types: !514)
!514 = !{!14, !23, !75, !14, !515, !14}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!517 = !DILocalVariable(name: "hashp", arg: 1, scope: !512, file: !1, line: 363, type: !23)
!518 = !DILocalVariable(name: "bufp", arg: 2, scope: !512, file: !1, line: 364, type: !75)
!519 = !DILocalVariable(name: "ndx", arg: 3, scope: !512, file: !1, line: 365, type: !14)
!520 = !DILocalVariable(name: "val", arg: 4, scope: !512, file: !1, line: 366, type: !515)
!521 = !DILocalVariable(name: "set_current", arg: 5, scope: !512, file: !1, line: 367, type: !14)
!522 = !DILocalVariable(name: "save_p", scope: !512, file: !1, line: 369, type: !75)
!523 = !DILocalVariable(name: "bp", scope: !512, file: !1, line: 370, type: !4)
!524 = !DILocalVariable(name: "len", scope: !512, file: !1, line: 370, type: !5)
!525 = !DILocalVariable(name: "off", scope: !512, file: !1, line: 370, type: !5)
!526 = !DILocalVariable(name: "save_addr", scope: !512, file: !1, line: 370, type: !5)
!527 = !DILocalVariable(name: "tp", scope: !512, file: !1, line: 371, type: !8)
!528 = !DILocation(line: 363, column: 8, scope: !512)
!529 = !DILocation(line: 364, column: 11, scope: !512)
!530 = !DILocation(line: 365, column: 6, scope: !512)
!531 = !DILocation(line: 366, column: 7, scope: !512)
!532 = !DILocation(line: 367, column: 6, scope: !512)
!533 = !DILocation(line: 373, column: 27, scope: !512)
!534 = !DILocation(line: 370, column: 14, scope: !512)
!535 = !DILocation(line: 374, column: 2, scope: !512)
!536 = !DILocation(line: 0, scope: !537)
!537 = distinct !DILexicalBlock(scope: !512, file: !1, line: 374, column: 37)
!538 = !DILocation(line: 374, column: 9, scope: !512)
!539 = !DILocation(line: 375, column: 30, scope: !537)
!540 = !DILocation(line: 375, column: 36, scope: !537)
!541 = !DILocation(line: 375, column: 27, scope: !537)
!542 = !DILocation(line: 375, column: 10, scope: !537)
!543 = !DILocation(line: 376, column: 8, scope: !544)
!544 = distinct !DILexicalBlock(scope: !537, file: !1, line: 376, column: 7)
!545 = !DILocation(line: 376, column: 7, scope: !537)
!546 = !DILocation(line: 378, column: 28, scope: !537)
!547 = !DILocation(line: 378, column: 8, scope: !537)
!548 = distinct !{!548, !535, !549}
!549 = !DILocation(line: 380, column: 2, scope: !512)
!550 = !DILocation(line: 383, column: 30, scope: !551)
!551 = distinct !DILexicalBlock(scope: !552, file: !1, line: 382, column: 31)
!552 = distinct !DILexicalBlock(scope: !512, file: !1, line: 382, column: 6)
!553 = !DILocation(line: 383, column: 36, scope: !551)
!554 = !DILocation(line: 383, column: 27, scope: !551)
!555 = !DILocation(line: 383, column: 10, scope: !551)
!556 = !DILocation(line: 384, column: 8, scope: !557)
!557 = distinct !DILexicalBlock(scope: !551, file: !1, line: 384, column: 7)
!558 = !DILocation(line: 384, column: 7, scope: !551)
!559 = !DILocation(line: 386, column: 28, scope: !551)
!560 = !DILocation(line: 369, column: 11, scope: !512)
!561 = !DILocation(line: 388, column: 23, scope: !551)
!562 = !{!129, !133, i64 24}
!563 = !DILocation(line: 389, column: 9, scope: !551)
!564 = !DILocation(line: 370, column: 23, scope: !512)
!565 = !DILocation(line: 370, column: 18, scope: !512)
!566 = !DILocation(line: 391, column: 2, scope: !551)
!567 = !DILocation(line: 392, column: 8, scope: !568)
!568 = distinct !DILexicalBlock(scope: !552, file: !1, line: 392, column: 7)
!569 = !DILocation(line: 0, scope: !570)
!570 = distinct !DILexicalBlock(scope: !568, file: !1, line: 408, column: 10)
!571 = !DILocation(line: 392, column: 7, scope: !552)
!572 = !DILocation(line: 401, column: 10, scope: !573)
!573 = distinct !DILexicalBlock(scope: !568, file: !1, line: 392, column: 23)
!574 = !DILocation(line: 403, column: 22, scope: !573)
!575 = !DILocation(line: 404, column: 37, scope: !573)
!576 = !DILocation(line: 404, column: 28, scope: !573)
!577 = !DILocation(line: 404, column: 11, scope: !573)
!578 = !DILocation(line: 405, column: 9, scope: !579)
!579 = distinct !DILexicalBlock(scope: !573, file: !1, line: 405, column: 8)
!580 = !DILocation(line: 405, column: 8, scope: !573)
!581 = !DILocation(line: 401, column: 16, scope: !573)
!582 = !DILocation(line: 371, column: 8, scope: !512)
!583 = !DILocation(line: 412, column: 31, scope: !570)
!584 = !DILocation(line: 412, column: 29, scope: !570)
!585 = !DILocation(line: 412, column: 9, scope: !570)
!586 = !DILocation(line: 412, column: 14, scope: !570)
!587 = !DILocation(line: 413, column: 16, scope: !570)
!588 = !DILocation(line: 413, column: 22, scope: !570)
!589 = !DILocation(line: 413, column: 9, scope: !570)
!590 = !DILocation(line: 413, column: 14, scope: !570)
!591 = !DILocation(line: 414, column: 8, scope: !592)
!592 = distinct !DILexicalBlock(scope: !570, file: !1, line: 414, column: 8)
!593 = !DILocation(line: 414, column: 8, scope: !570)
!594 = !DILocation(line: 415, column: 15, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !1, line: 415, column: 9)
!596 = distinct !DILexicalBlock(scope: !592, file: !1, line: 414, column: 21)
!597 = !DILocation(line: 415, column: 9, scope: !596)
!598 = !DILocation(line: 417, column: 13, scope: !599)
!599 = distinct !DILexicalBlock(scope: !595, file: !1, line: 415, column: 21)
!600 = !DILocation(line: 417, column: 19, scope: !599)
!601 = !{!360, !130, i64 304}
!602 = !DILocation(line: 418, column: 13, scope: !599)
!603 = !DILocation(line: 418, column: 20, scope: !599)
!604 = !{!360, !133, i64 312}
!605 = !DILocation(line: 419, column: 13, scope: !599)
!606 = !DILocation(line: 419, column: 18, scope: !599)
!607 = !{!360, !133, i64 316}
!608 = !DILocation(line: 420, column: 5, scope: !599)
!609 = !DILocation(line: 422, column: 19, scope: !610)
!610 = distinct !DILexicalBlock(scope: !595, file: !1, line: 420, column: 12)
!611 = !DILocation(line: 422, column: 10, scope: !610)
!612 = !DILocation(line: 421, column: 21, scope: !610)
!613 = !DILocation(line: 421, column: 13, scope: !610)
!614 = !DILocation(line: 421, column: 19, scope: !610)
!615 = !DILocation(line: 423, column: 11, scope: !616)
!616 = distinct !DILexicalBlock(scope: !610, file: !1, line: 423, column: 10)
!617 = !DILocation(line: 423, column: 10, scope: !610)
!618 = !DILocation(line: 425, column: 13, scope: !610)
!619 = !DILocation(line: 425, column: 18, scope: !610)
!620 = !DILocation(line: 427, column: 24, scope: !621)
!621 = distinct !DILexicalBlock(scope: !610, file: !1, line: 426, column: 10)
!622 = !DILocation(line: 426, column: 11, scope: !621)
!623 = !DILocation(line: 426, column: 10, scope: !610)
!624 = !DILocation(line: 428, column: 14, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !1, line: 427, column: 34)
!626 = !DILocation(line: 428, column: 21, scope: !625)
!627 = !DILocation(line: 429, column: 20, scope: !625)
!628 = !DILocation(line: 430, column: 6, scope: !625)
!629 = !DILocation(line: 0, scope: !573)
!630 = !DILocation(line: 436, column: 40, scope: !512)
!631 = !DILocation(line: 436, column: 14, scope: !512)
!632 = !DILocation(line: 436, column: 7, scope: !512)
!633 = !DILocation(line: 436, column: 12, scope: !512)
!634 = !DILocation(line: 437, column: 16, scope: !635)
!635 = distinct !DILexicalBlock(scope: !512, file: !1, line: 437, column: 6)
!636 = !DILocation(line: 437, column: 6, scope: !512)
!637 = !DILocation(line: 439, column: 14, scope: !638)
!638 = distinct !DILexicalBlock(scope: !512, file: !1, line: 439, column: 6)
!639 = !DILocation(line: 439, column: 22, scope: !638)
!640 = !DILocation(line: 439, column: 19, scope: !638)
!641 = !DILocation(line: 439, column: 6, scope: !512)
!642 = !DILocation(line: 441, column: 3, scope: !643)
!643 = distinct !DILexicalBlock(scope: !638, file: !1, line: 439, column: 33)
!644 = !DILocation(line: 441, column: 9, scope: !643)
!645 = !{!133, !133, i64 0}
!646 = !DILocation(line: 442, column: 3, scope: !643)
!647 = !DILocation(line: 444, column: 17, scope: !512)
!648 = !{!360, !130, i64 288}
!649 = !DILocation(line: 444, column: 35, scope: !512)
!650 = !DILocation(line: 444, column: 41, scope: !512)
!651 = !DILocation(line: 444, column: 48, scope: !512)
!652 = !DILocation(line: 444, column: 2, scope: !512)
!653 = !DILocation(line: 445, column: 31, scope: !512)
!654 = !DILocation(line: 445, column: 12, scope: !512)
!655 = !DILocation(line: 446, column: 2, scope: !512)
!656 = !DILocation(line: 0, scope: !579)
!657 = !DILocation(line: 447, column: 1, scope: !512)
!658 = distinct !DISubprogram(name: "collect_data", scope: !1, file: !1, line: 453, type: !659, isLocal: true, isDefinition: true, scopeLine: 457, isOptimized: true, unit: !0, retainedNodes: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{!14, !23, !75, !14, !14}
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!662 = !DILocalVariable(name: "hashp", arg: 1, scope: !658, file: !1, line: 454, type: !23)
!663 = !DILocalVariable(name: "bufp", arg: 2, scope: !658, file: !1, line: 455, type: !75)
!664 = !DILocalVariable(name: "len", arg: 3, scope: !658, file: !1, line: 456, type: !14)
!665 = !DILocalVariable(name: "set", arg: 4, scope: !658, file: !1, line: 456, type: !14)
!666 = !DILocalVariable(name: "bp", scope: !658, file: !1, line: 458, type: !4)
!667 = !DILocalVariable(name: "p", scope: !658, file: !1, line: 459, type: !8)
!668 = !DILocalVariable(name: "xbp", scope: !658, file: !1, line: 460, type: !75)
!669 = !DILocalVariable(name: "save_addr", scope: !658, file: !1, line: 461, type: !5)
!670 = !DILocalVariable(name: "mylen", scope: !658, file: !1, line: 462, type: !14)
!671 = !DILocalVariable(name: "totlen", scope: !658, file: !1, line: 462, type: !14)
!672 = !DILocation(line: 454, column: 8, scope: !658)
!673 = !DILocation(line: 455, column: 11, scope: !658)
!674 = !DILocation(line: 456, column: 6, scope: !658)
!675 = !DILocation(line: 456, column: 11, scope: !658)
!676 = !DILocation(line: 464, column: 12, scope: !658)
!677 = !DILocation(line: 459, column: 8, scope: !658)
!678 = !DILocation(line: 458, column: 14, scope: !658)
!679 = !DILocation(line: 466, column: 17, scope: !658)
!680 = !DILocation(line: 466, column: 25, scope: !658)
!681 = !DILocation(line: 466, column: 23, scope: !658)
!682 = !DILocation(line: 462, column: 6, scope: !658)
!683 = !DILocation(line: 467, column: 20, scope: !658)
!684 = !DILocation(line: 469, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !658, file: !1, line: 469, column: 6)
!686 = !DILocation(line: 469, column: 12, scope: !685)
!687 = !DILocation(line: 469, column: 6, scope: !658)
!688 = !DILocation(line: 470, column: 16, scope: !689)
!689 = distinct !DILexicalBlock(scope: !685, file: !1, line: 469, column: 30)
!690 = !DILocation(line: 462, column: 13, scope: !658)
!691 = !DILocation(line: 471, column: 14, scope: !692)
!692 = distinct !DILexicalBlock(scope: !689, file: !1, line: 471, column: 7)
!693 = !DILocation(line: 471, column: 7, scope: !692)
!694 = !DILocation(line: 471, column: 7, scope: !689)
!695 = !DILocation(line: 472, column: 4, scope: !692)
!696 = !DILocation(line: 473, column: 40, scope: !697)
!697 = distinct !DILexicalBlock(scope: !689, file: !1, line: 473, column: 7)
!698 = !DILocation(line: 473, column: 33, scope: !697)
!699 = !DILocation(line: 473, column: 23, scope: !697)
!700 = !DILocation(line: 473, column: 49, scope: !697)
!701 = !DILocation(line: 473, column: 7, scope: !689)
!702 = !DILocation(line: 475, column: 7, scope: !703)
!703 = distinct !DILexicalBlock(scope: !689, file: !1, line: 475, column: 7)
!704 = !DILocation(line: 475, column: 7, scope: !689)
!705 = !DILocation(line: 476, column: 11, scope: !706)
!706 = distinct !DILexicalBlock(scope: !703, file: !1, line: 475, column: 12)
!707 = !DILocation(line: 476, column: 16, scope: !706)
!708 = !DILocation(line: 477, column: 8, scope: !709)
!709 = distinct !DILexicalBlock(scope: !706, file: !1, line: 477, column: 8)
!710 = !DILocation(line: 477, column: 14, scope: !709)
!711 = !DILocation(line: 477, column: 8, scope: !706)
!712 = !DILocation(line: 478, column: 12, scope: !713)
!713 = distinct !DILexicalBlock(scope: !709, file: !1, line: 477, column: 20)
!714 = !DILocation(line: 478, column: 18, scope: !713)
!715 = !DILocation(line: 479, column: 12, scope: !713)
!716 = !DILocation(line: 479, column: 19, scope: !713)
!717 = !DILocation(line: 480, column: 4, scope: !713)
!718 = !DILocation(line: 482, column: 35, scope: !719)
!719 = distinct !DILexicalBlock(scope: !709, file: !1, line: 480, column: 11)
!720 = !DILocation(line: 482, column: 26, scope: !719)
!721 = !DILocation(line: 482, column: 9, scope: !719)
!722 = !DILocation(line: 481, column: 12, scope: !719)
!723 = !DILocation(line: 481, column: 18, scope: !719)
!724 = !DILocation(line: 483, column: 10, scope: !725)
!725 = distinct !DILexicalBlock(scope: !719, file: !1, line: 483, column: 9)
!726 = !DILocation(line: 483, column: 9, scope: !719)
!727 = !DILocation(line: 485, column: 44, scope: !728)
!728 = distinct !DILexicalBlock(scope: !725, file: !1, line: 485, column: 14)
!729 = !DILocation(line: 485, column: 15, scope: !728)
!730 = !DILocation(line: 485, column: 14, scope: !725)
!731 = !DILocation(line: 486, column: 13, scope: !732)
!732 = distinct !DILexicalBlock(scope: !728, file: !1, line: 485, column: 54)
!733 = !DILocation(line: 486, column: 20, scope: !732)
!734 = !DILocation(line: 487, column: 19, scope: !732)
!735 = !DILocation(line: 488, column: 5, scope: !732)
!736 = !DILocation(line: 492, column: 29, scope: !737)
!737 = distinct !DILexicalBlock(scope: !685, file: !1, line: 491, column: 9)
!738 = !DILocation(line: 492, column: 35, scope: !737)
!739 = !DILocation(line: 492, column: 26, scope: !737)
!740 = !DILocation(line: 492, column: 9, scope: !737)
!741 = !DILocation(line: 460, column: 11, scope: !658)
!742 = !DILocation(line: 493, column: 8, scope: !743)
!743 = distinct !DILexicalBlock(scope: !737, file: !1, line: 493, column: 7)
!744 = !DILocation(line: 493, column: 12, scope: !743)
!745 = !DILocation(line: 494, column: 36, scope: !743)
!746 = !DILocation(line: 494, column: 7, scope: !743)
!747 = !DILocation(line: 494, column: 51, scope: !743)
!748 = !DILocation(line: 493, column: 7, scope: !737)
!749 = !DILocation(line: 0, scope: !743)
!750 = !DILocation(line: 497, column: 12, scope: !751)
!751 = distinct !DILexicalBlock(scope: !658, file: !1, line: 497, column: 6)
!752 = !DILocation(line: 497, column: 20, scope: !751)
!753 = !DILocation(line: 497, column: 17, scope: !751)
!754 = !DILocation(line: 497, column: 6, scope: !658)
!755 = !DILocation(line: 498, column: 3, scope: !756)
!756 = distinct !DILexicalBlock(scope: !751, file: !1, line: 497, column: 31)
!757 = !DILocation(line: 498, column: 9, scope: !756)
!758 = !DILocation(line: 499, column: 3, scope: !756)
!759 = !DILocation(line: 501, column: 18, scope: !658)
!760 = !DILocation(line: 501, column: 11, scope: !658)
!761 = !DILocation(line: 501, column: 39, scope: !658)
!762 = !DILocation(line: 501, column: 47, scope: !658)
!763 = !DILocation(line: 501, column: 45, scope: !658)
!764 = !DILocation(line: 501, column: 54, scope: !658)
!765 = !DILocation(line: 501, column: 2, scope: !658)
!766 = !DILocation(line: 502, column: 2, scope: !658)
!767 = !DILocation(line: 503, column: 1, scope: !658)
!768 = distinct !DISubprogram(name: "__big_keydata", scope: !1, file: !1, line: 509, type: !769, isLocal: false, isDefinition: true, scopeLine: 514, isOptimized: true, unit: !0, retainedNodes: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{!14, !23, !75, !515, !515, !14}
!771 = !{!772, !773, !774, !775, !776}
!772 = !DILocalVariable(name: "hashp", arg: 1, scope: !768, file: !1, line: 510, type: !23)
!773 = !DILocalVariable(name: "bufp", arg: 2, scope: !768, file: !1, line: 511, type: !75)
!774 = !DILocalVariable(name: "key", arg: 3, scope: !768, file: !1, line: 512, type: !515)
!775 = !DILocalVariable(name: "val", arg: 4, scope: !768, file: !1, line: 512, type: !515)
!776 = !DILocalVariable(name: "set", arg: 5, scope: !768, file: !1, line: 513, type: !14)
!777 = !DILocation(line: 510, column: 8, scope: !768)
!778 = !DILocation(line: 511, column: 11, scope: !768)
!779 = !DILocation(line: 512, column: 7, scope: !768)
!780 = !DILocation(line: 512, column: 13, scope: !768)
!781 = !DILocation(line: 513, column: 6, scope: !768)
!782 = !DILocation(line: 515, column: 14, scope: !768)
!783 = !DILocation(line: 515, column: 7, scope: !768)
!784 = !DILocation(line: 515, column: 12, scope: !768)
!785 = !DILocation(line: 516, column: 16, scope: !786)
!786 = distinct !DILexicalBlock(scope: !768, file: !1, line: 516, column: 6)
!787 = !DILocation(line: 516, column: 6, scope: !768)
!788 = !DILocation(line: 518, column: 31, scope: !768)
!789 = !{!360, !130, i64 296}
!790 = !DILocation(line: 518, column: 12, scope: !768)
!791 = !DILocation(line: 519, column: 2, scope: !768)
!792 = !DILocation(line: 0, scope: !768)
!793 = !DILocation(line: 520, column: 1, scope: !768)
!794 = distinct !DISubprogram(name: "collect_key", scope: !1, file: !1, line: 527, type: !513, isLocal: true, isDefinition: true, scopeLine: 533, isOptimized: true, unit: !0, retainedNodes: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!796 = !DILocalVariable(name: "hashp", arg: 1, scope: !794, file: !1, line: 528, type: !23)
!797 = !DILocalVariable(name: "bufp", arg: 2, scope: !794, file: !1, line: 529, type: !75)
!798 = !DILocalVariable(name: "len", arg: 3, scope: !794, file: !1, line: 530, type: !14)
!799 = !DILocalVariable(name: "val", arg: 4, scope: !794, file: !1, line: 531, type: !515)
!800 = !DILocalVariable(name: "set", arg: 5, scope: !794, file: !1, line: 532, type: !14)
!801 = !DILocalVariable(name: "xbp", scope: !794, file: !1, line: 534, type: !75)
!802 = !DILocalVariable(name: "p", scope: !794, file: !1, line: 535, type: !8)
!803 = !DILocalVariable(name: "mylen", scope: !794, file: !1, line: 536, type: !14)
!804 = !DILocalVariable(name: "totlen", scope: !794, file: !1, line: 536, type: !14)
!805 = !DILocalVariable(name: "bp", scope: !794, file: !1, line: 537, type: !4)
!806 = !DILocalVariable(name: "save_addr", scope: !794, file: !1, line: 537, type: !5)
!807 = !DILocation(line: 528, column: 8, scope: !794)
!808 = !DILocation(line: 529, column: 11, scope: !794)
!809 = !DILocation(line: 530, column: 6, scope: !794)
!810 = !DILocation(line: 531, column: 7, scope: !794)
!811 = !DILocation(line: 532, column: 6, scope: !794)
!812 = !DILocation(line: 539, column: 12, scope: !794)
!813 = !DILocation(line: 535, column: 8, scope: !794)
!814 = !DILocation(line: 537, column: 14, scope: !794)
!815 = !DILocation(line: 541, column: 17, scope: !794)
!816 = !DILocation(line: 541, column: 25, scope: !794)
!817 = !DILocation(line: 541, column: 23, scope: !794)
!818 = !DILocation(line: 536, column: 6, scope: !794)
!819 = !DILocation(line: 543, column: 20, scope: !794)
!820 = !DILocation(line: 544, column: 15, scope: !794)
!821 = !DILocation(line: 536, column: 13, scope: !794)
!822 = !DILocation(line: 545, column: 6, scope: !823)
!823 = distinct !DILexicalBlock(scope: !794, file: !1, line: 545, column: 6)
!824 = !DILocation(line: 545, column: 24, scope: !823)
!825 = !DILocation(line: 546, column: 14, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 546, column: 7)
!827 = distinct !DILexicalBlock(scope: !823, file: !1, line: 545, column: 51)
!828 = !DILocation(line: 546, column: 22, scope: !826)
!829 = !DILocation(line: 546, column: 7, scope: !827)
!830 = !DILocation(line: 547, column: 4, scope: !826)
!831 = !DILocation(line: 548, column: 40, scope: !832)
!832 = distinct !DILexicalBlock(scope: !827, file: !1, line: 548, column: 7)
!833 = !DILocation(line: 548, column: 33, scope: !832)
!834 = !DILocation(line: 548, column: 23, scope: !832)
!835 = !DILocation(line: 548, column: 49, scope: !832)
!836 = !DILocation(line: 548, column: 7, scope: !827)
!837 = !DILocation(line: 550, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !827, file: !1, line: 550, column: 7)
!839 = !DILocation(line: 550, column: 7, scope: !827)
!840 = !DILocation(line: 553, column: 29, scope: !841)
!841 = distinct !DILexicalBlock(scope: !823, file: !1, line: 552, column: 9)
!842 = !DILocation(line: 553, column: 35, scope: !841)
!843 = !DILocation(line: 553, column: 26, scope: !841)
!844 = !DILocation(line: 553, column: 9, scope: !841)
!845 = !DILocation(line: 534, column: 11, scope: !794)
!846 = !DILocation(line: 554, column: 8, scope: !847)
!847 = distinct !DILexicalBlock(scope: !841, file: !1, line: 554, column: 7)
!848 = !DILocation(line: 554, column: 12, scope: !847)
!849 = !DILocation(line: 555, column: 7, scope: !847)
!850 = !DILocation(line: 555, column: 50, scope: !847)
!851 = !DILocation(line: 554, column: 7, scope: !841)
!852 = !DILocation(line: 0, scope: !847)
!853 = !DILocation(line: 558, column: 12, scope: !854)
!854 = distinct !DILexicalBlock(scope: !794, file: !1, line: 558, column: 6)
!855 = !DILocation(line: 558, column: 20, scope: !854)
!856 = !DILocation(line: 558, column: 17, scope: !854)
!857 = !DILocation(line: 558, column: 6, scope: !794)
!858 = !DILocation(line: 559, column: 3, scope: !859)
!859 = distinct !DILexicalBlock(scope: !854, file: !1, line: 558, column: 31)
!860 = !DILocation(line: 559, column: 9, scope: !859)
!861 = !DILocation(line: 560, column: 3, scope: !859)
!862 = !DILocation(line: 562, column: 18, scope: !794)
!863 = !DILocation(line: 562, column: 11, scope: !794)
!864 = !DILocation(line: 562, column: 39, scope: !794)
!865 = !DILocation(line: 562, column: 47, scope: !794)
!866 = !DILocation(line: 562, column: 45, scope: !794)
!867 = !DILocation(line: 562, column: 54, scope: !794)
!868 = !DILocation(line: 562, column: 2, scope: !794)
!869 = !DILocation(line: 563, column: 2, scope: !794)
!870 = !DILocation(line: 564, column: 1, scope: !794)
!871 = distinct !DISubprogram(name: "__big_split", scope: !1, file: !1, line: 572, type: !872, isLocal: false, isDefinition: true, scopeLine: 581, isOptimized: true, unit: !0, retainedNodes: !883)
!872 = !DISubroutineType(types: !873)
!873 = !{!14, !23, !75, !75, !75, !14, !35, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLIT_RETURN", file: !876, line: 93, baseType: !877)
!876 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/page.h", directory: "/root/.unikraft/apps/redis/build")
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !876, line: 88, size: 256, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "newp", scope: !877, file: !876, line: 89, baseType: !75, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", scope: !877, file: !876, line: 90, baseType: !75, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", scope: !877, file: !876, line: 91, baseType: !75, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !877, file: !876, line: 92, baseType: !5, size: 16, offset: 192)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!884 = !DILocalVariable(name: "hashp", arg: 1, scope: !871, file: !1, line: 573, type: !23)
!885 = !DILocalVariable(name: "op", arg: 2, scope: !871, file: !1, line: 574, type: !75)
!886 = !DILocalVariable(name: "np", arg: 3, scope: !871, file: !1, line: 575, type: !75)
!887 = !DILocalVariable(name: "big_keyp", arg: 4, scope: !871, file: !1, line: 577, type: !75)
!888 = !DILocalVariable(name: "addr", arg: 5, scope: !871, file: !1, line: 578, type: !14)
!889 = !DILocalVariable(name: "obucket", arg: 6, scope: !871, file: !1, line: 579, type: !35)
!890 = !DILocalVariable(name: "ret", arg: 7, scope: !871, file: !1, line: 580, type: !874)
!891 = !DILocalVariable(name: "tmpp", scope: !871, file: !1, line: 582, type: !75)
!892 = !DILocalVariable(name: "tp", scope: !871, file: !1, line: 583, type: !4)
!893 = !DILocalVariable(name: "bp", scope: !871, file: !1, line: 584, type: !75)
!894 = !DILocalVariable(name: "key", scope: !871, file: !1, line: 585, type: !102)
!895 = !DILocalVariable(name: "val", scope: !871, file: !1, line: 585, type: !102)
!896 = !DILocalVariable(name: "change", scope: !871, file: !1, line: 586, type: !35)
!897 = !DILocalVariable(name: "free_space", scope: !871, file: !1, line: 587, type: !5)
!898 = !DILocalVariable(name: "n", scope: !871, file: !1, line: 587, type: !5)
!899 = !DILocalVariable(name: "off", scope: !871, file: !1, line: 587, type: !5)
!900 = !DILocation(line: 573, column: 8, scope: !871)
!901 = !DILocation(line: 574, column: 11, scope: !871)
!902 = !DILocation(line: 575, column: 11, scope: !871)
!903 = !DILocation(line: 577, column: 11, scope: !871)
!904 = !DILocation(line: 578, column: 6, scope: !871)
!905 = !DILocation(line: 579, column: 15, scope: !871)
!906 = !DILocation(line: 580, column: 16, scope: !871)
!907 = !DILocation(line: 585, column: 2, scope: !871)
!908 = !DILocation(line: 584, column: 11, scope: !871)
!909 = !DILocation(line: 585, column: 6, scope: !871)
!910 = !DILocation(line: 585, column: 11, scope: !871)
!911 = !DILocation(line: 510, column: 8, scope: !768, inlinedAt: !912)
!912 = distinct !DILocation(line: 592, column: 6, scope: !913)
!913 = distinct !DILexicalBlock(scope: !871, file: !1, line: 592, column: 6)
!914 = !DILocation(line: 511, column: 11, scope: !768, inlinedAt: !912)
!915 = !DILocation(line: 512, column: 7, scope: !768, inlinedAt: !912)
!916 = !DILocation(line: 512, column: 13, scope: !768, inlinedAt: !912)
!917 = !DILocation(line: 513, column: 6, scope: !768, inlinedAt: !912)
!918 = !DILocation(line: 515, column: 14, scope: !768, inlinedAt: !912)
!919 = !DILocation(line: 516, column: 16, scope: !786, inlinedAt: !912)
!920 = !DILocation(line: 516, column: 6, scope: !768, inlinedAt: !912)
!921 = !DILocation(line: 520, column: 1, scope: !768, inlinedAt: !912)
!922 = !DILocation(line: 518, column: 31, scope: !768, inlinedAt: !912)
!923 = !DILocation(line: 594, column: 12, scope: !871)
!924 = !DILocation(line: 594, column: 51, scope: !871)
!925 = !DILocation(line: 322, column: 8, scope: !458, inlinedAt: !926)
!926 = distinct !DILocation(line: 596, column: 25, scope: !927)
!927 = distinct !DILexicalBlock(scope: !871, file: !1, line: 596, column: 7)
!928 = !DILocation(line: 325, column: 11, scope: !458, inlinedAt: !926)
!929 = !DILocation(line: 326, column: 14, scope: !458, inlinedAt: !926)
!930 = !DILocation(line: 331, column: 2, scope: !458, inlinedAt: !926)
!931 = !DILocation(line: 0, scope: !476, inlinedAt: !926)
!932 = !DILocation(line: 332, column: 7, scope: !476, inlinedAt: !926)
!933 = !DILocation(line: 327, column: 6, scope: !458, inlinedAt: !926)
!934 = !DILocation(line: 339, column: 7, scope: !482, inlinedAt: !926)
!935 = !DILocation(line: 339, column: 13, scope: !482, inlinedAt: !926)
