; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_page.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_page.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.htab = type { %struct.hashhdr, i32, i32, i32 (i8*, i64)*, i32, i32, i8*, i8*, %struct._bufhead*, i32, i32, i32, i32, i32, [32 x i32*], i32, i32, %struct._bufhead, %struct._bufhead*** }
%struct.hashhdr = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [32 x i32], [32 x i16] }
%struct._bufhead = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i32, i8*, i8 }
%struct.SPLIT_RETURN = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i16 }
%struct.DBT = type { i8*, i64 }

@.str = private unnamed_addr constant [50 x i8] c"HASH: Out of overflow pages.  Increase page size\0A\00", align 1
@open_temp.namestr = internal global [12 x i8] c"_hashXXXXXX\00", align 1, !dbg !0
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @__delpair(%struct.htab*, %struct._bufhead*, i32) local_unnamed_addr #0 !dbg !119 {
  %4 = getelementptr inbounds %struct._bufhead, %struct._bufhead* %1, i64 0, i32 4, !dbg !138
  %5 = bitcast i8** %4 to i16**, !dbg !138
  %6 = load i16*, i16** %5, align 8, !dbg !138, !tbaa !139

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "namestr", scope: !2, file: !3, line: 865, type: !112, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "open_temp", scope: !3, file: !3, line: 861, type: !4, isLocal: true, isDefinition: true, scopeLine: 863, isOptimized: true, unit: !89, retainedNodes: !108)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_page.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTAB", file: !9, line: 138, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.h", directory: "/root/.unikraft/apps/redis/build")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !9, line: 111, size: 5248, elements: !11)
!11 = !{!12, !44, !45, !46, !57, !58, !59, !62, !63, !74, !75, !76, !77, !78, !79, !82, !83, !84, !85}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !10, file: !9, line: 112, baseType: !13, size: 2080)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASHHDR", file: !9, line: 109, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashhdr", file: !9, line: 84, size: 2080, elements: !15)
!15 = !{!16, !17, !18, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !40}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !14, file: !9, line: 85, baseType: !6, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !14, file: !9, line: 86, baseType: !6, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "lorder", scope: !14, file: !9, line: 87, baseType: !19, size: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 79, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !14, file: !9, line: 88, baseType: !6, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !14, file: !9, line: 89, baseType: !6, size: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !14, file: !9, line: 90, baseType: !6, size: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ssize", scope: !14, file: !9, line: 91, baseType: !6, size: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sshift", scope: !14, file: !9, line: 92, baseType: !6, size: 32, offset: 224)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl_point", scope: !14, file: !9, line: 93, baseType: !6, size: 32, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "last_freed", scope: !14, file: !9, line: 95, baseType: !6, size: 32, offset: 288)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "max_bucket", scope: !14, file: !9, line: 96, baseType: !6, size: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "high_mask", scope: !14, file: !9, line: 97, baseType: !6, size: 32, offset: 352)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "low_mask", scope: !14, file: !9, line: 98, baseType: !6, size: 32, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ffactor", scope: !14, file: !9, line: 100, baseType: !6, size: 32, offset: 416)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !14, file: !9, line: 101, baseType: !6, size: 32, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "hdrpages", scope: !14, file: !9, line: 102, baseType: !6, size: 32, offset: 480)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "h_charkey", scope: !14, file: !9, line: 103, baseType: !6, size: 32, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "spares", scope: !14, file: !9, line: 106, baseType: !37, size: 1024, offset: 544)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bitmaps", scope: !14, file: !9, line: 107, baseType: !41, size: 512, offset: 1568)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, elements: !38)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 57, baseType: !43)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nsegs", scope: !10, file: !9, line: 113, baseType: !6, size: 32, offset: 2080)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "exsegs", scope: !10, file: !9, line: 114, baseType: !6, size: 32, offset: 2112)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !10, file: !9, line: 117, baseType: !47, size: 64, offset: 2176)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!19, !50, !52}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 40, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !55, line: 129, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !10, file: !9, line: 118, baseType: !6, size: 32, offset: 2240)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !10, file: !9, line: 119, baseType: !6, size: 32, offset: 2272)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !10, file: !9, line: 120, baseType: !60, size: 64, offset: 2304)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_key", scope: !10, file: !9, line: 121, baseType: !60, size: 64, offset: 2368)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cpage", scope: !10, file: !9, line: 122, baseType: !64, size: 64, offset: 2432)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUFHEAD", file: !9, line: 64, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bufhead", file: !9, line: 66, size: 384, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !9, line: 67, baseType: !64, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !9, line: 68, baseType: !64, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl", scope: !66, file: !9, line: 69, baseType: !64, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !66, file: !9, line: 70, baseType: !19, size: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !66, file: !9, line: 71, baseType: !60, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !9, line: 72, baseType: !61, size: 8, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cbucket", scope: !10, file: !9, line: 123, baseType: !6, size: 32, offset: 2496)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cndx", scope: !10, file: !9, line: 124, baseType: !6, size: 32, offset: 2528)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !10, file: !9, line: 125, baseType: !6, size: 32, offset: 2560)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "new_file", scope: !10, file: !9, line: 127, baseType: !6, size: 32, offset: 2592)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "save_file", scope: !10, file: !9, line: 129, baseType: !6, size: 32, offset: 2624)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !10, file: !9, line: 132, baseType: !80, size: 2048, offset: 2688)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !38)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nmaps", scope: !10, file: !9, line: 133, baseType: !6, size: 32, offset: 4736)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !10, file: !9, line: 134, baseType: !6, size: 32, offset: 4768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bufhead", scope: !10, file: !9, line: 136, baseType: !65, size: 384, offset: 4800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !10, file: !9, line: 137, baseType: !86, size: 64, offset: 5184)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEGMENT", file: !9, line: 81, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !90, retainedTypes: !91, globals: !107)
!90 = !{}
!91 = !{!92, !6, !42, !93, !94, !60, !19, !98, !102, !81, !103}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !96, line: 87, baseType: !97)
!96 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!97 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !96, line: 173, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 100, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !55, line: 44, baseType: !101)
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !105, line: 64, baseType: !106)
!105 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !105, line: 63, baseType: !56)
!107 = !{!0}
!108 = !{!109, !110, !111}
!109 = !DILocalVariable(name: "hashp", arg: 1, scope: !2, file: !3, line: 862, type: !7)
!110 = !DILocalVariable(name: "set", scope: !2, file: !3, line: 864, type: !104)
!111 = !DILocalVariable(name: "oset", scope: !2, file: !3, line: 864, type: !104)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 96, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 12)
!115 = !{i32 2, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 4}
!118 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!119 = distinct !DISubprogram(name: "__delpair", scope: !3, file: !3, line: 130, type: !120, isLocal: false, isDefinition: true, scopeLine: 134, isOptimized: true, unit: !89, retainedNodes: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!6, !7, !64, !6}
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !133, !134}
!123 = !DILocalVariable(name: "hashp", arg: 1, scope: !119, file: !3, line: 131, type: !7)
!124 = !DILocalVariable(name: "bufp", arg: 2, scope: !119, file: !3, line: 132, type: !64)
!125 = !DILocalVariable(name: "ndx", arg: 3, scope: !119, file: !3, line: 133, type: !6)
!126 = !DILocalVariable(name: "bp", scope: !119, file: !3, line: 135, type: !92)
!127 = !DILocalVariable(name: "newoff", scope: !119, file: !3, line: 135, type: !42)
!128 = !DILocalVariable(name: "n", scope: !119, file: !3, line: 136, type: !6)
!129 = !DILocalVariable(name: "pairlen", scope: !119, file: !3, line: 137, type: !42)
!130 = !DILocalVariable(name: "i", scope: !131, file: !3, line: 152, type: !6)
!131 = distinct !DILexicalBlock(scope: !132, file: !3, line: 150, column: 22)
!132 = distinct !DILexicalBlock(scope: !119, file: !3, line: 150, column: 6)
!133 = !DILocalVariable(name: "src", scope: !131, file: !3, line: 153, type: !60)
!134 = !DILocalVariable(name: "dst", scope: !131, file: !3, line: 154, type: !60)
!135 = !DILocation(line: 131, column: 8, scope: !119)
!136 = !DILocation(line: 132, column: 11, scope: !119)
!137 = !DILocation(line: 133, column: 6, scope: !119)
!138 = !DILocation(line: 139, column: 27, scope: !119)
!139 = !{!140, !141, i64 32}
!140 = !{!"_bufhead", !141, i64 0, !141, i64 8, !141, i64 16, !144, i64 24, !141, i64 32, !142, i64 40}
!141 = !{!"any pointer", !142, i64 0}
!142 = !{!"omnipotent char", !143, i64 0}
!143 = !{!"Simple C/C++ TBAA"}
!144 = !{!"int", !142, i64 0}
!145 = !DILocation(line: 135, column: 14, scope: !119)
!146 = !DILocation(line: 140, column: 6, scope: !119)
!147 = !{!148, !148, i64 0}
!148 = !{!"short", !142, i64 0}
!149 = !DILocation(line: 136, column: 6, scope: !119)
!150 = !DILocation(line: 142, column: 13, scope: !151)
!151 = distinct !DILexicalBlock(scope: !119, file: !3, line: 142, column: 6)
!152 = !DILocation(line: 142, column: 6, scope: !151)
!153 = !DILocation(line: 142, column: 18, scope: !151)
!154 = !DILocation(line: 142, column: 6, scope: !119)
!155 = !DILocation(line: 143, column: 11, scope: !151)
!156 = !DILocation(line: 143, column: 3, scope: !151)
!157 = !DILocation(line: 144, column: 10, scope: !158)
!158 = distinct !DILexicalBlock(scope: !119, file: !3, line: 144, column: 6)
!159 = !DILocation(line: 144, column: 6, scope: !119)
!160 = !DILocation(line: 145, column: 19, scope: !158)
!161 = !DILocation(line: 145, column: 12, scope: !158)
!162 = !DILocation(line: 135, column: 18, scope: !119)
!163 = !DILocation(line: 145, column: 3, scope: !158)
!164 = !DILocation(line: 147, column: 19, scope: !158)
!165 = !{!166, !144, i64 12}
!166 = !{!"htab", !167, i64 0, !144, i64 260, !144, i64 264, !141, i64 272, !144, i64 280, !144, i64 284, !141, i64 288, !141, i64 296, !141, i64 304, !144, i64 312, !144, i64 316, !144, i64 320, !144, i64 324, !144, i64 328, !142, i64 336, !144, i64 592, !144, i64 596, !140, i64 600, !141, i64 648}
!167 = !{!"hashhdr", !144, i64 0, !144, i64 4, !144, i64 8, !144, i64 12, !144, i64 16, !144, i64 20, !144, i64 24, !144, i64 28, !144, i64 32, !144, i64 36, !144, i64 40, !144, i64 44, !144, i64 48, !144, i64 52, !144, i64 56, !144, i64 60, !144, i64 64, !142, i64 68, !142, i64 196}
!168 = !DILocation(line: 147, column: 12, scope: !158)
!169 = !DILocation(line: 0, scope: !158)
!170 = !DILocation(line: 148, column: 19, scope: !119)
!171 = !DILocation(line: 137, column: 13, scope: !119)
!172 = !DILocation(line: 150, column: 16, scope: !132)
!173 = !DILocation(line: 150, column: 10, scope: !132)
!174 = !DILocation(line: 150, column: 6, scope: !119)
!175 = !DILocation(line: 169, column: 2, scope: !119)
!176 = !DILocation(line: 148, column: 21, scope: !119)
!177 = !DILocation(line: 153, column: 33, scope: !131)
!178 = !DILocation(line: 153, column: 28, scope: !131)
!179 = !DILocation(line: 153, column: 26, scope: !131)
!180 = !DILocation(line: 153, column: 9, scope: !131)
!181 = !DILocation(line: 154, column: 19, scope: !131)
!182 = !DILocation(line: 154, column: 9, scope: !131)
!183 = !DILocation(line: 155, column: 33, scope: !131)
!184 = !DILocation(line: 155, column: 3, scope: !131)
!185 = !DILocation(line: 152, column: 7, scope: !131)
!186 = !DILocation(line: 0, scope: !187)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 158, column: 3)
!188 = distinct !DILexicalBlock(scope: !131, file: !3, line: 158, column: 3)
!189 = !DILocation(line: 158, column: 23, scope: !187)
!190 = !DILocation(line: 158, column: 3, scope: !188)
!191 = !DILocation(line: 159, column: 13, scope: !192)
!192 = distinct !DILexicalBlock(scope: !193, file: !3, line: 159, column: 8)
!193 = distinct !DILexicalBlock(scope: !187, file: !3, line: 158, column: 37)
!194 = !DILocation(line: 159, column: 8, scope: !192)
!195 = !DILocation(line: 159, column: 18, scope: !192)
!196 = !DILocation(line: 0, scope: !197)
!197 = distinct !DILexicalBlock(scope: !192, file: !3, line: 162, column: 11)
!198 = !DILocation(line: 159, column: 8, scope: !193)
!199 = !DILocation(line: 160, column: 5, scope: !200)
!200 = distinct !DILexicalBlock(scope: !192, file: !3, line: 159, column: 31)
!201 = !DILocation(line: 160, column: 15, scope: !200)
!202 = !DILocation(line: 162, column: 4, scope: !200)
!203 = !DILocation(line: 163, column: 23, scope: !197)
!204 = !DILocation(line: 163, column: 5, scope: !197)
!205 = !DILocation(line: 163, column: 15, scope: !197)
!206 = !DILocation(line: 164, column: 27, scope: !197)
!207 = distinct !{!207, !190, !208}
!208 = !DILocation(line: 166, column: 3, scope: !188)
!209 = !DILocation(line: 169, column: 10, scope: !119)
!210 = !DILocation(line: 169, column: 21, scope: !119)
!211 = !DILocation(line: 169, column: 8, scope: !119)
!212 = !DILocation(line: 170, column: 19, scope: !119)
!213 = !DILocation(line: 170, column: 14, scope: !119)
!214 = !DILocation(line: 170, column: 24, scope: !119)
!215 = !DILocation(line: 170, column: 34, scope: !119)
!216 = !DILocation(line: 170, column: 2, scope: !119)
!217 = !DILocation(line: 170, column: 12, scope: !119)
!218 = !DILocation(line: 171, column: 12, scope: !119)
!219 = !DILocation(line: 171, column: 8, scope: !119)
!220 = !DILocation(line: 172, column: 9, scope: !119)
!221 = !DILocation(line: 172, column: 14, scope: !119)
!222 = !{!166, !144, i64 56}
!223 = !DILocation(line: 174, column: 8, scope: !119)
!224 = !DILocation(line: 174, column: 14, scope: !119)
!225 = !{!140, !142, i64 40}
!226 = !DILocation(line: 175, column: 2, scope: !119)
!227 = !DILocation(line: 0, scope: !119)
!228 = !DILocation(line: 176, column: 1, scope: !119)
!229 = distinct !DISubprogram(name: "__split_page", scope: !3, file: !3, line: 183, type: !230, isLocal: false, isDefinition: true, scopeLine: 186, isOptimized: true, unit: !89, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!6, !7, !19, !19}
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!233 = !DILocalVariable(name: "hashp", arg: 1, scope: !229, file: !3, line: 184, type: !7)
!234 = !DILocalVariable(name: "obucket", arg: 2, scope: !229, file: !3, line: 185, type: !19)
!235 = !DILocalVariable(name: "nbucket", arg: 3, scope: !229, file: !3, line: 185, type: !19)
!236 = !DILocalVariable(name: "new_bufp", scope: !229, file: !3, line: 187, type: !64)
!237 = !DILocalVariable(name: "old_bufp", scope: !229, file: !3, line: 187, type: !64)
!238 = !DILocalVariable(name: "ino", scope: !229, file: !3, line: 188, type: !92)
!239 = !DILocalVariable(name: "np", scope: !229, file: !3, line: 189, type: !60)
!240 = !DILocalVariable(name: "key", scope: !229, file: !3, line: 190, type: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBT", file: !242, line: 61, baseType: !243)
!242 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/db_local.h", directory: "/root/.unikraft/apps/redis/build")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 58, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !242, line: 59, baseType: !93, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !242, line: 60, baseType: !52, size: 64, offset: 64)
!247 = !DILocalVariable(name: "val", scope: !229, file: !3, line: 190, type: !241)
!248 = !DILocalVariable(name: "n", scope: !229, file: !3, line: 191, type: !6)
!249 = !DILocalVariable(name: "ndx", scope: !229, file: !3, line: 191, type: !6)
!250 = !DILocalVariable(name: "retval", scope: !229, file: !3, line: 191, type: !6)
!251 = !DILocalVariable(name: "copyto", scope: !229, file: !3, line: 192, type: !42)
!252 = !DILocalVariable(name: "diff", scope: !229, file: !3, line: 192, type: !42)
!253 = !DILocalVariable(name: "off", scope: !229, file: !3, line: 192, type: !42)
!254 = !DILocalVariable(name: "moved", scope: !229, file: !3, line: 192, type: !42)
!255 = !DILocalVariable(name: "op", scope: !229, file: !3, line: 193, type: !60)
!256 = !DILocation(line: 184, column: 8, scope: !229)
!257 = !DILocation(line: 185, column: 13, scope: !229)
!258 = !DILocation(line: 185, column: 22, scope: !229)
!259 = !DILocation(line: 195, column: 30, scope: !229)
!260 = !DILocation(line: 195, column: 11, scope: !229)
!261 = !DILocation(line: 192, column: 13, scope: !229)
!262 = !DILocation(line: 192, column: 27, scope: !229)
!263 = !DILocation(line: 197, column: 13, scope: !229)
!264 = !DILocation(line: 187, column: 22, scope: !229)
!265 = !DILocation(line: 198, column: 15, scope: !266)
!266 = distinct !DILexicalBlock(scope: !229, file: !3, line: 198, column: 6)
!267 = !DILocation(line: 198, column: 6, scope: !229)
!268 = !DILocation(line: 200, column: 13, scope: !229)
!269 = !DILocation(line: 187, column: 11, scope: !229)
!270 = !DILocation(line: 201, column: 15, scope: !271)
!271 = distinct !DILexicalBlock(scope: !229, file: !3, line: 201, column: 6)
!272 = !DILocation(line: 201, column: 6, scope: !229)
!273 = !DILocation(line: 204, column: 12, scope: !229)
!274 = !DILocation(line: 204, column: 18, scope: !229)
!275 = !DILocation(line: 205, column: 12, scope: !229)
!276 = !DILocation(line: 205, column: 18, scope: !229)
!277 = !DILocation(line: 207, column: 38, scope: !229)
!278 = !DILocation(line: 193, column: 8, scope: !229)
!279 = !DILocation(line: 207, column: 8, scope: !229)
!280 = !DILocation(line: 188, column: 14, scope: !229)
!281 = !DILocation(line: 208, column: 17, scope: !229)
!282 = !DILocation(line: 189, column: 8, scope: !229)
!283 = !DILocation(line: 192, column: 32, scope: !229)
!284 = !DILocation(line: 191, column: 6, scope: !229)
!285 = !DILocation(line: 191, column: 9, scope: !229)
!286 = !DILocation(line: 212, column: 27, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !3, line: 212, column: 2)
!288 = distinct !DILexicalBlock(scope: !229, file: !3, line: 212, column: 2)
!289 = !DILocation(line: 212, column: 25, scope: !287)
!290 = !DILocation(line: 212, column: 2, scope: !288)
!291 = !DILocation(line: 213, column: 13, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !3, line: 213, column: 7)
!293 = distinct !DILexicalBlock(scope: !287, file: !3, line: 212, column: 43)
!294 = !DILocation(line: 213, column: 7, scope: !292)
!295 = !DILocation(line: 213, column: 18, scope: !292)
!296 = !DILocation(line: 213, column: 7, scope: !293)
!297 = !DILocalVariable(name: "hashp", arg: 1, scope: !298, file: !3, line: 280, type: !7)
!298 = distinct !DISubprogram(name: "ugly_split", scope: !3, file: !3, line: 279, type: !299, isLocal: true, isDefinition: true, scopeLine: 285, isOptimized: true, unit: !89, retainedNodes: !301)
!299 = !DISubroutineType(types: !300)
!300 = !{!6, !7, !19, !64, !64, !6, !6}
!301 = !{!297, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !323, !324, !325, !326, !327}
!302 = !DILocalVariable(name: "obucket", arg: 2, scope: !298, file: !3, line: 281, type: !19)
!303 = !DILocalVariable(name: "old_bufp", arg: 3, scope: !298, file: !3, line: 282, type: !64)
!304 = !DILocalVariable(name: "new_bufp", arg: 4, scope: !298, file: !3, line: 282, type: !64)
!305 = !DILocalVariable(name: "copyto", arg: 5, scope: !298, file: !3, line: 283, type: !6)
!306 = !DILocalVariable(name: "moved", arg: 6, scope: !298, file: !3, line: 284, type: !6)
!307 = !DILocalVariable(name: "bufp", scope: !298, file: !3, line: 286, type: !64)
!308 = !DILocalVariable(name: "ino", scope: !298, file: !3, line: 287, type: !92)
!309 = !DILocalVariable(name: "np", scope: !298, file: !3, line: 288, type: !92)
!310 = !DILocalVariable(name: "op", scope: !298, file: !3, line: 289, type: !92)
!311 = !DILocalVariable(name: "last_bfp", scope: !298, file: !3, line: 291, type: !64)
!312 = !DILocalVariable(name: "key", scope: !298, file: !3, line: 292, type: !241)
!313 = !DILocalVariable(name: "val", scope: !298, file: !3, line: 292, type: !241)
!314 = !DILocalVariable(name: "ret", scope: !298, file: !3, line: 293, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLIT_RETURN", file: !316, line: 93, baseType: !317)
!316 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/page.h", directory: "/root/.unikraft/apps/redis/build")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 88, size: 256, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "newp", scope: !317, file: !316, line: 89, baseType: !64, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", scope: !317, file: !316, line: 90, baseType: !64, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", scope: !317, file: !316, line: 91, baseType: !64, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !317, file: !316, line: 92, baseType: !42, size: 16, offset: 192)
!323 = !DILocalVariable(name: "n", scope: !298, file: !3, line: 294, type: !42)
!324 = !DILocalVariable(name: "off", scope: !298, file: !3, line: 294, type: !42)
!325 = !DILocalVariable(name: "ov_addr", scope: !298, file: !3, line: 294, type: !42)
!326 = !DILocalVariable(name: "scopyto", scope: !298, file: !3, line: 294, type: !42)
!327 = !DILocalVariable(name: "cino", scope: !298, file: !3, line: 295, type: !60)
!328 = !DILocation(line: 280, column: 8, scope: !298, inlinedAt: !329)
!329 = distinct !DILocation(line: 214, column: 13, scope: !330)
!330 = distinct !DILexicalBlock(scope: !292, file: !3, line: 213, column: 30)
!331 = !DILocation(line: 281, column: 13, scope: !298, inlinedAt: !329)
!332 = !DILocation(line: 282, column: 11, scope: !298, inlinedAt: !329)
!333 = !DILocation(line: 282, column: 22, scope: !298, inlinedAt: !329)
!334 = !DILocation(line: 293, column: 2, scope: !298, inlinedAt: !329)
!335 = !DILocation(line: 286, column: 11, scope: !298, inlinedAt: !329)
!336 = !DILocation(line: 298, column: 32, scope: !298, inlinedAt: !329)
!337 = !DILocation(line: 287, column: 14, scope: !298, inlinedAt: !329)
!338 = !DILocation(line: 299, column: 31, scope: !298, inlinedAt: !329)
!339 = !DILocation(line: 288, column: 14, scope: !298, inlinedAt: !329)
!340 = !DILocation(line: 289, column: 14, scope: !298, inlinedAt: !329)
!341 = !DILocation(line: 291, column: 11, scope: !298, inlinedAt: !329)
!342 = !DILocation(line: 304, column: 6, scope: !298, inlinedAt: !329)
!343 = !DILocation(line: 305, column: 11, scope: !298, inlinedAt: !329)
!344 = !DILocation(line: 305, column: 2, scope: !298, inlinedAt: !329)
!345 = !DILocation(line: 215, column: 21, scope: !330)
!346 = !DILocation(line: 284, column: 6, scope: !298, inlinedAt: !329)
!347 = !DILocation(line: 304, column: 13, scope: !298, inlinedAt: !329)
!348 = !DILocation(line: 294, column: 13, scope: !298, inlinedAt: !329)
!349 = !DILocation(line: 294, column: 30, scope: !298, inlinedAt: !329)
!350 = !DILocation(line: 305, column: 9, scope: !298, inlinedAt: !329)
!351 = !DILocation(line: 306, column: 7, scope: !352, inlinedAt: !329)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 306, column: 7)
!353 = distinct !DILexicalBlock(scope: !298, file: !3, line: 305, column: 21)
!354 = !DILocation(line: 306, column: 25, scope: !352, inlinedAt: !329)
!355 = !DILocation(line: 308, column: 30, scope: !356, inlinedAt: !329)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 307, column: 8)
!357 = distinct !DILexicalBlock(scope: !352, file: !3, line: 306, column: 48)
!358 = !{!140, !144, i64 24}
!359 = !DILocation(line: 293, column: 15, scope: !298, inlinedAt: !329)
!360 = !DILocation(line: 307, column: 8, scope: !356, inlinedAt: !329)
!361 = !DILocation(line: 307, column: 8, scope: !357, inlinedAt: !329)
!362 = !DILocation(line: 310, column: 19, scope: !357, inlinedAt: !329)
!363 = !{!364, !141, i64 8}
!364 = !{!"", !141, i64 0, !141, i64 8, !141, i64 16, !148, i64 24}
!365 = !DILocation(line: 311, column: 9, scope: !366, inlinedAt: !329)
!366 = distinct !DILexicalBlock(scope: !357, file: !3, line: 311, column: 8)
!367 = !DILocation(line: 311, column: 8, scope: !357, inlinedAt: !329)
!368 = !DILocation(line: 313, column: 33, scope: !357, inlinedAt: !329)
!369 = !DILocation(line: 314, column: 19, scope: !357, inlinedAt: !329)
!370 = !{!364, !141, i64 0}
!371 = !DILocation(line: 315, column: 9, scope: !372, inlinedAt: !329)
!372 = distinct !DILexicalBlock(scope: !357, file: !3, line: 315, column: 8)
!373 = !DILocation(line: 315, column: 8, scope: !357, inlinedAt: !329)
!374 = !DILocation(line: 317, column: 33, scope: !357, inlinedAt: !329)
!375 = !DILocation(line: 318, column: 15, scope: !357, inlinedAt: !329)
!376 = !{!364, !141, i64 16}
!377 = !DILocation(line: 319, column: 9, scope: !378, inlinedAt: !329)
