; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/hiredis.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/hiredis.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.redisReplyObjectFunctions = type { i8* (%struct.redisReadTask*, i8*, i64)*, i8* (%struct.redisReadTask*, i32)*, i8* (%struct.redisReadTask*, i64)*, i8* (%struct.redisReadTask*)*, void (i8*)* }
%struct.redisReadTask = type { i32, i32, i32, i8*, %struct.redisReadTask*, i8* }
%struct.redisReply = type { i32, i64, i64, i8*, i64, %struct.redisReply** }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.redisContext = type { i32, [128 x i8], i32, i32, i8*, %struct.redisReader*, i32, %struct.timeval*, %struct.anon, %struct.anon.0 }
%struct.redisReader = type { i32, [128 x i8], i8*, i64, i64, i64, [9 x %struct.redisReadTask], i32, i8*, %struct.redisReplyObjectFunctions*, i8* }
%struct.timeval = type { i64, i64 }
%struct.anon = type { i8*, i8*, i32 }
%struct.anon.0 = type { i8* }

@.str = private unnamed_addr constant [2 x i8] c"%\00", align 1
@redisvFormatCommand.intfmts = internal constant [7 x i8] c"diouxX\00", align 1, !dbg !0
@redisvFormatCommand.flags = internal constant [6 x i8] c"#0-+ \00", align 1, !dbg !75
@.str.1 = private unnamed_addr constant [9 x i8] c"eEfFgGaA\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"*%d\0D\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "intfmts", scope: !2, file: !3, line: 278, type: !162, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "redisvFormatCommand", scope: !3, file: !3, line: 210, type: !4, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !123)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/hiredis.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !10, !12}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 100, size: 192, elements: !14)
!14 = !{!15, !17, !18, !20}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !13, file: !3, line: 100, baseType: !16, size: 32)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !13, file: !3, line: 100, baseType: !16, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !13, file: !3, line: 100, baseType: !19, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !13, file: !3, line: 100, baseType: !19, size: 64, offset: 128)
!21 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !28, globals: !74)
!22 = !{!23}
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "redisConnectionType", file: !24, line: 134, baseType: !16, size: 32, elements: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/hiredis.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !{!26, !27}
!26 = !DIEnumerator(name: "REDIS_CONN_TCP", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "REDIS_CONN_UNIX", value: 1, isUnsigned: true)
!28 = !{!19, !6, !29, !45, !55, !64}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !31, line: 50, size: 24, elements: !32)
!31 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/sds.h", directory: "/root/.unikraft/apps/redis/build")
!32 = !{!33, !39, !40, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !30, file: !31, line: 51, baseType: !34, size: 8)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 24, baseType: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !37, line: 43, baseType: !38)
!37 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !30, file: !31, line: 52, baseType: !34, size: 8, offset: 8)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !31, line: 53, baseType: !38, size: 8, offset: 16)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !30, file: !31, line: 54, baseType: !42, offset: 24)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: -1)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !31, line: 56, size: 40, elements: !47)
!47 = !{!48, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !31, line: 57, baseType: !49, size: 16)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !35, line: 36, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !37, line: 57, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !31, line: 58, baseType: !49, size: 16, offset: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !31, line: 59, baseType: !38, size: 8, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !31, line: 60, baseType: !42, offset: 40)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !31, line: 62, size: 72, elements: !57)
!57 = !{!58, !61, !62, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !31, line: 63, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 48, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !37, line: 79, baseType: !16)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !56, file: !31, line: 64, baseType: !59, size: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !31, line: 65, baseType: !38, size: 8, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !31, line: 66, baseType: !42, offset: 72)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !31, line: 68, size: 136, elements: !66)
!66 = !{!67, !71, !72, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !31, line: 69, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !35, line: 60, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !37, line: 105, baseType: !70)
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !65, file: !31, line: 70, baseType: !68, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !31, line: 71, baseType: !38, size: 8, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !65, file: !31, line: 72, baseType: !42, offset: 136)
!74 = !{!0, !75, !80}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !3, line: 279, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 48, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 6)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "defaultFunctions", scope: !21, file: !3, line: 54, type: !82, isLocal: true, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReplyObjectFunctions", file: !83, line: 78, baseType: !84)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/hiredis/read.h", directory: "/root/.unikraft/apps/redis/build")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReplyObjectFunctions", file: !83, line: 72, size: 320, elements: !85)
!85 = !{!86, !106, !110, !115, !119}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "createString", scope: !84, file: !83, line: 73, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!19, !90, !8, !102}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReadTask", file: !83, line: 70, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReadTask", file: !83, line: 63, size: 320, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !101}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !83, line: 64, baseType: !6, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !93, file: !83, line: 65, baseType: !6, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !93, file: !83, line: 66, baseType: !6, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !93, file: !83, line: 67, baseType: !19, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !93, file: !83, line: 68, baseType: !100, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !93, file: !83, line: 69, baseType: !19, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 40, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !105, line: 129, baseType: !70)
!105 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "createArray", scope: !84, file: !83, line: 74, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!19, !90, !6}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "createInteger", scope: !84, file: !83, line: 75, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!19, !90, !114}
!114 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "createNil", scope: !84, file: !83, line: 76, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!19, !90}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "freeObject", scope: !84, file: !83, line: 77, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !19}
!123 = !{!124, !125, !126, !127, !128, !129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !144, !145, !151, !152, !153}
!124 = !DILocalVariable(name: "target", arg: 1, scope: !2, file: !3, line: 210, type: !7)
!125 = !DILocalVariable(name: "format", arg: 2, scope: !2, file: !3, line: 210, type: !10)
!126 = !DILocalVariable(name: "ap", arg: 3, scope: !2, file: !3, line: 210, type: !12)
!127 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 211, type: !10)
!128 = !DILocalVariable(name: "cmd", scope: !2, file: !3, line: 212, type: !8)
!129 = !DILocalVariable(name: "pos", scope: !2, file: !3, line: 213, type: !6)
!130 = !DILocalVariable(name: "curarg", scope: !2, file: !3, line: 214, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !31, line: 42, baseType: !8)
!132 = !DILocalVariable(name: "newarg", scope: !2, file: !3, line: 214, type: !131)
!133 = !DILocalVariable(name: "touched", scope: !2, file: !3, line: 215, type: !6)
!134 = !DILocalVariable(name: "curargv", scope: !2, file: !3, line: 216, type: !7)
!135 = !DILocalVariable(name: "newargv", scope: !2, file: !3, line: 216, type: !7)
!136 = !DILocalVariable(name: "argc", scope: !2, file: !3, line: 217, type: !6)
!137 = !DILocalVariable(name: "totlen", scope: !2, file: !3, line: 218, type: !6)
!138 = !DILocalVariable(name: "error_type", scope: !2, file: !3, line: 219, type: !6)
!139 = !DILocalVariable(name: "j", scope: !2, file: !3, line: 220, type: !6)
!140 = !DILocalVariable(name: "arg", scope: !141, file: !3, line: 253, type: !8)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 252, column: 16)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 232, column: 13)
!143 = distinct !DILexicalBlock(scope: !2, file: !3, line: 231, column: 23)
!144 = !DILocalVariable(name: "size", scope: !141, file: !3, line: 254, type: !102)
!145 = !DILocalVariable(name: "_format", scope: !146, file: !3, line: 280, type: !148)
!146 = distinct !DILexicalBlock(scope: !147, file: !3, line: 277, column: 17)
!147 = distinct !DILexicalBlock(scope: !141, file: !3, line: 259, column: 26)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 16)
!151 = !DILocalVariable(name: "_p", scope: !146, file: !3, line: 281, type: !10)
!152 = !DILocalVariable(name: "_l", scope: !146, file: !3, line: 282, type: !102)
!153 = !DILocalVariable(name: "_cpy", scope: !146, file: !3, line: 283, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !155, line: 46, baseType: !156)
!155 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !157, line: 51, baseType: !158)
!157 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 283, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 1)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 56, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 7)
!165 = !{i32 2, !"Dwarf Version", i32 4}
!166 = !{i32 2, !"Debug Info Version", i32 3}
!167 = !{i32 1, !"wchar_size", i32 4}
!168 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!169 = distinct !DISubprogram(name: "freeReplyObject", scope: !3, file: !3, line: 74, type: !121, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !170)
!170 = !{!171, !172, !185}
!171 = !DILocalVariable(name: "reply", arg: 1, scope: !169, file: !3, line: 74, type: !19)
!172 = !DILocalVariable(name: "r", scope: !169, file: !3, line: 75, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReply", file: !24, line: 119, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReply", file: !24, line: 112, size: 384, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !24, line: 113, baseType: !6, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !175, file: !24, line: 114, baseType: !114, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !24, line: 115, baseType: !102, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !175, file: !24, line: 116, baseType: !8, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !175, file: !24, line: 117, baseType: !102, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !175, file: !24, line: 118, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!185 = !DILocalVariable(name: "j", scope: !169, file: !3, line: 76, type: !102)
!186 = !DILocation(line: 74, column: 28, scope: !169)
!187 = !DILocation(line: 75, column: 17, scope: !169)
!188 = !DILocation(line: 78, column: 11, scope: !189)
!189 = distinct !DILexicalBlock(scope: !169, file: !3, line: 78, column: 9)
!190 = !DILocation(line: 78, column: 9, scope: !169)
!191 = !DILocation(line: 81, column: 15, scope: !169)
!192 = !{!193, !194, i64 0}
!193 = !{!"redisReply", !194, i64 0, !197, i64 8, !198, i64 16, !199, i64 24, !198, i64 32, !199, i64 40}
!194 = !{!"int", !195, i64 0}
!195 = !{!"omnipotent char", !196, i64 0}
!196 = !{!"Simple C/C++ TBAA"}
!197 = !{!"long long", !195, i64 0}
!198 = !{!"long", !195, i64 0}
!199 = !{!"any pointer", !195, i64 0}
!200 = !DILocation(line: 81, column: 5, scope: !169)
!201 = !DILocation(line: 85, column: 16, scope: !202)
!202 = distinct !DILexicalBlock(scope: !203, file: !3, line: 85, column: 13)
!203 = distinct !DILexicalBlock(scope: !169, file: !3, line: 81, column: 21)
!204 = !{!193, !199, i64 40}
!205 = !DILocation(line: 85, column: 24, scope: !202)
!206 = !DILocation(line: 85, column: 13, scope: !203)
!207 = !DILocation(line: 76, column: 12, scope: !169)
!208 = !DILocation(line: 86, column: 32, scope: !209)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 86, column: 13)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 86, column: 13)
!211 = distinct !DILexicalBlock(scope: !202, file: !3, line: 85, column: 33)
!212 = !{!193, !198, i64 32}
!213 = !DILocation(line: 86, column: 27, scope: !209)
!214 = !DILocation(line: 86, column: 13, scope: !210)
!215 = !DILocation(line: 87, column: 21, scope: !216)
!216 = distinct !DILexicalBlock(scope: !209, file: !3, line: 87, column: 21)
!217 = !{!199, !199, i64 0}
!218 = !DILocation(line: 87, column: 35, scope: !216)
!219 = !DILocation(line: 87, column: 21, scope: !209)
!220 = !DILocation(line: 88, column: 37, scope: !216)
!221 = !DILocation(line: 88, column: 21, scope: !216)
!222 = !DILocation(line: 0, scope: !211)
!223 = !DILocation(line: 86, column: 43, scope: !209)
!224 = distinct !{!224, !214, !225}
!225 = !DILocation(line: 88, column: 50, scope: !210)
!226 = !DILocation(line: 89, column: 18, scope: !211)
!227 = !DILocation(line: 89, column: 13, scope: !211)
!228 = !DILocation(line: 90, column: 9, scope: !211)
!229 = !DILocation(line: 95, column: 16, scope: !230)
!230 = distinct !DILexicalBlock(scope: !203, file: !3, line: 95, column: 13)
!231 = !{!193, !199, i64 24}
!232 = !DILocation(line: 95, column: 20, scope: !230)
!233 = !DILocation(line: 95, column: 13, scope: !203)
!234 = !DILocation(line: 96, column: 13, scope: !230)
!235 = !DILocation(line: 99, column: 5, scope: !169)
!236 = !DILocation(line: 100, column: 1, scope: !169)
!237 = !DILocation(line: 210, column: 32, scope: !2)
!238 = !DILocation(line: 210, column: 52, scope: !2)
!239 = !DILocation(line: 210, column: 68, scope: !2)
!240 = !DILocation(line: 211, column: 17, scope: !2)
!241 = !DILocation(line: 212, column: 11, scope: !2)
!242 = !DILocation(line: 215, column: 9, scope: !2)
!243 = !DILocation(line: 216, column: 12, scope: !2)
!244 = !DILocation(line: 216, column: 30, scope: !2)
!245 = !DILocation(line: 217, column: 9, scope: !2)
!246 = !DILocation(line: 218, column: 9, scope: !2)
!247 = !DILocation(line: 219, column: 9, scope: !2)
!248 = !DILocation(line: 223, column: 16, scope: !249)
!249 = distinct !DILexicalBlock(scope: !2, file: !3, line: 223, column: 9)
!250 = !DILocation(line: 223, column: 9, scope: !2)
!251 = !DILocation(line: 227, column: 14, scope: !2)
!252 = !DILocation(line: 214, column: 9, scope: !2)
!253 = !DILocation(line: 228, column: 16, scope: !254)
!254 = distinct !DILexicalBlock(scope: !2, file: !3, line: 228, column: 9)
!255 = !DILocation(line: 228, column: 9, scope: !2)
!256 = !DILocation(line: 231, column: 11, scope: !2)
!257 = !DILocation(line: 0, scope: !143)
!258 = !DILocation(line: 0, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 234, column: 30)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 234, column: 21)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 233, column: 28)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 233, column: 17)
!263 = distinct !DILexicalBlock(scope: !142, file: !3, line: 232, column: 40)
!264 = !{!195, !195, i64 0}
!265 = !DILocation(line: 231, column: 5, scope: !2)
!266 = !DILocation(line: 232, column: 26, scope: !142)
!267 = !DILocation(line: 232, column: 31, scope: !142)
!268 = !DILocation(line: 232, column: 13, scope: !143)
!269 = !DILocation(line: 234, column: 21, scope: !260)
!270 = !DILocation(line: 234, column: 21, scope: !261)
!271 = !DILocation(line: 235, column: 66, scope: !259)
!272 = !DILocation(line: 235, column: 61, scope: !259)
!273 = !DILocation(line: 235, column: 60, scope: !259)
!274 = !DILocation(line: 235, column: 31, scope: !259)
!275 = !DILocation(line: 236, column: 33, scope: !276)
!276 = distinct !DILexicalBlock(scope: !259, file: !3, line: 236, column: 25)
!277 = !DILocation(line: 236, column: 25, scope: !259)
!278 = !DILocation(line: 238, column: 21, scope: !259)
!279 = !DILocation(line: 238, column: 37, scope: !259)
!280 = !DILocalVariable(name: "s", arg: 1, scope: !281, file: !31, line: 86, type: !284)
!281 = distinct !DISubprogram(name: "sdslen", scope: !31, file: !31, line: 86, type: !282, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !285)
!282 = !DISubroutineType(types: !283)
!283 = !{!102, !284}
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!285 = !{!280, !286}
!286 = !DILocalVariable(name: "flags", scope: !281, file: !31, line: 87, type: !38)
!287 = !DILocation(line: 86, column: 39, scope: !281, inlinedAt: !288)
!288 = distinct !DILocation(line: 239, column: 39, scope: !259)
!289 = !DILocation(line: 87, column: 27, scope: !281, inlinedAt: !288)
!290 = !DILocation(line: 87, column: 19, scope: !281, inlinedAt: !288)
!291 = !DILocation(line: 88, column: 5, scope: !281, inlinedAt: !288)
!292 = !DILocation(line: 101, column: 1, scope: !281, inlinedAt: !288)
!293 = !DILocalVariable(name: "len", arg: 1, scope: !294, file: !3, line: 206, type: !102)
!294 = distinct !DISubprogram(name: "bulklen", scope: !3, file: !3, line: 206, type: !295, isLocal: true, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !297)
!295 = !DISubroutineType(types: !296)
!296 = !{!102, !102}
!297 = !{!293}
!298 = !DILocation(line: 206, column: 30, scope: !294, inlinedAt: !299)
!299 = distinct !DILocation(line: 239, column: 31, scope: !259)
!300 = !DILocalVariable(name: "v", arg: 1, scope: !301, file: !3, line: 193, type: !68)
!301 = distinct !DISubprogram(name: "countDigits", scope: !3, file: !3, line: 193, type: !302, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!59, !68}
!304 = !{!300, !305}
!305 = !DILocalVariable(name: "result", scope: !301, file: !3, line: 194, type: !59)
!306 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !307)
!307 = distinct !DILocation(line: 207, column: 14, scope: !294, inlinedAt: !299)
!308 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !307)
!309 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !307)
!310 = distinct !DILexicalBlock(scope: !311, file: !3, line: 195, column: 12)
!311 = distinct !DILexicalBlock(scope: !312, file: !3, line: 195, column: 3)
!312 = distinct !DILexicalBlock(scope: !301, file: !3, line: 195, column: 3)
!313 = !DILocation(line: 90, column: 20, scope: !314, inlinedAt: !288)
!314 = distinct !DILexicalBlock(scope: !281, file: !31, line: 88, column: 33)
!315 = !DILocation(line: 90, column: 13, scope: !314, inlinedAt: !288)
!316 = !DILocation(line: 92, column: 20, scope: !314, inlinedAt: !288)
!317 = !DILocation(line: 92, column: 34, scope: !314, inlinedAt: !288)
!318 = !DILocation(line: 92, column: 13, scope: !314, inlinedAt: !288)
!319 = !DILocation(line: 94, column: 20, scope: !314, inlinedAt: !288)
!320 = !DILocation(line: 94, column: 35, scope: !314, inlinedAt: !288)
!321 = !{!322, !322, i64 0}
!322 = !{!"short", !195, i64 0}
!323 = !DILocation(line: 94, column: 13, scope: !314, inlinedAt: !288)
!324 = !DILocation(line: 96, column: 20, scope: !314, inlinedAt: !288)
!325 = !DILocation(line: 96, column: 35, scope: !314, inlinedAt: !288)
!326 = !{!194, !194, i64 0}
!327 = !DILocation(line: 96, column: 13, scope: !314, inlinedAt: !288)
!328 = !DILocation(line: 98, column: 20, scope: !314, inlinedAt: !288)
!329 = !DILocation(line: 98, column: 35, scope: !314, inlinedAt: !288)
!330 = !{!198, !198, i64 0}
!331 = !DILocation(line: 98, column: 13, scope: !314, inlinedAt: !288)
!332 = !DILocation(line: 0, scope: !314, inlinedAt: !288)
!333 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !307)
!334 = distinct !DILexicalBlock(scope: !310, file: !3, line: 196, column: 9)
!335 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !307)
!336 = distinct !DILexicalBlock(scope: !310, file: !3, line: 197, column: 9)
!337 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !307)
!338 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !307)
!339 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !307)
!340 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !307)
!341 = distinct !DILexicalBlock(scope: !310, file: !3, line: 198, column: 9)
!342 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !307)
!343 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !307)
!344 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !307)
!345 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !307)
!346 = distinct !DILexicalBlock(scope: !310, file: !3, line: 199, column: 9)
!347 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !307)
!348 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !307)
!349 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !307)
!350 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !307)
!351 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !307)
!352 = distinct !{!352, !353, !354}
!353 = !DILocation(line: 195, column: 3, scope: !312)
!354 = !DILocation(line: 202, column: 3, scope: !312)
!355 = !DILocation(line: 0, scope: !346, inlinedAt: !307)
!356 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !307)
!357 = !DILocation(line: 207, column: 5, scope: !294, inlinedAt: !299)
!358 = !DILocation(line: 242, column: 30, scope: !259)
!359 = !DILocation(line: 243, column: 32, scope: !360)
!360 = distinct !DILexicalBlock(scope: !259, file: !3, line: 243, column: 25)
!361 = !DILocation(line: 243, column: 25, scope: !259)
!362 = !DILocation(line: 239, column: 28, scope: !259)
!363 = !DILocation(line: 245, column: 17, scope: !259)
!364 = !DILocation(line: 247, column: 26, scope: !365)
!365 = distinct !DILexicalBlock(scope: !262, file: !3, line: 246, column: 20)
!366 = !DILocation(line: 214, column: 17, scope: !2)
!367 = !DILocation(line: 248, column: 28, scope: !368)
!368 = distinct !DILexicalBlock(scope: !365, file: !3, line: 248, column: 21)
!369 = !DILocation(line: 248, column: 21, scope: !365)
!370 = !DILocation(line: 259, column: 13, scope: !141)
!371 = !DILocation(line: 261, column: 23, scope: !147)
!372 = !DILocation(line: 253, column: 19, scope: !141)
!373 = !DILocation(line: 262, column: 24, scope: !147)
!374 = !DILocation(line: 254, column: 20, scope: !141)
!375 = !DILocation(line: 263, column: 26, scope: !376)
!376 = distinct !DILexicalBlock(scope: !147, file: !3, line: 263, column: 21)
!377 = !DILocation(line: 263, column: 21, scope: !147)
!378 = !DILocation(line: 264, column: 30, scope: !376)
!379 = !DILocation(line: 264, column: 21, scope: !376)
!380 = !DILocation(line: 267, column: 23, scope: !147)
!381 = !DILocation(line: 268, column: 24, scope: !147)
!382 = !DILocation(line: 269, column: 26, scope: !383)
!383 = distinct !DILexicalBlock(scope: !147, file: !3, line: 269, column: 21)
!384 = !DILocation(line: 269, column: 21, scope: !147)
!385 = !DILocation(line: 270, column: 30, scope: !383)
!386 = !DILocation(line: 270, column: 21, scope: !383)
!387 = !DILocation(line: 273, column: 26, scope: !147)
!388 = !DILocation(line: 274, column: 17, scope: !147)
!389 = !DILocation(line: 280, column: 21, scope: !146)
!390 = !DILocation(line: 280, column: 26, scope: !146)
!391 = !DILocation(line: 281, column: 33, scope: !146)
!392 = !DILocation(line: 282, column: 28, scope: !146)
!393 = !DILocation(line: 283, column: 21, scope: !146)
!394 = !DILocation(line: 283, column: 29, scope: !146)
!395 = !DILocation(line: 286, column: 28, scope: !146)
!396 = !DILocation(line: 286, column: 43, scope: !146)
!397 = !DILocation(line: 286, column: 61, scope: !146)
!398 = !DILocation(line: 286, column: 21, scope: !146)
!399 = !DILocation(line: 286, column: 72, scope: !146)
!400 = !DILocation(line: 286, column: 32, scope: !146)
!401 = !DILocation(line: 286, column: 40, scope: !146)
!402 = distinct !{!402, !398, !399}
!403 = !DILocation(line: 289, column: 28, scope: !146)
!404 = !DILocation(line: 289, column: 32, scope: !146)
!405 = !DILocation(line: 289, column: 40, scope: !146)
!406 = !DILocation(line: 289, column: 43, scope: !146)
!407 = !DILocation(line: 289, column: 21, scope: !146)
!408 = !DILocation(line: 289, column: 59, scope: !146)
!409 = distinct !{!409, !407, !408}
!410 = !DILocation(line: 292, column: 29, scope: !411)
!411 = distinct !DILexicalBlock(scope: !146, file: !3, line: 292, column: 25)
!412 = !DILocation(line: 292, column: 25, scope: !146)
!413 = !DILocation(line: 0, scope: !414)
!414 = distinct !DILexicalBlock(scope: !411, file: !3, line: 292, column: 37)
!415 = !DILocation(line: 294, column: 32, scope: !414)
!416 = !DILocation(line: 294, column: 36, scope: !414)
!417 = !DILocation(line: 294, column: 44, scope: !414)
!418 = !DILocation(line: 294, column: 47, scope: !414)
!419 = !DILocation(line: 294, column: 25, scope: !414)
!420 = distinct !{!420, !419, !421}
!421 = !DILocation(line: 294, column: 63, scope: !414)
!422 = !DILocation(line: 0, scope: !146)
!423 = !DILocation(line: 298, column: 21, scope: !146)
!424 = !DILocation(line: 301, column: 40, scope: !425)
!425 = distinct !DILexicalBlock(scope: !146, file: !3, line: 301, column: 25)
!426 = !DILocation(line: 301, column: 25, scope: !425)
!427 = !DILocation(line: 301, column: 45, scope: !425)
!428 = !DILocation(line: 301, column: 25, scope: !146)
!429 = !DILocation(line: 302, column: 25, scope: !430)
!430 = distinct !DILexicalBlock(scope: !425, file: !3, line: 301, column: 54)
!431 = !DILocation(line: 307, column: 43, scope: !432)
!432 = distinct !DILexicalBlock(scope: !146, file: !3, line: 307, column: 25)
!433 = !DILocation(line: 307, column: 25, scope: !432)
!434 = !DILocation(line: 307, column: 48, scope: !432)
!435 = !DILocation(line: 307, column: 25, scope: !146)
!436 = !DILocation(line: 308, column: 25, scope: !437)
!437 = distinct !DILexicalBlock(scope: !432, file: !3, line: 307, column: 57)
!438 = !DILocation(line: 313, column: 25, scope: !439)
!439 = distinct !DILexicalBlock(scope: !146, file: !3, line: 313, column: 25)
!440 = !DILocation(line: 313, column: 38, scope: !439)
!441 = !DILocation(line: 313, column: 41, scope: !439)
!442 = !DILocation(line: 313, column: 25, scope: !146)
!443 = !DILocation(line: 314, column: 28, scope: !444)
!444 = distinct !DILexicalBlock(scope: !439, file: !3, line: 313, column: 55)
!445 = !DILocation(line: 315, column: 29, scope: !446)
!446 = distinct !DILexicalBlock(scope: !444, file: !3, line: 315, column: 29)
!447 = !DILocation(line: 315, column: 33, scope: !446)
!448 = !DILocation(line: 315, column: 41, scope: !446)
!449 = !DILocation(line: 315, column: 44, scope: !446)
!450 = !DILocation(line: 315, column: 64, scope: !446)
!451 = !DILocation(line: 315, column: 29, scope: !444)
!452 = !DILocation(line: 316, column: 29, scope: !453)
!453 = distinct !DILexicalBlock(scope: !446, file: !3, line: 315, column: 73)
!454 = !DILocation(line: 325, column: 29, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 325, column: 29)
!456 = distinct !DILexicalBlock(scope: !457, file: !3, line: 323, column: 39)
!457 = distinct !DILexicalBlock(scope: !146, file: !3, line: 323, column: 25)
!458 = !DILocation(line: 325, column: 44, scope: !455)
!459 = !DILocation(line: 325, column: 64, scope: !455)
!460 = !DILocation(line: 325, column: 29, scope: !456)
!461 = !DILocation(line: 326, column: 29, scope: !462)
!462 = distinct !DILexicalBlock(scope: !455, file: !3, line: 325, column: 73)
!463 = !DILocation(line: 333, column: 41, scope: !464)
!464 = distinct !DILexicalBlock(scope: !146, file: !3, line: 333, column: 25)
!465 = !DILocation(line: 333, column: 25, scope: !146)
!466 = !DILocation(line: 334, column: 28, scope: !467)
!467 = distinct !DILexicalBlock(scope: !464, file: !3, line: 333, column: 55)
!468 = !DILocation(line: 335, column: 29, scope: !469)
!469 = distinct !DILexicalBlock(scope: !467, file: !3, line: 335, column: 29)
!470 = !DILocation(line: 335, column: 33, scope: !469)
!471 = !DILocation(line: 335, column: 41, scope: !469)
!472 = !DILocation(line: 335, column: 44, scope: !469)
!473 = !DILocation(line: 335, column: 64, scope: !469)
!474 = !DILocation(line: 335, column: 29, scope: !467)
!475 = !DILocation(line: 336, column: 29, scope: !476)
!476 = distinct !DILexicalBlock(scope: !469, file: !3, line: 335, column: 73)
!477 = !DILocation(line: 345, column: 29, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !3, line: 345, column: 29)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 343, column: 39)
!480 = distinct !DILexicalBlock(scope: !146, file: !3, line: 343, column: 25)
!481 = !DILocation(line: 345, column: 44, scope: !478)
!482 = !DILocation(line: 345, column: 64, scope: !478)
!483 = !DILocation(line: 345, column: 29, scope: !479)
!484 = !DILocation(line: 346, column: 29, scope: !485)
!485 = distinct !DILexicalBlock(scope: !478, file: !3, line: 345, column: 73)
!486 = !DILocation(line: 0, scope: !479)
!487 = !DILocation(line: 357, column: 29, scope: !146)
!488 = !DILocation(line: 357, column: 32, scope: !146)
!489 = !DILocation(line: 358, column: 28, scope: !490)
!490 = distinct !DILexicalBlock(scope: !146, file: !3, line: 358, column: 25)
!491 = !DILocation(line: 358, column: 25, scope: !146)
!492 = !DILocation(line: 359, column: 25, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !3, line: 358, column: 49)
!494 = !DILocation(line: 360, column: 25, scope: !493)
!495 = !DILocation(line: 360, column: 37, scope: !493)
!496 = !DILocation(line: 361, column: 34, scope: !493)
!497 = !DILocation(line: 366, column: 21, scope: !493)
!498 = !DILocation(line: 377, column: 14, scope: !141)
!499 = !DILocation(line: 0, scope: !141)
!500 = !DILocation(line: 368, column: 21, scope: !146)
!501 = !DILocation(line: 370, column: 17, scope: !147)
!502 = !DILocation(line: 353, column: 21, scope: !146)
!503 = !DILocation(line: 373, column: 24, scope: !504)
!504 = distinct !DILexicalBlock(scope: !141, file: !3, line: 373, column: 17)
!505 = !DILocation(line: 0, scope: !493)
!506 = !DILocation(line: 0, scope: !2)
!507 = !DILocation(line: 379, column: 10, scope: !143)
!508 = distinct !{!508, !265, !509}
!509 = !DILocation(line: 380, column: 5, scope: !2)
!510 = !DILocation(line: 383, column: 9, scope: !511)
!511 = distinct !DILexicalBlock(scope: !2, file: !3, line: 383, column: 9)
!512 = !DILocation(line: 383, column: 9, scope: !2)
!513 = !DILocation(line: 384, column: 54, scope: !514)
!514 = distinct !DILexicalBlock(scope: !511, file: !3, line: 383, column: 18)
!515 = !DILocation(line: 384, column: 49, scope: !514)
!516 = !DILocation(line: 384, column: 48, scope: !514)
!517 = !DILocation(line: 384, column: 19, scope: !514)
!518 = !DILocation(line: 385, column: 21, scope: !519)
!519 = distinct !DILexicalBlock(scope: !514, file: !3, line: 385, column: 13)
!520 = !DILocation(line: 385, column: 13, scope: !514)
!521 = !DILocation(line: 387, column: 9, scope: !514)
!522 = !DILocation(line: 387, column: 25, scope: !514)
!523 = !DILocation(line: 86, column: 39, scope: !281, inlinedAt: !524)
!524 = distinct !DILocation(line: 388, column: 27, scope: !514)
!525 = !DILocation(line: 87, column: 27, scope: !281, inlinedAt: !524)
!526 = !DILocation(line: 87, column: 19, scope: !281, inlinedAt: !524)
!527 = !DILocation(line: 88, column: 5, scope: !281, inlinedAt: !524)
!528 = !DILocation(line: 101, column: 1, scope: !281, inlinedAt: !524)
!529 = !DILocation(line: 206, column: 30, scope: !294, inlinedAt: !530)
!530 = distinct !DILocation(line: 388, column: 19, scope: !514)
!531 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !532)
!532 = distinct !DILocation(line: 207, column: 14, scope: !294, inlinedAt: !530)
!533 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !532)
!534 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !532)
!535 = !DILocation(line: 90, column: 20, scope: !314, inlinedAt: !524)
!536 = !DILocation(line: 90, column: 13, scope: !314, inlinedAt: !524)
!537 = !DILocation(line: 92, column: 20, scope: !314, inlinedAt: !524)
!538 = !DILocation(line: 92, column: 34, scope: !314, inlinedAt: !524)
!539 = !DILocation(line: 92, column: 13, scope: !314, inlinedAt: !524)
!540 = !DILocation(line: 94, column: 20, scope: !314, inlinedAt: !524)
!541 = !DILocation(line: 94, column: 35, scope: !314, inlinedAt: !524)
!542 = !DILocation(line: 94, column: 13, scope: !314, inlinedAt: !524)
!543 = !DILocation(line: 96, column: 20, scope: !314, inlinedAt: !524)
!544 = !DILocation(line: 96, column: 35, scope: !314, inlinedAt: !524)
!545 = !DILocation(line: 96, column: 13, scope: !314, inlinedAt: !524)
!546 = !DILocation(line: 98, column: 20, scope: !314, inlinedAt: !524)
!547 = !DILocation(line: 98, column: 35, scope: !314, inlinedAt: !524)
!548 = !DILocation(line: 98, column: 13, scope: !314, inlinedAt: !524)
!549 = !DILocation(line: 0, scope: !314, inlinedAt: !524)
!550 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !532)
!551 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !532)
!552 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !532)
!553 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !532)
!554 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !532)
!555 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !532)
!556 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !532)
!557 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !532)
!558 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !532)
!559 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !532)
!560 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !532)
!561 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !532)
!562 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !532)
!563 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !532)
!564 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !532)
!565 = !DILocation(line: 0, scope: !346, inlinedAt: !532)
!566 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !532)
!567 = !DILocation(line: 207, column: 5, scope: !294, inlinedAt: !530)
!568 = !DILocation(line: 388, column: 16, scope: !514)
!569 = !DILocation(line: 389, column: 5, scope: !514)
!570 = !DILocation(line: 390, column: 9, scope: !571)
!571 = distinct !DILexicalBlock(scope: !511, file: !3, line: 389, column: 12)
!572 = !DILocation(line: 397, column: 29, scope: !2)
!573 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !574)
!574 = distinct !DILocation(line: 397, column: 17, scope: !2)
!575 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !574)
!576 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !574)
!577 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !574)
!578 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !574)
!579 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !574)
!580 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !574)
!581 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !574)
!582 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !574)
!583 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !574)
!584 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !574)
!585 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !574)
!586 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !574)
!587 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !574)
!588 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !574)
!589 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !574)
!590 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !574)
!591 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !574)
!592 = !DILocation(line: 0, scope: !346, inlinedAt: !574)
!593 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !574)
!594 = !DILocation(line: 397, column: 34, scope: !2)
!595 = !DILocation(line: 397, column: 12, scope: !2)
!596 = !DILocation(line: 400, column: 24, scope: !2)
!597 = !DILocation(line: 400, column: 18, scope: !2)
!598 = !DILocation(line: 400, column: 11, scope: !2)
!599 = !DILocation(line: 401, column: 13, scope: !600)
!600 = distinct !DILexicalBlock(scope: !2, file: !3, line: 401, column: 9)
!601 = !DILocation(line: 401, column: 9, scope: !2)
!602 = !DILocation(line: 403, column: 11, scope: !2)
!603 = !DILocation(line: 213, column: 9, scope: !2)
!604 = !DILocation(line: 220, column: 9, scope: !2)
!605 = !DILocation(line: 404, column: 19, scope: !606)
!606 = distinct !DILexicalBlock(scope: !607, file: !3, line: 404, column: 5)
!607 = distinct !DILexicalBlock(scope: !2, file: !3, line: 404, column: 5)
!608 = !DILocation(line: 404, column: 5, scope: !607)
!609 = !DILocation(line: 405, column: 27, scope: !610)
!610 = distinct !DILexicalBlock(scope: !606, file: !3, line: 404, column: 32)
!611 = !DILocation(line: 405, column: 50, scope: !610)
!612 = !DILocation(line: 86, column: 39, scope: !281, inlinedAt: !613)
!613 = distinct !DILocation(line: 405, column: 43, scope: !610)
!614 = !DILocation(line: 87, column: 27, scope: !281, inlinedAt: !613)
!615 = !DILocation(line: 87, column: 19, scope: !281, inlinedAt: !613)
!616 = !DILocation(line: 88, column: 5, scope: !281, inlinedAt: !613)
!617 = !DILocation(line: 90, column: 20, scope: !314, inlinedAt: !613)
!618 = !DILocation(line: 90, column: 13, scope: !314, inlinedAt: !613)
!619 = !DILocation(line: 92, column: 20, scope: !314, inlinedAt: !613)
!620 = !DILocation(line: 92, column: 34, scope: !314, inlinedAt: !613)
!621 = !DILocation(line: 92, column: 13, scope: !314, inlinedAt: !613)
!622 = !DILocation(line: 94, column: 20, scope: !314, inlinedAt: !613)
!623 = !DILocation(line: 94, column: 35, scope: !314, inlinedAt: !613)
!624 = !DILocation(line: 94, column: 13, scope: !314, inlinedAt: !613)
!625 = !DILocation(line: 96, column: 20, scope: !314, inlinedAt: !613)
!626 = !DILocation(line: 96, column: 35, scope: !314, inlinedAt: !613)
!627 = !DILocation(line: 96, column: 13, scope: !314, inlinedAt: !613)
!628 = !DILocation(line: 98, column: 20, scope: !314, inlinedAt: !613)
!629 = !DILocation(line: 98, column: 35, scope: !314, inlinedAt: !613)
!630 = !DILocation(line: 98, column: 13, scope: !314, inlinedAt: !613)
!631 = !DILocation(line: 0, scope: !314, inlinedAt: !613)
!632 = !DILocation(line: 101, column: 1, scope: !281, inlinedAt: !613)
!633 = !DILocation(line: 405, column: 16, scope: !610)
!634 = !DILocation(line: 405, column: 13, scope: !610)
!635 = !DILocation(line: 406, column: 19, scope: !610)
!636 = !DILocation(line: 406, column: 24, scope: !610)
!637 = !DILocation(line: 86, column: 39, scope: !281, inlinedAt: !638)
!638 = distinct !DILocation(line: 406, column: 35, scope: !610)
!639 = !DILocation(line: 87, column: 27, scope: !281, inlinedAt: !638)
!640 = !DILocation(line: 87, column: 19, scope: !281, inlinedAt: !638)
!641 = !DILocation(line: 88, column: 5, scope: !281, inlinedAt: !638)
!642 = !DILocation(line: 90, column: 20, scope: !314, inlinedAt: !638)
!643 = !DILocation(line: 90, column: 13, scope: !314, inlinedAt: !638)
!644 = !DILocation(line: 92, column: 20, scope: !314, inlinedAt: !638)
!645 = !DILocation(line: 92, column: 34, scope: !314, inlinedAt: !638)
!646 = !DILocation(line: 92, column: 13, scope: !314, inlinedAt: !638)
!647 = !DILocation(line: 94, column: 20, scope: !314, inlinedAt: !638)
!648 = !DILocation(line: 94, column: 35, scope: !314, inlinedAt: !638)
!649 = !DILocation(line: 94, column: 13, scope: !314, inlinedAt: !638)
!650 = !DILocation(line: 96, column: 20, scope: !314, inlinedAt: !638)
!651 = !DILocation(line: 96, column: 35, scope: !314, inlinedAt: !638)
!652 = !DILocation(line: 96, column: 13, scope: !314, inlinedAt: !638)
!653 = !DILocation(line: 98, column: 20, scope: !314, inlinedAt: !638)
!654 = !DILocation(line: 98, column: 35, scope: !314, inlinedAt: !638)
!655 = !DILocation(line: 98, column: 13, scope: !314, inlinedAt: !638)
!656 = !DILocation(line: 0, scope: !314, inlinedAt: !638)
!657 = !DILocation(line: 101, column: 1, scope: !281, inlinedAt: !638)
!658 = !DILocation(line: 406, column: 9, scope: !610)
!659 = !DILocation(line: 407, column: 23, scope: !610)
!660 = !DILocation(line: 86, column: 39, scope: !281, inlinedAt: !661)
!661 = distinct !DILocation(line: 407, column: 16, scope: !610)
!662 = !DILocation(line: 87, column: 27, scope: !281, inlinedAt: !661)
!663 = !DILocation(line: 87, column: 19, scope: !281, inlinedAt: !661)
!664 = !DILocation(line: 88, column: 5, scope: !281, inlinedAt: !661)
!665 = !DILocation(line: 90, column: 20, scope: !314, inlinedAt: !661)
!666 = !DILocation(line: 90, column: 13, scope: !314, inlinedAt: !661)
!667 = !DILocation(line: 92, column: 20, scope: !314, inlinedAt: !661)
!668 = !DILocation(line: 92, column: 34, scope: !314, inlinedAt: !661)
!669 = !DILocation(line: 92, column: 13, scope: !314, inlinedAt: !661)
!670 = !DILocation(line: 94, column: 20, scope: !314, inlinedAt: !661)
!671 = !DILocation(line: 94, column: 35, scope: !314, inlinedAt: !661)
!672 = !DILocation(line: 94, column: 13, scope: !314, inlinedAt: !661)
!673 = !DILocation(line: 96, column: 20, scope: !314, inlinedAt: !661)
!674 = !DILocation(line: 96, column: 35, scope: !314, inlinedAt: !661)
!675 = !DILocation(line: 96, column: 13, scope: !314, inlinedAt: !661)
!676 = !DILocation(line: 98, column: 20, scope: !314, inlinedAt: !661)
!677 = !DILocation(line: 98, column: 35, scope: !314, inlinedAt: !661)
!678 = !DILocation(line: 98, column: 13, scope: !314, inlinedAt: !661)
!679 = !DILocation(line: 0, scope: !314, inlinedAt: !661)
!680 = !DILocation(line: 101, column: 1, scope: !281, inlinedAt: !661)
!681 = !DILocation(line: 407, column: 13, scope: !610)
!682 = !DILocation(line: 408, column: 9, scope: !610)
!683 = !DILocation(line: 409, column: 16, scope: !610)
!684 = !DILocation(line: 409, column: 9, scope: !610)
!685 = !DILocation(line: 409, column: 20, scope: !610)
!686 = !DILocation(line: 410, column: 16, scope: !610)
!687 = !DILocation(line: 410, column: 9, scope: !610)
!688 = !DILocation(line: 410, column: 20, scope: !610)
!689 = !DILocation(line: 404, column: 28, scope: !606)
!690 = distinct !{!690, !608, !691}
!691 = !DILocation(line: 411, column: 5, scope: !607)
!692 = !DILocation(line: 0, scope: !610)
!693 = !DILocation(line: 412, column: 5, scope: !2)
!694 = !DILocation(line: 413, column: 5, scope: !2)
!695 = !DILocation(line: 413, column: 14, scope: !2)
!696 = !DILocation(line: 415, column: 5, scope: !2)
!697 = !DILocation(line: 416, column: 13, scope: !2)
!698 = !DILocation(line: 417, column: 5, scope: !2)
!699 = !DILocation(line: 428, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !2, file: !3, line: 428, column: 9)
!701 = !DILocation(line: 227, column: 12, scope: !2)
!702 = !DILocation(line: 428, column: 9, scope: !2)
!703 = !DILocation(line: 429, column: 9, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !3, line: 428, column: 18)
!705 = !DILocation(line: 429, column: 19, scope: !704)
!706 = !DILocation(line: 434, column: 5, scope: !2)
!707 = !DILocation(line: 438, column: 9, scope: !2)
!708 = !DILocation(line: 430, column: 21, scope: !704)
!709 = !DILocation(line: 430, column: 13, scope: !704)
!710 = distinct !{!710, !703, !711}
!711 = !DILocation(line: 430, column: 34, scope: !704)
!712 = !DILocation(line: 431, column: 9, scope: !704)
!713 = !DILocation(line: 442, column: 1, scope: !2)
!714 = distinct !DISubprogram(name: "redisFormatCommand", scope: !3, file: !3, line: 456, type: !715, isLocal: false, isDefinition: true, scopeLine: 456, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!6, !7, !10, null}
!717 = !{!718, !719, !720, !721}
!718 = !DILocalVariable(name: "target", arg: 1, scope: !714, file: !3, line: 456, type: !7)
!719 = !DILocalVariable(name: "format", arg: 2, scope: !714, file: !3, line: 456, type: !10)
!720 = !DILocalVariable(name: "ap", scope: !714, file: !3, line: 457, type: !154)
!721 = !DILocalVariable(name: "len", scope: !714, file: !3, line: 458, type: !6)
!722 = !DILocation(line: 456, column: 31, scope: !714)
!723 = !DILocation(line: 456, column: 51, scope: !714)
!724 = !DILocation(line: 457, column: 5, scope: !714)
!725 = !DILocation(line: 457, column: 13, scope: !714)
!726 = !DILocation(line: 459, column: 5, scope: !714)
!727 = !DILocation(line: 460, column: 11, scope: !714)
!728 = !DILocation(line: 458, column: 9, scope: !714)
!729 = !DILocation(line: 461, column: 5, scope: !714)
!730 = !DILocation(line: 465, column: 13, scope: !731)
!731 = distinct !DILexicalBlock(scope: !714, file: !3, line: 465, column: 9)
!732 = !DILocation(line: 465, column: 9, scope: !714)
!733 = !DILocation(line: 469, column: 1, scope: !714)
!734 = !DILocation(line: 468, column: 5, scope: !714)
!735 = distinct !DISubprogram(name: "redisFormatSdsCommandArgv", scope: !3, file: !3, line: 477, type: !736, isLocal: false, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !742)
!736 = !DISubroutineType(types: !737)
!737 = !{!6, !738, !6, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!742 = !{!743, !744, !745, !746, !747, !748, !750, !751}
!743 = !DILocalVariable(name: "target", arg: 1, scope: !735, file: !3, line: 477, type: !738)
!744 = !DILocalVariable(name: "argc", arg: 2, scope: !735, file: !3, line: 477, type: !6)
!745 = !DILocalVariable(name: "argv", arg: 3, scope: !735, file: !3, line: 477, type: !739)
!746 = !DILocalVariable(name: "argvlen", arg: 4, scope: !735, file: !3, line: 478, type: !740)
!747 = !DILocalVariable(name: "cmd", scope: !735, file: !3, line: 480, type: !131)
!748 = !DILocalVariable(name: "totlen", scope: !735, file: !3, line: 481, type: !749)
!749 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!750 = !DILocalVariable(name: "j", scope: !735, file: !3, line: 482, type: !6)
!751 = !DILocalVariable(name: "len", scope: !735, file: !3, line: 483, type: !102)
!752 = !DILocation(line: 477, column: 36, scope: !735)
!753 = !DILocation(line: 477, column: 48, scope: !735)
!754 = !DILocation(line: 477, column: 67, scope: !735)
!755 = !DILocation(line: 478, column: 45, scope: !735)
!756 = !DILocation(line: 486, column: 16, scope: !757)
!757 = distinct !DILexicalBlock(scope: !735, file: !3, line: 486, column: 9)
!758 = !DILocation(line: 486, column: 9, scope: !735)
!759 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !760)
!760 = distinct !DILocation(line: 490, column: 16, scope: !735)
!761 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !760)
!762 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !760)
!763 = !DILocation(line: 490, column: 28, scope: !735)
!764 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !760)
!765 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !760)
!766 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !760)
!767 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !760)
!768 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !760)
!769 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !760)
!770 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !760)
!771 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !760)
!772 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !760)
!773 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !760)
!774 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !760)
!775 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !760)
!776 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !760)
!777 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !760)
!778 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !760)
!779 = !DILocation(line: 0, scope: !346, inlinedAt: !760)
!780 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !760)
!781 = !DILocation(line: 490, column: 33, scope: !735)
!782 = !DILocation(line: 490, column: 14, scope: !735)
!783 = !DILocation(line: 481, column: 24, scope: !735)
!784 = !DILocation(line: 482, column: 9, scope: !735)
!785 = !DILocation(line: 491, column: 19, scope: !786)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 491, column: 5)
!787 = distinct !DILexicalBlock(scope: !735, file: !3, line: 491, column: 5)
!788 = !DILocation(line: 491, column: 5, scope: !787)
!789 = !DILocation(line: 492, column: 15, scope: !790)
!790 = distinct !DILexicalBlock(scope: !786, file: !3, line: 491, column: 32)
!791 = !DILocation(line: 492, column: 25, scope: !790)
!792 = !DILocation(line: 492, column: 45, scope: !790)
!793 = !DILocation(line: 492, column: 38, scope: !790)
!794 = !DILocation(line: 483, column: 12, scope: !735)
!795 = !DILocation(line: 206, column: 30, scope: !294, inlinedAt: !796)
!796 = distinct !DILocation(line: 493, column: 19, scope: !790)
!797 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !798)
!798 = distinct !DILocation(line: 207, column: 14, scope: !294, inlinedAt: !796)
!799 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !798)
!800 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !798)
!801 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !798)
!802 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !798)
!803 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !798)
!804 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !798)
!805 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !798)
!806 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !798)
!807 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !798)
!808 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !798)
!809 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !798)
!810 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !798)
!811 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !798)
!812 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !798)
!813 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !798)
!814 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !798)
!815 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !798)
!816 = !DILocation(line: 0, scope: !346, inlinedAt: !798)
!817 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !798)
!818 = !DILocation(line: 207, column: 30, scope: !294, inlinedAt: !796)
!819 = !DILocation(line: 207, column: 12, scope: !294, inlinedAt: !796)
!820 = !DILocation(line: 207, column: 5, scope: !294, inlinedAt: !796)
!821 = !DILocation(line: 207, column: 32, scope: !294, inlinedAt: !796)
!822 = !DILocation(line: 207, column: 36, scope: !294, inlinedAt: !796)
!823 = !DILocation(line: 493, column: 16, scope: !790)
!824 = !DILocation(line: 491, column: 28, scope: !786)
!825 = distinct !{!825, !788, !826}
!826 = !DILocation(line: 494, column: 5, scope: !787)
!827 = !DILocation(line: 0, scope: !790)
!828 = !DILocation(line: 497, column: 11, scope: !735)
!829 = !DILocation(line: 480, column: 9, scope: !735)
!830 = !DILocation(line: 498, column: 13, scope: !831)
!831 = distinct !DILexicalBlock(scope: !735, file: !3, line: 498, column: 9)
!832 = !DILocation(line: 498, column: 9, scope: !735)
!833 = !DILocation(line: 502, column: 11, scope: !735)
!834 = !DILocation(line: 503, column: 13, scope: !835)
!835 = distinct !DILexicalBlock(scope: !735, file: !3, line: 503, column: 9)
!836 = !DILocation(line: 503, column: 9, scope: !735)
!837 = !DILocation(line: 507, column: 11, scope: !735)
!838 = !DILocation(line: 508, column: 5, scope: !839)
!839 = distinct !DILexicalBlock(scope: !735, file: !3, line: 508, column: 5)
!840 = !DILocation(line: 509, column: 15, scope: !841)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 508, column: 30)
!842 = distinct !DILexicalBlock(scope: !839, file: !3, line: 508, column: 5)
!843 = !DILocation(line: 509, column: 25, scope: !841)
!844 = !DILocation(line: 511, column: 30, scope: !841)
!845 = !DILocation(line: 509, column: 45, scope: !841)
!846 = !DILocation(line: 509, column: 38, scope: !841)
!847 = !DILocation(line: 510, column: 15, scope: !841)
!848 = !DILocation(line: 511, column: 15, scope: !841)
!849 = !DILocation(line: 512, column: 15, scope: !841)
!850 = !DILocation(line: 508, column: 26, scope: !842)
!851 = !DILocation(line: 508, column: 17, scope: !842)
!852 = distinct !{!852, !838, !853}
!853 = !DILocation(line: 513, column: 5, scope: !839)
!854 = !DILocation(line: 0, scope: !841)
!855 = !DILocation(line: 86, column: 39, scope: !281, inlinedAt: !856)
!856 = distinct !DILocation(line: 515, column: 5, scope: !735)
!857 = !DILocation(line: 87, column: 27, scope: !281, inlinedAt: !856)
!858 = !DILocation(line: 87, column: 19, scope: !281, inlinedAt: !856)
!859 = !DILocation(line: 88, column: 5, scope: !281, inlinedAt: !856)
!860 = !DILocation(line: 90, column: 20, scope: !314, inlinedAt: !856)
!861 = !DILocation(line: 90, column: 13, scope: !314, inlinedAt: !856)
!862 = !DILocation(line: 92, column: 20, scope: !314, inlinedAt: !856)
!863 = !DILocation(line: 92, column: 34, scope: !314, inlinedAt: !856)
!864 = !DILocation(line: 92, column: 13, scope: !314, inlinedAt: !856)
!865 = !DILocation(line: 94, column: 20, scope: !314, inlinedAt: !856)
!866 = !DILocation(line: 94, column: 35, scope: !314, inlinedAt: !856)
!867 = !DILocation(line: 94, column: 13, scope: !314, inlinedAt: !856)
!868 = !DILocation(line: 96, column: 20, scope: !314, inlinedAt: !856)
!869 = !DILocation(line: 96, column: 35, scope: !314, inlinedAt: !856)
!870 = !DILocation(line: 96, column: 13, scope: !314, inlinedAt: !856)
!871 = !DILocation(line: 98, column: 20, scope: !314, inlinedAt: !856)
!872 = !DILocation(line: 98, column: 35, scope: !314, inlinedAt: !856)
!873 = !DILocation(line: 98, column: 13, scope: !314, inlinedAt: !856)
!874 = !DILocation(line: 0, scope: !314, inlinedAt: !856)
!875 = !DILocation(line: 101, column: 1, scope: !281, inlinedAt: !856)
!876 = !DILocation(line: 515, column: 5, scope: !735)
!877 = !DILocation(line: 517, column: 13, scope: !735)
!878 = !DILocation(line: 518, column: 12, scope: !735)
!879 = !DILocation(line: 518, column: 5, scope: !735)
!880 = !DILocation(line: 0, scope: !735)
!881 = !DILocation(line: 519, column: 1, scope: !735)
!882 = distinct !DISubprogram(name: "redisFreeSdsCommand", scope: !3, file: !3, line: 521, type: !883, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !131}
!885 = !{!886}
!886 = !DILocalVariable(name: "cmd", arg: 1, scope: !882, file: !3, line: 521, type: !131)
!887 = !DILocation(line: 521, column: 30, scope: !882)
!888 = !DILocation(line: 522, column: 5, scope: !882)
!889 = !DILocation(line: 523, column: 1, scope: !882)
!890 = distinct !DISubprogram(name: "redisFormatCommandArgv", scope: !3, file: !3, line: 530, type: !891, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{!6, !7, !6, !739, !740}
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902}
!894 = !DILocalVariable(name: "target", arg: 1, scope: !890, file: !3, line: 530, type: !7)
!895 = !DILocalVariable(name: "argc", arg: 2, scope: !890, file: !3, line: 530, type: !6)
!896 = !DILocalVariable(name: "argv", arg: 3, scope: !890, file: !3, line: 530, type: !739)
!897 = !DILocalVariable(name: "argvlen", arg: 4, scope: !890, file: !3, line: 530, type: !740)
!898 = !DILocalVariable(name: "cmd", scope: !890, file: !3, line: 531, type: !8)
!899 = !DILocalVariable(name: "pos", scope: !890, file: !3, line: 532, type: !6)
!900 = !DILocalVariable(name: "len", scope: !890, file: !3, line: 533, type: !102)
!901 = !DILocalVariable(name: "totlen", scope: !890, file: !3, line: 534, type: !6)
!902 = !DILocalVariable(name: "j", scope: !890, file: !3, line: 534, type: !6)
!903 = !DILocation(line: 530, column: 35, scope: !890)
!904 = !DILocation(line: 530, column: 47, scope: !890)
!905 = !DILocation(line: 530, column: 66, scope: !890)
!906 = !DILocation(line: 530, column: 86, scope: !890)
!907 = !DILocation(line: 531, column: 11, scope: !890)
!908 = !DILocation(line: 537, column: 16, scope: !909)
!909 = distinct !DILexicalBlock(scope: !890, file: !3, line: 537, column: 9)
!910 = !DILocation(line: 537, column: 9, scope: !890)
!911 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !912)
!912 = distinct !DILocation(line: 541, column: 16, scope: !890)
!913 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !912)
!914 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !912)
!915 = !DILocation(line: 541, column: 28, scope: !890)
!916 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !912)
!917 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !912)
!918 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !912)
!919 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !912)
!920 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !912)
!921 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !912)
!922 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !912)
!923 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !912)
!924 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !912)
!925 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !912)
!926 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !912)
!927 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !912)
!928 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !912)
!929 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !912)
!930 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !912)
!931 = !DILocation(line: 0, scope: !346, inlinedAt: !912)
!932 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !912)
!933 = !DILocation(line: 541, column: 33, scope: !890)
!934 = !DILocation(line: 534, column: 9, scope: !890)
!935 = !DILocation(line: 534, column: 17, scope: !890)
!936 = !DILocation(line: 542, column: 19, scope: !937)
!937 = distinct !DILexicalBlock(scope: !938, file: !3, line: 542, column: 5)
!938 = distinct !DILexicalBlock(scope: !890, file: !3, line: 542, column: 5)
!939 = !DILocation(line: 542, column: 5, scope: !938)
!940 = !DILocation(line: 543, column: 15, scope: !941)
!941 = distinct !DILexicalBlock(scope: !937, file: !3, line: 542, column: 32)
!942 = !DILocation(line: 543, column: 25, scope: !941)
!943 = !DILocation(line: 543, column: 45, scope: !941)
!944 = !DILocation(line: 543, column: 38, scope: !941)
!945 = !DILocation(line: 533, column: 12, scope: !890)
!946 = !DILocation(line: 206, column: 30, scope: !294, inlinedAt: !947)
!947 = distinct !DILocation(line: 544, column: 19, scope: !941)
!948 = !DILocation(line: 193, column: 38, scope: !301, inlinedAt: !949)
!949 = distinct !DILocation(line: 207, column: 14, scope: !294, inlinedAt: !947)
!950 = !DILocation(line: 194, column: 12, scope: !301, inlinedAt: !949)
!951 = !DILocation(line: 196, column: 11, scope: !334, inlinedAt: !949)
!952 = !DILocation(line: 196, column: 9, scope: !310, inlinedAt: !949)
!953 = !DILocation(line: 197, column: 11, scope: !336, inlinedAt: !949)
!954 = !DILocation(line: 197, column: 9, scope: !310, inlinedAt: !949)
!955 = !DILocation(line: 197, column: 32, scope: !336, inlinedAt: !949)
!956 = !DILocation(line: 197, column: 18, scope: !336, inlinedAt: !949)
!957 = !DILocation(line: 198, column: 11, scope: !341, inlinedAt: !949)
!958 = !DILocation(line: 198, column: 9, scope: !310, inlinedAt: !949)
!959 = !DILocation(line: 198, column: 33, scope: !341, inlinedAt: !949)
!960 = !DILocation(line: 198, column: 19, scope: !341, inlinedAt: !949)
!961 = !DILocation(line: 199, column: 11, scope: !346, inlinedAt: !949)
!962 = !DILocation(line: 199, column: 9, scope: !310, inlinedAt: !949)
!963 = !DILocation(line: 199, column: 34, scope: !346, inlinedAt: !949)
!964 = !DILocation(line: 199, column: 20, scope: !346, inlinedAt: !949)
!965 = !DILocation(line: 200, column: 7, scope: !310, inlinedAt: !949)
!966 = !DILocation(line: 201, column: 12, scope: !310, inlinedAt: !949)
!967 = !DILocation(line: 0, scope: !346, inlinedAt: !949)
!968 = !DILocation(line: 203, column: 1, scope: !301, inlinedAt: !949)
!969 = !DILocation(line: 207, column: 5, scope: !294, inlinedAt: !947)
!970 = !DILocation(line: 544, column: 16, scope: !941)
!971 = !DILocation(line: 542, column: 28, scope: !937)
!972 = distinct !{!972, !939, !973}
!973 = !DILocation(line: 545, column: 5, scope: !938)
!974 = !DILocation(line: 0, scope: !941)
!975 = !DILocation(line: 548, column: 24, scope: !890)
!976 = !DILocation(line: 548, column: 18, scope: !890)
!977 = !DILocation(line: 548, column: 11, scope: !890)
!978 = !DILocation(line: 549, column: 13, scope: !979)
!979 = distinct !DILexicalBlock(scope: !890, file: !3, line: 549, column: 9)
!980 = !DILocation(line: 549, column: 9, scope: !890)
!981 = !DILocation(line: 552, column: 11, scope: !890)
!982 = !DILocation(line: 532, column: 9, scope: !890)
!983 = !DILocation(line: 553, column: 5, scope: !984)
!984 = distinct !DILexicalBlock(scope: !890, file: !3, line: 553, column: 5)
!985 = !DILocation(line: 554, column: 15, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 553, column: 32)
!987 = distinct !DILexicalBlock(scope: !984, file: !3, line: 553, column: 5)
!988 = !DILocation(line: 554, column: 25, scope: !986)
!989 = !DILocation(line: 556, column: 24, scope: !986)
!990 = !DILocation(line: 554, column: 45, scope: !986)
!991 = !DILocation(line: 554, column: 38, scope: !986)
!992 = !DILocation(line: 555, column: 27, scope: !986)
!993 = !DILocation(line: 555, column: 16, scope: !986)
!994 = !DILocation(line: 555, column: 13, scope: !986)
!995 = !DILocation(line: 556, column: 19, scope: !986)
!996 = !DILocation(line: 556, column: 9, scope: !986)
!997 = !DILocation(line: 557, column: 13, scope: !986)
!998 = !DILocation(line: 558, column: 16, scope: !986)
!999 = !DILocation(line: 558, column: 9, scope: !986)
!1000 = !DILocation(line: 558, column: 20, scope: !986)
!1001 = !DILocation(line: 559, column: 16, scope: !986)
!1002 = !DILocation(line: 559, column: 9, scope: !986)
!1003 = !DILocation(line: 559, column: 20, scope: !986)
!1004 = !DILocation(line: 553, column: 28, scope: !987)
!1005 = !DILocation(line: 553, column: 19, scope: !987)
!1006 = distinct !{!1006, !983, !1007}
!1007 = !DILocation(line: 560, column: 5, scope: !984)
!1008 = !DILocation(line: 0, scope: !986)
!1009 = !DILocation(line: 561, column: 5, scope: !890)
!1010 = !DILocation(line: 562, column: 5, scope: !890)
!1011 = !DILocation(line: 562, column: 14, scope: !890)
!1012 = !DILocation(line: 564, column: 13, scope: !890)
!1013 = !DILocation(line: 565, column: 5, scope: !890)
!1014 = !DILocation(line: 0, scope: !890)
!1015 = !DILocation(line: 566, column: 1, scope: !890)
!1016 = distinct !DISubprogram(name: "redisFreeCommand", scope: !3, file: !3, line: 568, type: !1017, isLocal: false, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !1019)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !8}
!1019 = !{!1020}
!1020 = !DILocalVariable(name: "cmd", arg: 1, scope: !1016, file: !3, line: 568, type: !8)
!1021 = !DILocation(line: 568, column: 29, scope: !1016)
!1022 = !DILocation(line: 569, column: 5, scope: !1016)
!1023 = !DILocation(line: 570, column: 1, scope: !1016)
!1024 = distinct !DISubprogram(name: "__redisSetError", scope: !3, file: !3, line: 572, type: !1025, isLocal: false, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !1080)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !1027, !6, !10}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisContext", file: !24, line: 161, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisContext", file: !24, line: 140, size: 1664, elements: !1030)
!1030 = !{!1031, !1032, !1036, !1037, !1038, !1039, !1059, !1060, !1070, !1076}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !1029, file: !24, line: 141, baseType: !6, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !1029, file: !24, line: 142, baseType: !1033, size: 1024, offset: 32)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1029, file: !24, line: 143, baseType: !6, size: 32, offset: 1056)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1029, file: !24, line: 144, baseType: !6, size: 32, offset: 1088)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "obuf", scope: !1029, file: !24, line: 145, baseType: !8, size: 64, offset: 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !1029, file: !24, line: 146, baseType: !1040, size: 64, offset: 1216)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReader", file: !83, line: 95, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReader", file: !83, line: 80, size: 4480, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1054, !1055, !1056, !1058}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !1042, file: !83, line: 81, baseType: !6, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !1042, file: !83, line: 82, baseType: !1033, size: 1024, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1042, file: !83, line: 84, baseType: !8, size: 64, offset: 1088)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1042, file: !83, line: 85, baseType: !102, size: 64, offset: 1152)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1042, file: !83, line: 86, baseType: !102, size: 64, offset: 1216)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "maxbuf", scope: !1042, file: !83, line: 87, baseType: !102, size: 64, offset: 1280)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rstack", scope: !1042, file: !83, line: 89, baseType: !1051, size: 2880, offset: 1344)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2880, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 9)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ridx", scope: !1042, file: !83, line: 90, baseType: !6, size: 32, offset: 4224)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !1042, file: !83, line: 91, baseType: !19, size: 64, offset: 4288)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1042, file: !83, line: 93, baseType: !1057, size: 64, offset: 4352)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !1042, file: !83, line: 94, baseType: !19, size: 64, offset: 4416)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !1029, file: !24, line: 148, baseType: !23, size: 32, offset: 1280)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1029, file: !24, line: 149, baseType: !1061, size: 64, offset: 1344)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1063, line: 44, size: 128, elements: !1064)
!1063 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!1064 = !{!1065, !1068}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1062, file: !1063, line: 45, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1063, line: 34, baseType: !1067)
!1067 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1062, file: !1063, line: 46, baseType: !1069, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !1063, line: 39, baseType: !1067)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !1029, file: !24, line: 155, baseType: !1071, size: 192, offset: 1408)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1029, file: !24, line: 151, size: 192, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1071, file: !24, line: 152, baseType: !8, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "source_addr", scope: !1071, file: !24, line: 153, baseType: !8, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1071, file: !24, line: 154, baseType: !6, size: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "unix_sock", scope: !1029, file: !24, line: 159, baseType: !1077, size: 64, offset: 1600)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1029, file: !24, line: 157, size: 64, elements: !1078)
!1078 = !{!1079}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1077, file: !24, line: 158, baseType: !8, size: 64)
!1080 = !{!1081, !1082, !1083, !1084}
!1081 = !DILocalVariable(name: "c", arg: 1, scope: !1024, file: !3, line: 572, type: !1027)
!1082 = !DILocalVariable(name: "type", arg: 2, scope: !1024, file: !3, line: 572, type: !6)
!1083 = !DILocalVariable(name: "str", arg: 3, scope: !1024, file: !3, line: 572, type: !10)
!1084 = !DILocalVariable(name: "len", scope: !1024, file: !3, line: 573, type: !102)
!1085 = !DILocation(line: 572, column: 36, scope: !1024)
!1086 = !DILocation(line: 572, column: 43, scope: !1024)
!1087 = !DILocation(line: 572, column: 61, scope: !1024)
!1088 = !DILocation(line: 575, column: 8, scope: !1024)
!1089 = !DILocation(line: 575, column: 12, scope: !1024)
!1090 = !{!1091, !194, i64 0}
!1091 = !{!"redisContext", !194, i64 0, !195, i64 4, !194, i64 132, !194, i64 136, !199, i64 144, !199, i64 152, !195, i64 160, !199, i64 168, !1092, i64 176, !1093, i64 200}
!1092 = !{!"", !199, i64 0, !199, i64 8, !194, i64 16}
!1093 = !{!"", !199, i64 0}
!1094 = !DILocation(line: 576, column: 13, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 576, column: 9)
!1096 = !DILocation(line: 576, column: 9, scope: !1024)
!1097 = !DILocation(line: 577, column: 15, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 576, column: 22)
!1099 = !DILocation(line: 573, column: 12, scope: !1024)
!1100 = !DILocation(line: 578, column: 19, scope: !1098)
!1101 = !DILocation(line: 578, column: 15, scope: !1098)
!1102 = !DILocation(line: 579, column: 16, scope: !1098)
!1103 = !DILocation(line: 579, column: 9, scope: !1098)
!1104 = !DILocation(line: 580, column: 9, scope: !1098)
!1105 = !DILocation(line: 580, column: 24, scope: !1098)
!1106 = !DILocation(line: 581, column: 5, scope: !1098)
!1107 = !DILocation(line: 583, column: 9, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 581, column: 12)
!1109 = !DILocation(line: 584, column: 9, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 584, column: 9)
!1111 = !DILocation(line: 586, column: 1, scope: !1024)
!1112 = distinct !DISubprogram(name: "redisReaderCreate", scope: !3, file: !3, line: 588, type: !1113, isLocal: false, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !1115)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!1040}
!1115 = !{}
!1116 = !DILocation(line: 589, column: 12, scope: !1112)
!1117 = !DILocation(line: 589, column: 5, scope: !1112)
!1118 = distinct !DISubprogram(name: "redisFree", scope: !3, file: !3, line: 616, type: !1119, isLocal: false, isDefinition: true, scopeLine: 616, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !1121)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !1027}
!1121 = !{!1122}
!1122 = !DILocalVariable(name: "c", arg: 1, scope: !1118, file: !3, line: 616, type: !1027)
!1123 = !DILocation(line: 616, column: 30, scope: !1118)
!1124 = !DILocation(line: 617, column: 11, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 617, column: 9)
!1126 = !DILocation(line: 617, column: 9, scope: !1118)
!1127 = !DILocation(line: 619, column: 12, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 619, column: 9)
!1129 = !{!1091, !194, i64 132}
!1130 = !DILocation(line: 619, column: 15, scope: !1128)
!1131 = !DILocation(line: 619, column: 9, scope: !1118)
!1132 = !DILocation(line: 620, column: 9, scope: !1128)
!1133 = !DILocation(line: 621, column: 12, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 621, column: 9)
