; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/icmp6.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/icmp6.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!41 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!42 = !DIEnumerator(name: "ERR_VAL", value: -6)
!43 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!44 = !DIEnumerator(name: "ERR_USE", value: -8)
!45 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!46 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!47 = !DIEnumerator(name: "ERR_CONN", value: -11)
!48 = !DIEnumerator(name: "ERR_IF", value: -12)
!49 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!50 = !DIEnumerator(name: "ERR_RST", value: -14)
!51 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!52 = !DIEnumerator(name: "ERR_ARG", value: -16)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_type", file: !54, line: 47, baseType: !14, size: 32, elements: !55)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/icmp6.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!56 = !DIEnumerator(name: "ICMP6_TYPE_DUR", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "ICMP6_TYPE_PTB", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "ICMP6_TYPE_TE", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "ICMP6_TYPE_PP", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "ICMP6_TYPE_PE1", value: 100, isUnsigned: true)
!61 = !DIEnumerator(name: "ICMP6_TYPE_PE2", value: 101, isUnsigned: true)
!62 = !DIEnumerator(name: "ICMP6_TYPE_RSV_ERR", value: 127, isUnsigned: true)
!63 = !DIEnumerator(name: "ICMP6_TYPE_EREQ", value: 128, isUnsigned: true)
!64 = !DIEnumerator(name: "ICMP6_TYPE_EREP", value: 129, isUnsigned: true)
!65 = !DIEnumerator(name: "ICMP6_TYPE_MLQ", value: 130, isUnsigned: true)
!66 = !DIEnumerator(name: "ICMP6_TYPE_MLR", value: 131, isUnsigned: true)
!67 = !DIEnumerator(name: "ICMP6_TYPE_MLD", value: 132, isUnsigned: true)
!68 = !DIEnumerator(name: "ICMP6_TYPE_RS", value: 133, isUnsigned: true)
!69 = !DIEnumerator(name: "ICMP6_TYPE_RA", value: 134, isUnsigned: true)
!70 = !DIEnumerator(name: "ICMP6_TYPE_NS", value: 135, isUnsigned: true)
!71 = !DIEnumerator(name: "ICMP6_TYPE_NA", value: 136, isUnsigned: true)
!72 = !DIEnumerator(name: "ICMP6_TYPE_RD", value: 137, isUnsigned: true)
!73 = !DIEnumerator(name: "ICMP6_TYPE_MRA", value: 151, isUnsigned: true)
!74 = !DIEnumerator(name: "ICMP6_TYPE_MRS", value: 152, isUnsigned: true)
!75 = !DIEnumerator(name: "ICMP6_TYPE_MRT", value: 153, isUnsigned: true)
!76 = !DIEnumerator(name: "ICMP6_TYPE_PE3", value: 200, isUnsigned: true)
!77 = !DIEnumerator(name: "ICMP6_TYPE_PE4", value: 201, isUnsigned: true)
!78 = !DIEnumerator(name: "ICMP6_TYPE_RSV_INF", value: 255, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_dur_code", file: !54, line: 98, baseType: !14, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87}
!81 = !DIEnumerator(name: "ICMP6_DUR_NO_ROUTE", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "ICMP6_DUR_PROHIBITED", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "ICMP6_DUR_SCOPE", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "ICMP6_DUR_ADDRESS", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "ICMP6_DUR_PORT", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "ICMP6_DUR_POLICY", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "ICMP6_DUR_REJECT_ROUTE", value: 6, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_te_code", file: !54, line: 116, baseType: !14, size: 32, elements: !89)
!89 = !{!90, !91}
!90 = !DIEnumerator(name: "ICMP6_TE_HL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "ICMP6_TE_FRAG", value: 1, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_pp_code", file: !54, line: 124, baseType: !14, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "ICMP6_PP_FIELD", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "ICMP6_PP_HEADER", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "ICMP6_PP_OPTION", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !98, line: 68, baseType: !14, size: 32, elements: !99)
!98 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!104 = !{!105, !126, !123, !127, !135, !137, !155}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6_hdr", file: !54, line: 138, size: 64, elements: !107)
!107 = !{!108, !116, !117, !122}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !54, line: 139, baseType: !109, size: 8)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !110, line: 125, baseType: !111)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !112, line: 24, baseType: !113)
!112 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !114, line: 43, baseType: !115)
!114 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !106, file: !54, line: 140, baseType: !109, size: 8, offset: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !106, file: !54, line: 141, baseType: !118, size: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !110, line: 127, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !112, line: 36, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !114, line: 57, baseType: !121)
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !54, line: 142, baseType: !123, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !110, line: 129, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !112, line: 48, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !114, line: 79, baseType: !14)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6_echo_hdr", file: !54, line: 154, size: 64, elements: !129)
!129 = !{!130, !131, !132, !133, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !54, line: 155, baseType: !109, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !128, file: !54, line: 156, baseType: !109, size: 8, offset: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !128, file: !54, line: 157, baseType: !118, size: 16, offset: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !54, line: 158, baseType: !118, size: 16, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !128, file: !54, line: 159, baseType: !118, size: 16, offset: 48)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !140, line: 80, size: 320, elements: !141)
!140 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !{!142, !143, !144, !145, !146, !154}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_v_tc_fl", scope: !139, file: !140, line: 82, baseType: !123, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_plen", scope: !139, file: !140, line: 84, baseType: !118, size: 16, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !139, file: !140, line: 86, baseType: !109, size: 8, offset: 48)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_hoplim", scope: !139, file: !140, line: 88, baseType: !109, size: 8, offset: 56)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !139, file: !140, line: 90, baseType: !147, size: 128, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !140, line: 60, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !140, line: 53, size: 128, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !148, file: !140, line: 54, baseType: !151, size: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 4)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !139, file: !140, line: 91, baseType: !147, size: 128, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!156 = !{!0, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 8)
!162 = !{!163, !164}
!163 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!164 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !166, line: 32, baseType: !167)
!166 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 192, elements: !175)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !170)
!170 = !{!171, !172, !173, !174}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !169, file: !10, line: 196, baseType: !14, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !169, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !169, file: !10, line: 196, baseType: !126, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !169, file: !10, line: 196, baseType: !126, size: 64, offset: 128)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !{i32 2, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{i32 1, !"wchar_size", i32 4}
!180 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!181 = distinct !DISubprogram(name: "icmp6_input", scope: !10, file: !10, line: 83, type: !182, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !291)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !195}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !19, line: 186, size: 192, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !19, line: 188, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !185, file: !19, line: 191, baseType: !126, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !185, file: !19, line: 200, baseType: !118, size: 16, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !185, file: !19, line: 203, baseType: !118, size: 16, offset: 144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !185, file: !19, line: 208, baseType: !109, size: 8, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !19, line: 211, baseType: !109, size: 8, offset: 168)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !185, file: !19, line: 218, baseType: !109, size: 8, offset: 176)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !185, file: !19, line: 221, baseType: !109, size: 8, offset: 184)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !13, line: 260, size: 2240, elements: !197)
!197 = !{!198, !199, !221, !222, !223, !227, !229, !231, !232, !242, !249, !254, !261, !266, !267, !268, !270, !271, !272, !273, !277, !278, !279, !283, !284, !285, !286}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !13, line: 263, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !196, file: !13, line: 268, baseType: !200, size: 192, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !201, line: 76, baseType: !202)
!201 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !201, line: 69, size: 192, elements: !203)
!203 = !{!204, !220}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !202, file: !201, line: 73, baseType: !205, size: 160)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !201, line: 70, size: 160, elements: !206)
!206 = !{!207, !214}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !205, file: !201, line: 71, baseType: !208, size: 160)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !209, line: 67, baseType: !210)
!209 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !209, line: 59, size: 160, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !210, file: !209, line: 60, baseType: !151, size: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !210, file: !209, line: 62, baseType: !109, size: 8, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !205, file: !201, line: 72, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !216, line: 57, baseType: !217)
!216 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !216, line: 51, size: 32, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !217, file: !216, line: 52, baseType: !123, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !201, line: 75, baseType: !109, size: 8, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !196, file: !13, line: 269, baseType: !200, size: 192, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !196, file: !13, line: 270, baseType: !200, size: 192, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !196, file: !13, line: 274, baseType: !224, size: 576, offset: 640)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 576, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 3)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !196, file: !13, line: 277, baseType: !228, size: 24, offset: 1216)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 24, elements: !225)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !196, file: !13, line: 282, baseType: !230, size: 96, offset: 1248)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 96, elements: !225)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !196, file: !13, line: 283, baseType: !230, size: 96, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !196, file: !13, line: 288, baseType: !233, size: 64, offset: 1472)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !13, line: 178, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !184, !195}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !33, line: 96, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !110, line: 126, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !112, line: 20, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !114, line: 41, baseType: !241)
!241 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !196, file: !13, line: 294, baseType: !243, size: 64, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !13, line: 189, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!237, !195, !184, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !196, file: !13, line: 299, baseType: !250, size: 64, offset: 1600)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !13, line: 212, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!237, !195, !184}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !196, file: !13, line: 305, baseType: !255, size: 64, offset: 1664)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !13, line: 202, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!237, !195, !184, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !196, file: !13, line: 310, baseType: !262, size: 64, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !13, line: 214, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !195}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !196, file: !13, line: 319, baseType: !262, size: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !13, line: 323, baseType: !126, size: 64, offset: 1856)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !196, file: !13, line: 325, baseType: !269, size: 64, offset: 1920)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !175)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !196, file: !13, line: 332, baseType: !118, size: 16, offset: 1984)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !196, file: !13, line: 335, baseType: !118, size: 16, offset: 2000)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !196, file: !13, line: 338, baseType: !118, size: 16, offset: 2016)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !196, file: !13, line: 341, baseType: !274, size: 48, offset: 2032)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 48, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 6)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !196, file: !13, line: 343, baseType: !109, size: 8, offset: 2080)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !13, line: 345, baseType: !109, size: 8, offset: 2088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !13, line: 347, baseType: !280, size: 16, offset: 2096)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 2)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !196, file: !13, line: 350, baseType: !109, size: 8, offset: 2112)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !196, file: !13, line: 353, baseType: !109, size: 8, offset: 2120)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !196, file: !13, line: 357, baseType: !109, size: 8, offset: 2128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !196, file: !13, line: 377, baseType: !287, size: 64, offset: 2176)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !13, line: 222, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!237, !195, !259, !12}
!291 = !{!292, !293, !294, !295, !296}
!292 = !DILocalVariable(name: "p", arg: 1, scope: !181, file: !10, line: 83, type: !184)
!293 = !DILocalVariable(name: "inp", arg: 2, scope: !181, file: !10, line: 83, type: !195)
!294 = !DILocalVariable(name: "icmp6hdr", scope: !181, file: !10, line: 85, type: !105)
!295 = !DILocalVariable(name: "r", scope: !181, file: !10, line: 86, type: !184)
!296 = !DILocalVariable(name: "reply_src", scope: !181, file: !10, line: 87, type: !259)
!297 = !DILocation(line: 83, column: 26, scope: !181)
!298 = !DILocation(line: 83, column: 43, scope: !181)
!299 = !DILocation(line: 89, column: 3, scope: !181)
!300 = !{!301, !303, i64 212}
!301 = !{!"stats_", !302, i64 0, !302, i64 24, !302, i64 48, !302, i64 72, !302, i64 96, !302, i64 120, !302, i64 144, !306, i64 168, !302, i64 186, !302, i64 210, !302, i64 234, !308, i64 258, !302, i64 286}
!302 = !{!"stats_proto", !303, i64 0, !303, i64 2, !303, i64 4, !303, i64 6, !303, i64 8, !303, i64 10, !303, i64 12, !303, i64 14, !303, i64 16, !303, i64 18, !303, i64 20, !303, i64 22}
!303 = !{!"short", !304, i64 0}
!304 = !{!"omnipotent char", !305, i64 0}
!305 = !{!"Simple C/C++ TBAA"}
!306 = !{!"stats_sys", !307, i64 0, !307, i64 6, !307, i64 12}
!307 = !{!"stats_syselem", !303, i64 0, !303, i64 2, !303, i64 4}
!308 = !{!"stats_igmp", !303, i64 0, !303, i64 2, !303, i64 4, !303, i64 6, !303, i64 8, !303, i64 10, !303, i64 12, !303, i64 14, !303, i64 16, !303, i64 18, !303, i64 20, !303, i64 22, !303, i64 24, !303, i64 26}
!309 = !DILocation(line: 92, column: 10, scope: !310)
!310 = distinct !DILexicalBlock(scope: !181, file: !10, line: 92, column: 7)
!311 = !{!312, !303, i64 18}
!312 = !{!"pbuf", !313, i64 0, !313, i64 8, !303, i64 16, !303, i64 18, !304, i64 20, !304, i64 21, !304, i64 22, !304, i64 23}
!313 = !{!"any pointer", !304, i64 0}
!314 = !DILocation(line: 92, column: 14, scope: !310)
!315 = !DILocation(line: 92, column: 7, scope: !181)
!316 = !DILocation(line: 94, column: 5, scope: !317)
!317 = distinct !DILexicalBlock(scope: !310, file: !10, line: 92, column: 42)
!318 = !DILocation(line: 95, column: 5, scope: !317)
!319 = !{!301, !303, i64 220}
!320 = !DILocation(line: 96, column: 5, scope: !317)
!321 = !{!301, !303, i64 216}
!322 = !DILocation(line: 97, column: 5, scope: !317)
!323 = !DILocation(line: 100, column: 37, scope: !181)
!324 = !{!312, !313, i64 8}
!325 = !DILocation(line: 85, column: 21, scope: !181)
!326 = !DILocation(line: 103, column: 3, scope: !327)
!327 = distinct !DILexicalBlock(scope: !181, file: !10, line: 103, column: 3)
!328 = !{!329, !303, i64 248}
!329 = !{!"netif", !313, i64 0, !330, i64 8, !330, i64 32, !330, i64 56, !304, i64 80, !304, i64 152, !304, i64 156, !304, i64 168, !313, i64 184, !313, i64 192, !313, i64 200, !313, i64 208, !313, i64 216, !313, i64 224, !313, i64 232, !304, i64 240, !303, i64 248, !303, i64 250, !303, i64 252, !304, i64 254, !304, i64 260, !304, i64 261, !304, i64 262, !304, i64 264, !304, i64 265, !304, i64 266, !313, i64 272}
!330 = !{!"ip_addr", !304, i64 0, !304, i64 20}
!331 = !DILocation(line: 103, column: 3, scope: !181)
!332 = !DILocation(line: 104, column: 50, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !10, line: 104, column: 9)
!334 = distinct !DILexicalBlock(scope: !327, file: !10, line: 103, column: 63)
!335 = !{!312, !303, i64 16}
!336 = !DILocation(line: 104, column: 9, scope: !333)
!337 = !DILocation(line: 105, column: 52, scope: !333)
!338 = !DILocation(line: 104, column: 9, scope: !334)
!339 = !DILocation(line: 107, column: 7, scope: !340)
