; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/iconv.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/iconv.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.iconv_conversion_handlers_t = type { i8* (%struct._reent*, i8*, i8*)*, i64 (%struct._reent*, i8*)*, i64 (%struct._reent*, i8*, i8**, i64*, i8**, i64*, i32)*, void (i8*, %struct._mbstate_t*, i32)*, i32 (i8*, %struct._mbstate_t*, i32)*, i32 (i8*, i32)*, i32 (i8*, i32)* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/iconv.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !8, !9, !5, !13, !247, !255, !259, !33}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !10, line: 35, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/iconv.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "_iconv_t", file: !12, line: 180, baseType: !8)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_conversion_t", file: !15, line: 209, baseType: !16)
!15 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/conv.h", directory: "/root/.unikraft/apps/redis/build")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 199, size: 128, elements: !17)
!17 = !{!18, !276}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !16, file: !15, line: 202, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_conversion_handlers_t", file: !15, line: 191, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 48, size: 448, elements: !23)
!23 = !{!24, !243, !251, !260, !267, !271, !275}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !22, file: !15, line: 66, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!8, !28, !5, !5}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !30, line: 569, size: 14912, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !34, !111, !112, !113, !114, !118, !119, !122, !123, !127, !139, !140, !141, !143, !144, !145, !207, !228, !229, !234, !241}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !29, file: !30, line: 571, baseType: !33, size: 32)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !29, file: !30, line: 576, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !30, line: 287, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !30, line: 181, size: 1408, elements: !38)
!38 = !{!39, !42, !43, !44, !46, !47, !52, !53, !54, !61, !65, !70, !74, !75, !76, !77, !81, !85, !86, !87, !89, !90, !94, !110}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !37, file: !30, line: 182, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !37, file: !30, line: 183, baseType: !33, size: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !37, file: !30, line: 184, baseType: !33, size: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !30, line: 185, baseType: !45, size: 16, offset: 128)
!45 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !37, file: !30, line: 186, baseType: !45, size: 16, offset: 144)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !37, file: !30, line: 187, baseType: !48, size: 128, offset: 192)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !30, line: 117, size: 128, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !48, file: !30, line: 118, baseType: !40, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !48, file: !30, line: 119, baseType: !33, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !37, file: !30, line: 188, baseType: !33, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !37, file: !30, line: 195, baseType: !8, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !37, file: !30, line: 197, baseType: !55, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !28, !8, !60, !33}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !12, line: 145, baseType: !59)
!59 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !37, file: !30, line: 199, baseType: !62, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!58, !28, !8, !5, !33}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !37, file: !30, line: 202, baseType: !66, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !28, !8, !69, !33}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !12, line: 114, baseType: !59)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !37, file: !30, line: 203, baseType: !71, size: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!33, !28, !8}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !37, file: !30, line: 206, baseType: !48, size: 128, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !37, file: !30, line: 207, baseType: !40, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !37, file: !30, line: 208, baseType: !33, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !37, file: !30, line: 211, baseType: !78, size: 24, offset: 928)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 24, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 3)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !37, file: !30, line: 212, baseType: !82, size: 8, offset: 952)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !37, file: !30, line: 215, baseType: !48, size: 128, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !37, file: !30, line: 218, baseType: !33, size: 32, offset: 1088)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !30, line: 219, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !12, line: 44, baseType: !59)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !37, file: !30, line: 222, baseType: !28, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !30, line: 226, baseType: !91, size: 32, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !12, line: 175, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !93, line: 12, baseType: !33)
!93 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !37, file: !30, line: 228, baseType: !95, size: 64, offset: 1312)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !12, line: 171, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 163, size: 64, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !96, file: !12, line: 165, baseType: !33, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !96, file: !12, line: 170, baseType: !100, size: 32, offset: 32)
!100 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !12, line: 166, size: 32, elements: !101)
!101 = !{!102, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !100, file: !12, line: 168, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !104, line: 124, baseType: !105)
!104 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!105 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !100, file: !12, line: 169, baseType: !107, size: 32)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 4)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !30, line: 229, baseType: !33, size: 32, offset: 1376)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !29, file: !30, line: 576, baseType: !35, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !29, file: !30, line: 576, baseType: !35, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !29, file: !30, line: 578, baseType: !33, size: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !29, file: !30, line: 579, baseType: !115, size: 200, offset: 288)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 200, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 25)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !29, file: !30, line: 582, baseType: !33, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !29, file: !30, line: 583, baseType: !120, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !30, line: 40, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !29, file: !30, line: 585, baseType: !33, size: 32, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !29, file: !30, line: 587, baseType: !124, size: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !28}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !29, file: !30, line: 590, baseType: !128, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !30, line: 47, size: 256, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !129, file: !30, line: 49, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !129, file: !30, line: 50, baseType: !33, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !129, file: !30, line: 50, baseType: !33, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !129, file: !30, line: 50, baseType: !33, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !129, file: !30, line: 50, baseType: !33, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !129, file: !30, line: 51, baseType: !137, size: 32, offset: 192)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 32, elements: !83)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !30, line: 25, baseType: !105)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !29, file: !30, line: 591, baseType: !33, size: 32, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !29, file: !30, line: 592, baseType: !128, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !29, file: !30, line: 593, baseType: !142, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !29, file: !30, line: 596, baseType: !33, size: 32, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !29, file: !30, line: 597, baseType: !60, size: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !29, file: !30, line: 632, baseType: !146, size: 2880, offset: 1152)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !30, line: 599, size: 2880, elements: !147)
!147 = !{!148, !198}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !146, file: !30, line: 622, baseType: !149, size: 1728)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !146, file: !30, line: 601, size: 1728, elements: !150)
!150 = !{!151, !152, !153, !157, !169, !170, !172, !180, !181, !182, !183, !187, !191, !192, !193, !194, !195, !196, !197}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !149, file: !30, line: 603, baseType: !105, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !149, file: !30, line: 604, baseType: !60, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !149, file: !30, line: 605, baseType: !154, size: 208, offset: 128)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 208, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 26)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !149, file: !30, line: 606, baseType: !158, size: 288, offset: 352)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !30, line: 55, size: 288, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !158, file: !30, line: 57, baseType: !33, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !158, file: !30, line: 58, baseType: !33, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !158, file: !30, line: 59, baseType: !33, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !158, file: !30, line: 60, baseType: !33, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !158, file: !30, line: 61, baseType: !33, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !158, file: !30, line: 62, baseType: !33, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !158, file: !30, line: 63, baseType: !33, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !158, file: !30, line: 64, baseType: !33, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !158, file: !30, line: 65, baseType: !33, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !149, file: !30, line: 607, baseType: !33, size: 32, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !149, file: !30, line: 608, baseType: !171, size: 64, offset: 704)
!171 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !149, file: !30, line: 609, baseType: !173, size: 112, offset: 768)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !30, line: 319, size: 112, elements: !174)
!174 = !{!175, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !173, file: !30, line: 320, baseType: !176, size: 48)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 48, elements: !79)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !173, file: !30, line: 321, baseType: !176, size: 48, offset: 48)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !173, file: !30, line: 322, baseType: !177, size: 16, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !149, file: !30, line: 610, baseType: !95, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !149, file: !30, line: 611, baseType: !95, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !149, file: !30, line: 612, baseType: !95, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !149, file: !30, line: 613, baseType: !184, size: 64, offset: 1088)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !149, file: !30, line: 614, baseType: !188, size: 192, offset: 1152)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 24)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !149, file: !30, line: 615, baseType: !33, size: 32, offset: 1344)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !149, file: !30, line: 616, baseType: !95, size: 64, offset: 1376)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !149, file: !30, line: 617, baseType: !95, size: 64, offset: 1440)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !149, file: !30, line: 618, baseType: !95, size: 64, offset: 1504)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !149, file: !30, line: 619, baseType: !95, size: 64, offset: 1568)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !149, file: !30, line: 620, baseType: !95, size: 64, offset: 1632)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !149, file: !30, line: 621, baseType: !33, size: 32, offset: 1696)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !146, file: !30, line: 631, baseType: !199, size: 2880)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !146, file: !30, line: 626, size: 2880, elements: !200)
!200 = !{!201, !205}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !199, file: !30, line: 629, baseType: !202, size: 1920)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1920, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 30)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !199, file: !30, line: 630, baseType: !206, size: 960, offset: 1920)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 960, elements: !203)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !29, file: !30, line: 636, baseType: !208, size: 64, offset: 4032)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !30, line: 93, size: 6336, elements: !210)
!210 = !{!211, !212, !213, !220}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !209, file: !30, line: 94, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !209, file: !30, line: 95, baseType: !33, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !209, file: !30, line: 97, baseType: !214, size: 2048, offset: 128)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 2048, elements: !218)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null}
!218 = !{!219}
!219 = !DISubrange(count: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !209, file: !30, line: 98, baseType: !221, size: 4160, offset: 2176)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !30, line: 74, size: 4160, elements: !222)
!222 = !{!223, !225, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !221, file: !30, line: 75, baseType: !224, size: 2048)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !218)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !221, file: !30, line: 76, baseType: !224, size: 2048, offset: 2048)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !221, file: !30, line: 78, baseType: !138, size: 32, offset: 4096)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !221, file: !30, line: 81, baseType: !138, size: 32, offset: 4128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !29, file: !30, line: 637, baseType: !209, size: 6336, offset: 4096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !29, file: !30, line: 641, baseType: !230, size: 64, offset: 10432)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !33}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !29, file: !30, line: 646, baseType: !235, size: 192, offset: 10496)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !30, line: 291, size: 192, elements: !236)
!236 = !{!237, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !235, file: !30, line: 293, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !235, file: !30, line: 294, baseType: !33, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !235, file: !30, line: 295, baseType: !35, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !29, file: !30, line: 648, baseType: !242, size: 4224, offset: 10688)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 4224, elements: !79)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !22, file: !15, line: 84, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !28, !8}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !248, line: 40, baseType: !249)
!248 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !12, line: 129, baseType: !250)
!250 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !22, file: !15, line: 117, baseType: !252, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!247, !28, !8, !255, !258, !259, !258, !33}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "get_state", scope: !22, file: !15, line: 138, baseType: !261, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !8, !264, !33}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !266, line: 86, baseType: !95)
!266 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!267 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !22, file: !15, line: 157, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!33, !8, !264, !33}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_cur_max", scope: !22, file: !15, line: 173, baseType: !272, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!33, !8, !33}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "is_stateful", scope: !22, file: !15, line: 188, baseType: !272, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !16, file: !15, line: 208, baseType: !8, size: 64, offset: 64)
!277 = !{i32 2, !"Dwarf Version", i32 4}
!278 = !{i32 2, !"Debug Info Version", i32 3}
!279 = !{i32 1, !"wchar_size", i32 4}
!280 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!281 = distinct !DISubprogram(name: "iconv_open", scope: !1, file: !1, line: 161, type: !282, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{!9, !5, !5}
!284 = !{!285, !286}
!285 = !DILocalVariable(name: "to", arg: 1, scope: !281, file: !1, line: 161, type: !5)
!286 = !DILocalVariable(name: "from", arg: 2, scope: !281, file: !1, line: 161, type: !5)
!287 = !DILocation(line: 161, column: 1, scope: !281)
!288 = !DILocation(line: 165, column: 25, scope: !281)
!289 = !DILocation(line: 165, column: 10, scope: !281)
!290 = !DILocation(line: 165, column: 3, scope: !281)
!291 = distinct !DISubprogram(name: "_iconv_open_r", scope: !1, file: !1, line: 191, type: !292, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{!9, !28, !5, !5}
!294 = !{!295, !296, !297, !298}
!295 = !DILocalVariable(name: "rptr", arg: 1, scope: !291, file: !1, line: 191, type: !28)
!296 = !DILocalVariable(name: "to", arg: 2, scope: !291, file: !1, line: 191, type: !5)
!297 = !DILocalVariable(name: "from", arg: 3, scope: !291, file: !1, line: 191, type: !5)
!298 = !DILocalVariable(name: "ic", scope: !291, file: !1, line: 196, type: !13)
!299 = !DILocation(line: 191, column: 1, scope: !291)
!300 = !DILocation(line: 198, column: 10, scope: !301)
!301 = distinct !DILexicalBlock(scope: !291, file: !1, line: 198, column: 7)
!302 = !DILocation(line: 198, column: 26, scope: !301)
!303 = !DILocation(line: 198, column: 18, scope: !301)
!304 = !DILocation(line: 198, column: 37, scope: !301)
!305 = !{!306, !306, i64 0}
!306 = !{!"omnipotent char", !307, i64 0}
!307 = !{!"Simple C/C++ TBAA"}
!308 = !DILocation(line: 198, column: 41, scope: !301)
!309 = !DILocation(line: 198, column: 49, scope: !301)
!310 = !DILocation(line: 198, column: 52, scope: !301)
!311 = !DILocation(line: 198, column: 58, scope: !301)
!312 = !DILocation(line: 198, column: 7, scope: !291)
!313 = !DILocation(line: 201, column: 28, scope: !314)
!314 = distinct !DILexicalBlock(scope: !291, file: !1, line: 201, column: 7)
!315 = !DILocation(line: 201, column: 69, scope: !314)
!316 = !DILocation(line: 201, column: 7, scope: !291)
!317 = !DILocation(line: 204, column: 30, scope: !318)
!318 = distinct !DILexicalBlock(scope: !291, file: !1, line: 204, column: 7)
!319 = !DILocation(line: 204, column: 73, scope: !318)
!320 = !DILocation(line: 204, column: 7, scope: !291)
!321 = !DILocation(line: 206, column: 7, scope: !322)
!322 = distinct !DILexicalBlock(scope: !318, file: !1, line: 205, column: 5)
!323 = !DILocation(line: 207, column: 7, scope: !322)
!324 = !DILocation(line: 210, column: 30, scope: !291)
!325 = !DILocation(line: 196, column: 23, scope: !291)
!326 = !DILocation(line: 211, column: 10, scope: !327)
!327 = distinct !DILexicalBlock(scope: !291, file: !1, line: 211, column: 7)
!328 = !DILocation(line: 211, column: 7, scope: !291)
!329 = !DILocation(line: 215, column: 7, scope: !330)
!330 = distinct !DILexicalBlock(scope: !291, file: !1, line: 215, column: 7)
!331 = !DILocation(line: 215, column: 25, scope: !330)
!332 = !DILocation(line: 0, scope: !333)
!333 = distinct !DILexicalBlock(scope: !330, file: !1, line: 222, column: 5)
!334 = !DILocation(line: 215, column: 7, scope: !291)
!335 = !DILocation(line: 218, column: 20, scope: !336)
!336 = distinct !DILexicalBlock(scope: !330, file: !1, line: 216, column: 5)
!337 = !{!338, !339, i64 0}
!338 = !{!"", !339, i64 0, !339, i64 8}
!339 = !{!"any pointer", !306, i64 0}
!340 = !DILocation(line: 219, column: 32, scope: !336)
