; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/reent/impure.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/reent/impure.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.anon = type { i32, i8*, [26 x i8], %struct.__tm, i32, i64, %struct._rand48, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, [8 x i8], [24 x i8], i32, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, i32 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._rand48 = type { [3 x i16], [3 x i16], i16 }

@_impure_ptr = dso_local local_unnamed_addr global %struct._reent* bitcast ({ i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, { %struct.anon, [144 x i8] }, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }* @impure_data to %struct._reent*), align 8, !dbg !0
@_global_impure_ptr = dso_local local_unnamed_addr constant %struct._reent* bitcast ({ i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, { %struct.anon, [144 x i8] }, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }* @impure_data to %struct._reent*), align 8, !dbg !6
@impure_data = internal global { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, { %struct.anon, [144 x i8] }, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] } { i32 0, %struct.__sFILE* bitcast (i8* getelementptr (i8, i8* bitcast ({ i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, { %struct.anon, [144 x i8] }, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }* @impure_data to i8*), i64 1336) to %struct.__sFILE*), %struct.__sFILE* bitcast (i8* getelementptr (i8, i8* bitcast ({ i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, { %struct.anon, [144 x i8] }, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }* @impure_data to i8*), i64 1512) to %struct.__sFILE*), %struct.__sFILE* bitcast (i8* getelementptr (i8, i8* bitcast ({ i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, { %struct.anon, [144 x i8] }, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }* @impure_data to i8*), i64 1688) to %struct.__sFILE*), i32 0, [25 x i8] zeroinitializer, i32 0, %struct.__locale_t* null, i32 0, void (%struct._reent*)* null, %struct._Bigint* null, i32 0, %struct._Bigint* null, %struct._Bigint** null, i32 0, i8* null, { %struct.anon, [144 x i8] } { %struct.anon { i32 0, i8* null, [26 x i8] zeroinitializer, %struct.__tm zeroinitializer, i32 0, i64 1, %struct._rand48 { [3 x i16] [i16 13070, i16 -21555, i16 4660], [3 x i16] [i16 -6547, i16 -8468, i16 5], i16 11 }, %struct._mbstate_t zeroinitializer, %struct._mbstate_t zeroinitializer, %struct._mbstate_t zeroinitializer, [8 x i8] zeroinitializer, [24 x i8] zeroinitializer, i32 0, %struct._mbstate_t zeroinitializer, %struct._mbstate_t zeroinitializer, %struct._mbstate_t zeroinitializer, %struct._mbstate_t zeroinitializer, %struct._mbstate_t zeroinitializer, i32 0 }, [144 x i8] undef }, %struct._atexit* null, %struct._atexit zeroinitializer, void (i32)** null, %struct._glue zeroinitializer, [3 x %struct.__sFILE] zeroinitializer }, align 8, !dbg !229

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!231, !232, !233}
!llvm.ident = !{!234}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_impure_ptr", scope: !2, file: !3, line: 27, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/reent/impure.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!0, !6, !229}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "_global_impure_ptr", scope: !2, file: !3, line: 28, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !11, line: 569, size: 14912, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !15, !97, !98, !99, !100, !104, !105, !108, !109, !113, !125, !126, !127, !129, !130, !131, !193, !214, !215, !220, !227}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !10, file: !11, line: 571, baseType: !14, size: 32)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !10, file: !11, line: 576, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !11, line: 287, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !11, line: 181, size: 1408, elements: !19)
!19 = !{!20, !23, !24, !25, !27, !28, !33, !34, !36, !45, !51, !56, !60, !61, !62, !63, !67, !71, !72, !73, !75, !76, !80, !96}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !18, file: !11, line: 182, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !18, file: !11, line: 183, baseType: !14, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !18, file: !11, line: 184, baseType: !14, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !18, file: !11, line: 185, baseType: !26, size: 16, offset: 128)
!26 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !18, file: !11, line: 186, baseType: !26, size: 16, offset: 144)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !18, file: !11, line: 187, baseType: !29, size: 128, offset: 192)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !11, line: 117, size: 128, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !29, file: !11, line: 118, baseType: !21, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !29, file: !11, line: 119, baseType: !14, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !18, file: !11, line: 188, baseType: !14, size: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !18, file: !11, line: 195, baseType: !35, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !18, file: !11, line: 197, baseType: !37, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !9, !35, !43, !14}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !41, line: 145, baseType: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !18, file: !11, line: 199, baseType: !46, size: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!40, !9, !35, !49, !14}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !18, file: !11, line: 202, baseType: !52, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !9, !35, !55, !14}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !41, line: 114, baseType: !42)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !18, file: !11, line: 203, baseType: !57, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!14, !9, !35}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !18, file: !11, line: 206, baseType: !29, size: 128, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !18, file: !11, line: 207, baseType: !21, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !18, file: !11, line: 208, baseType: !14, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !18, file: !11, line: 211, baseType: !64, size: 24, offset: 928)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 24, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !18, file: !11, line: 212, baseType: !68, size: 8, offset: 952)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !18, file: !11, line: 215, baseType: !29, size: 128, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !18, file: !11, line: 218, baseType: !14, size: 32, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !18, file: !11, line: 219, baseType: !74, size: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !41, line: 44, baseType: !42)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !18, file: !11, line: 222, baseType: !9, size: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !18, file: !11, line: 226, baseType: !77, size: 32, offset: 1280)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !41, line: 175, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !79, line: 12, baseType: !14)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !18, file: !11, line: 228, baseType: !81, size: 64, offset: 1312)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !41, line: 171, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 163, size: 64, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !82, file: !41, line: 165, baseType: !14, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !82, file: !41, line: 170, baseType: !86, size: 32, offset: 32)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !82, file: !41, line: 166, size: 32, elements: !87)
!87 = !{!88, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !86, file: !41, line: 168, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !90, line: 124, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !86, file: !41, line: 169, baseType: !93, size: 32)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !18, file: !11, line: 229, baseType: !14, size: 32, offset: 1376)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !10, file: !11, line: 576, baseType: !16, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !10, file: !11, line: 576, baseType: !16, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !10, file: !11, line: 578, baseType: !14, size: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !10, file: !11, line: 579, baseType: !101, size: 200, offset: 288)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 200, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 25)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !10, file: !11, line: 582, baseType: !14, size: 32, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !10, file: !11, line: 583, baseType: !106, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !11, line: 40, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !10, file: !11, line: 585, baseType: !14, size: 32, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !10, file: !11, line: 587, baseType: !110, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !9}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !10, file: !11, line: 590, baseType: !114, size: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !11, line: 47, size: 256, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !115, file: !11, line: 49, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !115, file: !11, line: 50, baseType: !14, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !115, file: !11, line: 50, baseType: !14, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !115, file: !11, line: 50, baseType: !14, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !115, file: !11, line: 50, baseType: !14, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !115, file: !11, line: 51, baseType: !123, size: 32, offset: 192)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !69)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !11, line: 25, baseType: !91)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !10, file: !11, line: 591, baseType: !14, size: 32, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !10, file: !11, line: 592, baseType: !114, size: 64, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !10, file: !11, line: 593, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !10, file: !11, line: 596, baseType: !14, size: 32, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !10, file: !11, line: 597, baseType: !43, size: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !10, file: !11, line: 632, baseType: !132, size: 2880, offset: 1152)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !10, file: !11, line: 599, size: 2880, elements: !133)
!133 = !{!134, !184}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !132, file: !11, line: 622, baseType: !135, size: 1728)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !11, line: 601, size: 1728, elements: !136)
!136 = !{!137, !138, !139, !143, !155, !156, !158, !166, !167, !168, !169, !173, !177, !178, !179, !180, !181, !182, !183}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !135, file: !11, line: 603, baseType: !91, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !135, file: !11, line: 604, baseType: !43, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !135, file: !11, line: 605, baseType: !140, size: 208, offset: 128)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 208, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 26)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !135, file: !11, line: 606, baseType: !144, size: 288, offset: 352)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !11, line: 55, size: 288, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !144, file: !11, line: 57, baseType: !14, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !144, file: !11, line: 58, baseType: !14, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !144, file: !11, line: 59, baseType: !14, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !144, file: !11, line: 60, baseType: !14, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !144, file: !11, line: 61, baseType: !14, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !144, file: !11, line: 62, baseType: !14, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !144, file: !11, line: 63, baseType: !14, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !144, file: !11, line: 64, baseType: !14, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !144, file: !11, line: 65, baseType: !14, size: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !135, file: !11, line: 607, baseType: !14, size: 32, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !135, file: !11, line: 608, baseType: !157, size: 64, offset: 704)
!157 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !135, file: !11, line: 609, baseType: !159, size: 112, offset: 768)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !11, line: 319, size: 112, elements: !160)
!160 = !{!161, !164, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !159, file: !11, line: 320, baseType: !162, size: 48)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 48, elements: !65)
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !159, file: !11, line: 321, baseType: !162, size: 48, offset: 48)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !159, file: !11, line: 322, baseType: !163, size: 16, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !135, file: !11, line: 610, baseType: !81, size: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !135, file: !11, line: 611, baseType: !81, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !135, file: !11, line: 612, baseType: !81, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !135, file: !11, line: 613, baseType: !170, size: 64, offset: 1088)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !135, file: !11, line: 614, baseType: !174, size: 192, offset: 1152)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 192, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 24)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !135, file: !11, line: 615, baseType: !14, size: 32, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !135, file: !11, line: 616, baseType: !81, size: 64, offset: 1376)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !135, file: !11, line: 617, baseType: !81, size: 64, offset: 1440)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !135, file: !11, line: 618, baseType: !81, size: 64, offset: 1504)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !135, file: !11, line: 619, baseType: !81, size: 64, offset: 1568)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !135, file: !11, line: 620, baseType: !81, size: 64, offset: 1632)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !135, file: !11, line: 621, baseType: !14, size: 32, offset: 1696)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !132, file: !11, line: 631, baseType: !185, size: 2880)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !11, line: 626, size: 2880, elements: !186)
!186 = !{!187, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !185, file: !11, line: 629, baseType: !188, size: 1920)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1920, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 30)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !185, file: !11, line: 630, baseType: !192, size: 960, offset: 1920)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 960, elements: !189)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !10, file: !11, line: 636, baseType: !194, size: 64, offset: 4032)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !11, line: 93, size: 6336, elements: !196)
!196 = !{!197, !198, !199, !206}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !195, file: !11, line: 94, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !195, file: !11, line: 95, baseType: !14, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !195, file: !11, line: 97, baseType: !200, size: 2048, offset: 128)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 2048, elements: !204)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null}
!204 = !{!205}
!205 = !DISubrange(count: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !195, file: !11, line: 98, baseType: !207, size: 4160, offset: 2176)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !11, line: 74, size: 4160, elements: !208)
!208 = !{!209, !211, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !207, file: !11, line: 75, baseType: !210, size: 2048)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !204)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !207, file: !11, line: 76, baseType: !210, size: 2048, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !207, file: !11, line: 78, baseType: !124, size: 32, offset: 4096)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !207, file: !11, line: 81, baseType: !124, size: 32, offset: 4128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !10, file: !11, line: 637, baseType: !195, size: 6336, offset: 4096)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !10, file: !11, line: 641, baseType: !216, size: 64, offset: 10432)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !14}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !10, file: !11, line: 646, baseType: !221, size: 192, offset: 10496)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !11, line: 291, size: 192, elements: !222)
!222 = !{!223, !225, !226}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !221, file: !11, line: 293, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !221, file: !11, line: 294, baseType: !14, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !221, file: !11, line: 295, baseType: !16, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !10, file: !11, line: 648, baseType: !228, size: 4224, offset: 10688)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 4224, elements: !65)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "impure_data", scope: !2, file: !3, line: 23, type: !10, isLocal: true, isDefinition: true)
!231 = !{i32 2, !"Dwarf Version", i32 4}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
