; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4_frag.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4_frag.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ip_reassdata = type { %struct.ip_reassdata*, %struct.pbuf*, %struct.ip_hdr, i16, i8, i8 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.ip4_addr_packed, %struct.ip4_addr_packed }
%struct.ip4_addr_packed = type { i32 }
%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "reassdatagrams", scope: !2, file: !3, line: 114, type: !91, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !101)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4_frag.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !13, !18}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !6, line: 68, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp_te_type", file: !14, line: 71, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/icmp.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "ICMP_TE_TTL", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "ICMP_TE_FRAG", value: 1, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 52, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/memp.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!21 = !DIEnumerator(name: "MEMP_UDP_PCB", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "MEMP_TCP_PCB", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!31 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!32 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!33 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!34 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!35 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!36 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!37 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!38 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!39 = !{!40, !41, !46, !55, !73, !91}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_hdr", file: !43, line: 73, size: 160, elements: !44)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip4.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !{!45, !53, !54, !59, !60, !61, !62, !63, !64, !72}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_v_hl", scope: !42, file: !43, line: 75, baseType: !46, size: 8)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !47, line: 125, baseType: !48)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !51, line: 43, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_tos", scope: !42, file: !43, line: 77, baseType: !46, size: 8, offset: 8)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_len", scope: !42, file: !43, line: 79, baseType: !55, size: 16, offset: 16)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !47, line: 127, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !49, line: 36, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !51, line: 57, baseType: !58)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_id", scope: !42, file: !43, line: 81, baseType: !55, size: 16, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 83, baseType: !55, size: 16, offset: 48)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ttl", scope: !42, file: !43, line: 89, baseType: !46, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_proto", scope: !42, file: !43, line: 91, baseType: !46, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chksum", scope: !42, file: !43, line: 93, baseType: !55, size: 16, offset: 80)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !42, file: !43, line: 95, baseType: !65, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_p_t", file: !43, line: 61, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr_packed", file: !43, line: 53, size: 32, elements: !67)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !66, file: !43, line: 54, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !47, line: 129, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 48, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !51, line: 79, baseType: !7)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !42, file: !43, line: 96, baseType: !65, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_reass_helper", file: !3, line: 98, size: 96, elements: !75)
!75 = !{!76, !89, !90}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_pbuf", scope: !74, file: !3, line: 99, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !79, line: 186, size: 192, elements: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !79, line: 188, baseType: !77, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !78, file: !79, line: 191, baseType: !40, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !78, file: !79, line: 200, baseType: !55, size: 16, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !78, file: !79, line: 203, baseType: !55, size: 16, offset: 144)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !78, file: !79, line: 208, baseType: !46, size: 8, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !79, line: 211, baseType: !46, size: 8, offset: 168)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !78, file: !79, line: 218, baseType: !46, size: 8, offset: 176)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !78, file: !79, line: 221, baseType: !46, size: 8, offset: 184)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !74, file: !3, line: 100, baseType: !55, size: 16, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !74, file: !3, line: 101, baseType: !55, size: 16, offset: 80)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_reassdata", file: !93, line: 61, size: 320, elements: !94)
!93 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_frag.h", directory: "/root/.unikraft/apps/redis/build")
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !93, line: 62, baseType: !91, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !92, file: !93, line: 63, baseType: !77, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "iphdr", scope: !92, file: !93, line: 64, baseType: !42, size: 160, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "datagram_len", scope: !92, file: !93, line: 65, baseType: !55, size: 16, offset: 288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !92, file: !93, line: 66, baseType: !46, size: 8, offset: 304)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !92, file: !93, line: 67, baseType: !46, size: 8, offset: 312)
!101 = !{!0, !102, !104, !131}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "ip_reass_pbufcount", scope: !2, file: !3, line: 115, type: !55, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "__str", scope: !106, file: !107, line: 198, type: !128, isLocal: true, isDefinition: true)
!106 = distinct !DISubprogram(name: "uk_pr_crit", scope: !107, file: !107, line: 194, type: !108, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !113)
!107 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, null}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !{!114, !115}
!114 = !DILocalVariable(name: "fmt", arg: 1, scope: !106, file: !107, line: 194, type: !110)
!115 = !DILocalVariable(name: "argp", scope: !106, file: !107, line: 196, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !117, line: 32, baseType: !118)
!117 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 192, elements: !126)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !120, file: !3, line: 196, baseType: !7, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !120, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !120, file: !3, line: 196, baseType: !40, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !120, file: !3, line: 196, baseType: !40, size: 64, offset: 128)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 8)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "__str", scope: !106, file: !107, line: 198, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 88, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 11)
!136 = !{i32 2, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{i32 1, !"wchar_size", i32 4}
!139 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!140 = distinct !DISubprogram(name: "ip_reass_tmr", scope: !3, file: !3, line: 128, type: !141, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{null}
!143 = !{!144, !145, !146}
!144 = !DILocalVariable(name: "r", scope: !140, file: !3, line: 130, type: !91)
!145 = !DILocalVariable(name: "prev", scope: !140, file: !3, line: 130, type: !91)
!146 = !DILocalVariable(name: "tmp", scope: !147, file: !3, line: 143, type: !91)
!147 = distinct !DILexicalBlock(scope: !148, file: !3, line: 141, column: 12)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 136, column: 9)
!149 = distinct !DILexicalBlock(scope: !140, file: !3, line: 133, column: 21)
!150 = !DILocation(line: 130, column: 28, scope: !140)
!151 = !DILocation(line: 132, column: 7, scope: !140)
!152 = !{!153, !153, i64 0}
!153 = !{!"any pointer", !154, i64 0}
!154 = !{!"omnipotent char", !155, i64 0}
!155 = !{!"Simple C/C++ TBAA"}
!156 = !DILocation(line: 130, column: 24, scope: !140)
!157 = !DILocation(line: 133, column: 12, scope: !140)
!158 = !DILocation(line: 133, column: 3, scope: !140)
!159 = !DILocation(line: 136, column: 12, scope: !148)
!160 = !{!161, !154, i64 39}
!161 = !{!"ip_reassdata", !153, i64 0, !153, i64 8, !162, i64 16, !163, i64 36, !154, i64 38, !154, i64 39}
!162 = !{!"ip_hdr", !154, i64 0, !154, i64 1, !163, i64 2, !163, i64 4, !163, i64 6, !154, i64 8, !154, i64 9, !163, i64 10, !164, i64 12, !164, i64 16}
!163 = !{!"short", !154, i64 0}
!164 = !{!"ip4_addr_packed", !165, i64 0}
!165 = !{!"int", !154, i64 0}
!166 = !DILocation(line: 136, column: 18, scope: !148)
!167 = !DILocation(line: 136, column: 9, scope: !149)
!168 = !DILocation(line: 137, column: 15, scope: !169)
!169 = distinct !DILexicalBlock(scope: !148, file: !3, line: 136, column: 23)
!170 = !DILocation(line: 140, column: 14, scope: !169)
!171 = !{!161, !153, i64 0}
!172 = !DILocation(line: 141, column: 5, scope: !169)
!173 = !DILocation(line: 143, column: 28, scope: !147)
!174 = !DILocation(line: 147, column: 14, scope: !147)
!175 = !DILocation(line: 149, column: 7, scope: !147)
!176 = !DILocation(line: 0, scope: !140)
!177 = !DILocation(line: 0, scope: !147)
!178 = distinct !{!178, !158, !179}
!179 = !DILocation(line: 151, column: 3, scope: !140)
!180 = !DILocation(line: 152, column: 1, scope: !140)
!181 = distinct !DISubprogram(name: "ip_reass_free_complete_datagram", scope: !3, file: !3, line: 164, type: !182, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !185)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !91, !91}
!184 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!185 = !{!186, !187, !188, !189, !190, !191, !192}
!186 = !DILocalVariable(name: "ipr", arg: 1, scope: !181, file: !3, line: 164, type: !91)
!187 = !DILocalVariable(name: "prev", arg: 2, scope: !181, file: !3, line: 164, type: !91)
!188 = !DILocalVariable(name: "pbufs_freed", scope: !181, file: !3, line: 166, type: !55)
