; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4_addr.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4_addr.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.netif = type { %struct.netif*, %struct.ip_addr, %struct.ip_addr, %struct.ip_addr, [3 x %struct.ip_addr], [3 x i8], [3 x i32], [3 x i32], i8 (%struct.pbuf*, %struct.netif*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip4_addr*)*, i8 (%struct.netif*, %struct.pbuf*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip6_addr*)*, void (%struct.netif*)*, void (%struct.netif*)*, i8*, [1 x i8*], i16, i16, i16, [6 x i8], i8, i8, [2 x i8], i8, i8, i8, i8 (%struct.netif*, %struct.ip6_addr*, i32)* }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip4_addr = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@ip_addr_any = dso_local local_unnamed_addr constant %struct.ip_addr zeroinitializer, align 4, !dbg !0
@ip_addr_broadcast = dso_local local_unnamed_addr constant %struct.ip_addr { %union.anon { %struct.ip6_addr { [4 x i32] [i32 -1, i32 0, i32 0, i32 0], i8 0 } }, i8 0 }, align 4, !dbg !44
@.str = private unnamed_addr constant [10 x i8] c"unhandled\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ip_addr_any", scope: !2, file: !3, line: 47, type: !46, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !43)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv4/ip4_addr.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !6, line: 156, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !12, line: 68, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!18 = !{!19, !25, !32, !33, !34, !35, !38, !39, !40, !42}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !20, line: 129, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 48, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 79, baseType: !7)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !28, line: 57, baseType: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !28, line: 51, size: 32, elements: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !29, file: !28, line: 52, baseType: !19, size: 32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !20, line: 125, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 43, baseType: !32)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 60, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 105, baseType: !39)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!43 = !{!0, !44, !66, !77, !104}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "ip_addr_broadcast", scope: !2, file: !3, line: 48, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !48, line: 76, baseType: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !48, line: 69, size: 192, elements: !50)
!50 = !{!51, !65}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !49, file: !48, line: 73, baseType: !52, size: 160)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !48, line: 70, size: 160, elements: !53)
!53 = !{!54, !64}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !52, file: !48, line: 71, baseType: !55, size: 160)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !56, line: 67, baseType: !57)
!56 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !56, line: 59, size: 160, elements: !58)
!58 = !{!59, !63}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !57, file: !56, line: 60, baseType: !60, size: 128)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 4)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !57, file: !56, line: 62, baseType: !35, size: 8, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !52, file: !48, line: 72, baseType: !27, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !48, line: 75, baseType: !35, size: 8, offset: 160)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "str", scope: !68, file: !3, line: 269, type: !74, isLocal: true, isDefinition: true)
!68 = distinct !DISubprogram(name: "ip4addr_ntoa", scope: !3, file: !3, line: 267, type: !69, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !72)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !25}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!72 = !{!73}
!73 = !DILocalVariable(name: "addr", arg: 1, scope: !68, file: !3, line: 267, type: !25)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 16)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "__str", scope: !79, file: !80, line: 198, type: !101, isLocal: true, isDefinition: true)
!79 = distinct !DISubprogram(name: "uk_pr_crit", scope: !80, file: !80, line: 194, type: !81, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !85)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, null}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!85 = !{!86, !87}
!86 = !DILocalVariable(name: "fmt", arg: 1, scope: !79, file: !80, line: 194, type: !83)
!87 = !DILocalVariable(name: "argp", scope: !79, file: !80, line: 196, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !89, line: 32, baseType: !90)
!89 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 192, elements: !99)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !93)
!93 = !{!94, !95, !96, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !92, file: !3, line: 196, baseType: !7, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !92, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !92, file: !3, line: 196, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !92, file: !3, line: 196, baseType: !97, size: 64, offset: 128)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 8)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "__str", scope: !79, file: !80, line: 198, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 88, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 11)
!109 = !{i32 2, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{i32 1, !"wchar_size", i32 4}
!112 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!113 = distinct !DISubprogram(name: "ip4_addr_isbroadcast_u32", scope: !3, file: !3, line: 58, type: !114, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !208)
!114 = !DISubroutineType(types: !115)
!115 = !{!35, !19, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !119)
!119 = !{!120, !122, !123, !124, !125, !129, !131, !133, !134, !161, !166, !171, !178, !183, !184, !185, !187, !188, !189, !190, !194, !195, !196, !200, !201, !202, !203}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !6, line: 263, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !118, file: !6, line: 268, baseType: !47, size: 192, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !118, file: !6, line: 269, baseType: !47, size: 192, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !118, file: !6, line: 270, baseType: !47, size: 192, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !118, file: !6, line: 274, baseType: !126, size: 576, offset: 640)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 576, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !118, file: !6, line: 277, baseType: !130, size: 24, offset: 1216)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 24, elements: !127)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !118, file: !6, line: 282, baseType: !132, size: 96, offset: 1248)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !127)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !118, file: !6, line: 283, baseType: !132, size: 96, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !118, file: !6, line: 288, baseType: !135, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !145, !121}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !140, line: 96, baseType: !141)
!140 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !20, line: 126, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !22, line: 20, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !24, line: 41, baseType: !144)
!144 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !147, line: 186, size: 192, elements: !148)
!147 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!148 = !{!149, !150, !151, !156, !157, !158, !159, !160}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !147, line: 188, baseType: !145, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !146, file: !147, line: 191, baseType: !97, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !146, file: !147, line: 200, baseType: !152, size: 16, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !20, line: 127, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 36, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !24, line: 57, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !146, file: !147, line: 203, baseType: !152, size: 16, offset: 144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !146, file: !147, line: 208, baseType: !35, size: 8, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !147, line: 211, baseType: !35, size: 8, offset: 168)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !146, file: !147, line: 218, baseType: !35, size: 8, offset: 176)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !146, file: !147, line: 221, baseType: !35, size: 8, offset: 184)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !118, file: !6, line: 294, baseType: !162, size: 64, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!139, !121, !145, !25}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !118, file: !6, line: 299, baseType: !167, size: 64, offset: 1600)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!139, !121, !145}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !118, file: !6, line: 305, baseType: !172, size: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!139, !121, !145, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !118, file: !6, line: 310, baseType: !179, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !121}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !118, file: !6, line: 319, baseType: !179, size: 64, offset: 1792)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !118, file: !6, line: 323, baseType: !97, size: 64, offset: 1856)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !118, file: !6, line: 325, baseType: !186, size: 64, offset: 1920)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !99)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !118, file: !6, line: 332, baseType: !152, size: 16, offset: 1984)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !118, file: !6, line: 335, baseType: !152, size: 16, offset: 2000)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !118, file: !6, line: 338, baseType: !152, size: 16, offset: 2016)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !118, file: !6, line: 341, baseType: !191, size: 48, offset: 2032)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 48, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 6)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !118, file: !6, line: 343, baseType: !35, size: 8, offset: 2080)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !6, line: 345, baseType: !35, size: 8, offset: 2088)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !6, line: 347, baseType: !197, size: 16, offset: 2096)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 16, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 2)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !118, file: !6, line: 350, baseType: !35, size: 8, offset: 2112)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !118, file: !6, line: 353, baseType: !35, size: 8, offset: 2120)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !118, file: !6, line: 357, baseType: !35, size: 8, offset: 2128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !118, file: !6, line: 377, baseType: !204, size: 64, offset: 2176)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!139, !121, !176, !5}
!208 = !{!209, !210, !211}
!209 = !DILocalVariable(name: "addr", arg: 1, scope: !113, file: !3, line: 58, type: !19)
!210 = !DILocalVariable(name: "netif", arg: 2, scope: !113, file: !3, line: 58, type: !116)
!211 = !DILocalVariable(name: "ipaddr", scope: !113, file: !3, line: 60, type: !27)
!212 = !DILocation(line: 58, column: 32, scope: !113)
!213 = !DILocation(line: 58, column: 58, scope: !113)
!214 = !DILocation(line: 60, column: 14, scope: !113)
!215 = !DILocation(line: 64, column: 29, scope: !216)
!216 = distinct !DILexicalBlock(scope: !113, file: !3, line: 64, column: 7)
!217 = !DILocation(line: 68, column: 22, scope: !218)
!218 = distinct !DILexicalBlock(scope: !216, file: !3, line: 68, column: 14)
!219 = !{!220, !222, i64 261}
!220 = !{!"netif", !221, i64 0, !224, i64 8, !224, i64 32, !224, i64 56, !222, i64 80, !222, i64 152, !222, i64 156, !222, i64 168, !221, i64 184, !221, i64 192, !221, i64 200, !221, i64 208, !221, i64 216, !221, i64 224, !221, i64 232, !222, i64 240, !225, i64 248, !225, i64 250, !225, i64 252, !222, i64 254, !222, i64 260, !222, i64 261, !222, i64 262, !222, i64 264, !222, i64 265, !222, i64 266, !221, i64 272}
!221 = !{!"any pointer", !222, i64 0}
!222 = !{!"omnipotent char", !223, i64 0}
!223 = !{!"Simple C/C++ TBAA"}
!224 = !{!"ip_addr", !222, i64 0, !222, i64 20}
!225 = !{!"short", !222, i64 0}
!226 = !DILocation(line: 68, column: 28, scope: !218)
!227 = !DILocation(line: 68, column: 52, scope: !218)
!228 = !DILocation(line: 68, column: 14, scope: !216)
!229 = !DILocation(line: 73, column: 22, scope: !230)
!230 = distinct !DILexicalBlock(scope: !218, file: !3, line: 73, column: 14)
!231 = !{!222, !222, i64 0}
!232 = !DILocation(line: 73, column: 19, scope: !230)
!233 = !DILocation(line: 73, column: 14, scope: !218)
!234 = !DILocation(line: 76, column: 14, scope: !235)
!235 = distinct !DILexicalBlock(scope: !230, file: !3, line: 76, column: 14)
!236 = !DILocation(line: 78, column: 14, scope: !235)
!237 = !DILocation(line: 78, column: 26, scope: !235)
!238 = !DILocation(line: 78, column: 24, scope: !235)
!239 = !DILocation(line: 78, column: 71, scope: !235)
!240 = !DILocation(line: 76, column: 14, scope: !230)
!241 = !DILocation(line: 83, column: 5, scope: !242)
!242 = distinct !DILexicalBlock(scope: !235, file: !3, line: 82, column: 10)
!243 = !DILocation(line: 0, scope: !242)
!244 = !DILocation(line: 85, column: 1, scope: !113)
!245 = distinct !DISubprogram(name: "ip4_addr_netmask_valid", scope: !3, file: !3, line: 93, type: !246, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !248)
!246 = !DISubroutineType(types: !247)
!247 = !{!35, !19}
!248 = !{!249, !250, !251}
!249 = !DILocalVariable(name: "netmask", arg: 1, scope: !245, file: !3, line: 93, type: !19)
!250 = !DILocalVariable(name: "mask", scope: !245, file: !3, line: 95, type: !19)
!251 = !DILocalVariable(name: "nm_hostorder", scope: !245, file: !3, line: 96, type: !19)
!252 = !DILocation(line: 93, column: 30, scope: !245)
!253 = !DILocation(line: 96, column: 24, scope: !245)
!254 = !DILocation(line: 96, column: 9, scope: !245)
!255 = !DILocation(line: 95, column: 9, scope: !245)
!256 = !DILocation(line: 99, column: 8, scope: !257)
!257 = distinct !DILexicalBlock(scope: !245, file: !3, line: 99, column: 3)
!258 = !DILocation(line: 0, scope: !259)
!259 = distinct !DILexicalBlock(scope: !257, file: !3, line: 99, column: 3)
!260 = !DILocation(line: 100, column: 23, scope: !261)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 100, column: 9)
