; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/ip6.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/ip6.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.netif = type { %struct.netif*, %struct.ip_addr, %struct.ip_addr, %struct.ip_addr, [3 x %struct.ip_addr], [3 x i8], [3 x i32], [3 x i32], i8 (%struct.pbuf*, %struct.netif*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip4_addr*)*, i8 (%struct.netif*, %struct.pbuf*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip6_addr*)*, void (%struct.netif*)*, void (%struct.netif*)*, i8*, [1 x i8*], i16, i16, i16, [6 x i8], i8, i8, [2 x i8], i8, i8, i8, i8 (%struct.netif*, %struct.ip6_addr*, i32)* }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip4_addr = type { i32 }
%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }

!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !58, globals: !150)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/ip6.c", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !18, !39, !45, !51}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !13, line: 156, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 53, baseType: !20, size: 32, elements: !21)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!22 = !DIEnumerator(name: "ERR_OK", value: 0)
!23 = !DIEnumerator(name: "ERR_MEM", value: -1)
!24 = !DIEnumerator(name: "ERR_BUF", value: -2)
!25 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!26 = !DIEnumerator(name: "ERR_RTE", value: -4)
!27 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!28 = !DIEnumerator(name: "ERR_VAL", value: -6)
!29 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!30 = !DIEnumerator(name: "ERR_USE", value: -8)
!31 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!32 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!33 = !DIEnumerator(name: "ERR_CONN", value: -11)
!34 = !DIEnumerator(name: "ERR_IF", value: -12)
!35 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!36 = !DIEnumerator(name: "ERR_RST", value: -14)
!37 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!38 = !DIEnumerator(name: "ERR_ARG", value: -16)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !40, line: 54, baseType: !14, size: 32, elements: !41)
!40 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_pp_code", file: !46, line: 124, baseType: !14, size: 32, elements: !47)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/icmp6.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !{!48, !49, !50}
!48 = !DIEnumerator(name: "ICMP6_PP_FIELD", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "ICMP6_PP_HEADER", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "ICMP6_PP_OPTION", value: 2, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !52, line: 68, baseType: !14, size: 32, elements: !53)
!52 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!58 = !{!59, !60, !67, !70, !81, !97, !103, !115, !120, !125, !126, !131, !138, !145, !147}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !61, line: 125, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !63, line: 24, baseType: !64)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !65, line: 43, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !61, line: 129, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !63, line: 48, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !65, line: 79, baseType: !14)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !73, line: 67, baseType: !74)
!73 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !73, line: 59, size: 160, elements: !75)
!75 = !{!76, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !74, file: !73, line: 60, baseType: !77, size: 128)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 4)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !74, file: !73, line: 62, baseType: !60, size: 8, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !40, line: 76, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !40, line: 69, size: 192, elements: !85)
!85 = !{!86, !96}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !84, file: !40, line: 73, baseType: !87, size: 160)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !84, file: !40, line: 70, size: 160, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !87, file: !40, line: 71, baseType: !72, size: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !87, file: !40, line: 72, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !92, line: 57, baseType: !93)
!92 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !92, line: 51, size: 32, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !93, file: !92, line: 52, baseType: !67, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !40, line: 75, baseType: !60, size: 8, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !99, line: 80, size: 320, elements: !100)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !{!101, !102, !107, !108, !109, !114}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_v_tc_fl", scope: !98, file: !99, line: 82, baseType: !67, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_plen", scope: !98, file: !99, line: 84, baseType: !103, size: 16, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !61, line: 127, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !63, line: 36, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !65, line: 57, baseType: !106)
!106 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !98, file: !99, line: 86, baseType: !60, size: 8, offset: 48)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_hoplim", scope: !98, file: !99, line: 88, baseType: !60, size: 8, offset: 56)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !98, file: !99, line: 90, baseType: !110, size: 128, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !99, line: 60, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !99, line: 53, size: 128, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !111, file: !99, line: 54, baseType: !77, size: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !98, file: !99, line: 91, baseType: !110, size: 128, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hbh_hdr", file: !99, line: 145, size: 16, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !116, file: !99, line: 147, baseType: !60, size: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_hlen", scope: !116, file: !99, line: 149, baseType: !60, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_opt_hdr", file: !99, line: 122, size: 16, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_opt_type", scope: !121, file: !99, line: 124, baseType: !60, size: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_opt_dlen", scope: !121, file: !99, line: 126, baseType: !60, size: 8, offset: 8)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_dest_hdr", file: !99, line: 164, size: 16, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !127, file: !99, line: 166, baseType: !60, size: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_hlen", scope: !127, file: !99, line: 168, baseType: !60, size: 8, offset: 8)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_rout_hdr", file: !99, line: 184, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !132, file: !99, line: 186, baseType: !60, size: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_hlen", scope: !132, file: !99, line: 188, baseType: !60, size: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_routing_type", scope: !132, file: !99, line: 190, baseType: !60, size: 8, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_segments_left", scope: !132, file: !99, line: 192, baseType: !60, size: 8, offset: 24)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_frag_hdr", file: !99, line: 211, size: 64, elements: !140)
!140 = !{!141, !142, !143, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !139, file: !99, line: 213, baseType: !60, size: 8)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !139, file: !99, line: 215, baseType: !60, size: 8, offset: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_fragment_offset", scope: !139, file: !99, line: 217, baseType: !103, size: 16, offset: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_identification", scope: !139, file: !99, line: 219, baseType: !67, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !148, line: 49, baseType: !149)
!148 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!149 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!150 = !{!0, !151}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 48, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 6)
!156 = !{!157, !158}
!157 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!158 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !160, line: 32, baseType: !161)
!160 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !169)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !164)
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !163, file: !10, line: 196, baseType: !14, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !163, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !163, file: !10, line: 196, baseType: !59, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !163, file: !10, line: 196, baseType: !59, size: 64, offset: 128)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 8)
!174 = !{i32 2, !"Dwarf Version", i32 4}
!175 = !{i32 2, !"Debug Info Version", i32 3}
!176 = !{i32 1, !"wchar_size", i32 4}
!177 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!178 = distinct !DISubprogram(name: "ip6_route", scope: !10, file: !10, line: 86, type: !179, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !264)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !70, !70}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !13, line: 260, size: 2240, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !192, !194, !196, !197, !219, !226, !231, !236, !241, !242, !243, !245, !246, !247, !248, !250, !251, !252, !256, !257, !258, !259}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !13, line: 263, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !182, file: !13, line: 268, baseType: !83, size: 192, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !182, file: !13, line: 269, baseType: !83, size: 192, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !182, file: !13, line: 270, baseType: !83, size: 192, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !182, file: !13, line: 274, baseType: !189, size: 576, offset: 640)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 576, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 3)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !182, file: !13, line: 277, baseType: !193, size: 24, offset: 1216)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 24, elements: !190)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !182, file: !13, line: 282, baseType: !195, size: 96, offset: 1248)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 96, elements: !190)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !182, file: !13, line: 283, baseType: !195, size: 96, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !182, file: !13, line: 288, baseType: !198, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !13, line: 178, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !207, !181}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !19, line: 96, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !61, line: 126, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !63, line: 20, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !65, line: 41, baseType: !206)
!206 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !209, line: 186, size: 192, elements: !210)
!209 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !209, line: 188, baseType: !207, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !208, file: !209, line: 191, baseType: !59, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !208, file: !209, line: 200, baseType: !103, size: 16, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !208, file: !209, line: 203, baseType: !103, size: 16, offset: 144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !208, file: !209, line: 208, baseType: !60, size: 8, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !208, file: !209, line: 211, baseType: !60, size: 8, offset: 168)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !208, file: !209, line: 218, baseType: !60, size: 8, offset: 176)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !208, file: !209, line: 221, baseType: !60, size: 8, offset: 184)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !182, file: !13, line: 294, baseType: !220, size: 64, offset: 1536)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !13, line: 189, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!202, !181, !207, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !182, file: !13, line: 299, baseType: !227, size: 64, offset: 1600)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !13, line: 212, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!202, !181, !207}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !182, file: !13, line: 305, baseType: !232, size: 64, offset: 1664)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !13, line: 202, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!202, !181, !207, !70}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !182, file: !13, line: 310, baseType: !237, size: 64, offset: 1728)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !13, line: 214, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !181}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !182, file: !13, line: 319, baseType: !237, size: 64, offset: 1792)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !182, file: !13, line: 323, baseType: !59, size: 64, offset: 1856)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !182, file: !13, line: 325, baseType: !244, size: 64, offset: 1920)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !169)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !182, file: !13, line: 332, baseType: !103, size: 16, offset: 1984)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !182, file: !13, line: 335, baseType: !103, size: 16, offset: 2000)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !182, file: !13, line: 338, baseType: !103, size: 16, offset: 2016)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !182, file: !13, line: 341, baseType: !249, size: 48, offset: 2032)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 48, elements: !154)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !182, file: !13, line: 343, baseType: !60, size: 8, offset: 2080)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !13, line: 345, baseType: !60, size: 8, offset: 2088)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !13, line: 347, baseType: !253, size: 16, offset: 2096)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 2)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !182, file: !13, line: 350, baseType: !60, size: 8, offset: 2112)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !182, file: !13, line: 353, baseType: !60, size: 8, offset: 2120)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !182, file: !13, line: 357, baseType: !60, size: 8, offset: 2128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !182, file: !13, line: 377, baseType: !260, size: 64, offset: 2176)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !13, line: 222, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!202, !181, !70, !12}
!264 = !{!265, !266, !267, !268}
!265 = !DILocalVariable(name: "src", arg: 1, scope: !178, file: !10, line: 86, type: !70)
!266 = !DILocalVariable(name: "dest", arg: 2, scope: !178, file: !10, line: 86, type: !70)
!267 = !DILocalVariable(name: "netif", scope: !178, file: !10, line: 92, type: !181)
!268 = !DILocalVariable(name: "i", scope: !178, file: !10, line: 93, type: !203)
!269 = !DILocation(line: 86, column: 29, scope: !178)
!270 = !DILocation(line: 86, column: 52, scope: !178)
!271 = !DILocation(line: 98, column: 8, scope: !272)
!272 = distinct !DILexicalBlock(scope: !178, file: !10, line: 98, column: 7)
!273 = !{!274, !274, i64 0}
!274 = !{!"any pointer", !275, i64 0}
!275 = !{!"omnipotent char", !276, i64 0}
!276 = !{!"Simple C/C++ TBAA"}
!277 = !DILocation(line: 98, column: 19, scope: !272)
!278 = !DILocation(line: 98, column: 28, scope: !272)
!279 = !DILocation(line: 98, column: 44, scope: !272)
!280 = !{!281, !274, i64 0}
!281 = !{!"netif", !274, i64 0, !282, i64 8, !282, i64 32, !282, i64 56, !275, i64 80, !275, i64 152, !275, i64 156, !275, i64 168, !274, i64 184, !274, i64 192, !274, i64 200, !274, i64 208, !274, i64 216, !274, i64 224, !274, i64 232, !275, i64 240, !283, i64 248, !283, i64 250, !283, i64 252, !275, i64 254, !275, i64 260, !275, i64 261, !275, i64 262, !275, i64 264, !275, i64 265, !275, i64 266, !274, i64 272}
!282 = !{!"ip_addr", !275, i64 0, !275, i64 20}
!283 = !{!"short", !275, i64 0}
!284 = !DILocation(line: 98, column: 49, scope: !272)
!285 = !DILocation(line: 98, column: 7, scope: !178)
!286 = !DILocation(line: 99, column: 10, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !10, line: 99, column: 9)
!288 = distinct !DILexicalBlock(scope: !272, file: !10, line: 98, column: 59)
!289 = !{!281, !275, i64 261}
!290 = !DILocation(line: 99, column: 34, scope: !287)
!291 = !DILocation(line: 100, column: 10, scope: !287)
!292 = !{!293, !275, i64 16}
!293 = !{!"ip6_addr", !275, i64 0, !275, i64 16}
!294 = !DILocation(line: 100, column: 34, scope: !287)
!295 = !DILocation(line: 100, column: 38, scope: !287)
!296 = !{!281, !275, i64 264}
!297 = !DILocation(line: 99, column: 9, scope: !288)
!298 = !DILocation(line: 103, column: 5, scope: !288)
!299 = !DILocation(line: 112, column: 7, scope: !300)
!300 = distinct !DILexicalBlock(scope: !178, file: !10, line: 112, column: 7)
!301 = !DILocation(line: 112, column: 7, scope: !178)
!302 = !DILocation(line: 92, column: 17, scope: !178)
!303 = !DILocation(line: 116, column: 5, scope: !304)
!304 = distinct !DILexicalBlock(scope: !305, file: !10, line: 116, column: 5)
!305 = distinct !DILexicalBlock(scope: !300, file: !10, line: 112, column: 32)
!306 = !DILocation(line: 117, column: 11, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !10, line: 117, column: 11)
!308 = distinct !DILexicalBlock(scope: !309, file: !10, line: 116, column: 26)
!309 = distinct !DILexicalBlock(scope: !304, file: !10, line: 116, column: 5)
!310 = !DILocation(line: 117, column: 43, scope: !307)
!311 = !DILocation(line: 118, column: 11, scope: !307)
!312 = !DILocation(line: 118, column: 30, scope: !307)
!313 = !DILocation(line: 116, column: 5, scope: !309)
!314 = distinct !{!314, !303, !315}
!315 = !DILocation(line: 121, column: 5, scope: !304)
!316 = !DILocation(line: 143, column: 7, scope: !317)
!317 = distinct !DILexicalBlock(scope: !178, file: !10, line: 143, column: 7)
!318 = !{!319, !319, i64 0}
!319 = !{!"int", !275, i64 0}
!320 = !DILocation(line: 144, column: 7, scope: !317)
!321 = !DILocation(line: 144, column: 44, scope: !317)
!322 = !DILocation(line: 149, column: 7, scope: !317)
