; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type opaque
%struct.lua_Debug = type { i32, i8*, i8*, i8*, i8*, i32, i32, i32, i32, [60 x i8], i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.luaL_Buffer = type { i8*, i32, %struct.lua_State*, [1024 x i8] }
%struct.LoadF = type { i32, %struct.__sFILE*, [1024 x i8] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !11, !12, !242}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !9, line: 129, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadF", file: !1, line: 526, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoadF", file: !1, line: 522, size: 8320, elements: !15)
!15 = !{!16, !17, !238}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "extraline", scope: !14, file: !1, line: 523, baseType: !11, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !1, line: 524, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 66, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !22, line: 287, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 181, size: 1408, elements: !24)
!24 = !{!25, !28, !29, !30, !32, !33, !38, !39, !40, !205, !211, !216, !220, !221, !222, !223, !225, !227, !228, !229, !231, !232, !236, !237}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !23, file: !22, line: 182, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !23, file: !22, line: 183, baseType: !11, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !23, file: !22, line: 184, baseType: !11, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !23, file: !22, line: 185, baseType: !31, size: 16, offset: 128)
!31 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !23, file: !22, line: 186, baseType: !31, size: 16, offset: 144)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !23, file: !22, line: 187, baseType: !34, size: 128, offset: 192)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 117, size: 128, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !34, file: !22, line: 118, baseType: !26, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !34, file: !22, line: 119, baseType: !11, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !23, file: !22, line: 188, baseType: !11, size: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !23, file: !22, line: 195, baseType: !4, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !23, file: !22, line: 197, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !46, !4, !90, !11}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !9, line: 145, baseType: !45)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !22, line: 569, size: 14912, elements: !48)
!48 = !{!49, !50, !52, !53, !54, !55, !59, !60, !64, !65, !69, !84, !85, !86, !88, !89, !91, !169, !190, !191, !196, !203}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !47, file: !22, line: 571, baseType: !11, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !47, file: !22, line: 578, baseType: !11, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !47, file: !22, line: 579, baseType: !56, size: 200, offset: 288)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 200, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 25)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !47, file: !22, line: 582, baseType: !11, size: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !47, file: !22, line: 583, baseType: !61, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !63, line: 9, flags: DIFlagFwdDecl)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !47, file: !22, line: 585, baseType: !11, size: 32, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !47, file: !22, line: 587, baseType: !66, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !46}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !47, file: !22, line: 590, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !22, line: 47, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !22, line: 49, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !71, file: !22, line: 51, baseType: !79, size: 32, offset: 192)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !82)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !22, line: 25, baseType: !81)
!81 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !47, file: !22, line: 591, baseType: !11, size: 32, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !47, file: !22, line: 592, baseType: !70, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !47, file: !22, line: 593, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !47, file: !22, line: 596, baseType: !11, size: 32, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !47, file: !22, line: 597, baseType: !90, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !47, file: !22, line: 632, baseType: !92, size: 2880, offset: 1152)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !47, file: !22, line: 599, size: 2880, elements: !93)
!93 = !{!94, !160}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !92, file: !22, line: 622, baseType: !95, size: 1728)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !22, line: 601, size: 1728, elements: !96)
!96 = !{!97, !98, !99, !103, !115, !116, !118, !128, !143, !144, !145, !149, !153, !154, !155, !156, !157, !158, !159}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !95, file: !22, line: 603, baseType: !81, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !95, file: !22, line: 604, baseType: !90, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !95, file: !22, line: 605, baseType: !100, size: 208, offset: 128)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 208, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 26)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !95, file: !22, line: 606, baseType: !104, size: 288, offset: 352)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !22, line: 55, size: 288, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !104, file: !22, line: 57, baseType: !11, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !104, file: !22, line: 58, baseType: !11, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !104, file: !22, line: 59, baseType: !11, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !104, file: !22, line: 60, baseType: !11, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !104, file: !22, line: 61, baseType: !11, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !104, file: !22, line: 62, baseType: !11, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !104, file: !22, line: 63, baseType: !11, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !104, file: !22, line: 64, baseType: !11, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !104, file: !22, line: 65, baseType: !11, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !95, file: !22, line: 607, baseType: !11, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !95, file: !22, line: 608, baseType: !117, size: 64, offset: 704)
!117 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !95, file: !22, line: 609, baseType: !119, size: 112, offset: 768)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !22, line: 319, size: 112, elements: !120)
!120 = !{!121, !126, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !119, file: !22, line: 320, baseType: !122, size: 48)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !124)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !119, file: !22, line: 321, baseType: !122, size: 48, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !119, file: !22, line: 322, baseType: !123, size: 16, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !95, file: !22, line: 610, baseType: !129, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !9, line: 171, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 163, size: 64, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !130, file: !9, line: 165, baseType: !11, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !130, file: !9, line: 170, baseType: !134, size: 32, offset: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !9, line: 166, size: 32, elements: !135)
!135 = !{!136, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !134, file: !9, line: 168, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !138, line: 124, baseType: !81)
!138 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !134, file: !9, line: 169, baseType: !140, size: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 4)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !95, file: !22, line: 611, baseType: !129, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !95, file: !22, line: 612, baseType: !129, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !95, file: !22, line: 613, baseType: !146, size: 64, offset: 1088)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !95, file: !22, line: 614, baseType: !150, size: 192, offset: 1152)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 24)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !95, file: !22, line: 615, baseType: !11, size: 32, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !95, file: !22, line: 616, baseType: !129, size: 64, offset: 1376)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !95, file: !22, line: 617, baseType: !129, size: 64, offset: 1440)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !95, file: !22, line: 618, baseType: !129, size: 64, offset: 1504)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !95, file: !22, line: 619, baseType: !129, size: 64, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !95, file: !22, line: 620, baseType: !129, size: 64, offset: 1632)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !95, file: !22, line: 621, baseType: !11, size: 32, offset: 1696)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !92, file: !22, line: 631, baseType: !161, size: 2880)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !22, line: 626, size: 2880, elements: !162)
!162 = !{!163, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !161, file: !22, line: 629, baseType: !164, size: 1920)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1920, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 30)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !161, file: !22, line: 630, baseType: !168, size: 960, offset: 1920)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 960, elements: !165)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !47, file: !22, line: 636, baseType: !170, size: 64, offset: 4032)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !22, line: 93, size: 6336, elements: !172)
!172 = !{!173, !174, !175, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !171, file: !22, line: 94, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !171, file: !22, line: 95, baseType: !11, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !171, file: !22, line: 97, baseType: !176, size: 2048, offset: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 2048, elements: !180)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null}
!180 = !{!181}
!181 = !DISubrange(count: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !171, file: !22, line: 98, baseType: !183, size: 4160, offset: 2176)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !22, line: 74, size: 4160, elements: !184)
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !183, file: !22, line: 75, baseType: !186, size: 2048)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !180)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !183, file: !22, line: 76, baseType: !186, size: 2048, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !183, file: !22, line: 78, baseType: !80, size: 32, offset: 4096)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !183, file: !22, line: 81, baseType: !80, size: 32, offset: 4128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !47, file: !22, line: 637, baseType: !171, size: 6336, offset: 4096)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !47, file: !22, line: 641, baseType: !192, size: 64, offset: 10432)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !11}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !47, file: !22, line: 646, baseType: !197, size: 192, offset: 10496)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !22, line: 291, size: 192, elements: !198)
!198 = !{!199, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !197, file: !22, line: 293, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !197, file: !22, line: 294, baseType: !11, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !197, file: !22, line: 295, baseType: !51, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !47, file: !22, line: 648, baseType: !204, size: 4224, offset: 10688)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 4224, elements: !124)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !23, file: !22, line: 199, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!44, !46, !4, !209, !11}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !23, file: !22, line: 202, baseType: !212, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !46, !4, !215, !11}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !9, line: 114, baseType: !45)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !23, file: !22, line: 203, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!11, !46, !4}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !23, file: !22, line: 206, baseType: !34, size: 128, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !23, file: !22, line: 207, baseType: !26, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !23, file: !22, line: 208, baseType: !11, size: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !23, file: !22, line: 211, baseType: !224, size: 24, offset: 928)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !124)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !23, file: !22, line: 212, baseType: !226, size: 8, offset: 952)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !82)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !23, file: !22, line: 215, baseType: !34, size: 128, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !23, file: !22, line: 218, baseType: !11, size: 32, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !23, file: !22, line: 219, baseType: !230, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !9, line: 44, baseType: !45)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !23, file: !22, line: 222, baseType: !46, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !23, file: !22, line: 226, baseType: !233, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !9, line: 175, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !235, line: 12, baseType: !11)
!235 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !23, file: !22, line: 228, baseType: !129, size: 64, offset: 1312)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !23, file: !22, line: 229, baseType: !11, size: 32, offset: 1376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !14, file: !1, line: 525, baseType: !239, size: 8192, offset: 128)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1024)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadS", file: !1, line: 596, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoadS", file: !1, line: 593, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !244, file: !1, line: 594, baseType: !209, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !244, file: !1, line: 595, baseType: !6, size: 64, offset: 64)
!248 = !{i32 2, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!252 = distinct !DISubprogram(name: "luaL_argerror", scope: !1, file: !1, line: 43, type: !253, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !259)
!253 = !DISubroutineType(types: !254)
!254 = !{!11, !255, !11, !209}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !257, line: 50, baseType: !258)
!257 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !257, line: 50, flags: DIFlagFwdDecl)
!259 = !{!260, !261, !262, !263}
!260 = !DILocalVariable(name: "L", arg: 1, scope: !252, file: !1, line: 43, type: !255)
!261 = !DILocalVariable(name: "narg", arg: 2, scope: !252, file: !1, line: 43, type: !11)
!262 = !DILocalVariable(name: "extramsg", arg: 3, scope: !252, file: !1, line: 43, type: !209)
!263 = !DILocalVariable(name: "ar", scope: !252, file: !1, line: 44, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !257, line: 326, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !257, line: 346, size: 960, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !280}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !265, file: !257, line: 347, baseType: !11, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !257, line: 348, baseType: !209, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !265, file: !257, line: 349, baseType: !209, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !265, file: !257, line: 350, baseType: !209, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !265, file: !257, line: 351, baseType: !209, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !265, file: !257, line: 352, baseType: !11, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !265, file: !257, line: 353, baseType: !11, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !265, file: !257, line: 354, baseType: !11, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !265, file: !257, line: 355, baseType: !11, size: 32, offset: 416)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !265, file: !257, line: 356, baseType: !277, size: 480, offset: 448)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 480, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 60)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !265, file: !257, line: 358, baseType: !11, size: 32, offset: 928)
!281 = !DILocation(line: 43, column: 42, scope: !252)
!282 = !DILocation(line: 43, column: 49, scope: !252)
!283 = !DILocation(line: 43, column: 67, scope: !252)
!284 = !DILocation(line: 44, column: 3, scope: !252)
!285 = !DILocation(line: 44, column: 13, scope: !252)
!286 = !DILocation(line: 45, column: 8, scope: !287)
!287 = distinct !DILexicalBlock(scope: !252, file: !1, line: 45, column: 7)
!288 = !DILocation(line: 45, column: 7, scope: !252)
!289 = !DILocation(line: 46, column: 12, scope: !287)
!290 = !DILocation(line: 46, column: 5, scope: !287)
!291 = !DILocation(line: 47, column: 3, scope: !252)
!292 = !DILocation(line: 48, column: 17, scope: !293)
!293 = distinct !DILexicalBlock(scope: !252, file: !1, line: 48, column: 7)
!294 = !{!295, !299, i64 16}
!295 = !{!"lua_Debug", !296, i64 0, !299, i64 8, !299, i64 16, !299, i64 24, !299, i64 32, !296, i64 40, !296, i64 44, !296, i64 48, !296, i64 52, !297, i64 56, !296, i64 116}
!296 = !{!"int", !297, i64 0}
!297 = !{!"omnipotent char", !298, i64 0}
!298 = !{!"Simple C/C++ TBAA"}
!299 = !{!"any pointer", !297, i64 0}
!300 = !DILocation(line: 48, column: 7, scope: !293)
!301 = !DILocation(line: 48, column: 37, scope: !293)
!302 = !DILocation(line: 48, column: 7, scope: !252)
!303 = !DILocation(line: 49, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !293, file: !1, line: 48, column: 43)
!305 = !DILocation(line: 50, column: 14, scope: !306)
!306 = distinct !DILexicalBlock(scope: !304, file: !1, line: 50, column: 9)
!307 = !DILocation(line: 50, column: 9, scope: !304)
!308 = !DILocation(line: 52, column: 31, scope: !306)
!309 = !{!295, !299, i64 8}
!310 = !DILocation(line: 51, column: 14, scope: !306)
!311 = !DILocation(line: 51, column: 7, scope: !306)
!312 = !DILocation(line: 54, column: 10, scope: !313)
!313 = distinct !DILexicalBlock(scope: !252, file: !1, line: 54, column: 7)
!314 = !DILocation(line: 54, column: 15, scope: !313)
!315 = !DILocation(line: 54, column: 7, scope: !252)
!316 = !DILocation(line: 55, column: 13, scope: !313)
!317 = !DILocation(line: 55, column: 5, scope: !313)
!318 = !DILocation(line: 57, column: 34, scope: !252)
!319 = !DILocation(line: 56, column: 10, scope: !252)
!320 = !DILocation(line: 56, column: 3, scope: !252)
!321 = !DILocation(line: 0, scope: !287)
!322 = !DILocation(line: 58, column: 1, scope: !252)
!323 = distinct !DISubprogram(name: "luaL_error", scope: !1, file: !1, line: 86, type: !324, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!11, !255, !209, null}
!326 = !{!327, !328, !329}
!327 = !DILocalVariable(name: "L", arg: 1, scope: !323, file: !1, line: 86, type: !255)
!328 = !DILocalVariable(name: "fmt", arg: 2, scope: !323, file: !1, line: 86, type: !209)
!329 = !DILocalVariable(name: "argp", scope: !323, file: !1, line: 87, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !20, line: 46, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !332, line: 51, baseType: !333)
!332 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 87, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 192, elements: !82)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 87, size: 192, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !335, file: !1, line: 87, baseType: !81, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !335, file: !1, line: 87, baseType: !81, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !335, file: !1, line: 87, baseType: !4, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !335, file: !1, line: 87, baseType: !4, size: 64, offset: 128)
!341 = !DILocation(line: 86, column: 39, scope: !323)
!342 = !DILocation(line: 86, column: 54, scope: !323)
!343 = !DILocation(line: 87, column: 3, scope: !323)
!344 = !DILocation(line: 87, column: 11, scope: !323)
!345 = !DILocation(line: 88, column: 3, scope: !323)
!346 = !DILocalVariable(name: "L", arg: 1, scope: !347, file: !1, line: 73, type: !255)
!347 = distinct !DISubprogram(name: "luaL_where", scope: !1, file: !1, line: 73, type: !348, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !255, !11}
!350 = !{!346, !351, !352}
!351 = !DILocalVariable(name: "level", arg: 2, scope: !347, file: !1, line: 73, type: !11)
!352 = !DILocalVariable(name: "ar", scope: !347, file: !1, line: 74, type: !264)
!353 = !DILocation(line: 73, column: 40, scope: !347, inlinedAt: !354)
!354 = distinct !DILocation(line: 89, column: 3, scope: !323)
!355 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !354)
!356 = !DILocation(line: 74, column: 3, scope: !347, inlinedAt: !354)
!357 = !DILocation(line: 74, column: 13, scope: !347, inlinedAt: !354)
!358 = !DILocation(line: 75, column: 7, scope: !359, inlinedAt: !354)
!359 = distinct !DILexicalBlock(scope: !347, file: !1, line: 75, column: 7)
!360 = !DILocation(line: 75, column: 7, scope: !347, inlinedAt: !354)
!361 = !DILocation(line: 76, column: 5, scope: !362, inlinedAt: !354)
!362 = distinct !DILexicalBlock(scope: !359, file: !1, line: 75, column: 36)
!363 = !DILocation(line: 77, column: 12, scope: !364, inlinedAt: !354)
!364 = distinct !DILexicalBlock(scope: !362, file: !1, line: 77, column: 9)
!365 = !{!295, !296, i64 40}
!366 = !DILocation(line: 77, column: 24, scope: !364, inlinedAt: !354)
!367 = !DILocation(line: 77, column: 9, scope: !362, inlinedAt: !354)
!368 = !DILocation(line: 78, column: 37, scope: !369, inlinedAt: !354)
!369 = distinct !DILexicalBlock(scope: !364, file: !1, line: 77, column: 29)
!370 = !DILocation(line: 78, column: 7, scope: !369, inlinedAt: !354)
!371 = !DILocation(line: 79, column: 7, scope: !369, inlinedAt: !354)
!372 = !DILocation(line: 82, column: 3, scope: !347, inlinedAt: !354)
!373 = !DILocation(line: 83, column: 1, scope: !347, inlinedAt: !354)
!374 = !DILocation(line: 90, column: 3, scope: !323)
!375 = !DILocation(line: 91, column: 3, scope: !323)
!376 = !DILocation(line: 92, column: 3, scope: !323)
!377 = !DILocation(line: 93, column: 10, scope: !323)
!378 = !DILocation(line: 94, column: 1, scope: !323)
!379 = !DILocation(line: 93, column: 3, scope: !323)
!380 = distinct !DISubprogram(name: "luaL_typerror", scope: !1, file: !1, line: 61, type: !253, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !381)
!381 = !{!382, !383, !384, !385}
!382 = !DILocalVariable(name: "L", arg: 1, scope: !380, file: !1, line: 61, type: !255)
!383 = !DILocalVariable(name: "narg", arg: 2, scope: !380, file: !1, line: 61, type: !11)
!384 = !DILocalVariable(name: "tname", arg: 3, scope: !380, file: !1, line: 61, type: !209)
!385 = !DILocalVariable(name: "msg", scope: !380, file: !1, line: 62, type: !209)
!386 = !DILocation(line: 61, column: 42, scope: !380)
!387 = !DILocation(line: 61, column: 49, scope: !380)
!388 = !DILocation(line: 61, column: 67, scope: !380)
!389 = !DILocation(line: 63, column: 44, scope: !380)
!390 = !DILocation(line: 62, column: 21, scope: !380)
!391 = !DILocation(line: 62, column: 15, scope: !380)
!392 = !DILocation(line: 64, column: 10, scope: !380)
!393 = !DILocation(line: 64, column: 3, scope: !380)
!394 = !DILocation(line: 73, column: 40, scope: !347)
!395 = !DILocation(line: 73, column: 47, scope: !347)
!396 = !DILocation(line: 74, column: 3, scope: !347)
!397 = !DILocation(line: 74, column: 13, scope: !347)
!398 = !DILocation(line: 75, column: 7, scope: !359)
!399 = !DILocation(line: 75, column: 7, scope: !347)
!400 = !DILocation(line: 76, column: 5, scope: !362)
!401 = !DILocation(line: 77, column: 12, scope: !364)
!402 = !DILocation(line: 77, column: 24, scope: !364)
!403 = !DILocation(line: 77, column: 9, scope: !362)
!404 = !DILocation(line: 78, column: 37, scope: !369)
!405 = !DILocation(line: 78, column: 7, scope: !369)
!406 = !DILocation(line: 79, column: 7, scope: !369)
!407 = !DILocation(line: 82, column: 3, scope: !347)
!408 = !DILocation(line: 83, column: 1, scope: !347)
!409 = distinct !DISubprogram(name: "luaL_checkoption", scope: !1, file: !1, line: 99, type: !410, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !414)
!410 = !DISubroutineType(types: !411)
!411 = !{!11, !255, !11, !209, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DILocalVariable(name: "L", arg: 1, scope: !409, file: !1, line: 99, type: !255)
!416 = !DILocalVariable(name: "narg", arg: 2, scope: !409, file: !1, line: 99, type: !11)
!417 = !DILocalVariable(name: "def", arg: 3, scope: !409, file: !1, line: 99, type: !209)
!418 = !DILocalVariable(name: "lst", arg: 4, scope: !409, file: !1, line: 100, type: !412)
!419 = !DILocalVariable(name: "name", scope: !409, file: !1, line: 101, type: !209)
!420 = !DILocalVariable(name: "i", scope: !409, file: !1, line: 103, type: !11)
!421 = !DILocation(line: 99, column: 45, scope: !409)
!422 = !DILocation(line: 99, column: 52, scope: !409)
!423 = !DILocation(line: 99, column: 70, scope: !409)
!424 = !DILocation(line: 100, column: 52, scope: !409)
!425 = !DILocation(line: 101, column: 22, scope: !409)
!426 = !DILocalVariable(name: "L", arg: 1, scope: !427, file: !1, line: 165, type: !255)
!427 = distinct !DISubprogram(name: "luaL_optlstring", scope: !1, file: !1, line: 165, type: !428, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !431)
!428 = !DISubroutineType(types: !429)
!429 = !{!209, !255, !11, !209, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!431 = !{!426, !432, !433, !434}
!432 = !DILocalVariable(name: "narg", arg: 2, scope: !427, file: !1, line: 165, type: !11)
!433 = !DILocalVariable(name: "def", arg: 3, scope: !427, file: !1, line: 166, type: !209)
!434 = !DILocalVariable(name: "len", arg: 4, scope: !427, file: !1, line: 166, type: !430)
!435 = !DILocation(line: 165, column: 52, scope: !427, inlinedAt: !436)
!436 = distinct !DILocation(line: 101, column: 30, scope: !409)
!437 = !DILocation(line: 165, column: 59, scope: !427, inlinedAt: !436)
!438 = !DILocation(line: 166, column: 53, scope: !427, inlinedAt: !436)
!439 = !DILocation(line: 166, column: 66, scope: !427, inlinedAt: !436)
!440 = !DILocation(line: 167, column: 7, scope: !441, inlinedAt: !436)
!441 = distinct !DILexicalBlock(scope: !427, file: !1, line: 167, column: 7)
!442 = !DILocation(line: 167, column: 7, scope: !427, inlinedAt: !436)
!443 = !DILocation(line: 172, column: 15, scope: !441, inlinedAt: !436)
!444 = !DILocation(line: 172, column: 8, scope: !441, inlinedAt: !436)
!445 = !DILocation(line: 0, scope: !441, inlinedAt: !436)
!446 = !DILocation(line: 173, column: 1, scope: !427, inlinedAt: !436)
!447 = !DILocation(line: 102, column: 30, scope: !409)
!448 = !DILocation(line: 101, column: 15, scope: !409)
!449 = !DILocation(line: 103, column: 7, scope: !409)
!450 = !DILocation(line: 104, column: 13, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 104, column: 3)
!452 = distinct !DILexicalBlock(scope: !409, file: !1, line: 104, column: 3)
!453 = !{!299, !299, i64 0}
!454 = !DILocation(line: 104, column: 3, scope: !452)
!455 = !DILocation(line: 105, column: 9, scope: !456)
!456 = distinct !DILexicalBlock(scope: !451, file: !1, line: 105, column: 9)
!457 = !DILocation(line: 105, column: 30, scope: !456)
!458 = !DILocation(line: 105, column: 9, scope: !451)
!459 = !DILocation(line: 104, column: 22, scope: !451)
!460 = distinct !{!460, !454, !461}
!461 = !DILocation(line: 106, column: 14, scope: !452)
!462 = !DILocation(line: 108, column: 24, scope: !409)
!463 = !DILocation(line: 107, column: 10, scope: !409)
!464 = !DILocation(line: 107, column: 3, scope: !409)
!465 = !DILocation(line: 109, column: 1, scope: !409)
!466 = !DILocation(line: 0, scope: !409)
!467 = !DILocation(line: 165, column: 52, scope: !427)
!468 = !DILocation(line: 165, column: 59, scope: !427)
!469 = !DILocation(line: 166, column: 53, scope: !427)
!470 = !DILocation(line: 166, column: 66, scope: !427)
!471 = !DILocation(line: 167, column: 7, scope: !441)
!472 = !DILocation(line: 167, column: 7, scope: !427)
!473 = !DILocation(line: 168, column: 9, scope: !474)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 168, column: 9)
!475 = distinct !DILexicalBlock(scope: !441, file: !1, line: 167, column: 33)
!476 = !DILocation(line: 168, column: 9, scope: !475)
!477 = !DILocation(line: 169, column: 15, scope: !474)
!478 = !DILocation(line: 169, column: 21, scope: !474)
!479 = !DILocation(line: 169, column: 12, scope: !474)
!480 = !{!481, !481, i64 0}
!481 = !{!"long", !297, i64 0}
!482 = !DILocation(line: 169, column: 7, scope: !474)
!483 = !DILocation(line: 172, column: 15, scope: !441)
!484 = !DILocation(line: 172, column: 8, scope: !441)
!485 = !DILocation(line: 0, scope: !441)
!486 = !DILocation(line: 173, column: 1, scope: !427)
!487 = distinct !DISubprogram(name: "luaL_checklstring", scope: !1, file: !1, line: 158, type: !488, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{!209, !255, !11, !430}
!490 = !{!491, !492, !493, !494}
!491 = !DILocalVariable(name: "L", arg: 1, scope: !487, file: !1, line: 158, type: !255)
!492 = !DILocalVariable(name: "narg", arg: 2, scope: !487, file: !1, line: 158, type: !11)
!493 = !DILocalVariable(name: "len", arg: 3, scope: !487, file: !1, line: 158, type: !430)
!494 = !DILocalVariable(name: "s", scope: !487, file: !1, line: 159, type: !209)
!495 = !DILocation(line: 158, column: 54, scope: !487)
!496 = !DILocation(line: 158, column: 61, scope: !487)
!497 = !DILocation(line: 158, column: 75, scope: !487)
!498 = !DILocation(line: 159, column: 19, scope: !487)
!499 = !DILocation(line: 159, column: 15, scope: !487)
!500 = !DILocation(line: 160, column: 8, scope: !501)
!501 = distinct !DILexicalBlock(scope: !487, file: !1, line: 160, column: 7)
!502 = !DILocation(line: 160, column: 7, scope: !487)
!503 = !DILocalVariable(name: "L", arg: 1, scope: !504, file: !1, line: 68, type: !255)
!504 = distinct !DISubprogram(name: "tag_error", scope: !1, file: !1, line: 68, type: !505, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !255, !11, !11}
!507 = !{!503, !508, !509}
!508 = !DILocalVariable(name: "narg", arg: 2, scope: !504, file: !1, line: 68, type: !11)
!509 = !DILocalVariable(name: "tag", arg: 3, scope: !504, file: !1, line: 68, type: !11)
!510 = !DILocation(line: 68, column: 35, scope: !504, inlinedAt: !511)
!511 = distinct !DILocation(line: 160, column: 11, scope: !501)
!512 = !DILocation(line: 68, column: 42, scope: !504, inlinedAt: !511)
!513 = !DILocation(line: 68, column: 52, scope: !504, inlinedAt: !511)
!514 = !DILocation(line: 69, column: 26, scope: !504, inlinedAt: !511)
!515 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !516)
!516 = distinct !DILocation(line: 69, column: 3, scope: !504, inlinedAt: !511)
!517 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !516)
!518 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !516)
!519 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !516)
!520 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !516)
!521 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !516)
!522 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !516)
!523 = !DILocation(line: 64, column: 3, scope: !380, inlinedAt: !516)
!524 = !DILocation(line: 70, column: 1, scope: !504, inlinedAt: !511)
!525 = !DILocation(line: 160, column: 11, scope: !501)
!526 = !DILocation(line: 161, column: 3, scope: !487)
!527 = distinct !DISubprogram(name: "luaL_newmetatable", scope: !1, file: !1, line: 112, type: !528, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!11, !255, !209}
!530 = !{!531, !532}
!531 = !DILocalVariable(name: "L", arg: 1, scope: !527, file: !1, line: 112, type: !255)
!532 = !DILocalVariable(name: "tname", arg: 2, scope: !527, file: !1, line: 112, type: !209)
!533 = !DILocation(line: 112, column: 46, scope: !527)
!534 = !DILocation(line: 112, column: 61, scope: !527)
!535 = !DILocation(line: 113, column: 3, scope: !527)
!536 = !DILocation(line: 114, column: 8, scope: !537)
!537 = distinct !DILexicalBlock(scope: !527, file: !1, line: 114, column: 7)
!538 = !DILocation(line: 114, column: 7, scope: !527)
!539 = !DILocation(line: 116, column: 3, scope: !527)
!540 = !DILocation(line: 117, column: 3, scope: !527)
!541 = !DILocation(line: 118, column: 3, scope: !527)
!542 = !DILocation(line: 119, column: 3, scope: !527)
!543 = !DILocation(line: 120, column: 3, scope: !527)
!544 = !DILocation(line: 0, scope: !537)
!545 = !DILocation(line: 121, column: 1, scope: !527)
!546 = distinct !DISubprogram(name: "luaL_checkudata", scope: !1, file: !1, line: 124, type: !547, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!4, !255, !11, !209}
!549 = !{!550, !551, !552, !553}
!550 = !DILocalVariable(name: "L", arg: 1, scope: !546, file: !1, line: 124, type: !255)
!551 = !DILocalVariable(name: "ud", arg: 2, scope: !546, file: !1, line: 124, type: !11)
!552 = !DILocalVariable(name: "tname", arg: 3, scope: !546, file: !1, line: 124, type: !209)
!553 = !DILocalVariable(name: "p", scope: !546, file: !1, line: 125, type: !4)
!554 = !DILocation(line: 124, column: 46, scope: !546)
!555 = !DILocation(line: 124, column: 53, scope: !546)
!556 = !DILocation(line: 124, column: 69, scope: !546)
!557 = !DILocation(line: 125, column: 13, scope: !546)
!558 = !DILocation(line: 125, column: 9, scope: !546)
!559 = !DILocation(line: 126, column: 9, scope: !560)
!560 = distinct !DILexicalBlock(scope: !546, file: !1, line: 126, column: 7)
!561 = !DILocation(line: 126, column: 7, scope: !546)
!562 = !DILocation(line: 127, column: 9, scope: !563)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 127, column: 9)
!564 = distinct !DILexicalBlock(scope: !560, file: !1, line: 126, column: 18)
!565 = !DILocation(line: 127, column: 9, scope: !564)
!566 = !DILocation(line: 128, column: 7, scope: !567)
!567 = distinct !DILexicalBlock(scope: !563, file: !1, line: 127, column: 34)
!568 = !DILocation(line: 129, column: 11, scope: !569)
!569 = distinct !DILexicalBlock(scope: !567, file: !1, line: 129, column: 11)
!570 = !DILocation(line: 129, column: 11, scope: !567)
!571 = !DILocation(line: 130, column: 9, scope: !572)
!572 = distinct !DILexicalBlock(scope: !569, file: !1, line: 129, column: 36)
!573 = !DILocation(line: 131, column: 9, scope: !572)
!574 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !575)
!575 = distinct !DILocation(line: 135, column: 3, scope: !546)
!576 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !575)
!577 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !575)
!578 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !575)
!579 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !575)
!580 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !575)
!581 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !575)
!582 = !DILocation(line: 64, column: 3, scope: !380, inlinedAt: !575)
!583 = !DILocation(line: 136, column: 3, scope: !546)
!584 = !DILocation(line: 0, scope: !546)
!585 = !DILocation(line: 137, column: 1, scope: !546)
!586 = distinct !DISubprogram(name: "luaL_checkstack", scope: !1, file: !1, line: 140, type: !587, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !255, !11, !209}
!589 = !{!590, !591, !592}
!590 = !DILocalVariable(name: "L", arg: 1, scope: !586, file: !1, line: 140, type: !255)
!591 = !DILocalVariable(name: "space", arg: 2, scope: !586, file: !1, line: 140, type: !11)
!592 = !DILocalVariable(name: "mes", arg: 3, scope: !586, file: !1, line: 140, type: !209)
!593 = !DILocation(line: 140, column: 45, scope: !586)
!594 = !DILocation(line: 140, column: 52, scope: !586)
!595 = !DILocation(line: 140, column: 71, scope: !586)
!596 = !DILocation(line: 141, column: 8, scope: !597)
!597 = distinct !DILexicalBlock(scope: !586, file: !1, line: 141, column: 7)
!598 = !DILocation(line: 141, column: 7, scope: !586)
!599 = !DILocation(line: 142, column: 5, scope: !597)
!600 = !DILocation(line: 143, column: 1, scope: !586)
!601 = distinct !DISubprogram(name: "luaL_checktype", scope: !1, file: !1, line: 146, type: !505, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !602)
!602 = !{!603, !604, !605}
!603 = !DILocalVariable(name: "L", arg: 1, scope: !601, file: !1, line: 146, type: !255)
!604 = !DILocalVariable(name: "narg", arg: 2, scope: !601, file: !1, line: 146, type: !11)
!605 = !DILocalVariable(name: "t", arg: 3, scope: !601, file: !1, line: 146, type: !11)
!606 = !DILocation(line: 146, column: 44, scope: !601)
!607 = !DILocation(line: 146, column: 51, scope: !601)
!608 = !DILocation(line: 146, column: 61, scope: !601)
!609 = !DILocation(line: 147, column: 7, scope: !610)
!610 = distinct !DILexicalBlock(scope: !601, file: !1, line: 147, column: 7)
!611 = !DILocation(line: 147, column: 25, scope: !610)
!612 = !DILocation(line: 147, column: 7, scope: !601)
!613 = !DILocation(line: 68, column: 35, scope: !504, inlinedAt: !614)
!614 = distinct !DILocation(line: 148, column: 5, scope: !610)
!615 = !DILocation(line: 68, column: 42, scope: !504, inlinedAt: !614)
!616 = !DILocation(line: 68, column: 52, scope: !504, inlinedAt: !614)
!617 = !DILocation(line: 69, column: 26, scope: !504, inlinedAt: !614)
!618 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !619)
!619 = distinct !DILocation(line: 69, column: 3, scope: !504, inlinedAt: !614)
!620 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !619)
!621 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !619)
!622 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !619)
!623 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !619)
!624 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !619)
!625 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !619)
!626 = !DILocation(line: 64, column: 3, scope: !380, inlinedAt: !619)
!627 = !DILocation(line: 70, column: 1, scope: !504, inlinedAt: !614)
!628 = !DILocation(line: 148, column: 5, scope: !610)
!629 = !DILocation(line: 149, column: 1, scope: !601)
!630 = distinct !DISubprogram(name: "luaL_checkany", scope: !1, file: !1, line: 152, type: !348, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !631)
!631 = !{!632, !633}
!632 = !DILocalVariable(name: "L", arg: 1, scope: !630, file: !1, line: 152, type: !255)
!633 = !DILocalVariable(name: "narg", arg: 2, scope: !630, file: !1, line: 152, type: !11)
!634 = !DILocation(line: 152, column: 43, scope: !630)
!635 = !DILocation(line: 152, column: 50, scope: !630)
!636 = !DILocation(line: 153, column: 7, scope: !637)
!637 = distinct !DILexicalBlock(scope: !630, file: !1, line: 153, column: 7)
!638 = !DILocation(line: 153, column: 25, scope: !637)
!639 = !DILocation(line: 153, column: 7, scope: !630)
!640 = !DILocation(line: 154, column: 5, scope: !637)
!641 = !DILocation(line: 155, column: 1, scope: !630)
!642 = distinct !DISubprogram(name: "luaL_checknumber", scope: !1, file: !1, line: 176, type: !643, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !647)
!643 = !DISubroutineType(types: !644)
!644 = !{!645, !255, !11}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !257, line: 99, baseType: !646)
!646 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!647 = !{!648, !649, !650}
!648 = !DILocalVariable(name: "L", arg: 1, scope: !642, file: !1, line: 176, type: !255)
!649 = !DILocalVariable(name: "narg", arg: 2, scope: !642, file: !1, line: 176, type: !11)
!650 = !DILocalVariable(name: "d", scope: !642, file: !1, line: 177, type: !645)
!651 = !DILocation(line: 176, column: 52, scope: !642)
!652 = !DILocation(line: 176, column: 59, scope: !642)
!653 = !DILocation(line: 177, column: 18, scope: !642)
!654 = !DILocation(line: 177, column: 14, scope: !642)
!655 = !DILocation(line: 178, column: 9, scope: !656)
!656 = distinct !DILexicalBlock(scope: !642, file: !1, line: 178, column: 7)
!657 = !DILocation(line: 178, column: 14, scope: !656)
!658 = !DILocation(line: 178, column: 18, scope: !656)
!659 = !DILocation(line: 178, column: 7, scope: !642)
!660 = !DILocation(line: 68, column: 35, scope: !504, inlinedAt: !661)
!661 = distinct !DILocation(line: 179, column: 5, scope: !656)
!662 = !DILocation(line: 68, column: 42, scope: !504, inlinedAt: !661)
!663 = !DILocation(line: 68, column: 52, scope: !504, inlinedAt: !661)
!664 = !DILocation(line: 69, column: 26, scope: !504, inlinedAt: !661)
!665 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !666)
!666 = distinct !DILocation(line: 69, column: 3, scope: !504, inlinedAt: !661)
!667 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !666)
!668 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !666)
!669 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !666)
!670 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !666)
!671 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !666)
!672 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !666)
!673 = !DILocation(line: 64, column: 3, scope: !380, inlinedAt: !666)
!674 = !DILocation(line: 70, column: 1, scope: !504, inlinedAt: !661)
!675 = !DILocation(line: 179, column: 5, scope: !656)
!676 = !DILocation(line: 180, column: 3, scope: !642)
!677 = distinct !DISubprogram(name: "luaL_optnumber", scope: !1, file: !1, line: 184, type: !678, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!645, !255, !11, !645}
!680 = !{!681, !682, !683}
!681 = !DILocalVariable(name: "L", arg: 1, scope: !677, file: !1, line: 184, type: !255)
!682 = !DILocalVariable(name: "narg", arg: 2, scope: !677, file: !1, line: 184, type: !11)
!683 = !DILocalVariable(name: "def", arg: 3, scope: !677, file: !1, line: 184, type: !645)
!684 = !DILocation(line: 184, column: 50, scope: !677)
!685 = !DILocation(line: 184, column: 57, scope: !677)
!686 = !DILocation(line: 184, column: 74, scope: !677)
!687 = !DILocation(line: 185, column: 10, scope: !677)
!688 = !DILocation(line: 185, column: 3, scope: !677)
!689 = distinct !DISubprogram(name: "luaL_checkinteger", scope: !1, file: !1, line: 189, type: !690, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !694)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !255, !11}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Integer", file: !257, line: 103, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !138, line: 49, baseType: !45)
!694 = !{!695, !696, !697}
!695 = !DILocalVariable(name: "L", arg: 1, scope: !689, file: !1, line: 189, type: !255)
!696 = !DILocalVariable(name: "narg", arg: 2, scope: !689, file: !1, line: 189, type: !11)
!697 = !DILocalVariable(name: "d", scope: !689, file: !1, line: 190, type: !692)
!698 = !DILocation(line: 189, column: 54, scope: !689)
!699 = !DILocation(line: 189, column: 61, scope: !689)
!700 = !DILocation(line: 190, column: 19, scope: !689)
!701 = !DILocation(line: 190, column: 15, scope: !689)
!702 = !DILocation(line: 191, column: 9, scope: !703)
!703 = distinct !DILexicalBlock(scope: !689, file: !1, line: 191, column: 7)
!704 = !DILocation(line: 191, column: 14, scope: !703)
!705 = !DILocation(line: 191, column: 18, scope: !703)
!706 = !DILocation(line: 191, column: 7, scope: !689)
!707 = !DILocation(line: 68, column: 35, scope: !504, inlinedAt: !708)
!708 = distinct !DILocation(line: 192, column: 5, scope: !703)
!709 = !DILocation(line: 68, column: 42, scope: !504, inlinedAt: !708)
!710 = !DILocation(line: 68, column: 52, scope: !504, inlinedAt: !708)
!711 = !DILocation(line: 69, column: 26, scope: !504, inlinedAt: !708)
!712 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !713)
!713 = distinct !DILocation(line: 69, column: 3, scope: !504, inlinedAt: !708)
!714 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !713)
!715 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !713)
!716 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !713)
!717 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !713)
!718 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !713)
!719 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !713)
!720 = !DILocation(line: 64, column: 3, scope: !380, inlinedAt: !713)
!721 = !DILocation(line: 70, column: 1, scope: !504, inlinedAt: !708)
!722 = !DILocation(line: 192, column: 5, scope: !703)
!723 = !DILocation(line: 193, column: 3, scope: !689)
!724 = distinct !DISubprogram(name: "luaL_optinteger", scope: !1, file: !1, line: 197, type: !725, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{!692, !255, !11, !692}
!727 = !{!728, !729, !730}
!728 = !DILocalVariable(name: "L", arg: 1, scope: !724, file: !1, line: 197, type: !255)
!729 = !DILocalVariable(name: "narg", arg: 2, scope: !724, file: !1, line: 197, type: !11)
!730 = !DILocalVariable(name: "def", arg: 3, scope: !724, file: !1, line: 198, type: !692)
!731 = !DILocation(line: 197, column: 52, scope: !724)
!732 = !DILocation(line: 197, column: 59, scope: !724)
!733 = !DILocation(line: 198, column: 67, scope: !724)
!734 = !DILocation(line: 199, column: 10, scope: !724)
!735 = !DILocation(line: 199, column: 3, scope: !724)
!736 = distinct !DISubprogram(name: "luaL_getmetafield", scope: !1, file: !1, line: 203, type: !253, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !737)
!737 = !{!738, !739, !740}
!738 = !DILocalVariable(name: "L", arg: 1, scope: !736, file: !1, line: 203, type: !255)
!739 = !DILocalVariable(name: "obj", arg: 2, scope: !736, file: !1, line: 203, type: !11)
!740 = !DILocalVariable(name: "event", arg: 3, scope: !736, file: !1, line: 203, type: !209)
!741 = !DILocation(line: 203, column: 46, scope: !736)
!742 = !DILocation(line: 203, column: 53, scope: !736)
!743 = !DILocation(line: 203, column: 70, scope: !736)
!744 = !DILocation(line: 204, column: 8, scope: !745)
!745 = distinct !DILexicalBlock(scope: !736, file: !1, line: 204, column: 7)
!746 = !DILocation(line: 204, column: 7, scope: !736)
!747 = !DILocation(line: 206, column: 3, scope: !736)
!748 = !DILocation(line: 207, column: 3, scope: !736)
!749 = !DILocation(line: 208, column: 7, scope: !750)
!750 = distinct !DILexicalBlock(scope: !736, file: !1, line: 208, column: 7)
!751 = !DILocation(line: 208, column: 7, scope: !736)
!752 = !DILocation(line: 209, column: 5, scope: !753)
!753 = distinct !DILexicalBlock(scope: !750, file: !1, line: 208, column: 25)
!754 = !DILocation(line: 210, column: 5, scope: !753)
!755 = !DILocation(line: 213, column: 5, scope: !756)
!756 = distinct !DILexicalBlock(scope: !750, file: !1, line: 212, column: 8)
!757 = !DILocation(line: 214, column: 5, scope: !756)
!758 = !DILocation(line: 0, scope: !745)
!759 = !DILocation(line: 216, column: 1, scope: !736)
!760 = distinct !DISubprogram(name: "luaL_callmeta", scope: !1, file: !1, line: 219, type: !253, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !761)
!761 = !{!762, !763, !764}
!762 = !DILocalVariable(name: "L", arg: 1, scope: !760, file: !1, line: 219, type: !255)
!763 = !DILocalVariable(name: "obj", arg: 2, scope: !760, file: !1, line: 219, type: !11)
!764 = !DILocalVariable(name: "event", arg: 3, scope: !760, file: !1, line: 219, type: !209)
!765 = !DILocation(line: 219, column: 42, scope: !760)
!766 = !DILocation(line: 219, column: 49, scope: !760)
!767 = !DILocation(line: 219, column: 66, scope: !760)
!768 = !DILocation(line: 220, column: 9, scope: !760)
!769 = !DILocation(line: 203, column: 46, scope: !736, inlinedAt: !770)
!770 = distinct !DILocation(line: 221, column: 8, scope: !771)
!771 = distinct !DILexicalBlock(scope: !760, file: !1, line: 221, column: 7)
!772 = !DILocation(line: 203, column: 53, scope: !736, inlinedAt: !770)
!773 = !DILocation(line: 203, column: 70, scope: !736, inlinedAt: !770)
!774 = !DILocation(line: 204, column: 8, scope: !745, inlinedAt: !770)
!775 = !DILocation(line: 204, column: 7, scope: !736, inlinedAt: !770)
!776 = !DILocation(line: 206, column: 3, scope: !736, inlinedAt: !770)
!777 = !DILocation(line: 207, column: 3, scope: !736, inlinedAt: !770)
!778 = !DILocation(line: 208, column: 7, scope: !750, inlinedAt: !770)
!779 = !DILocation(line: 208, column: 7, scope: !736, inlinedAt: !770)
!780 = !DILocation(line: 209, column: 5, scope: !753, inlinedAt: !770)
!781 = !DILocation(line: 210, column: 5, scope: !753, inlinedAt: !770)
!782 = !DILocation(line: 216, column: 1, scope: !736, inlinedAt: !770)
!783 = !DILocation(line: 221, column: 7, scope: !760)
!784 = !DILocation(line: 213, column: 5, scope: !756, inlinedAt: !770)
!785 = !DILocation(line: 223, column: 3, scope: !760)
!786 = !DILocation(line: 224, column: 3, scope: !760)
!787 = !DILocation(line: 225, column: 3, scope: !760)
!788 = !DILocation(line: 0, scope: !771)
!789 = !DILocation(line: 226, column: 1, scope: !760)
!790 = distinct !DISubprogram(name: "luaL_register", scope: !1, file: !1, line: 229, type: !791, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !805)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !255, !209, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !796, line: 38, baseType: !797)
!796 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !796, line: 35, size: 128, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !796, line: 36, baseType: !209, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !797, file: !796, line: 37, baseType: !801, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !257, line: 52, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!11, !255}
!805 = !{!806, !807, !808}
!806 = !DILocalVariable(name: "L", arg: 1, scope: !790, file: !1, line: 229, type: !255)
!807 = !DILocalVariable(name: "libname", arg: 2, scope: !790, file: !1, line: 229, type: !209)
!808 = !DILocalVariable(name: "l", arg: 3, scope: !790, file: !1, line: 230, type: !793)
!809 = !DILocation(line: 229, column: 45, scope: !790)
!810 = !DILocation(line: 229, column: 60, scope: !790)
!811 = !DILocation(line: 230, column: 49, scope: !790)
!812 = !DILocation(line: 231, column: 3, scope: !790)
!813 = !DILocation(line: 232, column: 1, scope: !790)
!814 = distinct !DISubprogram(name: "luaL_openlib", scope: !1, file: !1, line: 242, type: !815, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !255, !209, !793, !11}
!817 = !{!818, !819, !820, !821, !822, !825}
!818 = !DILocalVariable(name: "L", arg: 1, scope: !814, file: !1, line: 242, type: !255)
!819 = !DILocalVariable(name: "libname", arg: 2, scope: !814, file: !1, line: 242, type: !209)
!820 = !DILocalVariable(name: "l", arg: 3, scope: !814, file: !1, line: 243, type: !793)
!821 = !DILocalVariable(name: "nup", arg: 4, scope: !814, file: !1, line: 243, type: !11)
!822 = !DILocalVariable(name: "size", scope: !823, file: !1, line: 245, type: !11)
!823 = distinct !DILexicalBlock(scope: !824, file: !1, line: 244, column: 16)
!824 = distinct !DILexicalBlock(scope: !814, file: !1, line: 244, column: 7)
!825 = !DILocalVariable(name: "i", scope: !826, file: !1, line: 261, type: !11)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 260, column: 24)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 260, column: 3)
!828 = distinct !DILexicalBlock(scope: !814, file: !1, line: 260, column: 3)
!829 = !DILocation(line: 242, column: 42, scope: !814)
!830 = !DILocation(line: 242, column: 57, scope: !814)
!831 = !DILocation(line: 243, column: 47, scope: !814)
!832 = !DILocation(line: 243, column: 54, scope: !814)
!833 = !DILocation(line: 244, column: 7, scope: !824)
!834 = !DILocation(line: 0, scope: !823)
!835 = !DILocation(line: 244, column: 7, scope: !814)
!836 = !DILocalVariable(name: "l", arg: 1, scope: !837, file: !1, line: 235, type: !793)
!837 = distinct !DISubprogram(name: "libsize", scope: !1, file: !1, line: 235, type: !838, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!11, !793}
!840 = !{!836, !841}
!841 = !DILocalVariable(name: "size", scope: !837, file: !1, line: 236, type: !11)
!842 = !DILocation(line: 235, column: 37, scope: !837, inlinedAt: !843)
!843 = distinct !DILocation(line: 245, column: 16, scope: !823)
!844 = !DILocation(line: 236, column: 7, scope: !837, inlinedAt: !843)
!845 = !DILocation(line: 237, column: 13, scope: !846, inlinedAt: !843)
!846 = distinct !DILexicalBlock(scope: !847, file: !1, line: 237, column: 3)
!847 = distinct !DILexicalBlock(scope: !837, file: !1, line: 237, column: 3)
!848 = !{!849, !299, i64 0}
!849 = !{!"luaL_Reg", !299, i64 0, !299, i64 8}
!850 = !DILocation(line: 237, column: 3, scope: !847, inlinedAt: !843)
!851 = !DILocation(line: 237, column: 28, scope: !846, inlinedAt: !843)
!852 = !DILocation(line: 237, column: 20, scope: !846, inlinedAt: !843)
!853 = distinct !{!853, !854, !855}
!854 = !DILocation(line: 237, column: 3, scope: !847)
!855 = !DILocation(line: 237, column: 28, scope: !847)
!856 = !DILocation(line: 0, scope: !846, inlinedAt: !843)
!857 = !DILocation(line: 238, column: 3, scope: !837, inlinedAt: !843)
!858 = !DILocation(line: 245, column: 9, scope: !823)
!859 = !DILocation(line: 247, column: 5, scope: !823)
!860 = !DILocation(line: 248, column: 5, scope: !823)
!861 = !DILocation(line: 249, column: 10, scope: !862)
!862 = distinct !DILexicalBlock(scope: !823, file: !1, line: 249, column: 9)
!863 = !DILocation(line: 249, column: 9, scope: !823)
!864 = !DILocation(line: 250, column: 7, scope: !865)
!865 = distinct !DILexicalBlock(scope: !862, file: !1, line: 249, column: 30)
!866 = !DILocation(line: 252, column: 11, scope: !867)
!867 = distinct !DILexicalBlock(scope: !865, file: !1, line: 252, column: 11)
!868 = !DILocation(line: 252, column: 62, scope: !867)
!869 = !DILocation(line: 252, column: 11, scope: !865)
!870 = !DILocation(line: 253, column: 9, scope: !867)
!871 = !DILocation(line: 254, column: 7, scope: !865)
!872 = !DILocation(line: 255, column: 7, scope: !865)
!873 = !DILocation(line: 256, column: 5, scope: !865)
!874 = !DILocation(line: 257, column: 5, scope: !823)
!875 = !DILocation(line: 258, column: 19, scope: !823)
!876 = !DILocation(line: 258, column: 5, scope: !823)
!877 = !DILocation(line: 259, column: 3, scope: !823)
!878 = !DILocation(line: 260, column: 13, scope: !827)
!879 = !DILocation(line: 260, column: 3, scope: !828)
!880 = !DILocation(line: 261, column: 9, scope: !826)
!881 = !DILocation(line: 262, column: 5, scope: !882)
!882 = distinct !DILexicalBlock(scope: !826, file: !1, line: 262, column: 5)
!883 = !DILocation(line: 263, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !882, file: !1, line: 262, column: 5)
!885 = !DILocation(line: 262, column: 23, scope: !884)
!886 = !DILocation(line: 262, column: 16, scope: !884)
!887 = distinct !{!887, !881, !888}
!888 = !DILocation(line: 263, column: 28, scope: !882)
!889 = !DILocation(line: 264, column: 28, scope: !826)
!890 = !{!849, !299, i64 8}
!891 = !DILocation(line: 264, column: 5, scope: !826)
!892 = !DILocation(line: 265, column: 34, scope: !826)
!893 = !DILocation(line: 265, column: 5, scope: !826)
!894 = !DILocation(line: 260, column: 20, scope: !827)
!895 = distinct !{!895, !879, !896}
!896 = !DILocation(line: 266, column: 3, scope: !828)
!897 = !DILocation(line: 267, column: 3, scope: !814)
!898 = !DILocation(line: 268, column: 1, scope: !814)
!899 = distinct !DISubprogram(name: "luaL_findtable", scope: !1, file: !1, line: 357, type: !900, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{!209, !255, !11, !209, !11}
!902 = !{!903, !904, !905, !906, !907}
!903 = !DILocalVariable(name: "L", arg: 1, scope: !899, file: !1, line: 357, type: !255)
!904 = !DILocalVariable(name: "idx", arg: 2, scope: !899, file: !1, line: 357, type: !11)
!905 = !DILocalVariable(name: "fname", arg: 3, scope: !899, file: !1, line: 358, type: !209)
!906 = !DILocalVariable(name: "szhint", arg: 4, scope: !899, file: !1, line: 358, type: !11)
!907 = !DILocalVariable(name: "e", scope: !899, file: !1, line: 359, type: !209)
!908 = !DILocation(line: 357, column: 51, scope: !899)
!909 = !DILocation(line: 357, column: 58, scope: !899)
!910 = !DILocation(line: 358, column: 52, scope: !899)
!911 = !DILocation(line: 358, column: 63, scope: !899)
!912 = !DILocation(line: 360, column: 3, scope: !899)
!913 = !DILocation(line: 361, column: 3, scope: !899)
!914 = !DILocation(line: 362, column: 9, scope: !915)
!915 = distinct !DILexicalBlock(scope: !899, file: !1, line: 361, column: 6)
!916 = !DILocation(line: 359, column: 15, scope: !899)
!917 = !DILocation(line: 363, column: 11, scope: !918)
!918 = distinct !DILexicalBlock(scope: !915, file: !1, line: 363, column: 9)
!919 = !DILocation(line: 363, column: 9, scope: !915)
!920 = !DILocation(line: 363, column: 32, scope: !918)
!921 = !DILocation(line: 363, column: 30, scope: !918)
!922 = !DILocation(line: 363, column: 20, scope: !918)
!923 = !DILocation(line: 0, scope: !915)
!924 = !DILocation(line: 364, column: 33, scope: !915)
!925 = !DILocation(line: 364, column: 5, scope: !915)
!926 = !DILocation(line: 365, column: 5, scope: !915)
!927 = !DILocation(line: 366, column: 9, scope: !928)
!928 = distinct !DILexicalBlock(scope: !915, file: !1, line: 366, column: 9)
!929 = !DILocation(line: 366, column: 9, scope: !915)
!930 = !DILocation(line: 367, column: 7, scope: !931)
!931 = distinct !DILexicalBlock(scope: !928, file: !1, line: 366, column: 27)
!932 = !DILocation(line: 368, column: 30, scope: !931)
!933 = !{!297, !297, i64 0}
!934 = !DILocation(line: 368, column: 33, scope: !931)
!935 = !DILocation(line: 368, column: 7, scope: !931)
!936 = !DILocation(line: 369, column: 7, scope: !931)
!937 = !DILocation(line: 370, column: 7, scope: !931)
!938 = !DILocation(line: 371, column: 7, scope: !931)
!939 = !DILocation(line: 372, column: 5, scope: !931)
!940 = !DILocation(line: 373, column: 15, scope: !941)
!941 = distinct !DILexicalBlock(scope: !928, file: !1, line: 373, column: 14)
!942 = !DILocation(line: 373, column: 14, scope: !928)
!943 = !DILocation(line: 374, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !941, file: !1, line: 373, column: 35)
!945 = !DILocation(line: 375, column: 7, scope: !944)
!946 = !DILocation(line: 377, column: 5, scope: !915)
!947 = !DILocation(line: 378, column: 15, scope: !915)
!948 = !DILocation(line: 379, column: 12, scope: !899)
!949 = !DILocation(line: 379, column: 15, scope: !899)
!950 = !DILocation(line: 379, column: 3, scope: !915)
!951 = distinct !{!951, !913, !952}
!952 = !DILocation(line: 379, column: 21, scope: !899)
!953 = !DILocation(line: 0, scope: !944)
!954 = !DILocation(line: 381, column: 1, scope: !899)
!955 = distinct !DISubprogram(name: "luaL_gsub", scope: !1, file: !1, line: 340, type: !956, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !958)
!956 = !DISubroutineType(types: !957)
!957 = !{!209, !255, !209, !209, !209}
!958 = !{!959, !960, !961, !962, !963, !964, !965}
!959 = !DILocalVariable(name: "L", arg: 1, scope: !955, file: !1, line: 340, type: !255)
!960 = !DILocalVariable(name: "s", arg: 2, scope: !955, file: !1, line: 340, type: !209)
!961 = !DILocalVariable(name: "p", arg: 3, scope: !955, file: !1, line: 340, type: !209)
!962 = !DILocalVariable(name: "r", arg: 4, scope: !955, file: !1, line: 341, type: !209)
!963 = !DILocalVariable(name: "wild", scope: !955, file: !1, line: 342, type: !209)
!964 = !DILocalVariable(name: "l", scope: !955, file: !1, line: 343, type: !6)
!965 = !DILocalVariable(name: "b", scope: !955, file: !1, line: 344, type: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Buffer", file: !796, line: 134, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Buffer", file: !796, line: 129, size: 8384, elements: !968)
!968 = !{!969, !970, !971, !972}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !967, file: !796, line: 130, baseType: !90, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !967, file: !796, line: 131, baseType: !11, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !967, file: !796, line: 132, baseType: !255, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !967, file: !796, line: 133, baseType: !239, size: 8192, offset: 192)
!973 = !DILocation(line: 340, column: 46, scope: !955)
!974 = !DILocation(line: 340, column: 61, scope: !955)
!975 = !DILocation(line: 340, column: 76, scope: !955)
!976 = !DILocation(line: 341, column: 76, scope: !955)
!977 = !DILocation(line: 343, column: 14, scope: !955)
!978 = !DILocation(line: 343, column: 10, scope: !955)
!979 = !DILocation(line: 344, column: 3, scope: !955)
!980 = !DILocation(line: 344, column: 15, scope: !955)
!981 = !DILocalVariable(name: "L", arg: 1, scope: !982, file: !1, line: 472, type: !255)
!982 = distinct !DISubprogram(name: "luaL_buffinit", scope: !1, file: !1, line: 472, type: !983, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !986)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !255, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!986 = !{!981, !987}
!987 = !DILocalVariable(name: "B", arg: 2, scope: !982, file: !1, line: 472, type: !985)
!988 = !DILocation(line: 472, column: 43, scope: !982, inlinedAt: !989)
!989 = distinct !DILocation(line: 345, column: 3, scope: !955)
!990 = !DILocation(line: 472, column: 59, scope: !982, inlinedAt: !989)
!991 = !DILocation(line: 473, column: 6, scope: !982, inlinedAt: !989)
!992 = !DILocation(line: 473, column: 8, scope: !982, inlinedAt: !989)
!993 = !{!994, !299, i64 16}
!994 = !{!"luaL_Buffer", !299, i64 0, !296, i64 8, !299, i64 16, !297, i64 24}
!995 = !DILocation(line: 474, column: 10, scope: !982, inlinedAt: !989)
!996 = !DILocation(line: 474, column: 6, scope: !982, inlinedAt: !989)
!997 = !DILocation(line: 474, column: 8, scope: !982, inlinedAt: !989)
!998 = !{!994, !299, i64 0}
!999 = !DILocation(line: 475, column: 6, scope: !982, inlinedAt: !989)
!1000 = !DILocation(line: 475, column: 10, scope: !982, inlinedAt: !989)
!1001 = !{!994, !296, i64 8}
!1002 = !DILocation(line: 476, column: 1, scope: !982, inlinedAt: !989)
!1003 = !DILocation(line: 346, column: 18, scope: !955)
!1004 = !DILocation(line: 342, column: 15, scope: !955)
!1005 = !DILocation(line: 346, column: 32, scope: !955)
!1006 = !DILocation(line: 346, column: 3, scope: !955)
!1007 = !DILocation(line: 347, column: 33, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !955, file: !1, line: 346, column: 41)
!1009 = !DILocalVariable(name: "B", arg: 1, scope: !1010, file: !1, line: 436, type: !985)
!1010 = distinct !DISubprogram(name: "luaL_addlstring", scope: !1, file: !1, line: 436, type: !1011, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !985, !209, !6}
!1013 = !{!1009, !1014, !1015}
!1014 = !DILocalVariable(name: "s", arg: 2, scope: !1010, file: !1, line: 436, type: !209)
!1015 = !DILocalVariable(name: "l", arg: 3, scope: !1010, file: !1, line: 436, type: !6)
!1016 = !DILocation(line: 436, column: 47, scope: !1010, inlinedAt: !1017)
!1017 = distinct !DILocation(line: 347, column: 5, scope: !1008)
!1018 = !DILocation(line: 436, column: 62, scope: !1010, inlinedAt: !1017)
!1019 = !DILocation(line: 436, column: 72, scope: !1010, inlinedAt: !1017)
!1020 = !DILocation(line: 437, column: 3, scope: !1010, inlinedAt: !1017)
!1021 = !DILocation(line: 437, column: 11, scope: !1010, inlinedAt: !1017)
!1022 = !DILocation(line: 438, column: 5, scope: !1010, inlinedAt: !1017)
!1023 = distinct !{!1023, !1024, !1025}
!1024 = !DILocation(line: 437, column: 3, scope: !1010)
!1025 = !DILocation(line: 438, column: 5, scope: !1010)
!1026 = !DILocation(line: 439, column: 1, scope: !1010, inlinedAt: !1017)
!1027 = !DILocalVariable(name: "B", arg: 1, scope: !1028, file: !1, line: 442, type: !985)
