; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/lcltime_r.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/lcltime_r.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__tzinfo_struct = type { i32, i32, [2 x %struct.__tzrule_struct] }
%struct.__tzrule_struct = type { i8, i32, i32, i32, i32, i64, i64 }

@__month_lengths = external dso_local local_unnamed_addr constant [2 x [12 x i32]], align 16
@_daylight = external dso_local local_unnamed_addr global i32, align 4
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local %struct.tm* @localtime_r(i64* noalias, %struct.tm* noalias) local_unnamed_addr #0 !dbg !9 {
  %3 = tail call %struct.__tzinfo_struct* @__gettzinfo() #3, !dbg !72
  %4 = tail call %struct.tm* @gmtime_r(i64* %0, %struct.tm* %1) #3, !dbg !74
  %5 = getelementptr inbounds %struct.tm, %struct.tm* %4, i64 0, i32 5, !dbg !75
  %6 = load i32, i32* %5, align 4, !dbg !75, !tbaa !76
  %7 = add nsw i32 %6, 1900, !dbg !83
  %8 = and i32 %7, 3, !dbg !85
  %9 = icmp ne i32 %8, 0, !dbg !85
  %10 = srem i32 %7, 100, !dbg !85
  %11 = icmp eq i32 %10, 0, !dbg !85
  %12 = or i1 %9, %11, !dbg !85
  br i1 %12, label %13, label %16, !dbg !85


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/lcltime_r.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!9 = distinct !DISubprogram(name: "localtime_r", scope: !1, file: !1, line: 19, type: !10, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !37)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !31, !36}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !14, line: 31, size: 448, elements: !15)
!14 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !27}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !13, file: !14, line: 32, baseType: !4, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !13, file: !14, line: 33, baseType: !4, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !13, file: !14, line: 34, baseType: !4, size: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !13, file: !14, line: 35, baseType: !4, size: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !13, file: !14, line: 36, baseType: !4, size: 32, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !13, file: !14, line: 37, baseType: !4, size: 32, offset: 160)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !13, file: !14, line: 38, baseType: !4, size: 32, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !13, file: !14, line: 39, baseType: !4, size: 32, offset: 224)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !13, file: !14, line: 40, baseType: !4, size: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !13, file: !14, line: 41, baseType: !26, size: 64, offset: 320)
!26 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !13, file: !14, line: 42, baseType: !28, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !35, line: 34, baseType: !26)
!35 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !12)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !68}
!38 = !DILocalVariable(name: "tim_p", arg: 1, scope: !9, file: !1, line: 19, type: !31)
!39 = !DILocalVariable(name: "res", arg: 2, scope: !9, file: !1, line: 19, type: !36)
!40 = !DILocalVariable(name: "offset", scope: !9, file: !1, line: 23, type: !26)
!41 = !DILocalVariable(name: "hours", scope: !9, file: !1, line: 24, type: !4)
!42 = !DILocalVariable(name: "mins", scope: !9, file: !1, line: 24, type: !4)
!43 = !DILocalVariable(name: "secs", scope: !9, file: !1, line: 24, type: !4)
!44 = !DILocalVariable(name: "year", scope: !9, file: !1, line: 25, type: !4)
!45 = !DILocalVariable(name: "tz", scope: !9, file: !1, line: 26, type: !46)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzinfo_type", file: !49, line: 65, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzinfo_struct", file: !49, line: 60, size: 704, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__tznorth", scope: !50, file: !49, line: 62, baseType: !4, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__tzyear", scope: !50, file: !49, line: 63, baseType: !4, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__tzrule", scope: !50, file: !49, line: 64, baseType: !55, size: 640, offset: 64)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 640, elements: !66)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzrule_type", file: !49, line: 58, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzrule_struct", file: !49, line: 49, size: 320, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !57, file: !49, line: 51, baseType: !30, size: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !57, file: !49, line: 52, baseType: !4, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !57, file: !49, line: 53, baseType: !4, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !57, file: !49, line: 54, baseType: !4, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !57, file: !49, line: 55, baseType: !4, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !57, file: !49, line: 56, baseType: !34, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !57, file: !49, line: 57, baseType: !26, size: 64, offset: 256)
!66 = !{!67}
!67 = !DISubrange(count: 2)
!68 = !DILocalVariable(name: "ip", scope: !9, file: !1, line: 27, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!71 = !DILocation(line: 19, column: 1, scope: !9)
!72 = !DILocation(line: 26, column: 30, scope: !9)
!73 = !DILocation(line: 26, column: 25, scope: !9)
!74 = !DILocation(line: 29, column: 9, scope: !9)
!75 = !DILocation(line: 31, column: 15, scope: !9)
!76 = !{!77, !78, i64 20}
!77 = !{!"tm", !78, i64 0, !78, i64 4, !78, i64 8, !78, i64 12, !78, i64 16, !78, i64 20, !78, i64 24, !78, i64 28, !78, i64 32, !81, i64 40, !82, i64 48}
!78 = !{!"int", !79, i64 0}
!79 = !{!"omnipotent char", !80, i64 0}
!80 = !{!"Simple C/C++ TBAA"}
!81 = !{!"long", !79, i64 0}
!82 = !{!"any pointer", !79, i64 0}
!83 = !DILocation(line: 31, column: 23, scope: !9)
!84 = !DILocation(line: 25, column: 7, scope: !9)
!85 = !DILocation(line: 32, column: 24, scope: !9)
!86 = !DILocation(line: 32, column: 8, scope: !9)
!87 = !DILocation(line: 34, column: 3, scope: !9)
!88 = !DILocation(line: 35, column: 3, scope: !9)
!89 = !DILocation(line: 36, column: 7, scope: !90)
!90 = distinct !DILexicalBlock(scope: !9, file: !1, line: 36, column: 7)
!91 = !{!78, !78, i64 0}
!92 = !DILocation(line: 36, column: 7, scope: !9)
!93 = !DILocation(line: 38, column: 23, scope: !94)
!94 = distinct !DILexicalBlock(scope: !95, file: !1, line: 38, column: 11)
!95 = distinct !DILexicalBlock(scope: !90, file: !1, line: 37, column: 5)
!96 = !{!97, !78, i64 4}
!97 = !{!"__tzinfo_struct", !78, i64 0, !78, i64 4, !79, i64 8}
!98 = !DILocation(line: 38, column: 16, scope: !94)
!99 = !DILocation(line: 38, column: 32, scope: !94)
!100 = !DILocation(line: 38, column: 35, scope: !94)
!101 = !DILocation(line: 38, column: 11, scope: !95)
!102 = !DILocation(line: 39, column: 23, scope: !94)
!103 = !{!97, !78, i64 0}
!104 = !DILocation(line: 39, column: 19, scope: !94)
!105 = !DILocation(line: 0, scope: !94)
!106 = !{!81, !81, i64 0}
!107 = !{!108, !81, i64 24}
!108 = !{!"__tzrule_struct", !79, i64 0, !78, i64 4, !78, i64 8, !78, i64 12, !78, i64 16, !81, i64 24, !81, i64 32}
!109 = !DILocation(line: 41, column: 4, scope: !94)
!110 = !DILocation(line: 39, column: 7, scope: !94)
!111 = !DILocation(line: 39, column: 16, scope: !94)
!112 = !{!77, !78, i64 32}
!113 = !DILocation(line: 52, column: 23, scope: !9)
!114 = !DILocation(line: 50, column: 13, scope: !9)
!115 = !DILocation(line: 41, column: 32, scope: !94)
!116 = !DILocation(line: 41, column: 14, scope: !94)
!117 = !DILocation(line: 43, column: 4, scope: !94)
!118 = !DILocation(line: 0, scope: !90)
!119 = !DILocation(line: 43, column: 32, scope: !94)
!120 = !DILocation(line: 43, column: 14, scope: !94)
!121 = !DILocation(line: 51, column: 23, scope: !9)
!122 = !{!108, !81, i64 32}
!123 = !DILocation(line: 23, column: 8, scope: !9)
!124 = !DILocation(line: 54, column: 25, scope: !9)
!125 = !DILocation(line: 54, column: 11, scope: !9)
!126 = !DILocation(line: 24, column: 7, scope: !9)
!127 = !DILocation(line: 55, column: 19, scope: !9)
!128 = !DILocation(line: 57, column: 24, scope: !9)
!129 = !DILocation(line: 57, column: 10, scope: !9)
!130 = !DILocation(line: 24, column: 14, scope: !9)
!131 = !DILocation(line: 58, column: 24, scope: !9)
!132 = !DILocation(line: 58, column: 10, scope: !9)
!133 = !DILocation(line: 24, column: 20, scope: !9)
!134 = !DILocation(line: 60, column: 8, scope: !9)
!135 = !DILocation(line: 60, column: 15, scope: !9)
!136 = !{!77, !78, i64 0}
!137 = !DILocation(line: 61, column: 8, scope: !9)
!138 = !DILocation(line: 61, column: 15, scope: !9)
!139 = !{!77, !78, i64 4}
!140 = !DILocation(line: 62, column: 8, scope: !9)
!141 = !DILocation(line: 62, column: 16, scope: !9)
!142 = !{!77, !78, i64 8}
!143 = !DILocation(line: 64, column: 19, scope: !144)
