; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lctype.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lctype.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_ctype_T = type { i8*, i8* }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "numone", scope: !2, file: !3, line: 28, type: !17, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lctype.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !0}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "_C_ctype_locale", scope: !2, file: !3, line: 30, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_ctype_T", file: !10, line: 57, size: 128, elements: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !16}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !9, file: !10, line: 59, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !9, file: !10, line: 60, baseType: !13, size: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 2)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!24 = distinct !DISubprogram(name: "__ctype_load_locale", scope: !3, file: !3, line: 44, type: !25, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !300)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28, !13, !65, !13, !27}
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !10, line: 178, size: 3392, elements: !30)
!30 = !{!31, !36, !257, !266, !267, !268, !296, !297, !299}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !29, file: !10, line: 180, baseType: !32, size: 1792)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1792, elements: !33)
!33 = !{!34, !35}
!34 = !DISubrange(count: 7)
!35 = !DISubrange(count: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !29, file: !10, line: 181, baseType: !37, size: 64, offset: 1792)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!27, !40, !73, !253, !254}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !42, line: 569, size: 14912, elements: !43)
!42 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!43 = !{!44, !45, !124, !125, !126, !127, !131, !132, !133, !134, !138, !150, !151, !152, !154, !155, !156, !218, !238, !239, !244, !251}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !41, file: !42, line: 571, baseType: !27, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !41, file: !42, line: 576, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !42, line: 287, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !42, line: 181, size: 1408, elements: !49)
!49 = !{!50, !53, !54, !55, !57, !58, !63, !64, !66, !74, !78, !83, !87, !88, !89, !90, !94, !98, !99, !100, !102, !103, !107, !123}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !48, file: !42, line: 182, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !48, file: !42, line: 183, baseType: !27, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !48, file: !42, line: 184, baseType: !27, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !42, line: 185, baseType: !56, size: 16, offset: 128)
!56 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !48, file: !42, line: 186, baseType: !56, size: 16, offset: 144)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !48, file: !42, line: 187, baseType: !59, size: 128, offset: 192)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !42, line: 117, size: 128, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !59, file: !42, line: 118, baseType: !51, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !59, file: !42, line: 119, baseType: !27, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !48, file: !42, line: 188, baseType: !27, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !48, file: !42, line: 195, baseType: !65, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !48, file: !42, line: 197, baseType: !67, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !40, !65, !73, !27}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !71, line: 145, baseType: !72)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !48, file: !42, line: 199, baseType: !75, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!70, !40, !65, !13, !27}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !48, file: !42, line: 202, baseType: !79, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !40, !65, !82, !27}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !71, line: 114, baseType: !72)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !48, file: !42, line: 203, baseType: !84, size: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!27, !40, !65}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !48, file: !42, line: 206, baseType: !59, size: 128, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !48, file: !42, line: 207, baseType: !51, size: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !48, file: !42, line: 208, baseType: !27, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !48, file: !42, line: 211, baseType: !91, size: 24, offset: 928)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 3)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !48, file: !42, line: 212, baseType: !95, size: 8, offset: 952)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !48, file: !42, line: 215, baseType: !59, size: 128, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !48, file: !42, line: 218, baseType: !27, size: 32, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !42, line: 219, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !71, line: 44, baseType: !72)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !48, file: !42, line: 222, baseType: !40, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !48, file: !42, line: 226, baseType: !104, size: 32, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !71, line: 175, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !106, line: 12, baseType: !27)
!106 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !48, file: !42, line: 228, baseType: !108, size: 64, offset: 1312)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !71, line: 171, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 163, size: 64, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !109, file: !71, line: 165, baseType: !27, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !109, file: !71, line: 170, baseType: !113, size: 32, offset: 32)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !109, file: !71, line: 166, size: 32, elements: !114)
!114 = !{!115, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !113, file: !71, line: 168, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !117, line: 124, baseType: !118)
!117 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!118 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !113, file: !71, line: 169, baseType: !120, size: 32)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !48, file: !42, line: 229, baseType: !27, size: 32, offset: 1376)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !41, file: !42, line: 576, baseType: !46, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !41, file: !42, line: 576, baseType: !46, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !41, file: !42, line: 578, baseType: !27, size: 32, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !41, file: !42, line: 579, baseType: !128, size: 200, offset: 288)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 200, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 25)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !41, file: !42, line: 582, baseType: !27, size: 32, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !41, file: !42, line: 583, baseType: !28, size: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !41, file: !42, line: 585, baseType: !27, size: 32, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !41, file: !42, line: 587, baseType: !135, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !40}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !41, file: !42, line: 590, baseType: !139, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !42, line: 47, size: 256, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !140, file: !42, line: 49, baseType: !139, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !140, file: !42, line: 50, baseType: !27, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !140, file: !42, line: 50, baseType: !27, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !140, file: !42, line: 50, baseType: !27, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !140, file: !42, line: 50, baseType: !27, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !140, file: !42, line: 51, baseType: !148, size: 32, offset: 192)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 32, elements: !96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !42, line: 25, baseType: !118)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !41, file: !42, line: 591, baseType: !27, size: 32, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !41, file: !42, line: 592, baseType: !139, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !41, file: !42, line: 593, baseType: !153, size: 64, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !41, file: !42, line: 596, baseType: !27, size: 32, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !41, file: !42, line: 597, baseType: !73, size: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !41, file: !42, line: 632, baseType: !157, size: 2880, offset: 1152)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !41, file: !42, line: 599, size: 2880, elements: !158)
!158 = !{!159, !209}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !157, file: !42, line: 622, baseType: !160, size: 1728)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !157, file: !42, line: 601, size: 1728, elements: !161)
!161 = !{!162, !163, !164, !168, !180, !181, !183, !191, !192, !193, !194, !198, !202, !203, !204, !205, !206, !207, !208}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !160, file: !42, line: 603, baseType: !118, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !160, file: !42, line: 604, baseType: !73, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !160, file: !42, line: 605, baseType: !165, size: 208, offset: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 208, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 26)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !160, file: !42, line: 606, baseType: !169, size: 288, offset: 352)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !42, line: 55, size: 288, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !169, file: !42, line: 57, baseType: !27, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !169, file: !42, line: 58, baseType: !27, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !169, file: !42, line: 59, baseType: !27, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !169, file: !42, line: 60, baseType: !27, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !169, file: !42, line: 61, baseType: !27, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !169, file: !42, line: 62, baseType: !27, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !169, file: !42, line: 63, baseType: !27, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !169, file: !42, line: 64, baseType: !27, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !169, file: !42, line: 65, baseType: !27, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !160, file: !42, line: 607, baseType: !27, size: 32, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !160, file: !42, line: 608, baseType: !182, size: 64, offset: 704)
!182 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !160, file: !42, line: 609, baseType: !184, size: 112, offset: 768)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !42, line: 319, size: 112, elements: !185)
!185 = !{!186, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !184, file: !42, line: 320, baseType: !187, size: 48)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 48, elements: !92)
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !184, file: !42, line: 321, baseType: !187, size: 48, offset: 48)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !184, file: !42, line: 322, baseType: !188, size: 16, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !160, file: !42, line: 610, baseType: !108, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !160, file: !42, line: 611, baseType: !108, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !160, file: !42, line: 612, baseType: !108, size: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !160, file: !42, line: 613, baseType: !195, size: 64, offset: 1088)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !160, file: !42, line: 614, baseType: !199, size: 192, offset: 1152)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 24)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !160, file: !42, line: 615, baseType: !27, size: 32, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !160, file: !42, line: 616, baseType: !108, size: 64, offset: 1376)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !160, file: !42, line: 617, baseType: !108, size: 64, offset: 1440)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !160, file: !42, line: 618, baseType: !108, size: 64, offset: 1504)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !160, file: !42, line: 619, baseType: !108, size: 64, offset: 1568)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !160, file: !42, line: 620, baseType: !108, size: 64, offset: 1632)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !160, file: !42, line: 621, baseType: !27, size: 32, offset: 1696)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !157, file: !42, line: 631, baseType: !210, size: 2880)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !157, file: !42, line: 626, size: 2880, elements: !211)
!211 = !{!212, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !210, file: !42, line: 629, baseType: !213, size: 1920)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1920, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 30)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !210, file: !42, line: 630, baseType: !217, size: 960, offset: 1920)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 960, elements: !214)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !41, file: !42, line: 636, baseType: !219, size: 64, offset: 4032)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !42, line: 93, size: 6336, elements: !221)
!221 = !{!222, !223, !224, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !220, file: !42, line: 94, baseType: !219, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !220, file: !42, line: 95, baseType: !27, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !220, file: !42, line: 97, baseType: !225, size: 2048, offset: 128)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 2048, elements: !229)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null}
!229 = !{!35}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !220, file: !42, line: 98, baseType: !231, size: 4160, offset: 2176)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !42, line: 74, size: 4160, elements: !232)
!232 = !{!233, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !231, file: !42, line: 75, baseType: !234, size: 2048)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !229)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !231, file: !42, line: 76, baseType: !234, size: 2048, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !231, file: !42, line: 78, baseType: !149, size: 32, offset: 4096)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !231, file: !42, line: 81, baseType: !149, size: 32, offset: 4128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !41, file: !42, line: 637, baseType: !220, size: 6336, offset: 4096)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !41, file: !42, line: 641, baseType: !240, size: 64, offset: 10432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !27}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !41, file: !42, line: 646, baseType: !245, size: 192, offset: 10496)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !42, line: 291, size: 192, elements: !246)
!246 = !{!247, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !245, file: !42, line: 293, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !245, file: !42, line: 294, baseType: !27, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !245, file: !42, line: 295, baseType: !46, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !41, file: !42, line: 648, baseType: !252, size: 4224, offset: 10688)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 4224, elements: !92)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !117, line: 83, baseType: !27)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !256, line: 86, baseType: !108)
!256 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !29, file: !10, line: 183, baseType: !258, size: 64, offset: 1856)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!27, !40, !261, !13, !262, !254}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !263, line: 40, baseType: !264)
!263 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !71, line: 129, baseType: !265)
!265 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !29, file: !10, line: 185, baseType: !27, size: 32, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !29, file: !10, line: 186, baseType: !73, size: 64, offset: 1984)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !29, file: !10, line: 187, baseType: !269, size: 768, offset: 2048)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !270, line: 42, size: 768, elements: !271)
!270 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !269, file: !270, line: 44, baseType: !73, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !269, file: !270, line: 45, baseType: !73, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !269, file: !270, line: 46, baseType: !73, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !269, file: !270, line: 47, baseType: !73, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !269, file: !270, line: 48, baseType: !73, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !269, file: !270, line: 49, baseType: !73, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !269, file: !270, line: 50, baseType: !73, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !269, file: !270, line: 51, baseType: !73, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !269, file: !270, line: 52, baseType: !73, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !269, file: !270, line: 53, baseType: !73, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !269, file: !270, line: 54, baseType: !15, size: 8, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !269, file: !270, line: 55, baseType: !15, size: 8, offset: 648)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !269, file: !270, line: 56, baseType: !15, size: 8, offset: 656)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !269, file: !270, line: 57, baseType: !15, size: 8, offset: 664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !269, file: !270, line: 58, baseType: !15, size: 8, offset: 672)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !269, file: !270, line: 59, baseType: !15, size: 8, offset: 680)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !269, file: !270, line: 60, baseType: !15, size: 8, offset: 688)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !269, file: !270, line: 61, baseType: !15, size: 8, offset: 696)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !269, file: !270, line: 62, baseType: !15, size: 8, offset: 704)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !269, file: !270, line: 63, baseType: !15, size: 8, offset: 712)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !269, file: !270, line: 64, baseType: !15, size: 8, offset: 720)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !269, file: !270, line: 65, baseType: !15, size: 8, offset: 728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !269, file: !270, line: 66, baseType: !15, size: 8, offset: 736)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !269, file: !270, line: 67, baseType: !15, size: 8, offset: 744)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !29, file: !10, line: 189, baseType: !17, size: 16, offset: 2816)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !29, file: !10, line: 190, baseType: !298, size: 256, offset: 2832)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, elements: !229)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !29, file: !10, line: 191, baseType: !298, size: 256, offset: 3088)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308}
!301 = !DILocalVariable(name: "locale", arg: 1, scope: !24, file: !3, line: 44, type: !28)
!302 = !DILocalVariable(name: "name", arg: 2, scope: !24, file: !3, line: 44, type: !13)
!303 = !DILocalVariable(name: "f_wctomb", arg: 3, scope: !24, file: !3, line: 45, type: !65)
!304 = !DILocalVariable(name: "charset", arg: 4, scope: !24, file: !3, line: 45, type: !13)
!305 = !DILocalVariable(name: "mb_cur_max", arg: 5, scope: !24, file: !3, line: 45, type: !27)
!306 = !DILocalVariable(name: "ret", scope: !24, file: !3, line: 47, type: !27)
!307 = !DILocalVariable(name: "ct", scope: !24, file: !3, line: 48, type: !9)
!308 = !DILocalVariable(name: "bufp", scope: !24, file: !3, line: 49, type: !73)
!309 = !DILocation(line: 44, column: 41, scope: !24)
!310 = !DILocation(line: 44, column: 61, scope: !24)
!311 = !DILocation(line: 45, column: 14, scope: !24)
!312 = !DILocation(line: 45, column: 36, scope: !24)
!313 = !DILocation(line: 45, column: 49, scope: !24)
!314 = !DILocation(line: 49, column: 9, scope: !24)
!315 = !DILocation(line: 86, column: 3, scope: !24)
