; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldebug.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldebug.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }
%struct.Table = type { %union.GCObject*, i8, i8, i8, i8, %struct.Table*, %struct.lua_TValue*, %struct.Node*, %struct.Node*, %union.GCObject*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !56)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldebug.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !45, !50}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 150, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lopcodes.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!7 = !DIEnumerator(name: "OP_MOVE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "OP_LOADK", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "OP_LOADBOOL", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "OP_LOADNIL", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "OP_GETUPVAL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OP_GETGLOBAL", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "OP_GETTABLE", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "OP_SETGLOBAL", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "OP_SETUPVAL", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "OP_SETTABLE", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "OP_NEWTABLE", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "OP_SELF", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "OP_ADD", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "OP_SUB", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "OP_MUL", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "OP_DIV", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "OP_MOD", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "OP_POW", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "OP_UNM", value: 18, isUnsigned: true)
!26 = !DIEnumerator(name: "OP_NOT", value: 19, isUnsigned: true)
!27 = !DIEnumerator(name: "OP_LEN", value: 20, isUnsigned: true)
!28 = !DIEnumerator(name: "OP_CONCAT", value: 21, isUnsigned: true)
!29 = !DIEnumerator(name: "OP_JMP", value: 22, isUnsigned: true)
!30 = !DIEnumerator(name: "OP_EQ", value: 23, isUnsigned: true)
!31 = !DIEnumerator(name: "OP_LT", value: 24, isUnsigned: true)
!32 = !DIEnumerator(name: "OP_LE", value: 25, isUnsigned: true)
!33 = !DIEnumerator(name: "OP_TEST", value: 26, isUnsigned: true)
!34 = !DIEnumerator(name: "OP_TESTSET", value: 27, isUnsigned: true)
!35 = !DIEnumerator(name: "OP_CALL", value: 28, isUnsigned: true)
!36 = !DIEnumerator(name: "OP_TAILCALL", value: 29, isUnsigned: true)
!37 = !DIEnumerator(name: "OP_RETURN", value: 30, isUnsigned: true)
!38 = !DIEnumerator(name: "OP_FORLOOP", value: 31, isUnsigned: true)
!39 = !DIEnumerator(name: "OP_FORPREP", value: 32, isUnsigned: true)
!40 = !DIEnumerator(name: "OP_TFORLOOP", value: 33, isUnsigned: true)
!41 = !DIEnumerator(name: "OP_SETLIST", value: 34, isUnsigned: true)
!42 = !DIEnumerator(name: "OP_CLOSE", value: 35, isUnsigned: true)
!43 = !DIEnumerator(name: "OP_CLOSURE", value: 36, isUnsigned: true)
!44 = !DIEnumerator(name: "OP_VARARG", value: 37, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpMode", file: !4, line: 31, baseType: !5, size: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "iABC", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "iABx", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "iAsBx", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpArgMask", file: !4, line: 245, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "OpArgN", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "OpArgU", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "OpArgR", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "OpArgK", value: 3, isUnsigned: true)
!56 = !{!57, !58, !61, !62, !225, !390, !279, !122, !307, !45, !50}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !59, line: 27, baseType: !60)
!59 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !64, line: 36, baseType: !65)
!64 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !66, line: 136, size: 1472, elements: !67)
!66 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !{!68, !75, !101, !160, !386, !387, !388, !389}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !65, file: !66, line: 137, baseType: !69, size: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !64, line: 51, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !64, line: 49, size: 128, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !64, line: 50, baseType: !62, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !70, file: !64, line: 50, baseType: !58, size: 8, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !70, file: !64, line: 50, baseType: !58, size: 8, offset: 72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !65, file: !66, line: 138, baseType: !76, size: 192)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !64, line: 199, size: 192, elements: !77)
!77 = !{!78, !87}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !76, file: !64, line: 200, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !59, line: 47, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !59, line: 47, size: 64, elements: !81)
!81 = !{!82, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !59, line: 47, baseType: !83, size: 64)
!83 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !80, file: !59, line: 47, baseType: !57, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !80, file: !59, line: 47, baseType: !86, size: 64)
!86 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !76, file: !64, line: 206, baseType: !88, size: 192)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !64, line: 201, size: 192, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !64, line: 202, baseType: !62, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !88, file: !64, line: 202, baseType: !58, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !88, file: !64, line: 202, baseType: !58, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !88, file: !64, line: 203, baseType: !58, size: 8, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !88, file: !64, line: 204, baseType: !5, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !64, line: 205, baseType: !96, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 40, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !99, line: 129, baseType: !100)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !65, file: !66, line: 139, baseType: !102, size: 320)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !64, line: 215, size: 320, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !102, file: !64, line: 216, baseType: !79, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !102, file: !64, line: 222, baseType: !106, size: 320)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !102, file: !64, line: 217, size: 320, elements: !107)
!107 = !{!108, !109, !110, !111, !158, !159}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !64, line: 218, baseType: !62, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !106, file: !64, line: 218, baseType: !58, size: 8, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !106, file: !64, line: 218, baseType: !58, size: 8, offset: 72)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !106, file: !64, line: 219, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !64, line: 338, size: 512, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !137, !155, !156, !157}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !64, line: 339, baseType: !62, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !113, file: !64, line: 339, baseType: !58, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !113, file: !64, line: 339, baseType: !58, size: 8, offset: 72)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !64, line: 340, baseType: !58, size: 8, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !113, file: !64, line: 341, baseType: !58, size: 8, offset: 88)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !113, file: !64, line: 342, baseType: !112, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !113, file: !64, line: 343, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !64, line: 75, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !64, line: 73, size: 128, elements: !125)
!125 = !{!126, !136}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !124, file: !64, line: 74, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !64, line: 64, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 59, size: 64, elements: !129)
!129 = !{!130, !131, !132, !135}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !128, file: !64, line: 60, baseType: !62, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !128, file: !64, line: 61, baseType: !57, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !128, file: !64, line: 62, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !134, line: 99, baseType: !83)
!134 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !128, file: !64, line: 63, baseType: !61, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !124, file: !64, line: 74, baseType: !61, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !113, file: !64, line: 344, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !64, line: 335, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !64, line: 332, size: 320, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !140, file: !64, line: 333, baseType: !123, size: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !140, file: !64, line: 334, baseType: !144, size: 192, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !64, line: 329, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !64, line: 323, size: 192, elements: !146)
!146 = !{!147, !154}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !145, file: !64, line: 327, baseType: !148, size: 192)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !64, line: 324, size: 192, elements: !149)
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !148, file: !64, line: 325, baseType: !127, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !148, file: !64, line: 325, baseType: !61, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !64, line: 326, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !145, file: !64, line: 328, baseType: !123, size: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !113, file: !64, line: 345, baseType: !138, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !113, file: !64, line: 346, baseType: !62, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !113, file: !64, line: 347, baseType: !61, size: 32, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !106, file: !64, line: 220, baseType: !112, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !64, line: 221, baseType: !96, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !65, file: !66, line: 140, baseType: !161, size: 448)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !64, line: 309, size: 448, elements: !162)
!162 = !{!163, !335}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !161, file: !64, line: 310, baseType: !164, size: 448)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !64, line: 299, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !64, line: 295, size: 448, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !331}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !64, line: 296, baseType: !62, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 72)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 80)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !165, file: !64, line: 296, baseType: !58, size: 8, offset: 88)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !165, file: !64, line: 296, baseType: !62, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !165, file: !64, line: 296, baseType: !112, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !165, file: !64, line: 297, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !134, line: 52, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!61, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !134, line: 50, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !66, line: 100, size: 1472, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !189, !190, !268, !282, !283, !284, !285, !286, !287, !288, !289, !291, !292, !293, !294, !295, !296, !321, !322, !323, !324, !325, !328}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !66, line: 101, baseType: !62, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !181, file: !66, line: 101, baseType: !58, size: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !181, file: !66, line: 101, baseType: !58, size: 8, offset: 72)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !181, file: !66, line: 102, baseType: !58, size: 8, offset: 80)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !181, file: !66, line: 103, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !64, line: 193, baseType: !122)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !181, file: !66, line: 104, baseType: !188, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !181, file: !66, line: 105, baseType: !191, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !66, line: 94, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !66, line: 68, size: 3456, elements: !194)
!194 = !{!195, !204, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !229, !231, !232, !233, !234, !235, !236, !237, !238, !240, !258, !262}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !193, file: !66, line: 69, baseType: !196, size: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !66, line: 42, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !66, line: 38, size: 128, elements: !198)
!198 = !{!199, !201, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !197, file: !66, line: 39, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !197, file: !66, line: 40, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !59, line: 18, baseType: !5)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !66, line: 41, baseType: !61, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !193, file: !66, line: 70, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !134, line: 66, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!57, !57, !57, !96, !96}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !193, file: !66, line: 71, baseType: !57, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !193, file: !66, line: 72, baseType: !58, size: 8, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !193, file: !66, line: 73, baseType: !58, size: 8, offset: 264)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !193, file: !66, line: 74, baseType: !61, size: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !193, file: !66, line: 75, baseType: !62, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !193, file: !66, line: 76, baseType: !200, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !193, file: !66, line: 77, baseType: !62, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !193, file: !66, line: 78, baseType: !62, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !193, file: !66, line: 79, baseType: !62, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !193, file: !66, line: 80, baseType: !62, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !193, file: !66, line: 81, baseType: !220, size: 192, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !221, line: 28, baseType: !222)
!221 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !221, line: 24, size: 192, elements: !223)
!223 = !{!224, !227, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !222, file: !221, line: 25, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !222, file: !221, line: 26, baseType: !96, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !222, file: !221, line: 27, baseType: !96, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !193, file: !66, line: 82, baseType: !230, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !59, line: 20, baseType: !96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !193, file: !66, line: 83, baseType: !230, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !193, file: !66, line: 84, baseType: !230, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !193, file: !66, line: 85, baseType: !230, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !193, file: !66, line: 86, baseType: !61, size: 32, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !193, file: !66, line: 87, baseType: !61, size: 32, offset: 1184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !193, file: !66, line: 88, baseType: !175, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !193, file: !66, line: 89, baseType: !123, size: 128, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !193, file: !66, line: 90, baseType: !239, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !193, file: !66, line: 91, baseType: !241, size: 320, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !64, line: 284, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !64, line: 274, size: 320, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !64, line: 275, baseType: !62, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !242, file: !64, line: 275, baseType: !58, size: 8, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !242, file: !64, line: 275, baseType: !58, size: 8, offset: 72)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !242, file: !64, line: 276, baseType: !122, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !242, file: !64, line: 283, baseType: !249, size: 128, offset: 192)
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !64, line: 277, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !249, file: !64, line: 278, baseType: !123, size: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !249, file: !64, line: 282, baseType: !253, size: 128)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !249, file: !64, line: 279, size: 128, elements: !254)
!254 = !{!255, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !64, line: 280, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !64, line: 281, baseType: !256, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !193, file: !66, line: 92, baseType: !259, size: 576, offset: 1792)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 576, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 9)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !193, file: !66, line: 93, baseType: !263, size: 1088, offset: 2368)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1088, elements: !266)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !64, line: 207, baseType: !76)
!266 = !{!267}
!267 = !DISubrange(count: 17)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !181, file: !66, line: 106, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !66, line: 55, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !66, line: 48, size: 320, elements: !272)
!272 = !{!273, !274, !275, !276, !280, !281}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !271, file: !66, line: 49, baseType: !188, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !271, file: !66, line: 50, baseType: !188, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !271, file: !66, line: 51, baseType: !188, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !271, file: !66, line: 52, baseType: !277, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !59, line: 88, baseType: !202)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !271, file: !66, line: 53, baseType: !61, size: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !271, file: !66, line: 54, baseType: !61, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !181, file: !66, line: 107, baseType: !277, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !181, file: !66, line: 108, baseType: !188, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !181, file: !66, line: 109, baseType: !188, size: 64, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !181, file: !66, line: 110, baseType: !269, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !181, file: !66, line: 111, baseType: !269, size: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !181, file: !66, line: 112, baseType: !61, size: 32, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !181, file: !66, line: 113, baseType: !61, size: 32, offset: 736)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !181, file: !66, line: 114, baseType: !290, size: 16, offset: 768)
!290 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !181, file: !66, line: 115, baseType: !290, size: 16, offset: 784)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !181, file: !66, line: 116, baseType: !58, size: 8, offset: 800)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !181, file: !66, line: 117, baseType: !58, size: 8, offset: 808)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !181, file: !66, line: 118, baseType: !61, size: 32, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !181, file: !66, line: 119, baseType: !61, size: 32, offset: 864)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !181, file: !66, line: 120, baseType: !297, size: 64, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !134, line: 330, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !179, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !134, line: 326, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !134, line: 346, size: 960, elements: !304)
!304 = !{!305, !306, !309, !310, !311, !312, !313, !314, !315, !316, !320}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !303, file: !134, line: 347, baseType: !61, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !134, line: 348, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !303, file: !134, line: 349, baseType: !307, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !303, file: !134, line: 350, baseType: !307, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !303, file: !134, line: 351, baseType: !307, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !303, file: !134, line: 352, baseType: !61, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !303, file: !134, line: 353, baseType: !61, size: 32, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !303, file: !134, line: 354, baseType: !61, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !303, file: !134, line: 355, baseType: !61, size: 32, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !303, file: !134, line: 356, baseType: !317, size: 480, offset: 448)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 480, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 60)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !303, file: !134, line: 358, baseType: !61, size: 32, offset: 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !181, file: !66, line: 121, baseType: !123, size: 128, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !181, file: !66, line: 122, baseType: !123, size: 128, offset: 1088)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !181, file: !66, line: 123, baseType: !62, size: 64, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !181, file: !66, line: 124, baseType: !62, size: 64, offset: 1280)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !181, file: !66, line: 125, baseType: !326, size: 64, offset: 1344)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !66, line: 18, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !181, file: !66, line: 126, baseType: !329, size: 64, offset: 1408)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !330, line: 49, baseType: !86)
!330 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !165, file: !64, line: 298, baseType: !332, size: 128, offset: 320)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !161, file: !64, line: 311, baseType: !336, size: 384)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !64, line: 306, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !64, line: 302, size: 384, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !383}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !64, line: 303, baseType: !62, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 72)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 80)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !337, file: !64, line: 303, baseType: !58, size: 8, offset: 88)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !337, file: !64, line: 303, baseType: !62, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !337, file: !64, line: 303, baseType: !112, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !337, file: !64, line: 304, baseType: !347, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !64, line: 231, size: 960, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !356, !358, !360, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !64, line: 232, baseType: !62, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !348, file: !64, line: 232, baseType: !58, size: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !348, file: !64, line: 232, baseType: !58, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !348, file: !64, line: 233, baseType: !122, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !348, file: !64, line: 234, baseType: !355, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !348, file: !64, line: 235, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !348, file: !64, line: 236, baseType: !359, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !348, file: !64, line: 237, baseType: !361, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !64, line: 262, size: 128, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !362, file: !64, line: 263, baseType: !264, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !362, file: !64, line: 264, baseType: !61, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !362, file: !64, line: 265, baseType: !61, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !348, file: !64, line: 238, baseType: !368, size: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !348, file: !64, line: 239, baseType: !264, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !348, file: !64, line: 240, baseType: !61, size: 32, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !348, file: !64, line: 241, baseType: !61, size: 32, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !348, file: !64, line: 242, baseType: !61, size: 32, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !348, file: !64, line: 243, baseType: !61, size: 32, offset: 672)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !348, file: !64, line: 244, baseType: !61, size: 32, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !348, file: !64, line: 245, baseType: !61, size: 32, offset: 736)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !348, file: !64, line: 246, baseType: !61, size: 32, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !348, file: !64, line: 247, baseType: !61, size: 32, offset: 800)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !348, file: !64, line: 248, baseType: !62, size: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !348, file: !64, line: 249, baseType: !58, size: 8, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !348, file: !64, line: 250, baseType: !58, size: 8, offset: 904)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !348, file: !64, line: 251, baseType: !58, size: 8, offset: 912)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !348, file: !64, line: 252, baseType: !58, size: 8, offset: 920)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !337, file: !64, line: 305, baseType: !384, size: 64, offset: 320)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !333)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !65, file: !66, line: 141, baseType: !113, size: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !65, file: !66, line: 142, baseType: !348, size: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !65, file: !66, line: 143, baseType: !242, size: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !65, file: !66, line: 144, baseType: !181, size: 1472)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpCode", file: !4, line: 208, baseType: !3)
!391 = !{i32 2, !"Dwarf Version", i32 4}
!392 = !{i32 2, !"Debug Info Version", i32 3}
!393 = !{i32 1, !"wchar_size", i32 4}
!394 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!395 = distinct !DISubprogram(name: "lua_sethook", scope: !1, file: !1, line: 56, type: !396, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!61, !179, !297, !61, !61}
!398 = !{!399, !400, !401, !402}
!399 = !DILocalVariable(name: "L", arg: 1, scope: !395, file: !1, line: 56, type: !179)
!400 = !DILocalVariable(name: "func", arg: 2, scope: !395, file: !1, line: 56, type: !297)
!401 = !DILocalVariable(name: "mask", arg: 3, scope: !395, file: !1, line: 56, type: !61)
!402 = !DILocalVariable(name: "count", arg: 4, scope: !395, file: !1, line: 56, type: !61)
!403 = !DILocation(line: 56, column: 37, scope: !395)
!404 = !DILocation(line: 56, column: 49, scope: !395)
!405 = !DILocation(line: 56, column: 59, scope: !395)
!406 = !DILocation(line: 56, column: 69, scope: !395)
!407 = !DILocation(line: 57, column: 12, scope: !408)
!408 = distinct !DILexicalBlock(scope: !395, file: !1, line: 57, column: 7)
!409 = !DILocation(line: 57, column: 28, scope: !408)
!410 = !DILocation(line: 57, column: 20, scope: !408)
!411 = !DILocation(line: 61, column: 6, scope: !395)
!412 = !DILocation(line: 61, column: 11, scope: !395)
!413 = !{!414, !415, i64 112}
!414 = !{!"lua_State", !415, i64 0, !416, i64 8, !416, i64 9, !416, i64 10, !415, i64 16, !415, i64 24, !415, i64 32, !415, i64 40, !415, i64 48, !415, i64 56, !415, i64 64, !415, i64 72, !415, i64 80, !418, i64 88, !418, i64 92, !419, i64 96, !419, i64 98, !416, i64 100, !416, i64 101, !418, i64 104, !418, i64 108, !415, i64 112, !420, i64 120, !420, i64 136, !415, i64 152, !415, i64 160, !415, i64 168, !421, i64 176}
!415 = !{!"any pointer", !416, i64 0}
!416 = !{!"omnipotent char", !417, i64 0}
!417 = !{!"Simple C/C++ TBAA"}
!418 = !{!"int", !416, i64 0}
!419 = !{!"short", !416, i64 0}
!420 = !{!"lua_TValue", !416, i64 0, !418, i64 8}
!421 = !{!"long", !416, i64 0}
!422 = !DILocation(line: 62, column: 6, scope: !395)
!423 = !DILocation(line: 62, column: 20, scope: !395)
!424 = !{!414, !418, i64 104}
!425 = !DILocation(line: 63, column: 3, scope: !395)
!426 = !{!414, !418, i64 108}
!427 = !DILocation(line: 64, column: 17, scope: !395)
!428 = !DILocation(line: 64, column: 6, scope: !395)
!429 = !DILocation(line: 64, column: 15, scope: !395)
!430 = !{!414, !416, i64 100}
!431 = !DILocation(line: 65, column: 3, scope: !395)
!432 = distinct !DISubprogram(name: "lua_gethook", scope: !1, file: !1, line: 69, type: !433, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !435)
!433 = !DISubroutineType(types: !434)
!434 = !{!297, !179}
!435 = !{!436}
!436 = !DILocalVariable(name: "L", arg: 1, scope: !432, file: !1, line: 69, type: !179)
!437 = !DILocation(line: 69, column: 42, scope: !432)
!438 = !DILocation(line: 70, column: 13, scope: !432)
!439 = !DILocation(line: 70, column: 3, scope: !432)
!440 = distinct !DISubprogram(name: "lua_gethookmask", scope: !1, file: !1, line: 74, type: !177, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !441)
!441 = !{!442}
!442 = !DILocalVariable(name: "L", arg: 1, scope: !440, file: !1, line: 74, type: !179)
!443 = !DILocation(line: 74, column: 41, scope: !440)
!444 = !DILocation(line: 75, column: 13, scope: !440)
!445 = !DILocation(line: 75, column: 10, scope: !440)
!446 = !DILocation(line: 75, column: 3, scope: !440)
!447 = distinct !DISubprogram(name: "lua_gethookcount", scope: !1, file: !1, line: 79, type: !177, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !448)
!448 = !{!449}
!449 = !DILocalVariable(name: "L", arg: 1, scope: !447, file: !1, line: 79, type: !179)
!450 = !DILocation(line: 79, column: 42, scope: !447)
!451 = !DILocation(line: 80, column: 13, scope: !447)
!452 = !DILocation(line: 80, column: 3, scope: !447)
!453 = distinct !DISubprogram(name: "lua_getstack", scope: !1, file: !1, line: 84, type: !454, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!61, !179, !61, !301}
!456 = !{!457, !458, !459, !460, !461}
!457 = !DILocalVariable(name: "L", arg: 1, scope: !453, file: !1, line: 84, type: !179)
!458 = !DILocalVariable(name: "level", arg: 2, scope: !453, file: !1, line: 84, type: !61)
!459 = !DILocalVariable(name: "ar", arg: 3, scope: !453, file: !1, line: 84, type: !301)
!460 = !DILocalVariable(name: "status", scope: !453, file: !1, line: 85, type: !61)
!461 = !DILocalVariable(name: "ci", scope: !453, file: !1, line: 86, type: !269)
!462 = !DILocation(line: 84, column: 38, scope: !453)
!463 = !DILocation(line: 84, column: 45, scope: !453)
!464 = !DILocation(line: 84, column: 63, scope: !453)
!465 = !DILocation(line: 88, column: 16, scope: !466)
!466 = distinct !DILexicalBlock(scope: !453, file: !1, line: 88, column: 3)
!467 = !{!414, !415, i64 40}
!468 = !DILocation(line: 86, column: 13, scope: !453)
!469 = !DILocation(line: 88, column: 26, scope: !470)
!470 = distinct !DILexicalBlock(scope: !466, file: !1, line: 88, column: 3)
!471 = !DILocation(line: 88, column: 30, scope: !470)
!472 = !{!414, !415, i64 80}
!473 = !DILocation(line: 88, column: 36, scope: !470)
!474 = !DILocation(line: 88, column: 3, scope: !466)
!475 = !DILocation(line: 89, column: 10, scope: !476)
!476 = distinct !DILexicalBlock(scope: !470, file: !1, line: 88, column: 56)
!477 = !DILocation(line: 90, column: 9, scope: !478)
!478 = distinct !DILexicalBlock(scope: !476, file: !1, line: 90, column: 9)
!479 = !{!480, !415, i64 8}
!480 = !{!"CallInfo", !415, i64 0, !415, i64 8, !415, i64 16, !415, i64 24, !418, i64 32, !418, i64 36}
!481 = !{!416, !416, i64 0}
!482 = !DILocation(line: 90, column: 9, scope: !476)
!483 = !DILocation(line: 91, column: 20, scope: !478)
!484 = !{!480, !418, i64 36}
!485 = !DILocation(line: 91, column: 13, scope: !478)
!486 = !DILocation(line: 91, column: 7, scope: !478)
!487 = !DILocation(line: 0, scope: !478)
!488 = !DILocation(line: 88, column: 52, scope: !470)
!489 = distinct !{!489, !474, !490}
!490 = !DILocation(line: 92, column: 3, scope: !466)
!491 = !DILocation(line: 0, scope: !470)
!492 = !DILocation(line: 93, column: 13, scope: !493)
!493 = distinct !DILexicalBlock(scope: !453, file: !1, line: 93, column: 7)
!494 = !DILocation(line: 93, column: 18, scope: !493)
!495 = !DILocation(line: 93, column: 29, scope: !493)
!496 = !DILocation(line: 93, column: 24, scope: !493)
!497 = !DILocation(line: 93, column: 7, scope: !453)
!498 = !DILocation(line: 85, column: 7, scope: !453)
!499 = !DILocation(line: 95, column: 16, scope: !500)
!500 = distinct !DILexicalBlock(scope: !493, file: !1, line: 93, column: 38)
!501 = !DILocation(line: 95, column: 9, scope: !500)
!502 = !DILocation(line: 95, column: 14, scope: !500)
!503 = !{!504, !418, i64 116}
!504 = !{!"lua_Debug", !418, i64 0, !415, i64 8, !415, i64 16, !415, i64 24, !415, i64 32, !418, i64 40, !418, i64 44, !418, i64 48, !418, i64 52, !416, i64 56, !418, i64 116}
!505 = !DILocation(line: 96, column: 3, scope: !500)
!506 = !DILocation(line: 99, column: 9, scope: !507)
!507 = distinct !DILexicalBlock(scope: !508, file: !1, line: 97, column: 23)
!508 = distinct !DILexicalBlock(scope: !493, file: !1, line: 97, column: 12)
!509 = !DILocation(line: 99, column: 14, scope: !507)
!510 = !DILocation(line: 100, column: 3, scope: !507)
!511 = !DILocation(line: 0, scope: !508)
!512 = !DILocation(line: 103, column: 3, scope: !453)
!513 = distinct !DISubprogram(name: "lua_getlocal", scope: !1, file: !1, line: 127, type: !514, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !518)
!514 = !DISubroutineType(types: !515)
!515 = !{!307, !179, !516, !61}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!518 = !{!519, !520, !521, !522, !523}
!519 = !DILocalVariable(name: "L", arg: 1, scope: !513, file: !1, line: 127, type: !179)
!520 = !DILocalVariable(name: "ar", arg: 2, scope: !513, file: !1, line: 127, type: !516)
!521 = !DILocalVariable(name: "n", arg: 3, scope: !513, file: !1, line: 127, type: !61)
!522 = !DILocalVariable(name: "ci", scope: !513, file: !1, line: 128, type: !269)
!523 = !DILocalVariable(name: "name", scope: !513, file: !1, line: 129, type: !307)
!524 = !DILocation(line: 127, column: 46, scope: !513)
!525 = !DILocation(line: 127, column: 66, scope: !513)
!526 = !DILocation(line: 127, column: 74, scope: !513)
!527 = !DILocation(line: 128, column: 21, scope: !513)
!528 = !DILocation(line: 128, column: 35, scope: !513)
!529 = !DILocation(line: 128, column: 29, scope: !513)
!530 = !DILocation(line: 128, column: 13, scope: !513)
!531 = !DILocalVariable(name: "L", arg: 1, scope: !532, file: !1, line: 112, type: !179)
!532 = distinct !DISubprogram(name: "findlocal", scope: !1, file: !1, line: 112, type: !533, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!307, !179, !269, !61}
!535 = !{!531, !536, !537, !538, !539, !542}
!536 = !DILocalVariable(name: "ci", arg: 2, scope: !532, file: !1, line: 112, type: !269)
!537 = !DILocalVariable(name: "n", arg: 3, scope: !532, file: !1, line: 112, type: !61)
!538 = !DILocalVariable(name: "name", scope: !532, file: !1, line: 113, type: !307)
!539 = !DILocalVariable(name: "fp", scope: !532, file: !1, line: 114, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Proto", file: !64, line: 253, baseType: !348)
!542 = !DILocalVariable(name: "limit", scope: !543, file: !1, line: 118, type: !188)
!543 = distinct !DILexicalBlock(scope: !544, file: !1, line: 117, column: 8)
!544 = distinct !DILexicalBlock(scope: !532, file: !1, line: 115, column: 7)
!545 = !DILocation(line: 112, column: 42, scope: !532, inlinedAt: !546)
!546 = distinct !DILocation(line: 129, column: 22, scope: !513)
!547 = !DILocation(line: 112, column: 55, scope: !532, inlinedAt: !546)
!548 = !DILocation(line: 112, column: 63, scope: !532, inlinedAt: !546)
!549 = !DILocalVariable(name: "ci", arg: 1, scope: !550, file: !1, line: 107, type: !269)
!550 = distinct !DISubprogram(name: "getluaproto", scope: !1, file: !1, line: 107, type: !551, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !553)
!551 = !DISubroutineType(types: !552)
!552 = !{!540, !269}
!553 = !{!549}
!554 = !DILocation(line: 107, column: 38, scope: !550, inlinedAt: !555)
!555 = distinct !DILocation(line: 114, column: 15, scope: !532, inlinedAt: !546)
!556 = !DILocation(line: 108, column: 11, scope: !550, inlinedAt: !555)
!557 = !{!420, !418, i64 8}
!558 = !DILocation(line: 108, column: 3, scope: !550, inlinedAt: !555)
!559 = !DILocation(line: 115, column: 10, scope: !544, inlinedAt: !546)
!560 = !DILocation(line: 108, column: 38, scope: !550, inlinedAt: !555)
!561 = !DILocation(line: 114, column: 10, scope: !532, inlinedAt: !546)
!562 = !DILocation(line: 115, column: 7, scope: !544, inlinedAt: !546)
!563 = !DILocalVariable(name: "L", arg: 1, scope: !564, file: !1, line: 36, type: !179)
!564 = distinct !DISubprogram(name: "currentpc", scope: !1, file: !1, line: 36, type: !565, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!61, !179, !269}
!567 = !{!563, !568}
!568 = !DILocalVariable(name: "ci", arg: 2, scope: !564, file: !1, line: 36, type: !269)
!569 = !DILocation(line: 36, column: 34, scope: !564, inlinedAt: !570)
!570 = distinct !DILocation(line: 115, column: 46, scope: !544, inlinedAt: !546)
!571 = !DILocation(line: 36, column: 47, scope: !564, inlinedAt: !570)
!572 = !DILocation(line: 38, column: 16, scope: !573, inlinedAt: !570)
!573 = distinct !DILexicalBlock(scope: !564, file: !1, line: 38, column: 7)
!574 = !DILocation(line: 38, column: 10, scope: !573, inlinedAt: !570)
!575 = !DILocation(line: 38, column: 7, scope: !564, inlinedAt: !570)
!576 = !DILocation(line: 37, column: 7, scope: !564, inlinedAt: !570)
!577 = !DILocation(line: 40, column: 10, scope: !564, inlinedAt: !570)
!578 = !{!480, !415, i64 24}
!579 = !DILocation(line: 37, column: 8, scope: !580, inlinedAt: !570)
!580 = distinct !DILexicalBlock(scope: !564, file: !1, line: 37, column: 7)
!581 = !DILocation(line: 39, column: 22, scope: !573, inlinedAt: !570)
!582 = !{!414, !415, i64 48}
!583 = !DILocation(line: 39, column: 9, scope: !573, inlinedAt: !570)
!584 = !DILocation(line: 39, column: 17, scope: !573, inlinedAt: !570)
!585 = !DILocation(line: 39, column: 5, scope: !573, inlinedAt: !570)
!586 = !{!587, !415, i64 24}
!587 = !{!"Proto", !415, i64 0, !416, i64 8, !416, i64 9, !415, i64 16, !415, i64 24, !415, i64 32, !415, i64 40, !415, i64 48, !415, i64 56, !415, i64 64, !418, i64 72, !418, i64 76, !418, i64 80, !418, i64 84, !418, i64 88, !418, i64 92, !418, i64 96, !418, i64 100, !415, i64 104, !416, i64 112, !416, i64 113, !416, i64 114, !416, i64 115}
!588 = !DILocation(line: 41, column: 1, scope: !564, inlinedAt: !570)
!589 = !DILocation(line: 115, column: 21, scope: !544, inlinedAt: !546)
!590 = !DILocation(line: 113, column: 15, scope: !532, inlinedAt: !546)
!591 = !DILocation(line: 115, column: 65, scope: !544, inlinedAt: !546)
!592 = !DILocation(line: 115, column: 7, scope: !532, inlinedAt: !546)
!593 = !DILocation(line: 132, column: 30, scope: !594)
!594 = distinct !DILexicalBlock(scope: !513, file: !1, line: 131, column: 7)
!595 = !{!480, !415, i64 0}
!596 = !DILocation(line: 118, column: 29, scope: !543, inlinedAt: !546)
!597 = !DILocation(line: 118, column: 23, scope: !543, inlinedAt: !546)
!598 = !DILocation(line: 118, column: 38, scope: !543, inlinedAt: !546)
!599 = !DILocation(line: 118, column: 52, scope: !543, inlinedAt: !546)
!600 = !DILocation(line: 118, column: 19, scope: !543, inlinedAt: !546)
!601 = !{!415, !415, i64 0}
!602 = !DILocation(line: 118, column: 11, scope: !543, inlinedAt: !546)
!603 = !DILocation(line: 119, column: 21, scope: !604, inlinedAt: !546)
!604 = distinct !DILexicalBlock(scope: !543, file: !1, line: 119, column: 9)
!605 = !DILocation(line: 119, column: 15, scope: !604, inlinedAt: !546)
!606 = !DILocation(line: 119, column: 29, scope: !604, inlinedAt: !546)
!607 = !DILocation(line: 119, column: 26, scope: !604, inlinedAt: !546)
!608 = !DILocation(line: 119, column: 36, scope: !604, inlinedAt: !546)
!609 = !DILocation(line: 119, column: 31, scope: !604, inlinedAt: !546)
!610 = !DILocation(line: 124, column: 1, scope: !532, inlinedAt: !546)
!611 = !DILocation(line: 129, column: 15, scope: !513)
!612 = !DILocation(line: 132, column: 40, scope: !594)
!613 = !DILocation(line: 132, column: 35, scope: !594)
!614 = !DILocation(line: 132, column: 7, scope: !594)
!615 = !DILocation(line: 134, column: 3, scope: !513)
!616 = distinct !DISubprogram(name: "lua_setlocal", scope: !1, file: !1, line: 138, type: !514, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !628}
!618 = !DILocalVariable(name: "L", arg: 1, scope: !616, file: !1, line: 138, type: !179)
!619 = !DILocalVariable(name: "ar", arg: 2, scope: !616, file: !1, line: 138, type: !516)
!620 = !DILocalVariable(name: "n", arg: 3, scope: !616, file: !1, line: 138, type: !61)
!621 = !DILocalVariable(name: "ci", scope: !616, file: !1, line: 139, type: !269)
!622 = !DILocalVariable(name: "name", scope: !616, file: !1, line: 140, type: !307)
!623 = !DILocalVariable(name: "o2", scope: !624, file: !1, line: 143, type: !626)
!624 = distinct !DILexicalBlock(scope: !625, file: !1, line: 143, column: 7)
!625 = distinct !DILexicalBlock(scope: !616, file: !1, line: 142, column: 7)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!628 = !DILocalVariable(name: "o1", scope: !624, file: !1, line: 143, type: !122)
!629 = !DILocation(line: 138, column: 46, scope: !616)
!630 = !DILocation(line: 138, column: 66, scope: !616)
!631 = !DILocation(line: 138, column: 74, scope: !616)
!632 = !DILocation(line: 139, column: 21, scope: !616)
!633 = !DILocation(line: 139, column: 35, scope: !616)
!634 = !DILocation(line: 139, column: 29, scope: !616)
!635 = !DILocation(line: 139, column: 13, scope: !616)
!636 = !DILocation(line: 112, column: 42, scope: !532, inlinedAt: !637)
!637 = distinct !DILocation(line: 140, column: 22, scope: !616)
!638 = !DILocation(line: 112, column: 55, scope: !532, inlinedAt: !637)
!639 = !DILocation(line: 112, column: 63, scope: !532, inlinedAt: !637)
!640 = !DILocation(line: 107, column: 38, scope: !550, inlinedAt: !641)
!641 = distinct !DILocation(line: 114, column: 15, scope: !532, inlinedAt: !637)
!642 = !DILocation(line: 108, column: 11, scope: !550, inlinedAt: !641)
!643 = !DILocation(line: 108, column: 3, scope: !550, inlinedAt: !641)
!644 = !DILocation(line: 115, column: 10, scope: !544, inlinedAt: !637)
!645 = !DILocation(line: 108, column: 38, scope: !550, inlinedAt: !641)
!646 = !DILocation(line: 114, column: 10, scope: !532, inlinedAt: !637)
!647 = !DILocation(line: 115, column: 7, scope: !544, inlinedAt: !637)
!648 = !DILocation(line: 36, column: 34, scope: !564, inlinedAt: !649)
!649 = distinct !DILocation(line: 115, column: 46, scope: !544, inlinedAt: !637)
!650 = !DILocation(line: 36, column: 47, scope: !564, inlinedAt: !649)
!651 = !DILocation(line: 38, column: 16, scope: !573, inlinedAt: !649)
!652 = !DILocation(line: 38, column: 10, scope: !573, inlinedAt: !649)
!653 = !DILocation(line: 38, column: 7, scope: !564, inlinedAt: !649)
!654 = !DILocation(line: 37, column: 7, scope: !564, inlinedAt: !649)
!655 = !DILocation(line: 40, column: 10, scope: !564, inlinedAt: !649)
!656 = !DILocation(line: 37, column: 8, scope: !580, inlinedAt: !649)
!657 = !DILocation(line: 39, column: 22, scope: !573, inlinedAt: !649)
!658 = !DILocation(line: 39, column: 9, scope: !573, inlinedAt: !649)
!659 = !DILocation(line: 39, column: 17, scope: !573, inlinedAt: !649)
!660 = !DILocation(line: 39, column: 5, scope: !573, inlinedAt: !649)
!661 = !DILocation(line: 41, column: 1, scope: !564, inlinedAt: !649)
!662 = !DILocation(line: 115, column: 21, scope: !544, inlinedAt: !637)
!663 = !DILocation(line: 113, column: 15, scope: !532, inlinedAt: !637)
!664 = !DILocation(line: 115, column: 65, scope: !544, inlinedAt: !637)
!665 = !DILocation(line: 115, column: 7, scope: !532, inlinedAt: !637)
!666 = !DILocation(line: 143, column: 7, scope: !624)
!667 = !DILocation(line: 118, column: 29, scope: !543, inlinedAt: !637)
!668 = !DILocation(line: 118, column: 23, scope: !543, inlinedAt: !637)
!669 = !DILocation(line: 118, column: 38, scope: !543, inlinedAt: !637)
!670 = !DILocation(line: 118, column: 52, scope: !543, inlinedAt: !637)
!671 = !DILocation(line: 118, column: 19, scope: !543, inlinedAt: !637)
!672 = !DILocation(line: 118, column: 11, scope: !543, inlinedAt: !637)
!673 = !DILocation(line: 119, column: 21, scope: !604, inlinedAt: !637)
!674 = !DILocation(line: 119, column: 15, scope: !604, inlinedAt: !637)
!675 = !DILocation(line: 119, column: 29, scope: !604, inlinedAt: !637)
!676 = !DILocation(line: 119, column: 26, scope: !604, inlinedAt: !637)
!677 = !DILocation(line: 119, column: 36, scope: !604, inlinedAt: !637)
!678 = !DILocation(line: 119, column: 31, scope: !604, inlinedAt: !637)
!679 = !DILocation(line: 124, column: 1, scope: !532, inlinedAt: !637)
!680 = !DILocation(line: 140, column: 15, scope: !616)
!681 = !{!414, !415, i64 16}
!682 = !DILocation(line: 144, column: 6, scope: !616)
!683 = !DILocation(line: 144, column: 9, scope: !616)
!684 = !DILocation(line: 146, column: 3, scope: !616)
!685 = distinct !DISubprogram(name: "lua_getinfo", scope: !1, file: !1, line: 232, type: !686, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{!61, !179, !307, !301}
!688 = !{!689, !690, !691, !692, !693, !696, !697, !700}
!689 = !DILocalVariable(name: "L", arg: 1, scope: !685, file: !1, line: 232, type: !179)
!690 = !DILocalVariable(name: "what", arg: 2, scope: !685, file: !1, line: 232, type: !307)
!691 = !DILocalVariable(name: "ar", arg: 3, scope: !685, file: !1, line: 232, type: !301)
!692 = !DILocalVariable(name: "status", scope: !685, file: !1, line: 233, type: !61)
!693 = !DILocalVariable(name: "f", scope: !685, file: !1, line: 234, type: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "Closure", file: !64, line: 312, baseType: !161)
!696 = !DILocalVariable(name: "ci", scope: !685, file: !1, line: 235, type: !269)
!697 = !DILocalVariable(name: "func", scope: !698, file: !1, line: 238, type: !188)
!698 = distinct !DILexicalBlock(scope: !699, file: !1, line: 237, column: 21)
!699 = distinct !DILexicalBlock(scope: !685, file: !1, line: 237, column: 7)
!700 = !DILocalVariable(name: "i_o", scope: !701, file: !1, line: 252, type: !122)
!701 = distinct !DILexicalBlock(scope: !702, file: !1, line: 252, column: 10)
!702 = distinct !DILexicalBlock(scope: !703, file: !1, line: 251, column: 9)
!703 = distinct !DILexicalBlock(scope: !704, file: !1, line: 250, column: 26)
!704 = distinct !DILexicalBlock(scope: !685, file: !1, line: 250, column: 7)
!705 = !DILocation(line: 232, column: 37, scope: !685)
!706 = !DILocation(line: 232, column: 52, scope: !685)
!707 = !DILocation(line: 232, column: 69, scope: !685)
!708 = !DILocation(line: 234, column: 12, scope: !685)
!709 = !DILocation(line: 235, column: 13, scope: !685)
!710 = !DILocation(line: 237, column: 7, scope: !699)
!711 = !DILocation(line: 237, column: 13, scope: !699)
!712 = !DILocation(line: 237, column: 7, scope: !685)
!713 = !DILocation(line: 238, column: 21, scope: !698)
!714 = !DILocation(line: 238, column: 11, scope: !698)
!715 = !DILocation(line: 240, column: 9, scope: !698)
!716 = !DILocation(line: 241, column: 9, scope: !698)
!717 = !DILocation(line: 242, column: 11, scope: !698)
!718 = !DILocation(line: 243, column: 3, scope: !698)
!719 = !DILocation(line: 244, column: 16, scope: !720)
!720 = distinct !DILexicalBlock(scope: !699, file: !1, line: 244, column: 12)
!721 = !DILocation(line: 244, column: 21, scope: !720)
!722 = !DILocation(line: 244, column: 12, scope: !699)
!723 = !DILocation(line: 245, column: 13, scope: !724)
!724 = distinct !DILexicalBlock(scope: !720, file: !1, line: 244, column: 27)
!725 = !DILocation(line: 245, column: 21, scope: !724)
!726 = !DILocation(line: 247, column: 9, scope: !724)
!727 = !DILocation(line: 248, column: 3, scope: !724)
!728 = !DILocation(line: 0, scope: !685)
!729 = !DILocalVariable(name: "L", arg: 1, scope: !730, file: !1, line: 193, type: !179)
!730 = distinct !DISubprogram(name: "auxgetinfo", scope: !1, file: !1, line: 193, type: !731, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!61, !179, !307, !301, !694, !269}
!733 = !{!729, !734, !735, !736, !737, !738}
!734 = !DILocalVariable(name: "what", arg: 2, scope: !730, file: !1, line: 193, type: !307)
!735 = !DILocalVariable(name: "ar", arg: 3, scope: !730, file: !1, line: 193, type: !301)
!736 = !DILocalVariable(name: "f", arg: 4, scope: !730, file: !1, line: 194, type: !694)
!737 = !DILocalVariable(name: "ci", arg: 5, scope: !730, file: !1, line: 194, type: !269)
!738 = !DILocalVariable(name: "status", scope: !730, file: !1, line: 195, type: !61)
!739 = !DILocation(line: 193, column: 35, scope: !730, inlinedAt: !740)
!740 = distinct !DILocation(line: 249, column: 12, scope: !685)
!741 = !DILocation(line: 193, column: 50, scope: !730, inlinedAt: !740)
!742 = !DILocation(line: 193, column: 67, scope: !730, inlinedAt: !740)
!743 = !DILocation(line: 194, column: 30, scope: !730, inlinedAt: !740)
!744 = !DILocation(line: 194, column: 43, scope: !730, inlinedAt: !740)
!745 = !DILocation(line: 195, column: 7, scope: !730, inlinedAt: !740)
!746 = !DILocation(line: 196, column: 9, scope: !747, inlinedAt: !740)
!747 = distinct !DILexicalBlock(scope: !730, file: !1, line: 196, column: 7)
!748 = !DILocation(line: 196, column: 7, scope: !730, inlinedAt: !740)
!749 = !DILocation(line: 200, column: 10, scope: !750, inlinedAt: !740)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 200, column: 3)
!751 = distinct !DILexicalBlock(scope: !730, file: !1, line: 200, column: 3)
!752 = !DILocation(line: 200, column: 3, scope: !751, inlinedAt: !740)
!753 = !DILocalVariable(name: "ar", arg: 1, scope: !754, file: !1, line: 167, type: !301)
!754 = distinct !DISubprogram(name: "info_tailcall", scope: !1, file: !1, line: 167, type: !755, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !301}
!757 = !{!753}
!758 = !DILocation(line: 167, column: 39, scope: !754, inlinedAt: !759)
!759 = distinct !DILocation(line: 197, column: 5, scope: !760, inlinedAt: !740)
!760 = distinct !DILexicalBlock(scope: !747, file: !1, line: 196, column: 18)
!761 = !DILocation(line: 168, column: 7, scope: !754, inlinedAt: !759)
!762 = !DILocation(line: 168, column: 12, scope: !754, inlinedAt: !759)
!763 = !DILocation(line: 169, column: 7, scope: !754, inlinedAt: !759)
!764 = !DILocation(line: 170, column: 47, scope: !754, inlinedAt: !759)
!765 = !DILocation(line: 170, column: 59, scope: !754, inlinedAt: !759)
!766 = !{!504, !418, i64 40}
!767 = !DILocation(line: 170, column: 29, scope: !754, inlinedAt: !759)
!768 = !DILocation(line: 170, column: 41, scope: !754, inlinedAt: !759)
!769 = !{!504, !418, i64 48}
!770 = !DILocation(line: 170, column: 7, scope: !754, inlinedAt: !759)
!771 = !DILocation(line: 170, column: 23, scope: !754, inlinedAt: !759)
!772 = !{!504, !418, i64 52}
!773 = !DILocation(line: 169, column: 12, scope: !754, inlinedAt: !759)
!774 = !DILocation(line: 172, column: 16, scope: !754, inlinedAt: !759)
!775 = !DILocation(line: 172, column: 3, scope: !754, inlinedAt: !759)
!776 = !DILocation(line: 173, column: 7, scope: !754, inlinedAt: !759)
!777 = !DILocation(line: 173, column: 12, scope: !754, inlinedAt: !759)
!778 = !{!504, !418, i64 44}
!779 = !DILocation(line: 174, column: 1, scope: !754, inlinedAt: !759)
!780 = !DILocation(line: 198, column: 5, scope: !760, inlinedAt: !740)
!781 = !DILocation(line: 201, column: 13, scope: !782, inlinedAt: !740)
!782 = distinct !DILexicalBlock(scope: !750, file: !1, line: 200, column: 25)
!783 = !DILocation(line: 201, column: 5, scope: !782, inlinedAt: !740)
!784 = !DILocalVariable(name: "ar", arg: 1, scope: !785, file: !1, line: 150, type: !301)
!785 = distinct !DISubprogram(name: "funcinfo", scope: !1, file: !1, line: 150, type: !786, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !301, !694}
!788 = !{!784, !789}
!789 = !DILocalVariable(name: "cl", arg: 2, scope: !785, file: !1, line: 150, type: !694)
!790 = !DILocation(line: 150, column: 34, scope: !785, inlinedAt: !791)
!791 = distinct !DILocation(line: 203, column: 9, scope: !792, inlinedAt: !740)
!792 = distinct !DILexicalBlock(scope: !793, file: !1, line: 202, column: 17)
!793 = distinct !DILexicalBlock(scope: !782, file: !1, line: 201, column: 20)
!794 = !DILocation(line: 150, column: 47, scope: !785, inlinedAt: !791)
!795 = !DILocation(line: 151, column: 13, scope: !796, inlinedAt: !791)
!796 = distinct !DILexicalBlock(scope: !785, file: !1, line: 151, column: 7)
!797 = !DILocation(line: 151, column: 7, scope: !796, inlinedAt: !791)
!798 = !DILocation(line: 151, column: 7, scope: !785, inlinedAt: !791)
!799 = !DILocation(line: 152, column: 16, scope: !800, inlinedAt: !791)
!800 = distinct !DILexicalBlock(scope: !796, file: !1, line: 151, column: 18)
!801 = !{!504, !415, i64 32}
!802 = !DILocation(line: 153, column: 21, scope: !800, inlinedAt: !791)
!803 = !DILocation(line: 156, column: 3, scope: !800, inlinedAt: !791)
!804 = !DILocation(line: 158, column: 18, scope: !805, inlinedAt: !791)
!805 = distinct !DILexicalBlock(scope: !796, file: !1, line: 157, column: 8)
!806 = !{!587, !415, i64 64}
!807 = !DILocation(line: 158, column: 16, scope: !805, inlinedAt: !791)
!808 = !DILocation(line: 159, column: 29, scope: !805, inlinedAt: !791)
!809 = !DILocation(line: 159, column: 32, scope: !805, inlinedAt: !791)
!810 = !{!587, !418, i64 96}
!811 = !DILocation(line: 159, column: 21, scope: !805, inlinedAt: !791)
!812 = !DILocation(line: 160, column: 33, scope: !805, inlinedAt: !791)
!813 = !DILocation(line: 160, column: 36, scope: !805, inlinedAt: !791)
!814 = !{!587, !418, i64 100}
!815 = !DILocation(line: 161, column: 33, scope: !805, inlinedAt: !791)
!816 = !DILocation(line: 161, column: 16, scope: !805, inlinedAt: !791)
!817 = !DILocation(line: 163, column: 35, scope: !785, inlinedAt: !791)
!818 = !DILocation(line: 160, column: 25, scope: !805, inlinedAt: !791)
!819 = !DILocation(line: 161, column: 14, scope: !805, inlinedAt: !791)
!820 = !DILocation(line: 163, column: 3, scope: !785, inlinedAt: !791)
!821 = !DILocation(line: 164, column: 1, scope: !785, inlinedAt: !791)
!822 = !DILocation(line: 204, column: 9, scope: !792, inlinedAt: !740)
!823 = !DILocation(line: 207, column: 27, scope: !824, inlinedAt: !740)
!824 = distinct !DILexicalBlock(scope: !793, file: !1, line: 206, column: 17)
!825 = !DILocalVariable(name: "L", arg: 1, scope: !826, file: !1, line: 44, type: !179)
!826 = distinct !DISubprogram(name: "currentline", scope: !1, file: !1, line: 44, type: !565, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !827)
!827 = !{!825, !828, !829}
!828 = !DILocalVariable(name: "ci", arg: 2, scope: !826, file: !1, line: 44, type: !269)
!829 = !DILocalVariable(name: "pc", scope: !826, file: !1, line: 45, type: !61)
!830 = !DILocation(line: 44, column: 36, scope: !826, inlinedAt: !831)
!831 = distinct !DILocation(line: 207, column: 34, scope: !824, inlinedAt: !740)
!832 = !DILocation(line: 44, column: 49, scope: !826, inlinedAt: !831)
!833 = !DILocation(line: 36, column: 34, scope: !564, inlinedAt: !834)
!834 = distinct !DILocation(line: 45, column: 12, scope: !826, inlinedAt: !831)
!835 = !DILocation(line: 36, column: 47, scope: !564, inlinedAt: !834)
!836 = !DILocation(line: 37, column: 8, scope: !580, inlinedAt: !834)
!837 = !DILocation(line: 37, column: 7, scope: !564, inlinedAt: !834)
!838 = !DILocation(line: 38, column: 16, scope: !573, inlinedAt: !834)
!839 = !DILocation(line: 38, column: 10, scope: !573, inlinedAt: !834)
!840 = !DILocation(line: 38, column: 7, scope: !564, inlinedAt: !834)
!841 = !DILocation(line: 40, column: 10, scope: !564, inlinedAt: !834)
!842 = !DILocation(line: 39, column: 22, scope: !573, inlinedAt: !834)
!843 = !DILocation(line: 39, column: 17, scope: !573, inlinedAt: !834)
!844 = !DILocation(line: 39, column: 5, scope: !573, inlinedAt: !834)
!845 = !DILocation(line: 41, column: 1, scope: !564, inlinedAt: !834)
!846 = !DILocation(line: 46, column: 7, scope: !826, inlinedAt: !831)
!847 = !DILocation(line: 45, column: 7, scope: !826, inlinedAt: !831)
!848 = !DILocation(line: 46, column: 10, scope: !849, inlinedAt: !831)
!849 = distinct !DILexicalBlock(scope: !826, file: !1, line: 46, column: 7)
!850 = !DILocation(line: 49, column: 12, scope: !849, inlinedAt: !831)
!851 = !{!587, !415, i64 40}
!852 = !{!418, !418, i64 0}
!853 = !DILocation(line: 0, scope: !849, inlinedAt: !831)
!854 = !DILocation(line: 50, column: 1, scope: !826, inlinedAt: !831)
!855 = !DILocation(line: 207, column: 25, scope: !824, inlinedAt: !740)
!856 = !DILocation(line: 208, column: 9, scope: !824, inlinedAt: !740)
!857 = !DILocation(line: 211, column: 25, scope: !858, inlinedAt: !740)
!858 = distinct !DILexicalBlock(scope: !793, file: !1, line: 210, column: 17)
!859 = !DILocation(line: 211, column: 20, scope: !858, inlinedAt: !740)
!860 = !DILocation(line: 211, column: 18, scope: !858, inlinedAt: !740)
!861 = !DILocation(line: 212, column: 9, scope: !858, inlinedAt: !740)
!862 = !DILocation(line: 215, column: 24, scope: !863, inlinedAt: !740)
!863 = distinct !DILexicalBlock(scope: !793, file: !1, line: 214, column: 17)
!864 = !DILocalVariable(name: "L", arg: 1, scope: !865, file: !1, line: 544, type: !179)
!865 = distinct !DISubprogram(name: "getfuncname", scope: !1, file: !1, line: 544, type: !866, isLocal: true, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !869)
!866 = !DISubroutineType(types: !867)
!867 = !{!307, !179, !269, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!869 = !{!864, !870, !871, !872}
!870 = !DILocalVariable(name: "ci", arg: 2, scope: !865, file: !1, line: 544, type: !269)
!871 = !DILocalVariable(name: "name", arg: 3, scope: !865, file: !1, line: 544, type: !868)
!872 = !DILocalVariable(name: "i", scope: !865, file: !1, line: 545, type: !279)
!873 = !DILocation(line: 544, column: 44, scope: !865, inlinedAt: !874)
!874 = distinct !DILocation(line: 215, column: 31, scope: !863, inlinedAt: !740)
!875 = !DILocation(line: 544, column: 57, scope: !865, inlinedAt: !874)
!876 = !DILocation(line: 544, column: 74, scope: !865, inlinedAt: !874)
!877 = !DILocation(line: 546, column: 8, scope: !878, inlinedAt: !874)
!878 = distinct !DILexicalBlock(scope: !865, file: !1, line: 546, column: 7)
!879 = !DILocation(line: 546, column: 18, scope: !878, inlinedAt: !874)
!880 = !DILocation(line: 546, column: 25, scope: !878, inlinedAt: !874)
!881 = !DILocation(line: 546, column: 35, scope: !878, inlinedAt: !874)
!882 = !DILocation(line: 546, column: 40, scope: !878, inlinedAt: !874)
!883 = !DILocation(line: 546, column: 44, scope: !878, inlinedAt: !874)
!884 = !DILocation(line: 546, column: 7, scope: !865, inlinedAt: !874)
!885 = !DILocation(line: 549, column: 22, scope: !865, inlinedAt: !874)
!886 = !DILocation(line: 549, column: 25, scope: !865, inlinedAt: !874)
!887 = !DILocation(line: 36, column: 34, scope: !564, inlinedAt: !888)
!888 = distinct !DILocation(line: 549, column: 30, scope: !865, inlinedAt: !874)
!889 = !DILocation(line: 36, column: 47, scope: !564, inlinedAt: !888)
!890 = !DILocation(line: 38, column: 16, scope: !573, inlinedAt: !888)
!891 = !DILocation(line: 38, column: 10, scope: !573, inlinedAt: !888)
!892 = !DILocation(line: 38, column: 7, scope: !564, inlinedAt: !888)
!893 = !DILocation(line: 40, column: 10, scope: !564, inlinedAt: !888)
!894 = !DILocation(line: 39, column: 22, scope: !573, inlinedAt: !888)
!895 = !DILocation(line: 39, column: 17, scope: !573, inlinedAt: !888)
!896 = !DILocation(line: 39, column: 5, scope: !573, inlinedAt: !888)
!897 = !DILocation(line: 40, column: 3, scope: !564, inlinedAt: !888)
!898 = !DILocation(line: 549, column: 7, scope: !865, inlinedAt: !874)
!899 = !DILocation(line: 41, column: 1, scope: !564, inlinedAt: !888)
!900 = !DILocation(line: 545, column: 15, scope: !865, inlinedAt: !874)
!901 = !DILocation(line: 550, column: 32, scope: !902, inlinedAt: !874)
!902 = distinct !DILexicalBlock(scope: !865, file: !1, line: 550, column: 7)
!903 = !DILocation(line: 555, column: 1, scope: !865, inlinedAt: !874)
!904 = !DILocation(line: 216, column: 13, scope: !863, inlinedAt: !740)
!905 = !DILocation(line: 552, column: 30, scope: !902, inlinedAt: !874)
!906 = !DILocation(line: 552, column: 12, scope: !902, inlinedAt: !874)
!907 = !DILocation(line: 215, column: 22, scope: !863, inlinedAt: !740)
!908 = !{!504, !415, i64 16}
!909 = !DILocation(line: 216, column: 26, scope: !910, inlinedAt: !740)
!910 = distinct !DILexicalBlock(scope: !863, file: !1, line: 216, column: 13)
!911 = !DILocation(line: 217, column: 24, scope: !912, inlinedAt: !740)
!912 = distinct !DILexicalBlock(scope: !910, file: !1, line: 216, column: 35)
!913 = !DILocation(line: 218, column: 20, scope: !912, inlinedAt: !740)
!914 = !DILocation(line: 219, column: 9, scope: !912, inlinedAt: !740)
!915 = !DILocation(line: 226, column: 5, scope: !793, inlinedAt: !740)
!916 = !DILocation(line: 0, scope: !730, inlinedAt: !740)
!917 = !DILocation(line: 200, column: 21, scope: !750, inlinedAt: !740)
!918 = distinct !{!918, !919, !920}
!919 = !DILocation(line: 200, column: 3, scope: !751)
!920 = !DILocation(line: 227, column: 3, scope: !751)
!921 = !DILocation(line: 229, column: 1, scope: !730, inlinedAt: !740)
!922 = !DILocation(line: 233, column: 7, scope: !685)
!923 = !DILocation(line: 250, column: 7, scope: !704)
!924 = !DILocation(line: 250, column: 7, scope: !685)
!925 = !DILocation(line: 0, scope: !701)
!926 = !DILocation(line: 251, column: 9, scope: !703)
!927 = !DILocation(line: 252, column: 10, scope: !701)
!928 = !DILocation(line: 253, column: 5, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !1, line: 253, column: 5)
!930 = distinct !DILexicalBlock(scope: !703, file: !1, line: 253, column: 5)
!931 = !{!414, !415, i64 56}
!932 = !DILocation(line: 253, column: 5, scope: !930)
!933 = !DILocation(line: 254, column: 3, scope: !703)
!934 = !DILocation(line: 255, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !685, file: !1, line: 255, column: 7)
!936 = !DILocation(line: 255, column: 7, scope: !685)
!937 = !DILocalVariable(name: "L", arg: 1, scope: !938, file: !1, line: 177, type: !179)
!938 = distinct !DISubprogram(name: "collectvalidlines", scope: !1, file: !1, line: 177, type: !939, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !941)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !179, !694}
!941 = !{!937, !942, !943, !948, !949, !950, !954}
!942 = !DILocalVariable(name: "f", arg: 2, scope: !938, file: !1, line: 177, type: !694)
!943 = !DILocalVariable(name: "t", scope: !944, file: !1, line: 182, type: !946)
!944 = distinct !DILexicalBlock(scope: !945, file: !1, line: 181, column: 8)
!945 = distinct !DILexicalBlock(scope: !938, file: !1, line: 178, column: 7)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !64, line: 348, baseType: !113)
!948 = !DILocalVariable(name: "lineinfo", scope: !944, file: !1, line: 183, type: !359)
!949 = !DILocalVariable(name: "i", scope: !944, file: !1, line: 184, type: !61)
!950 = !DILocalVariable(name: "i_o", scope: !951, file: !1, line: 186, type: !122)
!951 = distinct !DILexicalBlock(scope: !952, file: !1, line: 186, column: 7)
!952 = distinct !DILexicalBlock(scope: !953, file: !1, line: 185, column: 5)
!953 = distinct !DILexicalBlock(scope: !944, file: !1, line: 185, column: 5)
!954 = !DILocalVariable(name: "i_o", scope: !955, file: !1, line: 187, type: !122)
!955 = distinct !DILexicalBlock(scope: !944, file: !1, line: 187, column: 5)
!956 = !DILocation(line: 177, column: 43, scope: !938, inlinedAt: !957)
!957 = distinct !DILocation(line: 256, column: 5, scope: !935)
!958 = !DILocation(line: 177, column: 55, scope: !938, inlinedAt: !957)
!959 = !DILocation(line: 178, column: 17, scope: !945, inlinedAt: !957)
!960 = !DILocation(line: 178, column: 25, scope: !945, inlinedAt: !957)
!961 = !DILocation(line: 178, column: 20, scope: !945, inlinedAt: !957)
!962 = !DILocation(line: 178, column: 7, scope: !938, inlinedAt: !957)
!963 = !DILocation(line: 179, column: 5, scope: !964, inlinedAt: !957)
!964 = distinct !DILexicalBlock(scope: !945, file: !1, line: 178, column: 30)
!965 = !DILocation(line: 180, column: 3, scope: !964, inlinedAt: !957)
!966 = !DILocation(line: 182, column: 16, scope: !944, inlinedAt: !957)
!967 = !DILocation(line: 182, column: 12, scope: !944, inlinedAt: !957)
!968 = !DILocation(line: 183, column: 26, scope: !944, inlinedAt: !957)
!969 = !DILocation(line: 183, column: 29, scope: !944, inlinedAt: !957)
!970 = !DILocation(line: 183, column: 10, scope: !944, inlinedAt: !957)
!971 = !DILocation(line: 184, column: 9, scope: !944, inlinedAt: !957)
!972 = !DILocation(line: 185, column: 25, scope: !952, inlinedAt: !957)
!973 = !{!587, !418, i64 84}
!974 = !DILocation(line: 185, column: 16, scope: !952, inlinedAt: !957)
!975 = !DILocation(line: 185, column: 5, scope: !953, inlinedAt: !957)
!976 = !DILocation(line: 186, column: 7, scope: !951, inlinedAt: !957)
!977 = !DILocation(line: 185, column: 40, scope: !952, inlinedAt: !957)
!978 = !DILocation(line: 185, column: 22, scope: !952, inlinedAt: !957)
!979 = distinct !{!979, !980, !981}
!980 = !DILocation(line: 185, column: 5, scope: !953)
!981 = !DILocation(line: 186, column: 7, scope: !953)
!982 = !DILocation(line: 187, column: 5, scope: !955, inlinedAt: !957)
!983 = !DILocation(line: 189, column: 3, scope: !984, inlinedAt: !957)
!984 = distinct !DILexicalBlock(scope: !985, file: !1, line: 189, column: 3)
!985 = distinct !DILexicalBlock(scope: !938, file: !1, line: 189, column: 3)
!986 = !DILocation(line: 189, column: 3, scope: !985, inlinedAt: !957)
!987 = !DILocation(line: 190, column: 1, scope: !938, inlinedAt: !957)
!988 = !DILocation(line: 256, column: 5, scope: !935)
!989 = !DILocation(line: 258, column: 3, scope: !685)
!990 = distinct !DISubprogram(name: "luaG_checkopenop", scope: !1, file: !1, line: 290, type: !991, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{!61, !279}
!993 = !{!994}
!994 = !DILocalVariable(name: "i", arg: 1, scope: !990, file: !1, line: 290, type: !279)
!995 = !DILocation(line: 290, column: 35, scope: !990)
!996 = !DILocation(line: 291, column: 3, scope: !990)
!997 = !DILocation(line: 296, column: 7, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !1, line: 296, column: 7)
!999 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 295, column: 22)
!1000 = distinct !DILexicalBlock(scope: !990, file: !1, line: 291, column: 26)
!1001 = !DILocation(line: 297, column: 7, scope: !999)
!1002 = !DILocation(line: 0, scope: !998)
!1003 = !DILocation(line: 301, column: 1, scope: !990)
!1004 = distinct !DISubprogram(name: "luaG_checkcode", scope: !1, file: !1, line: 484, type: !1005, isLocal: false, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1009)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!61, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!1009 = !{!1010}
!1010 = !DILocalVariable(name: "pt", arg: 1, scope: !1004, file: !1, line: 484, type: !1007)
!1011 = !DILocation(line: 484, column: 34, scope: !1004)
!1012 = !DILocation(line: 485, column: 28, scope: !1004)
!1013 = !{!587, !418, i64 80}
!1014 = !DILocation(line: 485, column: 11, scope: !1004)
!1015 = !DILocation(line: 485, column: 46, scope: !1004)
!1016 = !DILocation(line: 485, column: 3, scope: !1004)
!1017 = distinct !DISubprogram(name: "symbexec", scope: !1, file: !1, line: 317, type: !1018, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!279, !1007, !61, !61}
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1030, !1031, !1032, !1033, !1034, !1039, !1042, !1046, !1049, !1051, !1052}
!1021 = !DILocalVariable(name: "pt", arg: 1, scope: !1017, file: !1, line: 317, type: !1007)
!1022 = !DILocalVariable(name: "lastpc", arg: 2, scope: !1017, file: !1, line: 317, type: !61)
!1023 = !DILocalVariable(name: "reg", arg: 3, scope: !1017, file: !1, line: 317, type: !61)
!1024 = !DILocalVariable(name: "pc", scope: !1017, file: !1, line: 318, type: !61)
!1025 = !DILocalVariable(name: "last", scope: !1017, file: !1, line: 319, type: !61)
!1026 = !DILocalVariable(name: "i", scope: !1027, file: !1, line: 323, type: !279)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !1, line: 322, column: 35)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 322, column: 3)
!1029 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 322, column: 3)
!1030 = !DILocalVariable(name: "op", scope: !1027, file: !1, line: 324, type: !390)
!1031 = !DILocalVariable(name: "a", scope: !1027, file: !1, line: 325, type: !61)
!1032 = !DILocalVariable(name: "b", scope: !1027, file: !1, line: 326, type: !61)
!1033 = !DILocalVariable(name: "c", scope: !1027, file: !1, line: 327, type: !61)
!1034 = !DILocalVariable(name: "dest", scope: !1035, file: !1, line: 346, type: !61)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !1, line: 345, column: 37)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !1, line: 345, column: 13)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 343, column: 19)
!1038 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 330, column: 28)
!1039 = !DILocalVariable(name: "j", scope: !1040, file: !1, line: 349, type: !61)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 348, column: 25)
!1041 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 348, column: 15)
!1042 = !DILocalVariable(name: "d", scope: !1043, file: !1, line: 355, type: !279)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 354, column: 40)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !1, line: 354, column: 13)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 354, column: 13)
!1046 = !DILocalVariable(name: "dest", scope: !1047, file: !1, line: 417, type: !61)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 416, column: 20)
!1048 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 373, column: 17)
!1049 = !DILocalVariable(name: "nup", scope: !1050, file: !1, line: 451, type: !61)
!1050 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 450, column: 24)
!1051 = !DILocalVariable(name: "j", scope: !1050, file: !1, line: 451, type: !61)
!1052 = !DILocalVariable(name: "op1", scope: !1053, file: !1, line: 456, type: !390)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !1, line: 455, column: 36)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 455, column: 9)
!1055 = distinct !DILexicalBlock(scope: !1050, file: !1, line: 455, column: 9)
!1056 = !DILocation(line: 317, column: 43, scope: !1017)
!1057 = !DILocation(line: 317, column: 51, scope: !1017)
!1058 = !DILocation(line: 317, column: 63, scope: !1017)
!1059 = !DILocation(line: 320, column: 14, scope: !1017)
!1060 = !DILocalVariable(name: "pt", arg: 1, scope: !1061, file: !1, line: 276, type: !1007)
!1061 = distinct !DISubprogram(name: "precheck", scope: !1, file: !1, line: 276, type: !1005, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1062)
!1062 = !{!1060}
!1063 = !DILocation(line: 276, column: 35, scope: !1061, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 321, column: 3, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 321, column: 3)
!1066 = !DILocation(line: 277, column: 3, scope: !1067, inlinedAt: !1064)
!1067 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 277, column: 3)
!1068 = !{!587, !416, i64 115}
!1069 = !DILocation(line: 277, column: 3, scope: !1061, inlinedAt: !1064)
!1070 = !DILocation(line: 278, column: 3, scope: !1071, inlinedAt: !1064)
!1071 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 278, column: 3)
!1072 = !{!587, !416, i64 113}
!1073 = !{!587, !416, i64 114}
!1074 = !DILocation(line: 279, column: 3, scope: !1075, inlinedAt: !1064)
!1075 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 279, column: 3)
!1076 = !DILocation(line: 278, column: 3, scope: !1061, inlinedAt: !1064)
!1077 = !DILocation(line: 281, column: 3, scope: !1078, inlinedAt: !1064)
!1078 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 281, column: 3)
!1079 = !{!587, !418, i64 72}
!1080 = !{!587, !416, i64 112}
!1081 = !DILocation(line: 281, column: 3, scope: !1061, inlinedAt: !1064)
!1082 = !DILocation(line: 282, column: 3, scope: !1083, inlinedAt: !1064)
!1083 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 282, column: 3)
!1084 = !DILocation(line: 283, column: 3, scope: !1085, inlinedAt: !1064)
!1085 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 283, column: 3)
!1086 = !DILocation(line: 285, column: 1, scope: !1061, inlinedAt: !1064)
!1087 = !DILocation(line: 321, column: 3, scope: !1017)
!1088 = !DILocation(line: 319, column: 7, scope: !1017)
!1089 = !DILocation(line: 318, column: 7, scope: !1017)
!1090 = !DILocation(line: 322, column: 19, scope: !1028)
!1091 = !DILocation(line: 322, column: 3, scope: !1029)
!1092 = !DILocation(line: 323, column: 21, scope: !1027)
!1093 = !DILocation(line: 323, column: 17, scope: !1027)
!1094 = !DILocation(line: 324, column: 17, scope: !1027)
!1095 = !DILocation(line: 324, column: 12, scope: !1027)
!1096 = !DILocation(line: 325, column: 13, scope: !1027)
!1097 = !DILocation(line: 325, column: 9, scope: !1027)
!1098 = !DILocation(line: 326, column: 9, scope: !1027)
!1099 = !DILocation(line: 327, column: 9, scope: !1027)
!1100 = !DILocation(line: 328, column: 5, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 328, column: 5)
!1102 = !DILocation(line: 329, column: 5, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 329, column: 5)
!1104 = !DILocation(line: 328, column: 5, scope: !1027)
!1105 = !DILocation(line: 330, column: 13, scope: !1027)
!1106 = !DILocation(line: 330, column: 5, scope: !1027)
!1107 = !DILocation(line: 332, column: 13, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 331, column: 18)
!1109 = !DILocation(line: 333, column: 13, scope: !1108)
!1110 = !DILocalVariable(name: "pt", arg: 1, scope: !1111, file: !1, line: 304, type: !1007)
!1111 = distinct !DISubprogram(name: "checkArgMode", scope: !1, file: !1, line: 304, type: !1112, isLocal: true, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1114)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!61, !1007, !61, !50}
!1114 = !{!1110, !1115, !1116}
!1115 = !DILocalVariable(name: "r", arg: 2, scope: !1111, file: !1, line: 304, type: !61)
!1116 = !DILocalVariable(name: "mode", arg: 3, scope: !1111, file: !1, line: 304, type: !50)
!1117 = !DILocation(line: 304, column: 39, scope: !1111, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 334, column: 9, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 334, column: 9)
!1120 = !DILocation(line: 304, column: 47, scope: !1111, inlinedAt: !1118)
!1121 = !DILocation(line: 304, column: 65, scope: !1111, inlinedAt: !1118)
!1122 = !DILocation(line: 305, column: 3, scope: !1111, inlinedAt: !1118)
!1123 = !DILocation(line: 306, column: 18, scope: !1124, inlinedAt: !1118)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !1, line: 306, column: 18)
!1125 = distinct !DILexicalBlock(scope: !1111, file: !1, line: 305, column: 17)
!1126 = !DILocation(line: 306, column: 18, scope: !1125, inlinedAt: !1118)
!1127 = !DILocation(line: 308, column: 18, scope: !1128, inlinedAt: !1118)
!1128 = distinct !DILexicalBlock(scope: !1125, file: !1, line: 308, column: 18)
!1129 = !DILocation(line: 308, column: 18, scope: !1125, inlinedAt: !1118)
!1130 = !DILocation(line: 310, column: 7, scope: !1131, inlinedAt: !1118)
!1131 = distinct !DILexicalBlock(scope: !1125, file: !1, line: 310, column: 7)
!1132 = !DILocation(line: 310, column: 7, scope: !1125, inlinedAt: !1118)
!1133 = !{!587, !418, i64 76}
!1134 = !DILocation(line: 314, column: 1, scope: !1111, inlinedAt: !1118)
!1135 = !DILocation(line: 334, column: 9, scope: !1108)
!1136 = !DILocation(line: 335, column: 9, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 335, column: 9)
!1138 = !DILocation(line: 304, column: 39, scope: !1111, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 335, column: 9, scope: !1137)
!1140 = !DILocation(line: 304, column: 47, scope: !1111, inlinedAt: !1139)
!1141 = !DILocation(line: 305, column: 3, scope: !1111, inlinedAt: !1139)
!1142 = !DILocation(line: 306, column: 18, scope: !1124, inlinedAt: !1139)
!1143 = !DILocation(line: 306, column: 18, scope: !1125, inlinedAt: !1139)
!1144 = !DILocation(line: 308, column: 18, scope: !1128, inlinedAt: !1139)
!1145 = !DILocation(line: 308, column: 18, scope: !1125, inlinedAt: !1139)
!1146 = !DILocation(line: 310, column: 7, scope: !1131, inlinedAt: !1139)
!1147 = !DILocation(line: 310, column: 7, scope: !1125, inlinedAt: !1139)
!1148 = !DILocation(line: 314, column: 1, scope: !1111, inlinedAt: !1139)
!1149 = !DILocation(line: 335, column: 9, scope: !1108)
!1150 = !DILocation(line: 339, column: 13, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 338, column: 18)
!1152 = !DILocation(line: 340, column: 13, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1151, file: !1, line: 340, column: 13)
!1154 = !DILocation(line: 340, column: 26, scope: !1153)
!1155 = !DILocation(line: 340, column: 13, scope: !1151)
!1156 = !DILocation(line: 340, column: 37, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 340, column: 37)
!1158 = !DILocation(line: 340, column: 37, scope: !1153)
!1159 = !DILocation(line: 344, column: 13, scope: !1037)
!1160 = !DILocation(line: 345, column: 13, scope: !1036)
!1161 = !DILocation(line: 345, column: 26, scope: !1036)
!1162 = !DILocation(line: 345, column: 13, scope: !1037)
!1163 = !DILocation(line: 346, column: 24, scope: !1035)
!1164 = !DILocation(line: 346, column: 26, scope: !1035)
!1165 = !DILocation(line: 346, column: 15, scope: !1035)
!1166 = !DILocation(line: 347, column: 11, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 347, column: 11)
!1168 = !DILocation(line: 348, column: 20, scope: !1041)
!1169 = !DILocation(line: 348, column: 15, scope: !1035)
!1170 = !DILocation(line: 355, column: 44, scope: !1043)
!1171 = !DILocation(line: 349, column: 17, scope: !1040)
!1172 = !DILocation(line: 354, column: 13, scope: !1045)
!1173 = !DILocation(line: 355, column: 46, scope: !1043)
!1174 = !DILocation(line: 355, column: 31, scope: !1043)
!1175 = !DILocation(line: 355, column: 27, scope: !1043)
!1176 = !DILocation(line: 356, column: 49, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1043, file: !1, line: 356, column: 19)
!1178 = !DILocation(line: 354, column: 36, scope: !1044)
!1179 = !DILocation(line: 354, column: 27, scope: !1044)
!1180 = distinct !{!1180, !1172, !1181}
!1181 = !DILocation(line: 357, column: 13, scope: !1045)
!1182 = !DILocation(line: 360, column: 13, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 360, column: 13)
!1184 = !DILocation(line: 0, scope: !1044)
!1185 = !DILocation(line: 0, scope: !1108)
!1186 = !DILocation(line: 366, column: 9, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 366, column: 9)
!1188 = !DILocation(line: 367, column: 13, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !1, line: 367, column: 11)
!1190 = distinct !DILexicalBlock(scope: !1187, file: !1, line: 366, column: 24)
!1191 = !DILocation(line: 366, column: 9, scope: !1027)
!1192 = !DILocation(line: 369, column: 9, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 369, column: 9)
!1194 = !DILocation(line: 369, column: 9, scope: !1027)
!1195 = !DILocation(line: 370, column: 7, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 370, column: 7)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !1, line: 369, column: 24)
!1198 = !DILocation(line: 370, column: 7, scope: !1197)
!1199 = !DILocation(line: 371, column: 7, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 371, column: 7)
!1201 = !DILocation(line: 371, column: 7, scope: !1197)
!1202 = !DILocation(line: 373, column: 5, scope: !1027)
!1203 = !DILocation(line: 375, column: 15, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 375, column: 13)
!1205 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 374, column: 25)
!1206 = !DILocation(line: 375, column: 13, scope: !1205)
!1207 = !DILocation(line: 376, column: 11, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !1, line: 376, column: 11)
!1209 = distinct !DILexicalBlock(scope: !1204, file: !1, line: 375, column: 21)
!1210 = !DILocation(line: 376, column: 11, scope: !1209)
!1211 = !DILocation(line: 377, column: 11, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1209, file: !1, line: 377, column: 11)
!1213 = !DILocation(line: 383, column: 15, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !1, line: 383, column: 13)
!1215 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 382, column: 24)
!1216 = !DILocation(line: 383, column: 29, scope: !1214)
!1217 = !DILocation(line: 383, column: 22, scope: !1214)
!1218 = !DILocation(line: 389, column: 9, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !1, line: 389, column: 9)
!1220 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 388, column: 25)
!1221 = !DILocation(line: 389, column: 9, scope: !1220)
!1222 = !DILocation(line: 394, column: 9, scope: !1223)
