; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldo.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }
%struct.Table = type { %union.GCObject*, i8, i8, i8, i8, %struct.Table*, %struct.lua_TValue*, %struct.Node*, %struct.Node*, %union.GCObject*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !25)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldo.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 18, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!7 = !DIEnumerator(name: "TM_INDEX", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TM_NEWINDEX", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "TM_GC", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "TM_MODE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "TM_EQ", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "TM_ADD", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "TM_SUB", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "TM_MUL", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "TM_DIV", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "TM_MOD", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "TM_POW", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "TM_UNM", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "TM_LEN", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "TM_LT", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "TM_LE", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "TM_CONCAT", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "TM_CALL", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "TM_N", value: 17, isUnsigned: true)
!25 = !{!26, !38, !90, !64, !238, !194, !104, !52, !101, !157, !370}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !28, line: 36, baseType: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !30, line: 136, size: 1472, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !42, !69, !129, !366, !367, !368, !369}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !29, file: !30, line: 137, baseType: !33, size: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !28, line: 51, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !28, line: 49, size: 128, elements: !35)
!35 = !{!36, !37, !41}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !28, line: 50, baseType: !26, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !34, file: !28, line: 50, baseType: !38, size: 8, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !39, line: 27, baseType: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !34, file: !28, line: 50, baseType: !38, size: 8, offset: 72)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !29, file: !30, line: 138, baseType: !43, size: 192)
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !28, line: 199, size: 192, elements: !44)
!44 = !{!45, !55}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !43, file: !28, line: 200, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !39, line: 47, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !39, line: 47, size: 64, elements: !48)
!48 = !{!49, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !47, file: !39, line: 47, baseType: !50, size: 64)
!50 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !47, file: !39, line: 47, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !47, file: !39, line: 47, baseType: !54, size: 64)
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !43, file: !28, line: 206, baseType: !56, size: 192)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !28, line: 201, size: 192, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !28, line: 202, baseType: !26, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !56, file: !28, line: 202, baseType: !38, size: 8, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !56, file: !28, line: 202, baseType: !38, size: 8, offset: 72)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !56, file: !28, line: 203, baseType: !38, size: 8, offset: 80)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !56, file: !28, line: 204, baseType: !5, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !28, line: 205, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 40, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !67, line: 129, baseType: !68)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !29, file: !30, line: 139, baseType: !70, size: 320)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !28, line: 215, size: 320, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !70, file: !28, line: 216, baseType: !46, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !70, file: !28, line: 222, baseType: !74, size: 320)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !28, line: 217, size: 320, elements: !75)
!75 = !{!76, !77, !78, !79, !127, !128}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !28, line: 218, baseType: !26, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !74, file: !28, line: 218, baseType: !38, size: 8, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !74, file: !28, line: 218, baseType: !38, size: 8, offset: 72)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !74, file: !28, line: 219, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !28, line: 338, size: 512, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !106, !124, !125, !126}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !28, line: 339, baseType: !26, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !81, file: !28, line: 339, baseType: !38, size: 8, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !81, file: !28, line: 339, baseType: !38, size: 8, offset: 72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !28, line: 340, baseType: !38, size: 8, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !81, file: !28, line: 341, baseType: !38, size: 8, offset: 88)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !81, file: !28, line: 342, baseType: !80, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !81, file: !28, line: 343, baseType: !90, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !28, line: 75, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !28, line: 73, size: 128, elements: !93)
!93 = !{!94, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !28, line: 74, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !28, line: 64, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 59, size: 64, elements: !97)
!97 = !{!98, !99, !100, !103}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !96, file: !28, line: 60, baseType: !26, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !96, file: !28, line: 61, baseType: !52, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !96, file: !28, line: 62, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !102, line: 99, baseType: !50)
!102 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!103 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !96, file: !28, line: 63, baseType: !104, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !92, file: !28, line: 74, baseType: !104, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !81, file: !28, line: 344, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !28, line: 335, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !28, line: 332, size: 320, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !109, file: !28, line: 333, baseType: !91, size: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !109, file: !28, line: 334, baseType: !113, size: 192, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !28, line: 329, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !28, line: 323, size: 192, elements: !115)
!115 = !{!116, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !114, file: !28, line: 327, baseType: !117, size: 192)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !28, line: 324, size: 192, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !117, file: !28, line: 325, baseType: !95, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !117, file: !28, line: 325, baseType: !104, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !28, line: 326, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !114, file: !28, line: 328, baseType: !91, size: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !81, file: !28, line: 345, baseType: !107, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !81, file: !28, line: 346, baseType: !26, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !81, file: !28, line: 347, baseType: !104, size: 32, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !74, file: !28, line: 220, baseType: !80, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !28, line: 221, baseType: !64, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !29, file: !30, line: 140, baseType: !130, size: 448)
!130 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !28, line: 309, size: 448, elements: !131)
!131 = !{!132, !315}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !130, file: !28, line: 310, baseType: !133, size: 448)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !28, line: 299, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !28, line: 295, size: 448, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !311}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !28, line: 296, baseType: !26, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !134, file: !28, line: 296, baseType: !38, size: 8, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !134, file: !28, line: 296, baseType: !38, size: 8, offset: 72)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !134, file: !28, line: 296, baseType: !38, size: 8, offset: 80)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !134, file: !28, line: 296, baseType: !38, size: 8, offset: 88)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !134, file: !28, line: 296, baseType: !26, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !134, file: !28, line: 296, baseType: !80, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !134, file: !28, line: 297, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !102, line: 52, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!104, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !102, line: 50, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !30, line: 100, size: 1472, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !158, !159, !237, !251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262, !263, !264, !265, !290, !291, !292, !293, !294, !308}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !30, line: 101, baseType: !26, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !150, file: !30, line: 101, baseType: !38, size: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !150, file: !30, line: 101, baseType: !38, size: 8, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !150, file: !30, line: 102, baseType: !38, size: 8, offset: 80)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !150, file: !30, line: 103, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !28, line: 193, baseType: !90)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !150, file: !30, line: 104, baseType: !157, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !150, file: !30, line: 105, baseType: !160, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !30, line: 94, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !30, line: 68, size: 3456, elements: !163)
!163 = !{!164, !173, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !198, !200, !201, !202, !203, !204, !205, !206, !207, !209, !227, !231}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !162, file: !30, line: 69, baseType: !165, size: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !30, line: 42, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !30, line: 38, size: 128, elements: !167)
!167 = !{!168, !170, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !166, file: !30, line: 39, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !166, file: !30, line: 40, baseType: !171, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !39, line: 18, baseType: !5)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !30, line: 41, baseType: !104, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !162, file: !30, line: 70, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !102, line: 66, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!52, !52, !52, !64, !64}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !162, file: !30, line: 71, baseType: !52, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !162, file: !30, line: 72, baseType: !38, size: 8, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !162, file: !30, line: 73, baseType: !38, size: 8, offset: 264)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !162, file: !30, line: 74, baseType: !104, size: 32, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !162, file: !30, line: 75, baseType: !26, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !162, file: !30, line: 76, baseType: !169, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !162, file: !30, line: 77, baseType: !26, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !162, file: !30, line: 78, baseType: !26, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !162, file: !30, line: 79, baseType: !26, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !162, file: !30, line: 80, baseType: !26, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !162, file: !30, line: 81, baseType: !189, size: 192, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !190, line: 28, baseType: !191)
!190 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !190, line: 24, size: 192, elements: !192)
!192 = !{!193, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !191, file: !190, line: 25, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !191, file: !190, line: 26, baseType: !64, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !191, file: !190, line: 27, baseType: !64, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !162, file: !30, line: 82, baseType: !199, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !39, line: 20, baseType: !64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !162, file: !30, line: 83, baseType: !199, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !162, file: !30, line: 84, baseType: !199, size: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !162, file: !30, line: 85, baseType: !199, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !162, file: !30, line: 86, baseType: !104, size: 32, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !162, file: !30, line: 87, baseType: !104, size: 32, offset: 1184)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !162, file: !30, line: 88, baseType: !144, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !162, file: !30, line: 89, baseType: !91, size: 128, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !162, file: !30, line: 90, baseType: !208, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !162, file: !30, line: 91, baseType: !210, size: 320, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !28, line: 284, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !28, line: 274, size: 320, elements: !212)
!212 = !{!213, !214, !215, !216, !217}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !28, line: 275, baseType: !26, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !211, file: !28, line: 275, baseType: !38, size: 8, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !211, file: !28, line: 275, baseType: !38, size: 8, offset: 72)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !211, file: !28, line: 276, baseType: !90, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !211, file: !28, line: 283, baseType: !218, size: 128, offset: 192)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !211, file: !28, line: 277, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !218, file: !28, line: 278, baseType: !91, size: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !218, file: !28, line: 282, baseType: !222, size: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !28, line: 279, size: 128, elements: !223)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !28, line: 280, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !28, line: 281, baseType: !225, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !162, file: !30, line: 92, baseType: !228, size: 576, offset: 1792)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 576, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 9)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !162, file: !30, line: 93, baseType: !232, size: 1088, offset: 2368)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 1088, elements: !235)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !28, line: 207, baseType: !43)
!235 = !{!236}
!236 = !DISubrange(count: 17)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !150, file: !30, line: 106, baseType: !238, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !30, line: 55, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !30, line: 48, size: 320, elements: !241)
!241 = !{!242, !243, !244, !245, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !240, file: !30, line: 49, baseType: !157, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !240, file: !30, line: 50, baseType: !157, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !240, file: !30, line: 51, baseType: !157, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !240, file: !30, line: 52, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !39, line: 88, baseType: !171)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !240, file: !30, line: 53, baseType: !104, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !240, file: !30, line: 54, baseType: !104, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !150, file: !30, line: 107, baseType: !246, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !150, file: !30, line: 108, baseType: !157, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !150, file: !30, line: 109, baseType: !157, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !150, file: !30, line: 110, baseType: !238, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !150, file: !30, line: 111, baseType: !238, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !150, file: !30, line: 112, baseType: !104, size: 32, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !150, file: !30, line: 113, baseType: !104, size: 32, offset: 736)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !150, file: !30, line: 114, baseType: !259, size: 16, offset: 768)
!259 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !150, file: !30, line: 115, baseType: !259, size: 16, offset: 784)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !150, file: !30, line: 116, baseType: !38, size: 8, offset: 800)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !150, file: !30, line: 117, baseType: !38, size: 8, offset: 808)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !150, file: !30, line: 118, baseType: !104, size: 32, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !150, file: !30, line: 119, baseType: !104, size: 32, offset: 864)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !150, file: !30, line: 120, baseType: !266, size: 64, offset: 896)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !102, line: 330, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !148, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !102, line: 326, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !102, line: 346, size: 960, elements: !273)
!273 = !{!274, !275, !278, !279, !280, !281, !282, !283, !284, !285, !289}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !272, file: !102, line: 347, baseType: !104, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !102, line: 348, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !272, file: !102, line: 349, baseType: !276, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !272, file: !102, line: 350, baseType: !276, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !272, file: !102, line: 351, baseType: !276, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !272, file: !102, line: 352, baseType: !104, size: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !272, file: !102, line: 353, baseType: !104, size: 32, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !272, file: !102, line: 354, baseType: !104, size: 32, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !272, file: !102, line: 355, baseType: !104, size: 32, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !272, file: !102, line: 356, baseType: !286, size: 480, offset: 448)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 480, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 60)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !272, file: !102, line: 358, baseType: !104, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !150, file: !30, line: 121, baseType: !91, size: 128, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !150, file: !30, line: 122, baseType: !91, size: 128, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !150, file: !30, line: 123, baseType: !26, size: 64, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !150, file: !30, line: 124, baseType: !26, size: 64, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !150, file: !30, line: 125, baseType: !295, size: 64, offset: 1344)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !1, line: 44, size: 640, elements: !297)
!297 = !{!298, !299, !306}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !296, file: !1, line: 45, baseType: !295, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !296, file: !1, line: 46, baseType: !300, size: 512, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !301, line: 372, baseType: !302)
!301 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 512, elements: !304)
!303 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!304 = !{!305}
!305 = !DISubrange(count: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !296, file: !1, line: 47, baseType: !307, size: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !150, file: !30, line: 126, baseType: !309, size: 64, offset: 1408)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !310, line: 49, baseType: !54)
!310 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !134, file: !28, line: 298, baseType: !312, size: 128, offset: 320)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 1)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !130, file: !28, line: 311, baseType: !316, size: 384)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !28, line: 306, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !28, line: 302, size: 384, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !363}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !28, line: 303, baseType: !26, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !317, file: !28, line: 303, baseType: !38, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !317, file: !28, line: 303, baseType: !38, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !317, file: !28, line: 303, baseType: !38, size: 8, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !317, file: !28, line: 303, baseType: !38, size: 8, offset: 88)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !317, file: !28, line: 303, baseType: !26, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !317, file: !28, line: 303, baseType: !80, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !317, file: !28, line: 304, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !28, line: 231, size: 960, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !336, !338, !340, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !28, line: 232, baseType: !26, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !328, file: !28, line: 232, baseType: !38, size: 8, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !328, file: !28, line: 232, baseType: !38, size: 8, offset: 72)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !328, file: !28, line: 233, baseType: !90, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !328, file: !28, line: 234, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !328, file: !28, line: 235, baseType: !337, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !328, file: !28, line: 236, baseType: !339, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !328, file: !28, line: 237, baseType: !341, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !28, line: 262, size: 128, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !342, file: !28, line: 263, baseType: !233, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !342, file: !28, line: 264, baseType: !104, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !342, file: !28, line: 265, baseType: !104, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !328, file: !28, line: 238, baseType: !348, size: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !328, file: !28, line: 239, baseType: !233, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !328, file: !28, line: 240, baseType: !104, size: 32, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !328, file: !28, line: 241, baseType: !104, size: 32, offset: 608)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !328, file: !28, line: 242, baseType: !104, size: 32, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !328, file: !28, line: 243, baseType: !104, size: 32, offset: 672)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !328, file: !28, line: 244, baseType: !104, size: 32, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !328, file: !28, line: 245, baseType: !104, size: 32, offset: 736)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !328, file: !28, line: 246, baseType: !104, size: 32, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !328, file: !28, line: 247, baseType: !104, size: 32, offset: 800)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !328, file: !28, line: 248, baseType: !26, size: 64, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !328, file: !28, line: 249, baseType: !38, size: 8, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !328, file: !28, line: 250, baseType: !38, size: 8, offset: 904)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !328, file: !28, line: 251, baseType: !38, size: 8, offset: 912)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !328, file: !28, line: 252, baseType: !38, size: 8, offset: 920)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !317, file: !28, line: 305, baseType: !364, size: 64, offset: 320)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 64, elements: !313)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !29, file: !30, line: 141, baseType: !81, size: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !29, file: !30, line: 142, baseType: !328, size: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !29, file: !30, line: 143, baseType: !211, size: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !29, file: !30, line: 144, baseType: !150, size: 1472)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SParser", file: !1, line: 485, size: 320, elements: !372)
!372 = !{!373, !388, !389}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !371, file: !1, line: 486, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZIO", file: !190, line: 18, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Zio", file: !190, line: 56, size: 320, elements: !377)
!377 = !{!378, !379, !380, !386, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !376, file: !190, line: 57, baseType: !64, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !376, file: !190, line: 58, baseType: !276, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !376, file: !190, line: 59, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Reader", file: !102, line: 58, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!276, !148, !52, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !376, file: !190, line: 60, baseType: !52, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !376, file: !190, line: 61, baseType: !148, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !371, file: !1, line: 487, baseType: !189, size: 192, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !371, file: !1, line: 488, baseType: !276, size: 64, offset: 256)
!390 = !{i32 2, !"Dwarf Version", i32 4}
!391 = !{i32 2, !"Debug Info Version", i32 3}
!392 = !{i32 1, !"wchar_size", i32 4}
!393 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!394 = distinct !DISubprogram(name: "luaD_seterrorobj", scope: !1, file: !1, line: 51, type: !395, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !148, !104, !157}
!397 = !{!398, !399, !400, !401, !405, !408, !413}
!398 = !DILocalVariable(name: "L", arg: 1, scope: !394, file: !1, line: 51, type: !148)
!399 = !DILocalVariable(name: "errcode", arg: 2, scope: !394, file: !1, line: 51, type: !104)
!400 = !DILocalVariable(name: "oldtop", arg: 3, scope: !394, file: !1, line: 51, type: !157)
!401 = !DILocalVariable(name: "i_o", scope: !402, file: !1, line: 54, type: !90)
!402 = distinct !DILexicalBlock(scope: !403, file: !1, line: 54, column: 7)
!403 = distinct !DILexicalBlock(scope: !404, file: !1, line: 53, column: 22)
!404 = distinct !DILexicalBlock(scope: !394, file: !1, line: 52, column: 20)
!405 = !DILocalVariable(name: "i_o", scope: !406, file: !1, line: 58, type: !90)
!406 = distinct !DILexicalBlock(scope: !407, file: !1, line: 58, column: 7)
!407 = distinct !DILexicalBlock(scope: !404, file: !1, line: 57, column: 22)
!408 = !DILocalVariable(name: "o2", scope: !409, file: !1, line: 63, type: !411)
!409 = distinct !DILexicalBlock(scope: !410, file: !1, line: 63, column: 7)
!410 = distinct !DILexicalBlock(scope: !404, file: !1, line: 62, column: 22)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!413 = !DILocalVariable(name: "o1", scope: !409, file: !1, line: 63, type: !90)
!414 = !DILocation(line: 51, column: 35, scope: !394)
!415 = !DILocation(line: 51, column: 42, scope: !394)
!416 = !DILocation(line: 51, column: 57, scope: !394)
!417 = !DILocation(line: 52, column: 3, scope: !394)
!418 = !DILocation(line: 54, column: 7, scope: !402)
!419 = !{!420, !420, i64 0}
!420 = !{!"omnipotent char", !421, i64 0}
!421 = !{!"Simple C/C++ TBAA"}
!422 = !DILocation(line: 55, column: 7, scope: !403)
!423 = !DILocation(line: 58, column: 7, scope: !406)
!424 = !DILocation(line: 59, column: 7, scope: !407)
!425 = !DILocation(line: 63, column: 7, scope: !409)
!426 = !{!427, !428, i64 16}
!427 = !{!"lua_State", !428, i64 0, !420, i64 8, !420, i64 9, !420, i64 10, !428, i64 16, !428, i64 24, !428, i64 32, !428, i64 40, !428, i64 48, !428, i64 56, !428, i64 64, !428, i64 72, !428, i64 80, !429, i64 88, !429, i64 92, !430, i64 96, !430, i64 98, !420, i64 100, !420, i64 101, !429, i64 104, !429, i64 108, !428, i64 112, !431, i64 120, !431, i64 136, !428, i64 152, !428, i64 160, !428, i64 168, !432, i64 176}
!428 = !{!"any pointer", !420, i64 0}
!429 = !{!"int", !420, i64 0}
!430 = !{!"short", !420, i64 0}
!431 = !{!"lua_TValue", !420, i64 0, !429, i64 8}
!432 = !{!"long", !420, i64 0}
!433 = !{!431, !429, i64 8}
!434 = !DILocation(line: 64, column: 7, scope: !410)
!435 = !DILocation(line: 0, scope: !402)
!436 = !DILocation(line: 67, column: 19, scope: !394)
!437 = !DILocation(line: 67, column: 6, scope: !394)
!438 = !DILocation(line: 67, column: 10, scope: !394)
!439 = !DILocation(line: 68, column: 1, scope: !394)
!440 = distinct !DISubprogram(name: "luaD_throw", scope: !1, file: !1, line: 94, type: !441, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !148, !104}
!443 = !{!444, !445}
!444 = !DILocalVariable(name: "L", arg: 1, scope: !440, file: !1, line: 94, type: !148)
!445 = !DILocalVariable(name: "errcode", arg: 2, scope: !440, file: !1, line: 94, type: !104)
