; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lgc.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lgc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }
%struct.Table = type { %union.GCObject*, i8, i8, i8, i8, %struct.Table*, %struct.lua_TValue*, %struct.Node*, %struct.Node*, %union.GCObject*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !25)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lgc.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 18, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!7 = !DIEnumerator(name: "TM_INDEX", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TM_NEWINDEX", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "TM_GC", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "TM_MODE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "TM_EQ", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "TM_ADD", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "TM_SUB", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "TM_MUL", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "TM_DIV", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "TM_MOD", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "TM_POW", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "TM_UNM", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "TM_LEN", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "TM_LT", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "TM_LE", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "TM_CONCAT", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "TM_CALL", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "TM_N", value: 17, isUnsigned: true)
!25 = !{!26, !27, !34, !36, !105, !276, !172, !195, !29}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !28, line: 20, baseType: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 40, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !32, line: 129, baseType: !33)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !28, line: 27, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !38, line: 36, baseType: !39)
!38 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !40, line: 136, size: 1472, elements: !41)
!40 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !{!42, !49, !70, !130, !355, !356, !357, !358}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !39, file: !40, line: 137, baseType: !43, size: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !38, line: 51, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !38, line: 49, size: 128, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !38, line: 50, baseType: !36, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !44, file: !38, line: 50, baseType: !34, size: 8, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !44, file: !38, line: 50, baseType: !34, size: 8, offset: 72)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !39, file: !40, line: 138, baseType: !50, size: 192)
!50 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !38, line: 199, size: 192, elements: !51)
!51 = !{!52, !61}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !50, file: !38, line: 200, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !28, line: 47, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 47, size: 64, elements: !55)
!55 = !{!56, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !54, file: !28, line: 47, baseType: !57, size: 64)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !54, file: !28, line: 47, baseType: !26, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !54, file: !28, line: 47, baseType: !60, size: 64)
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !50, file: !38, line: 206, baseType: !62, size: 192)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !38, line: 201, size: 192, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !38, line: 202, baseType: !36, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !62, file: !38, line: 202, baseType: !34, size: 8, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !62, file: !38, line: 202, baseType: !34, size: 8, offset: 72)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !62, file: !38, line: 203, baseType: !34, size: 8, offset: 80)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !62, file: !38, line: 204, baseType: !5, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !62, file: !38, line: 205, baseType: !29, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !39, file: !40, line: 139, baseType: !71, size: 320)
!71 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !38, line: 215, size: 320, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !71, file: !38, line: 216, baseType: !53, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !71, file: !38, line: 222, baseType: !75, size: 320)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !38, line: 217, size: 320, elements: !76)
!76 = !{!77, !78, !79, !80, !128, !129}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !75, file: !38, line: 218, baseType: !36, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !75, file: !38, line: 218, baseType: !34, size: 8, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !75, file: !38, line: 218, baseType: !34, size: 8, offset: 72)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !75, file: !38, line: 219, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !38, line: 338, size: 512, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !107, !125, !126, !127}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !38, line: 339, baseType: !36, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !82, file: !38, line: 339, baseType: !34, size: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !82, file: !38, line: 339, baseType: !34, size: 8, offset: 72)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !38, line: 340, baseType: !34, size: 8, offset: 80)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !82, file: !38, line: 341, baseType: !34, size: 8, offset: 88)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !82, file: !38, line: 342, baseType: !81, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !82, file: !38, line: 343, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !38, line: 75, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !38, line: 73, size: 128, elements: !94)
!94 = !{!95, !106}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !93, file: !38, line: 74, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !38, line: 64, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 59, size: 64, elements: !98)
!98 = !{!99, !100, !101, !104}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !97, file: !38, line: 60, baseType: !36, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !97, file: !38, line: 61, baseType: !26, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !97, file: !38, line: 62, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !103, line: 99, baseType: !57)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !97, file: !38, line: 63, baseType: !105, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !93, file: !38, line: 74, baseType: !105, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !82, file: !38, line: 344, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !38, line: 335, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !38, line: 332, size: 320, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !110, file: !38, line: 333, baseType: !92, size: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !110, file: !38, line: 334, baseType: !114, size: 192, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !38, line: 329, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !38, line: 323, size: 192, elements: !116)
!116 = !{!117, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !115, file: !38, line: 327, baseType: !118, size: 192)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !38, line: 324, size: 192, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !118, file: !38, line: 325, baseType: !96, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !118, file: !38, line: 325, baseType: !105, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !38, line: 326, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !115, file: !38, line: 328, baseType: !92, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !82, file: !38, line: 345, baseType: !108, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !82, file: !38, line: 346, baseType: !36, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !82, file: !38, line: 347, baseType: !105, size: 32, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !75, file: !38, line: 220, baseType: !81, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !75, file: !38, line: 221, baseType: !29, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !39, file: !40, line: 140, baseType: !131, size: 448)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !38, line: 309, size: 448, elements: !132)
!132 = !{!133, !304}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !131, file: !38, line: 310, baseType: !134, size: 448)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !38, line: 299, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !38, line: 295, size: 448, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !300}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !38, line: 296, baseType: !36, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !135, file: !38, line: 296, baseType: !34, size: 8, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !135, file: !38, line: 296, baseType: !34, size: 8, offset: 72)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !135, file: !38, line: 296, baseType: !34, size: 8, offset: 80)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !135, file: !38, line: 296, baseType: !34, size: 8, offset: 88)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !135, file: !38, line: 296, baseType: !36, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !135, file: !38, line: 296, baseType: !81, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !135, file: !38, line: 297, baseType: !145, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !103, line: 52, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!105, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !103, line: 50, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !40, line: 100, size: 1472, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !159, !160, !237, !251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262, !263, !264, !265, !290, !291, !292, !293, !294, !297}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !151, file: !40, line: 101, baseType: !36, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !151, file: !40, line: 101, baseType: !34, size: 8, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !151, file: !40, line: 101, baseType: !34, size: 8, offset: 72)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !151, file: !40, line: 102, baseType: !34, size: 8, offset: 80)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !151, file: !40, line: 103, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !38, line: 193, baseType: !91)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !151, file: !40, line: 104, baseType: !158, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !151, file: !40, line: 105, baseType: !161, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !40, line: 94, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !40, line: 68, size: 3456, elements: !164)
!164 = !{!165, !174, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !199, !200, !201, !202, !203, !204, !205, !206, !207, !209, !227, !231}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !163, file: !40, line: 69, baseType: !166, size: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !40, line: 42, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !40, line: 38, size: 128, elements: !168)
!168 = !{!169, !171, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !167, file: !40, line: 39, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !167, file: !40, line: 40, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !28, line: 18, baseType: !5)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !40, line: 41, baseType: !105, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !163, file: !40, line: 70, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !103, line: 66, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!26, !26, !26, !29, !29}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !163, file: !40, line: 71, baseType: !26, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !163, file: !40, line: 72, baseType: !34, size: 8, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !163, file: !40, line: 73, baseType: !34, size: 8, offset: 264)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !163, file: !40, line: 74, baseType: !105, size: 32, offset: 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !163, file: !40, line: 75, baseType: !36, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !163, file: !40, line: 76, baseType: !170, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !163, file: !40, line: 77, baseType: !36, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !163, file: !40, line: 78, baseType: !36, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !163, file: !40, line: 79, baseType: !36, size: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !163, file: !40, line: 80, baseType: !36, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !163, file: !40, line: 81, baseType: !190, size: 192, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !191, line: 28, baseType: !192)
!191 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !191, line: 24, size: 192, elements: !193)
!193 = !{!194, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !192, file: !191, line: 25, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !192, file: !191, line: 26, baseType: !29, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !192, file: !191, line: 27, baseType: !29, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !163, file: !40, line: 82, baseType: !27, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !163, file: !40, line: 83, baseType: !27, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !163, file: !40, line: 84, baseType: !27, size: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !163, file: !40, line: 85, baseType: !27, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !163, file: !40, line: 86, baseType: !105, size: 32, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !163, file: !40, line: 87, baseType: !105, size: 32, offset: 1184)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !163, file: !40, line: 88, baseType: !145, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !163, file: !40, line: 89, baseType: !92, size: 128, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !163, file: !40, line: 90, baseType: !208, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !163, file: !40, line: 91, baseType: !210, size: 320, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !38, line: 284, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !38, line: 274, size: 320, elements: !212)
!212 = !{!213, !214, !215, !216, !217}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !38, line: 275, baseType: !36, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !211, file: !38, line: 275, baseType: !34, size: 8, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !211, file: !38, line: 275, baseType: !34, size: 8, offset: 72)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !211, file: !38, line: 276, baseType: !91, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !211, file: !38, line: 283, baseType: !218, size: 128, offset: 192)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !211, file: !38, line: 277, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !218, file: !38, line: 278, baseType: !92, size: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !218, file: !38, line: 282, baseType: !222, size: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !38, line: 279, size: 128, elements: !223)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !38, line: 280, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !38, line: 281, baseType: !225, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !163, file: !40, line: 92, baseType: !228, size: 576, offset: 1792)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 576, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 9)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !163, file: !40, line: 93, baseType: !232, size: 1088, offset: 2368)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 1088, elements: !235)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !38, line: 207, baseType: !50)
!235 = !{!236}
!236 = !DISubrange(count: 17)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !151, file: !40, line: 106, baseType: !238, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !40, line: 55, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !40, line: 48, size: 320, elements: !241)
!241 = !{!242, !243, !244, !245, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !240, file: !40, line: 49, baseType: !158, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !240, file: !40, line: 50, baseType: !158, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !240, file: !40, line: 51, baseType: !158, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !240, file: !40, line: 52, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !28, line: 88, baseType: !172)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !240, file: !40, line: 53, baseType: !105, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !240, file: !40, line: 54, baseType: !105, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !151, file: !40, line: 107, baseType: !246, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !151, file: !40, line: 108, baseType: !158, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !151, file: !40, line: 109, baseType: !158, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !151, file: !40, line: 110, baseType: !238, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !151, file: !40, line: 111, baseType: !238, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !151, file: !40, line: 112, baseType: !105, size: 32, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !151, file: !40, line: 113, baseType: !105, size: 32, offset: 736)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !151, file: !40, line: 114, baseType: !259, size: 16, offset: 768)
!259 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !151, file: !40, line: 115, baseType: !259, size: 16, offset: 784)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !151, file: !40, line: 116, baseType: !34, size: 8, offset: 800)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !151, file: !40, line: 117, baseType: !34, size: 8, offset: 808)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !151, file: !40, line: 118, baseType: !105, size: 32, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !151, file: !40, line: 119, baseType: !105, size: 32, offset: 864)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !151, file: !40, line: 120, baseType: !266, size: 64, offset: 896)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !103, line: 330, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !149, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !103, line: 326, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !103, line: 346, size: 960, elements: !273)
!273 = !{!274, !275, !278, !279, !280, !281, !282, !283, !284, !285, !289}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !272, file: !103, line: 347, baseType: !105, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !103, line: 348, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !272, file: !103, line: 349, baseType: !276, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !272, file: !103, line: 350, baseType: !276, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !272, file: !103, line: 351, baseType: !276, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !272, file: !103, line: 352, baseType: !105, size: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !272, file: !103, line: 353, baseType: !105, size: 32, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !272, file: !103, line: 354, baseType: !105, size: 32, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !272, file: !103, line: 355, baseType: !105, size: 32, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !272, file: !103, line: 356, baseType: !286, size: 480, offset: 448)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 480, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 60)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !272, file: !103, line: 358, baseType: !105, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !151, file: !40, line: 121, baseType: !92, size: 128, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !151, file: !40, line: 122, baseType: !92, size: 128, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !151, file: !40, line: 123, baseType: !36, size: 64, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !151, file: !40, line: 124, baseType: !36, size: 64, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !151, file: !40, line: 125, baseType: !295, size: 64, offset: 1344)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !40, line: 18, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !151, file: !40, line: 126, baseType: !298, size: 64, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !299, line: 49, baseType: !60)
!299 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!300 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !135, file: !38, line: 298, baseType: !301, size: 128, offset: 320)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !131, file: !38, line: 311, baseType: !305, size: 384)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !38, line: 306, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !38, line: 302, size: 384, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !352}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !38, line: 303, baseType: !36, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !306, file: !38, line: 303, baseType: !34, size: 8, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !306, file: !38, line: 303, baseType: !34, size: 8, offset: 72)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !306, file: !38, line: 303, baseType: !34, size: 8, offset: 80)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !306, file: !38, line: 303, baseType: !34, size: 8, offset: 88)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !306, file: !38, line: 303, baseType: !36, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !306, file: !38, line: 303, baseType: !81, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !306, file: !38, line: 304, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !38, line: 231, size: 960, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !325, !327, !329, !336, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !38, line: 232, baseType: !36, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !317, file: !38, line: 232, baseType: !34, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !317, file: !38, line: 232, baseType: !34, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !317, file: !38, line: 233, baseType: !91, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !317, file: !38, line: 234, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !317, file: !38, line: 235, baseType: !326, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !317, file: !38, line: 236, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !317, file: !38, line: 237, baseType: !330, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !38, line: 262, size: 128, elements: !332)
!332 = !{!333, !334, !335}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !331, file: !38, line: 263, baseType: !233, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !331, file: !38, line: 264, baseType: !105, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !331, file: !38, line: 265, baseType: !105, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !317, file: !38, line: 238, baseType: !337, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !317, file: !38, line: 239, baseType: !233, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !317, file: !38, line: 240, baseType: !105, size: 32, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !317, file: !38, line: 241, baseType: !105, size: 32, offset: 608)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !317, file: !38, line: 242, baseType: !105, size: 32, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !317, file: !38, line: 243, baseType: !105, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !317, file: !38, line: 244, baseType: !105, size: 32, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !317, file: !38, line: 245, baseType: !105, size: 32, offset: 736)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !317, file: !38, line: 246, baseType: !105, size: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !317, file: !38, line: 247, baseType: !105, size: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !317, file: !38, line: 248, baseType: !36, size: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !317, file: !38, line: 249, baseType: !34, size: 8, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !317, file: !38, line: 250, baseType: !34, size: 8, offset: 904)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !317, file: !38, line: 251, baseType: !34, size: 8, offset: 912)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !317, file: !38, line: 252, baseType: !34, size: 8, offset: 920)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !306, file: !38, line: 305, baseType: !353, size: 64, offset: 320)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !302)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !39, file: !40, line: 141, baseType: !82, size: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !39, file: !40, line: 142, baseType: !317, size: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !39, file: !40, line: 143, baseType: !211, size: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !39, file: !40, line: 144, baseType: !151, size: 1472)
!359 = !{i32 2, !"Dwarf Version", i32 4}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{i32 1, !"wchar_size", i32 4}
!362 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!363 = distinct !DISubprogram(name: "luaC_separateudata", scope: !1, file: !1, line: 128, type: !364, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!29, !149, !105}
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DILocalVariable(name: "L", arg: 1, scope: !363, file: !1, line: 128, type: !149)
!368 = !DILocalVariable(name: "all", arg: 2, scope: !363, file: !1, line: 128, type: !105)
!369 = !DILocalVariable(name: "g", scope: !363, file: !1, line: 129, type: !161)
!370 = !DILocalVariable(name: "deadmem", scope: !363, file: !1, line: 130, type: !29)
!371 = !DILocalVariable(name: "p", scope: !363, file: !1, line: 131, type: !170)
!372 = !DILocalVariable(name: "curr", scope: !363, file: !1, line: 132, type: !36)
!373 = !DILocation(line: 128, column: 39, scope: !363)
!374 = !DILocation(line: 128, column: 46, scope: !363)
!375 = !DILocation(line: 129, column: 21, scope: !363)
!376 = !{!377, !378, i64 32}
!377 = !{!"lua_State", !378, i64 0, !379, i64 8, !379, i64 9, !379, i64 10, !378, i64 16, !378, i64 24, !378, i64 32, !378, i64 40, !378, i64 48, !378, i64 56, !378, i64 64, !378, i64 72, !378, i64 80, !381, i64 88, !381, i64 92, !382, i64 96, !382, i64 98, !379, i64 100, !379, i64 101, !381, i64 104, !381, i64 108, !378, i64 112, !383, i64 120, !383, i64 136, !378, i64 152, !378, i64 160, !378, i64 168, !384, i64 176}
!378 = !{!"any pointer", !379, i64 0}
!379 = !{!"omnipotent char", !380, i64 0}
!380 = !{!"Simple C/C++ TBAA"}
!381 = !{!"int", !379, i64 0}
!382 = !{!"short", !379, i64 0}
!383 = !{!"lua_TValue", !379, i64 0, !381, i64 8}
!384 = !{!"long", !379, i64 0}
!385 = !DILocation(line: 129, column: 17, scope: !363)
!386 = !DILocation(line: 130, column: 10, scope: !363)
!387 = !DILocation(line: 131, column: 22, scope: !363)
!388 = !{!389, !378, i64 176}
!389 = !{!"global_State", !390, i64 0, !378, i64 16, !378, i64 24, !379, i64 32, !379, i64 33, !381, i64 36, !378, i64 40, !378, i64 48, !378, i64 56, !378, i64 64, !378, i64 72, !378, i64 80, !391, i64 88, !384, i64 112, !384, i64 120, !384, i64 128, !384, i64 136, !381, i64 144, !381, i64 148, !378, i64 152, !383, i64 160, !378, i64 176, !392, i64 184, !379, i64 224, !379, i64 296}
!390 = !{!"stringtable", !378, i64 0, !381, i64 8, !381, i64 12}
!391 = !{!"Mbuffer", !378, i64 0, !384, i64 8, !384, i64 16}
!392 = !{!"UpVal", !378, i64 0, !379, i64 8, !379, i64 9, !378, i64 16, !379, i64 24}
!393 = !DILocation(line: 131, column: 34, scope: !363)
!394 = !DILocation(line: 131, column: 14, scope: !363)
!395 = !DILocation(line: 133, column: 18, scope: !363)
!396 = !{!378, !378, i64 0}
!397 = !DILocation(line: 132, column: 13, scope: !363)
!398 = !DILocation(line: 133, column: 22, scope: !363)
!399 = !DILocation(line: 133, column: 3, scope: !363)
!400 = !DILocation(line: 134, column: 11, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !1, line: 134, column: 9)
