; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/liolib.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/liolib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.lua_State = type opaque
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "iolib", scope: !2, file: !3, line: 480, type: !287, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !234)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/liolib.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !30, !18, !230, !37, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !9, line: 66, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !11, line: 287, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !11, line: 181, size: 1408, elements: !13)
!13 = !{!14, !17, !19, !20, !22, !23, !28, !29, !31, !197, !203, !208, !212, !213, !214, !215, !217, !219, !220, !221, !223, !224, !228, !229}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !12, file: !11, line: 182, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !12, file: !11, line: 183, baseType: !18, size: 32, offset: 64)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !12, file: !11, line: 184, baseType: !18, size: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !12, file: !11, line: 185, baseType: !21, size: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !12, file: !11, line: 186, baseType: !21, size: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !12, file: !11, line: 187, baseType: !24, size: 128, offset: 192)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !11, line: 117, size: 128, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !11, line: 118, baseType: !15, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !11, line: 119, baseType: !18, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !12, file: !11, line: 188, baseType: !18, size: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !12, file: !11, line: 195, baseType: !30, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !12, file: !11, line: 197, baseType: !32, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !38, !30, !82, !18}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !36, line: 145, baseType: !37)
!36 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !11, line: 569, size: 14912, elements: !40)
!40 = !{!41, !42, !44, !45, !46, !47, !52, !53, !56, !57, !61, !76, !77, !78, !80, !81, !83, !161, !182, !183, !188, !195}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !39, file: !11, line: 571, baseType: !18, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !39, file: !11, line: 576, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !39, file: !11, line: 576, baseType: !43, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !39, file: !11, line: 576, baseType: !43, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !39, file: !11, line: 578, baseType: !18, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !39, file: !11, line: 579, baseType: !48, size: 200, offset: 288)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 200, elements: !50)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !{!51}
!51 = !DISubrange(count: 25)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !39, file: !11, line: 582, baseType: !18, size: 32, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !39, file: !11, line: 583, baseType: !54, size: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !11, line: 40, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !39, file: !11, line: 585, baseType: !18, size: 32, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !39, file: !11, line: 587, baseType: !58, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !38}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !39, file: !11, line: 590, baseType: !62, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !11, line: 47, size: 256, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !63, file: !11, line: 49, baseType: !62, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !63, file: !11, line: 50, baseType: !18, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !63, file: !11, line: 50, baseType: !18, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !63, file: !11, line: 50, baseType: !18, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !63, file: !11, line: 50, baseType: !18, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !63, file: !11, line: 51, baseType: !71, size: 32, offset: 192)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !74)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !11, line: 25, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !39, file: !11, line: 591, baseType: !18, size: 32, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !39, file: !11, line: 592, baseType: !62, size: 64, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !39, file: !11, line: 593, baseType: !79, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !39, file: !11, line: 596, baseType: !18, size: 32, offset: 1024)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !39, file: !11, line: 597, baseType: !82, size: 64, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !39, file: !11, line: 632, baseType: !84, size: 2880, offset: 1152)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !39, file: !11, line: 599, size: 2880, elements: !85)
!85 = !{!86, !152}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !84, file: !11, line: 622, baseType: !87, size: 1728)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !11, line: 601, size: 1728, elements: !88)
!88 = !{!89, !90, !91, !95, !107, !108, !110, !120, !135, !136, !137, !141, !145, !146, !147, !148, !149, !150, !151}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !87, file: !11, line: 603, baseType: !73, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !87, file: !11, line: 604, baseType: !82, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !87, file: !11, line: 605, baseType: !92, size: 208, offset: 128)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 208, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 26)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !87, file: !11, line: 606, baseType: !96, size: 288, offset: 352)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !11, line: 55, size: 288, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !96, file: !11, line: 57, baseType: !18, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !96, file: !11, line: 58, baseType: !18, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !96, file: !11, line: 59, baseType: !18, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !96, file: !11, line: 60, baseType: !18, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !96, file: !11, line: 61, baseType: !18, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !96, file: !11, line: 62, baseType: !18, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !96, file: !11, line: 63, baseType: !18, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !96, file: !11, line: 64, baseType: !18, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !96, file: !11, line: 65, baseType: !18, size: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !87, file: !11, line: 607, baseType: !18, size: 32, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !87, file: !11, line: 608, baseType: !109, size: 64, offset: 704)
!109 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !87, file: !11, line: 609, baseType: !111, size: 112, offset: 768)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !11, line: 319, size: 112, elements: !112)
!112 = !{!113, !118, !119}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !111, file: !11, line: 320, baseType: !114, size: 48)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 48, elements: !116)
!115 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!116 = !{!117}
!117 = !DISubrange(count: 3)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !111, file: !11, line: 321, baseType: !114, size: 48, offset: 48)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !111, file: !11, line: 322, baseType: !115, size: 16, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !87, file: !11, line: 610, baseType: !121, size: 64, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !36, line: 171, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 163, size: 64, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !122, file: !36, line: 165, baseType: !18, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !122, file: !36, line: 170, baseType: !126, size: 32, offset: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !122, file: !36, line: 166, size: 32, elements: !127)
!127 = !{!128, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !126, file: !36, line: 168, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !130, line: 124, baseType: !73)
!130 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !126, file: !36, line: 169, baseType: !132, size: 32)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 4)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !87, file: !11, line: 611, baseType: !121, size: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !87, file: !11, line: 612, baseType: !121, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !87, file: !11, line: 613, baseType: !138, size: 64, offset: 1088)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !87, file: !11, line: 614, baseType: !142, size: 192, offset: 1152)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 192, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 24)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !87, file: !11, line: 615, baseType: !18, size: 32, offset: 1344)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !87, file: !11, line: 616, baseType: !121, size: 64, offset: 1376)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !87, file: !11, line: 617, baseType: !121, size: 64, offset: 1440)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !87, file: !11, line: 618, baseType: !121, size: 64, offset: 1504)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !87, file: !11, line: 619, baseType: !121, size: 64, offset: 1568)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !87, file: !11, line: 620, baseType: !121, size: 64, offset: 1632)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !87, file: !11, line: 621, baseType: !18, size: 32, offset: 1696)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !84, file: !11, line: 631, baseType: !153, size: 2880)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !11, line: 626, size: 2880, elements: !154)
!154 = !{!155, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !153, file: !11, line: 629, baseType: !156, size: 1920)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1920, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 30)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !153, file: !11, line: 630, baseType: !160, size: 960, offset: 1920)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 960, elements: !157)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !39, file: !11, line: 636, baseType: !162, size: 64, offset: 4032)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !11, line: 93, size: 6336, elements: !164)
!164 = !{!165, !166, !167, !174}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !163, file: !11, line: 94, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !163, file: !11, line: 95, baseType: !18, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !163, file: !11, line: 97, baseType: !168, size: 2048, offset: 128)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 2048, elements: !172)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !{!173}
!173 = !DISubrange(count: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !163, file: !11, line: 98, baseType: !175, size: 4160, offset: 2176)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !11, line: 74, size: 4160, elements: !176)
!176 = !{!177, !179, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !175, file: !11, line: 75, baseType: !178, size: 2048)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, elements: !172)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !175, file: !11, line: 76, baseType: !178, size: 2048, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !175, file: !11, line: 78, baseType: !72, size: 32, offset: 4096)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !175, file: !11, line: 81, baseType: !72, size: 32, offset: 4128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !39, file: !11, line: 637, baseType: !163, size: 6336, offset: 4096)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !39, file: !11, line: 641, baseType: !184, size: 64, offset: 10432)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !18}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !39, file: !11, line: 646, baseType: !189, size: 192, offset: 10496)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !11, line: 291, size: 192, elements: !190)
!190 = !{!191, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !189, file: !11, line: 293, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !189, file: !11, line: 294, baseType: !18, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !189, file: !11, line: 295, baseType: !43, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !39, file: !11, line: 648, baseType: !196, size: 4224, offset: 10688)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4224, elements: !116)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !12, file: !11, line: 199, baseType: !198, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!35, !38, !30, !201, !18}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !12, file: !11, line: 202, baseType: !204, size: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !38, !30, !207, !18}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !36, line: 114, baseType: !37)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !12, file: !11, line: 203, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!18, !38, !30}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !12, file: !11, line: 206, baseType: !24, size: 128, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !12, file: !11, line: 207, baseType: !15, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !12, file: !11, line: 208, baseType: !18, size: 32, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !12, file: !11, line: 211, baseType: !216, size: 24, offset: 928)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, elements: !116)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !12, file: !11, line: 212, baseType: !218, size: 8, offset: 952)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !74)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !12, file: !11, line: 215, baseType: !24, size: 128, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !12, file: !11, line: 218, baseType: !18, size: 32, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !12, file: !11, line: 219, baseType: !222, size: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !36, line: 44, baseType: !37)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !12, file: !11, line: 222, baseType: !38, size: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !12, file: !11, line: 226, baseType: !225, size: 32, offset: 1280)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !36, line: 175, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !227, line: 12, baseType: !18)
!227 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !12, file: !11, line: 228, baseType: !121, size: 64, offset: 1312)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !12, file: !11, line: 229, baseType: !18, size: 32, offset: 1376)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !231, line: 40, baseType: !232)
!231 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !36, line: 129, baseType: !233)
!233 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!234 = !{!235, !255, !265, !269, !280, !0, !282}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "flib", scope: !2, file: !3, line: 496, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 1280, elements: !253)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !240, line: 38, baseType: !241)
!240 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !240, line: 35, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !240, line: 36, baseType: !201, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !241, file: !240, line: 37, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !246, line: 52, baseType: !247)
!246 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!18, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !246, line: 50, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !246, line: 50, flags: DIFlagFwdDecl)
!253 = !{!254}
!254 = !DISubrange(count: 10)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "mode", scope: !257, file: !3, line: 443, type: !263, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "f_seek", scope: !3, file: !3, line: 442, type: !248, isLocal: true, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DILocalVariable(name: "L", arg: 1, scope: !257, file: !3, line: 442, type: !250)
!260 = !DILocalVariable(name: "f", scope: !257, file: !3, line: 445, type: !7)
!261 = !DILocalVariable(name: "op", scope: !257, file: !3, line: 446, type: !18)
!262 = !DILocalVariable(name: "offset", scope: !257, file: !3, line: 447, type: !37)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 96, elements: !116)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "modenames", scope: !257, file: !3, line: 444, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 256, elements: !133)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "mode", scope: !271, file: !3, line: 459, type: !263, isLocal: true, isDefinition: true)
!271 = distinct !DISubprogram(name: "f_setvbuf", scope: !3, file: !3, line: 458, type: !248, isLocal: true, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !272)
!272 = !{!273, !274, !275, !276, !279}
!273 = !DILocalVariable(name: "L", arg: 1, scope: !271, file: !3, line: 458, type: !250)
!274 = !DILocalVariable(name: "f", scope: !271, file: !3, line: 461, type: !7)
!275 = !DILocalVariable(name: "op", scope: !271, file: !3, line: 462, type: !18)
!276 = !DILocalVariable(name: "sz", scope: !271, file: !3, line: 463, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Integer", file: !246, line: 103, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !130, line: 49, baseType: !37)
!279 = !DILocalVariable(name: "res", scope: !271, file: !3, line: 464, type: !18)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "modenames", scope: !271, file: !3, line: 460, type: !267, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "fnames", scope: !2, file: !3, line: 27, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 2)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 1536, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 12)
!290 = !{i32 2, !"Dwarf Version", i32 4}
!291 = !{i32 2, !"Debug Info Version", i32 3}
!292 = !{i32 1, !"wchar_size", i32 4}
!293 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!294 = distinct !DISubprogram(name: "luaopen_io", scope: !3, file: !3, line: 537, type: !248, isLocal: false, isDefinition: true, scopeLine: 537, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !295)
!295 = !{!296}
!296 = !DILocalVariable(name: "L", arg: 1, scope: !294, file: !3, line: 537, type: !250)
!297 = !DILocation(line: 537, column: 39, scope: !294)
!298 = !DILocalVariable(name: "L", arg: 1, scope: !299, file: !3, line: 510, type: !250)
!299 = distinct !DISubprogram(name: "createmeta", scope: !3, file: !3, line: 510, type: !300, isLocal: true, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !302)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !250}
!302 = !{!298}
!303 = !DILocation(line: 510, column: 36, scope: !299, inlinedAt: !304)
!304 = distinct !DILocation(line: 538, column: 3, scope: !294)
!305 = !DILocation(line: 511, column: 3, scope: !299, inlinedAt: !304)
!306 = !DILocation(line: 512, column: 3, scope: !299, inlinedAt: !304)
!307 = !DILocation(line: 513, column: 3, scope: !299, inlinedAt: !304)
!308 = !DILocation(line: 514, column: 3, scope: !299, inlinedAt: !304)
!309 = !DILocation(line: 515, column: 1, scope: !299, inlinedAt: !304)
!310 = !DILocalVariable(name: "L", arg: 1, scope: !311, file: !3, line: 530, type: !250)
!311 = distinct !DISubprogram(name: "newfenv", scope: !3, file: !3, line: 530, type: !312, isLocal: true, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !250, !245}
!314 = !{!310, !315}
!315 = !DILocalVariable(name: "cls", arg: 2, scope: !311, file: !3, line: 530, type: !245)
!316 = !DILocation(line: 530, column: 33, scope: !311, inlinedAt: !317)
!317 = distinct !DILocation(line: 540, column: 3, scope: !294)
!318 = !DILocation(line: 530, column: 50, scope: !311, inlinedAt: !317)
!319 = !DILocation(line: 531, column: 3, scope: !311, inlinedAt: !317)
!320 = !DILocation(line: 532, column: 3, scope: !311, inlinedAt: !317)
!321 = !DILocation(line: 533, column: 3, scope: !311, inlinedAt: !317)
!322 = !DILocation(line: 534, column: 1, scope: !311, inlinedAt: !317)
!323 = !DILocation(line: 541, column: 3, scope: !294)
!324 = !DILocation(line: 543, column: 3, scope: !294)
!325 = !DILocation(line: 530, column: 33, scope: !311, inlinedAt: !326)
!326 = distinct !DILocation(line: 545, column: 3, scope: !294)
!327 = !DILocation(line: 530, column: 50, scope: !311, inlinedAt: !326)
!328 = !DILocation(line: 531, column: 3, scope: !311, inlinedAt: !326)
!329 = !DILocation(line: 532, column: 3, scope: !311, inlinedAt: !326)
!330 = !DILocation(line: 533, column: 3, scope: !311, inlinedAt: !326)
!331 = !DILocation(line: 534, column: 1, scope: !311, inlinedAt: !326)
!332 = !DILocation(line: 546, column: 20, scope: !294)
!333 = !{!334, !338, i64 8}
!334 = !{!"_reent", !335, i64 0, !338, i64 8, !338, i64 16, !338, i64 24, !335, i64 32, !336, i64 36, !335, i64 64, !338, i64 72, !335, i64 80, !338, i64 88, !338, i64 96, !335, i64 104, !338, i64 112, !338, i64 120, !335, i64 128, !338, i64 136, !336, i64 144, !338, i64 504, !339, i64 512, !338, i64 1304, !341, i64 1312, !336, i64 1336}
!335 = !{!"int", !336, i64 0}
!336 = !{!"omnipotent char", !337, i64 0}
!337 = !{!"Simple C/C++ TBAA"}
!338 = !{!"any pointer", !336, i64 0}
!339 = !{!"_atexit", !338, i64 0, !335, i64 8, !336, i64 16, !340, i64 272}
!340 = !{!"_on_exit_args", !336, i64 0, !336, i64 256, !335, i64 512, !335, i64 516}
!341 = !{!"_glue", !338, i64 0, !335, i64 8, !338, i64 16}
!342 = !DILocalVariable(name: "L", arg: 1, scope: !343, file: !3, line: 518, type: !250)
!343 = distinct !DISubprogram(name: "createstdfile", scope: !3, file: !3, line: 518, type: !344, isLocal: true, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !250, !7, !18, !201}
!346 = !{!342, !347, !348, !349}
!347 = !DILocalVariable(name: "f", arg: 2, scope: !343, file: !3, line: 518, type: !7)
!348 = !DILocalVariable(name: "k", arg: 3, scope: !343, file: !3, line: 518, type: !18)
!349 = !DILocalVariable(name: "fname", arg: 4, scope: !343, file: !3, line: 518, type: !201)
!350 = !DILocation(line: 518, column: 39, scope: !343, inlinedAt: !351)
!351 = distinct !DILocation(line: 546, column: 3, scope: !294)
!352 = !DILocation(line: 518, column: 48, scope: !343, inlinedAt: !351)
!353 = !DILocation(line: 518, column: 55, scope: !343, inlinedAt: !351)
!354 = !DILocation(line: 518, column: 70, scope: !343, inlinedAt: !351)
!355 = !DILocalVariable(name: "L", arg: 1, scope: !356, file: !3, line: 86, type: !250)
!356 = distinct !DISubprogram(name: "newfile", scope: !3, file: !3, line: 86, type: !357, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{!6, !250}
!359 = !{!355, !360}
!360 = !DILocalVariable(name: "pf", scope: !356, file: !3, line: 87, type: !6)
!361 = !DILocation(line: 86, column: 35, scope: !356, inlinedAt: !362)
!362 = distinct !DILocation(line: 519, column: 4, scope: !343, inlinedAt: !351)
!363 = !DILocation(line: 87, column: 24, scope: !356, inlinedAt: !362)
!364 = !DILocation(line: 87, column: 15, scope: !356, inlinedAt: !362)
!365 = !DILocation(line: 87, column: 10, scope: !356, inlinedAt: !362)
!366 = !DILocation(line: 88, column: 7, scope: !356, inlinedAt: !362)
!367 = !{!338, !338, i64 0}
!368 = !DILocation(line: 89, column: 3, scope: !356, inlinedAt: !362)
!369 = !DILocation(line: 90, column: 3, scope: !356, inlinedAt: !362)
!370 = !DILocation(line: 91, column: 3, scope: !356, inlinedAt: !362)
!371 = !DILocation(line: 519, column: 15, scope: !343, inlinedAt: !351)
!372 = !DILocation(line: 521, column: 5, scope: !373, inlinedAt: !351)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 520, column: 14)
!374 = distinct !DILexicalBlock(scope: !343, file: !3, line: 520, column: 7)
!375 = !DILocation(line: 522, column: 5, scope: !373, inlinedAt: !351)
!376 = !DILocation(line: 524, column: 3, scope: !343, inlinedAt: !351)
!377 = !DILocation(line: 525, column: 3, scope: !343, inlinedAt: !351)
!378 = !DILocation(line: 526, column: 3, scope: !343, inlinedAt: !351)
!379 = !DILocation(line: 527, column: 1, scope: !343, inlinedAt: !351)
!380 = !DILocation(line: 547, column: 20, scope: !294)
!381 = !{!334, !338, i64 16}
!382 = !DILocation(line: 518, column: 39, scope: !343, inlinedAt: !383)
!383 = distinct !DILocation(line: 547, column: 3, scope: !294)
!384 = !DILocation(line: 518, column: 48, scope: !343, inlinedAt: !383)
!385 = !DILocation(line: 518, column: 55, scope: !343, inlinedAt: !383)
!386 = !DILocation(line: 518, column: 70, scope: !343, inlinedAt: !383)
!387 = !DILocation(line: 86, column: 35, scope: !356, inlinedAt: !388)
!388 = distinct !DILocation(line: 519, column: 4, scope: !343, inlinedAt: !383)
!389 = !DILocation(line: 87, column: 24, scope: !356, inlinedAt: !388)
!390 = !DILocation(line: 87, column: 15, scope: !356, inlinedAt: !388)
!391 = !DILocation(line: 87, column: 10, scope: !356, inlinedAt: !388)
!392 = !DILocation(line: 88, column: 7, scope: !356, inlinedAt: !388)
!393 = !DILocation(line: 89, column: 3, scope: !356, inlinedAt: !388)
!394 = !DILocation(line: 90, column: 3, scope: !356, inlinedAt: !388)
!395 = !DILocation(line: 91, column: 3, scope: !356, inlinedAt: !388)
!396 = !DILocation(line: 519, column: 15, scope: !343, inlinedAt: !383)
!397 = !DILocation(line: 521, column: 5, scope: !373, inlinedAt: !383)
!398 = !DILocation(line: 522, column: 5, scope: !373, inlinedAt: !383)
!399 = !DILocation(line: 524, column: 3, scope: !343, inlinedAt: !383)
!400 = !DILocation(line: 525, column: 3, scope: !343, inlinedAt: !383)
!401 = !DILocation(line: 526, column: 3, scope: !343, inlinedAt: !383)
!402 = !DILocation(line: 527, column: 1, scope: !343, inlinedAt: !383)
!403 = !DILocation(line: 548, column: 20, scope: !294)
!404 = !{!334, !338, i64 24}
!405 = !DILocation(line: 518, column: 39, scope: !343, inlinedAt: !406)
!406 = distinct !DILocation(line: 548, column: 3, scope: !294)
!407 = !DILocation(line: 518, column: 48, scope: !343, inlinedAt: !406)
!408 = !DILocation(line: 518, column: 55, scope: !343, inlinedAt: !406)
!409 = !DILocation(line: 518, column: 70, scope: !343, inlinedAt: !406)
!410 = !DILocation(line: 86, column: 35, scope: !356, inlinedAt: !411)
!411 = distinct !DILocation(line: 519, column: 4, scope: !343, inlinedAt: !406)
!412 = !DILocation(line: 87, column: 24, scope: !356, inlinedAt: !411)
!413 = !DILocation(line: 87, column: 15, scope: !356, inlinedAt: !411)
!414 = !DILocation(line: 87, column: 10, scope: !356, inlinedAt: !411)
!415 = !DILocation(line: 88, column: 7, scope: !356, inlinedAt: !411)
!416 = !DILocation(line: 89, column: 3, scope: !356, inlinedAt: !411)
!417 = !DILocation(line: 90, column: 3, scope: !356, inlinedAt: !411)
!418 = !DILocation(line: 91, column: 3, scope: !356, inlinedAt: !411)
!419 = !DILocation(line: 519, column: 15, scope: !343, inlinedAt: !406)
!420 = !DILocation(line: 524, column: 3, scope: !343, inlinedAt: !406)
!421 = !DILocation(line: 525, column: 3, scope: !343, inlinedAt: !406)
!422 = !DILocation(line: 526, column: 3, scope: !343, inlinedAt: !406)
!423 = !DILocation(line: 527, column: 1, scope: !343, inlinedAt: !406)
!424 = !DILocation(line: 549, column: 3, scope: !294)
!425 = !DILocation(line: 550, column: 3, scope: !294)
!426 = !DILocation(line: 530, column: 33, scope: !311, inlinedAt: !427)
!427 = distinct !DILocation(line: 551, column: 3, scope: !294)
!428 = !DILocation(line: 530, column: 50, scope: !311, inlinedAt: !427)
!429 = !DILocation(line: 531, column: 3, scope: !311, inlinedAt: !427)
!430 = !DILocation(line: 532, column: 3, scope: !311, inlinedAt: !427)
!431 = !DILocation(line: 533, column: 3, scope: !311, inlinedAt: !427)
!432 = !DILocation(line: 534, column: 1, scope: !311, inlinedAt: !427)
!433 = !DILocation(line: 552, column: 3, scope: !294)
!434 = !DILocation(line: 553, column: 3, scope: !294)
!435 = !DILocation(line: 554, column: 3, scope: !294)
!436 = distinct !DISubprogram(name: "io_fclose", scope: !3, file: !3, line: 119, type: !248, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !437)
!437 = !{!438, !439, !440}
!438 = !DILocalVariable(name: "L", arg: 1, scope: !436, file: !3, line: 119, type: !250)
!439 = !DILocalVariable(name: "p", scope: !436, file: !3, line: 120, type: !6)
!440 = !DILocalVariable(name: "ok", scope: !436, file: !3, line: 121, type: !18)
!441 = !DILocation(line: 119, column: 34, scope: !436)
!442 = !DILocation(line: 120, column: 14, scope: !436)
!443 = !DILocation(line: 120, column: 10, scope: !436)
!444 = !DILocation(line: 121, column: 20, scope: !436)
!445 = !DILocation(line: 121, column: 13, scope: !436)
!446 = !DILocation(line: 121, column: 24, scope: !436)
!447 = !DILocation(line: 122, column: 6, scope: !436)
!448 = !DILocalVariable(name: "L", arg: 1, scope: !449, file: !3, line: 30, type: !250)
!449 = distinct !DISubprogram(name: "pushresult", scope: !3, file: !3, line: 30, type: !450, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !452)
!450 = !DISubroutineType(types: !451)
!451 = !{!18, !250, !18, !201}
!452 = !{!448, !453, !454, !455}
!453 = !DILocalVariable(name: "i", arg: 2, scope: !449, file: !3, line: 30, type: !18)
!454 = !DILocalVariable(name: "filename", arg: 3, scope: !449, file: !3, line: 30, type: !201)
!455 = !DILocalVariable(name: "en", scope: !449, file: !3, line: 31, type: !18)
!456 = !DILocation(line: 30, column: 35, scope: !449, inlinedAt: !457)
!457 = distinct !DILocation(line: 123, column: 10, scope: !436)
!458 = !DILocation(line: 30, column: 57, scope: !449, inlinedAt: !457)
!459 = !DILocation(line: 31, column: 12, scope: !449, inlinedAt: !457)
!460 = !{!335, !335, i64 0}
!461 = !DILocation(line: 31, column: 7, scope: !449, inlinedAt: !457)
!462 = !DILocation(line: 32, column: 7, scope: !449, inlinedAt: !457)
!463 = !DILocation(line: 33, column: 5, scope: !464, inlinedAt: !457)
!464 = distinct !DILexicalBlock(scope: !465, file: !3, line: 32, column: 10)
!465 = distinct !DILexicalBlock(scope: !449, file: !3, line: 32, column: 7)
!466 = !DILocation(line: 34, column: 5, scope: !464, inlinedAt: !457)
!467 = !DILocation(line: 37, column: 5, scope: !468, inlinedAt: !457)
!468 = distinct !DILexicalBlock(scope: !465, file: !3, line: 36, column: 8)
!469 = !DILocation(line: 0, scope: !470, inlinedAt: !457)
!470 = distinct !DILexicalBlock(scope: !468, file: !3, line: 38, column: 9)
!471 = !DILocation(line: 41, column: 7, scope: !470, inlinedAt: !457)
!472 = !DILocation(line: 42, column: 24, scope: !468, inlinedAt: !457)
!473 = !DILocation(line: 42, column: 5, scope: !468, inlinedAt: !457)
!474 = !DILocation(line: 43, column: 5, scope: !468, inlinedAt: !457)
!475 = !DILocation(line: 0, scope: !468, inlinedAt: !457)
!476 = !DILocation(line: 45, column: 1, scope: !449, inlinedAt: !457)
!477 = !DILocation(line: 123, column: 3, scope: !436)
!478 = distinct !DISubprogram(name: "io_noclose", scope: !3, file: !3, line: 98, type: !248, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !479)
!479 = !{!480}
!480 = !DILocalVariable(name: "L", arg: 1, scope: !478, file: !3, line: 98, type: !250)
!481 = !DILocation(line: 98, column: 35, scope: !478)
!482 = !DILocation(line: 99, column: 3, scope: !478)
!483 = !DILocation(line: 100, column: 3, scope: !478)
!484 = !DILocation(line: 101, column: 3, scope: !478)
!485 = distinct !DISubprogram(name: "io_pclose", scope: !3, file: !3, line: 108, type: !248, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !486)
!486 = !{!487, !488, !489}
!487 = !DILocalVariable(name: "L", arg: 1, scope: !485, file: !3, line: 108, type: !250)
!488 = !DILocalVariable(name: "p", scope: !485, file: !3, line: 109, type: !6)
!489 = !DILocalVariable(name: "ok", scope: !485, file: !3, line: 110, type: !18)
!490 = !DILocation(line: 108, column: 34, scope: !485)
!491 = !DILocation(line: 109, column: 14, scope: !485)
!492 = !DILocation(line: 109, column: 10, scope: !485)
!493 = !DILocation(line: 110, column: 7, scope: !485)
!494 = !DILocation(line: 111, column: 6, scope: !485)
!495 = !DILocation(line: 30, column: 35, scope: !449, inlinedAt: !496)
!496 = distinct !DILocation(line: 112, column: 10, scope: !485)
!497 = !DILocation(line: 30, column: 42, scope: !449, inlinedAt: !496)
!498 = !DILocation(line: 30, column: 57, scope: !449, inlinedAt: !496)
!499 = !DILocation(line: 31, column: 12, scope: !449, inlinedAt: !496)
!500 = !DILocation(line: 31, column: 7, scope: !449, inlinedAt: !496)
!501 = !DILocation(line: 37, column: 5, scope: !468, inlinedAt: !496)
!502 = !DILocation(line: 0, scope: !470, inlinedAt: !496)
!503 = !DILocation(line: 41, column: 7, scope: !470, inlinedAt: !496)
!504 = !DILocation(line: 42, column: 24, scope: !468, inlinedAt: !496)
!505 = !DILocation(line: 42, column: 5, scope: !468, inlinedAt: !496)
!506 = !DILocation(line: 45, column: 1, scope: !449, inlinedAt: !496)
!507 = !DILocation(line: 112, column: 3, scope: !485)
!508 = distinct !DISubprogram(name: "io_close", scope: !3, file: !3, line: 134, type: !248, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !509)
!509 = !{!510}
!510 = !DILocalVariable(name: "L", arg: 1, scope: !508, file: !3, line: 134, type: !250)
!511 = !DILocation(line: 134, column: 33, scope: !508)
!512 = !DILocation(line: 135, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !508, file: !3, line: 135, column: 7)
!514 = !DILocation(line: 135, column: 7, scope: !508)
!515 = !DILocation(line: 136, column: 5, scope: !513)
!516 = !DILocalVariable(name: "L", arg: 1, scope: !517, file: !3, line: 72, type: !250)
!517 = distinct !DISubprogram(name: "tofile", scope: !3, file: !3, line: 72, type: !518, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!7, !250}
!520 = !{!516, !521}
!521 = !DILocalVariable(name: "f", scope: !517, file: !3, line: 73, type: !6)
!522 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !523)
!523 = distinct !DILocation(line: 137, column: 3, scope: !508)
!524 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !523)
!525 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !523)
!526 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !523)
!527 = distinct !DILexicalBlock(scope: !517, file: !3, line: 74, column: 7)
!528 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !523)
!529 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !523)
!530 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !523)
!531 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !523)
!532 = !DILocalVariable(name: "L", arg: 1, scope: !533, file: !3, line: 127, type: !250)
!533 = distinct !DISubprogram(name: "aux_close", scope: !3, file: !3, line: 127, type: !248, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !534)
!534 = !{!532}
!535 = !DILocation(line: 127, column: 34, scope: !533, inlinedAt: !536)
!536 = distinct !DILocation(line: 138, column: 10, scope: !508)
!537 = !DILocation(line: 128, column: 3, scope: !533, inlinedAt: !536)
!538 = !DILocation(line: 129, column: 3, scope: !533, inlinedAt: !536)
!539 = !DILocation(line: 130, column: 11, scope: !533, inlinedAt: !536)
!540 = !DILocation(line: 130, column: 10, scope: !533, inlinedAt: !536)
!541 = !DILocation(line: 130, column: 3, scope: !533, inlinedAt: !536)
!542 = !DILocation(line: 138, column: 3, scope: !508)
!543 = distinct !DISubprogram(name: "f_flush", scope: !3, file: !3, line: 475, type: !248, isLocal: true, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !544)
!544 = !{!545}
!545 = !DILocalVariable(name: "L", arg: 1, scope: !543, file: !3, line: 475, type: !250)
!546 = !DILocation(line: 475, column: 32, scope: !543)
!547 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !548)
!548 = distinct !DILocation(line: 476, column: 31, scope: !543)
!549 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !548)
!550 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !548)
!551 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !548)
!552 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !548)
!553 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !548)
!554 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !548)
!555 = !DILocation(line: 76, column: 10, scope: !517, inlinedAt: !548)
!556 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !548)
!557 = !DILocation(line: 476, column: 24, scope: !543)
!558 = !DILocation(line: 476, column: 42, scope: !543)
!559 = !DILocation(line: 30, column: 35, scope: !449, inlinedAt: !560)
!560 = distinct !DILocation(line: 476, column: 10, scope: !543)
!561 = !DILocation(line: 30, column: 57, scope: !449, inlinedAt: !560)
!562 = !DILocation(line: 31, column: 12, scope: !449, inlinedAt: !560)
!563 = !DILocation(line: 31, column: 7, scope: !449, inlinedAt: !560)
!564 = !DILocation(line: 32, column: 7, scope: !449, inlinedAt: !560)
!565 = !DILocation(line: 33, column: 5, scope: !464, inlinedAt: !560)
!566 = !DILocation(line: 34, column: 5, scope: !464, inlinedAt: !560)
!567 = !DILocation(line: 37, column: 5, scope: !468, inlinedAt: !560)
!568 = !DILocation(line: 0, scope: !470, inlinedAt: !560)
!569 = !DILocation(line: 41, column: 7, scope: !470, inlinedAt: !560)
!570 = !DILocation(line: 42, column: 24, scope: !468, inlinedAt: !560)
!571 = !DILocation(line: 42, column: 5, scope: !468, inlinedAt: !560)
!572 = !DILocation(line: 43, column: 5, scope: !468, inlinedAt: !560)
!573 = !DILocation(line: 0, scope: !468, inlinedAt: !560)
!574 = !DILocation(line: 45, column: 1, scope: !449, inlinedAt: !560)
!575 = !DILocation(line: 476, column: 3, scope: !543)
!576 = distinct !DISubprogram(name: "f_lines", scope: !3, file: !3, line: 241, type: !248, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !577)
!577 = !{!578}
!578 = !DILocalVariable(name: "L", arg: 1, scope: !576, file: !3, line: 241, type: !250)
!579 = !DILocation(line: 241, column: 32, scope: !576)
!580 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !581)
!581 = distinct !DILocation(line: 242, column: 3, scope: !576)
!582 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !581)
!583 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !581)
!584 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !581)
!585 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !581)
!586 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !581)
!587 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !581)
!588 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !581)
!589 = !DILocalVariable(name: "L", arg: 1, scope: !590, file: !3, line: 234, type: !250)
!590 = distinct !DISubprogram(name: "aux_lines", scope: !3, file: !3, line: 234, type: !591, isLocal: true, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !250, !18, !18}
!593 = !{!589, !594, !595}
!594 = !DILocalVariable(name: "idx", arg: 2, scope: !590, file: !3, line: 234, type: !18)
!595 = !DILocalVariable(name: "toclose", arg: 3, scope: !590, file: !3, line: 234, type: !18)
!596 = !DILocation(line: 234, column: 35, scope: !590, inlinedAt: !597)
!597 = distinct !DILocation(line: 243, column: 3, scope: !576)
!598 = !DILocation(line: 234, column: 42, scope: !590, inlinedAt: !597)
!599 = !DILocation(line: 234, column: 51, scope: !590, inlinedAt: !597)
!600 = !DILocation(line: 235, column: 3, scope: !590, inlinedAt: !597)
!601 = !DILocation(line: 236, column: 3, scope: !590, inlinedAt: !597)
!602 = !DILocation(line: 237, column: 3, scope: !590, inlinedAt: !597)
!603 = !DILocation(line: 238, column: 1, scope: !590, inlinedAt: !597)
!604 = !DILocation(line: 244, column: 3, scope: !576)
!605 = distinct !DISubprogram(name: "f_read", scope: !3, file: !3, line: 386, type: !248, isLocal: true, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !606)
!606 = !{!607}
!607 = !DILocalVariable(name: "L", arg: 1, scope: !605, file: !3, line: 386, type: !250)
!608 = !DILocation(line: 386, column: 31, scope: !605)
!609 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !610)
!610 = distinct !DILocation(line: 387, column: 20, scope: !605)
!611 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !610)
!612 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !610)
!613 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !610)
!614 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !610)
!615 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !610)
!616 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !610)
!617 = !DILocation(line: 76, column: 10, scope: !517, inlinedAt: !610)
!618 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !610)
!619 = !DILocation(line: 387, column: 10, scope: !605)
!620 = !DILocation(line: 387, column: 3, scope: !605)
!621 = !DILocation(line: 442, column: 31, scope: !257)
!622 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !623)
!623 = distinct !DILocation(line: 445, column: 13, scope: !257)
!624 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !623)
!625 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !623)
!626 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !623)
!627 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !623)
!628 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !623)
!629 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !623)
!630 = !DILocation(line: 76, column: 10, scope: !517, inlinedAt: !623)
!631 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !623)
!632 = !DILocation(line: 445, column: 9, scope: !257)
!633 = !DILocation(line: 446, column: 12, scope: !257)
!634 = !DILocation(line: 446, column: 7, scope: !257)
!635 = !DILocation(line: 447, column: 17, scope: !257)
!636 = !DILocation(line: 447, column: 8, scope: !257)
!637 = !DILocation(line: 448, column: 25, scope: !257)
!638 = !DILocation(line: 448, column: 8, scope: !257)
!639 = !DILocation(line: 449, column: 7, scope: !640)
!640 = distinct !DILexicalBlock(scope: !257, file: !3, line: 449, column: 7)
!641 = !DILocation(line: 449, column: 7, scope: !257)
!642 = !DILocation(line: 30, column: 35, scope: !449, inlinedAt: !643)
!643 = distinct !DILocation(line: 450, column: 12, scope: !640)
!644 = !DILocation(line: 30, column: 42, scope: !449, inlinedAt: !643)
!645 = !DILocation(line: 30, column: 57, scope: !449, inlinedAt: !643)
!646 = !DILocation(line: 31, column: 12, scope: !449, inlinedAt: !643)
!647 = !DILocation(line: 31, column: 7, scope: !449, inlinedAt: !643)
!648 = !DILocation(line: 37, column: 5, scope: !468, inlinedAt: !643)
!649 = !DILocation(line: 0, scope: !470, inlinedAt: !643)
!650 = !DILocation(line: 41, column: 7, scope: !470, inlinedAt: !643)
!651 = !DILocation(line: 42, column: 24, scope: !468, inlinedAt: !643)
!652 = !DILocation(line: 42, column: 5, scope: !468, inlinedAt: !643)
!653 = !DILocation(line: 45, column: 1, scope: !449, inlinedAt: !643)
!654 = !DILocation(line: 450, column: 5, scope: !640)
!655 = !DILocation(line: 452, column: 24, scope: !656)
!656 = distinct !DILexicalBlock(scope: !640, file: !3, line: 451, column: 8)
!657 = !DILocation(line: 452, column: 5, scope: !656)
!658 = !DILocation(line: 453, column: 5, scope: !656)
!659 = !DILocation(line: 0, scope: !656)
!660 = !DILocation(line: 455, column: 1, scope: !257)
!661 = !DILocation(line: 458, column: 34, scope: !271)
!662 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !663)
!663 = distinct !DILocation(line: 461, column: 13, scope: !271)
!664 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !663)
!665 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !663)
!666 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !663)
!667 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !663)
!668 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !663)
!669 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !663)
!670 = !DILocation(line: 76, column: 10, scope: !517, inlinedAt: !663)
!671 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !663)
!672 = !DILocation(line: 461, column: 9, scope: !271)
!673 = !DILocation(line: 462, column: 12, scope: !271)
!674 = !DILocation(line: 462, column: 7, scope: !271)
!675 = !DILocation(line: 463, column: 20, scope: !271)
!676 = !DILocation(line: 463, column: 15, scope: !271)
!677 = !DILocation(line: 464, column: 30, scope: !271)
!678 = !DILocation(line: 464, column: 13, scope: !271)
!679 = !DILocation(line: 464, column: 7, scope: !271)
!680 = !DILocation(line: 465, column: 28, scope: !271)
!681 = !DILocation(line: 30, column: 35, scope: !449, inlinedAt: !682)
!682 = distinct !DILocation(line: 465, column: 10, scope: !271)
!683 = !DILocation(line: 30, column: 57, scope: !449, inlinedAt: !682)
!684 = !DILocation(line: 31, column: 12, scope: !449, inlinedAt: !682)
!685 = !DILocation(line: 31, column: 7, scope: !449, inlinedAt: !682)
!686 = !DILocation(line: 32, column: 7, scope: !449, inlinedAt: !682)
!687 = !DILocation(line: 33, column: 5, scope: !464, inlinedAt: !682)
!688 = !DILocation(line: 34, column: 5, scope: !464, inlinedAt: !682)
!689 = !DILocation(line: 37, column: 5, scope: !468, inlinedAt: !682)
!690 = !DILocation(line: 0, scope: !470, inlinedAt: !682)
!691 = !DILocation(line: 41, column: 7, scope: !470, inlinedAt: !682)
!692 = !DILocation(line: 42, column: 24, scope: !468, inlinedAt: !682)
!693 = !DILocation(line: 42, column: 5, scope: !468, inlinedAt: !682)
!694 = !DILocation(line: 43, column: 5, scope: !468, inlinedAt: !682)
!695 = !DILocation(line: 0, scope: !468, inlinedAt: !682)
!696 = !DILocation(line: 45, column: 1, scope: !449, inlinedAt: !682)
!697 = !DILocation(line: 465, column: 3, scope: !271)
!698 = distinct !DISubprogram(name: "f_write", scope: !3, file: !3, line: 437, type: !248, isLocal: true, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !699)
!699 = !{!700}
!700 = !DILocalVariable(name: "L", arg: 1, scope: !698, file: !3, line: 437, type: !250)
!701 = !DILocation(line: 437, column: 32, scope: !698)
!702 = !DILocation(line: 72, column: 33, scope: !517, inlinedAt: !703)
!703 = distinct !DILocation(line: 438, column: 21, scope: !698)
!704 = !DILocation(line: 73, column: 14, scope: !517, inlinedAt: !703)
!705 = !DILocation(line: 73, column: 10, scope: !517, inlinedAt: !703)
!706 = !DILocation(line: 74, column: 7, scope: !527, inlinedAt: !703)
!707 = !DILocation(line: 74, column: 10, scope: !527, inlinedAt: !703)
!708 = !DILocation(line: 74, column: 7, scope: !517, inlinedAt: !703)
!709 = !DILocation(line: 75, column: 5, scope: !527, inlinedAt: !703)
!710 = !DILocation(line: 76, column: 10, scope: !517, inlinedAt: !703)
!711 = !DILocation(line: 76, column: 3, scope: !517, inlinedAt: !703)
!712 = !DILocation(line: 438, column: 10, scope: !698)
!713 = !DILocation(line: 438, column: 3, scope: !698)
!714 = distinct !DISubprogram(name: "io_gc", scope: !3, file: !3, line: 142, type: !248, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !715)
!715 = !{!716, !717}
!716 = !DILocalVariable(name: "L", arg: 1, scope: !714, file: !3, line: 142, type: !250)
!717 = !DILocalVariable(name: "f", scope: !714, file: !3, line: 143, type: !7)
!718 = !DILocation(line: 142, column: 30, scope: !714)
!719 = !DILocation(line: 143, column: 14, scope: !714)
!720 = !DILocation(line: 143, column: 13, scope: !714)
!721 = !DILocation(line: 143, column: 9, scope: !714)
!722 = !DILocation(line: 145, column: 9, scope: !723)
!723 = distinct !DILexicalBlock(scope: !714, file: !3, line: 145, column: 7)
!724 = !DILocation(line: 145, column: 7, scope: !714)
!725 = !DILocation(line: 127, column: 34, scope: !533, inlinedAt: !726)
!726 = distinct !DILocation(line: 146, column: 5, scope: !723)
!727 = !DILocation(line: 128, column: 3, scope: !533, inlinedAt: !726)
!728 = !DILocation(line: 129, column: 3, scope: !533, inlinedAt: !726)
!729 = !DILocation(line: 130, column: 11, scope: !533, inlinedAt: !726)
!730 = !DILocation(line: 130, column: 10, scope: !533, inlinedAt: !726)
!731 = !DILocation(line: 130, column: 3, scope: !533, inlinedAt: !726)
!732 = !DILocation(line: 146, column: 5, scope: !723)
!733 = !DILocation(line: 147, column: 3, scope: !714)
!734 = distinct !DISubprogram(name: "io_tostring", scope: !3, file: !3, line: 151, type: !248, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !735)
!735 = !{!736, !737}
!736 = !DILocalVariable(name: "L", arg: 1, scope: !734, file: !3, line: 151, type: !250)
!737 = !DILocalVariable(name: "f", scope: !734, file: !3, line: 152, type: !7)
!738 = !DILocation(line: 151, column: 36, scope: !734)
!739 = !DILocation(line: 152, column: 14, scope: !734)
!740 = !DILocation(line: 152, column: 13, scope: !734)
!741 = !DILocation(line: 152, column: 9, scope: !734)
!742 = !DILocation(line: 153, column: 9, scope: !743)
!743 = distinct !DILexicalBlock(scope: !734, file: !3, line: 153, column: 7)
!744 = !DILocation(line: 153, column: 7, scope: !734)
!745 = !DILocation(line: 154, column: 5, scope: !743)
!746 = !DILocation(line: 156, column: 5, scope: !743)
!747 = !DILocation(line: 157, column: 3, scope: !734)
!748 = distinct !DISubprogram(name: "io_readline", scope: !3, file: !3, line: 391, type: !248, isLocal: true, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !749)
!749 = !{!750, !751, !752}
!750 = !DILocalVariable(name: "L", arg: 1, scope: !748, file: !3, line: 391, type: !250)
!751 = !DILocalVariable(name: "f", scope: !748, file: !3, line: 392, type: !7)
!752 = !DILocalVariable(name: "sucess", scope: !748, file: !3, line: 393, type: !18)
!753 = !DILocation(line: 391, column: 36, scope: !748)
!754 = !DILocation(line: 392, column: 23, scope: !748)
!755 = !DILocation(line: 392, column: 14, scope: !748)
!756 = !DILocation(line: 392, column: 13, scope: !748)
!757 = !DILocation(line: 392, column: 9, scope: !748)
!758 = !DILocation(line: 394, column: 9, scope: !759)
!759 = distinct !DILexicalBlock(scope: !748, file: !3, line: 394, column: 7)
!760 = !DILocation(line: 394, column: 7, scope: !748)
!761 = !DILocation(line: 395, column: 5, scope: !759)
!762 = !DILocation(line: 396, column: 12, scope: !748)
!763 = !DILocation(line: 393, column: 7, scope: !748)
!764 = !DILocation(line: 397, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !748, file: !3, line: 397, column: 7)
!766 = !{!767, !768, i64 16}
!767 = !{!"__sFILE", !338, i64 0, !335, i64 8, !335, i64 12, !768, i64 16, !768, i64 18, !769, i64 24, !335, i64 40, !338, i64 48, !338, i64 56, !338, i64 64, !338, i64 72, !338, i64 80, !769, i64 88, !338, i64 104, !335, i64 112, !336, i64 116, !336, i64 119, !769, i64 120, !335, i64 136, !770, i64 144, !338, i64 152, !335, i64 160, !771, i64 164, !335, i64 172}
!768 = !{!"short", !336, i64 0}
!769 = !{!"__sbuf", !338, i64 0, !335, i64 8}
!770 = !{!"long", !336, i64 0}
!771 = !{!"", !335, i64 0, !336, i64 4}
!772 = !DILocation(line: 397, column: 7, scope: !748)
!773 = !DILocation(line: 398, column: 41, scope: !765)
!774 = !DILocation(line: 398, column: 32, scope: !765)
!775 = !DILocation(line: 398, column: 12, scope: !765)
!776 = !DILocation(line: 398, column: 5, scope: !765)
!777 = !DILocation(line: 399, column: 7, scope: !778)
!778 = distinct !DILexicalBlock(scope: !748, file: !3, line: 399, column: 7)
!779 = !DILocation(line: 399, column: 7, scope: !748)
!780 = !DILocation(line: 401, column: 9, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 401, column: 9)
!782 = distinct !DILexicalBlock(scope: !778, file: !3, line: 400, column: 8)
!783 = !DILocation(line: 401, column: 9, scope: !782)
!784 = !DILocation(line: 402, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !3, line: 401, column: 48)
!786 = !DILocation(line: 403, column: 7, scope: !785)
!787 = !DILocation(line: 127, column: 34, scope: !533, inlinedAt: !788)
!788 = distinct !DILocation(line: 404, column: 7, scope: !785)
!789 = !DILocation(line: 128, column: 3, scope: !533, inlinedAt: !788)
!790 = !DILocation(line: 129, column: 3, scope: !533, inlinedAt: !788)
!791 = !DILocation(line: 130, column: 11, scope: !533, inlinedAt: !788)
!792 = !DILocation(line: 130, column: 10, scope: !533, inlinedAt: !788)
!793 = !DILocation(line: 130, column: 3, scope: !533, inlinedAt: !788)
!794 = !DILocation(line: 405, column: 5, scope: !785)
!795 = !DILocation(line: 0, scope: !782)
!796 = !DILocation(line: 408, column: 1, scope: !748)
!797 = distinct !DISubprogram(name: "read_line", scope: !3, file: !3, line: 294, type: !798, isLocal: true, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!18, !250, !7}
!800 = !{!801, !802, !803, !814, !818}
!801 = !DILocalVariable(name: "L", arg: 1, scope: !797, file: !3, line: 294, type: !250)
!802 = !DILocalVariable(name: "f", arg: 2, scope: !797, file: !3, line: 294, type: !7)
!803 = !DILocalVariable(name: "b", scope: !797, file: !3, line: 295, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Buffer", file: !240, line: 134, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Buffer", file: !240, line: 129, size: 8384, elements: !806)
!806 = !{!807, !808, !809, !810}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !805, file: !240, line: 130, baseType: !82, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !805, file: !240, line: 131, baseType: !18, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !805, file: !240, line: 132, baseType: !250, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !805, file: !240, line: 133, baseType: !811, size: 8192, offset: 192)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8192, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 1024)
!814 = !DILocalVariable(name: "l", scope: !815, file: !3, line: 298, type: !230)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 297, column: 12)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 297, column: 3)
!817 = distinct !DILexicalBlock(scope: !797, file: !3, line: 297, column: 3)
!818 = !DILocalVariable(name: "p", scope: !815, file: !3, line: 299, type: !82)
!819 = !DILocation(line: 294, column: 34, scope: !797)
!820 = !DILocation(line: 294, column: 43, scope: !797)
!821 = !DILocation(line: 295, column: 3, scope: !797)
!822 = !DILocation(line: 295, column: 15, scope: !797)
!823 = !DILocation(line: 296, column: 3, scope: !797)
!824 = !DILocation(line: 299, column: 15, scope: !815)
!825 = !DILocation(line: 299, column: 11, scope: !815)
!826 = !DILocation(line: 300, column: 9, scope: !827)
!827 = distinct !DILexicalBlock(scope: !815, file: !3, line: 300, column: 9)
!828 = !DILocation(line: 300, column: 38, scope: !827)
!829 = !DILocation(line: 300, column: 9, scope: !815)
!830 = !DILocation(line: 301, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !827, file: !3, line: 300, column: 47)
!832 = !DILocation(line: 302, column: 15, scope: !831)
!833 = !DILocation(line: 302, column: 33, scope: !831)
!834 = !DILocation(line: 302, column: 7, scope: !831)
!835 = !DILocation(line: 304, column: 9, scope: !815)
!836 = !DILocation(line: 298, column: 12, scope: !815)
!837 = !DILocation(line: 305, column: 11, scope: !838)
!838 = distinct !DILexicalBlock(scope: !815, file: !3, line: 305, column: 9)
!839 = !DILocation(line: 305, column: 16, scope: !838)
!840 = !DILocation(line: 305, column: 22, scope: !838)
!841 = !DILocation(line: 305, column: 19, scope: !838)
!842 = !{!336, !336, i64 0}
!843 = !DILocation(line: 305, column: 26, scope: !838)
!844 = !DILocation(line: 305, column: 9, scope: !815)
!845 = !DILocation(line: 308, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !838, file: !3, line: 307, column: 10)
!847 = !{!848, !338, i64 0}
!848 = !{!"luaL_Buffer", !338, i64 0, !335, i64 8, !338, i64 16, !336, i64 24}
!849 = !DILocation(line: 309, column: 7, scope: !846)
!850 = !DILocation(line: 310, column: 7, scope: !846)
!851 = !DILocation(line: 306, column: 7, scope: !838)
!852 = !DILocation(line: 313, column: 1, scope: !797)
!853 = distinct !DISubprogram(name: "g_read", scope: !3, file: !3, line: 334, type: !854, isLocal: true, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !856)
!854 = !DISubroutineType(types: !855)
!855 = !{!18, !250, !7, !18}
!856 = !{!857, !858, !859, !860, !861, !862, !863, !871}
!857 = !DILocalVariable(name: "L", arg: 1, scope: !853, file: !3, line: 334, type: !250)
!858 = !DILocalVariable(name: "f", arg: 2, scope: !853, file: !3, line: 334, type: !7)
!859 = !DILocalVariable(name: "first", arg: 3, scope: !853, file: !3, line: 334, type: !18)
!860 = !DILocalVariable(name: "nargs", scope: !853, file: !3, line: 335, type: !18)
!861 = !DILocalVariable(name: "success", scope: !853, file: !3, line: 336, type: !18)
!862 = !DILocalVariable(name: "n", scope: !853, file: !3, line: 337, type: !18)
!863 = !DILocalVariable(name: "l", scope: !864, file: !3, line: 348, type: !230)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 347, column: 42)
!865 = distinct !DILexicalBlock(scope: !866, file: !3, line: 347, column: 11)
!866 = distinct !DILexicalBlock(scope: !867, file: !3, line: 346, column: 46)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 346, column: 5)
!868 = distinct !DILexicalBlock(scope: !869, file: !3, line: 346, column: 5)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 343, column: 8)
