; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lmonetary.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lmonetary.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_monetary_T = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "empty", scope: !2, file: !3, line: 35, type: !35, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lmonetary.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !0, !30}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "_C_monetary_locale", scope: !2, file: !3, line: 41, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_monetary_T", file: !10, line: 68, size: 960, elements: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !9, file: !10, line: 70, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !9, file: !10, line: 71, baseType: !13, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !9, file: !10, line: 72, baseType: !13, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !9, file: !10, line: 73, baseType: !13, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !9, file: !10, line: 74, baseType: !13, size: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !9, file: !10, line: 75, baseType: !13, size: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !9, file: !10, line: 76, baseType: !13, size: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !9, file: !10, line: 77, baseType: !13, size: 64, offset: 448)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !9, file: !10, line: 78, baseType: !13, size: 64, offset: 512)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !9, file: !10, line: 79, baseType: !13, size: 64, offset: 576)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !9, file: !10, line: 80, baseType: !13, size: 64, offset: 640)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !9, file: !10, line: 81, baseType: !13, size: 64, offset: 704)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !9, file: !10, line: 82, baseType: !13, size: 64, offset: 768)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !9, file: !10, line: 83, baseType: !13, size: 64, offset: 832)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !9, file: !10, line: 84, baseType: !13, size: 64, offset: 896)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "numempty", scope: !2, file: !3, line: 36, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1)
!38 = !{i32 2, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!42 = distinct !DISubprogram(name: "__monetary_load_locale", scope: !3, file: !3, line: 89, type: !43, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !316)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !46, !13, !83, !13}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !10, line: 178, size: 3392, elements: !48)
!48 = !{!49, !54, !273, !282, !283, !284, !312, !313, !315}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !47, file: !10, line: 180, baseType: !50, size: 1792)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1792, elements: !51)
!51 = !{!52, !53}
!52 = !DISubrange(count: 7)
!53 = !DISubrange(count: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !47, file: !10, line: 181, baseType: !55, size: 64, offset: 1792)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!45, !58, !91, !269, !270}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !60, line: 569, size: 14912, elements: !61)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !{!62, !63, !140, !141, !142, !143, !147, !148, !149, !150, !154, !166, !167, !168, !170, !171, !172, !234, !254, !255, !260, !267}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !59, file: !60, line: 571, baseType: !45, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !60, line: 287, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !60, line: 181, size: 1408, elements: !67)
!67 = !{!68, !71, !72, !73, !75, !76, !81, !82, !84, !92, !96, !101, !105, !106, !107, !108, !112, !114, !115, !116, !118, !119, !123, !139}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !66, file: !60, line: 182, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !66, file: !60, line: 183, baseType: !45, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !66, file: !60, line: 184, baseType: !45, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !60, line: 185, baseType: !74, size: 16, offset: 128)
!74 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !66, file: !60, line: 186, baseType: !74, size: 16, offset: 144)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !66, file: !60, line: 187, baseType: !77, size: 128, offset: 192)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !60, line: 117, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !77, file: !60, line: 118, baseType: !69, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !77, file: !60, line: 119, baseType: !45, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !66, file: !60, line: 188, baseType: !45, size: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !66, file: !60, line: 195, baseType: !83, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !66, file: !60, line: 197, baseType: !85, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !58, !83, !91, !45}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !89, line: 145, baseType: !90)
!89 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !66, file: !60, line: 199, baseType: !93, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!88, !58, !83, !13, !45}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !66, file: !60, line: 202, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !58, !83, !100, !45}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !89, line: 114, baseType: !90)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !66, file: !60, line: 203, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!45, !58, !83}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !66, file: !60, line: 206, baseType: !77, size: 128, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !66, file: !60, line: 207, baseType: !69, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !66, file: !60, line: 208, baseType: !45, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !66, file: !60, line: 211, baseType: !109, size: 24, offset: 928)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 24, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !66, file: !60, line: 212, baseType: !113, size: 8, offset: 952)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !36)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !66, file: !60, line: 215, baseType: !77, size: 128, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !66, file: !60, line: 218, baseType: !45, size: 32, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !60, line: 219, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !89, line: 44, baseType: !90)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !66, file: !60, line: 222, baseType: !58, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !60, line: 226, baseType: !120, size: 32, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !89, line: 175, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !122, line: 12, baseType: !45)
!122 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !66, file: !60, line: 228, baseType: !124, size: 64, offset: 1312)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !89, line: 171, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 163, size: 64, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !125, file: !89, line: 165, baseType: !45, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !125, file: !89, line: 170, baseType: !129, size: 32, offset: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !89, line: 166, size: 32, elements: !130)
!130 = !{!131, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !129, file: !89, line: 168, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !133, line: 124, baseType: !134)
!133 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !129, file: !89, line: 169, baseType: !136, size: 32)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !60, line: 229, baseType: !45, size: 32, offset: 1376)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !59, file: !60, line: 578, baseType: !45, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !59, file: !60, line: 579, baseType: !144, size: 200, offset: 288)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 200, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 25)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !59, file: !60, line: 582, baseType: !45, size: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !59, file: !60, line: 583, baseType: !46, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !59, file: !60, line: 585, baseType: !45, size: 32, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !59, file: !60, line: 587, baseType: !151, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !58}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !59, file: !60, line: 590, baseType: !155, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !60, line: 47, size: 256, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !156, file: !60, line: 49, baseType: !155, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !156, file: !60, line: 50, baseType: !45, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !156, file: !60, line: 50, baseType: !45, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !156, file: !60, line: 50, baseType: !45, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !156, file: !60, line: 50, baseType: !45, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !156, file: !60, line: 51, baseType: !164, size: 32, offset: 192)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 32, elements: !36)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !60, line: 25, baseType: !134)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !59, file: !60, line: 591, baseType: !45, size: 32, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !59, file: !60, line: 592, baseType: !155, size: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !59, file: !60, line: 593, baseType: !169, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !59, file: !60, line: 596, baseType: !45, size: 32, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !59, file: !60, line: 597, baseType: !91, size: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !59, file: !60, line: 632, baseType: !173, size: 2880, offset: 1152)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !60, line: 599, size: 2880, elements: !174)
!174 = !{!175, !225}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !173, file: !60, line: 622, baseType: !176, size: 1728)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !60, line: 601, size: 1728, elements: !177)
!177 = !{!178, !179, !180, !184, !196, !197, !199, !207, !208, !209, !210, !214, !218, !219, !220, !221, !222, !223, !224}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !176, file: !60, line: 603, baseType: !134, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !176, file: !60, line: 604, baseType: !91, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !176, file: !60, line: 605, baseType: !181, size: 208, offset: 128)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 208, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 26)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !176, file: !60, line: 606, baseType: !185, size: 288, offset: 352)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !60, line: 55, size: 288, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !185, file: !60, line: 57, baseType: !45, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !185, file: !60, line: 58, baseType: !45, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !185, file: !60, line: 59, baseType: !45, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !185, file: !60, line: 60, baseType: !45, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !185, file: !60, line: 61, baseType: !45, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !185, file: !60, line: 62, baseType: !45, size: 32, offset: 160)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !185, file: !60, line: 63, baseType: !45, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !185, file: !60, line: 64, baseType: !45, size: 32, offset: 224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !185, file: !60, line: 65, baseType: !45, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !176, file: !60, line: 607, baseType: !45, size: 32, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !176, file: !60, line: 608, baseType: !198, size: 64, offset: 704)
!198 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !176, file: !60, line: 609, baseType: !200, size: 112, offset: 768)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !60, line: 319, size: 112, elements: !201)
!201 = !{!202, !205, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !200, file: !60, line: 320, baseType: !203, size: 48)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 48, elements: !110)
!204 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !200, file: !60, line: 321, baseType: !203, size: 48, offset: 48)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !200, file: !60, line: 322, baseType: !204, size: 16, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !176, file: !60, line: 610, baseType: !124, size: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !176, file: !60, line: 611, baseType: !124, size: 64, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !176, file: !60, line: 612, baseType: !124, size: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !176, file: !60, line: 613, baseType: !211, size: 64, offset: 1088)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !176, file: !60, line: 614, baseType: !215, size: 192, offset: 1152)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 24)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !176, file: !60, line: 615, baseType: !45, size: 32, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !176, file: !60, line: 616, baseType: !124, size: 64, offset: 1376)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !176, file: !60, line: 617, baseType: !124, size: 64, offset: 1440)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !176, file: !60, line: 618, baseType: !124, size: 64, offset: 1504)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !176, file: !60, line: 619, baseType: !124, size: 64, offset: 1568)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !176, file: !60, line: 620, baseType: !124, size: 64, offset: 1632)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !176, file: !60, line: 621, baseType: !45, size: 32, offset: 1696)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !173, file: !60, line: 631, baseType: !226, size: 2880)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !60, line: 626, size: 2880, elements: !227)
!227 = !{!228, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !226, file: !60, line: 629, baseType: !229, size: 1920)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1920, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 30)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !226, file: !60, line: 630, baseType: !233, size: 960, offset: 1920)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 960, elements: !230)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !59, file: !60, line: 636, baseType: !235, size: 64, offset: 4032)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !60, line: 93, size: 6336, elements: !237)
!237 = !{!238, !239, !240, !246}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !236, file: !60, line: 94, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !236, file: !60, line: 95, baseType: !45, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !236, file: !60, line: 97, baseType: !241, size: 2048, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 2048, elements: !245)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null}
!245 = !{!53}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !236, file: !60, line: 98, baseType: !247, size: 4160, offset: 2176)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !60, line: 74, size: 4160, elements: !248)
!248 = !{!249, !251, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !247, file: !60, line: 75, baseType: !250, size: 2048)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2048, elements: !245)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !247, file: !60, line: 76, baseType: !250, size: 2048, offset: 2048)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !247, file: !60, line: 78, baseType: !165, size: 32, offset: 4096)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !247, file: !60, line: 81, baseType: !165, size: 32, offset: 4128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !59, file: !60, line: 637, baseType: !236, size: 6336, offset: 4096)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !59, file: !60, line: 641, baseType: !256, size: 64, offset: 10432)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !45}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !59, file: !60, line: 646, baseType: !261, size: 192, offset: 10496)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !60, line: 291, size: 192, elements: !262)
!262 = !{!263, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !261, file: !60, line: 293, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !261, file: !60, line: 294, baseType: !45, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !261, file: !60, line: 295, baseType: !64, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !59, file: !60, line: 648, baseType: !268, size: 4224, offset: 10688)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 4224, elements: !110)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !133, line: 83, baseType: !45)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !272, line: 86, baseType: !124)
!272 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !47, file: !10, line: 183, baseType: !274, size: 64, offset: 1856)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!45, !58, !277, !13, !278, !270}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !279, line: 40, baseType: !280)
!279 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !89, line: 129, baseType: !281)
!281 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !47, file: !10, line: 185, baseType: !45, size: 32, offset: 1920)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !47, file: !10, line: 186, baseType: !91, size: 64, offset: 1984)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !47, file: !10, line: 187, baseType: !285, size: 768, offset: 2048)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !286, line: 42, size: 768, elements: !287)
!286 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !285, file: !286, line: 44, baseType: !91, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !285, file: !286, line: 45, baseType: !91, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !285, file: !286, line: 46, baseType: !91, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !285, file: !286, line: 47, baseType: !91, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !285, file: !286, line: 48, baseType: !91, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !285, file: !286, line: 49, baseType: !91, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !285, file: !286, line: 50, baseType: !91, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !285, file: !286, line: 51, baseType: !91, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !285, file: !286, line: 52, baseType: !91, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !285, file: !286, line: 53, baseType: !91, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !285, file: !286, line: 54, baseType: !15, size: 8, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !285, file: !286, line: 55, baseType: !15, size: 8, offset: 648)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !285, file: !286, line: 56, baseType: !15, size: 8, offset: 656)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !285, file: !286, line: 57, baseType: !15, size: 8, offset: 664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !285, file: !286, line: 58, baseType: !15, size: 8, offset: 672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !285, file: !286, line: 59, baseType: !15, size: 8, offset: 680)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !285, file: !286, line: 60, baseType: !15, size: 8, offset: 688)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !285, file: !286, line: 61, baseType: !15, size: 8, offset: 696)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !285, file: !286, line: 62, baseType: !15, size: 8, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !285, file: !286, line: 63, baseType: !15, size: 8, offset: 712)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !285, file: !286, line: 64, baseType: !15, size: 8, offset: 720)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !285, file: !286, line: 65, baseType: !15, size: 8, offset: 728)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !285, file: !286, line: 66, baseType: !15, size: 8, offset: 736)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !285, file: !286, line: 67, baseType: !15, size: 8, offset: 744)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !47, file: !10, line: 189, baseType: !32, size: 16, offset: 2816)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !47, file: !10, line: 190, baseType: !314, size: 256, offset: 2832)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, elements: !245)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !47, file: !10, line: 191, baseType: !314, size: 256, offset: 3088)
!316 = !{!317, !318, !319, !320, !321, !322, !323}
!317 = !DILocalVariable(name: "locale", arg: 1, scope: !42, file: !3, line: 89, type: !46)
!318 = !DILocalVariable(name: "name", arg: 2, scope: !42, file: !3, line: 89, type: !13)
!319 = !DILocalVariable(name: "f_wctomb", arg: 3, scope: !42, file: !3, line: 90, type: !83)
!320 = !DILocalVariable(name: "charset", arg: 4, scope: !42, file: !3, line: 90, type: !13)
!321 = !DILocalVariable(name: "ret", scope: !42, file: !3, line: 92, type: !45)
!322 = !DILocalVariable(name: "mo", scope: !42, file: !3, line: 93, type: !9)
!323 = !DILocalVariable(name: "bufp", scope: !42, file: !3, line: 94, type: !91)
!324 = !DILocation(line: 89, column: 44, scope: !42)
!325 = !DILocation(line: 89, column: 64, scope: !42)
!326 = !DILocation(line: 90, column: 10, scope: !42)
!327 = !DILocation(line: 90, column: 32, scope: !42)
!328 = !DILocation(line: 94, column: 9, scope: !42)
!329 = !DILocation(line: 132, column: 3, scope: !42)
