; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lnumeric.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lnumeric.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_numeric_T = type { i8*, i8*, i8* }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "numempty", scope: !2, file: !3, line: 31, type: !18, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lnumeric.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !0}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "_C_numeric_locale", scope: !2, file: !3, line: 33, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_numeric_T", file: !10, line: 103, size: 192, elements: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !16, !17}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !9, file: !10, line: 105, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !9, file: !10, line: 106, baseType: !13, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !9, file: !10, line: 107, baseType: !13, size: 64, offset: 128)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 2)
!21 = !{i32 2, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!25 = distinct !DISubprogram(name: "__numeric_load_locale", scope: !3, file: !3, line: 45, type: !26, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !301)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29, !13, !66, !13}
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !10, line: 178, size: 3392, elements: !31)
!31 = !{!32, !37, !258, !267, !268, !269, !297, !298, !300}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !30, file: !10, line: 180, baseType: !33, size: 1792)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1792, elements: !34)
!34 = !{!35, !36}
!35 = !DISubrange(count: 7)
!36 = !DISubrange(count: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !30, file: !10, line: 181, baseType: !38, size: 64, offset: 1792)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!28, !41, !74, !254, !255}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !43, line: 569, size: 14912, elements: !44)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !{!45, !46, !125, !126, !127, !128, !132, !133, !134, !135, !139, !151, !152, !153, !155, !156, !157, !219, !239, !240, !245, !252}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !42, file: !43, line: 571, baseType: !28, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !42, file: !43, line: 576, baseType: !47, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !43, line: 287, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !43, line: 181, size: 1408, elements: !50)
!50 = !{!51, !54, !55, !56, !58, !59, !64, !65, !67, !75, !79, !84, !88, !89, !90, !91, !95, !99, !100, !101, !103, !104, !108, !124}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !49, file: !43, line: 182, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !49, file: !43, line: 183, baseType: !28, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !49, file: !43, line: 184, baseType: !28, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !49, file: !43, line: 185, baseType: !57, size: 16, offset: 128)
!57 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !49, file: !43, line: 186, baseType: !57, size: 16, offset: 144)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !49, file: !43, line: 187, baseType: !60, size: 128, offset: 192)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !43, line: 117, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !60, file: !43, line: 118, baseType: !52, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !60, file: !43, line: 119, baseType: !28, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !49, file: !43, line: 188, baseType: !28, size: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !49, file: !43, line: 195, baseType: !66, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !49, file: !43, line: 197, baseType: !68, size: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !41, !66, !74, !28}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !72, line: 145, baseType: !73)
!72 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !49, file: !43, line: 199, baseType: !76, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!71, !41, !66, !13, !28}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !49, file: !43, line: 202, baseType: !80, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !41, !66, !83, !28}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !72, line: 114, baseType: !73)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !49, file: !43, line: 203, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!28, !41, !66}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !49, file: !43, line: 206, baseType: !60, size: 128, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !49, file: !43, line: 207, baseType: !52, size: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !49, file: !43, line: 208, baseType: !28, size: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !49, file: !43, line: 211, baseType: !92, size: 24, offset: 928)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 24, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 3)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !49, file: !43, line: 212, baseType: !96, size: 8, offset: 952)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !49, file: !43, line: 215, baseType: !60, size: 128, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !49, file: !43, line: 218, baseType: !28, size: 32, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !49, file: !43, line: 219, baseType: !102, size: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !72, line: 44, baseType: !73)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !49, file: !43, line: 222, baseType: !41, size: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !49, file: !43, line: 226, baseType: !105, size: 32, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !72, line: 175, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !107, line: 12, baseType: !28)
!107 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !49, file: !43, line: 228, baseType: !109, size: 64, offset: 1312)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !72, line: 171, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 163, size: 64, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !110, file: !72, line: 165, baseType: !28, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !110, file: !72, line: 170, baseType: !114, size: 32, offset: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !72, line: 166, size: 32, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !114, file: !72, line: 168, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !118, line: 124, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !114, file: !72, line: 169, baseType: !121, size: 32)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 4)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !49, file: !43, line: 229, baseType: !28, size: 32, offset: 1376)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !42, file: !43, line: 576, baseType: !47, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !42, file: !43, line: 576, baseType: !47, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !42, file: !43, line: 578, baseType: !28, size: 32, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !42, file: !43, line: 579, baseType: !129, size: 200, offset: 288)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 200, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 25)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !42, file: !43, line: 582, baseType: !28, size: 32, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !42, file: !43, line: 583, baseType: !29, size: 64, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !42, file: !43, line: 585, baseType: !28, size: 32, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !42, file: !43, line: 587, baseType: !136, size: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !41}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !42, file: !43, line: 590, baseType: !140, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !43, line: 47, size: 256, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !141, file: !43, line: 49, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !141, file: !43, line: 50, baseType: !28, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !141, file: !43, line: 50, baseType: !28, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !141, file: !43, line: 50, baseType: !28, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !141, file: !43, line: 50, baseType: !28, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !141, file: !43, line: 51, baseType: !149, size: 32, offset: 192)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 32, elements: !97)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !43, line: 25, baseType: !119)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !42, file: !43, line: 591, baseType: !28, size: 32, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !42, file: !43, line: 592, baseType: !140, size: 64, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !42, file: !43, line: 593, baseType: !154, size: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !42, file: !43, line: 596, baseType: !28, size: 32, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !42, file: !43, line: 597, baseType: !74, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !42, file: !43, line: 632, baseType: !158, size: 2880, offset: 1152)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !42, file: !43, line: 599, size: 2880, elements: !159)
!159 = !{!160, !210}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !158, file: !43, line: 622, baseType: !161, size: 1728)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !158, file: !43, line: 601, size: 1728, elements: !162)
!162 = !{!163, !164, !165, !169, !181, !182, !184, !192, !193, !194, !195, !199, !203, !204, !205, !206, !207, !208, !209}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !161, file: !43, line: 603, baseType: !119, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !161, file: !43, line: 604, baseType: !74, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !161, file: !43, line: 605, baseType: !166, size: 208, offset: 128)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 208, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !161, file: !43, line: 606, baseType: !170, size: 288, offset: 352)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !43, line: 55, size: 288, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !170, file: !43, line: 57, baseType: !28, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !170, file: !43, line: 58, baseType: !28, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !170, file: !43, line: 59, baseType: !28, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !170, file: !43, line: 60, baseType: !28, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !170, file: !43, line: 61, baseType: !28, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !170, file: !43, line: 62, baseType: !28, size: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !170, file: !43, line: 63, baseType: !28, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !170, file: !43, line: 64, baseType: !28, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !170, file: !43, line: 65, baseType: !28, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !161, file: !43, line: 607, baseType: !28, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !161, file: !43, line: 608, baseType: !183, size: 64, offset: 704)
!183 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !161, file: !43, line: 609, baseType: !185, size: 112, offset: 768)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !43, line: 319, size: 112, elements: !186)
!186 = !{!187, !190, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !185, file: !43, line: 320, baseType: !188, size: 48)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 48, elements: !93)
!189 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !185, file: !43, line: 321, baseType: !188, size: 48, offset: 48)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !185, file: !43, line: 322, baseType: !189, size: 16, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !161, file: !43, line: 610, baseType: !109, size: 64, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !161, file: !43, line: 611, baseType: !109, size: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !161, file: !43, line: 612, baseType: !109, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !161, file: !43, line: 613, baseType: !196, size: 64, offset: 1088)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 8)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !161, file: !43, line: 614, baseType: !200, size: 192, offset: 1152)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 24)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !161, file: !43, line: 615, baseType: !28, size: 32, offset: 1344)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !161, file: !43, line: 616, baseType: !109, size: 64, offset: 1376)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !161, file: !43, line: 617, baseType: !109, size: 64, offset: 1440)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !161, file: !43, line: 618, baseType: !109, size: 64, offset: 1504)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !161, file: !43, line: 619, baseType: !109, size: 64, offset: 1568)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !161, file: !43, line: 620, baseType: !109, size: 64, offset: 1632)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !161, file: !43, line: 621, baseType: !28, size: 32, offset: 1696)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !158, file: !43, line: 631, baseType: !211, size: 2880)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !158, file: !43, line: 626, size: 2880, elements: !212)
!212 = !{!213, !217}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !211, file: !43, line: 629, baseType: !214, size: 1920)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1920, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 30)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !211, file: !43, line: 630, baseType: !218, size: 960, offset: 1920)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 960, elements: !215)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !42, file: !43, line: 636, baseType: !220, size: 64, offset: 4032)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !43, line: 93, size: 6336, elements: !222)
!222 = !{!223, !224, !225, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !221, file: !43, line: 94, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !221, file: !43, line: 95, baseType: !28, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !221, file: !43, line: 97, baseType: !226, size: 2048, offset: 128)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 2048, elements: !230)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null}
!230 = !{!36}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !221, file: !43, line: 98, baseType: !232, size: 4160, offset: 2176)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !43, line: 74, size: 4160, elements: !233)
!233 = !{!234, !236, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !232, file: !43, line: 75, baseType: !235, size: 2048)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, elements: !230)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !232, file: !43, line: 76, baseType: !235, size: 2048, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !232, file: !43, line: 78, baseType: !150, size: 32, offset: 4096)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !232, file: !43, line: 81, baseType: !150, size: 32, offset: 4128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !42, file: !43, line: 637, baseType: !221, size: 6336, offset: 4096)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !42, file: !43, line: 641, baseType: !241, size: 64, offset: 10432)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !28}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !42, file: !43, line: 646, baseType: !246, size: 192, offset: 10496)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !43, line: 291, size: 192, elements: !247)
!247 = !{!248, !250, !251}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !246, file: !43, line: 293, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !246, file: !43, line: 294, baseType: !28, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !246, file: !43, line: 295, baseType: !47, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !42, file: !43, line: 648, baseType: !253, size: 4224, offset: 10688)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 4224, elements: !93)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !118, line: 83, baseType: !28)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !257, line: 86, baseType: !109)
!257 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !30, file: !10, line: 183, baseType: !259, size: 64, offset: 1856)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!28, !41, !262, !13, !263, !255}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !264, line: 40, baseType: !265)
!264 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !72, line: 129, baseType: !266)
!266 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !30, file: !10, line: 185, baseType: !28, size: 32, offset: 1920)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !30, file: !10, line: 186, baseType: !74, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !30, file: !10, line: 187, baseType: !270, size: 768, offset: 2048)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !271, line: 42, size: 768, elements: !272)
!271 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !270, file: !271, line: 44, baseType: !74, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !270, file: !271, line: 45, baseType: !74, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !270, file: !271, line: 46, baseType: !74, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !270, file: !271, line: 47, baseType: !74, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !270, file: !271, line: 48, baseType: !74, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !270, file: !271, line: 49, baseType: !74, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !270, file: !271, line: 50, baseType: !74, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !270, file: !271, line: 51, baseType: !74, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !270, file: !271, line: 52, baseType: !74, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !270, file: !271, line: 53, baseType: !74, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !270, file: !271, line: 54, baseType: !15, size: 8, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !270, file: !271, line: 55, baseType: !15, size: 8, offset: 648)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !270, file: !271, line: 56, baseType: !15, size: 8, offset: 656)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !270, file: !271, line: 57, baseType: !15, size: 8, offset: 664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !270, file: !271, line: 58, baseType: !15, size: 8, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !270, file: !271, line: 59, baseType: !15, size: 8, offset: 680)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !270, file: !271, line: 60, baseType: !15, size: 8, offset: 688)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !270, file: !271, line: 61, baseType: !15, size: 8, offset: 696)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !270, file: !271, line: 62, baseType: !15, size: 8, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !270, file: !271, line: 63, baseType: !15, size: 8, offset: 712)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !270, file: !271, line: 64, baseType: !15, size: 8, offset: 720)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !270, file: !271, line: 65, baseType: !15, size: 8, offset: 728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !270, file: !271, line: 66, baseType: !15, size: 8, offset: 736)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !270, file: !271, line: 67, baseType: !15, size: 8, offset: 744)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !30, file: !10, line: 189, baseType: !18, size: 16, offset: 2816)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !30, file: !10, line: 190, baseType: !299, size: 256, offset: 2832)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, elements: !230)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !30, file: !10, line: 191, baseType: !299, size: 256, offset: 3088)
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DILocalVariable(name: "locale", arg: 1, scope: !25, file: !3, line: 45, type: !29)
!303 = !DILocalVariable(name: "name", arg: 2, scope: !25, file: !3, line: 45, type: !13)
!304 = !DILocalVariable(name: "f_wctomb", arg: 3, scope: !25, file: !3, line: 46, type: !66)
!305 = !DILocalVariable(name: "charset", arg: 4, scope: !25, file: !3, line: 46, type: !13)
!306 = !DILocalVariable(name: "ret", scope: !25, file: !3, line: 48, type: !28)
!307 = !DILocalVariable(name: "nm", scope: !25, file: !3, line: 49, type: !9)
!308 = !DILocalVariable(name: "bufp", scope: !25, file: !3, line: 50, type: !74)
!309 = !DILocation(line: 45, column: 43, scope: !25)
!310 = !DILocation(line: 45, column: 63, scope: !25)
!311 = !DILocation(line: 46, column: 16, scope: !25)
!312 = !DILocation(line: 46, column: 38, scope: !25)
!313 = !DILocation(line: 50, column: 9, scope: !25)
!314 = !DILocation(line: 88, column: 3, scope: !25)
