; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, {}*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "luaO_nilobject_", scope: !2, file: !3, line: 27, type: !353, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !340)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !10, !11, !12, !175, !176, !257}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !8, line: 99, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !14, line: 36, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!15 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !16, line: 136, size: 1472, elements: !17)
!16 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !{!18, !27, !53, !110, !336, !337, !338, !339}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !15, file: !16, line: 137, baseType: !19, size: 128)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !14, line: 51, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !14, line: 49, size: 128, elements: !21)
!21 = !{!22, !23, !26}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !14, line: 50, baseType: !12, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !20, file: !14, line: 50, baseType: !24, size: 8, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !25, line: 27, baseType: !10)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !20, file: !14, line: 50, baseType: !24, size: 8, offset: 72)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !15, file: !16, line: 138, baseType: !28, size: 192)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !14, line: 199, size: 192, elements: !29)
!29 = !{!30, !38}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !28, file: !14, line: 200, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !25, line: 47, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !25, line: 47, size: 64, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !32, file: !25, line: 47, baseType: !9, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !32, file: !25, line: 47, baseType: !11, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !32, file: !25, line: 47, baseType: !37, size: 64)
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !28, file: !14, line: 206, baseType: !39, size: 192)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !28, file: !14, line: 201, size: 192, elements: !40)
!40 = !{!41, !42, !43, !44, !45, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !14, line: 202, baseType: !12, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !39, file: !14, line: 202, baseType: !24, size: 8, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !39, file: !14, line: 202, baseType: !24, size: 8, offset: 72)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !39, file: !14, line: 203, baseType: !24, size: 8, offset: 80)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !39, file: !14, line: 204, baseType: !46, size: 32, offset: 96)
!46 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !14, line: 205, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 40, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !51, line: 129, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !15, file: !16, line: 139, baseType: !54, size: 320)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !14, line: 215, size: 320, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !54, file: !14, line: 216, baseType: !31, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !54, file: !14, line: 222, baseType: !58, size: 320)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !54, file: !14, line: 217, size: 320, elements: !59)
!59 = !{!60, !61, !62, !63, !108, !109}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !14, line: 218, baseType: !12, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !58, file: !14, line: 218, baseType: !24, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !58, file: !14, line: 218, baseType: !24, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !58, file: !14, line: 219, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !14, line: 338, size: 512, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !87, !105, !106, !107}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !14, line: 339, baseType: !12, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !65, file: !14, line: 339, baseType: !24, size: 8, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !65, file: !14, line: 339, baseType: !24, size: 8, offset: 72)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !14, line: 340, baseType: !24, size: 8, offset: 80)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !65, file: !14, line: 341, baseType: !24, size: 8, offset: 88)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !65, file: !14, line: 342, baseType: !64, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !65, file: !14, line: 343, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !14, line: 75, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !14, line: 73, size: 128, elements: !77)
!77 = !{!78, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !14, line: 74, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !14, line: 64, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !14, line: 59, size: 64, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !80, file: !14, line: 60, baseType: !12, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !80, file: !14, line: 61, baseType: !11, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !80, file: !14, line: 62, baseType: !7, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !80, file: !14, line: 63, baseType: !6, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !76, file: !14, line: 74, baseType: !6, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !65, file: !14, line: 344, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !14, line: 335, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !14, line: 332, size: 320, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !90, file: !14, line: 333, baseType: !75, size: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !90, file: !14, line: 334, baseType: !94, size: 192, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !14, line: 329, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !14, line: 323, size: 192, elements: !96)
!96 = !{!97, !104}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !95, file: !14, line: 327, baseType: !98, size: 192)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !95, file: !14, line: 324, size: 192, elements: !99)
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !14, line: 325, baseType: !79, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !98, file: !14, line: 325, baseType: !6, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !14, line: 326, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !95, file: !14, line: 328, baseType: !75, size: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !65, file: !14, line: 345, baseType: !88, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !65, file: !14, line: 346, baseType: !12, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !65, file: !14, line: 347, baseType: !6, size: 32, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !58, file: !14, line: 220, baseType: !64, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, file: !14, line: 221, baseType: !48, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !15, file: !16, line: 140, baseType: !111, size: 448)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !14, line: 309, size: 448, elements: !112)
!112 = !{!113, !285}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !111, file: !14, line: 310, baseType: !114, size: 448)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !14, line: 299, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !14, line: 295, size: 448, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !281}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !14, line: 296, baseType: !12, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !115, file: !14, line: 296, baseType: !24, size: 8, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !115, file: !14, line: 296, baseType: !24, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !115, file: !14, line: 296, baseType: !24, size: 8, offset: 80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !115, file: !14, line: 296, baseType: !24, size: 8, offset: 88)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !115, file: !14, line: 296, baseType: !12, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !115, file: !14, line: 296, baseType: !64, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !115, file: !14, line: 297, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !8, line: 52, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!6, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !8, line: 50, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !16, line: 100, size: 1472, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !139, !140, !218, !232, !233, !234, !235, !236, !237, !238, !239, !241, !242, !243, !244, !245, !246, !271, !272, !273, !274, !275, !278}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !16, line: 101, baseType: !12, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !131, file: !16, line: 101, baseType: !24, size: 8, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !131, file: !16, line: 101, baseType: !24, size: 8, offset: 72)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !131, file: !16, line: 102, baseType: !24, size: 8, offset: 80)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !131, file: !16, line: 103, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !14, line: 193, baseType: !74)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !131, file: !16, line: 104, baseType: !138, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !131, file: !16, line: 105, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !16, line: 94, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !16, line: 68, size: 3456, elements: !144)
!144 = !{!145, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !179, !181, !182, !183, !184, !185, !186, !187, !188, !190, !208, !212}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !143, file: !16, line: 69, baseType: !146, size: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !16, line: 42, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !16, line: 38, size: 128, elements: !148)
!148 = !{!149, !151, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !147, file: !16, line: 39, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !147, file: !16, line: 40, baseType: !152, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !25, line: 18, baseType: !46)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !147, file: !16, line: 41, baseType: !6, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !143, file: !16, line: 70, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !8, line: 66, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!11, !11, !11, !48, !48}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !143, file: !16, line: 71, baseType: !11, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !143, file: !16, line: 72, baseType: !24, size: 8, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !143, file: !16, line: 73, baseType: !24, size: 8, offset: 264)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !143, file: !16, line: 74, baseType: !6, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !143, file: !16, line: 75, baseType: !12, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !143, file: !16, line: 76, baseType: !150, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !143, file: !16, line: 77, baseType: !12, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !143, file: !16, line: 78, baseType: !12, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !143, file: !16, line: 79, baseType: !12, size: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !143, file: !16, line: 80, baseType: !12, size: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !143, file: !16, line: 81, baseType: !170, size: 192, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !171, line: 28, baseType: !172)
!171 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !171, line: 24, size: 192, elements: !173)
!173 = !{!174, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !172, file: !171, line: 25, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !172, file: !171, line: 26, baseType: !48, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !172, file: !171, line: 27, baseType: !48, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !143, file: !16, line: 82, baseType: !180, size: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !25, line: 20, baseType: !48)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !143, file: !16, line: 83, baseType: !180, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !143, file: !16, line: 84, baseType: !180, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !143, file: !16, line: 85, baseType: !180, size: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !143, file: !16, line: 86, baseType: !6, size: 32, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !143, file: !16, line: 87, baseType: !6, size: 32, offset: 1184)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !143, file: !16, line: 88, baseType: !125, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !143, file: !16, line: 89, baseType: !75, size: 128, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !143, file: !16, line: 90, baseType: !189, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !143, file: !16, line: 91, baseType: !191, size: 320, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !14, line: 284, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !14, line: 274, size: 320, elements: !193)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !14, line: 275, baseType: !12, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !192, file: !14, line: 275, baseType: !24, size: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !192, file: !14, line: 275, baseType: !24, size: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !192, file: !14, line: 276, baseType: !74, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !192, file: !14, line: 283, baseType: !199, size: 128, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !14, line: 277, size: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !14, line: 278, baseType: !75, size: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !199, file: !14, line: 282, baseType: !203, size: 128)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !14, line: 279, size: 128, elements: !204)
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !14, line: 280, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !14, line: 281, baseType: !206, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !143, file: !16, line: 92, baseType: !209, size: 576, offset: 1792)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 576, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 9)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !143, file: !16, line: 93, baseType: !213, size: 1088, offset: 2368)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1088, elements: !216)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !14, line: 207, baseType: !28)
!216 = !{!217}
!217 = !DISubrange(count: 17)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !131, file: !16, line: 106, baseType: !219, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !16, line: 55, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !16, line: 48, size: 320, elements: !222)
!222 = !{!223, !224, !225, !226, !230, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !221, file: !16, line: 49, baseType: !138, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !221, file: !16, line: 50, baseType: !138, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !221, file: !16, line: 51, baseType: !138, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !221, file: !16, line: 52, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !25, line: 88, baseType: !152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !221, file: !16, line: 53, baseType: !6, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !221, file: !16, line: 54, baseType: !6, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !131, file: !16, line: 107, baseType: !227, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !131, file: !16, line: 108, baseType: !138, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !131, file: !16, line: 109, baseType: !138, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !131, file: !16, line: 110, baseType: !219, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !131, file: !16, line: 111, baseType: !219, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !131, file: !16, line: 112, baseType: !6, size: 32, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !131, file: !16, line: 113, baseType: !6, size: 32, offset: 736)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !131, file: !16, line: 114, baseType: !240, size: 16, offset: 768)
!240 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !131, file: !16, line: 115, baseType: !240, size: 16, offset: 784)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !131, file: !16, line: 116, baseType: !24, size: 8, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !131, file: !16, line: 117, baseType: !24, size: 8, offset: 808)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !131, file: !16, line: 118, baseType: !6, size: 32, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !131, file: !16, line: 119, baseType: !6, size: 32, offset: 864)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !131, file: !16, line: 120, baseType: !247, size: 64, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !8, line: 330, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !129, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !8, line: 326, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !8, line: 346, size: 960, elements: !254)
!254 = !{!255, !256, !259, !260, !261, !262, !263, !264, !265, !266, !270}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !253, file: !8, line: 347, baseType: !6, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !8, line: 348, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !253, file: !8, line: 349, baseType: !257, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !253, file: !8, line: 350, baseType: !257, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !253, file: !8, line: 351, baseType: !257, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !253, file: !8, line: 352, baseType: !6, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !253, file: !8, line: 353, baseType: !6, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !253, file: !8, line: 354, baseType: !6, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !253, file: !8, line: 355, baseType: !6, size: 32, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !253, file: !8, line: 356, baseType: !267, size: 480, offset: 448)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 480, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 60)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !253, file: !8, line: 358, baseType: !6, size: 32, offset: 928)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !131, file: !16, line: 121, baseType: !75, size: 128, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !131, file: !16, line: 122, baseType: !75, size: 128, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !131, file: !16, line: 123, baseType: !12, size: 64, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !131, file: !16, line: 124, baseType: !12, size: 64, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !131, file: !16, line: 125, baseType: !276, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !16, line: 18, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !131, file: !16, line: 126, baseType: !279, size: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !280, line: 49, baseType: !37)
!280 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !115, file: !14, line: 298, baseType: !282, size: 128, offset: 320)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 1)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !111, file: !14, line: 311, baseType: !286, size: 384)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !14, line: 306, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !14, line: 302, size: 384, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !333}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !14, line: 303, baseType: !12, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !287, file: !14, line: 303, baseType: !24, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !287, file: !14, line: 303, baseType: !24, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !287, file: !14, line: 303, baseType: !24, size: 8, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !287, file: !14, line: 303, baseType: !24, size: 8, offset: 88)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !287, file: !14, line: 303, baseType: !12, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !287, file: !14, line: 303, baseType: !64, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !287, file: !14, line: 304, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !14, line: 231, size: 960, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !306, !308, !310, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !14, line: 232, baseType: !12, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !298, file: !14, line: 232, baseType: !24, size: 8, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !298, file: !14, line: 232, baseType: !24, size: 8, offset: 72)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !298, file: !14, line: 233, baseType: !74, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !298, file: !14, line: 234, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !298, file: !14, line: 235, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !298, file: !14, line: 236, baseType: !309, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !298, file: !14, line: 237, baseType: !311, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !14, line: 262, size: 128, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !312, file: !14, line: 263, baseType: !214, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !312, file: !14, line: 264, baseType: !6, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !312, file: !14, line: 265, baseType: !6, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !298, file: !14, line: 238, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !298, file: !14, line: 239, baseType: !214, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !298, file: !14, line: 240, baseType: !6, size: 32, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !298, file: !14, line: 241, baseType: !6, size: 32, offset: 608)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !298, file: !14, line: 242, baseType: !6, size: 32, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !298, file: !14, line: 243, baseType: !6, size: 32, offset: 672)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !298, file: !14, line: 244, baseType: !6, size: 32, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !298, file: !14, line: 245, baseType: !6, size: 32, offset: 736)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !298, file: !14, line: 246, baseType: !6, size: 32, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !298, file: !14, line: 247, baseType: !6, size: 32, offset: 800)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !298, file: !14, line: 248, baseType: !12, size: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !298, file: !14, line: 249, baseType: !24, size: 8, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !298, file: !14, line: 250, baseType: !24, size: 8, offset: 904)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !298, file: !14, line: 251, baseType: !24, size: 8, offset: 912)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !298, file: !14, line: 252, baseType: !24, size: 8, offset: 920)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !287, file: !14, line: 305, baseType: !334, size: 64, offset: 320)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !283)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !15, file: !16, line: 141, baseType: !65, size: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !15, file: !16, line: 142, baseType: !298, size: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !15, file: !16, line: 143, baseType: !192, size: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !15, file: !16, line: 144, baseType: !131, size: 1472)
!340 = !{!0, !341}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "log_2", scope: !343, file: !3, line: 55, type: !349, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "luaO_log2", scope: !3, file: !3, line: 54, type: !344, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{!6, !46}
!346 = !{!347, !348}
!347 = !DILocalVariable(name: "x", arg: 1, scope: !343, file: !3, line: 54, type: !46)
!348 = !DILocalVariable(name: "l", scope: !343, file: !3, line: 65, type: !6)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 2048, elements: !351)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!351 = !{!352}
!352 = !DISubrange(count: 256)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!354 = !{i32 2, !"Dwarf Version", i32 4}
!355 = !{i32 2, !"Debug Info Version", i32 3}
!356 = !{i32 1, !"wchar_size", i32 4}
!357 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!358 = distinct !DISubprogram(name: "luaO_int2fb", scope: !3, file: !3, line: 35, type: !344, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !359)
!359 = !{!360, !361}
!360 = !DILocalVariable(name: "x", arg: 1, scope: !358, file: !3, line: 35, type: !46)
!361 = !DILocalVariable(name: "e", scope: !358, file: !3, line: 36, type: !6)
!362 = !DILocation(line: 35, column: 31, scope: !358)
!363 = !DILocation(line: 36, column: 7, scope: !358)
!364 = !DILocation(line: 37, column: 12, scope: !358)
!365 = !DILocation(line: 37, column: 3, scope: !358)
!366 = !DILocation(line: 38, column: 11, scope: !367)
!367 = distinct !DILexicalBlock(scope: !358, file: !3, line: 37, column: 19)
!368 = !DILocation(line: 38, column: 15, scope: !367)
!369 = distinct !{!369, !365, !370}
!370 = !DILocation(line: 40, column: 3, scope: !358)
!371 = !DILocation(line: 41, column: 9, scope: !372)
!372 = distinct !DILexicalBlock(scope: !358, file: !3, line: 41, column: 7)
!373 = !DILocation(line: 42, column: 43, scope: !372)
!374 = !DILocation(line: 42, column: 28, scope: !372)
!375 = !DILocation(line: 41, column: 7, scope: !358)
!376 = !DILocation(line: 43, column: 1, scope: !358)
!377 = distinct !DISubprogram(name: "luaO_fb2int", scope: !3, file: !3, line: 47, type: !378, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!6, !6}
!380 = !{!381, !382}
!381 = !DILocalVariable(name: "x", arg: 1, scope: !377, file: !3, line: 47, type: !6)
!382 = !DILocalVariable(name: "e", scope: !377, file: !3, line: 48, type: !6)
!383 = !DILocation(line: 47, column: 22, scope: !377)
!384 = !DILocation(line: 48, column: 14, scope: !377)
!385 = !DILocation(line: 48, column: 20, scope: !377)
!386 = !DILocation(line: 48, column: 7, scope: !377)
!387 = !DILocation(line: 49, column: 9, scope: !388)
!388 = distinct !DILexicalBlock(scope: !377, file: !3, line: 49, column: 7)
!389 = !DILocation(line: 49, column: 7, scope: !377)
!390 = !DILocation(line: 50, column: 19, scope: !388)
!391 = !DILocation(line: 50, column: 23, scope: !388)
!392 = !DILocation(line: 50, column: 33, scope: !388)
!393 = !DILocation(line: 50, column: 27, scope: !388)
!394 = !DILocation(line: 50, column: 8, scope: !388)
!395 = !DILocation(line: 0, scope: !388)
!396 = !DILocation(line: 51, column: 1, scope: !377)
!397 = !DILocation(line: 54, column: 29, scope: !343)
!398 = !DILocation(line: 65, column: 7, scope: !343)
!399 = !DILocation(line: 66, column: 12, scope: !343)
!400 = !DILocation(line: 66, column: 3, scope: !343)
!401 = !DILocation(line: 66, column: 24, scope: !402)
!402 = distinct !DILexicalBlock(scope: !343, file: !3, line: 66, column: 20)
!403 = !DILocation(line: 66, column: 32, scope: !402)
!404 = distinct !{!404, !400, !405}
!405 = !DILocation(line: 66, column: 39, scope: !343)
!406 = !DILocation(line: 0, scope: !402)
!407 = !DILocation(line: 67, column: 14, scope: !343)
!408 = !{!409, !409, i64 0}
!409 = !{!"omnipotent char", !410, i64 0}
!410 = !{!"Simple C/C++ TBAA"}
!411 = !DILocation(line: 67, column: 12, scope: !343)
!412 = !DILocation(line: 67, column: 3, scope: !343)
!413 = distinct !DISubprogram(name: "luaO_rawequalObj", scope: !3, file: !3, line: 72, type: !414, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !417)
!414 = !DISubroutineType(types: !415)
!415 = !{!6, !416, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!417 = !{!418, !419}
!418 = !DILocalVariable(name: "t1", arg: 1, scope: !413, file: !3, line: 72, type: !416)
!419 = !DILocalVariable(name: "t2", arg: 2, scope: !413, file: !3, line: 72, type: !416)
!420 = !DILocation(line: 72, column: 37, scope: !413)
!421 = !DILocation(line: 72, column: 55, scope: !413)
!422 = !DILocation(line: 73, column: 7, scope: !423)
!423 = distinct !DILexicalBlock(scope: !413, file: !3, line: 73, column: 7)
!424 = !{!425, !426, i64 8}
!425 = !{!"lua_TValue", !409, i64 0, !426, i64 8}
!426 = !{!"int", !409, i64 0}
!427 = !DILocation(line: 73, column: 20, scope: !423)
!428 = !DILocation(line: 73, column: 17, scope: !423)
!429 = !DILocation(line: 73, column: 7, scope: !413)
!430 = !DILocation(line: 74, column: 8, scope: !423)
!431 = !DILocation(line: 78, column: 14, scope: !432)
!432 = distinct !DILexicalBlock(scope: !423, file: !3, line: 74, column: 27)
!433 = !DILocation(line: 78, column: 7, scope: !432)
!434 = !DILocation(line: 80, column: 14, scope: !432)
!435 = !DILocation(line: 80, column: 28, scope: !432)
!436 = !DILocation(line: 80, column: 25, scope: !432)
!437 = !DILocation(line: 80, column: 7, scope: !432)
!438 = !DILocation(line: 82, column: 14, scope: !432)
!439 = !DILocation(line: 82, column: 28, scope: !432)
!440 = !DILocation(line: 82, column: 25, scope: !432)
!441 = !DILocation(line: 82, column: 7, scope: !432)
!442 = !DILocation(line: 85, column: 14, scope: !432)
!443 = !DILocation(line: 85, column: 29, scope: !432)
!444 = !DILocation(line: 85, column: 26, scope: !432)
!445 = !DILocation(line: 85, column: 7, scope: !432)
!446 = !DILocation(line: 0, scope: !432)
!447 = !DILocation(line: 87, column: 1, scope: !413)
!448 = distinct !DISubprogram(name: "luaO_str2d", scope: !3, file: !3, line: 90, type: !449, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !452)
!449 = !DISubroutineType(types: !450)
!450 = !{!6, !257, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!452 = !{!453, !454, !455}
!453 = !DILocalVariable(name: "s", arg: 1, scope: !448, file: !3, line: 90, type: !257)
!454 = !DILocalVariable(name: "result", arg: 2, scope: !448, file: !3, line: 90, type: !451)
!455 = !DILocalVariable(name: "endptr", scope: !448, file: !3, line: 91, type: !175)
!456 = !DILocation(line: 90, column: 29, scope: !448)
!457 = !DILocation(line: 90, column: 44, scope: !448)
!458 = !DILocation(line: 91, column: 3, scope: !448)
!459 = !DILocation(line: 91, column: 9, scope: !448)
!460 = !DILocation(line: 92, column: 13, scope: !448)
!461 = !DILocation(line: 92, column: 11, scope: !448)
!462 = !{!463, !463, i64 0}
!463 = !{!"double", !409, i64 0}
!464 = !DILocation(line: 93, column: 7, scope: !465)
!465 = distinct !DILexicalBlock(scope: !448, file: !3, line: 93, column: 7)
!466 = !{!467, !467, i64 0}
!467 = !{!"any pointer", !409, i64 0}
!468 = !DILocation(line: 93, column: 14, scope: !465)
!469 = !DILocation(line: 93, column: 7, scope: !448)
!470 = !DILocation(line: 94, column: 7, scope: !471)
!471 = distinct !DILexicalBlock(scope: !448, file: !3, line: 94, column: 7)
!472 = !DILocation(line: 94, column: 22, scope: !471)
!473 = !DILocation(line: 95, column: 15, scope: !471)
!474 = !DILocation(line: 95, column: 13, scope: !471)
!475 = !DILocation(line: 96, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !448, file: !3, line: 96, column: 7)
!477 = !DILocation(line: 96, column: 7, scope: !476)
!478 = !DILocation(line: 95, column: 5, scope: !471)
!479 = !DILocation(line: 96, column: 15, scope: !476)
!480 = !DILocation(line: 96, column: 7, scope: !448)
!481 = !DILocation(line: 97, column: 10, scope: !448)
!482 = !DILocation(line: 97, column: 3, scope: !448)
!483 = !DILocation(line: 97, column: 55, scope: !448)
!484 = distinct !{!484, !482, !483}
!485 = !DILocation(line: 98, column: 15, scope: !486)
!486 = distinct !DILexicalBlock(scope: !448, file: !3, line: 98, column: 7)
!487 = !DILocation(line: 99, column: 3, scope: !448)
!488 = !DILocation(line: 0, scope: !448)
!489 = !DILocation(line: 100, column: 1, scope: !448)
!490 = distinct !DISubprogram(name: "luaO_pushvfstring", scope: !3, file: !3, line: 111, type: !491, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !500)
!491 = !DISubroutineType(types: !492)
!492 = !{!257, !129, !257, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 100, size: 192, elements: !495)
!495 = !{!496, !497, !498, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !494, file: !3, line: 100, baseType: !46, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !494, file: !3, line: 100, baseType: !46, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !494, file: !3, line: 100, baseType: !11, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !494, file: !3, line: 100, baseType: !11, size: 64, offset: 128)
!500 = !{!501, !502, !503, !504, !505, !509, !511, !514, !519, !522, !525, !530}
!501 = !DILocalVariable(name: "L", arg: 1, scope: !490, file: !3, line: 111, type: !129)
!502 = !DILocalVariable(name: "fmt", arg: 2, scope: !490, file: !3, line: 111, type: !257)
!503 = !DILocalVariable(name: "argp", arg: 3, scope: !490, file: !3, line: 111, type: !493)
!504 = !DILocalVariable(name: "n", scope: !490, file: !3, line: 112, type: !6)
!505 = !DILocalVariable(name: "e", scope: !506, file: !3, line: 115, type: !257)
!506 = distinct !DILexicalBlock(scope: !507, file: !3, line: 114, column: 12)
!507 = distinct !DILexicalBlock(scope: !508, file: !3, line: 114, column: 3)
!508 = distinct !DILexicalBlock(scope: !490, file: !3, line: 114, column: 3)
!509 = !DILocalVariable(name: "i_o", scope: !510, file: !3, line: 117, type: !74)
!510 = distinct !DILexicalBlock(scope: !506, file: !3, line: 117, column: 5)
!511 = !DILocalVariable(name: "s", scope: !512, file: !3, line: 121, type: !257)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 120, column: 17)
!513 = distinct !DILexicalBlock(scope: !506, file: !3, line: 119, column: 21)
!514 = !DILocalVariable(name: "buff", scope: !515, file: !3, line: 127, type: !516)
!515 = distinct !DILexicalBlock(scope: !513, file: !3, line: 126, column: 17)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 16, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 2)
!519 = !DILocalVariable(name: "i_o", scope: !520, file: !3, line: 134, type: !74)
!520 = distinct !DILexicalBlock(scope: !521, file: !3, line: 134, column: 9)
!521 = distinct !DILexicalBlock(scope: !513, file: !3, line: 133, column: 17)
!522 = !DILocalVariable(name: "i_o", scope: !523, file: !3, line: 139, type: !74)
!523 = distinct !DILexicalBlock(scope: !524, file: !3, line: 139, column: 9)
!524 = distinct !DILexicalBlock(scope: !513, file: !3, line: 138, column: 17)
!525 = !DILocalVariable(name: "buff", scope: !526, file: !3, line: 144, type: !527)
!526 = distinct !DILexicalBlock(scope: !513, file: !3, line: 143, column: 17)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 320, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 40)
!530 = !DILocalVariable(name: "buff", scope: !531, file: !3, line: 154, type: !532)
!531 = distinct !DILexicalBlock(scope: !513, file: !3, line: 153, column: 16)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 24, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 3)
!535 = !DILocation(line: 111, column: 43, scope: !490)
!536 = !DILocation(line: 111, column: 58, scope: !490)
!537 = !DILocation(line: 111, column: 71, scope: !490)
!538 = !DILocation(line: 112, column: 7, scope: !490)
!539 = !DILocalVariable(name: "L", arg: 1, scope: !540, file: !3, line: 104, type: !129)
!540 = distinct !DISubprogram(name: "pushstr", scope: !3, file: !3, line: 104, type: !541, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !129, !257}
!543 = !{!539, !544, !545}
!544 = !DILocalVariable(name: "str", arg: 2, scope: !540, file: !3, line: 104, type: !257)
!545 = !DILocalVariable(name: "i_o", scope: !546, file: !3, line: 105, type: !74)
!546 = distinct !DILexicalBlock(scope: !540, file: !3, line: 105, column: 3)
!547 = !DILocation(line: 104, column: 33, scope: !540, inlinedAt: !548)
!548 = distinct !DILocation(line: 113, column: 3, scope: !490)
!549 = !DILocation(line: 104, column: 48, scope: !540, inlinedAt: !548)
!550 = !DILocation(line: 105, column: 3, scope: !546, inlinedAt: !548)
!551 = !{!552, !467, i64 16}
