; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/loslib.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/loslib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.lua_State = type opaque
%struct.luaL_Buffer = type { i8*, i32, %struct.lua_State*, [1024 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [3 x i8] c"os\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "syslib", scope: !2, file: !3, line: 220, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/loslib.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !9, !12, !13, !14}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !7, line: 99, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 34, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!0, !16, !34}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "cat", scope: !18, file: !3, line: 205, type: !30, isLocal: true, isDefinition: true)
!18 = distinct !DISubprogram(name: "os_setlocale", scope: !3, file: !3, line: 204, type: !19, isLocal: true, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !24)
!19 = !DISubroutineType(types: !20)
!20 = !{!14, !21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !7, line: 50, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !7, line: 50, flags: DIFlagFwdDecl)
!24 = !{!25, !26, !29}
!25 = !DILocalVariable(name: "L", arg: 1, scope: !18, file: !3, line: 204, type: !21)
!26 = !DILocalVariable(name: "l", scope: !18, file: !3, line: 209, type: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!29 = !DILocalVariable(name: "op", scope: !18, file: !3, line: 210, type: !14)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, elements: !32)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!32 = !{!33}
!33 = !DISubrange(count: 6)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "catnames", scope: !18, file: !3, line: 207, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 448, elements: !38)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!38 = !{!39}
!39 = !DISubrange(count: 7)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1536, elements: !50)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !43, line: 38, baseType: !44)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !43, line: 35, size: 128, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !43, line: 36, baseType: !27, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !44, file: !43, line: 37, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !7, line: 52, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!50 = !{!51}
!51 = !DISubrange(count: 12)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "luaopen_os", scope: !3, file: !3, line: 239, type: !19, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !57)
!57 = !{!58}
!58 = !DILocalVariable(name: "L", arg: 1, scope: !56, file: !3, line: 239, type: !21)
!59 = !DILocation(line: 239, column: 39, scope: !56)
!60 = !DILocation(line: 240, column: 3, scope: !56)
!61 = !DILocation(line: 241, column: 3, scope: !56)
!62 = distinct !DISubprogram(name: "os_clock", scope: !3, file: !3, line: 74, type: !19, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !63)
!63 = !{!64}
!64 = !DILocalVariable(name: "L", arg: 1, scope: !62, file: !3, line: 74, type: !21)
!65 = !DILocation(line: 74, column: 33, scope: !62)
!66 = !DILocation(line: 75, column: 34, scope: !62)
!67 = !DILocation(line: 75, column: 22, scope: !62)
!68 = !DILocation(line: 75, column: 42, scope: !62)
!69 = !DILocation(line: 75, column: 3, scope: !62)
!70 = !DILocation(line: 76, column: 3, scope: !62)
!71 = distinct !DISubprogram(name: "os_date", scope: !3, file: !3, line: 124, type: !19, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !72)
!72 = !{!73, !74, !75, !76, !92, !99, !111, !122}
!73 = !DILocalVariable(name: "L", arg: 1, scope: !71, file: !3, line: 124, type: !21)
!74 = !DILocalVariable(name: "s", scope: !71, file: !3, line: 125, type: !27)
!75 = !DILocalVariable(name: "t", scope: !71, file: !3, line: 126, type: !9)
!76 = !DILocalVariable(name: "stm", scope: !71, file: !3, line: 127, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !79, line: 31, size: 448, elements: !80)
!79 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !78, file: !79, line: 32, baseType: !14, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !78, file: !79, line: 33, baseType: !14, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !78, file: !79, line: 34, baseType: !14, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !78, file: !79, line: 35, baseType: !14, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !78, file: !79, line: 36, baseType: !14, size: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !78, file: !79, line: 37, baseType: !14, size: 32, offset: 160)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !78, file: !79, line: 38, baseType: !14, size: 32, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !78, file: !79, line: 39, baseType: !14, size: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !78, file: !79, line: 40, baseType: !14, size: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !78, file: !79, line: 41, baseType: !11, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !78, file: !79, line: 42, baseType: !27, size: 64, offset: 384)
!92 = !DILocalVariable(name: "cc", scope: !93, file: !3, line: 149, type: !96)
!93 = distinct !DILexicalBlock(scope: !94, file: !3, line: 148, column: 8)
!94 = distinct !DILexicalBlock(scope: !95, file: !3, line: 136, column: 12)
!95 = distinct !DILexicalBlock(scope: !71, file: !3, line: 134, column: 7)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 24, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DILocalVariable(name: "b", scope: !93, file: !3, line: 150, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Buffer", file: !43, line: 134, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Buffer", file: !43, line: 129, size: 8384, elements: !102)
!102 = !{!103, !105, !106, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !101, file: !43, line: 130, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !101, file: !43, line: 131, baseType: !14, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !101, file: !43, line: 132, baseType: !21, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !101, file: !43, line: 133, baseType: !108, size: 8192, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1024)
!111 = !DILocalVariable(name: "reslen", scope: !112, file: !3, line: 157, type: !117)
!112 = distinct !DILexicalBlock(scope: !113, file: !3, line: 156, column: 12)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 154, column: 11)
!114 = distinct !DILexicalBlock(scope: !115, file: !3, line: 153, column: 21)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 153, column: 5)
!116 = distinct !DILexicalBlock(scope: !93, file: !3, line: 153, column: 5)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 40, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !120, line: 129, baseType: !121)
!120 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DILocalVariable(name: "buff", scope: !112, file: !3, line: 158, type: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1600, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 200)
!126 = !DILocation(line: 124, column: 32, scope: !71)
!127 = !DILocation(line: 125, column: 19, scope: !71)
!128 = !DILocation(line: 125, column: 15, scope: !71)
!129 = !DILocation(line: 126, column: 3, scope: !71)
!130 = !DILocation(line: 126, column: 14, scope: !71)
!131 = !DILocation(line: 126, column: 10, scope: !71)
!132 = !{!133, !133, i64 0}
!133 = !{!"long", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !DILocation(line: 128, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !71, file: !3, line: 128, column: 7)
!138 = !{!134, !134, i64 0}
!139 = !DILocation(line: 128, column: 10, scope: !137)
!140 = !DILocation(line: 128, column: 7, scope: !71)
!141 = !DILocation(line: 129, column: 11, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !3, line: 128, column: 18)
!143 = !DILocation(line: 127, column: 14, scope: !71)
!144 = !DILocation(line: 130, column: 6, scope: !142)
!145 = !DILocation(line: 131, column: 3, scope: !142)
!146 = !DILocation(line: 133, column: 11, scope: !137)
!147 = !DILocation(line: 0, scope: !137)
!148 = !DILocation(line: 0, scope: !71)
!149 = !DILocation(line: 134, column: 11, scope: !95)
!150 = !DILocation(line: 134, column: 7, scope: !71)
!151 = !DILocation(line: 135, column: 5, scope: !95)
!152 = !DILocation(line: 136, column: 12, scope: !94)
!153 = !DILocation(line: 136, column: 28, scope: !94)
!154 = !DILocation(line: 136, column: 12, scope: !95)
!155 = !DILocation(line: 137, column: 5, scope: !156)
!156 = distinct !DILexicalBlock(scope: !94, file: !3, line: 136, column: 34)
!157 = !DILocation(line: 138, column: 29, scope: !156)
!158 = !{!159, !160, i64 0}
!159 = !{!"tm", !160, i64 0, !160, i64 4, !160, i64 8, !160, i64 12, !160, i64 16, !160, i64 20, !160, i64 24, !160, i64 28, !160, i64 32, !133, i64 40, !161, i64 48}
!160 = !{!"int", !134, i64 0}
!161 = !{!"any pointer", !134, i64 0}
!162 = !DILocalVariable(name: "L", arg: 1, scope: !163, file: !3, line: 88, type: !21)
!163 = distinct !DISubprogram(name: "setfield", scope: !3, file: !3, line: 88, type: !164, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !21, !27, !14}
!166 = !{!162, !167, !168}
!167 = !DILocalVariable(name: "key", arg: 2, scope: !163, file: !3, line: 88, type: !27)
