; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "luaT_typenames", scope: !2, file: !3, line: 23, type: !372, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !31)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 18, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!9 = !DIEnumerator(name: "TM_INDEX", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "TM_NEWINDEX", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "TM_GC", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "TM_MODE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "TM_EQ", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "TM_ADD", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "TM_SUB", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "TM_MUL", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "TM_DIV", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "TM_MOD", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "TM_POW", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "TM_UNM", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "TM_LEN", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "TM_LT", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "TM_LE", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "TM_CONCAT", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "TM_CALL", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "TM_N", value: 17, isUnsigned: true)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !29, line: 27, baseType: !30)
!29 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !{!0, !32}
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "luaT_eventname", scope: !34, file: !3, line: 31, type: !370, isLocal: true, isDefinition: true)
!34 = distinct !DISubprogram(name: "luaT_init", scope: !3, file: !3, line: 30, type: !35, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !367)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !39, line: 50, baseType: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !41, line: 100, size: 1472, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !241, !242, !243, !244, !246, !247, !305, !318, !319, !320, !321, !322, !323, !324, !325, !327, !328, !329, !330, !331, !332, !357, !358, !359, !360, !361, !364}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !41, line: 101, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !46, line: 36, baseType: !47)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !41, line: 136, size: 1472, elements: !48)
!48 = !{!49, !56, !83, !142, !237, !238, !239, !240}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !47, file: !41, line: 137, baseType: !50, size: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !46, line: 51, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !46, line: 49, size: 128, elements: !52)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !46, line: 50, baseType: !44, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !51, file: !46, line: 50, baseType: !28, size: 8, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !51, file: !46, line: 50, baseType: !28, size: 8, offset: 72)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !47, file: !41, line: 138, baseType: !57, size: 192)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !46, line: 199, size: 192, elements: !58)
!58 = !{!59, !69}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !57, file: !46, line: 200, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !29, line: 47, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !29, line: 47, size: 64, elements: !62)
!62 = !{!63, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !61, file: !29, line: 47, baseType: !64, size: 64)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !61, file: !29, line: 47, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !61, file: !29, line: 47, baseType: !68, size: 64)
!68 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !57, file: !46, line: 206, baseType: !70, size: 192)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !46, line: 201, size: 192, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !46, line: 202, baseType: !44, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !70, file: !46, line: 202, baseType: !28, size: 8, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !70, file: !46, line: 202, baseType: !28, size: 8, offset: 72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !70, file: !46, line: 203, baseType: !28, size: 8, offset: 80)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !70, file: !46, line: 204, baseType: !7, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !70, file: !46, line: 205, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 40, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !81, line: 129, baseType: !82)
!81 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !47, file: !41, line: 139, baseType: !84, size: 320)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !46, line: 215, size: 320, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !84, file: !46, line: 216, baseType: !60, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !84, file: !46, line: 222, baseType: !88, size: 320)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !46, line: 217, size: 320, elements: !89)
!89 = !{!90, !91, !92, !93, !140, !141}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !46, line: 218, baseType: !44, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !88, file: !46, line: 218, baseType: !28, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !88, file: !46, line: 218, baseType: !28, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !88, file: !46, line: 219, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !46, line: 338, size: 512, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !119, !137, !138, !139}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !46, line: 339, baseType: !44, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !95, file: !46, line: 339, baseType: !28, size: 8, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !95, file: !46, line: 339, baseType: !28, size: 8, offset: 72)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !95, file: !46, line: 340, baseType: !28, size: 8, offset: 80)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !95, file: !46, line: 341, baseType: !28, size: 8, offset: 88)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !95, file: !46, line: 342, baseType: !94, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !95, file: !46, line: 343, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !46, line: 75, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !46, line: 73, size: 128, elements: !107)
!107 = !{!108, !118}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !106, file: !46, line: 74, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !46, line: 64, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !46, line: 59, size: 64, elements: !111)
!111 = !{!112, !113, !114, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !110, file: !46, line: 60, baseType: !44, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !110, file: !46, line: 61, baseType: !66, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !110, file: !46, line: 62, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !39, line: 99, baseType: !64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !110, file: !46, line: 63, baseType: !117, size: 32)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !106, file: !46, line: 74, baseType: !117, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !95, file: !46, line: 344, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !46, line: 335, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !46, line: 332, size: 320, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !122, file: !46, line: 333, baseType: !105, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !122, file: !46, line: 334, baseType: !126, size: 192, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !46, line: 329, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !46, line: 323, size: 192, elements: !128)
!128 = !{!129, !136}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !127, file: !46, line: 327, baseType: !130, size: 192)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !127, file: !46, line: 324, size: 192, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !130, file: !46, line: 325, baseType: !109, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !130, file: !46, line: 325, baseType: !117, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !46, line: 326, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !127, file: !46, line: 328, baseType: !105, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !95, file: !46, line: 345, baseType: !120, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !95, file: !46, line: 346, baseType: !44, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !95, file: !46, line: 347, baseType: !117, size: 32, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !88, file: !46, line: 220, baseType: !94, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !46, line: 221, baseType: !78, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !47, file: !41, line: 140, baseType: !143, size: 448)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !46, line: 309, size: 448, elements: !144)
!144 = !{!145, !165}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !143, file: !46, line: 310, baseType: !146, size: 448)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !46, line: 299, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !46, line: 295, size: 448, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !161}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !46, line: 296, baseType: !44, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !147, file: !46, line: 296, baseType: !28, size: 8, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !147, file: !46, line: 296, baseType: !28, size: 8, offset: 72)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !147, file: !46, line: 296, baseType: !28, size: 8, offset: 80)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !147, file: !46, line: 296, baseType: !28, size: 8, offset: 88)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !147, file: !46, line: 296, baseType: !44, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !147, file: !46, line: 296, baseType: !94, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !147, file: !46, line: 297, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !39, line: 52, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!117, !37}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !147, file: !46, line: 298, baseType: !162, size: 128, offset: 320)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 1)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !143, file: !46, line: 311, baseType: !166, size: 384)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !46, line: 306, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !46, line: 302, size: 384, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !217}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !46, line: 303, baseType: !44, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !167, file: !46, line: 303, baseType: !28, size: 8, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !167, file: !46, line: 303, baseType: !28, size: 8, offset: 72)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !167, file: !46, line: 303, baseType: !28, size: 8, offset: 80)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !167, file: !46, line: 303, baseType: !28, size: 8, offset: 88)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !167, file: !46, line: 303, baseType: !44, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !167, file: !46, line: 303, baseType: !94, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !167, file: !46, line: 304, baseType: !177, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !46, line: 231, size: 960, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !188, !190, !192, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !46, line: 232, baseType: !44, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !178, file: !46, line: 232, baseType: !28, size: 8, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !178, file: !46, line: 232, baseType: !28, size: 8, offset: 72)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !178, file: !46, line: 233, baseType: !104, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !178, file: !46, line: 234, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !29, line: 88, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !29, line: 18, baseType: !7)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !178, file: !46, line: 235, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !178, file: !46, line: 236, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !178, file: !46, line: 237, baseType: !193, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !46, line: 262, size: 128, elements: !195)
!195 = !{!196, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !194, file: !46, line: 263, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !46, line: 207, baseType: !57)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !194, file: !46, line: 264, baseType: !117, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !194, file: !46, line: 265, baseType: !117, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !178, file: !46, line: 238, baseType: !202, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !178, file: !46, line: 239, baseType: !197, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !178, file: !46, line: 240, baseType: !117, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !178, file: !46, line: 241, baseType: !117, size: 32, offset: 608)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !178, file: !46, line: 242, baseType: !117, size: 32, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !178, file: !46, line: 243, baseType: !117, size: 32, offset: 672)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !178, file: !46, line: 244, baseType: !117, size: 32, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !178, file: !46, line: 245, baseType: !117, size: 32, offset: 736)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !178, file: !46, line: 246, baseType: !117, size: 32, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !178, file: !46, line: 247, baseType: !117, size: 32, offset: 800)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !178, file: !46, line: 248, baseType: !44, size: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !178, file: !46, line: 249, baseType: !28, size: 8, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !178, file: !46, line: 250, baseType: !28, size: 8, offset: 904)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !178, file: !46, line: 251, baseType: !28, size: 8, offset: 912)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !178, file: !46, line: 252, baseType: !28, size: 8, offset: 920)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !167, file: !46, line: 305, baseType: !218, size: 64, offset: 320)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 64, elements: !163)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !46, line: 284, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !46, line: 274, size: 320, elements: !222)
!222 = !{!223, !224, !225, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !46, line: 275, baseType: !44, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !221, file: !46, line: 275, baseType: !28, size: 8, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !221, file: !46, line: 275, baseType: !28, size: 8, offset: 72)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !221, file: !46, line: 276, baseType: !104, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !221, file: !46, line: 283, baseType: !228, size: 128, offset: 192)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !46, line: 277, size: 128, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !228, file: !46, line: 278, baseType: !105, size: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !228, file: !46, line: 282, baseType: !232, size: 128)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !46, line: 279, size: 128, elements: !233)
!233 = !{!234, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !232, file: !46, line: 280, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !46, line: 281, baseType: !235, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !47, file: !41, line: 141, baseType: !95, size: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !47, file: !41, line: 142, baseType: !178, size: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !47, file: !41, line: 143, baseType: !221, size: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !47, file: !41, line: 144, baseType: !40, size: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !40, file: !41, line: 101, baseType: !28, size: 8, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !40, file: !41, line: 101, baseType: !28, size: 8, offset: 72)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !40, file: !41, line: 102, baseType: !28, size: 8, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !40, file: !41, line: 103, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !46, line: 193, baseType: !104)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !40, file: !41, line: 104, baseType: !245, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !40, file: !41, line: 105, baseType: !248, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !41, line: 94, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !41, line: 68, size: 3456, elements: !251)
!251 = !{!252, !260, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !285, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297, !301}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !250, file: !41, line: 69, baseType: !253, size: 128)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !41, line: 42, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !41, line: 38, size: 128, elements: !255)
!255 = !{!256, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !254, file: !41, line: 39, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !254, file: !41, line: 40, baseType: !187, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !254, file: !41, line: 41, baseType: !117, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !250, file: !41, line: 70, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !39, line: 66, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!66, !66, !66, !78, !78}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !250, file: !41, line: 71, baseType: !66, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !250, file: !41, line: 72, baseType: !28, size: 8, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !250, file: !41, line: 73, baseType: !28, size: 8, offset: 264)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !250, file: !41, line: 74, baseType: !117, size: 32, offset: 288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !250, file: !41, line: 75, baseType: !44, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !250, file: !41, line: 76, baseType: !257, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !250, file: !41, line: 77, baseType: !44, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !250, file: !41, line: 78, baseType: !44, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !250, file: !41, line: 79, baseType: !44, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !250, file: !41, line: 80, baseType: !44, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !250, file: !41, line: 81, baseType: !276, size: 192, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !277, line: 28, baseType: !278)
!277 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !277, line: 24, size: 192, elements: !279)
!279 = !{!280, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !278, file: !277, line: 25, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !278, file: !277, line: 26, baseType: !78, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !278, file: !277, line: 27, baseType: !78, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !250, file: !41, line: 82, baseType: !286, size: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !29, line: 20, baseType: !78)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !250, file: !41, line: 83, baseType: !286, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !250, file: !41, line: 84, baseType: !286, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !250, file: !41, line: 85, baseType: !286, size: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !250, file: !41, line: 86, baseType: !117, size: 32, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !250, file: !41, line: 87, baseType: !117, size: 32, offset: 1184)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !250, file: !41, line: 88, baseType: !157, size: 64, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !250, file: !41, line: 89, baseType: !105, size: 128, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !250, file: !41, line: 90, baseType: !295, size: 64, offset: 1408)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !250, file: !41, line: 91, baseType: !220, size: 320, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !250, file: !41, line: 92, baseType: !298, size: 576, offset: 1792)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 576, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 9)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !250, file: !41, line: 93, baseType: !302, size: 1088, offset: 2368)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 1088, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 17)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !40, file: !41, line: 106, baseType: !306, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !41, line: 55, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !41, line: 48, size: 320, elements: !309)
!309 = !{!310, !311, !312, !313, !316, !317}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !308, file: !41, line: 49, baseType: !245, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !308, file: !41, line: 50, baseType: !245, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !308, file: !41, line: 51, baseType: !245, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !308, file: !41, line: 52, baseType: !314, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !308, file: !41, line: 53, baseType: !117, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !308, file: !41, line: 54, baseType: !117, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !40, file: !41, line: 107, baseType: !314, size: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !40, file: !41, line: 108, baseType: !245, size: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !40, file: !41, line: 109, baseType: !245, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !40, file: !41, line: 110, baseType: !306, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !40, file: !41, line: 111, baseType: !306, size: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !40, file: !41, line: 112, baseType: !117, size: 32, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !40, file: !41, line: 113, baseType: !117, size: 32, offset: 736)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !40, file: !41, line: 114, baseType: !326, size: 16, offset: 768)
!326 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !40, file: !41, line: 115, baseType: !326, size: 16, offset: 784)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !40, file: !41, line: 116, baseType: !28, size: 8, offset: 800)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !40, file: !41, line: 117, baseType: !28, size: 8, offset: 808)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !40, file: !41, line: 118, baseType: !117, size: 32, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !40, file: !41, line: 119, baseType: !117, size: 32, offset: 864)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !40, file: !41, line: 120, baseType: !333, size: 64, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !39, line: 330, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !37, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !39, line: 326, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !39, line: 346, size: 960, elements: !340)
!340 = !{!341, !342, !345, !346, !347, !348, !349, !350, !351, !352, !356}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !339, file: !39, line: 347, baseType: !117, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !39, line: 348, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !339, file: !39, line: 349, baseType: !343, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !339, file: !39, line: 350, baseType: !343, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !339, file: !39, line: 351, baseType: !343, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !339, file: !39, line: 352, baseType: !117, size: 32, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !339, file: !39, line: 353, baseType: !117, size: 32, offset: 352)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !339, file: !39, line: 354, baseType: !117, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !339, file: !39, line: 355, baseType: !117, size: 32, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !339, file: !39, line: 356, baseType: !353, size: 480, offset: 448)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 480, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 60)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !339, file: !39, line: 358, baseType: !117, size: 32, offset: 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !40, file: !41, line: 121, baseType: !105, size: 128, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !40, file: !41, line: 122, baseType: !105, size: 128, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !40, file: !41, line: 123, baseType: !44, size: 64, offset: 1216)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !40, file: !41, line: 124, baseType: !44, size: 64, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !40, file: !41, line: 125, baseType: !362, size: 64, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !41, line: 18, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !40, file: !41, line: 126, baseType: !365, size: 64, offset: 1408)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !366, line: 49, baseType: !68)
!366 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!367 = !{!368, !369}
!368 = !DILocalVariable(name: "L", arg: 1, scope: !34, file: !3, line: 30, type: !37)
!369 = !DILocalVariable(name: "i", scope: !34, file: !3, line: 38, type: !117)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 1088, elements: !303)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 704, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 11)
!375 = !{i32 2, !"Dwarf Version", i32 4}
!376 = !{i32 2, !"Debug Info Version", i32 3}
!377 = !{i32 1, !"wchar_size", i32 4}
!378 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!379 = !DILocation(line: 30, column: 28, scope: !34)
!380 = !DILocation(line: 38, column: 7, scope: !34)
!381 = !DILocation(line: 39, column: 3, scope: !382)
!382 = distinct !DILexicalBlock(scope: !34, file: !3, line: 39, column: 3)
!383 = !DILocation(line: 40, column: 23, scope: !384)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 39, column: 26)
!385 = distinct !DILexicalBlock(scope: !382, file: !3, line: 39, column: 3)
!386 = !{!387, !387, i64 0}
!387 = !{!"any pointer", !388, i64 0}
!388 = !{!"omnipotent char", !389, i64 0}
!389 = !{!"Simple C/C++ TBAA"}
!390 = !DILocation(line: 40, column: 5, scope: !384)
!391 = !{!392, !387, i64 32}
!392 = !{!"lua_State", !387, i64 0, !388, i64 8, !388, i64 9, !388, i64 10, !387, i64 16, !387, i64 24, !387, i64 32, !387, i64 40, !387, i64 48, !387, i64 56, !387, i64 64, !387, i64 72, !387, i64 80, !393, i64 88, !393, i64 92, !394, i64 96, !394, i64 98, !388, i64 100, !388, i64 101, !393, i64 104, !393, i64 108, !387, i64 112, !395, i64 120, !395, i64 136, !387, i64 152, !387, i64 160, !387, i64 168, !396, i64 176}
!393 = !{!"int", !388, i64 0}
!394 = !{!"short", !388, i64 0}
!395 = !{!"lua_TValue", !388, i64 0, !393, i64 8}
!396 = !{!"long", !388, i64 0}
!397 = !DILocation(line: 40, column: 21, scope: !384)
!398 = !DILocation(line: 41, column: 5, scope: !384)
!399 = !{!388, !388, i64 0}
!400 = !DILocation(line: 39, column: 22, scope: !385)
!401 = !DILocation(line: 39, column: 14, scope: !385)
!402 = distinct !{!402, !381, !403}
!403 = !DILocation(line: 42, column: 3, scope: !382)
!404 = !DILocation(line: 43, column: 1, scope: !34)
!405 = distinct !DISubprogram(name: "luaT_gettm", scope: !3, file: !3, line: 50, type: !406, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !413)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !410, !412, !197}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !46, line: 348, baseType: !95)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "TMS", file: !6, line: 37, baseType: !5)
!413 = !{!414, !415, !416, !417}
!414 = !DILocalVariable(name: "events", arg: 1, scope: !405, file: !3, line: 50, type: !410)
!415 = !DILocalVariable(name: "event", arg: 2, scope: !405, file: !3, line: 50, type: !412)
!416 = !DILocalVariable(name: "ename", arg: 3, scope: !405, file: !3, line: 50, type: !197)
!417 = !DILocalVariable(name: "tm", scope: !405, file: !3, line: 51, type: !408)
!418 = !DILocation(line: 50, column: 34, scope: !405)
!419 = !DILocation(line: 50, column: 46, scope: !405)
!420 = !DILocation(line: 50, column: 62, scope: !405)
!421 = !DILocation(line: 51, column: 22, scope: !405)
!422 = !DILocation(line: 51, column: 17, scope: !405)
