; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lvm.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lvm.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, {}*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 18, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ltm.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!7 = !DIEnumerator(name: "TM_INDEX", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TM_NEWINDEX", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "TM_GC", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "TM_MODE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "TM_EQ", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "TM_ADD", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "TM_SUB", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "TM_MUL", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "TM_DIV", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "TM_MOD", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "TM_POW", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "TM_UNM", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "TM_LEN", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "TM_LT", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "TM_LE", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "TM_CONCAT", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "TM_CALL", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "TM_N", value: 17, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 150, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lopcodes.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!28 = !DIEnumerator(name: "OP_MOVE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "OP_LOADK", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "OP_LOADBOOL", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "OP_LOADNIL", value: 3, isUnsigned: true)
!32 = !DIEnumerator(name: "OP_GETUPVAL", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "OP_GETGLOBAL", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "OP_GETTABLE", value: 6, isUnsigned: true)
!35 = !DIEnumerator(name: "OP_SETGLOBAL", value: 7, isUnsigned: true)
!36 = !DIEnumerator(name: "OP_SETUPVAL", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "OP_SETTABLE", value: 9, isUnsigned: true)
!38 = !DIEnumerator(name: "OP_NEWTABLE", value: 10, isUnsigned: true)
!39 = !DIEnumerator(name: "OP_SELF", value: 11, isUnsigned: true)
!40 = !DIEnumerator(name: "OP_ADD", value: 12, isUnsigned: true)
!41 = !DIEnumerator(name: "OP_SUB", value: 13, isUnsigned: true)
!42 = !DIEnumerator(name: "OP_MUL", value: 14, isUnsigned: true)
!43 = !DIEnumerator(name: "OP_DIV", value: 15, isUnsigned: true)
!44 = !DIEnumerator(name: "OP_MOD", value: 16, isUnsigned: true)
!45 = !DIEnumerator(name: "OP_POW", value: 17, isUnsigned: true)
!46 = !DIEnumerator(name: "OP_UNM", value: 18, isUnsigned: true)
!47 = !DIEnumerator(name: "OP_NOT", value: 19, isUnsigned: true)
!48 = !DIEnumerator(name: "OP_LEN", value: 20, isUnsigned: true)
!49 = !DIEnumerator(name: "OP_CONCAT", value: 21, isUnsigned: true)
!50 = !DIEnumerator(name: "OP_JMP", value: 22, isUnsigned: true)
!51 = !DIEnumerator(name: "OP_EQ", value: 23, isUnsigned: true)
!52 = !DIEnumerator(name: "OP_LT", value: 24, isUnsigned: true)
!53 = !DIEnumerator(name: "OP_LE", value: 25, isUnsigned: true)
!54 = !DIEnumerator(name: "OP_TEST", value: 26, isUnsigned: true)
!55 = !DIEnumerator(name: "OP_TESTSET", value: 27, isUnsigned: true)
!56 = !DIEnumerator(name: "OP_CALL", value: 28, isUnsigned: true)
!57 = !DIEnumerator(name: "OP_TAILCALL", value: 29, isUnsigned: true)
!58 = !DIEnumerator(name: "OP_RETURN", value: 30, isUnsigned: true)
!59 = !DIEnumerator(name: "OP_FORLOOP", value: 31, isUnsigned: true)
!60 = !DIEnumerator(name: "OP_FORPREP", value: 32, isUnsigned: true)
!61 = !DIEnumerator(name: "OP_TFORLOOP", value: 33, isUnsigned: true)
!62 = !DIEnumerator(name: "OP_SETLIST", value: 34, isUnsigned: true)
!63 = !DIEnumerator(name: "OP_CLOSE", value: 35, isUnsigned: true)
!64 = !DIEnumerator(name: "OP_CLOSURE", value: 36, isUnsigned: true)
!65 = !DIEnumerator(name: "OP_VARARG", value: 37, isUnsigned: true)
!66 = !{!67, !70, !96, !108, !148, !291, !400, !145, !238, !134}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !72, line: 36, baseType: !73)
!72 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!73 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !74, line: 136, size: 1472, elements: !75)
!74 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!75 = !{!76, !86, !113, !173, !396, !397, !398, !399}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !73, file: !74, line: 137, baseType: !77, size: 128)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !72, line: 51, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !72, line: 49, size: 128, elements: !79)
!79 = !{!80, !81, !85}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !72, line: 50, baseType: !70, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !78, file: !72, line: 50, baseType: !82, size: 8, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !83, line: 27, baseType: !84)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !78, file: !72, line: 50, baseType: !82, size: 8, offset: 72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !73, file: !74, line: 138, baseType: !87, size: 192)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !72, line: 199, size: 192, elements: !88)
!88 = !{!89, !99}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !87, file: !72, line: 200, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !83, line: 47, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !83, line: 47, size: 64, elements: !92)
!92 = !{!93, !95, !97}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !91, file: !83, line: 47, baseType: !94, size: 64)
!94 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !83, line: 47, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !91, file: !83, line: 47, baseType: !98, size: 64)
!98 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !87, file: !72, line: 206, baseType: !100, size: 192)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !72, line: 201, size: 192, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !72, line: 202, baseType: !70, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !100, file: !72, line: 202, baseType: !82, size: 8, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !100, file: !72, line: 202, baseType: !82, size: 8, offset: 72)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !100, file: !72, line: 203, baseType: !82, size: 8, offset: 80)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !100, file: !72, line: 204, baseType: !5, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, file: !72, line: 205, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 40, baseType: !110)
!109 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !111, line: 129, baseType: !112)
!111 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !73, file: !74, line: 139, baseType: !114, size: 320)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !72, line: 215, size: 320, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !114, file: !72, line: 216, baseType: !90, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !114, file: !72, line: 222, baseType: !118, size: 320)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !72, line: 217, size: 320, elements: !119)
!119 = !{!120, !121, !122, !123, !171, !172}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !72, line: 218, baseType: !70, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !118, file: !72, line: 218, baseType: !82, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !118, file: !72, line: 218, baseType: !82, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !118, file: !72, line: 219, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !72, line: 338, size: 512, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !150, !168, !169, !170}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !72, line: 339, baseType: !70, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !125, file: !72, line: 339, baseType: !82, size: 8, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !125, file: !72, line: 339, baseType: !82, size: 8, offset: 72)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !72, line: 340, baseType: !82, size: 8, offset: 80)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !125, file: !72, line: 341, baseType: !82, size: 8, offset: 88)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !125, file: !72, line: 342, baseType: !124, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !125, file: !72, line: 343, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !72, line: 75, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !72, line: 73, size: 128, elements: !137)
!137 = !{!138, !149}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !136, file: !72, line: 74, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !72, line: 64, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !72, line: 59, size: 64, elements: !141)
!141 = !{!142, !143, !144, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !140, file: !72, line: 60, baseType: !70, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !140, file: !72, line: 61, baseType: !96, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !140, file: !72, line: 62, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !146, line: 99, baseType: !94)
!146 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !140, file: !72, line: 63, baseType: !148, size: 32)
!148 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !136, file: !72, line: 74, baseType: !148, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !125, file: !72, line: 344, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !72, line: 335, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !72, line: 332, size: 320, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !153, file: !72, line: 333, baseType: !135, size: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !153, file: !72, line: 334, baseType: !157, size: 192, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !72, line: 329, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !72, line: 323, size: 192, elements: !159)
!159 = !{!160, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !158, file: !72, line: 327, baseType: !161, size: 192)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !158, file: !72, line: 324, size: 192, elements: !162)
!162 = !{!163, !164, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !161, file: !72, line: 325, baseType: !139, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !161, file: !72, line: 325, baseType: !148, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !72, line: 326, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !158, file: !72, line: 328, baseType: !135, size: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !125, file: !72, line: 345, baseType: !151, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !125, file: !72, line: 346, baseType: !70, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !125, file: !72, line: 347, baseType: !148, size: 32, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !118, file: !72, line: 220, baseType: !124, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !118, file: !72, line: 221, baseType: !108, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !73, file: !74, line: 140, baseType: !174, size: 448)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !72, line: 309, size: 448, elements: !175)
!175 = !{!176, !345}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !174, file: !72, line: 310, baseType: !177, size: 448)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !72, line: 299, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !72, line: 295, size: 448, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !341}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !72, line: 296, baseType: !70, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !178, file: !72, line: 296, baseType: !82, size: 8, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !178, file: !72, line: 296, baseType: !82, size: 8, offset: 72)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !178, file: !72, line: 296, baseType: !82, size: 8, offset: 80)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !178, file: !72, line: 296, baseType: !82, size: 8, offset: 88)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !178, file: !72, line: 296, baseType: !70, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !178, file: !72, line: 296, baseType: !124, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !178, file: !72, line: 297, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !146, line: 52, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!148, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !146, line: 50, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !74, line: 100, size: 1472, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !202, !203, !280, !294, !295, !296, !297, !298, !299, !300, !301, !303, !304, !305, !306, !307, !308, !331, !332, !333, !334, !335, !338}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !74, line: 101, baseType: !70, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !194, file: !74, line: 101, baseType: !82, size: 8, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !194, file: !74, line: 101, baseType: !82, size: 8, offset: 72)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !194, file: !74, line: 102, baseType: !82, size: 8, offset: 80)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !194, file: !74, line: 103, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !72, line: 193, baseType: !134)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !194, file: !74, line: 104, baseType: !201, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !194, file: !74, line: 105, baseType: !204, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !74, line: 94, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !74, line: 68, size: 3456, elements: !207)
!207 = !{!208, !217, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !241, !243, !244, !245, !246, !247, !248, !249, !250, !252, !270, !274}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !206, file: !74, line: 69, baseType: !209, size: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !74, line: 42, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !74, line: 38, size: 128, elements: !211)
!211 = !{!212, !214, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !210, file: !74, line: 39, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !210, file: !74, line: 40, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !83, line: 18, baseType: !5)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !210, file: !74, line: 41, baseType: !148, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !206, file: !74, line: 70, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !146, line: 66, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!96, !96, !96, !108, !108}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !206, file: !74, line: 71, baseType: !96, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !206, file: !74, line: 72, baseType: !82, size: 8, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !206, file: !74, line: 73, baseType: !82, size: 8, offset: 264)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !206, file: !74, line: 74, baseType: !148, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !206, file: !74, line: 75, baseType: !70, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !206, file: !74, line: 76, baseType: !213, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !206, file: !74, line: 77, baseType: !70, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !206, file: !74, line: 78, baseType: !70, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !206, file: !74, line: 79, baseType: !70, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !206, file: !74, line: 80, baseType: !70, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !206, file: !74, line: 81, baseType: !233, size: 192, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !234, line: 28, baseType: !235)
!234 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !234, line: 24, size: 192, elements: !236)
!236 = !{!237, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !235, file: !234, line: 25, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !235, file: !234, line: 26, baseType: !108, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !235, file: !234, line: 27, baseType: !108, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !206, file: !74, line: 82, baseType: !242, size: 64, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !83, line: 20, baseType: !108)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !206, file: !74, line: 83, baseType: !242, size: 64, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !206, file: !74, line: 84, baseType: !242, size: 64, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !206, file: !74, line: 85, baseType: !242, size: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !206, file: !74, line: 86, baseType: !148, size: 32, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !206, file: !74, line: 87, baseType: !148, size: 32, offset: 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !206, file: !74, line: 88, baseType: !188, size: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !206, file: !74, line: 89, baseType: !135, size: 128, offset: 1280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !206, file: !74, line: 90, baseType: !251, size: 64, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !206, file: !74, line: 91, baseType: !253, size: 320, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !72, line: 284, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !72, line: 274, size: 320, elements: !255)
!255 = !{!256, !257, !258, !259, !260}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !72, line: 275, baseType: !70, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !254, file: !72, line: 275, baseType: !82, size: 8, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !254, file: !72, line: 275, baseType: !82, size: 8, offset: 72)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !254, file: !72, line: 276, baseType: !134, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !254, file: !72, line: 283, baseType: !261, size: 128, offset: 192)
!261 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !254, file: !72, line: 277, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !261, file: !72, line: 278, baseType: !135, size: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !261, file: !72, line: 282, baseType: !265, size: 128)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !261, file: !72, line: 279, size: 128, elements: !266)
!266 = !{!267, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !265, file: !72, line: 280, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !72, line: 281, baseType: !268, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !206, file: !74, line: 92, baseType: !271, size: 576, offset: 1792)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 576, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 9)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !206, file: !74, line: 93, baseType: !275, size: 1088, offset: 2368)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 1088, elements: !278)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !72, line: 207, baseType: !87)
!278 = !{!279}
!279 = !DISubrange(count: 17)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !194, file: !74, line: 106, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !74, line: 55, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !74, line: 48, size: 320, elements: !284)
!284 = !{!285, !286, !287, !288, !292, !293}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !283, file: !74, line: 49, baseType: !201, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !283, file: !74, line: 50, baseType: !201, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !283, file: !74, line: 51, baseType: !201, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !283, file: !74, line: 52, baseType: !289, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !83, line: 88, baseType: !215)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !283, file: !74, line: 53, baseType: !148, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !283, file: !74, line: 54, baseType: !148, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !194, file: !74, line: 107, baseType: !289, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !194, file: !74, line: 108, baseType: !201, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !194, file: !74, line: 109, baseType: !201, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !194, file: !74, line: 110, baseType: !281, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !194, file: !74, line: 111, baseType: !281, size: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !194, file: !74, line: 112, baseType: !148, size: 32, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !194, file: !74, line: 113, baseType: !148, size: 32, offset: 736)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !194, file: !74, line: 114, baseType: !302, size: 16, offset: 768)
!302 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !194, file: !74, line: 115, baseType: !302, size: 16, offset: 784)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !194, file: !74, line: 116, baseType: !82, size: 8, offset: 800)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !194, file: !74, line: 117, baseType: !82, size: 8, offset: 808)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !194, file: !74, line: 118, baseType: !148, size: 32, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !194, file: !74, line: 119, baseType: !148, size: 32, offset: 864)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !194, file: !74, line: 120, baseType: !309, size: 64, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !146, line: 330, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !192, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !146, line: 326, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !146, line: 346, size: 960, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !330}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !315, file: !146, line: 347, baseType: !148, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !146, line: 348, baseType: !67, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !315, file: !146, line: 349, baseType: !67, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !315, file: !146, line: 350, baseType: !67, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !315, file: !146, line: 351, baseType: !67, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !315, file: !146, line: 352, baseType: !148, size: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !315, file: !146, line: 353, baseType: !148, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !315, file: !146, line: 354, baseType: !148, size: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !315, file: !146, line: 355, baseType: !148, size: 32, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !315, file: !146, line: 356, baseType: !327, size: 480, offset: 448)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 480, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 60)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !315, file: !146, line: 358, baseType: !148, size: 32, offset: 928)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !194, file: !74, line: 121, baseType: !135, size: 128, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !194, file: !74, line: 122, baseType: !135, size: 128, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !194, file: !74, line: 123, baseType: !70, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !194, file: !74, line: 124, baseType: !70, size: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !194, file: !74, line: 125, baseType: !336, size: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !74, line: 18, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !194, file: !74, line: 126, baseType: !339, size: 64, offset: 1408)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !340, line: 49, baseType: !98)
!340 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !178, file: !72, line: 298, baseType: !342, size: 128, offset: 320)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 1)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !174, file: !72, line: 311, baseType: !346, size: 384)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !72, line: 306, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !72, line: 302, size: 384, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !393}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !72, line: 303, baseType: !70, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !347, file: !72, line: 303, baseType: !82, size: 8, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !347, file: !72, line: 303, baseType: !82, size: 8, offset: 72)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !347, file: !72, line: 303, baseType: !82, size: 8, offset: 80)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !347, file: !72, line: 303, baseType: !82, size: 8, offset: 88)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !347, file: !72, line: 303, baseType: !70, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !347, file: !72, line: 303, baseType: !124, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !347, file: !72, line: 304, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !72, line: 231, size: 960, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !366, !368, !370, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !358, file: !72, line: 232, baseType: !70, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !358, file: !72, line: 232, baseType: !82, size: 8, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !358, file: !72, line: 232, baseType: !82, size: 8, offset: 72)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !358, file: !72, line: 233, baseType: !134, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !358, file: !72, line: 234, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !358, file: !72, line: 235, baseType: !367, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !358, file: !72, line: 236, baseType: !369, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !358, file: !72, line: 237, baseType: !371, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !72, line: 262, size: 128, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !372, file: !72, line: 263, baseType: !276, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !372, file: !72, line: 264, baseType: !148, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !372, file: !72, line: 265, baseType: !148, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !358, file: !72, line: 238, baseType: !378, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !358, file: !72, line: 239, baseType: !276, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !358, file: !72, line: 240, baseType: !148, size: 32, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !358, file: !72, line: 241, baseType: !148, size: 32, offset: 608)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !358, file: !72, line: 242, baseType: !148, size: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !358, file: !72, line: 243, baseType: !148, size: 32, offset: 672)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !358, file: !72, line: 244, baseType: !148, size: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !358, file: !72, line: 245, baseType: !148, size: 32, offset: 736)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !358, file: !72, line: 246, baseType: !148, size: 32, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !358, file: !72, line: 247, baseType: !148, size: 32, offset: 800)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !358, file: !72, line: 248, baseType: !70, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !358, file: !72, line: 249, baseType: !82, size: 8, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !358, file: !72, line: 250, baseType: !82, size: 8, offset: 904)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !358, file: !72, line: 251, baseType: !82, size: 8, offset: 912)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !358, file: !72, line: 252, baseType: !82, size: 8, offset: 920)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !347, file: !72, line: 305, baseType: !394, size: 64, offset: 320)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 64, elements: !343)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !73, file: !74, line: 141, baseType: !125, size: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !73, file: !74, line: 142, baseType: !358, size: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !73, file: !74, line: 143, baseType: !254, size: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !73, file: !74, line: 144, baseType: !194, size: 1472)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpCode", file: !26, line: 208, baseType: !25)
!401 = !{i32 2, !"Dwarf Version", i32 4}
!402 = !{i32 2, !"Debug Info Version", i32 3}
!403 = !{i32 1, !"wchar_size", i32 4}
!404 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!405 = distinct !DISubprogram(name: "luaV_tonumber", scope: !1, file: !1, line: 35, type: !406, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !410)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !408, !134}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!410 = !{!411, !412, !413, !414}
!411 = !DILocalVariable(name: "obj", arg: 1, scope: !405, file: !1, line: 35, type: !408)
!412 = !DILocalVariable(name: "n", arg: 2, scope: !405, file: !1, line: 35, type: !134)
!413 = !DILocalVariable(name: "num", scope: !405, file: !1, line: 36, type: !145)
!414 = !DILocalVariable(name: "i_o", scope: !415, file: !1, line: 39, type: !134)
!415 = distinct !DILexicalBlock(scope: !416, file: !1, line: 39, column: 5)
!416 = distinct !DILexicalBlock(scope: !417, file: !1, line: 38, column: 57)
!417 = distinct !DILexicalBlock(scope: !405, file: !1, line: 38, column: 7)
!418 = !DILocation(line: 35, column: 44, scope: !405)
!419 = !DILocation(line: 35, column: 57, scope: !405)
!420 = !DILocation(line: 36, column: 3, scope: !405)
!421 = !DILocation(line: 37, column: 7, scope: !422)
!422 = distinct !DILexicalBlock(scope: !405, file: !1, line: 37, column: 7)
!423 = !{!424, !427, i64 8}
!424 = !{!"lua_TValue", !425, i64 0, !427, i64 8}
!425 = !{!"omnipotent char", !426, i64 0}
!426 = !{!"Simple C/C++ TBAA"}
!427 = !{!"int", !425, i64 0}
!428 = !DILocation(line: 37, column: 7, scope: !405)
!429 = !DILocation(line: 38, column: 37, scope: !417)
!430 = !{!425, !425, i64 0}
!431 = !DILocation(line: 36, column: 14, scope: !405)
!432 = !DILocation(line: 38, column: 26, scope: !417)
!433 = !DILocation(line: 38, column: 7, scope: !405)
!434 = !DILocation(line: 39, column: 5, scope: !415)
!435 = !{!436, !436, i64 0}
!436 = !{!"double", !425, i64 0}
!437 = !DILocation(line: 40, column: 5, scope: !416)
!438 = !DILocation(line: 43, column: 5, scope: !417)
!439 = !DILocation(line: 0, scope: !417)
!440 = !DILocation(line: 44, column: 1, scope: !405)
!441 = distinct !DISubprogram(name: "luaV_tostring", scope: !1, file: !1, line: 47, type: !442, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!148, !192, !201}
!444 = !{!445, !446, !447, !453, !454}
!445 = !DILocalVariable(name: "L", arg: 1, scope: !441, file: !1, line: 47, type: !192)
!446 = !DILocalVariable(name: "obj", arg: 2, scope: !441, file: !1, line: 47, type: !201)
!447 = !DILocalVariable(name: "s", scope: !448, file: !1, line: 51, type: !450)
!448 = distinct !DILexicalBlock(scope: !449, file: !1, line: 50, column: 8)
!449 = distinct !DILexicalBlock(scope: !441, file: !1, line: 48, column: 7)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 32)
