; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/mktime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/mktime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__tzinfo_struct = type { i32, i32, [2 x %struct.__tzrule_struct] }
%struct.__tzrule_struct = type { i8, i32, i32, i32, i32, i64, i64 }

@_DAYS_BEFORE_MONTH = internal unnamed_addr constant [12 x i32] [i32 0, i32 31, i32 59, i32 90, i32 120, i32 151, i32 181, i32 212, i32 243, i32 273, i32 304, i32 334], align 16, !dbg !0
@_daylight = external dso_local local_unnamed_addr global i32, align 4
@DAYS_IN_MONTH = internal unnamed_addr constant [12 x i32] [i32 31, i32 28, i32 31, i32 30, i32 31, i32 30, i32 31, i32 31, i32 30, i32 31, i32 30, i32 31], align 16, !dbg !11
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i64 @mktime(%struct.tm* nocapture) local_unnamed_addr #0 !dbg !21 {
  %2 = tail call %struct.__tzinfo_struct* @__gettzinfo() #3, !dbg !89
  tail call fastcc void @validate_structure(%struct.tm* %0) #4, !dbg !91
  %3 = getelementptr inbounds %struct.tm, %struct.tm* %0, i64 0, i32 0, !dbg !92
  %4 = load i32, i32* %3, align 8, !dbg !92, !tbaa !93
  %5 = sext i32 %4 to i64, !dbg !100

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_DAYS_BEFORE_MONTH", scope: !2, file: !3, line: 63, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !10)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/mktime.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !7, line: 34, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !{!11, !0}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "DAYS_IN_MONTH", scope: !2, file: !3, line: 58, type: !13, isLocal: true, isDefinition: true)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 384, elements: !15)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!15 = !{!16}
!16 = !DISubrange(count: 12)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!21 = distinct !DISubprogram(name: "mktime", scope: !3, file: !3, line: 157, type: !22, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !42)
!22 = !DISubroutineType(types: !23)
!23 = !{!6, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !26, line: 31, size: 448, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !25, file: !26, line: 32, baseType: !9, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !25, file: !26, line: 33, baseType: !9, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !25, file: !26, line: 34, baseType: !9, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !25, file: !26, line: 35, baseType: !9, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !25, file: !26, line: 36, baseType: !9, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !25, file: !26, line: 37, baseType: !9, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !25, file: !26, line: 38, baseType: !9, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !25, file: !26, line: 39, baseType: !9, size: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !25, file: !26, line: 40, baseType: !9, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !25, file: !26, line: 41, baseType: !8, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !25, file: !26, line: 42, baseType: !39, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !{!43, !44, !45, !46, !47, !48, !70, !73, !74, !77, !78, !79, !84}
!43 = !DILocalVariable(name: "tim_p", arg: 1, scope: !21, file: !3, line: 157, type: !24)
!44 = !DILocalVariable(name: "tim", scope: !21, file: !3, line: 160, type: !6)
!45 = !DILocalVariable(name: "days", scope: !21, file: !3, line: 161, type: !8)
!46 = !DILocalVariable(name: "year", scope: !21, file: !3, line: 162, type: !9)
!47 = !DILocalVariable(name: "isdst", scope: !21, file: !3, line: 162, type: !9)
!48 = !DILocalVariable(name: "tz", scope: !21, file: !3, line: 163, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzinfo_type", file: !51, line: 65, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzinfo_struct", file: !51, line: 60, size: 704, elements: !53)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__tznorth", scope: !52, file: !51, line: 62, baseType: !9, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__tzyear", scope: !52, file: !51, line: 63, baseType: !9, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__tzrule", scope: !52, file: !51, line: 64, baseType: !57, size: 640, offset: 64)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 640, elements: !68)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzrule_type", file: !51, line: 58, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzrule_struct", file: !51, line: 49, size: 320, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !59, file: !51, line: 51, baseType: !41, size: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !59, file: !51, line: 52, baseType: !9, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !59, file: !51, line: 53, baseType: !9, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !59, file: !51, line: 54, baseType: !9, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !59, file: !51, line: 55, baseType: !9, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !59, file: !51, line: 56, baseType: !6, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !59, file: !51, line: 57, baseType: !8, size: 64, offset: 256)
!68 = !{!69}
!69 = !DISubrange(count: 2)
!70 = !DILocalVariable(name: "tm_isdst", scope: !71, file: !3, line: 206, type: !9)
!71 = distinct !DILexicalBlock(scope: !72, file: !3, line: 205, column: 5)
!72 = distinct !DILexicalBlock(scope: !21, file: !3, line: 204, column: 7)
!73 = !DILocalVariable(name: "y", scope: !71, file: !3, line: 207, type: !9)
!74 = !DILocalVariable(name: "startdst_dst", scope: !75, file: !3, line: 216, type: !6)
!75 = distinct !DILexicalBlock(scope: !76, file: !3, line: 213, column: 2)
!76 = distinct !DILexicalBlock(scope: !71, file: !3, line: 212, column: 11)
!77 = !DILocalVariable(name: "startstd_dst", scope: !75, file: !3, line: 218, type: !6)
!78 = !DILocalVariable(name: "startstd_std", scope: !75, file: !3, line: 220, type: !6)
!79 = !DILocalVariable(name: "diff", scope: !80, file: !3, line: 240, type: !9)
!80 = distinct !DILexicalBlock(scope: !81, file: !3, line: 234, column: 3)
!81 = distinct !DILexicalBlock(scope: !82, file: !3, line: 233, column: 13)
!82 = distinct !DILexicalBlock(scope: !83, file: !3, line: 226, column: 6)
!83 = distinct !DILexicalBlock(scope: !75, file: !3, line: 223, column: 8)
!84 = !DILocalVariable(name: "mday", scope: !80, file: !3, line: 246, type: !9)
!85 = !DILocation(line: 157, column: 1, scope: !21)
!86 = !DILocation(line: 160, column: 10, scope: !21)
!87 = !DILocation(line: 161, column: 8, scope: !21)
!88 = !DILocation(line: 162, column: 13, scope: !21)
!89 = !DILocation(line: 163, column: 23, scope: !21)
!90 = !DILocation(line: 163, column: 18, scope: !21)
!91 = !DILocation(line: 166, column: 3, scope: !21)
!92 = !DILocation(line: 169, column: 17, scope: !21)
!93 = !{!94, !95, i64 0}
!94 = !{!"tm", !95, i64 0, !95, i64 4, !95, i64 8, !95, i64 12, !95, i64 16, !95, i64 20, !95, i64 24, !95, i64 28, !95, i64 32, !98, i64 40, !99, i64 48}
!95 = !{!"int", !96, i64 0}
!96 = !{!"omnipotent char", !97, i64 0}
!97 = !{!"Simple C/C++ TBAA"}
!98 = !{!"long", !96, i64 0}
!99 = !{!"any pointer", !96, i64 0}
!100 = !DILocation(line: 169, column: 10, scope: !21)
!101 = !DILocation(line: 169, column: 34, scope: !21)
!102 = !{!94, !95, i64 4}
!103 = !DILocation(line: 169, column: 27, scope: !21)
!104 = !DILocation(line: 169, column: 41, scope: !21)
!105 = !DILocation(line: 169, column: 24, scope: !21)
!106 = !DILocation(line: 170, column: 13, scope: !21)
!107 = !{!94, !95, i64 8}
!108 = !DILocation(line: 170, column: 6, scope: !21)
!109 = !DILocation(line: 170, column: 21, scope: !21)
!110 = !DILocation(line: 169, column: 59, scope: !21)
!111 = !DILocation(line: 173, column: 18, scope: !21)
!112 = !{!94, !95, i64 12}
!113 = !DILocation(line: 173, column: 26, scope: !21)
!114 = !DILocation(line: 173, column: 11, scope: !21)
!115 = !DILocation(line: 174, column: 37, scope: !21)
!116 = !{!94, !95, i64 16}
!117 = !DILocation(line: 174, column: 11, scope: !21)
!118 = !{!95, !95, i64 0}
!119 = !DILocation(line: 174, column: 8, scope: !21)
!120 = !DILocation(line: 175, column: 21, scope: !121)
!121 = distinct !DILexicalBlock(scope: !21, file: !3, line: 175, column: 7)
!122 = !DILocation(line: 0, scope: !123)
!123 = distinct !DILexicalBlock(scope: !21, file: !3, line: 181, column: 7)
!124 = !{!94, !95, i64 20}
!125 = !DILocation(line: 175, column: 28, scope: !121)
!126 = !DILocation(line: 175, column: 25, scope: !121)
!127 = !DILocation(line: 175, column: 7, scope: !21)
!128 = !DILocation(line: 176, column: 9, scope: !121)
!129 = !DILocation(line: 0, scope: !21)
!130 = !DILocation(line: 179, column: 20, scope: !21)
!131 = !DILocation(line: 179, column: 10, scope: !21)
!132 = !DILocation(line: 179, column: 18, scope: !21)
!133 = !{!94, !95, i64 28}
!134 = !DILocation(line: 181, column: 30, scope: !123)
!135 = !DILocation(line: 162, column: 7, scope: !21)
!136 = !DILocation(line: 185, column: 31, scope: !137)
!137 = distinct !DILexicalBlock(scope: !21, file: !3, line: 185, column: 7)
!138 = !DILocation(line: 185, column: 7, scope: !21)
!139 = !DILocation(line: 188, column: 10, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 187, column: 7)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 187, column: 7)
!142 = distinct !DILexicalBlock(scope: !137, file: !3, line: 186, column: 5)
!143 = !DILocation(line: 188, column: 7, scope: !140)
!144 = !DILocation(line: 187, column: 50, scope: !140)
!145 = !DILocation(line: 187, column: 28, scope: !140)
!146 = !DILocation(line: 187, column: 7, scope: !141)
!147 = distinct !{!147, !146, !148}
!148 = !DILocation(line: 188, column: 10, scope: !141)
!149 = !DILocation(line: 190, column: 17, scope: !150)
!150 = distinct !DILexicalBlock(scope: !137, file: !3, line: 190, column: 12)
!151 = !DILocation(line: 190, column: 12, scope: !137)
!152 = !DILocation(line: 192, column: 28, scope: !153)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 192, column: 7)
!154 = distinct !DILexicalBlock(scope: !155, file: !3, line: 192, column: 7)
!155 = distinct !DILexicalBlock(scope: !150, file: !3, line: 191, column: 5)
!156 = !DILocation(line: 192, column: 7, scope: !154)
!157 = !DILocation(line: 193, column: 10, scope: !153)
!158 = !DILocation(line: 193, column: 7, scope: !153)
!159 = !DILocation(line: 192, column: 50, scope: !153)
!160 = !DILocation(line: 0, scope: !155)
!161 = distinct !{!161, !156, !162}
!162 = !DILocation(line: 193, column: 10, scope: !154)
!163 = !DILocation(line: 194, column: 15, scope: !155)
!164 = !DILocation(line: 194, column: 12, scope: !155)
!165 = !DILocation(line: 195, column: 5, scope: !155)
!166 = !DILocation(line: 0, scope: !137)
!167 = !DILocation(line: 0, scope: !121)
!168 = !DILocation(line: 198, column: 16, scope: !21)
!169 = !DILocation(line: 198, column: 7, scope: !21)
!170 = !DILocation(line: 200, column: 3, scope: !21)
!171 = !DILocation(line: 202, column: 3, scope: !21)
!172 = !DILocation(line: 204, column: 7, scope: !72)
!173 = !DILocation(line: 204, column: 7, scope: !21)
!174 = !DILocation(line: 277, column: 37, scope: !175)
!175 = distinct !DILexicalBlock(scope: !21, file: !3, line: 274, column: 7)
!176 = !DILocation(line: 282, column: 10, scope: !21)
!177 = !DILocation(line: 274, column: 7, scope: !21)
!178 = !DILocation(line: 207, column: 22, scope: !71)
!179 = !DILocation(line: 207, column: 30, scope: !71)
!180 = !DILocation(line: 207, column: 11, scope: !71)
!181 = !DILocation(line: 209, column: 25, scope: !71)
!182 = !{!94, !95, i64 32}
!183 = !DILocation(line: 209, column: 34, scope: !71)
!184 = !DILocation(line: 209, column: 18, scope: !71)
!185 = !DILocation(line: 206, column: 11, scope: !71)
!186 = !DILocation(line: 212, column: 20, scope: !76)
!187 = !{!188, !95, i64 4}
!188 = !{!"__tzinfo_struct", !95, i64 0, !95, i64 4, !96, i64 8}
!189 = !DILocation(line: 212, column: 13, scope: !76)
!190 = !DILocation(line: 212, column: 29, scope: !76)
!191 = !DILocation(line: 212, column: 32, scope: !76)
!192 = !DILocation(line: 212, column: 11, scope: !71)
!193 = !DILocation(line: 275, column: 37, scope: !175)
!194 = !DILocation(line: 217, column: 33, scope: !75)
!195 = !{!196, !98, i64 32}
!196 = !{!"__tzrule_struct", !96, i64 0, !95, i64 4, !95, i64 8, !95, i64 12, !95, i64 16, !98, i64 24, !98, i64 32}
!197 = !DILocation(line: 218, column: 42, scope: !75)
!198 = !{!196, !98, i64 24}
!199 = !DILocation(line: 221, column: 33, scope: !75)
!200 = !DILocation(line: 221, column: 6, scope: !75)
!201 = !DILocation(line: 220, column: 11, scope: !75)
!202 = !DILocation(line: 223, column: 12, scope: !83)
!203 = !DILocation(line: 219, column: 6, scope: !75)
!204 = !DILocation(line: 223, column: 35, scope: !83)
!205 = !DILocation(line: 223, column: 28, scope: !83)
!206 = !DILocation(line: 216, column: 49, scope: !75)
!207 = !DILocation(line: 217, column: 6, scope: !75)
!208 = !DILocation(line: 216, column: 18, scope: !75)
!209 = !DILocation(line: 227, column: 21, scope: !82)
!210 = !{!188, !95, i64 0}
!211 = !DILocation(line: 227, column: 17, scope: !82)
!212 = !DILocation(line: 0, scope: !82)
!213 = !DILocation(line: 228, column: 33, scope: !82)
!214 = !DILocation(line: 229, column: 33, scope: !82)
!215 = !DILocation(line: 233, column: 22, scope: !81)
!216 = !DILocation(line: 233, column: 39, scope: !81)
!217 = !DILocation(line: 233, column: 51, scope: !81)
!218 = !DILocation(line: 233, column: 28, scope: !81)
!219 = !DILocation(line: 241, column: 9, scope: !80)
!220 = !DILocation(line: 240, column: 16, scope: !80)
!221 = !DILocation(line: 240, column: 9, scope: !80)
!222 = !DILocation(line: 243, column: 14, scope: !223)
!223 = distinct !DILexicalBlock(scope: !80, file: !3, line: 242, column: 9)
!224 = !DILocation(line: 242, column: 9, scope: !80)
!225 = !DILocation(line: 244, column: 19, scope: !80)
!226 = !DILocation(line: 245, column: 12, scope: !80)
!227 = !DILocation(line: 245, column: 9, scope: !80)
!228 = !DILocation(line: 246, column: 23, scope: !80)
!229 = !DILocation(line: 246, column: 9, scope: !80)
!230 = !DILocation(line: 247, column: 5, scope: !80)
!231 = !DILocation(line: 248, column: 19, scope: !80)
!232 = !DILocation(line: 248, column: 27, scope: !80)
!233 = !DILocation(line: 250, column: 9, scope: !234)
!234 = distinct !DILexicalBlock(scope: !80, file: !3, line: 250, column: 9)
!235 = !DILocation(line: 250, column: 9, scope: !80)
!236 = !DILocation(line: 252, column: 16, scope: !237)
!237 = distinct !DILexicalBlock(scope: !238, file: !3, line: 252, column: 11)
!238 = distinct !DILexicalBlock(scope: !234, file: !3, line: 250, column: 15)
!239 = !DILocation(line: 254, column: 21, scope: !240)
!240 = distinct !DILexicalBlock(scope: !237, file: !3, line: 254, column: 16)
!241 = !DILocation(line: 254, column: 16, scope: !237)
!242 = !DILocation(line: 252, column: 11, scope: !238)
!243 = !DILocation(line: 257, column: 15, scope: !238)
!244 = !DILocation(line: 257, column: 12, scope: !238)
!245 = !DILocation(line: 259, column: 27, scope: !246)
!246 = distinct !DILexicalBlock(scope: !238, file: !3, line: 259, column: 11)
!247 = !DILocation(line: 259, column: 36, scope: !246)
!248 = !DILocation(line: 259, column: 11, scope: !238)
!249 = !DILocation(line: 260, column: 6, scope: !250)
!250 = distinct !DILexicalBlock(scope: !246, file: !3, line: 259, column: 41)
!251 = !DILocation(line: 261, column: 23, scope: !250)
!252 = !DILocation(line: 261, column: 21, scope: !250)
!253 = !DILocation(line: 262, column: 7, scope: !250)
!254 = !DILocation(line: 263, column: 13, scope: !255)
!255 = distinct !DILexicalBlock(scope: !246, file: !3, line: 262, column: 14)
!256 = !DILocation(line: 264, column: 25, scope: !257)
!257 = distinct !DILexicalBlock(scope: !255, file: !3, line: 264, column: 10)
!258 = !DILocation(line: 264, column: 10, scope: !255)
!259 = !DILocation(line: 265, column: 20, scope: !257)
!260 = !DILocation(line: 265, column: 5, scope: !257)
!261 = !DILocation(line: 274, column: 13, scope: !175)
!262 = !DILocation(line: 0, scope: !175)
!263 = !DILocation(line: 279, column: 3, scope: !21)
!264 = !DILocation(line: 282, column: 19, scope: !21)
!265 = !DILocation(line: 285, column: 31, scope: !266)
!266 = distinct !DILexicalBlock(scope: !21, file: !3, line: 285, column: 7)
!267 = !DILocation(line: 285, column: 36, scope: !266)
!268 = !DILocation(line: 285, column: 25, scope: !266)
!269 = !DILocation(line: 285, column: 15, scope: !266)
!270 = !DILocation(line: 285, column: 41, scope: !266)
!271 = !DILocation(line: 286, column: 20, scope: !266)
!272 = !DILocation(line: 285, column: 7, scope: !21)
!273 = !DILocation(line: 0, scope: !266)
!274 = !{!94, !95, i64 24}
!275 = !DILocation(line: 288, column: 3, scope: !21)
!276 = !DILocation(line: 289, column: 1, scope: !21)
!277 = distinct !DISubprogram(name: "validate_structure", scope: !3, file: !3, line: 70, type: !278, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !280)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !24}
!280 = !{!281, !282, !289}
!281 = !DILocalVariable(name: "tim_p", arg: 1, scope: !277, file: !3, line: 70, type: !24)
!282 = !DILocalVariable(name: "res", scope: !277, file: !3, line: 73, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !284, line: 39, baseType: !285)
!284 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdlib.h", directory: "/root/.unikraft/apps/redis/build")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 35, size: 64, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !285, file: !284, line: 37, baseType: !9, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !285, file: !284, line: 38, baseType: !9, size: 32, offset: 32)
!289 = !DILocalVariable(name: "days_in_feb", scope: !277, file: !3, line: 74, type: !9)
!290 = !DILocation(line: 70, column: 1, scope: !277)
!291 = !DILocation(line: 74, column: 7, scope: !277)
!292 = !DILocation(line: 77, column: 14, scope: !293)
!293 = distinct !DILexicalBlock(scope: !277, file: !3, line: 77, column: 7)
!294 = !DILocation(line: 77, column: 25, scope: !293)
!295 = !DILocation(line: 88, column: 14, scope: !296)
!296 = distinct !DILexicalBlock(scope: !277, file: !3, line: 88, column: 7)
!297 = !DILocation(line: 79, column: 13, scope: !298)
!298 = distinct !DILexicalBlock(scope: !293, file: !3, line: 78, column: 5)
!299 = !DILocation(line: 73, column: 9, scope: !277)
!300 = !DILocation(line: 80, column: 14, scope: !298)
!301 = !DILocation(line: 80, column: 21, scope: !298)
!302 = !DILocation(line: 81, column: 26, scope: !303)
!303 = distinct !DILexicalBlock(scope: !298, file: !3, line: 81, column: 11)
!304 = !DILocation(line: 81, column: 37, scope: !303)
!305 = !DILocation(line: 81, column: 11, scope: !298)
!306 = !DILocation(line: 83, column: 18, scope: !307)
!307 = distinct !DILexicalBlock(scope: !303, file: !3, line: 82, column: 2)
!308 = !DILocation(line: 84, column: 4, scope: !307)
!309 = !DILocation(line: 85, column: 2, scope: !307)
!310 = !DILocation(line: 88, column: 25, scope: !296)
!311 = !DILocation(line: 99, column: 14, scope: !312)
!312 = distinct !DILexicalBlock(scope: !277, file: !3, line: 99, column: 7)
!313 = !DILocation(line: 90, column: 13, scope: !314)
!314 = distinct !DILexicalBlock(scope: !296, file: !3, line: 89, column: 5)
!315 = !DILocation(line: 91, column: 14, scope: !314)
!316 = !DILocation(line: 91, column: 22, scope: !314)
!317 = !DILocation(line: 92, column: 26, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !3, line: 92, column: 11)
!319 = !DILocation(line: 92, column: 37, scope: !318)
!320 = !DILocation(line: 92, column: 11, scope: !314)
!321 = !DILocation(line: 94, column: 18, scope: !322)
!322 = distinct !DILexicalBlock(scope: !318, file: !3, line: 93, column: 2)
!323 = !DILocation(line: 95, column: 4, scope: !322)
!324 = !DILocation(line: 96, column: 9, scope: !322)
!325 = !DILocation(line: 99, column: 26, scope: !312)
!326 = !DILocation(line: 101, column: 13, scope: !327)
!327 = distinct !DILexicalBlock(scope: !312, file: !3, line: 100, column: 5)
!328 = !DILocation(line: 102, column: 14, scope: !327)
!329 = !DILocation(line: 102, column: 22, scope: !327)
!330 = !DILocation(line: 103, column: 27, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !3, line: 103, column: 11)
!332 = !DILocation(line: 103, column: 38, scope: !331)
!333 = !DILocation(line: 103, column: 11, scope: !327)
!334 = !DILocation(line: 105, column: 19, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 104, column: 2)
!336 = !DILocation(line: 106, column: 4, scope: !335)
!337 = !DILocation(line: 107, column: 9, scope: !335)
!338 = !DILocation(line: 110, column: 14, scope: !339)
!339 = distinct !DILexicalBlock(scope: !277, file: !3, line: 110, column: 7)
!340 = !DILocation(line: 110, column: 25, scope: !339)
!341 = !DILocation(line: 121, column: 7, scope: !342)
!342 = distinct !DILexicalBlock(scope: !277, file: !3, line: 121, column: 7)
!343 = !DILocation(line: 112, column: 13, scope: !344)
!344 = distinct !DILexicalBlock(scope: !339, file: !3, line: 111, column: 5)
!345 = !DILocation(line: 113, column: 14, scope: !344)
!346 = !DILocation(line: 113, column: 22, scope: !344)
!347 = !DILocation(line: 114, column: 26, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 114, column: 11)
!349 = !DILocation(line: 114, column: 37, scope: !348)
!350 = !DILocation(line: 114, column: 11, scope: !344)
!351 = !DILocation(line: 116, column: 18, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !3, line: 115, column: 9)
