; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/mld6.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/ipv6/mld6.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!20 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!27 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!28 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!29 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!30 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!31 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!32 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!33 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 53, baseType: !36, size: 32, elements: !37)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!38 = !DIEnumerator(name: "ERR_OK", value: 0)
!39 = !DIEnumerator(name: "ERR_MEM", value: -1)
!40 = !DIEnumerator(name: "ERR_BUF", value: -2)
!41 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!42 = !DIEnumerator(name: "ERR_RTE", value: -4)
!43 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!44 = !DIEnumerator(name: "ERR_VAL", value: -6)
!45 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!46 = !DIEnumerator(name: "ERR_USE", value: -8)
!47 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!48 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!49 = !DIEnumerator(name: "ERR_CONN", value: -11)
!50 = !DIEnumerator(name: "ERR_IF", value: -12)
!51 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!52 = !DIEnumerator(name: "ERR_RST", value: -14)
!53 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!54 = !DIEnumerator(name: "ERR_ARG", value: -16)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "icmp6_type", file: !56, line: 47, baseType: !5, size: 32, elements: !57)
!56 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/icmp6.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!58 = !DIEnumerator(name: "ICMP6_TYPE_DUR", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "ICMP6_TYPE_PTB", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "ICMP6_TYPE_TE", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "ICMP6_TYPE_PP", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "ICMP6_TYPE_PE1", value: 100, isUnsigned: true)
!63 = !DIEnumerator(name: "ICMP6_TYPE_PE2", value: 101, isUnsigned: true)
!64 = !DIEnumerator(name: "ICMP6_TYPE_RSV_ERR", value: 127, isUnsigned: true)
!65 = !DIEnumerator(name: "ICMP6_TYPE_EREQ", value: 128, isUnsigned: true)
!66 = !DIEnumerator(name: "ICMP6_TYPE_EREP", value: 129, isUnsigned: true)
!67 = !DIEnumerator(name: "ICMP6_TYPE_MLQ", value: 130, isUnsigned: true)
!68 = !DIEnumerator(name: "ICMP6_TYPE_MLR", value: 131, isUnsigned: true)
!69 = !DIEnumerator(name: "ICMP6_TYPE_MLD", value: 132, isUnsigned: true)
!70 = !DIEnumerator(name: "ICMP6_TYPE_RS", value: 133, isUnsigned: true)
!71 = !DIEnumerator(name: "ICMP6_TYPE_RA", value: 134, isUnsigned: true)
!72 = !DIEnumerator(name: "ICMP6_TYPE_NS", value: 135, isUnsigned: true)
!73 = !DIEnumerator(name: "ICMP6_TYPE_NA", value: 136, isUnsigned: true)
!74 = !DIEnumerator(name: "ICMP6_TYPE_RD", value: 137, isUnsigned: true)
!75 = !DIEnumerator(name: "ICMP6_TYPE_MRA", value: 151, isUnsigned: true)
!76 = !DIEnumerator(name: "ICMP6_TYPE_MRS", value: 152, isUnsigned: true)
!77 = !DIEnumerator(name: "ICMP6_TYPE_MRT", value: 153, isUnsigned: true)
!78 = !DIEnumerator(name: "ICMP6_TYPE_PE3", value: 200, isUnsigned: true)
!79 = !DIEnumerator(name: "ICMP6_TYPE_PE4", value: 201, isUnsigned: true)
!80 = !DIEnumerator(name: "ICMP6_TYPE_RSV_INF", value: 255, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 89, baseType: !5, size: 32, elements: !83)
!82 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!83 = !{!84, !85, !86, !87, !88}
!84 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!85 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!86 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!87 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 145, baseType: !5, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!92 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!94 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!95 = !{!96, !129, !130, !108, !117, !124, !145, !146, !147}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mld_group", file: !98, line: 58, size: 320, elements: !99)
!98 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/mld6.h", directory: "/root/.unikraft/apps/redis/build")
!99 = !{!100, !101, !121, !122, !123, !128}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !98, line: 60, baseType: !96, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "group_address", scope: !97, file: !98, line: 62, baseType: !102, size: 160, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !103, line: 67, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !103, line: 59, size: 160, elements: !105)
!105 = !{!106, !116}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !104, file: !103, line: 60, baseType: !107, size: 128)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !114)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !109, line: 129, baseType: !110)
!109 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !111, line: 48, baseType: !112)
!111 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !113, line: 79, baseType: !5)
!113 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!114 = !{!115}
!115 = !DISubrange(count: 4)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !104, file: !103, line: 62, baseType: !117, size: 8, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !109, line: 125, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !111, line: 24, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !113, line: 43, baseType: !120)
!120 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "last_reporter_flag", scope: !97, file: !98, line: 64, baseType: !117, size: 8, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group_state", scope: !97, file: !98, line: 66, baseType: !117, size: 8, offset: 232)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !97, file: !98, line: 68, baseType: !124, size: 16, offset: 240)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !109, line: 127, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !111, line: 36, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !113, line: 57, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !97, file: !98, line: 70, baseType: !117, size: 8, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mld_header", file: !132, line: 53, size: 192, elements: !133)
!132 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/mld6.h", directory: "/root/.unikraft/apps/redis/build")
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !132, line: 54, baseType: !117, size: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !131, file: !132, line: 55, baseType: !117, size: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !131, file: !132, line: 56, baseType: !124, size: 16, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "max_resp_delay", scope: !131, file: !132, line: 57, baseType: !124, size: 16, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !131, file: !132, line: 58, baseType: !124, size: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "multicast_address", scope: !131, file: !132, line: 59, baseType: !140, size: 128, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !141, line: 60, baseType: !142)
!141 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !141, line: 53, size: 128, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !142, file: !141, line: 54, baseType: !107, size: 128)
!145 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!149 = !{i32 2, !"Dwarf Version", i32 4}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{i32 1, !"wchar_size", i32 4}
!152 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!153 = distinct !DISubprogram(name: "mld6_stop", scope: !1, file: !1, line: 96, type: !154, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !258)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !161}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !35, line: 96, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !109, line: 126, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !111, line: 20, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !113, line: 41, baseType: !160)
!160 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !4, line: 260, size: 2240, elements: !163)
!163 = !{!164, !165, !181, !182, !183, !187, !189, !191, !192, !208, !215, !220, !225, !230, !231, !232, !236, !237, !238, !239, !243, !244, !245, !250, !251, !252, !253}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !4, line: 263, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !162, file: !4, line: 268, baseType: !166, size: 192, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !167, line: 76, baseType: !168)
!167 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !167, line: 69, size: 192, elements: !169)
!169 = !{!170, !180}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !168, file: !167, line: 73, baseType: !171, size: 160)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !167, line: 70, size: 160, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !171, file: !167, line: 71, baseType: !102, size: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !171, file: !167, line: 72, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !176, line: 57, baseType: !177)
!176 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !176, line: 51, size: 32, elements: !178)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !177, file: !176, line: 52, baseType: !108, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !167, line: 75, baseType: !117, size: 8, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !162, file: !4, line: 269, baseType: !166, size: 192, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !162, file: !4, line: 270, baseType: !166, size: 192, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !162, file: !4, line: 274, baseType: !184, size: 576, offset: 640)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 576, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 3)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !162, file: !4, line: 277, baseType: !188, size: 24, offset: 1216)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 24, elements: !185)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !162, file: !4, line: 282, baseType: !190, size: 96, offset: 1248)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 96, elements: !185)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !162, file: !4, line: 283, baseType: !190, size: 96, offset: 1344)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !162, file: !4, line: 288, baseType: !193, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !4, line: 178, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!156, !197, !161}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !82, line: 186, size: 192, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !82, line: 188, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !198, file: !82, line: 191, baseType: !129, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !198, file: !82, line: 200, baseType: !124, size: 16, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !82, line: 203, baseType: !124, size: 16, offset: 144)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !198, file: !82, line: 208, baseType: !117, size: 8, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !82, line: 211, baseType: !117, size: 8, offset: 168)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !198, file: !82, line: 218, baseType: !117, size: 8, offset: 176)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !198, file: !82, line: 221, baseType: !117, size: 8, offset: 184)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !162, file: !4, line: 294, baseType: !209, size: 64, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !4, line: 189, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!156, !161, !197, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !162, file: !4, line: 299, baseType: !216, size: 64, offset: 1600)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !4, line: 212, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!156, !161, !197}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !162, file: !4, line: 305, baseType: !221, size: 64, offset: 1664)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !4, line: 202, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!156, !161, !197, !147}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !162, file: !4, line: 310, baseType: !226, size: 64, offset: 1728)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !4, line: 214, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !161}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !162, file: !4, line: 319, baseType: !226, size: 64, offset: 1792)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !162, file: !4, line: 323, baseType: !129, size: 64, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !162, file: !4, line: 325, baseType: !233, size: 64, offset: 1920)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 64, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 1)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !162, file: !4, line: 332, baseType: !124, size: 16, offset: 1984)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !162, file: !4, line: 335, baseType: !124, size: 16, offset: 2000)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !162, file: !4, line: 338, baseType: !124, size: 16, offset: 2016)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !162, file: !4, line: 341, baseType: !240, size: 48, offset: 2032)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 48, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 6)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !162, file: !4, line: 343, baseType: !117, size: 8, offset: 2080)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !162, file: !4, line: 345, baseType: !117, size: 8, offset: 2088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !4, line: 347, baseType: !246, size: 16, offset: 2096)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 16, elements: !248)
!247 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!248 = !{!249}
!249 = !DISubrange(count: 2)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !162, file: !4, line: 350, baseType: !117, size: 8, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !162, file: !4, line: 353, baseType: !117, size: 8, offset: 2120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !162, file: !4, line: 357, baseType: !117, size: 8, offset: 2128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !162, file: !4, line: 377, baseType: !254, size: 64, offset: 2176)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !4, line: 222, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!156, !161, !147, !3}
!258 = !{!259, !260, !261}
!259 = !DILocalVariable(name: "netif", arg: 1, scope: !153, file: !1, line: 96, type: !161)
!260 = !DILocalVariable(name: "group", scope: !153, file: !1, line: 98, type: !96)
!261 = !DILocalVariable(name: "next", scope: !262, file: !1, line: 103, type: !96)
!262 = distinct !DILexicalBlock(scope: !153, file: !1, line: 102, column: 25)
!263 = !DILocation(line: 96, column: 25, scope: !153)
!264 = !DILocation(line: 98, column: 29, scope: !153)
!265 = !{!266, !266, i64 0}
!266 = !{!"any pointer", !267, i64 0}
!267 = !{!"omnipotent char", !268, i64 0}
!268 = !{!"Simple C/C++ TBAA"}
!269 = !DILocation(line: 98, column: 21, scope: !153)
!270 = !DILocation(line: 100, column: 3, scope: !153)
!271 = !DILocation(line: 102, column: 16, scope: !153)
!272 = !DILocation(line: 102, column: 3, scope: !153)
!273 = !DILocation(line: 0, scope: !262)
!274 = !DILocation(line: 103, column: 37, scope: !262)
!275 = !{!276, !266, i64 0}
!276 = !{!"mld_group", !266, i64 0, !277, i64 8, !267, i64 28, !267, i64 29, !278, i64 30, !267, i64 32}
!277 = !{!"ip6_addr", !267, i64 0, !267, i64 16}
!278 = !{!"short", !267, i64 0}
!279 = !DILocation(line: 103, column: 23, scope: !262)
!280 = !DILocation(line: 106, column: 16, scope: !281)
!281 = distinct !DILexicalBlock(scope: !262, file: !1, line: 106, column: 9)
!282 = !{!283, !266, i64 272}
!283 = !{!"netif", !266, i64 0, !284, i64 8, !284, i64 32, !284, i64 56, !267, i64 80, !267, i64 152, !267, i64 156, !267, i64 168, !266, i64 184, !266, i64 192, !266, i64 200, !266, i64 208, !266, i64 216, !266, i64 224, !266, i64 232, !267, i64 240, !278, i64 248, !278, i64 250, !278, i64 252, !267, i64 254, !267, i64 260, !267, i64 261, !267, i64 262, !267, i64 264, !267, i64 265, !267, i64 266, !266, i64 272}
!284 = !{!"ip_addr", !267, i64 0, !267, i64 20}
!285 = !DILocation(line: 106, column: 31, scope: !281)
!286 = !DILocation(line: 106, column: 9, scope: !262)
!287 = !DILocation(line: 107, column: 45, scope: !288)
!288 = distinct !DILexicalBlock(scope: !281, file: !1, line: 106, column: 40)
!289 = !DILocation(line: 107, column: 7, scope: !288)
!290 = !DILocation(line: 108, column: 5, scope: !288)
!291 = !DILocation(line: 111, column: 5, scope: !262)
!292 = distinct !{!292, !272, !293}
!293 = !DILocation(line: 115, column: 3, scope: !153)
!294 = !DILocation(line: 116, column: 3, scope: !153)
!295 = distinct !DISubprogram(name: "mld6_report_groups", scope: !1, file: !1, line: 125, type: !228, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !296)
!296 = !{!297, !298}
!297 = !DILocalVariable(name: "netif", arg: 1, scope: !295, file: !1, line: 125, type: !161)
!298 = !DILocalVariable(name: "group", scope: !295, file: !1, line: 127, type: !96)
!299 = !DILocation(line: 125, column: 34, scope: !295)
!300 = !DILocation(line: 127, column: 29, scope: !295)
!301 = !DILocation(line: 127, column: 21, scope: !295)
!302 = !DILocation(line: 0, scope: !303)
!303 = distinct !DILexicalBlock(scope: !295, file: !1, line: 129, column: 25)
!304 = !DILocation(line: 129, column: 16, scope: !295)
!305 = !DILocation(line: 129, column: 3, scope: !295)
!306 = !DILocation(line: 130, column: 5, scope: !303)
!307 = !DILocation(line: 131, column: 20, scope: !303)
!308 = distinct !{!308, !305, !309}
!309 = !DILocation(line: 132, column: 3, scope: !295)
!310 = !DILocation(line: 133, column: 1, scope: !295)
