; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/module.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/module.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "modules", scope: !2, file: !3, line: 68, type: !43, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !731)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/module.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !9, !11, !94, !143, !261, !262, !173, !346, !696, !699, !708, !717, !724}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !13, line: 1306, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !18, !165, !17, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !13, line: 1307, size: 640, elements: !20)
!20 = !{!21, !22, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !13, line: 1308, baseType: !9, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !19, file: !13, line: 1309, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !13, line: 1305, baseType: !25)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !13, line: 780, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !13, line: 723, size: 135360, elements: !30)
!30 = !{!31, !36, !37, !142, !153, !156, !161, !162, !163, !164, !166, !167, !168, !169, !170, !171, !172, !174, !175, !178, !179, !180, !181, !182, !183, !184, !185, !190, !191, !192, !193, !194, !195, !196, !197, !201, !202, !206, !207, !223, !224, !241, !242, !243, !244, !245, !246, !247, !248}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !29, file: !13, line: 724, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 60, baseType: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !35, line: 105, baseType: !7)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !29, file: !13, line: 725, baseType: !17, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !29, file: !13, line: 726, baseType: !38, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !13, line: 656, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !13, line: 647, size: 512, elements: !41)
!41 = !{!42, !106, !107, !108, !109, !110, !111, !113}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !40, file: !13, line: 648, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !45, line: 82, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !45, line: 76, size: 768, elements: !47)
!47 = !{!48, !73, !74, !104, !105}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !45, line: 77, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !45, line: 65, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !45, line: 58, size: 384, elements: !52)
!52 = !{!53, !59, !63, !64, !68, !72}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !51, file: !45, line: 59, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!32, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !51, file: !45, line: 60, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!6, !6, !57}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !51, file: !45, line: 61, baseType: !60, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !51, file: !45, line: 62, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!17, !6, !57, !57}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !51, file: !45, line: 63, baseType: !69, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !6, !6}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !51, file: !45, line: 64, baseType: !69, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !46, file: !45, line: 78, baseType: !6, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !46, file: !45, line: 79, baseType: !75, size: 512, offset: 128)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !102)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !45, line: 74, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !45, line: 69, size: 256, elements: !78)
!78 = !{!79, !99, !100, !101}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !77, file: !45, line: 70, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !45, line: 56, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !45, line: 47, size: 192, elements: !84)
!84 = !{!85, !86, !97}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !83, file: !45, line: 48, baseType: !6, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !83, file: !45, line: 54, baseType: !87, size: 64, offset: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !45, line: 49, size: 64, elements: !88)
!88 = !{!89, !90, !91, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !87, file: !45, line: 50, baseType: !6, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !87, file: !45, line: 51, baseType: !32, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !87, file: !45, line: 52, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !33, line: 56, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !35, line: 103, baseType: !94)
!94 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !87, file: !45, line: 53, baseType: !96, size: 64)
!96 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !45, line: 55, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !77, file: !45, line: 71, baseType: !7, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !77, file: !45, line: 72, baseType: !7, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !77, file: !45, line: 73, baseType: !7, size: 64, offset: 192)
!102 = !{!103}
!103 = !DISubrange(count: 2)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !46, file: !45, line: 80, baseType: !94, size: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !46, file: !45, line: 81, baseType: !7, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !40, file: !13, line: 649, baseType: !43, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !40, file: !13, line: 650, baseType: !43, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !40, file: !13, line: 651, baseType: !43, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !40, file: !13, line: 652, baseType: !43, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !13, line: 653, baseType: !17, size: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !40, file: !13, line: 654, baseType: !112, size: 64, offset: 384)
!112 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !40, file: !13, line: 655, baseType: !114, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !116, line: 54, baseType: !117)
!116 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !116, line: 47, size: 384, elements: !118)
!118 = !{!119, !128, !129, !133, !137, !141}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !117, file: !116, line: 48, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !116, line: 40, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !116, line: 36, size: 192, elements: !123)
!123 = !{!124, !126, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !116, line: 37, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !116, line: 38, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !122, file: !116, line: 39, baseType: !6, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !117, file: !116, line: 49, baseType: !120, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !117, file: !116, line: 50, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!6, !6}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !117, file: !116, line: 51, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !6}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !117, file: !116, line: 52, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!17, !6, !6}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !117, file: !116, line: 53, baseType: !7, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !13, line: 727, baseType: !143, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !13, line: 622, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !13, line: 614, size: 128, elements: !146)
!146 = !{!147, !149, !150, !151, !152}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !13, line: 615, baseType: !148, size: 4, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !145, file: !13, line: 616, baseType: !148, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !145, file: !13, line: 617, baseType: !148, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !145, file: !13, line: 620, baseType: !17, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !145, file: !13, line: 621, baseType: !6, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !29, file: !13, line: 728, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !155, line: 43, baseType: !9)
!155 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !29, file: !13, line: 729, baseType: !157, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 40, baseType: !159)
!158 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !160, line: 129, baseType: !7)
!160 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !29, file: !13, line: 730, baseType: !154, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !29, file: !13, line: 734, baseType: !157, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !29, file: !13, line: 735, baseType: !17, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !29, file: !13, line: 736, baseType: !165, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !29, file: !13, line: 737, baseType: !18, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !29, file: !13, line: 737, baseType: !18, size: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !29, file: !13, line: 738, baseType: !17, size: 32, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !29, file: !13, line: 739, baseType: !17, size: 32, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !29, file: !13, line: 740, baseType: !94, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !29, file: !13, line: 741, baseType: !114, size: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !29, file: !13, line: 742, baseType: !173, size: 64, offset: 960)
!173 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !29, file: !13, line: 743, baseType: !157, size: 64, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !29, file: !13, line: 745, baseType: !176, size: 64, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !177, line: 34, baseType: !94)
!177 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !29, file: !13, line: 746, baseType: !176, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !29, file: !13, line: 747, baseType: !176, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !13, line: 748, baseType: !17, size: 32, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !29, file: !13, line: 749, baseType: !17, size: 32, offset: 1312)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !29, file: !13, line: 750, baseType: !17, size: 32, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !29, file: !13, line: 751, baseType: !17, size: 32, offset: 1376)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !29, file: !13, line: 752, baseType: !17, size: 32, offset: 1408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !29, file: !13, line: 753, baseType: !186, size: 64, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !187, line: 173, baseType: !188)
!187 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !160, line: 100, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 44, baseType: !94)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !29, file: !13, line: 754, baseType: !186, size: 64, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !29, file: !13, line: 755, baseType: !154, size: 64, offset: 1600)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !29, file: !13, line: 756, baseType: !112, size: 64, offset: 1664)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !29, file: !13, line: 757, baseType: !112, size: 64, offset: 1728)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !29, file: !13, line: 758, baseType: !112, size: 64, offset: 1792)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !29, file: !13, line: 759, baseType: !112, size: 64, offset: 1856)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !29, file: !13, line: 760, baseType: !112, size: 64, offset: 1920)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !29, file: !13, line: 763, baseType: !198, size: 328, offset: 1984)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 328, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 41)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !29, file: !13, line: 764, baseType: !17, size: 32, offset: 2336)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !29, file: !13, line: 765, baseType: !203, size: 368, offset: 2368)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 368, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 46)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !29, file: !13, line: 766, baseType: !17, size: 32, offset: 2752)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !29, file: !13, line: 767, baseType: !208, size: 256, offset: 2816)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !13, line: 673, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !13, line: 665, size: 256, elements: !210)
!210 = !{!211, !219, !220, !221, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !209, file: !13, line: 666, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !13, line: 663, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !13, line: 659, size: 192, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !214, file: !13, line: 660, baseType: !165, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !214, file: !13, line: 661, baseType: !17, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !214, file: !13, line: 662, baseType: !18, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !209, file: !13, line: 667, baseType: !17, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !209, file: !13, line: 668, baseType: !17, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !209, file: !13, line: 671, baseType: !17, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !209, file: !13, line: 672, baseType: !176, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !29, file: !13, line: 768, baseType: !17, size: 32, offset: 3072)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !29, file: !13, line: 769, baseType: !225, size: 704, offset: 3136)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !13, line: 703, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !13, line: 677, size: 704, elements: !227)
!227 = !{!228, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !226, file: !13, line: 679, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !13, line: 52, baseType: !112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !226, file: !13, line: 683, baseType: !43, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !226, file: !13, line: 685, baseType: !143, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !226, file: !13, line: 689, baseType: !157, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !226, file: !13, line: 690, baseType: !143, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !226, file: !13, line: 691, baseType: !143, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !226, file: !13, line: 692, baseType: !229, size: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !226, file: !13, line: 692, baseType: !229, size: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !226, file: !13, line: 693, baseType: !17, size: 32, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !226, file: !13, line: 696, baseType: !17, size: 32, offset: 544)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !226, file: !13, line: 697, baseType: !112, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !226, file: !13, line: 700, baseType: !6, size: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !29, file: !13, line: 770, baseType: !112, size: 64, offset: 3840)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !29, file: !13, line: 771, baseType: !114, size: 64, offset: 3904)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !29, file: !13, line: 772, baseType: !43, size: 64, offset: 3968)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !29, file: !13, line: 773, baseType: !114, size: 64, offset: 4032)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !29, file: !13, line: 774, baseType: !154, size: 64, offset: 4096)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !29, file: !13, line: 775, baseType: !120, size: 64, offset: 4160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !29, file: !13, line: 778, baseType: !17, size: 32, offset: 4224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !29, file: !13, line: 779, baseType: !249, size: 131072, offset: 4256)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 131072, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 16384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !19, file: !13, line: 1310, baseType: !17, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !19, file: !13, line: 1311, baseType: !9, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !13, line: 1312, baseType: !17, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !19, file: !13, line: 1315, baseType: !11, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !19, file: !13, line: 1317, baseType: !17, size: 32, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !19, file: !13, line: 1318, baseType: !17, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !19, file: !13, line: 1319, baseType: !17, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !19, file: !13, line: 1320, baseType: !112, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !19, file: !13, line: 1320, baseType: !112, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "typemethods", scope: !264, file: !3, line: 3072, size: 640, elements: !682)
!264 = distinct !DISubprogram(name: "RM_CreateDataType", scope: !3, file: !3, line: 3064, type: !265, isLocal: false, isDefinition: true, scopeLine: 3064, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !673)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !584, !523, !17, !6}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleType", file: !13, line: 530, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleType", file: !13, line: 517, size: 768, elements: !270)
!270 = !{!271, !272, !285, !628, !633, !638, !643, !656, !658, !663, !668, !669}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !13, line: 518, baseType: !32, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !269, file: !13, line: 519, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModule", file: !3, line: 45, size: 512, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !274, file: !3, line: 46, baseType: !6, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !3, line: 47, baseType: !9, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !274, file: !3, line: 48, baseType: !17, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "apiver", scope: !274, file: !3, line: 49, baseType: !17, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !274, file: !3, line: 50, baseType: !114, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "usedby", scope: !274, file: !3, line: 51, baseType: !114, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "using", scope: !274, file: !3, line: 52, baseType: !114, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !274, file: !3, line: 53, baseType: !114, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "in_call", scope: !274, file: !3, line: 54, baseType: !17, size: 32, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !269, file: !13, line: 520, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeLoadFunc", file: !13, line: 506, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!6, !290, !17}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleIO", file: !13, line: 555, size: 384, elements: !292)
!292 = !{!293, !294, !561, !562, !563, !564, !626}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !291, file: !13, line: 556, baseType: !157, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !291, file: !13, line: 557, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !297, line: 87, baseType: !298)
!297 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !297, line: 39, size: 832, elements: !299)
!299 = !{!300, !307, !311, !315, !319, !323, !324, !325, !326}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !298, file: !297, line: 43, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !306, !6, !304}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !305, line: 58, baseType: !7)
!305 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !298, file: !297, line: 44, baseType: !308, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!304, !306, !57, !304}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !298, file: !297, line: 45, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!186, !306}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !298, file: !297, line: 46, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!17, !306}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !298, file: !297, line: 52, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !306, !57, !304}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !298, file: !297, line: 55, baseType: !32, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !298, file: !297, line: 58, baseType: !304, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !298, file: !297, line: 61, baseType: !304, size: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !298, file: !297, line: 84, baseType: !327, size: 320, offset: 512)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !297, line: 64, size: 320, elements: !328)
!328 = !{!329, !334, !553}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !327, file: !297, line: 69, baseType: !330, size: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !297, line: 66, size: 128, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !330, file: !297, line: 67, baseType: !154, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !330, file: !297, line: 68, baseType: !186, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !327, file: !297, line: 75, baseType: !335, size: 192)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !297, line: 71, size: 192, elements: !336)
!336 = !{!337, !551, !552}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !335, file: !297, line: 72, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !340, line: 66, baseType: !341)
!340 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !342, line: 287, baseType: !343)
!342 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !342, line: 181, size: 1408, elements: !344)
!344 = !{!345, !348, !349, !350, !352, !353, !358, !359, !360, !519, !525, !530, !534, !535, !536, !537, !539, !541, !542, !543, !544, !545, !549, !550}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !343, file: !342, line: 182, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !343, file: !342, line: 183, baseType: !17, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !343, file: !342, line: 184, baseType: !17, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !343, file: !342, line: 185, baseType: !351, size: 16, offset: 128)
!351 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !343, file: !342, line: 186, baseType: !351, size: 16, offset: 144)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !343, file: !342, line: 187, baseType: !354, size: 128, offset: 192)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !342, line: 117, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !354, file: !342, line: 118, baseType: !346, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !354, file: !342, line: 119, baseType: !17, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !343, file: !342, line: 188, baseType: !17, size: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !343, file: !342, line: 195, baseType: !6, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !343, file: !342, line: 197, baseType: !361, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!364, !365, !6, !9, !17}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !160, line: 145, baseType: !94)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !342, line: 569, size: 14912, elements: !367)
!367 = !{!368, !369, !371, !372, !373, !374, !378, !379, !382, !383, !387, !401, !402, !403, !405, !406, !407, !483, !504, !505, !510, !517}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !366, file: !342, line: 571, baseType: !17, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !366, file: !342, line: 576, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !366, file: !342, line: 576, baseType: !370, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !366, file: !342, line: 576, baseType: !370, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !366, file: !342, line: 578, baseType: !17, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !366, file: !342, line: 579, baseType: !375, size: 200, offset: 288)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 200, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 25)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !366, file: !342, line: 582, baseType: !17, size: 32, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !366, file: !342, line: 583, baseType: !380, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !342, line: 40, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !366, file: !342, line: 585, baseType: !17, size: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !366, file: !342, line: 587, baseType: !384, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !365}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !366, file: !342, line: 590, baseType: !388, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !342, line: 47, size: 256, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !389, file: !342, line: 49, baseType: !388, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !389, file: !342, line: 50, baseType: !17, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !389, file: !342, line: 50, baseType: !17, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !389, file: !342, line: 50, baseType: !17, size: 32, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !389, file: !342, line: 50, baseType: !17, size: 32, offset: 160)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !389, file: !342, line: 51, baseType: !397, size: 32, offset: 192)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 32, elements: !399)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !342, line: 25, baseType: !148)
!399 = !{!400}
!400 = !DISubrange(count: 1)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !366, file: !342, line: 591, baseType: !17, size: 32, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !366, file: !342, line: 592, baseType: !388, size: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !366, file: !342, line: 593, baseType: !404, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !366, file: !342, line: 596, baseType: !17, size: 32, offset: 1024)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !366, file: !342, line: 597, baseType: !9, size: 64, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !366, file: !342, line: 632, baseType: !408, size: 2880, offset: 1152)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !342, line: 599, size: 2880, elements: !409)
!409 = !{!410, !474}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !408, file: !342, line: 622, baseType: !411, size: 1728)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !342, line: 601, size: 1728, elements: !412)
!412 = !{!413, !414, !415, !419, !431, !432, !433, !443, !457, !458, !459, !463, !467, !468, !469, !470, !471, !472, !473}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !411, file: !342, line: 603, baseType: !148, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !411, file: !342, line: 604, baseType: !9, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !411, file: !342, line: 605, baseType: !416, size: 208, offset: 128)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 208, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 26)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !411, file: !342, line: 606, baseType: !420, size: 288, offset: 352)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !342, line: 55, size: 288, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !420, file: !342, line: 57, baseType: !17, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !420, file: !342, line: 58, baseType: !17, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !420, file: !342, line: 59, baseType: !17, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !420, file: !342, line: 60, baseType: !17, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !420, file: !342, line: 61, baseType: !17, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !420, file: !342, line: 62, baseType: !17, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !420, file: !342, line: 63, baseType: !17, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !420, file: !342, line: 64, baseType: !17, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !420, file: !342, line: 65, baseType: !17, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !411, file: !342, line: 607, baseType: !17, size: 32, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !411, file: !342, line: 608, baseType: !173, size: 64, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !411, file: !342, line: 609, baseType: !434, size: 112, offset: 768)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !342, line: 319, size: 112, elements: !435)
!435 = !{!436, !441, !442}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !434, file: !342, line: 320, baseType: !437, size: 48)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 48, elements: !439)
!438 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!439 = !{!440}
!440 = !DISubrange(count: 3)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !434, file: !342, line: 321, baseType: !437, size: 48, offset: 48)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !434, file: !342, line: 322, baseType: !438, size: 16, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !411, file: !342, line: 610, baseType: !444, size: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 171, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 163, size: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !445, file: !160, line: 165, baseType: !17, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !445, file: !160, line: 170, baseType: !449, size: 32, offset: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !445, file: !160, line: 166, size: 32, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !449, file: !160, line: 168, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !305, line: 124, baseType: !148)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !449, file: !160, line: 169, baseType: !454, size: 32)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 32, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 4)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !411, file: !342, line: 611, baseType: !444, size: 64, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !411, file: !342, line: 612, baseType: !444, size: 64, offset: 1024)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !411, file: !342, line: 613, baseType: !460, size: 64, offset: 1088)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !411, file: !342, line: 614, baseType: !464, size: 192, offset: 1152)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 24)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !411, file: !342, line: 615, baseType: !17, size: 32, offset: 1344)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !411, file: !342, line: 616, baseType: !444, size: 64, offset: 1376)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !411, file: !342, line: 617, baseType: !444, size: 64, offset: 1440)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !411, file: !342, line: 618, baseType: !444, size: 64, offset: 1504)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !411, file: !342, line: 619, baseType: !444, size: 64, offset: 1568)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !411, file: !342, line: 620, baseType: !444, size: 64, offset: 1632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !411, file: !342, line: 621, baseType: !17, size: 32, offset: 1696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !408, file: !342, line: 631, baseType: !475, size: 2880)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !342, line: 626, size: 2880, elements: !476)
!476 = !{!477, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !475, file: !342, line: 629, baseType: !478, size: 1920)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 1920, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 30)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !475, file: !342, line: 630, baseType: !482, size: 960, offset: 1920)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 960, elements: !479)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !366, file: !342, line: 636, baseType: !484, size: 64, offset: 4032)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !342, line: 93, size: 6336, elements: !486)
!486 = !{!487, !488, !489, !496}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !485, file: !342, line: 94, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !485, file: !342, line: 95, baseType: !17, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !485, file: !342, line: 97, baseType: !490, size: 2048, offset: 128)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 2048, elements: !494)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null}
!494 = !{!495}
!495 = !DISubrange(count: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !485, file: !342, line: 98, baseType: !497, size: 4160, offset: 2176)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !342, line: 74, size: 4160, elements: !498)
!498 = !{!499, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !497, file: !342, line: 75, baseType: !500, size: 2048)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2048, elements: !494)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !497, file: !342, line: 76, baseType: !500, size: 2048, offset: 2048)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !497, file: !342, line: 78, baseType: !398, size: 32, offset: 4096)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !497, file: !342, line: 81, baseType: !398, size: 32, offset: 4128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !366, file: !342, line: 637, baseType: !485, size: 6336, offset: 4096)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !366, file: !342, line: 641, baseType: !506, size: 64, offset: 10432)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !17}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !366, file: !342, line: 646, baseType: !511, size: 192, offset: 10496)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !342, line: 291, size: 192, elements: !512)
!512 = !{!513, !515, !516}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !511, file: !342, line: 293, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !511, file: !342, line: 294, baseType: !17, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !511, file: !342, line: 295, baseType: !370, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !366, file: !342, line: 648, baseType: !518, size: 4224, offset: 10688)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 4224, elements: !439)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !343, file: !342, line: 199, baseType: !520, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!364, !365, !6, !523, !17}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !343, file: !342, line: 202, baseType: !526, size: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !365, !6, !529, !17}
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 114, baseType: !94)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !343, file: !342, line: 203, baseType: !531, size: 64, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!17, !365, !6}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !343, file: !342, line: 206, baseType: !354, size: 128, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !343, file: !342, line: 207, baseType: !346, size: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !343, file: !342, line: 208, baseType: !17, size: 32, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !343, file: !342, line: 211, baseType: !538, size: 24, offset: 928)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 24, elements: !439)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !343, file: !342, line: 212, baseType: !540, size: 8, offset: 952)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 8, elements: !399)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !343, file: !342, line: 215, baseType: !354, size: 128, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !343, file: !342, line: 218, baseType: !17, size: 32, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !343, file: !342, line: 219, baseType: !189, size: 64, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !343, file: !342, line: 222, baseType: !365, size: 64, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !343, file: !342, line: 226, baseType: !546, size: 32, offset: 1280)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !160, line: 175, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !548, line: 12, baseType: !17)
!548 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !343, file: !342, line: 228, baseType: !444, size: 64, offset: 1312)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !343, file: !342, line: 229, baseType: !17, size: 32, offset: 1376)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !335, file: !297, line: 73, baseType: !186, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "autosync", scope: !335, file: !297, line: 74, baseType: !186, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fdset", scope: !327, file: !297, line: 83, baseType: !554, size: 320)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !297, line: 77, size: 320, elements: !555)
!555 = !{!556, !557, !558, !559, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !554, file: !297, line: 78, baseType: !16, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !554, file: !297, line: 79, baseType: !16, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "numfds", scope: !554, file: !297, line: 80, baseType: !17, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !554, file: !297, line: 81, baseType: !186, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !554, file: !297, line: 82, baseType: !154, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !13, line: 558, baseType: !267, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !291, file: !13, line: 559, baseType: !17, size: 32, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !291, file: !13, line: 560, baseType: !17, size: 32, offset: 224)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !291, file: !13, line: 562, baseType: !565, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleCtx", file: !3, line: 117, size: 832, elements: !567)
!567 = !{!568, !569, !570, !571, !599, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "getapifuncptr", scope: !566, file: !3, line: 118, baseType: !6, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !566, file: !3, line: 119, baseType: !273, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !566, file: !3, line: 120, baseType: !27, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "blocked_client", scope: !566, file: !3, line: 121, baseType: !572, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleBlockedClient", file: !3, line: 216, size: 576, elements: !574)
!574 = !{!575, !576, !579, !586, !587, !592, !596, !597, !598}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !573, file: !3, line: 217, baseType: !27, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !573, file: !3, line: 219, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModule", file: !3, line: 56, baseType: !274)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reply_callback", scope: !573, file: !3, line: 220, baseType: !580, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleCmdFunc", file: !3, line: 178, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!17, !584, !8, !17}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleCtx", file: !3, line: 137, baseType: !566)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_callback", scope: !573, file: !3, line: 221, baseType: !580, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect_callback", scope: !573, file: !3, line: 222, baseType: !588, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleDisconnectFunc", file: !3, line: 179, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !584, !572}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "free_privdata", scope: !573, file: !3, line: 223, baseType: !593, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !584, !6}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !573, file: !3, line: 224, baseType: !6, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reply_client", scope: !573, file: !3, line: 227, baseType: !27, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dbid", scope: !573, file: !3, line: 229, baseType: !17, size: 32, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "amqueue", scope: !566, file: !3, line: 123, baseType: !600, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AutoMemEntry", file: !3, line: 72, size: 128, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !601, file: !3, line: 73, baseType: !6, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !3, line: 74, baseType: !17, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "amqueue_len", scope: !566, file: !3, line: 124, baseType: !17, size: 32, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "amqueue_used", scope: !566, file: !3, line: 125, baseType: !17, size: 32, offset: 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !566, file: !3, line: 126, baseType: !17, size: 32, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "postponed_arrays", scope: !566, file: !3, line: 127, baseType: !8, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "postponed_arrays_count", scope: !566, file: !3, line: 128, baseType: !17, size: 32, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "blocked_privdata", scope: !566, file: !3, line: 129, baseType: !6, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "keys_pos", scope: !566, file: !3, line: 132, baseType: !16, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "keys_count", scope: !566, file: !3, line: 133, baseType: !17, size: 32, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pa_head", scope: !566, file: !3, line: 135, baseType: !614, size: 64, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModulePoolAllocBlock", file: !3, line: 100, size: 128, elements: !616)
!616 = !{!617, !620, !621, !622}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !615, file: !3, line: 101, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 48, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !35, line: 79, baseType: !148)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !615, file: !3, line: 102, baseType: !618, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !615, file: !3, line: 103, baseType: !614, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !615, file: !3, line: 104, baseType: !623, offset: 128)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: -1)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !291, file: !13, line: 563, baseType: !627, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save", scope: !269, file: !13, line: 521, baseType: !629, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeSaveFunc", file: !13, line: 507, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !290, !6}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite", scope: !269, file: !13, line: 522, baseType: !634, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeRewriteFunc", file: !13, line: 510, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !290, !627, !6}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mem_usage", scope: !269, file: !13, line: 523, baseType: !639, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeMemUsageFunc", file: !13, line: 512, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!157, !57}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !269, file: !13, line: 524, baseType: !644, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeDigestFunc", file: !13, line: 511, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !648, !6}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleDigest", file: !13, line: 583, size: 320, elements: !650)
!650 = !{!651, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !649, file: !13, line: 584, baseType: !652, size: 160)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 160, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 20)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !649, file: !13, line: 585, baseType: !652, size: 160, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !269, file: !13, line: 525, baseType: !657, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeFreeFunc", file: !13, line: 513, baseType: !134)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "aux_load", scope: !269, file: !13, line: 526, baseType: !659, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeAuxLoadFunc", file: !13, line: 508, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!17, !290, !17, !17}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save", scope: !269, file: !13, line: 527, baseType: !664, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeAuxSaveFunc", file: !13, line: 509, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !290, !17}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save_triggers", scope: !269, file: !13, line: 528, baseType: !17, size: 32, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !13, line: 529, baseType: !670, size: 80, offset: 672)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 80, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 10)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681}
!674 = !DILocalVariable(name: "ctx", arg: 1, scope: !264, file: !3, line: 3064, type: !584)
!675 = !DILocalVariable(name: "name", arg: 2, scope: !264, file: !3, line: 3064, type: !523)
!676 = !DILocalVariable(name: "encver", arg: 3, scope: !264, file: !3, line: 3064, type: !17)
!677 = !DILocalVariable(name: "typemethods_ptr", arg: 4, scope: !264, file: !3, line: 3064, type: !6)
!678 = !DILocalVariable(name: "id", scope: !264, file: !3, line: 3065, type: !32)
!679 = !DILocalVariable(name: "typemethods_version", scope: !264, file: !3, line: 3069, type: !94)
!680 = !DILocalVariable(name: "tms", scope: !264, file: !3, line: 3085, type: !262)
!681 = !DILocalVariable(name: "mt", scope: !264, file: !3, line: 3087, type: !267)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !263, file: !3, line: 3073, baseType: !32, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !263, file: !3, line: 3074, baseType: !286, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save", scope: !263, file: !3, line: 3075, baseType: !629, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite", scope: !263, file: !3, line: 3076, baseType: !634, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mem_usage", scope: !263, file: !3, line: 3077, baseType: !639, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !263, file: !3, line: 3078, baseType: !644, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !263, file: !3, line: 3079, baseType: !657, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !263, file: !3, line: 3084, baseType: !691, size: 192, offset: 448)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !3, line: 3080, size: 192, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "aux_load", scope: !691, file: !3, line: 3081, baseType: !659, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save", scope: !691, file: !3, line: 3082, baseType: !664, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save_triggers", scope: !691, file: !3, line: 3083, baseType: !17, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!17, !6, !8, !17}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !155, line: 51, size: 24, elements: !701)
!701 = !{!702, !705, !706, !707}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !700, file: !155, line: 52, baseType: !703, size: 8)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 24, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !35, line: 43, baseType: !347)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !700, file: !155, line: 53, baseType: !703, size: 8, offset: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !700, file: !155, line: 54, baseType: !347, size: 8, offset: 16)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !700, file: !155, line: 55, baseType: !623, offset: 24)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !155, line: 57, size: 40, elements: !710)
!710 = !{!711, !714, !715, !716}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !709, file: !155, line: 58, baseType: !712, size: 16)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !33, line: 36, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !35, line: 57, baseType: !438)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !709, file: !155, line: 59, baseType: !712, size: 16, offset: 16)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !709, file: !155, line: 60, baseType: !347, size: 8, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !709, file: !155, line: 61, baseType: !623, offset: 40)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !155, line: 63, size: 72, elements: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !718, file: !155, line: 64, baseType: !618, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !718, file: !155, line: 65, baseType: !618, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !718, file: !155, line: 66, baseType: !347, size: 8, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !718, file: !155, line: 67, baseType: !623, offset: 72)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !155, line: 69, size: 136, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !725, file: !155, line: 70, baseType: !32, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !725, file: !155, line: 71, baseType: !32, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !155, line: 72, baseType: !347, size: 8, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !725, file: !155, line: 73, baseType: !623, offset: 136)
!731 = !{!732, !734, !772, !774, !0, !776, !778, !780, !782, !784, !804, !824, !830}
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "ModuleTypeNameCharSet", scope: !2, file: !3, line: 2889, type: !523, isLocal: false, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "cache", scope: !736, file: !3, line: 2946, type: !767, isLocal: true, isDefinition: true)
!736 = distinct !DISubprogram(name: "moduleTypeLookupModuleByID", scope: !3, file: !3, line: 2942, type: !737, isLocal: false, isDefinition: true, scopeLine: 2942, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{!267, !32}
!739 = !{!740, !741, !742, !743, !755, !756, !758, !764, !765}
!740 = !DILocalVariable(name: "id", arg: 1, scope: !736, file: !3, line: 2942, type: !32)
!741 = !DILocalVariable(name: "j", scope: !736, file: !3, line: 2949, type: !17)
!742 = !DILocalVariable(name: "mt", scope: !736, file: !3, line: 2954, type: !267)
!743 = !DILocalVariable(name: "di", scope: !736, file: !3, line: 2955, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !45, line: 95, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !45, line: 88, size: 384, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !746, file: !45, line: 89, baseType: !43, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !746, file: !45, line: 90, baseType: !94, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !746, file: !45, line: 91, baseType: !17, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !746, file: !45, line: 91, baseType: !17, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !746, file: !45, line: 92, baseType: !81, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !746, file: !45, line: 92, baseType: !81, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !746, file: !45, line: 94, baseType: !112, size: 64, offset: 320)
!755 = !DILocalVariable(name: "de", scope: !736, file: !3, line: 2956, type: !81)
!756 = !DILocalVariable(name: "module", scope: !757, file: !3, line: 2959, type: !273)
!757 = distinct !DILexicalBlock(scope: !736, file: !3, line: 2958, column: 55)
!758 = !DILocalVariable(name: "li", scope: !757, file: !3, line: 2960, type: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !116, line: 45, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !116, line: 42, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !116, line: 43, baseType: !120, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !760, file: !116, line: 44, baseType: !17, size: 32, offset: 64)
!764 = !DILocalVariable(name: "ln", scope: !757, file: !3, line: 2961, type: !120)
!765 = !DILocalVariable(name: "this_mt", scope: !766, file: !3, line: 2965, type: !267)
!766 = distinct !DILexicalBlock(scope: !757, file: !3, line: 2964, column: 37)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 384, elements: !439)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !3, line: 2943, size: 128, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !768, file: !3, line: 2944, baseType: !32, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !768, file: !3, line: 2945, baseType: !267, size: 64, offset: 64)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "aeTimer", scope: !2, file: !3, line: 4346, type: !112, isLocal: false, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "moduleAPIDictType", scope: !2, file: !3, line: 5088, type: !50, isLocal: false, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "moduleUnblockedClients", scope: !2, file: !3, line: 233, type: !114, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "moduleKeyspaceSubscribers", scope: !2, file: !3, line: 258, type: !114, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "moduleFreeContextReusedClient", scope: !2, file: !3, line: 264, type: !27, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "moduleCommandFilters", scope: !2, file: !3, line: 293, type: !114, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "clusterReceivers", scope: !2, file: !3, line: 4099, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 16320, elements: !802)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleClusterReceiver", file: !3, line: 4088, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "moduleClusterReceiver", file: !3, line: 4083, size: 256, elements: !790)
!790 = !{!791, !792, !799, !800}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "module_id", scope: !789, file: !3, line: 4084, baseType: !32, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !789, file: !3, line: 4085, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleClusterMessageReceiver", file: !3, line: 4078, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !584, !523, !703, !797, !618}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !789, file: !3, line: 4086, baseType: !273, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !3, line: 4087, baseType: !801, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!802 = !{!803}
!803 = !DISubrange(count: 255)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "Timers", scope: !2, file: !3, line: 4345, type: !806, isLocal: true, isDefinition: true)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !808, line: 137, baseType: !809)
!808 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !808, line: 133, size: 192, elements: !810)
!810 = !{!811, !822, !823}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !809, file: !808, line: 134, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !808, line: 131, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !808, line: 98, size: 32, elements: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !814, file: !808, line: 99, baseType: !618, size: 1, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !814, file: !808, line: 100, baseType: !618, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !814, file: !808, line: 101, baseType: !618, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !808, line: 102, baseType: !618, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !814, file: !808, line: 130, baseType: !821, offset: 32)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, elements: !624)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !809, file: !808, line: 135, baseType: !32, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !809, file: !808, line: 136, baseType: !32, size: 64, offset: 128)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "moduleUnblockedClientsMutex", scope: !2, file: !3, line: 232, type: !826, isLocal: true, isDefinition: true)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !827, line: 417, baseType: !828)
!827 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !827, line: 417, flags: DIFlagFwdDecl)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "moduleGIL", scope: !2, file: !3, line: 237, type: !826, isLocal: true, isDefinition: true)
!832 = !{i32 2, !"Dwarf Version", i32 4}
!833 = !{i32 2, !"Debug Info Version", i32 3}
!834 = !{i32 1, !"wchar_size", i32 4}
!835 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!836 = distinct !DISubprogram(name: "RM_Alloc", scope: !3, file: !3, line: 316, type: !837, isLocal: false, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!6, !157}
!839 = !{!840}
!840 = !DILocalVariable(name: "bytes", arg: 1, scope: !836, file: !3, line: 316, type: !157)
!841 = !DILocation(line: 316, column: 23, scope: !836)
!842 = !DILocation(line: 317, column: 12, scope: !836)
!843 = !DILocation(line: 317, column: 5, scope: !836)
!844 = distinct !DISubprogram(name: "RM_Calloc", scope: !3, file: !3, line: 324, type: !845, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{!6, !157, !157}
!847 = !{!848, !849}
!848 = !DILocalVariable(name: "nmemb", arg: 1, scope: !844, file: !3, line: 324, type: !157)
!849 = !DILocalVariable(name: "size", arg: 2, scope: !844, file: !3, line: 324, type: !157)
!850 = !DILocation(line: 324, column: 24, scope: !844)
!851 = !DILocation(line: 324, column: 38, scope: !844)
!852 = !DILocation(line: 325, column: 25, scope: !844)
!853 = !DILocation(line: 325, column: 12, scope: !844)
!854 = !DILocation(line: 325, column: 5, scope: !844)
!855 = distinct !DISubprogram(name: "RM_Realloc", scope: !3, file: !3, line: 329, type: !856, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!6, !6, !157}
!858 = !{!859, !860}
!859 = !DILocalVariable(name: "ptr", arg: 1, scope: !855, file: !3, line: 329, type: !6)
!860 = !DILocalVariable(name: "bytes", arg: 2, scope: !855, file: !3, line: 329, type: !157)
!861 = !DILocation(line: 329, column: 24, scope: !855)
!862 = !DILocation(line: 329, column: 36, scope: !855)
!863 = !DILocation(line: 330, column: 12, scope: !855)
!864 = !DILocation(line: 330, column: 5, scope: !855)
!865 = distinct !DISubprogram(name: "RM_Free", scope: !3, file: !3, line: 336, type: !135, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !866)
!866 = !{!867}
!867 = !DILocalVariable(name: "ptr", arg: 1, scope: !865, file: !3, line: 336, type: !6)
!868 = !DILocation(line: 336, column: 20, scope: !865)
!869 = !DILocation(line: 337, column: 5, scope: !865)
!870 = !DILocation(line: 338, column: 1, scope: !865)
!871 = distinct !DISubprogram(name: "RM_Strdup", scope: !3, file: !3, line: 341, type: !872, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !874)
!872 = !DISubroutineType(types: !873)
!873 = !{!9, !523}
!874 = !{!875}
!875 = !DILocalVariable(name: "str", arg: 1, scope: !871, file: !3, line: 341, type: !523)
!876 = !DILocation(line: 341, column: 29, scope: !871)
!877 = !DILocation(line: 342, column: 12, scope: !871)
!878 = !DILocation(line: 342, column: 5, scope: !871)
!879 = distinct !DISubprogram(name: "poolAllocRelease", scope: !3, file: !3, line: 350, type: !880, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !584}
!882 = !{!883, !884, !887}
!883 = !DILocalVariable(name: "ctx", arg: 1, scope: !879, file: !3, line: 350, type: !584)
!884 = !DILocalVariable(name: "head", scope: !879, file: !3, line: 351, type: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModulePoolAllocBlock", file: !3, line: 105, baseType: !615)
!887 = !DILocalVariable(name: "next", scope: !879, file: !3, line: 351, type: !885)
!888 = !DILocation(line: 350, column: 39, scope: !879)
!889 = !DILocation(line: 351, column: 44, scope: !879)
!890 = !{!891, !892, i64 96}
!891 = !{!"RedisModuleCtx", !892, i64 0, !892, i64 8, !892, i64 16, !892, i64 24, !892, i64 32, !895, i64 40, !895, i64 44, !895, i64 48, !892, i64 56, !895, i64 64, !892, i64 72, !892, i64 80, !895, i64 88, !892, i64 96}
!892 = !{!"any pointer", !893, i64 0}
!893 = !{!"omnipotent char", !894, i64 0}
!894 = !{!"Simple C/C++ TBAA"}
!895 = !{!"int", !893, i64 0}
!896 = !DILocation(line: 351, column: 32, scope: !879)
!897 = !DILocation(line: 353, column: 16, scope: !879)
!898 = !DILocation(line: 353, column: 5, scope: !879)
!899 = !DILocation(line: 0, scope: !879)
!900 = !DILocation(line: 354, column: 22, scope: !901)
!901 = distinct !DILexicalBlock(scope: !879, file: !3, line: 353, column: 25)
!902 = !{!892, !892, i64 0}
!903 = !DILocation(line: 351, column: 54, scope: !879)
!904 = !DILocation(line: 355, column: 9, scope: !901)
!905 = distinct !{!905, !898, !906}
!906 = !DILocation(line: 357, column: 5, scope: !879)
!907 = !DILocation(line: 358, column: 18, scope: !879)
!908 = !DILocation(line: 359, column: 1, scope: !879)
!909 = distinct !DISubprogram(name: "RM_PoolAlloc", scope: !3, file: !3, line: 373, type: !910, isLocal: false, isDefinition: true, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!6, !584, !157}
!912 = !{!913, !914, !915, !916, !917, !920, !923}
!913 = !DILocalVariable(name: "ctx", arg: 1, scope: !909, file: !3, line: 373, type: !584)
!914 = !DILocalVariable(name: "bytes", arg: 2, scope: !909, file: !3, line: 373, type: !157)
!915 = !DILocalVariable(name: "b", scope: !909, file: !3, line: 375, type: !885)
!916 = !DILocalVariable(name: "left", scope: !909, file: !3, line: 376, type: !157)
!917 = !DILocalVariable(name: "alignment", scope: !918, file: !3, line: 380, type: !157)
!918 = distinct !DILexicalBlock(scope: !919, file: !3, line: 379, column: 24)
!919 = distinct !DILexicalBlock(scope: !909, file: !3, line: 379, column: 9)
!920 = !DILocalVariable(name: "blocksize", scope: !921, file: !3, line: 389, type: !157)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 388, column: 23)
!922 = distinct !DILexicalBlock(scope: !909, file: !3, line: 388, column: 9)
!923 = !DILocalVariable(name: "retval", scope: !909, file: !3, line: 398, type: !9)
!924 = !DILocation(line: 373, column: 36, scope: !909)
!925 = !DILocation(line: 373, column: 48, scope: !909)
!926 = !DILocation(line: 374, column: 15, scope: !927)
!927 = distinct !DILexicalBlock(scope: !909, file: !3, line: 374, column: 9)
!928 = !DILocation(line: 374, column: 9, scope: !909)
!929 = !DILocation(line: 375, column: 41, scope: !909)
!930 = !DILocation(line: 375, column: 32, scope: !909)
!931 = !DILocation(line: 376, column: 19, scope: !909)
!932 = !DILocation(line: 376, column: 26, scope: !909)
!933 = !{!895, !895, i64 0}
!934 = !DILocation(line: 376, column: 36, scope: !909)
!935 = !DILocation(line: 376, column: 31, scope: !909)
!936 = !DILocation(line: 376, column: 12, scope: !909)
!937 = !DILocation(line: 379, column: 14, scope: !919)
!938 = !DILocation(line: 379, column: 9, scope: !909)
!939 = !DILocation(line: 0, scope: !918)
!940 = !DILocation(line: 380, column: 16, scope: !918)
!941 = !DILocation(line: 381, column: 22, scope: !918)
!942 = !DILocation(line: 381, column: 34, scope: !918)
!943 = !DILocation(line: 381, column: 46, scope: !918)
!944 = !DILocation(line: 381, column: 49, scope: !918)
!945 = !DILocation(line: 381, column: 9, scope: !918)
!946 = distinct !{!946, !945, !947}
!947 = !DILocation(line: 381, column: 72, scope: !918)
!948 = !DILocation(line: 382, column: 16, scope: !949)
!949 = distinct !DILexicalBlock(scope: !918, file: !3, line: 382, column: 13)
!950 = !DILocation(line: 382, column: 13, scope: !949)
!951 = !DILocation(line: 382, column: 21, scope: !949)
!952 = !DILocation(line: 382, column: 13, scope: !918)
!953 = !DILocation(line: 383, column: 34, scope: !949)
!954 = !DILocation(line: 383, column: 21, scope: !949)
!955 = !DILocation(line: 383, column: 13, scope: !949)
!956 = !DILocation(line: 384, column: 20, scope: !918)
!957 = !DILocation(line: 384, column: 30, scope: !918)
!958 = !DILocation(line: 384, column: 16, scope: !918)
!959 = !DILocation(line: 0, scope: !909)
!960 = !DILocation(line: 388, column: 14, scope: !922)
!961 = !DILocation(line: 388, column: 9, scope: !909)
!962 = !DILocation(line: 389, column: 16, scope: !921)
!963 = !DILocation(line: 390, column: 23, scope: !964)
!964 = distinct !DILexicalBlock(scope: !921, file: !3, line: 390, column: 13)
!965 = !DILocation(line: 390, column: 13, scope: !921)
!966 = !DILocation(line: 391, column: 32, scope: !921)
!967 = !DILocation(line: 391, column: 13, scope: !921)
!968 = !DILocation(line: 392, column: 19, scope: !921)
!969 = !DILocation(line: 392, column: 12, scope: !921)
!970 = !DILocation(line: 392, column: 17, scope: !921)
!971 = !DILocation(line: 393, column: 12, scope: !921)
!972 = !DILocation(line: 393, column: 17, scope: !921)
!973 = !DILocation(line: 394, column: 24, scope: !921)
!974 = !DILocation(line: 394, column: 12, scope: !921)
!975 = !DILocation(line: 394, column: 17, scope: !921)
!976 = !DILocation(line: 395, column: 22, scope: !921)
!977 = !DILocation(line: 396, column: 5, scope: !921)
!978 = !DILocation(line: 398, column: 35, scope: !909)
!979 = !DILocation(line: 398, column: 30, scope: !909)
!980 = !DILocation(line: 398, column: 11, scope: !909)
!981 = !DILocation(line: 399, column: 13, scope: !909)
!982 = !DILocation(line: 401, column: 1, scope: !909)
!983 = distinct !DISubprogram(name: "moduleCreateEmptyKey", scope: !3, file: !3, line: 419, type: !984, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1017)
!984 = !DISubroutineType(types: !985)
!985 = !{!17, !986, !17}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleKey", file: !3, line: 167, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleKey", file: !3, line: 149, size: 960, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997, !1005, !1013, !1014, !1015, !1016}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !988, file: !3, line: 150, baseType: !584, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !988, file: !3, line: 151, baseType: !38, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !988, file: !3, line: 152, baseType: !143, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !988, file: !3, line: 153, baseType: !143, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !988, file: !3, line: 154, baseType: !6, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !988, file: !3, line: 155, baseType: !17, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ztype", scope: !988, file: !3, line: 158, baseType: !618, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "zrs", scope: !988, file: !3, line: 159, baseType: !998, size: 192, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "zrangespec", file: !13, line: 1675, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1672, size: 192, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !999, file: !13, line: 1673, baseType: !96, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !999, file: !13, line: 1673, baseType: !96, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "minex", scope: !999, file: !13, line: 1674, baseType: !17, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "maxex", scope: !999, file: !13, line: 1674, baseType: !17, size: 32, offset: 160)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "zlrs", scope: !988, file: !3, line: 160, baseType: !1006, size: 192, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlexrangespec", file: !13, line: 1681, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1678, size: 192, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1007, file: !13, line: 1679, baseType: !154, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1007, file: !13, line: 1679, baseType: !154, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "minex", scope: !1007, file: !13, line: 1680, baseType: !17, size: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "maxex", scope: !1007, file: !13, line: 1680, baseType: !17, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "zstart", scope: !988, file: !3, line: 161, baseType: !618, size: 32, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "zend", scope: !988, file: !3, line: 162, baseType: !618, size: 32, offset: 800)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "zcurrent", scope: !988, file: !3, line: 163, baseType: !6, size: 64, offset: 832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "zer", scope: !988, file: !3, line: 164, baseType: !17, size: 32, offset: 896)
!1017 = !{!1018, !1019, !1020}
!1018 = !DILocalVariable(name: "key", arg: 1, scope: !983, file: !3, line: 419, type: !986)
!1019 = !DILocalVariable(name: "type", arg: 2, scope: !983, file: !3, line: 419, type: !17)
!1020 = !DILocalVariable(name: "obj", scope: !983, file: !3, line: 420, type: !143)
!1021 = !DILocation(line: 419, column: 42, scope: !983)
!1022 = !DILocation(line: 419, column: 51, scope: !983)
!1023 = !DILocation(line: 423, column: 16, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !983, file: !3, line: 423, column: 9)
!1025 = !{!1026, !895, i64 40}
!1026 = !{!"RedisModuleKey", !892, i64 0, !892, i64 8, !892, i64 16, !892, i64 24, !892, i64 32, !895, i64 40, !895, i64 44, !1027, i64 48, !1029, i64 72, !895, i64 96, !895, i64 100, !892, i64 104, !895, i64 112}
!1027 = !{!"", !1028, i64 0, !1028, i64 8, !895, i64 16, !895, i64 20}
!1028 = !{!"double", !893, i64 0}
!1029 = !{!"", !892, i64 0, !892, i64 8, !895, i64 16, !895, i64 20}
!1030 = !DILocation(line: 423, column: 21, scope: !1024)
!1031 = !DILocation(line: 423, column: 42, scope: !1024)
!1032 = !DILocation(line: 423, column: 50, scope: !1024)
!1033 = !{!1026, !892, i64 24}
!1034 = !DILocation(line: 423, column: 45, scope: !1024)
!1035 = !DILocation(line: 423, column: 9, scope: !983)
!1036 = !DILocation(line: 426, column: 5, scope: !983)
!1037 = !DILocation(line: 428, column: 15, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !983, file: !3, line: 426, column: 18)
!1039 = !DILocation(line: 420, column: 11, scope: !983)
!1040 = !DILocation(line: 429, column: 34, scope: !1038)
!1041 = !{!1042, !892, i64 8}
!1042 = !{!"redisObject", !895, i64 0, !895, i64 0, !895, i64 1, !895, i64 4, !892, i64 8}
!1043 = !DILocation(line: 429, column: 46, scope: !1038)
!1044 = !{!1045, !895, i64 2864}
