; ModuleID = '/root/.unikraft/libs/lwip/netbuf.c'
source_filename = "/root/.unikraft/libs/lwip/netbuf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_netbuf = type { %struct.uk_netbuf*, %struct.uk_netbuf*, i8*, i16, %struct.__atomic, i8*, i8*, i64, void (%struct.uk_netbuf*)*, %struct.uk_alloc*, i8* }
%struct.__atomic = type { i32 }
%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [23 x i8] c"Assertion failure: %s\0A\00", align 1
@uk_pr_crit.__str = internal global [8 x i8] c"liblwip\00", section ".data_shared", align 1, !dbg !0
@uk_pr_crit.__str.2 = internal global [9 x i8] c"netbuf.c\00", section ".data_shared", align 1, !dbg !168
@_intrstack_start = external dso_local global [0 x i8], align 1
@_end = external dso_local global [0 x i8], align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !188, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "uk_pr_crit", scope: !3, file: !3, line: 194, type: !4, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !173)
!3 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, null}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !27, globals: !167)
!10 = !DIFile(filename: "/root/.unikraft/libs/lwip/netbuf.c", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !20}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 145, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!17 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!19 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !21, line: 68, baseType: !14, size: 32, elements: !22)
!21 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!27 = !{!28, !87, !156, !158, !159, !160, !163, !166}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_netbuf_pbuf", file: !30, line: 50, size: 320, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/libs/lwip/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !64}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf_custom", scope: !29, file: !30, line: 51, baseType: !33, size: 256)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf_custom", file: !13, line: 242, size: 256, elements: !34)
!34 = !{!35, !59}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf", scope: !33, file: !13, line: 244, baseType: !36, size: 192)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !13, line: 186, size: 192, elements: !37)
!37 = !{!38, !40, !42, !50, !51, !56, !57, !58}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !13, line: 188, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !36, file: !13, line: 191, baseType: !41, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !36, file: !13, line: 200, baseType: !43, size: 16, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !44, line: 127, baseType: !45)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !46, line: 36, baseType: !47)
!46 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !48, line: 57, baseType: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !13, line: 203, baseType: !43, size: 16, offset: 144)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !36, file: !13, line: 208, baseType: !52, size: 8, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !44, line: 125, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 24, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !48, line: 43, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !13, line: 211, baseType: !52, size: 8, offset: 168)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !36, file: !13, line: 218, baseType: !52, size: 8, offset: 176)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !36, file: !13, line: 221, baseType: !52, size: 8, offset: 184)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "custom_free_function", scope: !33, file: !13, line: 246, baseType: !60, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "pbuf_free_custom_fn", file: !13, line: 239, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !39}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "netbuf", scope: !29, file: !30, line: 52, baseType: !65, size: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netbuf", file: !67, line: 104, size: 640, elements: !68)
!67 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uknetdev/include/uk/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !{!69, !70, !71, !72, !73, !80, !81, !82, !88, !93, !155}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !67, line: 105, baseType: !65, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !67, line: 106, baseType: !65, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !67, line: 108, baseType: !41, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !67, line: 109, baseType: !45, size: 16, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !66, file: !67, line: 110, baseType: !74, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic", file: !75, line: 253, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 251, size: 32, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !76, file: !75, line: 252, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !75, line: 88, baseType: !14)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !66, file: !67, line: 112, baseType: !41, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !66, file: !67, line: 114, baseType: !41, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !66, file: !67, line: 115, baseType: !83, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 40, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !86, line: 129, baseType: !87)
!86 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !66, file: !67, line: 117, baseType: !89, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netbuf_dtor_t", file: !67, line: 51, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !65}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_a", scope: !66, file: !67, line: 118, baseType: !94, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !96, line: 77, size: 832, elements: !97)
!96 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!97 = !{!98, !105, !110, !115, !122, !124, !129, !130, !131, !136, !141, !146, !147, !148}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !95, file: !96, line: 79, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !96, line: 54, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!41, !94, !103}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 58, baseType: !87)
!104 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !95, file: !96, line: 80, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !96, line: 56, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!41, !94, !103, !103}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !95, file: !96, line: 81, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !96, line: 62, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!41, !94, !41, !103}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !95, file: !96, line: 82, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !96, line: 58, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !94, !121, !103, !103}
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !95, file: !96, line: 83, baseType: !123, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !96, line: 60, baseType: !107)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !95, file: !96, line: 84, baseType: !125, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !96, line: 64, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !94, !41}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !95, file: !96, line: 87, baseType: !125, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !95, file: !96, line: 88, baseType: !99, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !95, file: !96, line: 92, baseType: !132, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !96, line: 66, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!41, !94, !87}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !95, file: !96, line: 93, baseType: !137, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !96, line: 68, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !94, !41, !87}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !95, file: !96, line: 99, baseType: !142, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !96, line: 70, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!120, !94, !41, !103}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, file: !96, line: 100, baseType: !103, size: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !96, line: 103, baseType: !94, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !95, file: !96, line: 104, baseType: !149, offset: 832)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, elements: !153)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !46, line: 20, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !48, line: 41, baseType: !152)
!152 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!153 = !{!154}
!154 = !DISubrange(count: -1)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_b", scope: !66, file: !67, line: 119, baseType: !41, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !46, line: 60, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !48, line: 105, baseType: !87)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !48, line: 232, baseType: !87)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!167 = !{!0, !168}
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 198, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 72, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 9)
!173 = !{!174, !175}
!174 = !DILocalVariable(name: "fmt", arg: 1, scope: !2, file: !3, line: 194, type: !6)
!175 = !DILocalVariable(name: "argp", scope: !2, file: !3, line: 196, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !177, line: 32, baseType: !178)
!177 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !10, line: 196, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, elements: !186)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !10, line: 196, size: 192, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !180, file: !10, line: 196, baseType: !14, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !180, file: !10, line: 196, baseType: !14, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !180, file: !10, line: 196, baseType: !41, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !180, file: !10, line: 196, baseType: !41, size: 64, offset: 128)
!186 = !{!187}
!187 = !DISubrange(count: 1)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 8)
!191 = !{i32 2, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{i32 1, !"wchar_size", i32 4}
!194 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!195 = distinct !DISubprogram(name: "lwip_alloc_netbuf", scope: !10, file: !10, line: 53, type: !196, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{!65, !94, !83, !83, !45}
!198 = !{!199, !200, !201, !202, !203, !204}
!199 = !DILocalVariable(name: "a", arg: 1, scope: !195, file: !10, line: 53, type: !94)
!200 = !DILocalVariable(name: "alloc_size", arg: 2, scope: !195, file: !10, line: 53, type: !83)
!201 = !DILocalVariable(name: "alloc_align", arg: 3, scope: !195, file: !10, line: 54, type: !83)
!202 = !DILocalVariable(name: "headroom", arg: 4, scope: !195, file: !10, line: 54, type: !45)
!203 = !DILocalVariable(name: "b", scope: !195, file: !10, line: 56, type: !65)
!204 = !DILocalVariable(name: "np", scope: !195, file: !10, line: 57, type: !28)
!205 = !DILocation(line: 53, column: 54, scope: !195)
!206 = !DILocation(line: 53, column: 64, scope: !195)
!207 = !DILocation(line: 54, column: 16, scope: !195)
!208 = !DILocation(line: 54, column: 38, scope: !195)
!209 = !DILocation(line: 59, column: 6, scope: !195)
!210 = !DILocation(line: 56, column: 20, scope: !195)
!211 = !DILocation(line: 61, column: 6, scope: !212)
!212 = distinct !DILexicalBlock(scope: !195, file: !10, line: 61, column: 6)
!213 = !DILocation(line: 61, column: 6, scope: !195)
!214 = !{!"branch_weights", i32 1, i32 2000}
!215 = !DILocalVariable(name: "m", arg: 1, scope: !216, file: !67, line: 337, type: !65)
!216 = distinct !DISubprogram(name: "uk_netbuf_get_priv", scope: !67, file: !67, line: 337, type: !217, isLocal: true, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, unit: !9, retainedNodes: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{!41, !65}
!219 = !{!215}
!220 = !DILocation(line: 337, column: 58, scope: !216, inlinedAt: !221)
!221 = distinct !DILocation(line: 69, column: 31, scope: !195)
!222 = !DILocation(line: 341, column: 14, scope: !216, inlinedAt: !221)
!223 = !{!224, !225, i64 32}
!224 = !{!"uk_netbuf", !225, i64 0, !225, i64 8, !225, i64 16, !228, i64 24, !229, i64 28, !225, i64 32, !225, i64 40, !231, i64 48, !225, i64 56, !225, i64 64, !225, i64 72}
!225 = !{!"any pointer", !226, i64 0}
!226 = !{!"omnipotent char", !227, i64 0}
!227 = !{!"Simple C/C++ TBAA"}
!228 = !{!"short", !226, i64 0}
!229 = !{!"", !230, i64 0}
!230 = !{!"int", !226, i64 0}
!231 = !{!"long", !226, i64 0}
!232 = !DILocation(line: 341, column: 2, scope: !216, inlinedAt: !221)
!233 = !DILocation(line: 57, column: 23, scope: !195)
!234 = !DILocation(line: 70, column: 2, scope: !195)
!235 = !DILocation(line: 71, column: 23, scope: !195)
!236 = !DILocation(line: 71, column: 39, scope: !195)
!237 = !{!238, !226, i64 20}
!238 = !{!"_netbuf_pbuf", !239, i64 0, !225, i64 32}
!239 = !{!"pbuf_custom", !240, i64 0, !225, i64 24}
!240 = !{!"pbuf", !225, i64 0, !225, i64 8, !228, i64 16, !228, i64 18, !226, i64 20, !226, i64 21, !226, i64 22, !226, i64 23}
!241 = !DILocation(line: 72, column: 23, scope: !195)
!242 = !DILocation(line: 72, column: 39, scope: !195)
!243 = !{!238, !226, i64 21}
!244 = !DILocation(line: 73, column: 44, scope: !195)
!245 = !{!224, !225, i64 16}
!246 = !DILocation(line: 73, column: 23, scope: !195)
!247 = !DILocation(line: 73, column: 39, scope: !195)
!248 = !{!238, !225, i64 8}
!249 = !DILocation(line: 74, column: 23, scope: !195)
!250 = !DILocation(line: 74, column: 39, scope: !195)
!251 = !{!238, !226, i64 22}
