; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netdb.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netdb.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.hostent = type { i8*, i8**, i32, i32, i8** }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, {}*, {}*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i8, i8, [14 x i8] }
%struct.sockaddr_storage = type { i8, i8, [2 x i8], [3 x i32], [3 x i32] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@lwip_gethostbyname.s_hostent = internal global %struct.hostent zeroinitializer, align 8, !dbg !0
@lwip_gethostbyname.s_aliases = internal global i8* null, align 8, !dbg !186
@lwip_gethostbyname.s_hostent_addr = internal global %struct.ip_addr zeroinitializer, align 4, !dbg !188

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s_hostent", scope: !2, file: !3, line: 94, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "lwip_gethostbyname", scope: !3, file: !3, line: 88, type: !4, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !222)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/netdb.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !19}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !8, line: 92, size: 256, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netdb.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !13, !15, !17, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !7, file: !8, line: 93, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !7, file: !8, line: 94, baseType: !14, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !7, file: !8, line: 96, baseType: !16, size: 32, offset: 128)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !7, file: !8, line: 97, baseType: !16, size: 32, offset: 160)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !7, file: !8, line: 98, baseType: !14, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!21 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !57, globals: !185)
!22 = !{!23, !43, !50}
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 53, baseType: !16, size: 32, elements: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!26 = !DIEnumerator(name: "ERR_OK", value: 0)
!27 = !DIEnumerator(name: "ERR_MEM", value: -1)
!28 = !DIEnumerator(name: "ERR_BUF", value: -2)
!29 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!30 = !DIEnumerator(name: "ERR_RTE", value: -4)
!31 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!32 = !DIEnumerator(name: "ERR_VAL", value: -6)
!33 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!34 = !DIEnumerator(name: "ERR_USE", value: -8)
!35 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!36 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!37 = !DIEnumerator(name: "ERR_CONN", value: -11)
!38 = !DIEnumerator(name: "ERR_IF", value: -12)
!39 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!40 = !DIEnumerator(name: "ERR_RST", value: -14)
!41 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!42 = !DIEnumerator(name: "ERR_ARG", value: -16)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !44, line: 54, baseType: !45, size: 32, elements: !46)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !51, line: 68, baseType: !45, size: 32, elements: !52)
!51 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!57 = !{!14, !58, !59, !102, !11, !105, !106, !78, !108, !131, !143, !144, !151, !169, !119, !184}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gethostbyname_r_helper", file: !3, line: 54, size: 384, elements: !61)
!61 = !{!62, !100, !101}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !60, file: !3, line: 55, baseType: !63, size: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !98)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !44, line: 76, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !44, line: 69, size: 192, elements: !67)
!67 = !{!68, !97}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !66, file: !44, line: 73, baseType: !69, size: 160)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !44, line: 70, size: 160, elements: !70)
!70 = !{!71, !91}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !69, file: !44, line: 71, baseType: !72, size: 160)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !73, line: 67, baseType: !74)
!73 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !73, line: 59, size: 160, elements: !75)
!75 = !{!76, !86}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !74, file: !73, line: 60, baseType: !77, size: 128)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !84)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !79, line: 129, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !81, line: 48, baseType: !82)
!81 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !83, line: 79, baseType: !45)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !{!85}
!85 = !DISubrange(count: 4)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !74, file: !73, line: 62, baseType: !87, size: 8, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !79, line: 125, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !81, line: 24, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !83, line: 43, baseType: !90)
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !69, file: !44, line: 72, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !93, line: 57, baseType: !94)
!93 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !93, line: 51, size: 32, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !94, file: !93, line: 52, baseType: !78, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !44, line: 75, baseType: !87, size: 8, offset: 160)
!98 = !{!99}
!99 = !DISubrange(count: 2)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !60, file: !3, line: 56, baseType: !65, size: 192, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !60, file: !3, line: 57, baseType: !11, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_ptr_t", file: !79, line: 135, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !81, line: 82, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !83, line: 232, baseType: !105)
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !81, line: 60, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !83, line: 105, baseType: !105)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !8, line: 103, size: 384, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !118, !129, !130}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !109, file: !8, line: 104, baseType: !16, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !109, file: !8, line: 105, baseType: !16, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !109, file: !8, line: 106, baseType: !16, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !109, file: !8, line: 107, baseType: !16, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !109, file: !8, line: 108, baseType: !116, size: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !117, line: 113, baseType: !78)
!117 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/sockets.h", directory: "/root/.unikraft/apps/redis/build")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !109, file: !8, line: 109, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !117, line: 94, size: 128, elements: !121)
!121 = !{!122, !123, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !120, file: !117, line: 95, baseType: !87, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !120, file: !117, line: 96, baseType: !124, size: 8, offset: 8)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !117, line: 63, baseType: !87)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !120, file: !117, line: 97, baseType: !126, size: 112, offset: 16)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 112, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 14)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !109, file: !8, line: 110, baseType: !11, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !109, file: !8, line: 111, baseType: !108, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !117, line: 100, size: 224, elements: !133)
!133 = !{!134, !135, !136, !138, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "s2_len", scope: !132, file: !117, line: 101, baseType: !87, size: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !132, file: !117, line: 102, baseType: !124, size: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "s2_data1", scope: !132, file: !117, line: 103, baseType: !137, size: 16, offset: 16)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16, elements: !98)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "s2_data2", scope: !132, file: !117, line: 104, baseType: !139, size: 96, offset: 32)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 96, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "s2_data3", scope: !132, file: !117, line: 106, baseType: !139, size: 96, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !117, line: 84, size: 224, elements: !146)
!146 = !{!147, !148, !149, !155, !156, !168}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !145, file: !117, line: 85, baseType: !87, size: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !145, file: !117, line: 86, baseType: !124, size: 8, offset: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !145, file: !117, line: 87, baseType: !150, size: 16, offset: 16)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !117, line: 68, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !79, line: 127, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !81, line: 36, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !83, line: 57, baseType: !154)
!154 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !145, file: !117, line: 88, baseType: !78, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !145, file: !117, line: 89, baseType: !157, size: 128, offset: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !158, line: 62, size: 128, elements: !159)
!158 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/inet.h", directory: "/root/.unikraft/apps/redis/build")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !157, file: !158, line: 66, baseType: !161, size: 128)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !157, file: !158, line: 63, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "u32_addr", scope: !161, file: !158, line: 64, baseType: !77, size: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "u8_addr", scope: !161, file: !158, line: 65, baseType: !165, size: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !145, file: !117, line: 90, baseType: !78, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !117, line: 73, size: 128, elements: !171)
!171 = !{!172, !173, !174, !175, !180}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !170, file: !117, line: 74, baseType: !87, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !170, file: !117, line: 75, baseType: !124, size: 8, offset: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !170, file: !117, line: 76, baseType: !150, size: 16, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !170, file: !117, line: 77, baseType: !176, size: 32, offset: 32)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !158, line: 58, size: 32, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !176, file: !158, line: 59, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !158, line: 55, baseType: !78)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !170, file: !117, line: 79, baseType: !181, size: 64, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!185 = !{!0, !186, !188, !190, !192, !197, !199, !220}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "s_aliases", scope: !2, file: !3, line: 95, type: !11, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "s_hostent_addr", scope: !2, file: !3, line: 96, type: !65, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "s_phostent_addr", scope: !2, file: !3, line: 97, type: !63, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "s_hostname", scope: !2, file: !3, line: 98, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2056, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 257)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "h_errno", scope: !21, file: !3, line: 62, type: !16, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "__str", scope: !201, file: !202, line: 198, type: !181, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "uk_pr_crit", scope: !202, file: !202, line: 194, type: !203, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !205)
!202 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!203 = !DISubroutineType(types: !204)
!204 = !{null, !19, null}
!205 = !{!206, !207}
!206 = !DILocalVariable(name: "fmt", arg: 1, scope: !201, file: !202, line: 194, type: !19)
!207 = !DILocalVariable(name: "argp", scope: !201, file: !202, line: 196, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !209, line: 32, baseType: !210)
!209 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 192, elements: !218)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !212, file: !3, line: 196, baseType: !45, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !212, file: !3, line: 196, baseType: !45, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !212, file: !3, line: 196, baseType: !58, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !212, file: !3, line: 196, baseType: !58, size: 64, offset: 128)
!218 = !{!219}
!219 = !DISubrange(count: 1)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "__str", scope: !201, file: !202, line: 198, type: !181, isLocal: true, isDefinition: true)
!222 = !{!223, !224, !230}
!223 = !DILocalVariable(name: "name", arg: 1, scope: !2, file: !3, line: 88, type: !19)
!224 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 90, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !24, line: 96, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !79, line: 126, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !81, line: 20, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !83, line: 41, baseType: !229)
!229 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!230 = !DILocalVariable(name: "addr", scope: !2, file: !3, line: 91, type: !65)
!231 = !{i32 2, !"Dwarf Version", i32 4}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!235 = !DILocation(line: 88, column: 32, scope: !2)
!236 = !DILocation(line: 91, column: 3, scope: !2)
!237 = !DILocation(line: 91, column: 13, scope: !2)
!238 = !DILocation(line: 101, column: 9, scope: !2)
!239 = !DILocation(line: 90, column: 9, scope: !2)
!240 = !DILocation(line: 102, column: 11, scope: !241)
!241 = distinct !DILexicalBlock(scope: !2, file: !3, line: 102, column: 7)
!242 = !DILocation(line: 102, column: 7, scope: !2)
!243 = !DILocation(line: 104, column: 13, scope: !244)
!244 = distinct !DILexicalBlock(scope: !241, file: !3, line: 102, column: 22)
!245 = !{!246, !246, i64 0}
!246 = !{!"int", !247, i64 0}
!247 = !{!"omnipotent char", !248, i64 0}
!248 = !{!"Simple C/C++ TBAA"}
!249 = !DILocation(line: 105, column: 5, scope: !244)
!250 = !DILocation(line: 109, column: 20, scope: !2)
!251 = !{i64 0, i64 16, !252, i64 16, i64 1, !252, i64 0, i64 4, !245, i64 20, i64 1, !252}
!252 = !{!247, !247, i64 0}
!253 = !DILocation(line: 110, column: 22, scope: !2)
!254 = !{!255, !255, i64 0}
!255 = !{!"any pointer", !247, i64 0}
!256 = !DILocation(line: 112, column: 3, scope: !2)
!257 = !DILocation(line: 113, column: 35, scope: !2)
!258 = !DILocation(line: 114, column: 20, scope: !2)
!259 = !{!260, !255, i64 0}
!260 = !{!"hostent", !255, i64 0, !255, i64 8, !246, i64 16, !246, i64 20, !255, i64 24}
!261 = !DILocation(line: 115, column: 13, scope: !2)
!262 = !DILocation(line: 116, column: 23, scope: !2)
!263 = !{!260, !255, i64 8}
!264 = !DILocation(line: 117, column: 24, scope: !2)
!265 = !{!260, !246, i64 16}
!266 = !DILocation(line: 118, column: 22, scope: !2)
!267 = !{!260, !246, i64 20}
!268 = !DILocation(line: 119, column: 25, scope: !2)
!269 = !{!260, !255, i64 24}
!270 = !DILocation(line: 142, column: 3, scope: !2)
!271 = !DILocation(line: 0, scope: !2)
!272 = !DILocation(line: 144, column: 1, scope: !2)
!273 = distinct !DISubprogram(name: "lwip_gethostbyname_r", scope: !3, file: !3, line: 163, type: !274, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !281)
!274 = !DISubroutineType(types: !275)
!275 = !{!16, !19, !6, !11, !276, !280, !184}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 40, baseType: !278)
!277 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !279, line: 129, baseType: !105)
!279 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!282 = !DILocalVariable(name: "name", arg: 1, scope: !273, file: !3, line: 163, type: !19)
!283 = !DILocalVariable(name: "ret", arg: 2, scope: !273, file: !3, line: 163, type: !6)
!284 = !DILocalVariable(name: "buf", arg: 3, scope: !273, file: !3, line: 163, type: !11)
!285 = !DILocalVariable(name: "buflen", arg: 4, scope: !273, file: !3, line: 164, type: !276)
!286 = !DILocalVariable(name: "result", arg: 5, scope: !273, file: !3, line: 164, type: !280)
!287 = !DILocalVariable(name: "h_errnop", arg: 6, scope: !273, file: !3, line: 164, type: !184)
!288 = !DILocalVariable(name: "err", scope: !273, file: !3, line: 166, type: !225)
!289 = !DILocalVariable(name: "h", scope: !273, file: !3, line: 167, type: !59)
!290 = !DILocalVariable(name: "hostname", scope: !273, file: !3, line: 168, type: !11)
!291 = !DILocalVariable(name: "namelen", scope: !273, file: !3, line: 169, type: !276)
!292 = !DILocalVariable(name: "lh_errno", scope: !273, file: !3, line: 170, type: !16)
!293 = !DILocation(line: 163, column: 34, scope: !273)
!294 = !DILocation(line: 163, column: 56, scope: !273)
!295 = !DILocation(line: 163, column: 67, scope: !273)
!296 = !DILocation(line: 164, column: 29, scope: !273)
!297 = !DILocation(line: 164, column: 54, scope: !273)
!298 = !DILocation(line: 164, column: 67, scope: !273)
!299 = !DILocation(line: 170, column: 3, scope: !273)
!300 = !DILocation(line: 172, column: 16, scope: !301)
!301 = distinct !DILexicalBlock(scope: !273, file: !3, line: 172, column: 7)
!302 = !DILocation(line: 172, column: 7, scope: !273)
!303 = !DILocation(line: 177, column: 14, scope: !304)
!304 = distinct !DILexicalBlock(scope: !273, file: !3, line: 177, column: 7)
!305 = !DILocation(line: 177, column: 7, scope: !273)
!306 = !DILocation(line: 179, column: 15, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !3, line: 177, column: 23)
!308 = !DILocation(line: 180, column: 5, scope: !307)
!309 = !DILocation(line: 183, column: 11, scope: !273)
!310 = !DILocation(line: 184, column: 13, scope: !311)
!311 = distinct !DILexicalBlock(scope: !273, file: !3, line: 184, column: 7)
!312 = !DILocation(line: 184, column: 30, scope: !311)
!313 = !DILocation(line: 184, column: 22, scope: !311)
!314 = !DILocation(line: 184, column: 47, scope: !311)
!315 = !DILocation(line: 186, column: 15, scope: !316)
!316 = distinct !DILexicalBlock(scope: !311, file: !3, line: 184, column: 57)
!317 = !DILocation(line: 187, column: 5, scope: !316)
!318 = !DILocation(line: 190, column: 13, scope: !273)
!319 = !DILocation(line: 169, column: 10, scope: !273)
!320 = !DILocation(line: 191, column: 55, scope: !321)
!321 = distinct !DILexicalBlock(scope: !273, file: !3, line: 191, column: 7)
!322 = !DILocation(line: 191, column: 14, scope: !321)
!323 = !DILocation(line: 191, column: 7, scope: !273)
!324 = !DILocation(line: 193, column: 15, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !3, line: 191, column: 94)
!326 = !DILocation(line: 194, column: 5, scope: !325)
!327 = !DILocation(line: 198, column: 26, scope: !273)
!328 = !DILocation(line: 168, column: 9, scope: !273)
!329 = !DILocation(line: 201, column: 9, scope: !273)
!330 = !DILocation(line: 166, column: 9, scope: !273)
!331 = !DILocation(line: 202, column: 11, scope: !332)
!332 = distinct !DILexicalBlock(scope: !273, file: !3, line: 202, column: 7)
!333 = !DILocation(line: 202, column: 7, scope: !273)
!334 = !DILocation(line: 204, column: 15, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !3, line: 202, column: 22)
!336 = !DILocation(line: 205, column: 5, scope: !335)
!337 = !DILocation(line: 167, column: 34, scope: !273)
!338 = !DILocation(line: 209, column: 3, scope: !273)
!339 = !DILocation(line: 210, column: 3, scope: !273)
!340 = !DILocation(line: 210, column: 21, scope: !273)
!341 = !DILocation(line: 213, column: 19, scope: !273)
!342 = !DILocation(line: 214, column: 3, scope: !273)
!343 = !DILocation(line: 214, column: 19, scope: !273)
!344 = !DILocation(line: 215, column: 6, scope: !273)
!345 = !DILocation(line: 215, column: 14, scope: !273)
!346 = !{!347, !255, i64 40}
!347 = !{!"gethostbyname_r_helper", !247, i64 0, !348, i64 16, !255, i64 40}
!348 = !{!"ip_addr", !247, i64 0, !247, i64 20}
!349 = !DILocation(line: 216, column: 8, scope: !273)
!350 = !DILocation(line: 216, column: 15, scope: !273)
!351 = !DILocation(line: 217, column: 8, scope: !273)
!352 = !DILocation(line: 217, column: 18, scope: !273)
!353 = !DILocation(line: 218, column: 8, scope: !273)
!354 = !DILocation(line: 218, column: 19, scope: !273)
!355 = !DILocation(line: 219, column: 8, scope: !273)
!356 = !DILocation(line: 219, column: 17, scope: !273)
!357 = !DILocation(line: 220, column: 8, scope: !273)
!358 = !DILocation(line: 220, column: 20, scope: !273)
!359 = !DILocation(line: 223, column: 11, scope: !273)
!360 = !DILocation(line: 226, column: 3, scope: !273)
!361 = !DILocation(line: 0, scope: !273)
!362 = !DILocation(line: 227, column: 1, scope: !273)
!363 = distinct !DISubprogram(name: "lwip_freeaddrinfo", scope: !3, file: !3, line: 237, type: !364, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !108}
!366 = !{!367, !368}
!367 = !DILocalVariable(name: "ai", arg: 1, scope: !363, file: !3, line: 237, type: !108)
!368 = !DILocalVariable(name: "next", scope: !363, file: !3, line: 239, type: !108)
!369 = !DILocation(line: 237, column: 36, scope: !363)
!370 = !DILocation(line: 241, column: 13, scope: !363)
!371 = !DILocation(line: 241, column: 3, scope: !363)
!372 = !DILocation(line: 243, column: 13, scope: !373)
!373 = distinct !DILexicalBlock(scope: !363, file: !3, line: 241, column: 22)
!374 = !DILocalVariable(name: "a", arg: 1, scope: !375, file: !376, line: 237, type: !379)
!375 = distinct !DISubprogram(name: "uk_free", scope: !376, file: !376, line: 237, type: !377, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !433)
!376 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379, !58}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !376, line: 77, size: 832, elements: !381)
!381 = !{!382, !389, !394, !399, !405, !407, !410, !411, !412, !417, !422, !427, !428, !429}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !380, file: !376, line: 79, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !376, line: 54, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!58, !379, !387}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !388, line: 58, baseType: !105)
!388 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !380, file: !376, line: 80, baseType: !390, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !376, line: 56, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!58, !379, !387, !387}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !380, file: !376, line: 81, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !376, line: 62, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!58, !379, !58, !387}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !380, file: !376, line: 82, baseType: !400, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !376, line: 58, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!16, !379, !404, !387, !387}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !380, file: !376, line: 83, baseType: !406, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !376, line: 60, baseType: !391)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !380, file: !376, line: 84, baseType: !408, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !376, line: 64, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !380, file: !376, line: 87, baseType: !408, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !380, file: !376, line: 88, baseType: !383, size: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !380, file: !376, line: 92, baseType: !413, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !376, line: 66, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!58, !379, !105}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !380, file: !376, line: 93, baseType: !418, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !376, line: 68, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !379, !58, !105}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !380, file: !376, line: 99, baseType: !423, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !376, line: 70, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!16, !379, !58, !387}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !380, file: !376, line: 100, baseType: !387, size: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !376, line: 103, baseType: !379, size: 64, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !380, file: !376, line: 104, baseType: !430, offset: 832)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: -1)
!433 = !{!374, !434}
!434 = !DILocalVariable(name: "ptr", arg: 2, scope: !375, file: !376, line: 237, type: !58)
!435 = !DILocation(line: 237, column: 45, scope: !375, inlinedAt: !436)
!436 = distinct !DILocation(line: 243, column: 5, scope: !373)
!437 = !DILocalVariable(name: "a", arg: 1, scope: !438, file: !376, line: 231, type: !379)
!438 = distinct !DISubprogram(name: "uk_do_free", scope: !376, file: !376, line: 231, type: !377, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !439)
!439 = !{!437, !440}
!440 = !DILocalVariable(name: "ptr", arg: 2, scope: !438, file: !376, line: 231, type: !58)
!441 = !DILocation(line: 231, column: 48, scope: !438, inlinedAt: !442)
!442 = distinct !DILocation(line: 239, column: 2, scope: !375, inlinedAt: !436)
!443 = !DILocation(line: 233, column: 2, scope: !444, inlinedAt: !442)
!444 = distinct !DILexicalBlock(scope: !445, file: !376, line: 233, column: 2)
!445 = distinct !DILexicalBlock(scope: !438, file: !376, line: 233, column: 2)
!446 = !DILocation(line: 233, column: 2, scope: !445, inlinedAt: !442)
!447 = !{!"branch_weights", i32 1, i32 2000}
!448 = !DILocation(line: 233, column: 2, scope: !449, inlinedAt: !442)
!449 = distinct !DILexicalBlock(scope: !444, file: !376, line: 233, column: 2)
!450 = !DILocation(line: 243, column: 34, scope: !373)
!451 = !DILocation(line: 231, column: 57, scope: !438, inlinedAt: !442)
!452 = !DILocation(line: 237, column: 54, scope: !375, inlinedAt: !436)
!453 = !DILocation(line: 242, column: 16, scope: !373)
!454 = !{!455, !255, i64 40}
!455 = !{!"addrinfo", !246, i64 0, !246, i64 4, !246, i64 8, !246, i64 12, !246, i64 16, !255, i64 24, !255, i64 32, !255, i64 40}
!456 = !DILocation(line: 239, column: 20, scope: !363)
!457 = !DILocation(line: 234, column: 5, scope: !438, inlinedAt: !442)
!458 = !DILocation(line: 234, column: 2, scope: !438, inlinedAt: !442)
!459 = !DILocation(line: 235, column: 1, scope: !438, inlinedAt: !442)
!460 = !DILocation(line: 240, column: 1, scope: !375, inlinedAt: !436)
!461 = distinct !{!461, !371, !462}
!462 = !DILocation(line: 245, column: 3, scope: !363)
!463 = !DILocation(line: 246, column: 1, scope: !363)
!464 = distinct !DISubprogram(name: "lwip_getaddrinfo", scope: !3, file: !3, line: 270, type: !465, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, unit: !21, retainedNodes: !470)
!465 = !DISubroutineType(types: !466)
!466 = !{!16, !19, !19, !467, !469}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !491, !492, !497, !500}
!471 = !DILocalVariable(name: "nodename", arg: 1, scope: !464, file: !3, line: 270, type: !19)
!472 = !DILocalVariable(name: "servname", arg: 2, scope: !464, file: !3, line: 270, type: !19)
!473 = !DILocalVariable(name: "hints", arg: 3, scope: !464, file: !3, line: 271, type: !467)
!474 = !DILocalVariable(name: "res", arg: 4, scope: !464, file: !3, line: 271, type: !469)
!475 = !DILocalVariable(name: "err", scope: !464, file: !3, line: 273, type: !225)
!476 = !DILocalVariable(name: "addr", scope: !464, file: !3, line: 274, type: !65)
!477 = !DILocalVariable(name: "ai", scope: !464, file: !3, line: 275, type: !108)
!478 = !DILocalVariable(name: "sa", scope: !464, file: !3, line: 276, type: !131)
!479 = !DILocalVariable(name: "port_nr", scope: !464, file: !3, line: 277, type: !16)
!480 = !DILocalVariable(name: "total_size", scope: !464, file: !3, line: 278, type: !276)
