; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/netif.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/netif.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.netif = type { %struct.netif*, %struct.ip_addr, %struct.ip_addr, %struct.ip_addr, [3 x %struct.ip_addr], [3 x i8], [3 x i32], [3 x i32], {}*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip4_addr*)*, i8 (%struct.netif*, %struct.pbuf*)*, i8 (%struct.netif*, %struct.pbuf*, %struct.ip6_addr*)*, void (%struct.netif*)*, void (%struct.netif*)*, i8*, [1 x i8*], i16, i16, i16, [6 x i8], i8, i8, [2 x i8], i8, i8, i8, i8 (%struct.netif*, %struct.ip6_addr*, i32)* }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.ip4_addr = type { i32 }
%struct.netif_ext_callback = type { void (%struct.netif*, i16, %union.netif_ext_callback_args_t*)*, %struct.netif_ext_callback* }
%union.netif_ext_callback_args_t = type { %struct.ipv4_changed_s }
%struct.ipv4_changed_s = type { %struct.ip_addr*, %struct.ip_addr*, %struct.ip_addr* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.ipv6_addr_state_changed_s = type { i8, i8, %struct.ip_addr* }

@.str = private unnamed_addr constant [26 x i8] c"netif_input: invalid pbuf\00", align 1

!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !12, line: 68, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !19, line: 54, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 53, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!28 = !DIEnumerator(name: "ERR_OK", value: 0)
!29 = !DIEnumerator(name: "ERR_MEM", value: -1)
!30 = !DIEnumerator(name: "ERR_BUF", value: -2)
!31 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!32 = !DIEnumerator(name: "ERR_RTE", value: -4)
!33 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!34 = !DIEnumerator(name: "ERR_VAL", value: -6)
!35 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!36 = !DIEnumerator(name: "ERR_USE", value: -8)
!37 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!38 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!39 = !DIEnumerator(name: "ERR_CONN", value: -11)
!40 = !DIEnumerator(name: "ERR_IF", value: -12)
!41 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!42 = !DIEnumerator(name: "ERR_RST", value: -14)
!43 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!44 = !DIEnumerator(name: "ERR_ARG", value: -16)
!45 = !{!46, !47, !54, !57, !64, !84}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !48, line: 125, baseType: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !51)
!50 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 43, baseType: !53)
!52 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !48, line: 129, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !50, line: 48, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 79, baseType: !7)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !60, line: 57, baseType: !61)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !60, line: 51, size: 32, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !61, file: !60, line: 52, baseType: !54, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !19, line: 76, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !19, line: 69, size: 192, elements: !68)
!68 = !{!69, !83}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !67, file: !19, line: 73, baseType: !70, size: 160)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !67, file: !19, line: 70, size: 160, elements: !71)
!71 = !{!72, !82}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !70, file: !19, line: 71, baseType: !73, size: 160)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !74, line: 67, baseType: !75)
!74 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !74, line: 59, size: 160, elements: !76)
!76 = !{!77, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !75, file: !74, line: 60, baseType: !78, size: 128)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 4)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !75, file: !74, line: 62, baseType: !47, size: 8, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !70, file: !19, line: 72, baseType: !59, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !19, line: 75, baseType: !47, size: 8, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!86 = !{!87, !221, !223, !0, !225, !249}
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "ext_callback", scope: !2, file: !3, line: 106, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_ext_callback_t", file: !6, line: 652, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif_ext_callback", file: !6, line: 648, size: 128, elements: !92)
!92 = !{!93, !219}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "callback_fn", scope: !91, file: !6, line: 650, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_ext_callback_fn", file: !6, line: 644, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !98, !188, !189}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !109, !111, !113, !114, !140, !145, !150, !155, !160, !161, !162, !166, !167, !168, !169, !173, !174, !175, !180, !181, !182, !183}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !6, line: 263, baseType: !98, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !99, file: !6, line: 268, baseType: !66, size: 192, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !99, file: !6, line: 269, baseType: !66, size: 192, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !99, file: !6, line: 270, baseType: !66, size: 192, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !99, file: !6, line: 274, baseType: !106, size: 576, offset: 640)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 576, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !99, file: !6, line: 277, baseType: !110, size: 24, offset: 1216)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 24, elements: !107)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !99, file: !6, line: 282, baseType: !112, size: 96, offset: 1248)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 96, elements: !107)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !99, file: !6, line: 283, baseType: !112, size: 96, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !99, file: !6, line: 288, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !124, !98}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !25, line: 96, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !48, line: 126, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !50, line: 20, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !52, line: 41, baseType: !123)
!123 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !126, line: 186, size: 192, elements: !127)
!126 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!127 = !{!128, !129, !130, !135, !136, !137, !138, !139}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !126, line: 188, baseType: !124, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !125, file: !126, line: 191, baseType: !46, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !125, file: !126, line: 200, baseType: !131, size: 16, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !48, line: 127, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 36, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 57, baseType: !134)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !125, file: !126, line: 203, baseType: !131, size: 16, offset: 144)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !125, file: !126, line: 208, baseType: !47, size: 8, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !126, line: 211, baseType: !47, size: 8, offset: 168)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !125, file: !126, line: 218, baseType: !47, size: 8, offset: 176)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !125, file: !126, line: 221, baseType: !47, size: 8, offset: 184)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !99, file: !6, line: 294, baseType: !141, size: 64, offset: 1536)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!119, !98, !124, !57}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !99, file: !6, line: 299, baseType: !146, size: 64, offset: 1600)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!119, !98, !124}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !99, file: !6, line: 305, baseType: !151, size: 64, offset: 1664)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!119, !98, !124, !84}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !99, file: !6, line: 310, baseType: !156, size: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !98}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !99, file: !6, line: 319, baseType: !156, size: 64, offset: 1792)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !6, line: 323, baseType: !46, size: 64, offset: 1856)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !99, file: !6, line: 325, baseType: !163, size: 64, offset: 1920)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 1)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !99, file: !6, line: 332, baseType: !131, size: 16, offset: 1984)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !99, file: !6, line: 335, baseType: !131, size: 16, offset: 2000)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !99, file: !6, line: 338, baseType: !131, size: 16, offset: 2016)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !99, file: !6, line: 341, baseType: !170, size: 48, offset: 2032)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 48, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 6)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !99, file: !6, line: 343, baseType: !47, size: 8, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !6, line: 345, baseType: !47, size: 8, offset: 2088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !6, line: 347, baseType: !176, size: 16, offset: 2096)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 16, elements: !178)
!177 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!178 = !{!179}
!179 = !DISubrange(count: 2)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !99, file: !6, line: 350, baseType: !47, size: 8, offset: 2112)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !99, file: !6, line: 353, baseType: !47, size: 8, offset: 2120)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !99, file: !6, line: 357, baseType: !47, size: 8, offset: 2128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !99, file: !6, line: 377, baseType: !184, size: 64, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!119, !98, !84, !5}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_nsc_reason_t", file: !6, line: 564, baseType: !131)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_ext_callback_args_t", file: !6, line: 634, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !6, line: 594, size: 192, elements: !193)
!193 = !{!194, !198, !202, !208, !213}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "link_changed", scope: !192, file: !6, line: 601, baseType: !195, size: 8)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_changed_s", file: !6, line: 597, size: 8, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !6, line: 600, baseType: !47, size: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "status_changed", scope: !192, file: !6, line: 607, baseType: !199, size: 8)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "status_changed_s", file: !6, line: 603, size: 8, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !199, file: !6, line: 606, baseType: !47, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_changed", scope: !192, file: !6, line: 615, baseType: !203, size: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv4_changed_s", file: !6, line: 609, size: 192, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "old_address", scope: !203, file: !6, line: 612, baseType: !64, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "old_netmask", scope: !203, file: !6, line: 613, baseType: !64, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "old_gw", scope: !203, file: !6, line: 614, baseType: !64, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_set", scope: !192, file: !6, line: 623, baseType: !209, size: 128)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_set_s", file: !6, line: 617, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addr_index", scope: !209, file: !6, line: 620, baseType: !120, size: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "old_address", scope: !209, file: !6, line: 622, baseType: !64, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_addr_state_changed", scope: !192, file: !6, line: 633, baseType: !214, size: 128)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_addr_state_changed_s", file: !6, line: 625, size: 128, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "addr_index", scope: !214, file: !6, line: 628, baseType: !120, size: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "old_state", scope: !214, file: !6, line: 630, baseType: !47, size: 8, offset: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !214, file: !6, line: 632, baseType: !64, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !6, line: 651, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "netif_list", scope: !2, file: !3, line: 110, type: !98, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "netif_default", scope: !2, file: !3, line: 112, type: !98, isLocal: false, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "__str", scope: !227, file: !228, line: 198, type: !246, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "uk_pr_crit", scope: !228, file: !228, line: 194, type: !229, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !233)
!228 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, null}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!233 = !{!234, !235}
!234 = !DILocalVariable(name: "fmt", arg: 1, scope: !227, file: !228, line: 194, type: !231)
!235 = !DILocalVariable(name: "argp", scope: !227, file: !228, line: 196, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !237, line: 32, baseType: !238)
!237 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 192, elements: !164)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !241)
!241 = !{!242, !243, !244, !245}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !240, file: !3, line: 196, baseType: !7, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !240, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !240, file: !3, line: 196, baseType: !46, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !240, file: !3, line: 196, baseType: !46, size: 64, offset: 128)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 64, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 8)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "__str", scope: !227, file: !228, line: 198, type: !246, isLocal: true, isDefinition: true)
!251 = !{i32 2, !"Dwarf Version", i32 4}
!252 = !{i32 2, !"Debug Info Version", i32 3}
!253 = !{i32 1, !"wchar_size", i32 4}
!254 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!255 = distinct !DISubprogram(name: "netif_init", scope: !3, file: !3, line: 177, type: !256, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !258)
!256 = !DISubroutineType(types: !257)
!257 = !{null}
!258 = !{}
!259 = !DILocation(line: 205, column: 1, scope: !255)
!260 = distinct !DISubprogram(name: "netif_input", scope: !3, file: !3, line: 217, type: !117, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !261)
!261 = !{!262, !263}
!262 = !DILocalVariable(name: "p", arg: 1, scope: !260, file: !3, line: 217, type: !124)
!263 = !DILocalVariable(name: "inp", arg: 2, scope: !260, file: !3, line: 217, type: !98)
!264 = !DILocation(line: 217, column: 26, scope: !260)
!265 = !DILocation(line: 217, column: 43, scope: !260)
!266 = !DILocation(line: 221, column: 3, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 221, column: 3)
!268 = distinct !DILexicalBlock(scope: !260, file: !3, line: 221, column: 3)
!269 = !DILocation(line: 221, column: 3, scope: !268)
!270 = !DILocation(line: 221, column: 3, scope: !271)
!271 = distinct !DILexicalBlock(scope: !272, file: !3, line: 221, column: 3)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 221, column: 3)
!273 = !DILocation(line: 221, column: 3, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 221, column: 3)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 221, column: 3)
!276 = distinct !DILexicalBlock(scope: !271, file: !3, line: 221, column: 3)
!277 = !DILocation(line: 222, column: 3, scope: !278)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 222, column: 3)
!279 = distinct !DILexicalBlock(scope: !260, file: !3, line: 222, column: 3)
!280 = !DILocation(line: 222, column: 3, scope: !279)
!281 = !DILocation(line: 222, column: 3, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 222, column: 3)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 222, column: 3)
!284 = !DILocation(line: 222, column: 3, scope: !285)
!285 = distinct !DILexicalBlock(scope: !286, file: !3, line: 222, column: 3)
!286 = distinct !DILexicalBlock(scope: !287, file: !3, line: 222, column: 3)
!287 = distinct !DILexicalBlock(scope: !282, file: !3, line: 222, column: 3)
!288 = !DILocation(line: 225, column: 12, scope: !289)
!289 = distinct !DILexicalBlock(scope: !260, file: !3, line: 225, column: 7)
!290 = !{!291, !293, i64 261}
!291 = !{!"netif", !292, i64 0, !295, i64 8, !295, i64 32, !295, i64 56, !293, i64 80, !293, i64 152, !293, i64 156, !293, i64 168, !292, i64 184, !292, i64 192, !292, i64 200, !292, i64 208, !292, i64 216, !292, i64 224, !292, i64 232, !293, i64 240, !296, i64 248, !296, i64 250, !296, i64 252, !293, i64 254, !293, i64 260, !293, i64 261, !293, i64 262, !293, i64 264, !293, i64 265, !293, i64 266, !292, i64 272}
!292 = !{!"any pointer", !293, i64 0}
!293 = !{!"omnipotent char", !294, i64 0}
!294 = !{!"Simple C/C++ TBAA"}
!295 = !{!"ip_addr", !293, i64 0, !293, i64 20}
!296 = !{!"short", !293, i64 0}
!297 = !DILocation(line: 225, column: 18, scope: !289)
!298 = !DILocation(line: 225, column: 7, scope: !260)
!299 = !DILocation(line: 226, column: 12, scope: !300)
