; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !36, !74, !77, !81, !64, !82, !113, !114, !115, !125, !136, !146, !155}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !8, line: 82, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !8, line: 76, size: 768, elements: !10)
!10 = !{!11, !42, !43, !72, !73}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 77, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !8, line: 65, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !8, line: 58, size: 384, elements: !15)
!15 = !{!16, !27, !31, !32, !37, !41}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !14, file: !8, line: 59, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !25}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !21, line: 60, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !14, file: !8, line: 60, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !4, !25}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !14, file: !8, line: 61, baseType: !28, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !14, file: !8, line: 62, baseType: !33, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !4, !25, !25}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !14, file: !8, line: 63, baseType: !38, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !4, !4}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !14, file: !8, line: 64, baseType: !38, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !9, file: !8, line: 78, baseType: !4, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !9, file: !8, line: 79, baseType: !44, size: 512, offset: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !70)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !8, line: 74, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !8, line: 69, size: 256, elements: !47)
!47 = !{!48, !67, !68, !69}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !8, line: 70, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !8, line: 56, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !8, line: 47, size: 192, elements: !53)
!53 = !{!54, !55, !65}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !52, file: !8, line: 48, baseType: !4, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !52, file: !8, line: 54, baseType: !56, size: 64, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !8, line: 49, size: 64, elements: !57)
!57 = !{!58, !59, !60, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !56, file: !8, line: 50, baseType: !4, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !56, file: !8, line: 51, baseType: !20, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !56, file: !8, line: 52, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 56, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 103, baseType: !5)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !56, file: !8, line: 53, baseType: !64, size: 64)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !8, line: 55, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !8, line: 71, baseType: !24, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !46, file: !8, line: 72, baseType: !24, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !46, file: !8, line: 73, baseType: !24, size: 64, offset: 192)
!70 = !{!71}
!71 = !DISubrange(count: 2)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !9, file: !8, line: 80, baseType: !5, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !9, file: !8, line: 81, baseType: !24, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 40, baseType: !79)
!78 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !80, line: 129, baseType: !24)
!80 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !84, line: 829, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !84, line: 826, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !85, file: !84, line: 827, baseType: !6, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !85, file: !84, line: 828, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !84, line: 824, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !84, line: 820, size: 256, elements: !92)
!92 = !{!93, !110, !111, !112}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !91, file: !84, line: 821, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !84, line: 810, size: 192, elements: !96)
!96 = !{!97, !100, !101, !102}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !95, file: !84, line: 811, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !99, line: 43, baseType: !81)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !95, file: !84, line: 812, baseType: !64, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !95, file: !84, line: 813, baseType: !94, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !95, file: !84, line: 817, baseType: !103, offset: 192)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, elements: !108)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !84, line: 814, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !104, file: !84, line: 815, baseType: !94, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !104, file: !84, line: 816, baseType: !24, size: 64, offset: 64)
!108 = !{!109}
!109 = !DISubrange(count: -1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !91, file: !84, line: 821, baseType: !94, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !84, line: 822, baseType: !24, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !91, file: !84, line: 823, baseType: !36, size: 32, offset: 192)
!113 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !84, line: 622, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !84, line: 614, size: 128, elements: !118)
!118 = !{!119, !121, !122, !123, !124}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !84, line: 615, baseType: !120, size: 4, flags: DIFlagBitField, extraData: i64 0)
!120 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !117, file: !84, line: 616, baseType: !120, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !117, file: !84, line: 617, baseType: !120, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !117, file: !84, line: 620, baseType: !36, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !117, file: !84, line: 621, baseType: !4, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !99, line: 51, size: 24, elements: !127)
!127 = !{!128, !132, !133, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !99, line: 52, baseType: !129, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 24, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 43, baseType: !131)
!131 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !126, file: !99, line: 53, baseType: !129, size: 8, offset: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !99, line: 54, baseType: !131, size: 8, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !126, file: !99, line: 55, baseType: !135, offset: 24)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, elements: !108)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !99, line: 57, size: 40, elements: !138)
!138 = !{!139, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !137, file: !99, line: 58, baseType: !140, size: 16)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 36, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 57, baseType: !142)
!142 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !137, file: !99, line: 59, baseType: !140, size: 16, offset: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !99, line: 60, baseType: !131, size: 8, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !137, file: !99, line: 61, baseType: !135, offset: 40)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !99, line: 63, size: 72, elements: !148)
!148 = !{!149, !152, !153, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !147, file: !99, line: 64, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 48, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 79, baseType: !120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !147, file: !99, line: 65, baseType: !150, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !99, line: 66, baseType: !131, size: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !147, file: !99, line: 67, baseType: !135, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !99, line: 69, size: 136, elements: !157)
!157 = !{!158, !159, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !99, line: 70, baseType: !20, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !156, file: !99, line: 71, baseType: !20, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !99, line: 72, baseType: !131, size: 8, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !156, file: !99, line: 73, baseType: !135, offset: 136)
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!166 = distinct !DISubprogram(name: "createObject", scope: !1, file: !1, line: 41, type: !167, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!115, !36, !4}
!169 = !{!170, !171, !172}
!170 = !DILocalVariable(name: "type", arg: 1, scope: !166, file: !1, line: 41, type: !36)
!171 = !DILocalVariable(name: "ptr", arg: 2, scope: !166, file: !1, line: 41, type: !4)
!172 = !DILocalVariable(name: "o", scope: !166, file: !1, line: 42, type: !115)
!173 = !DILocation(line: 41, column: 24, scope: !166)
!174 = !DILocation(line: 41, column: 36, scope: !166)
!175 = !DILocation(line: 42, column: 15, scope: !166)
!176 = !DILocation(line: 42, column: 11, scope: !166)
!177 = !DILocation(line: 43, column: 8, scope: !166)
!178 = !DILocation(line: 43, column: 13, scope: !166)
!179 = !DILocation(line: 44, column: 17, scope: !166)
!180 = !DILocation(line: 45, column: 8, scope: !166)
!181 = !DILocation(line: 45, column: 12, scope: !166)
!182 = !{!183, !187, i64 8}
!183 = !{!"redisObject", !184, i64 0, !184, i64 0, !184, i64 1, !184, i64 4, !187, i64 8}
!184 = !{!"int", !185, i64 0}
!185 = !{!"omnipotent char", !186, i64 0}
!186 = !{!"Simple C/C++ TBAA"}
!187 = !{!"any pointer", !185, i64 0}
!188 = !DILocation(line: 46, column: 8, scope: !166)
!189 = !DILocation(line: 46, column: 17, scope: !166)
!190 = !{!183, !184, i64 4}
!191 = !DILocation(line: 50, column: 16, scope: !192)
!192 = distinct !DILexicalBlock(scope: !166, file: !1, line: 50, column: 9)
!193 = !{!194, !184, i64 2712}
!194 = !{!"redisServer", !184, i64 0, !187, i64 8, !187, i64 16, !187, i64 24, !184, i64 32, !184, i64 36, !184, i64 40, !187, i64 48, !187, i64 56, !187, i64 64, !187, i64 72, !184, i64 80, !184, i64 84, !184, i64 88, !184, i64 92, !187, i64 96, !187, i64 104, !184, i64 112, !184, i64 116, !185, i64 120, !184, i64 164, !195, i64 168, !184, i64 176, !187, i64 184, !187, i64 192, !187, i64 200, !185, i64 208, !184, i64 216, !184, i64 220, !185, i64 224, !184, i64 352, !187, i64 360, !184, i64 368, !185, i64 372, !184, i64 436, !184, i64 440, !185, i64 444, !184, i64 508, !187, i64 512, !187, i64 520, !187, i64 528, !187, i64 536, !187, i64 544, !187, i64 552, !187, i64 560, !184, i64 568, !196, i64 576, !185, i64 584, !187, i64 840, !195, i64 848, !184, i64 856, !184, i64 860, !195, i64 864, !195, i64 872, !195, i64 880, !195, i64 888, !187, i64 896, !187, i64 904, !187, i64 912, !187, i64 920, !187, i64 928, !187, i64 936, !187, i64 944, !187, i64 952, !187, i64 960, !187, i64 968, !187, i64 976, !187, i64 984, !187, i64 992, !195, i64 1000, !196, i64 1008, !196, i64 1016, !196, i64 1024, !197, i64 1032, !196, i64 1040, !196, i64 1048, !196, i64 1056, !196, i64 1064, !196, i64 1072, !196, i64 1080, !196, i64 1088, !196, i64 1096, !196, i64 1104, !195, i64 1112, !196, i64 1120, !197, i64 1128, !196, i64 1136, !196, i64 1144, !196, i64 1152, !196, i64 1160, !187, i64 1168, !196, i64 1176, !196, i64 1184, !195, i64 1192, !198, i64 1200, !196, i64 1240, !196, i64 1248, !195, i64 1256, !195, i64 1264, !185, i64 1272, !184, i64 1728, !184, i64 1732, !184, i64 1736, !184, i64 1740, !184, i64 1744, !195, i64 1752, !184, i64 1760, !184, i64 1764, !184, i64 1768, !184, i64 1772, !195, i64 1776, !195, i64 1784, !184, i64 1792, !184, i64 1796, !184, i64 1800, !184, i64 1804, !185, i64 1808, !184, i64 1880, !184, i64 1884, !187, i64 1888, !184, i64 1896, !184, i64 1900, !195, i64 1904, !195, i64 1912, !195, i64 1920, !195, i64 1928, !184, i64 1936, !184, i64 1940, !187, i64 1944, !187, i64 1952, !184, i64 1960, !184, i64 1964, !195, i64 1968, !195, i64 1976, !195, i64 1984, !195, i64 1992, !184, i64 2000, !195, i64 2008, !184, i64 2016, !184, i64 2020, !184, i64 2024, !184, i64 2028, !184, i64 2032, !184, i64 2036, !184, i64 2040, !184, i64 2044, !184, i64 2048, !184, i64 2052, !184, i64 2056, !184, i64 2060, !184, i64 2064, !187, i64 2072, !196, i64 2080, !196, i64 2088, !184, i64 2096, !187, i64 2104, !184, i64 2112, !187, i64 2120, !184, i64 2128, !184, i64 2132, !195, i64 2136, !195, i64 2144, !195, i64 2152, !195, i64 2160, !184, i64 2168, !184, i64 2172, !184, i64 2176, !184, i64 2180, !184, i64 2184, !184, i64 2188, !185, i64 2192, !199, i64 2200, !200, i64 2224, !187, i64 2240, !184, i64 2248, !187, i64 2256, !184, i64 2264, !185, i64 2268, !185, i64 2309, !196, i64 2352, !196, i64 2360, !184, i64 2368, !184, i64 2372, !187, i64 2376, !196, i64 2384, !196, i64 2392, !196, i64 2400, !196, i64 2408, !195, i64 2416, !195, i64 2424, !184, i64 2432, !184, i64 2436, !184, i64 2440, !184, i64 2444, !184, i64 2448, !187, i64 2456, !187, i64 2464, !184, i64 2472, !184, i64 2476, !187, i64 2480, !187, i64 2488, !184, i64 2496, !184, i64 2500, !195, i64 2504, !195, i64 2512, !195, i64 2520, !184, i64 2528, !184, i64 2532, !187, i64 2536, !195, i64 2544, !184, i64 2552, !184, i64 2556, !184, i64 2560, !195, i64 2568, !184, i64 2576, !184, i64 2580, !184, i64 2584, !187, i64 2592, !185, i64 2600, !196, i64 2648, !184, i64 2656, !187, i64 2664, !187, i64 2672, !184, i64 2680, !187, i64 2688, !184, i64 2696, !184, i64 2700, !196, i64 2704, !184, i64 2712, !184, i64 2716, !184, i64 2720, !184, i64 2724, !196, i64 2728, !184, i64 2736, !185, i64 2740, !187, i64 2768, !187, i64 2776, !184, i64 2784, !184, i64 2788, !184, i64 2792, !184, i64 2796, !195, i64 2800, !195, i64 2808, !195, i64 2816, !195, i64 2824, !195, i64 2832, !195, i64 2840, !195, i64 2848, !195, i64 2856, !184, i64 2864, !184, i64 2868, !195, i64 2872, !195, i64 2880, !184, i64 2888, !196, i64 2896, !187, i64 2904, !187, i64 2912, !184, i64 2920, !184, i64 2924, !196, i64 2928, !187, i64 2936, !187, i64 2944, !184, i64 2952, !184, i64 2956, !184, i64 2960, !184, i64 2964, !187, i64 2968, !184, i64 2976, !184, i64 2980, !184, i64 2984, !187, i64 2992, !187, i64 3000, !187, i64 3008, !187, i64 3016, !196, i64 3024, !196, i64 3032, !196, i64 3040, !184, i64 3048, !184, i64 3052, !184, i64 3056, !184, i64 3060, !184, i64 3064, !184, i64 3068, !184, i64 3072, !184, i64 3076, !184, i64 3080, !184, i64 3084, !184, i64 3088, !196, i64 3096, !187, i64 3104, !187, i64 3112, !187, i64 3120, !184, i64 3128, !184, i64 3132, !184, i64 3136, !195, i64 3144, !187, i64 3152, !187, i64 3160, !187, i64 3168}
!195 = !{!"long", !185, i64 0}
!196 = !{!"long long", !185, i64 0}
!197 = !{!"double", !185, i64 0}
!198 = !{!"malloc_stats", !195, i64 0, !195, i64 8, !195, i64 16, !195, i64 24, !195, i64 32}
!199 = !{!"", !184, i64 0, !195, i64 8, !196, i64 16}
!200 = !{!"redisOpArray", !187, i64 0, !184, i64 8}
!201 = !DILocation(line: 50, column: 33, scope: !192)
!202 = !DILocation(line: 50, column: 9, scope: !166)
!203 = !DILocation(line: 51, column: 19, scope: !204)
!204 = distinct !DILexicalBlock(scope: !192, file: !1, line: 50, column: 55)
!205 = !DILocation(line: 51, column: 18, scope: !204)
!206 = !DILocation(line: 51, column: 16, scope: !204)
!207 = !DILocation(line: 52, column: 5, scope: !204)
!208 = !DILocation(line: 53, column: 18, scope: !209)
!209 = distinct !DILexicalBlock(scope: !192, file: !1, line: 52, column: 12)
!210 = !DILocation(line: 53, column: 16, scope: !209)
!211 = !DILocation(line: 0, scope: !204)
!212 = !DILocation(line: 55, column: 5, scope: !166)
!213 = distinct !DISubprogram(name: "makeObjectShared", scope: !1, file: !1, line: 69, type: !214, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{!115, !115}
!216 = !{!217}
!217 = !DILocalVariable(name: "o", arg: 1, scope: !213, file: !1, line: 69, type: !115)
!218 = !DILocation(line: 69, column: 30, scope: !213)
!219 = !DILocation(line: 70, column: 5, scope: !213)
!220 = !DILocation(line: 71, column: 17, scope: !213)
!221 = !DILocation(line: 72, column: 5, scope: !213)
!222 = distinct !DISubprogram(name: "createRawStringObject", scope: !1, file: !1, line: 77, type: !223, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!115, !74, !77}
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "ptr", arg: 1, scope: !222, file: !1, line: 77, type: !74)
!227 = !DILocalVariable(name: "len", arg: 2, scope: !222, file: !1, line: 77, type: !77)
!228 = !DILocation(line: 77, column: 41, scope: !222)
!229 = !DILocation(line: 77, column: 53, scope: !222)
!230 = !DILocation(line: 78, column: 37, scope: !222)
!231 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !232)
!232 = distinct !DILocation(line: 78, column: 12, scope: !222)
!233 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !232)
!234 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !232)
!235 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !232)
!236 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !232)
!237 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !232)
!238 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !232)
!239 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !232)
!240 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !232)
!241 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !232)
!242 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !232)
!243 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !232)
!244 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !232)
!245 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !232)
!246 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !232)
!247 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !232)
!248 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !232)
!249 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !232)
!250 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !232)
!251 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !232)
!252 = !DILocation(line: 0, scope: !204, inlinedAt: !232)
!253 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !232)
!254 = !DILocation(line: 78, column: 5, scope: !222)
!255 = distinct !DISubprogram(name: "createEmbeddedStringObject", scope: !1, file: !1, line: 84, type: !223, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DILocalVariable(name: "ptr", arg: 1, scope: !255, file: !1, line: 84, type: !74)
!258 = !DILocalVariable(name: "len", arg: 2, scope: !255, file: !1, line: 84, type: !77)
!259 = !DILocalVariable(name: "o", scope: !255, file: !1, line: 85, type: !115)
!260 = !DILocalVariable(name: "sh", scope: !255, file: !1, line: 86, type: !125)
!261 = !DILocation(line: 84, column: 46, scope: !255)
!262 = !DILocation(line: 84, column: 58, scope: !255)
!263 = !DILocation(line: 85, column: 62, scope: !255)
!264 = !DILocation(line: 85, column: 15, scope: !255)
!265 = !DILocation(line: 85, column: 11, scope: !255)
!266 = !DILocation(line: 86, column: 35, scope: !255)
!267 = !DILocation(line: 86, column: 21, scope: !255)
!268 = !DILocation(line: 88, column: 8, scope: !255)
!269 = !DILocation(line: 88, column: 13, scope: !255)
!270 = !DILocation(line: 89, column: 17, scope: !255)
!271 = !DILocation(line: 90, column: 16, scope: !255)
!272 = !DILocation(line: 90, column: 8, scope: !255)
!273 = !DILocation(line: 90, column: 12, scope: !255)
!274 = !DILocation(line: 91, column: 8, scope: !255)
!275 = !DILocation(line: 91, column: 17, scope: !255)
!276 = !DILocation(line: 92, column: 16, scope: !277)
!277 = distinct !DILexicalBlock(scope: !255, file: !1, line: 92, column: 9)
!278 = !DILocation(line: 92, column: 33, scope: !277)
!279 = !DILocation(line: 92, column: 9, scope: !255)
!280 = !DILocation(line: 93, column: 19, scope: !281)
!281 = distinct !DILexicalBlock(scope: !277, file: !1, line: 92, column: 55)
!282 = !DILocation(line: 93, column: 18, scope: !281)
!283 = !DILocation(line: 93, column: 16, scope: !281)
!284 = !DILocation(line: 94, column: 5, scope: !281)
!285 = !DILocation(line: 95, column: 18, scope: !286)
!286 = distinct !DILexicalBlock(scope: !277, file: !1, line: 94, column: 12)
!287 = !DILocation(line: 95, column: 16, scope: !286)
!288 = !DILocation(line: 0, scope: !281)
!289 = !DILocation(line: 98, column: 15, scope: !255)
!290 = !DILocation(line: 98, column: 13, scope: !255)
!291 = !{!185, !185, i64 0}
!292 = !DILocation(line: 99, column: 9, scope: !255)
!293 = !DILocation(line: 99, column: 15, scope: !255)
!294 = !DILocation(line: 100, column: 9, scope: !255)
!295 = !DILocation(line: 100, column: 15, scope: !255)
!296 = !DILocation(line: 101, column: 16, scope: !297)
!297 = distinct !DILexicalBlock(scope: !255, file: !1, line: 101, column: 9)
!298 = !{!187, !187, i64 0}
!299 = !DILocation(line: 101, column: 13, scope: !297)
!300 = !DILocation(line: 101, column: 9, scope: !255)
!301 = !DILocation(line: 102, column: 9, scope: !297)
!302 = !DILocation(line: 102, column: 22, scope: !297)
!303 = !DILocation(line: 103, column: 14, scope: !304)
!304 = distinct !DILexicalBlock(scope: !297, file: !1, line: 103, column: 14)
!305 = !DILocation(line: 103, column: 14, scope: !297)
!306 = !DILocation(line: 104, column: 9, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !1, line: 103, column: 19)
!308 = !DILocation(line: 105, column: 9, scope: !307)
!309 = !DILocation(line: 105, column: 22, scope: !307)
!310 = !DILocation(line: 106, column: 5, scope: !307)
!311 = !DILocation(line: 107, column: 29, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !1, line: 106, column: 12)
!313 = !DILocation(line: 107, column: 9, scope: !312)
!314 = !DILocation(line: 109, column: 5, scope: !255)
!315 = distinct !DISubprogram(name: "createStringObject", scope: !1, file: !1, line: 119, type: !223, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !316)
!316 = !{!317, !318}
!317 = !DILocalVariable(name: "ptr", arg: 1, scope: !315, file: !1, line: 119, type: !74)
!318 = !DILocalVariable(name: "len", arg: 2, scope: !315, file: !1, line: 119, type: !77)
!319 = !DILocation(line: 119, column: 38, scope: !315)
!320 = !DILocation(line: 119, column: 50, scope: !315)
!321 = !DILocation(line: 120, column: 13, scope: !322)
!322 = distinct !DILexicalBlock(scope: !315, file: !1, line: 120, column: 9)
!323 = !DILocation(line: 120, column: 9, scope: !315)
!324 = !DILocation(line: 121, column: 16, scope: !322)
!325 = !DILocation(line: 121, column: 9, scope: !322)
!326 = !DILocation(line: 77, column: 41, scope: !222, inlinedAt: !327)
!327 = distinct !DILocation(line: 123, column: 16, scope: !322)
!328 = !DILocation(line: 77, column: 53, scope: !222, inlinedAt: !327)
!329 = !DILocation(line: 78, column: 37, scope: !222, inlinedAt: !327)
!330 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !331)
!331 = distinct !DILocation(line: 78, column: 12, scope: !222, inlinedAt: !327)
!332 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !331)
!333 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !331)
!334 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !331)
!335 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !331)
!336 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !331)
!337 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !331)
!338 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !331)
!339 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !331)
!340 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !331)
!341 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !331)
!342 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !331)
!343 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !331)
!344 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !331)
!345 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !331)
!346 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !331)
!347 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !331)
!348 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !331)
!349 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !331)
!350 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !331)
!351 = !DILocation(line: 0, scope: !204, inlinedAt: !331)
!352 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !331)
!353 = !DILocation(line: 78, column: 5, scope: !222, inlinedAt: !327)
!354 = !DILocation(line: 123, column: 9, scope: !322)
!355 = !DILocation(line: 0, scope: !322)
!356 = !DILocation(line: 124, column: 1, scope: !315)
!357 = distinct !DISubprogram(name: "createStringObjectFromLongLongWithOptions", scope: !1, file: !1, line: 133, type: !358, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !361)
!358 = !DISubroutineType(types: !359)
!359 = !{!115, !360, !36}
!360 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!361 = !{!362, !363, !364}
!362 = !DILocalVariable(name: "value", arg: 1, scope: !357, file: !1, line: 133, type: !360)
!363 = !DILocalVariable(name: "valueobj", arg: 2, scope: !357, file: !1, line: 133, type: !36)
!364 = !DILocalVariable(name: "o", scope: !357, file: !1, line: 134, type: !115)
!365 = !DILocation(line: 133, column: 59, scope: !357)
!366 = !DILocation(line: 133, column: 70, scope: !357)
!367 = !DILocation(line: 136, column: 16, scope: !368)
!368 = distinct !DILexicalBlock(scope: !357, file: !1, line: 136, column: 9)
!369 = !{!194, !196, i64 2704}
!370 = !DILocation(line: 136, column: 26, scope: !368)
!371 = !DILocation(line: 136, column: 31, scope: !368)
!372 = !DILocation(line: 137, column: 18, scope: !368)
!373 = !DILocation(line: 137, column: 35, scope: !368)
!374 = !DILocation(line: 136, column: 9, scope: !357)
!375 = !DILocation(line: 142, column: 5, scope: !376)
!376 = distinct !DILexicalBlock(scope: !368, file: !1, line: 138, column: 5)
!377 = !DILocation(line: 144, column: 20, scope: !378)
!378 = distinct !DILexicalBlock(scope: !357, file: !1, line: 144, column: 9)
!379 = !DILocation(line: 144, column: 63, scope: !378)
!380 = !DILocation(line: 145, column: 22, scope: !381)
!381 = distinct !DILexicalBlock(scope: !378, file: !1, line: 144, column: 69)
!382 = !DILocalVariable(name: "o", arg: 1, scope: !383, file: !1, line: 349, type: !115)
!383 = distinct !DISubprogram(name: "incrRefCount", scope: !1, file: !1, line: 349, type: !384, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !115}
!386 = !{!382}
!387 = !DILocation(line: 349, column: 25, scope: !383, inlinedAt: !388)
!388 = distinct !DILocation(line: 145, column: 9, scope: !381)
!389 = !DILocation(line: 350, column: 12, scope: !390, inlinedAt: !388)
!390 = distinct !DILexicalBlock(scope: !383, file: !1, line: 350, column: 9)
!391 = !DILocation(line: 350, column: 21, scope: !390, inlinedAt: !388)
!392 = !DILocation(line: 350, column: 9, scope: !383, inlinedAt: !388)
!393 = !DILocation(line: 350, column: 56, scope: !390, inlinedAt: !388)
!394 = !DILocation(line: 350, column: 45, scope: !390, inlinedAt: !388)
!395 = !DILocation(line: 351, column: 1, scope: !383, inlinedAt: !388)
!396 = !DILocation(line: 134, column: 11, scope: !357)
!397 = !DILocation(line: 147, column: 5, scope: !381)
!398 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !399)
!399 = distinct !DILocation(line: 149, column: 17, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 148, column: 53)
!401 = distinct !DILexicalBlock(scope: !402, file: !1, line: 148, column: 13)
!402 = distinct !DILexicalBlock(scope: !378, file: !1, line: 147, column: 12)
!403 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !399)
!404 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !399)
!405 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !399)
!406 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !399)
!407 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !399)
!408 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !399)
!409 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !399)
!410 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !399)
!411 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !399)
!412 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !399)
!413 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !399)
!414 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !399)
!415 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !399)
!416 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !399)
!417 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !399)
!418 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !399)
!419 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !399)
!420 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !399)
!421 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !399)
!422 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !399)
!423 = !DILocation(line: 150, column: 25, scope: !400)
!424 = !DILocation(line: 151, column: 22, scope: !400)
!425 = !DILocation(line: 151, column: 20, scope: !400)
!426 = !DILocation(line: 152, column: 9, scope: !400)
!427 = !DILocation(line: 0, scope: !428)
!428 = distinct !DILexicalBlock(scope: !401, file: !1, line: 152, column: 16)
!429 = !DILocation(line: 156, column: 5, scope: !357)
!430 = !DILocation(line: 349, column: 25, scope: !383)
!431 = !DILocation(line: 350, column: 12, scope: !390)
!432 = !DILocation(line: 350, column: 21, scope: !390)
!433 = !DILocation(line: 350, column: 9, scope: !383)
!434 = !DILocation(line: 350, column: 56, scope: !390)
!435 = !DILocation(line: 350, column: 45, scope: !390)
!436 = !DILocation(line: 351, column: 1, scope: !383)
!437 = distinct !DISubprogram(name: "createStringObjectFromLongLong", scope: !1, file: !1, line: 161, type: !438, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !440)
!438 = !DISubroutineType(types: !439)
!439 = !{!115, !360}
!440 = !{!441}
!441 = !DILocalVariable(name: "value", arg: 1, scope: !437, file: !1, line: 161, type: !360)
!442 = !DILocation(line: 161, column: 48, scope: !437)
!443 = !DILocation(line: 162, column: 12, scope: !437)
!444 = !DILocation(line: 162, column: 5, scope: !437)
!445 = distinct !DISubprogram(name: "createStringObjectFromLongLongForValue", scope: !1, file: !1, line: 169, type: !438, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !446)
!446 = !{!447}
!447 = !DILocalVariable(name: "value", arg: 1, scope: !445, file: !1, line: 169, type: !360)
!448 = !DILocation(line: 169, column: 56, scope: !445)
!449 = !DILocation(line: 170, column: 12, scope: !445)
!450 = !DILocation(line: 170, column: 5, scope: !445)
!451 = distinct !DISubprogram(name: "createStringObjectFromLongDouble", scope: !1, file: !1, line: 179, type: !452, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !455)
!452 = !DISubroutineType(types: !453)
!453 = !{!115, !454, !36}
!454 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!455 = !{!456, !457, !458, !462}
!456 = !DILocalVariable(name: "value", arg: 1, scope: !451, file: !1, line: 179, type: !454)
!457 = !DILocalVariable(name: "humanfriendly", arg: 2, scope: !451, file: !1, line: 179, type: !36)
!458 = !DILocalVariable(name: "buf", scope: !451, file: !1, line: 180, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 40960, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 5120)
!462 = !DILocalVariable(name: "len", scope: !451, file: !1, line: 181, type: !36)
!463 = !DILocation(line: 179, column: 52, scope: !451)
!464 = !DILocation(line: 179, column: 63, scope: !451)
!465 = !DILocation(line: 180, column: 5, scope: !451)
!466 = !DILocation(line: 180, column: 10, scope: !451)
!467 = !DILocation(line: 181, column: 15, scope: !451)
!468 = !DILocation(line: 181, column: 9, scope: !451)
!469 = !DILocation(line: 182, column: 35, scope: !451)
!470 = !DILocation(line: 182, column: 12, scope: !451)
!471 = !DILocation(line: 183, column: 1, scope: !451)
!472 = !DILocation(line: 182, column: 5, scope: !451)
!473 = distinct !DISubprogram(name: "dupStringObject", scope: !1, file: !1, line: 193, type: !474, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !478)
!474 = !DISubroutineType(types: !475)
!475 = !{!115, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!478 = !{!479, !480}
!479 = !DILocalVariable(name: "o", arg: 1, scope: !473, file: !1, line: 193, type: !476)
!480 = !DILocalVariable(name: "d", scope: !473, file: !1, line: 194, type: !115)
!481 = !DILocation(line: 193, column: 35, scope: !473)
!482 = !DILocation(line: 196, column: 5, scope: !473)
!483 = !DILocation(line: 198, column: 15, scope: !473)
!484 = !DILocation(line: 198, column: 5, scope: !473)
!485 = !DILocation(line: 200, column: 41, scope: !486)
!486 = distinct !DILexicalBlock(scope: !473, file: !1, line: 198, column: 25)
!487 = !DILocalVariable(name: "s", arg: 1, scope: !488, file: !99, line: 87, type: !493)
!488 = distinct !DISubprogram(name: "sdslen", scope: !99, file: !99, line: 87, type: !489, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !494)
!489 = !DISubroutineType(types: !490)
!490 = !{!491, !493}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !492, line: 58, baseType: !24)
!492 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!494 = !{!487, !495}
!495 = !DILocalVariable(name: "flags", scope: !488, file: !99, line: 88, type: !131)
!496 = !DILocation(line: 87, column: 39, scope: !488, inlinedAt: !497)
!497 = distinct !DILocation(line: 200, column: 45, scope: !486)
!498 = !DILocation(line: 88, column: 27, scope: !488, inlinedAt: !497)
!499 = !DILocation(line: 88, column: 19, scope: !488, inlinedAt: !497)
!500 = !DILocation(line: 89, column: 5, scope: !488, inlinedAt: !497)
!501 = !DILocation(line: 91, column: 20, scope: !502, inlinedAt: !497)
!502 = distinct !DILexicalBlock(scope: !488, file: !99, line: 89, column: 33)
!503 = !DILocation(line: 91, column: 13, scope: !502, inlinedAt: !497)
!504 = !DILocation(line: 93, column: 20, scope: !502, inlinedAt: !497)
!505 = !DILocation(line: 93, column: 34, scope: !502, inlinedAt: !497)
!506 = !DILocation(line: 93, column: 13, scope: !502, inlinedAt: !497)
!507 = !DILocation(line: 95, column: 20, scope: !502, inlinedAt: !497)
!508 = !DILocation(line: 95, column: 35, scope: !502, inlinedAt: !497)
!509 = !{!510, !510, i64 0}
!510 = !{!"short", !185, i64 0}
!511 = !DILocation(line: 95, column: 13, scope: !502, inlinedAt: !497)
!512 = !DILocation(line: 97, column: 20, scope: !502, inlinedAt: !497)
!513 = !DILocation(line: 97, column: 35, scope: !502, inlinedAt: !497)
!514 = !{!184, !184, i64 0}
!515 = !DILocation(line: 97, column: 13, scope: !502, inlinedAt: !497)
!516 = !DILocation(line: 99, column: 20, scope: !502, inlinedAt: !497)
!517 = !DILocation(line: 99, column: 35, scope: !502, inlinedAt: !497)
!518 = !{!195, !195, i64 0}
!519 = !DILocation(line: 99, column: 13, scope: !502, inlinedAt: !497)
!520 = !DILocation(line: 0, scope: !502, inlinedAt: !497)
!521 = !DILocation(line: 102, column: 1, scope: !488, inlinedAt: !497)
!522 = !DILocation(line: 77, column: 41, scope: !222, inlinedAt: !523)
!523 = distinct !DILocation(line: 200, column: 16, scope: !486)
!524 = !DILocation(line: 77, column: 53, scope: !222, inlinedAt: !523)
!525 = !DILocation(line: 78, column: 37, scope: !222, inlinedAt: !523)
!526 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !527)
!527 = distinct !DILocation(line: 78, column: 12, scope: !222, inlinedAt: !523)
!528 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !527)
!529 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !527)
!530 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !527)
!531 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !527)
!532 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !527)
!533 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !527)
!534 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !527)
!535 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !527)
!536 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !527)
!537 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !527)
!538 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !527)
!539 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !527)
!540 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !527)
!541 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !527)
!542 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !527)
!543 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !527)
!544 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !527)
!545 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !527)
!546 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !527)
!547 = !DILocation(line: 0, scope: !204, inlinedAt: !527)
!548 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !527)
!549 = !DILocation(line: 78, column: 5, scope: !222, inlinedAt: !523)
!550 = !DILocation(line: 200, column: 9, scope: !486)
!551 = !DILocation(line: 202, column: 46, scope: !486)
!552 = !DILocation(line: 87, column: 39, scope: !488, inlinedAt: !553)
!553 = distinct !DILocation(line: 202, column: 50, scope: !486)
!554 = !DILocation(line: 88, column: 27, scope: !488, inlinedAt: !553)
!555 = !DILocation(line: 88, column: 19, scope: !488, inlinedAt: !553)
!556 = !DILocation(line: 89, column: 5, scope: !488, inlinedAt: !553)
!557 = !DILocation(line: 91, column: 20, scope: !502, inlinedAt: !553)
!558 = !DILocation(line: 91, column: 13, scope: !502, inlinedAt: !553)
!559 = !DILocation(line: 93, column: 20, scope: !502, inlinedAt: !553)
!560 = !DILocation(line: 93, column: 34, scope: !502, inlinedAt: !553)
!561 = !DILocation(line: 93, column: 13, scope: !502, inlinedAt: !553)
!562 = !DILocation(line: 95, column: 20, scope: !502, inlinedAt: !553)
!563 = !DILocation(line: 95, column: 35, scope: !502, inlinedAt: !553)
!564 = !DILocation(line: 95, column: 13, scope: !502, inlinedAt: !553)
!565 = !DILocation(line: 97, column: 20, scope: !502, inlinedAt: !553)
!566 = !DILocation(line: 97, column: 35, scope: !502, inlinedAt: !553)
!567 = !DILocation(line: 97, column: 13, scope: !502, inlinedAt: !553)
!568 = !DILocation(line: 99, column: 20, scope: !502, inlinedAt: !553)
!569 = !DILocation(line: 99, column: 35, scope: !502, inlinedAt: !553)
!570 = !DILocation(line: 99, column: 13, scope: !502, inlinedAt: !553)
!571 = !DILocation(line: 0, scope: !502, inlinedAt: !553)
!572 = !DILocation(line: 102, column: 1, scope: !488, inlinedAt: !553)
!573 = !DILocation(line: 202, column: 16, scope: !486)
!574 = !DILocation(line: 202, column: 9, scope: !486)
!575 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !576)
!576 = distinct !DILocation(line: 204, column: 13, scope: !486)
!577 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !576)
!578 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !576)
!579 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !576)
!580 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !576)
!581 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !576)
!582 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !576)
!583 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !576)
!584 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !576)
!585 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !576)
!586 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !576)
!587 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !576)
!588 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !576)
!589 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !576)
!590 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !576)
!591 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !576)
!592 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !576)
!593 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !576)
!594 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !576)
!595 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !576)
!596 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !576)
!597 = !DILocation(line: 194, column: 11, scope: !473)
!598 = !DILocation(line: 205, column: 21, scope: !486)
!599 = !DILocation(line: 206, column: 21, scope: !486)
!600 = !DILocation(line: 206, column: 16, scope: !486)
!601 = !DILocation(line: 207, column: 9, scope: !486)
!602 = !DILocation(line: 209, column: 9, scope: !486)
!603 = !DILocation(line: 0, scope: !486)
!604 = !DILocation(line: 212, column: 1, scope: !473)
!605 = distinct !DISubprogram(name: "createQuicklistObject", scope: !1, file: !1, line: 214, type: !606, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{!115}
!608 = !{!609, !637}
!609 = !DILocalVariable(name: "l", scope: !605, file: !1, line: 215, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !612, line: 80, baseType: !613)
!612 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !612, line: 73, size: 320, elements: !614)
!614 = !{!615, !632, !633, !634, !635, !636}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !613, file: !612, line: 74, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !612, line: 55, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !612, line: 44, size: 256, elements: !619)
!619 = !{!620, !622, !623, !625, !626, !627, !628, !629, !630, !631}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !618, file: !612, line: 45, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !618, file: !612, line: 46, baseType: !621, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !618, file: !612, line: 47, baseType: !624, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !618, file: !612, line: 48, baseType: !120, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !618, file: !612, line: 49, baseType: !120, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !618, file: !612, line: 50, baseType: !120, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !618, file: !612, line: 51, baseType: !120, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !618, file: !612, line: 52, baseType: !120, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !618, file: !612, line: 53, baseType: !120, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !618, file: !612, line: 54, baseType: !120, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !613, file: !612, line: 75, baseType: !616, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !613, file: !612, line: 76, baseType: !24, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !613, file: !612, line: 77, baseType: !24, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !613, file: !612, line: 78, baseType: !36, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !613, file: !612, line: 79, baseType: !120, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!637 = !DILocalVariable(name: "o", scope: !605, file: !1, line: 216, type: !115)
!638 = !DILocation(line: 215, column: 20, scope: !605)
!639 = !DILocation(line: 215, column: 16, scope: !605)
!640 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !641)
!641 = distinct !DILocation(line: 216, column: 15, scope: !605)
!642 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !641)
!643 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !641)
!644 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !641)
!645 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !641)
!646 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !641)
!647 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !641)
!648 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !641)
!649 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !641)
!650 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !641)
!651 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !641)
!652 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !641)
!653 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !641)
!654 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !641)
!655 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !641)
!656 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !641)
!657 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !641)
!658 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !641)
!659 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !641)
!660 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !641)
!661 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !641)
!662 = !DILocation(line: 216, column: 11, scope: !605)
!663 = !DILocation(line: 217, column: 17, scope: !605)
!664 = !DILocation(line: 218, column: 5, scope: !605)
!665 = distinct !DISubprogram(name: "createZiplistObject", scope: !1, file: !1, line: 221, type: !606, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !666)
!666 = !{!667, !668}
!667 = !DILocalVariable(name: "zl", scope: !665, file: !1, line: 222, type: !624)
!668 = !DILocalVariable(name: "o", scope: !665, file: !1, line: 223, type: !115)
!669 = !DILocation(line: 222, column: 25, scope: !665)
!670 = !DILocation(line: 222, column: 20, scope: !665)
!671 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !672)
!672 = distinct !DILocation(line: 223, column: 15, scope: !665)
!673 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !672)
!674 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !672)
!675 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !672)
!676 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !672)
!677 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !672)
!678 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !672)
!679 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !672)
!680 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !672)
!681 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !672)
!682 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !672)
!683 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !672)
!684 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !672)
!685 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !672)
!686 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !672)
!687 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !672)
!688 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !672)
!689 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !672)
!690 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !672)
!691 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !672)
!692 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !672)
!693 = !DILocation(line: 223, column: 11, scope: !665)
!694 = !DILocation(line: 224, column: 17, scope: !665)
!695 = !DILocation(line: 225, column: 5, scope: !665)
!696 = distinct !DISubprogram(name: "createSetObject", scope: !1, file: !1, line: 228, type: !606, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !697)
!697 = !{!698, !699}
!698 = !DILocalVariable(name: "d", scope: !696, file: !1, line: 229, type: !6)
!699 = !DILocalVariable(name: "o", scope: !696, file: !1, line: 230, type: !115)
!700 = !DILocation(line: 229, column: 15, scope: !696)
!701 = !DILocation(line: 229, column: 11, scope: !696)
!702 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !703)
!703 = distinct !DILocation(line: 230, column: 15, scope: !696)
!704 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !703)
!705 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !703)
!706 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !703)
!707 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !703)
!708 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !703)
!709 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !703)
!710 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !703)
!711 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !703)
!712 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !703)
!713 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !703)
!714 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !703)
!715 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !703)
!716 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !703)
!717 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !703)
!718 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !703)
!719 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !703)
!720 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !703)
!721 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !703)
!722 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !703)
!723 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !703)
!724 = !DILocation(line: 230, column: 11, scope: !696)
!725 = !DILocation(line: 231, column: 17, scope: !696)
!726 = !DILocation(line: 232, column: 5, scope: !696)
!727 = distinct !DISubprogram(name: "createIntsetObject", scope: !1, file: !1, line: 235, type: !606, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !728)
!728 = !{!729, !742}
!729 = !DILocalVariable(name: "is", scope: !727, file: !1, line: 236, type: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "intset", file: !732, line: 39, baseType: !733)
!732 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/intset.h", directory: "/root/.unikraft/apps/redis/build")
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "intset", file: !732, line: 35, size: 64, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !733, file: !732, line: 36, baseType: !150, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !733, file: !732, line: 37, baseType: !150, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !733, file: !732, line: 38, baseType: !738, offset: 64)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, elements: !108)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 20, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 41, baseType: !741)
!741 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!742 = !DILocalVariable(name: "o", scope: !727, file: !1, line: 237, type: !115)
!743 = !DILocation(line: 236, column: 18, scope: !727)
!744 = !DILocation(line: 236, column: 13, scope: !727)
!745 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !746)
!746 = distinct !DILocation(line: 237, column: 15, scope: !727)
!747 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !746)
!748 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !746)
!749 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !746)
!750 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !746)
!751 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !746)
!752 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !746)
!753 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !746)
!754 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !746)
!755 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !746)
!756 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !746)
!757 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !746)
!758 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !746)
!759 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !746)
!760 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !746)
!761 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !746)
!762 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !746)
!763 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !746)
!764 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !746)
!765 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !746)
!766 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !746)
!767 = !DILocation(line: 237, column: 11, scope: !727)
!768 = !DILocation(line: 238, column: 17, scope: !727)
!769 = !DILocation(line: 239, column: 5, scope: !727)
!770 = distinct !DISubprogram(name: "createHashObject", scope: !1, file: !1, line: 242, type: !606, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !771)
!771 = !{!772, !773}
!772 = !DILocalVariable(name: "zl", scope: !770, file: !1, line: 243, type: !624)
!773 = !DILocalVariable(name: "o", scope: !770, file: !1, line: 244, type: !115)
!774 = !DILocation(line: 243, column: 25, scope: !770)
!775 = !DILocation(line: 243, column: 20, scope: !770)
!776 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !777)
!777 = distinct !DILocation(line: 244, column: 15, scope: !770)
!778 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !777)
!779 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !777)
!780 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !777)
!781 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !777)
!782 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !777)
!783 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !777)
!784 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !777)
!785 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !777)
!786 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !777)
!787 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !777)
!788 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !777)
!789 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !777)
!790 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !777)
!791 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !777)
!792 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !777)
!793 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !777)
!794 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !777)
!795 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !777)
!796 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !777)
!797 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !777)
!798 = !DILocation(line: 244, column: 11, scope: !770)
!799 = !DILocation(line: 245, column: 17, scope: !770)
!800 = !DILocation(line: 246, column: 5, scope: !770)
!801 = distinct !DISubprogram(name: "createZsetObject", scope: !1, file: !1, line: 249, type: !606, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !802)
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "zs", scope: !801, file: !1, line: 250, type: !82)
!804 = !DILocalVariable(name: "o", scope: !801, file: !1, line: 251, type: !115)
!805 = !DILocation(line: 250, column: 16, scope: !801)
!806 = !DILocation(line: 250, column: 11, scope: !801)
!807 = !DILocation(line: 253, column: 16, scope: !801)
!808 = !DILocation(line: 253, column: 9, scope: !801)
!809 = !DILocation(line: 253, column: 14, scope: !801)
!810 = !{!811, !187, i64 0}
!811 = !{!"zset", !187, i64 0, !187, i64 8}
!812 = !DILocation(line: 254, column: 15, scope: !801)
!813 = !DILocation(line: 254, column: 9, scope: !801)
!814 = !DILocation(line: 254, column: 13, scope: !801)
!815 = !{!811, !187, i64 8}
!816 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !817)
!817 = distinct !DILocation(line: 255, column: 9, scope: !801)
!818 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !817)
!819 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !817)
!820 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !817)
!821 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !817)
!822 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !817)
!823 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !817)
!824 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !817)
!825 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !817)
!826 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !817)
!827 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !817)
!828 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !817)
!829 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !817)
!830 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !817)
!831 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !817)
!832 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !817)
!833 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !817)
!834 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !817)
!835 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !817)
!836 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !817)
!837 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !817)
!838 = !DILocation(line: 251, column: 11, scope: !801)
!839 = !DILocation(line: 256, column: 17, scope: !801)
!840 = !DILocation(line: 257, column: 5, scope: !801)
!841 = distinct !DISubprogram(name: "createZsetZiplistObject", scope: !1, file: !1, line: 260, type: !606, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !842)
!842 = !{!843, !844}
!843 = !DILocalVariable(name: "zl", scope: !841, file: !1, line: 261, type: !624)
!844 = !DILocalVariable(name: "o", scope: !841, file: !1, line: 262, type: !115)
!845 = !DILocation(line: 261, column: 25, scope: !841)
!846 = !DILocation(line: 261, column: 20, scope: !841)
!847 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !848)
!848 = distinct !DILocation(line: 262, column: 15, scope: !841)
!849 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !848)
!850 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !848)
!851 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !848)
!852 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !848)
!853 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !848)
!854 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !848)
!855 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !848)
!856 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !848)
!857 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !848)
!858 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !848)
!859 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !848)
!860 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !848)
!861 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !848)
!862 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !848)
!863 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !848)
!864 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !848)
!865 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !848)
!866 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !848)
!867 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !848)
!868 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !848)
!869 = !DILocation(line: 262, column: 11, scope: !841)
!870 = !DILocation(line: 263, column: 17, scope: !841)
!871 = !DILocation(line: 264, column: 5, scope: !841)
!872 = distinct !DISubprogram(name: "createStreamObject", scope: !1, file: !1, line: 267, type: !606, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !873)
!873 = !{!874, !907}
!874 = !DILocalVariable(name: "s", scope: !872, file: !1, line: 268, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !877, line: 21, baseType: !878)
!877 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !877, line: 16, size: 320, elements: !879)
!879 = !{!880, !899, !900, !906}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !878, file: !877, line: 17, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !883, line: 137, baseType: !884)
!883 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !883, line: 133, size: 192, elements: !885)
!885 = !{!886, !897, !898}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !884, file: !883, line: 134, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !883, line: 131, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !883, line: 98, size: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !889, file: !883, line: 99, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !889, file: !883, line: 100, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !889, file: !883, line: 101, baseType: !150, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !883, line: 102, baseType: !150, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !889, file: !883, line: 130, baseType: !896, offset: 32)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, elements: !108)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !884, file: !883, line: 135, baseType: !20, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !884, file: !883, line: 136, baseType: !20, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !878, file: !877, line: 18, baseType: !20, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !878, file: !877, line: 19, baseType: !901, size: 128, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !877, line: 14, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !877, line: 11, size: 128, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !902, file: !877, line: 12, baseType: !20, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !902, file: !877, line: 13, baseType: !20, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !878, file: !877, line: 20, baseType: !881, size: 64, offset: 256)
!907 = !DILocalVariable(name: "o", scope: !872, file: !1, line: 269, type: !115)
!908 = !DILocation(line: 268, column: 17, scope: !872)
!909 = !DILocation(line: 268, column: 13, scope: !872)
!910 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !911)
!911 = distinct !DILocation(line: 269, column: 15, scope: !872)
!912 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !911)
!913 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !911)
!914 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !911)
!915 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !911)
!916 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !911)
!917 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !911)
!918 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !911)
!919 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !911)
!920 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !911)
!921 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !911)
!922 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !911)
!923 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !911)
!924 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !911)
!925 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !911)
!926 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !911)
!927 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !911)
!928 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !911)
!929 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !911)
!930 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !911)
!931 = !DILocation(line: 55, column: 5, scope: !166, inlinedAt: !911)
!932 = !DILocation(line: 269, column: 11, scope: !872)
!933 = !DILocation(line: 270, column: 17, scope: !872)
!934 = !DILocation(line: 271, column: 5, scope: !872)
!935 = distinct !DISubprogram(name: "createModuleObject", scope: !1, file: !1, line: 274, type: !936, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1277)
!936 = !DISubroutineType(types: !937)
!937 = !{!115, !938, !4}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleType", file: !84, line: 530, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleType", file: !84, line: 517, size: 768, elements: !941)
!941 = !{!942, !943, !946, !1229, !1234, !1239, !1244, !1257, !1262, !1267, !1272, !1273}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !940, file: !84, line: 518, baseType: !20, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !940, file: !84, line: 519, baseType: !944, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModule", file: !84, line: 496, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !940, file: !84, line: 520, baseType: !947, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeLoadFunc", file: !84, line: 506, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!4, !951, !36}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleIO", file: !84, line: 555, size: 384, elements: !953)
!953 = !{!954, !955, !1221, !1222, !1223, !1224, !1227}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !952, file: !84, line: 556, baseType: !77, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !952, file: !84, line: 557, baseType: !956, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !958, line: 87, baseType: !959)
!958 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !958, line: 39, size: 832, elements: !960)
!960 = !{!961, !966, !970, !978, !982, !986, !987, !988, !989}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !959, file: !958, line: 43, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!491, !965, !4, !491}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !959, file: !958, line: 44, baseType: !967, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!491, !965, !25, !491}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !959, file: !958, line: 45, baseType: !971, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !965}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !975, line: 173, baseType: !976)
!975 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 100, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !80, line: 44, baseType: !5)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !959, file: !958, line: 46, baseType: !979, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!36, !965}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !959, file: !958, line: 52, baseType: !983, size: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !965, !25, !491}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !959, file: !958, line: 55, baseType: !20, size: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !959, file: !958, line: 58, baseType: !491, size: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !959, file: !958, line: 61, baseType: !491, size: 64, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !959, file: !958, line: 84, baseType: !990, size: 320, offset: 512)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !959, file: !958, line: 64, size: 320, elements: !991)
!991 = !{!992, !997, !1212}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !990, file: !958, line: 69, baseType: !993, size: 128)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !990, file: !958, line: 66, size: 128, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !993, file: !958, line: 67, baseType: !98, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !993, file: !958, line: 68, baseType: !974, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !990, file: !958, line: 75, baseType: !998, size: 192)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !990, file: !958, line: 71, size: 192, elements: !999)
!999 = !{!1000, !1210, !1211}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !998, file: !958, line: 72, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1003, line: 66, baseType: !1004)
!1003 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !1005, line: 287, baseType: !1006)
!1005 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !1005, line: 181, size: 1408, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1013, !1014, !1019, !1020, !1021, !1180, !1184, !1189, !1193, !1194, !1195, !1196, !1198, !1200, !1201, !1202, !1203, !1204, !1208, !1209}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !1006, file: !1005, line: 182, baseType: !624, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !1006, file: !1005, line: 183, baseType: !36, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !1006, file: !1005, line: 184, baseType: !36, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1006, file: !1005, line: 185, baseType: !1012, size: 16, offset: 128)
!1012 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !1006, file: !1005, line: 186, baseType: !1012, size: 16, offset: 144)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !1006, file: !1005, line: 187, baseType: !1015, size: 128, offset: 192)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !1005, line: 117, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !1015, file: !1005, line: 118, baseType: !624, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1015, file: !1005, line: 119, baseType: !36, size: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !1006, file: !1005, line: 188, baseType: !36, size: 32, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !1006, file: !1005, line: 195, baseType: !4, size: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !1006, file: !1005, line: 197, baseType: !1022, size: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !1026, !4, !81, !36}
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !80, line: 145, baseType: !5)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !1005, line: 569, size: 14912, elements: !1028)
!1028 = !{!1029, !1030, !1032, !1033, !1034, !1035, !1039, !1040, !1043, !1044, !1048, !1062, !1063, !1064, !1066, !1067, !1068, !1144, !1165, !1166, !1171, !1178}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !1027, file: !1005, line: 571, baseType: !36, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !1027, file: !1005, line: 576, baseType: !1031, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !1027, file: !1005, line: 576, baseType: !1031, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !1027, file: !1005, line: 576, baseType: !1031, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !1027, file: !1005, line: 578, baseType: !36, size: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !1027, file: !1005, line: 579, baseType: !1036, size: 200, offset: 288)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 200, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 25)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !1027, file: !1005, line: 582, baseType: !36, size: 32, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !1027, file: !1005, line: 583, baseType: !1041, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !1005, line: 40, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !1027, file: !1005, line: 585, baseType: !36, size: 32, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !1027, file: !1005, line: 587, baseType: !1045, size: 64, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !1026}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !1027, file: !1005, line: 590, baseType: !1049, size: 64, offset: 768)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !1005, line: 47, size: 256, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1050, file: !1005, line: 49, baseType: !1049, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !1050, file: !1005, line: 50, baseType: !36, size: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !1050, file: !1005, line: 50, baseType: !36, size: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !1050, file: !1005, line: 50, baseType: !36, size: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !1050, file: !1005, line: 50, baseType: !36, size: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !1050, file: !1005, line: 51, baseType: !1058, size: 32, offset: 192)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1059, size: 32, elements: !1060)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !1005, line: 25, baseType: !120)
!1060 = !{!1061}
!1061 = !DISubrange(count: 1)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !1027, file: !1005, line: 591, baseType: !36, size: 32, offset: 832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !1027, file: !1005, line: 592, baseType: !1049, size: 64, offset: 896)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !1027, file: !1005, line: 593, baseType: !1065, size: 64, offset: 960)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !1027, file: !1005, line: 596, baseType: !36, size: 32, offset: 1024)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !1027, file: !1005, line: 597, baseType: !81, size: 64, offset: 1088)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !1027, file: !1005, line: 632, baseType: !1069, size: 2880, offset: 1152)
!1069 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1027, file: !1005, line: 599, size: 2880, elements: !1070)
!1070 = !{!1071, !1135}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !1069, file: !1005, line: 622, baseType: !1072, size: 1728)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1069, file: !1005, line: 601, size: 1728, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1080, !1092, !1093, !1095, !1104, !1118, !1119, !1120, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !1072, file: !1005, line: 603, baseType: !120, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1072, file: !1005, line: 604, baseType: !81, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !1072, file: !1005, line: 605, baseType: !1077, size: 208, offset: 128)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 208, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 26)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !1072, file: !1005, line: 606, baseType: !1081, size: 288, offset: 352)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !1005, line: 55, size: 288, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1081, file: !1005, line: 57, baseType: !36, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1081, file: !1005, line: 58, baseType: !36, size: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1081, file: !1005, line: 59, baseType: !36, size: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1081, file: !1005, line: 60, baseType: !36, size: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1081, file: !1005, line: 61, baseType: !36, size: 32, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1081, file: !1005, line: 62, baseType: !36, size: 32, offset: 160)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1081, file: !1005, line: 63, baseType: !36, size: 32, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1081, file: !1005, line: 64, baseType: !36, size: 32, offset: 224)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1081, file: !1005, line: 65, baseType: !36, size: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !1072, file: !1005, line: 607, baseType: !36, size: 32, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1072, file: !1005, line: 608, baseType: !1094, size: 64, offset: 704)
!1094 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !1072, file: !1005, line: 609, baseType: !1096, size: 112, offset: 768)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !1005, line: 319, size: 112, elements: !1097)
!1097 = !{!1098, !1102, !1103}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1096, file: !1005, line: 320, baseType: !1099, size: 48)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 48, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 3)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1096, file: !1005, line: 321, baseType: !1099, size: 48, offset: 48)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1096, file: !1005, line: 322, baseType: !142, size: 16, offset: 96)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1072, file: !1005, line: 610, baseType: !1105, size: 64, offset: 896)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !80, line: 171, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 163, size: 64, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1106, file: !80, line: 165, baseType: !36, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1106, file: !80, line: 170, baseType: !1110, size: 32, offset: 32)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1106, file: !80, line: 166, size: 32, elements: !1111)
!1111 = !{!1112, !1114}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1110, file: !80, line: 168, baseType: !1113, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !492, line: 124, baseType: !120)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1110, file: !80, line: 169, baseType: !1115, size: 32)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 4)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1072, file: !1005, line: 611, baseType: !1105, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1072, file: !1005, line: 612, baseType: !1105, size: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1072, file: !1005, line: 613, baseType: !1121, size: 64, offset: 1088)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !1122)
!1122 = !{!1123}
!1123 = !DISubrange(count: 8)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !1072, file: !1005, line: 614, baseType: !1125, size: 192, offset: 1152)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 24)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1072, file: !1005, line: 615, baseType: !36, size: 32, offset: 1344)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1072, file: !1005, line: 616, baseType: !1105, size: 64, offset: 1376)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1072, file: !1005, line: 617, baseType: !1105, size: 64, offset: 1440)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1072, file: !1005, line: 618, baseType: !1105, size: 64, offset: 1504)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1072, file: !1005, line: 619, baseType: !1105, size: 64, offset: 1568)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1072, file: !1005, line: 620, baseType: !1105, size: 64, offset: 1632)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !1072, file: !1005, line: 621, baseType: !36, size: 32, offset: 1696)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !1069, file: !1005, line: 631, baseType: !1136, size: 2880)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1069, file: !1005, line: 626, size: 2880, elements: !1137)
!1137 = !{!1138, !1142}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !1136, file: !1005, line: 629, baseType: !1139, size: 1920)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 1920, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 30)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !1136, file: !1005, line: 630, baseType: !1143, size: 960, offset: 1920)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 960, elements: !1140)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !1027, file: !1005, line: 636, baseType: !1145, size: 64, offset: 4032)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !1005, line: 93, size: 6336, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1157}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1146, file: !1005, line: 94, baseType: !1145, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1146, file: !1005, line: 95, baseType: !36, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1146, file: !1005, line: 97, baseType: !1151, size: 2048, offset: 128)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 2048, elements: !1155)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null}
!1155 = !{!1156}
!1156 = !DISubrange(count: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !1146, file: !1005, line: 98, baseType: !1158, size: 4160, offset: 2176)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !1005, line: 74, size: 4160, elements: !1159)
!1159 = !{!1160, !1162, !1163, !1164}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1158, file: !1005, line: 75, baseType: !1161, size: 2048)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1155)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1158, file: !1005, line: 76, baseType: !1161, size: 2048, offset: 2048)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1158, file: !1005, line: 78, baseType: !1059, size: 32, offset: 4096)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1158, file: !1005, line: 81, baseType: !1059, size: 32, offset: 4128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !1027, file: !1005, line: 637, baseType: !1146, size: 6336, offset: 4096)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !1027, file: !1005, line: 641, baseType: !1167, size: 64, offset: 10432)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
