; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_tkAssocDestroy.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_tkAssocDestroy.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ThreadKeyAssoc = type { %struct.pte_thread_t_*, %struct.pthread_key_t_*, %struct.ThreadKeyAssoc*, %struct.ThreadKeyAssoc*, %struct.ThreadKeyAssoc*, %struct.ThreadKeyAssoc* }
%struct.pte_thread_t_ = type { %struct.uk_thread*, %struct.pte_handle_t, %struct.pte_thread_t_*, i32, i8*, i8*, i32, i32, %struct.pthread_mutex_t_*, i32, %struct.pthread_mutex_t_*, i32, i32, i32, [8 x i64], i8, i8*, i8* }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.anon.0 = type { %struct.uk_waitq_entry* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_tkAssocDestroy.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 61, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18, !19}
!13 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!26 = distinct !DISubprogram(name: "pte_tkAssocDestroy", scope: !1, file: !1, line: 51, type: !27, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !541)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadKeyAssoc", file: !11, line: 224, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadKeyAssoc", file: !11, line: 292, size: 384, elements: !32)
!32 = !{!33, !528, !537, !538, !539, !540}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !31, file: !11, line: 392, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !11, line: 83, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !11, line: 85, size: 1536, elements: !37)
!37 = !{!38, !482, !490, !491, !494, !495, !496, !497, !498, !515, !516, !517, !518, !519, !520, !525, !526, !527}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !36, file: !11, line: 87, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !40, line: 11, baseType: !41)
!40 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !43, line: 59, size: 1024, elements: !44)
!43 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !{!45, !49, !50, !51, !52, !58, !63, !69, !71, !88, !237, !238, !239, !452}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !43, line: 60, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !42, file: !43, line: 61, baseType: !21, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !42, file: !43, line: 62, baseType: !21, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !42, file: !43, line: 63, baseType: !21, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !42, file: !43, line: 64, baseType: !53, size: 128, offset: 256)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !42, file: !43, line: 64, size: 128, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !53, file: !43, line: 64, baseType: !41, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !53, file: !43, line: 64, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !43, line: 65, baseType: !59, size: 32, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !60, line: 48, baseType: !61)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 79, baseType: !5)
!62 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !42, file: !43, line: 66, baseType: !64, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !65, line: 49, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !67, line: 128, baseType: !68)
!67 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !42, file: !43, line: 67, baseType: !70, size: 8, offset: 512)
!70 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !42, file: !43, line: 68, baseType: !72, size: 128, offset: 576)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !73, line: 42, size: 128, elements: !74)
!73 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !{!75, !86}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !72, file: !73, line: 42, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !73, line: 35, size: 192, elements: !78)
!78 = !{!79, !81, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !77, file: !73, line: 36, baseType: !80, size: 32)
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !77, file: !73, line: 37, baseType: !41, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !77, file: !73, line: 38, baseType: !83, size: 64, offset: 128)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !73, line: 38, size: 64, elements: !84)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !83, file: !73, line: 38, baseType: !76, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !72, file: !73, line: 42, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !42, file: !43, line: 69, baseType: !89, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !91, line: 90, size: 2176, elements: !92)
!91 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!92 = !{!93, !98, !116, !121, !123, !125, !130, !138, !143, !149, !150, !151, !156, !234, !235, !236}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !90, file: !91, line: 91, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !91, line: 68, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !89}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !90, file: !91, line: 93, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !91, line: 71, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!80, !89, !41, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !106, line: 55, size: 128, elements: !108)
!108 = !{!109, !110, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !107, file: !106, line: 57, baseType: !70, size: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !107, file: !106, line: 59, baseType: !111, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !106, line: 53, baseType: !80)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !107, file: !106, line: 61, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !65, line: 48, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !67, line: 129, baseType: !115)
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !90, file: !91, line: 94, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !91, line: 74, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !89, !41}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !90, file: !91, line: 95, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !91, line: 76, baseType: !118)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !90, file: !91, line: 96, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !91, line: 78, baseType: !118)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !90, file: !91, line: 98, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !91, line: 81, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!80, !89, !41, !111}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !90, file: !91, line: 99, baseType: !131, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !91, line: 83, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!80, !89, !135, !137}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !90, file: !91, line: 100, baseType: !139, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !91, line: 85, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!80, !89, !41, !80}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !90, file: !91, line: 101, baseType: !144, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !91, line: 87, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!80, !89, !135, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !90, file: !91, line: 104, baseType: !70, size: 8, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !90, file: !91, line: 105, baseType: !42, size: 1024, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !90, file: !91, line: 106, baseType: !152, size: 128, offset: 1664)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !43, line: 93, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !152, file: !43, line: 93, baseType: !41, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !152, file: !43, line: 93, baseType: !57, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !90, file: !91, line: 107, baseType: !157, size: 192, offset: 1792)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !158, line: 59, size: 192, elements: !159)
!158 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!159 = !{!160, !225, !229}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !157, file: !158, line: 61, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !158, line: 51, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!21, !165, !115, !115}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !167, line: 77, size: 832, elements: !168)
!167 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!168 = !{!169, !176, !181, !186, !192, !194, !199, !200, !201, !206, !211, !216, !217, !218}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !166, file: !167, line: 79, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !167, line: 54, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!21, !165, !174}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !175, line: 58, baseType: !115)
!175 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !166, file: !167, line: 80, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !167, line: 56, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!21, !165, !174, !174}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !166, file: !167, line: 81, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !167, line: 62, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!21, !165, !21, !174}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !166, file: !167, line: 82, baseType: !187, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !167, line: 58, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!80, !165, !191, !174, !174}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !166, file: !167, line: 83, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !167, line: 60, baseType: !178)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !166, file: !167, line: 84, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !167, line: 64, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !165, !21}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !166, file: !167, line: 87, baseType: !195, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !166, file: !167, line: 88, baseType: !170, size: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !166, file: !167, line: 92, baseType: !202, size: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !167, line: 66, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!21, !165, !115}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !166, file: !167, line: 93, baseType: !207, size: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !167, line: 68, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !165, !21, !115}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !166, file: !167, line: 99, baseType: !212, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !167, line: 70, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!80, !165, !21, !174}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !167, line: 100, baseType: !174, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !167, line: 103, baseType: !165, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !166, file: !167, line: 104, baseType: !219, offset: 832)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, elements: !223)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !60, line: 20, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !62, line: 41, baseType: !222)
!222 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!223 = !{!224}
!224 = !DISubrange(count: -1)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !157, file: !158, line: 63, baseType: !226, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !21}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !157, file: !158, line: 65, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !158, line: 56, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !21, !21}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !90, file: !91, line: 108, baseType: !165, size: 64, offset: 1984)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !91, line: 109, baseType: !89, size: 64, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !90, file: !91, line: 110, baseType: !21, size: 64, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !42, file: !43, line: 70, baseType: !21, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !42, file: !43, line: 72, baseType: !80, size: 32, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !42, file: !43, line: 82, baseType: !240, size: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !242, line: 569, size: 14912, elements: !243)
!242 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!243 = !{!244, !245, !320, !321, !322, !323, !327, !328, !331, !332, !336, !348, !349, !350, !352, !353, !354, !416, !437, !438, !443, !450}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !241, file: !242, line: 571, baseType: !80, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !241, file: !242, line: 576, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !242, line: 287, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !242, line: 181, size: 1408, elements: !249)
!249 = !{!250, !253, !254, !255, !257, !258, !263, !264, !265, !272, !276, !281, !285, !286, !287, !288, !292, !296, !297, !298, !300, !301, !305, !319}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !248, file: !242, line: 182, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !248, file: !242, line: 183, baseType: !80, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !248, file: !242, line: 184, baseType: !80, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !248, file: !242, line: 185, baseType: !256, size: 16, offset: 128)
!256 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !248, file: !242, line: 186, baseType: !256, size: 16, offset: 144)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !248, file: !242, line: 187, baseType: !259, size: 128, offset: 192)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !242, line: 117, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !259, file: !242, line: 118, baseType: !251, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !259, file: !242, line: 119, baseType: !80, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !248, file: !242, line: 188, baseType: !80, size: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !248, file: !242, line: 195, baseType: !21, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !248, file: !242, line: 197, baseType: !266, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !240, !21, !271, !80}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !270, line: 145, baseType: !68)
!270 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !248, file: !242, line: 199, baseType: !273, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!269, !240, !21, !46, !80}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !248, file: !242, line: 202, baseType: !277, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !240, !21, !280, !80}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !270, line: 114, baseType: !68)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !248, file: !242, line: 203, baseType: !282, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!80, !240, !21}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !248, file: !242, line: 206, baseType: !259, size: 128, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !248, file: !242, line: 207, baseType: !251, size: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !248, file: !242, line: 208, baseType: !80, size: 32, offset: 896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !248, file: !242, line: 211, baseType: !289, size: 24, offset: 928)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 24, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !248, file: !242, line: 212, baseType: !293, size: 8, offset: 952)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 8, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 1)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !248, file: !242, line: 215, baseType: !259, size: 128, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !248, file: !242, line: 218, baseType: !80, size: 32, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !248, file: !242, line: 219, baseType: !299, size: 64, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !270, line: 44, baseType: !68)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !248, file: !242, line: 222, baseType: !240, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !248, file: !242, line: 226, baseType: !302, size: 32, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !270, line: 175, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !304, line: 12, baseType: !80)
!304 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !248, file: !242, line: 228, baseType: !306, size: 64, offset: 1312)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !270, line: 171, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 163, size: 64, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !307, file: !270, line: 165, baseType: !80, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !307, file: !270, line: 170, baseType: !311, size: 32, offset: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !307, file: !270, line: 166, size: 32, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !311, file: !270, line: 168, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !175, line: 124, baseType: !5)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !311, file: !270, line: 169, baseType: !316, size: 32)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 32, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 4)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !248, file: !242, line: 229, baseType: !80, size: 32, offset: 1376)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !241, file: !242, line: 576, baseType: !246, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !241, file: !242, line: 576, baseType: !246, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !241, file: !242, line: 578, baseType: !80, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !241, file: !242, line: 579, baseType: !324, size: 200, offset: 288)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 200, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 25)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !241, file: !242, line: 582, baseType: !80, size: 32, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !241, file: !242, line: 583, baseType: !329, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !242, line: 40, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !241, file: !242, line: 585, baseType: !80, size: 32, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !241, file: !242, line: 587, baseType: !333, size: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !240}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !241, file: !242, line: 590, baseType: !337, size: 64, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !242, line: 47, size: 256, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !338, file: !242, line: 49, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !338, file: !242, line: 50, baseType: !80, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !338, file: !242, line: 50, baseType: !80, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !338, file: !242, line: 50, baseType: !80, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !338, file: !242, line: 50, baseType: !80, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !338, file: !242, line: 51, baseType: !346, size: 32, offset: 192)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 32, elements: !294)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !242, line: 25, baseType: !5)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !241, file: !242, line: 591, baseType: !80, size: 32, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !241, file: !242, line: 592, baseType: !337, size: 64, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !241, file: !242, line: 593, baseType: !351, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !241, file: !242, line: 596, baseType: !80, size: 32, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !241, file: !242, line: 597, baseType: !271, size: 64, offset: 1088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !241, file: !242, line: 632, baseType: !355, size: 2880, offset: 1152)
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !242, line: 599, size: 2880, elements: !356)
!356 = !{!357, !407}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !355, file: !242, line: 622, baseType: !358, size: 1728)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !242, line: 601, size: 1728, elements: !359)
!359 = !{!360, !361, !362, !366, !378, !379, !381, !389, !390, !391, !392, !396, !400, !401, !402, !403, !404, !405, !406}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !358, file: !242, line: 603, baseType: !5, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !358, file: !242, line: 604, baseType: !271, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !358, file: !242, line: 605, baseType: !363, size: 208, offset: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 208, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 26)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !358, file: !242, line: 606, baseType: !367, size: 288, offset: 352)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !242, line: 55, size: 288, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !367, file: !242, line: 57, baseType: !80, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !367, file: !242, line: 58, baseType: !80, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !367, file: !242, line: 59, baseType: !80, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !367, file: !242, line: 60, baseType: !80, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !367, file: !242, line: 61, baseType: !80, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !367, file: !242, line: 62, baseType: !80, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !367, file: !242, line: 63, baseType: !80, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !367, file: !242, line: 64, baseType: !80, size: 32, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !367, file: !242, line: 65, baseType: !80, size: 32, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !358, file: !242, line: 607, baseType: !80, size: 32, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !358, file: !242, line: 608, baseType: !380, size: 64, offset: 704)
!380 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !358, file: !242, line: 609, baseType: !382, size: 112, offset: 768)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !242, line: 319, size: 112, elements: !383)
!383 = !{!384, !387, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !382, file: !242, line: 320, baseType: !385, size: 48)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 48, elements: !290)
!386 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !382, file: !242, line: 321, baseType: !385, size: 48, offset: 48)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !382, file: !242, line: 322, baseType: !386, size: 16, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !358, file: !242, line: 610, baseType: !306, size: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !358, file: !242, line: 611, baseType: !306, size: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !358, file: !242, line: 612, baseType: !306, size: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !358, file: !242, line: 613, baseType: !393, size: 64, offset: 1088)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !358, file: !242, line: 614, baseType: !397, size: 192, offset: 1152)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 192, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 24)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !358, file: !242, line: 615, baseType: !80, size: 32, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !358, file: !242, line: 616, baseType: !306, size: 64, offset: 1376)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !358, file: !242, line: 617, baseType: !306, size: 64, offset: 1440)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !358, file: !242, line: 618, baseType: !306, size: 64, offset: 1504)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !358, file: !242, line: 619, baseType: !306, size: 64, offset: 1568)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !358, file: !242, line: 620, baseType: !306, size: 64, offset: 1632)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !358, file: !242, line: 621, baseType: !80, size: 32, offset: 1696)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !355, file: !242, line: 631, baseType: !408, size: 2880)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !242, line: 626, size: 2880, elements: !409)
!409 = !{!410, !414}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !408, file: !242, line: 629, baseType: !411, size: 1920)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 1920, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 30)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !408, file: !242, line: 630, baseType: !415, size: 960, offset: 1920)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !412)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !241, file: !242, line: 636, baseType: !417, size: 64, offset: 4032)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !242, line: 93, size: 6336, elements: !419)
!419 = !{!420, !421, !422, !429}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !418, file: !242, line: 94, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !418, file: !242, line: 95, baseType: !80, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !418, file: !242, line: 97, baseType: !423, size: 2048, offset: 128)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 2048, elements: !427)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null}
!427 = !{!428}
!428 = !DISubrange(count: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !418, file: !242, line: 98, baseType: !430, size: 4160, offset: 2176)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !242, line: 74, size: 4160, elements: !431)
!431 = !{!432, !434, !435, !436}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !430, file: !242, line: 75, baseType: !433, size: 2048)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !427)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !430, file: !242, line: 76, baseType: !433, size: 2048, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !430, file: !242, line: 78, baseType: !347, size: 32, offset: 4096)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !430, file: !242, line: 81, baseType: !347, size: 32, offset: 4128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !241, file: !242, line: 637, baseType: !418, size: 6336, offset: 4096)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !241, file: !242, line: 641, baseType: !439, size: 64, offset: 10432)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !80}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !241, file: !242, line: 646, baseType: !444, size: 192, offset: 10496)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !242, line: 291, size: 192, elements: !445)
!445 = !{!446, !448, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !444, file: !242, line: 293, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !444, file: !242, line: 294, baseType: !80, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !444, file: !242, line: 295, baseType: !246, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !241, file: !242, line: 648, baseType: !451, size: 4224, offset: 10688)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 4224, elements: !290)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !42, file: !43, line: 85, baseType: !453, size: 64, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !455)
!455 = !{!456, !460, !461, !468, !481}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !454, file: !4, line: 116, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !458, line: 64, baseType: !459)
!458 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !458, line: 63, baseType: !115)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !454, file: !4, line: 118, baseType: !457, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !454, file: !4, line: 120, baseType: !462, size: 128, offset: 128)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !463, line: 51, size: 128, elements: !464)
!463 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!464 = !{!465, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !463, line: 52, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !462, file: !463, line: 53, baseType: !466, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !454, file: !4, line: 122, baseType: !469, size: 256, offset: 256)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !469, file: !4, line: 107, baseType: !3, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !469, file: !4, line: 109, baseType: !457, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !469, file: !4, line: 111, baseType: !474, size: 96, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !458, line: 72, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 68, size: 96, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !475, file: !458, line: 69, baseType: !80, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !475, file: !458, line: 70, baseType: !80, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !475, file: !458, line: 71, baseType: !480, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !458, line: 61, baseType: !80)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !454, file: !4, line: 124, baseType: !462, size: 128, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !36, file: !11, line: 88, baseType: !483, size: 128, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !484, line: 413, baseType: !485)
!484 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !484, line: 411, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 395, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !486, file: !484, line: 398, baseType: !21, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !486, file: !484, line: 399, baseType: !5, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !36, file: !11, line: 89, baseType: !34, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !36, file: !11, line: 90, baseType: !492, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !11, line: 80, baseType: !10)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !36, file: !11, line: 91, baseType: !21, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !36, file: !11, line: 92, baseType: !21, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !36, file: !11, line: 93, baseType: !80, size: 32, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !36, file: !11, line: 94, baseType: !80, size: 32, offset: 480)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !36, file: !11, line: 95, baseType: !499, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !484, line: 417, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !11, line: 146, size: 320, elements: !502)
!502 = !{!503, !511, !512, !513, !514}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !501, file: !11, line: 148, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !40, line: 12, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !507, line: 51, size: 192, elements: !508)
!507 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !506, file: !507, line: 52, baseType: !68, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !506, file: !507, line: 53, baseType: !72, size: 128, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !501, file: !11, line: 149, baseType: !80, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !501, file: !11, line: 156, baseType: !80, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !501, file: !11, line: 159, baseType: !80, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !501, file: !11, line: 160, baseType: !483, size: 128, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !36, file: !11, line: 96, baseType: !80, size: 32, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !36, file: !11, line: 97, baseType: !499, size: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !36, file: !11, line: 98, baseType: !80, size: 32, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !36, file: !11, line: 99, baseType: !80, size: 32, offset: 736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !36, file: !11, line: 100, baseType: !80, size: 32, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !36, file: !11, line: 102, baseType: !521, size: 512, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !522, line: 372, baseType: !523)
!522 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 512, elements: !394)
!524 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !36, file: !11, line: 104, baseType: !80, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !36, file: !11, line: 106, baseType: !21, size: 64, offset: 1408)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !36, file: !11, line: 107, baseType: !21, size: 64, offset: 1472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !31, file: !11, line: 393, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !484, line: 416, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_key_t_", file: !11, line: 214, size: 256, elements: !532)
!532 = !{!533, !534, !535, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !531, file: !11, line: 216, baseType: !5, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !531, file: !11, line: 217, baseType: !226, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "keyLock", scope: !531, file: !11, line: 218, baseType: !499, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !531, file: !11, line: 219, baseType: !21, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nextKey", scope: !31, file: !11, line: 394, baseType: !29, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nextThread", scope: !31, file: !11, line: 395, baseType: !29, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prevKey", scope: !31, file: !11, line: 396, baseType: !29, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prevThread", scope: !31, file: !11, line: 397, baseType: !29, size: 64, offset: 320)
!541 = !{!542, !543, !546}
!542 = !DILocalVariable(name: "assoc", arg: 1, scope: !26, file: !1, line: 51, type: !29)
!543 = !DILocalVariable(name: "prev", scope: !544, file: !1, line: 73, type: !29)
!544 = distinct !DILexicalBlock(scope: !545, file: !1, line: 72, column: 5)
!545 = distinct !DILexicalBlock(scope: !26, file: !1, line: 71, column: 7)
!546 = !DILocalVariable(name: "next", scope: !544, file: !1, line: 73, type: !29)
!547 = !DILocation(line: 51, column: 38, scope: !26)
!548 = !DILocation(line: 71, column: 13, scope: !545)
!549 = !DILocation(line: 71, column: 7, scope: !26)
!550 = !DILocation(line: 76, column: 21, scope: !544)
!551 = !{!552, !553, i64 32}
!552 = !{!"ThreadKeyAssoc", !553, i64 0, !553, i64 8, !553, i64 16, !553, i64 24, !553, i64 32, !553, i64 40}
!553 = !{!"any pointer", !554, i64 0}
!554 = !{!"omnipotent char", !555, i64 0}
!555 = !{!"Simple C/C++ TBAA"}
!556 = !DILocation(line: 73, column: 24, scope: !544)
!557 = !DILocation(line: 77, column: 21, scope: !544)
!558 = !{!552, !553, i64 16}
!559 = !DILocation(line: 73, column: 32, scope: !544)
!560 = !DILocation(line: 78, column: 16, scope: !561)
!561 = distinct !DILexicalBlock(scope: !544, file: !1, line: 78, column: 11)
!562 = !DILocation(line: 78, column: 11, scope: !544)
!563 = !DILocation(line: 80, column: 17, scope: !564)
!564 = distinct !DILexicalBlock(scope: !561, file: !1, line: 79, column: 9)
!565 = !DILocation(line: 80, column: 25, scope: !564)
!566 = !DILocation(line: 81, column: 9, scope: !564)
!567 = !DILocation(line: 82, column: 16, scope: !568)
!568 = distinct !DILexicalBlock(scope: !544, file: !1, line: 82, column: 11)
!569 = !DILocation(line: 82, column: 11, scope: !544)
!570 = !DILocation(line: 84, column: 17, scope: !571)
!571 = distinct !DILexicalBlock(scope: !568, file: !1, line: 83, column: 9)
!572 = !DILocation(line: 84, column: 25, scope: !571)
!573 = !DILocation(line: 85, column: 9, scope: !571)
!574 = !DILocation(line: 87, column: 18, scope: !575)
!575 = distinct !DILexicalBlock(scope: !544, file: !1, line: 87, column: 11)
!576 = !{!552, !553, i64 0}
!577 = !DILocation(line: 87, column: 26, scope: !575)
!578 = !{!579, !553, i64 176}
!579 = !{!"pte_thread_t_", !553, i64 0, !580, i64 8, !553, i64 24, !554, i64 32, !553, i64 40, !553, i64 48, !581, i64 56, !581, i64 60, !553, i64 64, !581, i64 72, !553, i64 80, !581, i64 88, !581, i64 92, !581, i64 96, !554, i64 104, !581, i64 168, !553, i64 176, !553, i64 184}
!580 = !{!"", !553, i64 0, !581, i64 8}
!581 = !{!"int", !554, i64 0}
!582 = !DILocation(line: 87, column: 34, scope: !575)
!583 = !DILocation(line: 87, column: 31, scope: !575)
!584 = !DILocation(line: 87, column: 11, scope: !544)
!585 = !DILocation(line: 90, column: 31, scope: !586)
!586 = distinct !DILexicalBlock(scope: !575, file: !1, line: 88, column: 9)
!587 = !DILocation(line: 91, column: 9, scope: !586)
!588 = !DILocation(line: 92, column: 26, scope: !589)
!589 = distinct !DILexicalBlock(scope: !544, file: !1, line: 92, column: 11)
!590 = !{!579, !553, i64 184}
!591 = !DILocation(line: 92, column: 36, scope: !589)
!592 = !DILocation(line: 92, column: 11, scope: !544)
!593 = !DILocation(line: 98, column: 36, scope: !594)
!594 = distinct !DILexicalBlock(scope: !589, file: !1, line: 93, column: 9)
!595 = !DILocation(line: 99, column: 9, scope: !594)
!596 = !DILocation(line: 102, column: 21, scope: !544)
!597 = !{!552, !553, i64 40}
!598 = !DILocation(line: 103, column: 21, scope: !544)
!599 = !{!552, !553, i64 24}
!600 = !DILocation(line: 104, column: 16, scope: !601)
!601 = distinct !DILexicalBlock(scope: !544, file: !1, line: 104, column: 11)
!602 = !DILocation(line: 104, column: 11, scope: !544)
!603 = !DILocation(line: 106, column: 17, scope: !604)
!604 = distinct !DILexicalBlock(scope: !601, file: !1, line: 105, column: 9)
!605 = !DILocation(line: 106, column: 28, scope: !604)
