; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_throw.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_throw.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pthread_key_t_ = type { i32, void (i8*)*, %struct.pthread_mutex_t_*, i8* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_throw.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 61, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18, !19}
!13 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!20 = !{!21, !37, !516}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !11, line: 83, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !11, line: 85, size: 1536, elements: !24)
!24 = !{!25, !470, !478, !479, !482, !483, !484, !485, !486, !503, !504, !505, !506, !507, !508, !513, !514, !515}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !23, file: !11, line: 87, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !27, line: 11, baseType: !28)
!27 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !30, line: 59, size: 1024, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !36, !38, !39, !40, !46, !51, !57, !59, !76, !225, !226, !227, !440}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !30, line: 60, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !29, file: !30, line: 61, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !29, file: !30, line: 62, baseType: !37, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !29, file: !30, line: 63, baseType: !37, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !29, file: !30, line: 64, baseType: !41, size: 128, offset: 256)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !30, line: 64, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !41, file: !30, line: 64, baseType: !28, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !41, file: !30, line: 64, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !30, line: 65, baseType: !47, size: 32, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !48, line: 48, baseType: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !50, line: 79, baseType: !5)
!50 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !29, file: !30, line: 66, baseType: !52, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !53, line: 49, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !55, line: 128, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !29, file: !30, line: 67, baseType: !58, size: 8, offset: 512)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !29, file: !30, line: 68, baseType: !60, size: 128, offset: 576)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !61, line: 42, size: 128, elements: !62)
!61 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !{!63, !74}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !60, file: !61, line: 42, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !61, line: 35, size: 192, elements: !66)
!66 = !{!67, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !65, file: !61, line: 36, baseType: !68, size: 32)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !65, file: !61, line: 37, baseType: !28, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !65, file: !61, line: 38, baseType: !71, size: 64, offset: 128)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !65, file: !61, line: 38, size: 64, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !71, file: !61, line: 38, baseType: !64, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !60, file: !61, line: 42, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !29, file: !30, line: 69, baseType: !77, size: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !79, line: 90, size: 2176, elements: !80)
!79 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !{!81, !86, !104, !109, !111, !113, !118, !126, !131, !137, !138, !139, !144, !222, !223, !224}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !78, file: !79, line: 91, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !79, line: 68, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !77}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !78, file: !79, line: 93, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !79, line: 71, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!68, !77, !28, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !94, line: 62, baseType: !95)
!94 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !94, line: 55, size: 128, elements: !96)
!96 = !{!97, !98, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !95, file: !94, line: 57, baseType: !58, size: 8)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !95, file: !94, line: 59, baseType: !99, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !94, line: 53, baseType: !68)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !95, file: !94, line: 61, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !53, line: 48, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !55, line: 129, baseType: !103)
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !78, file: !79, line: 94, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !79, line: 74, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !77, !28}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !78, file: !79, line: 95, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !79, line: 76, baseType: !106)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !78, file: !79, line: 96, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !79, line: 78, baseType: !106)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !78, file: !79, line: 98, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !79, line: 81, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!68, !77, !28, !99}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !78, file: !79, line: 99, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !79, line: 83, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!68, !77, !123, !125}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !78, file: !79, line: 100, baseType: !127, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !79, line: 85, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!68, !77, !28, !68}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !78, file: !79, line: 101, baseType: !132, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !79, line: 87, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!68, !77, !123, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !78, file: !79, line: 104, baseType: !58, size: 8, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !78, file: !79, line: 105, baseType: !29, size: 1024, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !78, file: !79, line: 106, baseType: !140, size: 128, offset: 1664)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !30, line: 93, size: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !140, file: !30, line: 93, baseType: !28, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !140, file: !30, line: 93, baseType: !45, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !78, file: !79, line: 107, baseType: !145, size: 192, offset: 1792)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !146, line: 59, size: 192, elements: !147)
!146 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!147 = !{!148, !213, !217}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !145, file: !146, line: 61, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !146, line: 51, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!37, !153, !103, !103}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !155, line: 77, size: 832, elements: !156)
!155 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !{!157, !164, !169, !174, !180, !182, !187, !188, !189, !194, !199, !204, !205, !206}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !154, file: !155, line: 79, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !155, line: 54, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!37, !153, !162}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 58, baseType: !103)
!163 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !154, file: !155, line: 80, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !155, line: 56, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!37, !153, !162, !162}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !154, file: !155, line: 81, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !155, line: 62, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!37, !153, !37, !162}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !154, file: !155, line: 82, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !155, line: 58, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!68, !153, !179, !162, !162}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !154, file: !155, line: 83, baseType: !181, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !155, line: 60, baseType: !166)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !154, file: !155, line: 84, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !155, line: 64, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !153, !37}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !154, file: !155, line: 87, baseType: !183, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !154, file: !155, line: 88, baseType: !158, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !154, file: !155, line: 92, baseType: !190, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !155, line: 66, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!37, !153, !103}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !154, file: !155, line: 93, baseType: !195, size: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !155, line: 68, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !153, !37, !103}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !154, file: !155, line: 99, baseType: !200, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !155, line: 70, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!68, !153, !37, !162}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !154, file: !155, line: 100, baseType: !162, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !155, line: 103, baseType: !153, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !154, file: !155, line: 104, baseType: !207, offset: 832)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, elements: !211)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !48, line: 20, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !50, line: 41, baseType: !210)
!210 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!211 = !{!212}
!212 = !DISubrange(count: -1)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !145, file: !146, line: 63, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !37}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !145, file: !146, line: 65, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !146, line: 56, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !37, !37}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !78, file: !79, line: 108, baseType: !153, size: 64, offset: 1984)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !79, line: 109, baseType: !77, size: 64, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !78, file: !79, line: 110, baseType: !37, size: 64, offset: 2112)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !29, file: !30, line: 70, baseType: !37, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !29, file: !30, line: 72, baseType: !68, size: 32, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !29, file: !30, line: 82, baseType: !228, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !230, line: 569, size: 14912, elements: !231)
!230 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!231 = !{!232, !233, !308, !309, !310, !311, !315, !316, !319, !320, !324, !336, !337, !338, !340, !341, !342, !404, !425, !426, !431, !438}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !229, file: !230, line: 571, baseType: !68, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !229, file: !230, line: 576, baseType: !234, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !230, line: 287, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !230, line: 181, size: 1408, elements: !237)
!237 = !{!238, !241, !242, !243, !245, !246, !251, !252, !253, !260, !264, !269, !273, !274, !275, !276, !280, !284, !285, !286, !288, !289, !293, !307}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !236, file: !230, line: 182, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !236, file: !230, line: 183, baseType: !68, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !236, file: !230, line: 184, baseType: !68, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !236, file: !230, line: 185, baseType: !244, size: 16, offset: 128)
!244 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !236, file: !230, line: 186, baseType: !244, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !236, file: !230, line: 187, baseType: !247, size: 128, offset: 192)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !230, line: 117, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !247, file: !230, line: 118, baseType: !239, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !247, file: !230, line: 119, baseType: !68, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !236, file: !230, line: 188, baseType: !68, size: 32, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !236, file: !230, line: 195, baseType: !37, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !236, file: !230, line: 197, baseType: !254, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !228, !37, !259, !68}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !258, line: 145, baseType: !56)
!258 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !236, file: !230, line: 199, baseType: !261, size: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!257, !228, !37, !33, !68}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !236, file: !230, line: 202, baseType: !265, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !228, !37, !268, !68}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !258, line: 114, baseType: !56)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !236, file: !230, line: 203, baseType: !270, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!68, !228, !37}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !236, file: !230, line: 206, baseType: !247, size: 128, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !236, file: !230, line: 207, baseType: !239, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !236, file: !230, line: 208, baseType: !68, size: 32, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !236, file: !230, line: 211, baseType: !277, size: 24, offset: 928)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 24, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 3)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !236, file: !230, line: 212, baseType: !281, size: 8, offset: 952)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 8, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 1)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !236, file: !230, line: 215, baseType: !247, size: 128, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !236, file: !230, line: 218, baseType: !68, size: 32, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !236, file: !230, line: 219, baseType: !287, size: 64, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !258, line: 44, baseType: !56)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !236, file: !230, line: 222, baseType: !228, size: 64, offset: 1216)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !236, file: !230, line: 226, baseType: !290, size: 32, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !258, line: 175, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !292, line: 12, baseType: !68)
!292 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !236, file: !230, line: 228, baseType: !294, size: 64, offset: 1312)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !258, line: 171, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 163, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !258, line: 165, baseType: !68, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !258, line: 170, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !258, line: 166, size: 32, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !258, line: 168, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !163, line: 124, baseType: !5)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !258, line: 169, baseType: !304, size: 32)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 32, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 4)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !236, file: !230, line: 229, baseType: !68, size: 32, offset: 1376)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !229, file: !230, line: 576, baseType: !234, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !229, file: !230, line: 576, baseType: !234, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !229, file: !230, line: 578, baseType: !68, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !229, file: !230, line: 579, baseType: !312, size: 200, offset: 288)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 200, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 25)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !229, file: !230, line: 582, baseType: !68, size: 32, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !229, file: !230, line: 583, baseType: !317, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !230, line: 40, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !229, file: !230, line: 585, baseType: !68, size: 32, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !229, file: !230, line: 587, baseType: !321, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !228}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !229, file: !230, line: 590, baseType: !325, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !230, line: 47, size: 256, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !326, file: !230, line: 49, baseType: !325, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !326, file: !230, line: 50, baseType: !68, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !326, file: !230, line: 50, baseType: !68, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !326, file: !230, line: 50, baseType: !68, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !326, file: !230, line: 50, baseType: !68, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !326, file: !230, line: 51, baseType: !334, size: 32, offset: 192)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 32, elements: !282)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !230, line: 25, baseType: !5)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !229, file: !230, line: 591, baseType: !68, size: 32, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !229, file: !230, line: 592, baseType: !325, size: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !229, file: !230, line: 593, baseType: !339, size: 64, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !229, file: !230, line: 596, baseType: !68, size: 32, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !229, file: !230, line: 597, baseType: !259, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !229, file: !230, line: 632, baseType: !343, size: 2880, offset: 1152)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !230, line: 599, size: 2880, elements: !344)
!344 = !{!345, !395}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !343, file: !230, line: 622, baseType: !346, size: 1728)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !230, line: 601, size: 1728, elements: !347)
!347 = !{!348, !349, !350, !354, !366, !367, !369, !377, !378, !379, !380, !384, !388, !389, !390, !391, !392, !393, !394}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !346, file: !230, line: 603, baseType: !5, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !346, file: !230, line: 604, baseType: !259, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !346, file: !230, line: 605, baseType: !351, size: 208, offset: 128)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 208, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 26)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !346, file: !230, line: 606, baseType: !355, size: 288, offset: 352)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !230, line: 55, size: 288, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !355, file: !230, line: 57, baseType: !68, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !355, file: !230, line: 58, baseType: !68, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !355, file: !230, line: 59, baseType: !68, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !355, file: !230, line: 60, baseType: !68, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !355, file: !230, line: 61, baseType: !68, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !355, file: !230, line: 62, baseType: !68, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !355, file: !230, line: 63, baseType: !68, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !355, file: !230, line: 64, baseType: !68, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !355, file: !230, line: 65, baseType: !68, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !346, file: !230, line: 607, baseType: !68, size: 32, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !346, file: !230, line: 608, baseType: !368, size: 64, offset: 704)
!368 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !346, file: !230, line: 609, baseType: !370, size: 112, offset: 768)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !230, line: 319, size: 112, elements: !371)
!371 = !{!372, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !370, file: !230, line: 320, baseType: !373, size: 48)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 48, elements: !278)
!374 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !370, file: !230, line: 321, baseType: !373, size: 48, offset: 48)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !370, file: !230, line: 322, baseType: !374, size: 16, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !346, file: !230, line: 610, baseType: !294, size: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !346, file: !230, line: 611, baseType: !294, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !346, file: !230, line: 612, baseType: !294, size: 64, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !346, file: !230, line: 613, baseType: !381, size: 64, offset: 1088)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !346, file: !230, line: 614, baseType: !385, size: 192, offset: 1152)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 24)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !346, file: !230, line: 615, baseType: !68, size: 32, offset: 1344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !346, file: !230, line: 616, baseType: !294, size: 64, offset: 1376)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !346, file: !230, line: 617, baseType: !294, size: 64, offset: 1440)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !346, file: !230, line: 618, baseType: !294, size: 64, offset: 1504)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !346, file: !230, line: 619, baseType: !294, size: 64, offset: 1568)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !346, file: !230, line: 620, baseType: !294, size: 64, offset: 1632)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !346, file: !230, line: 621, baseType: !68, size: 32, offset: 1696)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !343, file: !230, line: 631, baseType: !396, size: 2880)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !230, line: 626, size: 2880, elements: !397)
!397 = !{!398, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !396, file: !230, line: 629, baseType: !399, size: 1920)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1920, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 30)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !396, file: !230, line: 630, baseType: !403, size: 960, offset: 1920)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !400)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !229, file: !230, line: 636, baseType: !405, size: 64, offset: 4032)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !230, line: 93, size: 6336, elements: !407)
!407 = !{!408, !409, !410, !417}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !406, file: !230, line: 94, baseType: !405, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !406, file: !230, line: 95, baseType: !68, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !406, file: !230, line: 97, baseType: !411, size: 2048, offset: 128)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 2048, elements: !415)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null}
!415 = !{!416}
!416 = !DISubrange(count: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !406, file: !230, line: 98, baseType: !418, size: 4160, offset: 2176)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !230, line: 74, size: 4160, elements: !419)
!419 = !{!420, !422, !423, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !418, file: !230, line: 75, baseType: !421, size: 2048)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !415)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !418, file: !230, line: 76, baseType: !421, size: 2048, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !418, file: !230, line: 78, baseType: !335, size: 32, offset: 4096)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !418, file: !230, line: 81, baseType: !335, size: 32, offset: 4128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !229, file: !230, line: 637, baseType: !406, size: 6336, offset: 4096)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !229, file: !230, line: 641, baseType: !427, size: 64, offset: 10432)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !68}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !229, file: !230, line: 646, baseType: !432, size: 192, offset: 10496)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !230, line: 291, size: 192, elements: !433)
!433 = !{!434, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !432, file: !230, line: 293, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !432, file: !230, line: 294, baseType: !68, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !432, file: !230, line: 295, baseType: !234, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !229, file: !230, line: 648, baseType: !439, size: 4224, offset: 10688)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 4224, elements: !278)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !29, file: !30, line: 85, baseType: !441, size: 64, offset: 960)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !443)
!443 = !{!444, !448, !449, !456, !469}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !442, file: !4, line: 116, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !446, line: 64, baseType: !447)
!446 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !446, line: 63, baseType: !103)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !442, file: !4, line: 118, baseType: !445, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !442, file: !4, line: 120, baseType: !450, size: 128, offset: 128)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !451, line: 51, size: 128, elements: !452)
!451 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!452 = !{!453, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !451, line: 52, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !451, line: 53, baseType: !454, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !442, file: !4, line: 122, baseType: !457, size: 256, offset: 256)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !457, file: !4, line: 107, baseType: !3, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !457, file: !4, line: 109, baseType: !445, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !457, file: !4, line: 111, baseType: !462, size: 96, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !446, line: 72, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 68, size: 96, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !463, file: !446, line: 69, baseType: !68, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !463, file: !446, line: 70, baseType: !68, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !463, file: !446, line: 71, baseType: !468, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !446, line: 61, baseType: !68)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !442, file: !4, line: 124, baseType: !450, size: 128, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !23, file: !11, line: 88, baseType: !471, size: 128, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !472, line: 413, baseType: !473)
!472 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !472, line: 411, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 395, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !474, file: !472, line: 398, baseType: !37, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !474, file: !472, line: 399, baseType: !5, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !23, file: !11, line: 89, baseType: !21, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !23, file: !11, line: 90, baseType: !480, size: 32, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !11, line: 80, baseType: !10)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !23, file: !11, line: 91, baseType: !37, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !23, file: !11, line: 92, baseType: !37, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !23, file: !11, line: 93, baseType: !68, size: 32, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !23, file: !11, line: 94, baseType: !68, size: 32, offset: 480)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !23, file: !11, line: 95, baseType: !487, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !472, line: 417, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !11, line: 146, size: 320, elements: !490)
!490 = !{!491, !499, !500, !501, !502}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !489, file: !11, line: 148, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !27, line: 12, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !495, line: 51, size: 192, elements: !496)
!495 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !494, file: !495, line: 52, baseType: !56, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !494, file: !495, line: 53, baseType: !60, size: 128, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !489, file: !11, line: 149, baseType: !68, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !489, file: !11, line: 156, baseType: !68, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !489, file: !11, line: 159, baseType: !68, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !489, file: !11, line: 160, baseType: !471, size: 128, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !23, file: !11, line: 96, baseType: !68, size: 32, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !23, file: !11, line: 97, baseType: !487, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !23, file: !11, line: 98, baseType: !68, size: 32, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !23, file: !11, line: 99, baseType: !68, size: 32, offset: 736)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !23, file: !11, line: 100, baseType: !68, size: 32, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !23, file: !11, line: 102, baseType: !509, size: 512, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !510, line: 372, baseType: !511)
!510 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 512, elements: !382)
!512 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !23, file: !11, line: 104, baseType: !68, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !23, file: !11, line: 106, baseType: !37, size: 64, offset: 1408)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !23, file: !11, line: 107, baseType: !37, size: 64, offset: 1472)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !517, line: 40, baseType: !518)
!517 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !258, line: 129, baseType: !103)
!519 = !{i32 2, !"Dwarf Version", i32 4}
!520 = !{i32 2, !"Debug Info Version", i32 3}
!521 = !{i32 1, !"wchar_size", i32 4}
!522 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!523 = distinct !DISubprogram(name: "pte_throw", scope: !1, file: !1, line: 57, type: !524, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !5}
!526 = !{!527, !528}
!527 = !DILocalVariable(name: "exception", arg: 1, scope: !523, file: !1, line: 57, type: !5)
!528 = !DILocalVariable(name: "sp", scope: !523, file: !1, line: 63, type: !21)
!529 = !DILocation(line: 57, column: 25, scope: !523)
!530 = !DILocation(line: 63, column: 61, scope: !523)
!531 = !{!532, !532, i64 0}
!532 = !{!"any pointer", !533, i64 0}
!533 = !{!"omnipotent char", !534, i64 0}
!534 = !{!"Simple C/C++ TBAA"}
!535 = !DILocation(line: 63, column: 40, scope: !523)
!536 = !DILocation(line: 63, column: 18, scope: !523)
!537 = !DILocation(line: 66, column: 35, scope: !538)
!538 = distinct !DILexicalBlock(scope: !523, file: !1, line: 66, column: 7)
!539 = !DILocation(line: 69, column: 7, scope: !540)
!540 = distinct !DILexicalBlock(scope: !538, file: !1, line: 67, column: 5)
!541 = !DILocation(line: 72, column: 12, scope: !542)
!542 = distinct !DILexicalBlock(scope: !523, file: !1, line: 72, column: 7)
!543 = !DILocation(line: 72, column: 18, scope: !542)
!544 = !DILocation(line: 72, column: 25, scope: !542)
!545 = !DILocation(line: 72, column: 21, scope: !542)
!546 = !DILocation(line: 72, column: 7, scope: !523)
!547 = !DILocation(line: 94, column: 7, scope: !548)
!548 = distinct !DILexicalBlock(scope: !542, file: !1, line: 73, column: 5)
!549 = !DILocation(line: 98, column: 5, scope: !548)
!550 = !DILocation(line: 102, column: 3, scope: !523)
!551 = !DILocation(line: 103, column: 16, scope: !523)
!552 = !DILocation(line: 103, column: 12, scope: !523)
!553 = !DILocation(line: 103, column: 3, scope: !523)
!554 = distinct !DISubprogram(name: "pte_pop_cleanup_all", scope: !1, file: !1, line: 132, type: !429, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !555)
!555 = !{!556}
!556 = !DILocalVariable(name: "execute", arg: 1, scope: !554, file: !1, line: 132, type: !68)
!557 = !DILocation(line: 132, column: 26, scope: !554)
!558 = !DILocation(line: 134, column: 3, scope: !554)
!559 = !DILocation(line: 134, column: 18, scope: !554)
!560 = !DILocation(line: 134, column: 15, scope: !554)
!561 = distinct !{!561, !558, !562}
!562 = !DILocation(line: 136, column: 5, scope: !554)
!563 = !DILocation(line: 137, column: 1, scope: !554)
!564 = distinct !DISubprogram(name: "pte_get_exception_services_code", scope: !1, file: !1, line: 141, type: !565, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!516}
!567 = !{}
!568 = !DILocation(line: 143, column: 3, scope: !564)
