; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_kill.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_kill.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_mutex = type { i32, %struct.uk_thread*, %struct.uk_waitq }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }
%struct.uk_thread_list = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_kill.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 61, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18, !19}
!13 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!20 = !{!21, !37}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !11, line: 83, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !11, line: 85, size: 1536, elements: !24)
!24 = !{!25, !472, !480, !481, !484, !485, !486, !487, !488, !505, !506, !507, !508, !509, !510, !515, !516, !517}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !23, file: !11, line: 87, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !27, line: 11, baseType: !28)
!27 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !30, line: 59, size: 1024, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !36, !38, !39, !40, !46, !51, !57, !59, !76, !227, !228, !229, !442}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !30, line: 60, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !29, file: !30, line: 61, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !29, file: !30, line: 62, baseType: !37, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !29, file: !30, line: 63, baseType: !37, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !29, file: !30, line: 64, baseType: !41, size: 128, offset: 256)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !30, line: 64, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !41, file: !30, line: 64, baseType: !28, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !41, file: !30, line: 64, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !30, line: 65, baseType: !47, size: 32, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !48, line: 48, baseType: !49)
!48 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !50, line: 79, baseType: !5)
!50 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !29, file: !30, line: 66, baseType: !52, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !53, line: 49, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !55, line: 128, baseType: !56)
!55 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !29, file: !30, line: 67, baseType: !58, size: 8, offset: 512)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !29, file: !30, line: 68, baseType: !60, size: 128, offset: 576)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !61, line: 42, size: 128, elements: !62)
!61 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !{!63, !74}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !60, file: !61, line: 42, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !61, line: 35, size: 192, elements: !66)
!66 = !{!67, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !65, file: !61, line: 36, baseType: !68, size: 32)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !65, file: !61, line: 37, baseType: !28, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !65, file: !61, line: 38, baseType: !71, size: 64, offset: 128)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !65, file: !61, line: 38, size: 64, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !71, file: !61, line: 38, baseType: !64, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !60, file: !61, line: 42, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !29, file: !30, line: 69, baseType: !77, size: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !79, line: 90, size: 2176, elements: !80)
!79 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !{!81, !86, !104, !109, !111, !113, !118, !126, !131, !137, !138, !139, !144, !224, !225, !226}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !78, file: !79, line: 91, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !79, line: 68, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !77}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !78, file: !79, line: 93, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !79, line: 71, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!68, !77, !28, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !94, line: 62, baseType: !95)
!94 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !94, line: 55, size: 128, elements: !96)
!96 = !{!97, !98, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !95, file: !94, line: 57, baseType: !58, size: 8)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !95, file: !94, line: 59, baseType: !99, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !94, line: 53, baseType: !68)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !95, file: !94, line: 61, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !53, line: 48, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !55, line: 129, baseType: !103)
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !78, file: !79, line: 94, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !79, line: 74, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !77, !28}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !78, file: !79, line: 95, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !79, line: 76, baseType: !106)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !78, file: !79, line: 96, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !79, line: 78, baseType: !106)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !78, file: !79, line: 98, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !79, line: 81, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!68, !77, !28, !99}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !78, file: !79, line: 99, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !79, line: 83, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!68, !77, !123, !125}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !78, file: !79, line: 100, baseType: !127, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !79, line: 85, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!68, !77, !28, !68}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !78, file: !79, line: 101, baseType: !132, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !79, line: 87, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!68, !77, !123, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !78, file: !79, line: 104, baseType: !58, size: 8, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !78, file: !79, line: 105, baseType: !29, size: 1024, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !78, file: !79, line: 106, baseType: !140, size: 128, offset: 1664)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !30, line: 93, size: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !140, file: !30, line: 93, baseType: !28, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !140, file: !30, line: 93, baseType: !45, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !78, file: !79, line: 107, baseType: !145, size: 192, offset: 1792)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !146, line: 59, size: 192, elements: !147)
!146 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!147 = !{!148, !215, !219}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !145, file: !146, line: 61, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !146, line: 51, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!37, !153, !103, !103}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !155, line: 77, size: 832, elements: !156)
!155 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !{!157, !166, !171, !176, !182, !184, !189, !190, !191, !196, !201, !206, !207, !208}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !154, file: !155, line: 79, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !155, line: 54, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!37, !153, !162}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 40, baseType: !164)
!163 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !165, line: 129, baseType: !103)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!166 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !154, file: !155, line: 80, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !155, line: 56, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!37, !153, !162, !162}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !154, file: !155, line: 81, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !155, line: 62, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!37, !153, !37, !162}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !154, file: !155, line: 82, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !155, line: 58, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!68, !153, !181, !162, !162}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !154, file: !155, line: 83, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !155, line: 60, baseType: !168)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !154, file: !155, line: 84, baseType: !185, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !155, line: 64, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !153, !37}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !154, file: !155, line: 87, baseType: !185, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !154, file: !155, line: 88, baseType: !158, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !154, file: !155, line: 92, baseType: !192, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !155, line: 66, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!37, !153, !103}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !154, file: !155, line: 93, baseType: !197, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !155, line: 68, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !153, !37, !103}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !154, file: !155, line: 99, baseType: !202, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !155, line: 70, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!68, !153, !37, !162}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !154, file: !155, line: 100, baseType: !162, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !155, line: 103, baseType: !153, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !154, file: !155, line: 104, baseType: !209, offset: 832)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, elements: !213)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !48, line: 20, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !50, line: 41, baseType: !212)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !{!214}
!214 = !DISubrange(count: -1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !145, file: !146, line: 63, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !37}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !145, file: !146, line: 65, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !146, line: 56, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !37, !37}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !78, file: !79, line: 108, baseType: !153, size: 64, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !79, line: 109, baseType: !77, size: 64, offset: 2048)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !78, file: !79, line: 110, baseType: !37, size: 64, offset: 2112)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !29, file: !30, line: 70, baseType: !37, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !29, file: !30, line: 72, baseType: !68, size: 32, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !29, file: !30, line: 82, baseType: !230, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !232, line: 569, size: 14912, elements: !233)
!232 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!233 = !{!234, !235, !310, !311, !312, !313, !317, !318, !321, !322, !326, !338, !339, !340, !342, !343, !344, !406, !427, !428, !433, !440}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !231, file: !232, line: 571, baseType: !68, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !231, file: !232, line: 576, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !232, line: 287, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !232, line: 181, size: 1408, elements: !239)
!239 = !{!240, !243, !244, !245, !247, !248, !253, !254, !255, !261, !265, !270, !274, !275, !276, !277, !281, !285, !286, !287, !289, !290, !294, !309}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !238, file: !232, line: 182, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !238, file: !232, line: 183, baseType: !68, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !238, file: !232, line: 184, baseType: !68, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !238, file: !232, line: 185, baseType: !246, size: 16, offset: 128)
!246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !238, file: !232, line: 186, baseType: !246, size: 16, offset: 144)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !238, file: !232, line: 187, baseType: !249, size: 128, offset: 192)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !232, line: 117, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !249, file: !232, line: 118, baseType: !241, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !249, file: !232, line: 119, baseType: !68, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !238, file: !232, line: 188, baseType: !68, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !238, file: !232, line: 195, baseType: !37, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !238, file: !232, line: 197, baseType: !256, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !230, !37, !260, !68}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !165, line: 145, baseType: !56)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !238, file: !232, line: 199, baseType: !262, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!259, !230, !37, !33, !68}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !238, file: !232, line: 202, baseType: !266, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !230, !37, !269, !68}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !165, line: 114, baseType: !56)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !238, file: !232, line: 203, baseType: !271, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!68, !230, !37}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !238, file: !232, line: 206, baseType: !249, size: 128, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !238, file: !232, line: 207, baseType: !241, size: 64, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !238, file: !232, line: 208, baseType: !68, size: 32, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !238, file: !232, line: 211, baseType: !278, size: 24, offset: 928)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 24, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 3)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !238, file: !232, line: 212, baseType: !282, size: 8, offset: 952)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 8, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 1)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !238, file: !232, line: 215, baseType: !249, size: 128, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !238, file: !232, line: 218, baseType: !68, size: 32, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !238, file: !232, line: 219, baseType: !288, size: 64, offset: 1152)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !165, line: 44, baseType: !56)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !238, file: !232, line: 222, baseType: !230, size: 64, offset: 1216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !238, file: !232, line: 226, baseType: !291, size: 32, offset: 1280)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !165, line: 175, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !293, line: 12, baseType: !68)
!293 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !238, file: !232, line: 228, baseType: !295, size: 64, offset: 1312)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !165, line: 171, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 163, size: 64, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !296, file: !165, line: 165, baseType: !68, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !296, file: !165, line: 170, baseType: !300, size: 32, offset: 32)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !296, file: !165, line: 166, size: 32, elements: !301)
!301 = !{!302, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !300, file: !165, line: 168, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !304, line: 124, baseType: !5)
!304 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !300, file: !165, line: 169, baseType: !306, size: 32)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 32, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 4)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !238, file: !232, line: 229, baseType: !68, size: 32, offset: 1376)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !231, file: !232, line: 576, baseType: !236, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !231, file: !232, line: 576, baseType: !236, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !231, file: !232, line: 578, baseType: !68, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !231, file: !232, line: 579, baseType: !314, size: 200, offset: 288)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 200, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 25)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !231, file: !232, line: 582, baseType: !68, size: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !231, file: !232, line: 583, baseType: !319, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !232, line: 40, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !231, file: !232, line: 585, baseType: !68, size: 32, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !231, file: !232, line: 587, baseType: !323, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !230}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !231, file: !232, line: 590, baseType: !327, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !232, line: 47, size: 256, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !328, file: !232, line: 49, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !328, file: !232, line: 50, baseType: !68, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !328, file: !232, line: 50, baseType: !68, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !328, file: !232, line: 50, baseType: !68, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !328, file: !232, line: 50, baseType: !68, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !328, file: !232, line: 51, baseType: !336, size: 32, offset: 192)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !283)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !232, line: 25, baseType: !5)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !231, file: !232, line: 591, baseType: !68, size: 32, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !231, file: !232, line: 592, baseType: !327, size: 64, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !231, file: !232, line: 593, baseType: !341, size: 64, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !231, file: !232, line: 596, baseType: !68, size: 32, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !231, file: !232, line: 597, baseType: !260, size: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !231, file: !232, line: 632, baseType: !345, size: 2880, offset: 1152)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !232, line: 599, size: 2880, elements: !346)
!346 = !{!347, !397}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !345, file: !232, line: 622, baseType: !348, size: 1728)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !232, line: 601, size: 1728, elements: !349)
!349 = !{!350, !351, !352, !356, !368, !369, !371, !379, !380, !381, !382, !386, !390, !391, !392, !393, !394, !395, !396}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !348, file: !232, line: 603, baseType: !5, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !348, file: !232, line: 604, baseType: !260, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !348, file: !232, line: 605, baseType: !353, size: 208, offset: 128)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 208, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 26)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !348, file: !232, line: 606, baseType: !357, size: 288, offset: 352)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !232, line: 55, size: 288, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !357, file: !232, line: 57, baseType: !68, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !357, file: !232, line: 58, baseType: !68, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !357, file: !232, line: 59, baseType: !68, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !357, file: !232, line: 60, baseType: !68, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !357, file: !232, line: 61, baseType: !68, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !357, file: !232, line: 62, baseType: !68, size: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !357, file: !232, line: 63, baseType: !68, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !357, file: !232, line: 64, baseType: !68, size: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !357, file: !232, line: 65, baseType: !68, size: 32, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !348, file: !232, line: 607, baseType: !68, size: 32, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !348, file: !232, line: 608, baseType: !370, size: 64, offset: 704)
!370 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !348, file: !232, line: 609, baseType: !372, size: 112, offset: 768)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !232, line: 319, size: 112, elements: !373)
!373 = !{!374, !377, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !372, file: !232, line: 320, baseType: !375, size: 48)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 48, elements: !279)
!376 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !372, file: !232, line: 321, baseType: !375, size: 48, offset: 48)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !372, file: !232, line: 322, baseType: !376, size: 16, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !348, file: !232, line: 610, baseType: !295, size: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !348, file: !232, line: 611, baseType: !295, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !348, file: !232, line: 612, baseType: !295, size: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !348, file: !232, line: 613, baseType: !383, size: 64, offset: 1088)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !348, file: !232, line: 614, baseType: !387, size: 192, offset: 1152)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 24)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !348, file: !232, line: 615, baseType: !68, size: 32, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !348, file: !232, line: 616, baseType: !295, size: 64, offset: 1376)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !348, file: !232, line: 617, baseType: !295, size: 64, offset: 1440)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !348, file: !232, line: 618, baseType: !295, size: 64, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !348, file: !232, line: 619, baseType: !295, size: 64, offset: 1568)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !348, file: !232, line: 620, baseType: !295, size: 64, offset: 1632)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !348, file: !232, line: 621, baseType: !68, size: 32, offset: 1696)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !345, file: !232, line: 631, baseType: !398, size: 2880)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !232, line: 626, size: 2880, elements: !399)
!399 = !{!400, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !398, file: !232, line: 629, baseType: !401, size: 1920)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 1920, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 30)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !398, file: !232, line: 630, baseType: !405, size: 960, offset: 1920)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !402)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !231, file: !232, line: 636, baseType: !407, size: 64, offset: 4032)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !232, line: 93, size: 6336, elements: !409)
!409 = !{!410, !411, !412, !419}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !408, file: !232, line: 94, baseType: !407, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !408, file: !232, line: 95, baseType: !68, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !408, file: !232, line: 97, baseType: !413, size: 2048, offset: 128)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 2048, elements: !417)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null}
!417 = !{!418}
!418 = !DISubrange(count: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !408, file: !232, line: 98, baseType: !420, size: 4160, offset: 2176)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !232, line: 74, size: 4160, elements: !421)
!421 = !{!422, !424, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !420, file: !232, line: 75, baseType: !423, size: 2048)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !417)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !420, file: !232, line: 76, baseType: !423, size: 2048, offset: 2048)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !420, file: !232, line: 78, baseType: !337, size: 32, offset: 4096)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !420, file: !232, line: 81, baseType: !337, size: 32, offset: 4128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !231, file: !232, line: 637, baseType: !408, size: 6336, offset: 4096)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !231, file: !232, line: 641, baseType: !429, size: 64, offset: 10432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !68}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !231, file: !232, line: 646, baseType: !434, size: 192, offset: 10496)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !232, line: 291, size: 192, elements: !435)
!435 = !{!436, !438, !439}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !434, file: !232, line: 293, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !434, file: !232, line: 294, baseType: !68, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !434, file: !232, line: 295, baseType: !236, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !231, file: !232, line: 648, baseType: !441, size: 4224, offset: 10688)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 4224, elements: !279)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !29, file: !30, line: 85, baseType: !443, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !445)
!445 = !{!446, !450, !451, !458, !471}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !444, file: !4, line: 116, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !448, line: 64, baseType: !449)
!448 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !448, line: 63, baseType: !103)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !444, file: !4, line: 118, baseType: !447, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !444, file: !4, line: 120, baseType: !452, size: 128, offset: 128)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !453, line: 51, size: 128, elements: !454)
!453 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!454 = !{!455, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !452, file: !453, line: 52, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !452, file: !453, line: 53, baseType: !456, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !444, file: !4, line: 122, baseType: !459, size: 256, offset: 256)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !459, file: !4, line: 107, baseType: !3, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !459, file: !4, line: 109, baseType: !447, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !459, file: !4, line: 111, baseType: !464, size: 96, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !448, line: 72, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 68, size: 96, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !465, file: !448, line: 69, baseType: !68, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !465, file: !448, line: 70, baseType: !68, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !465, file: !448, line: 71, baseType: !470, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !448, line: 61, baseType: !68)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !444, file: !4, line: 124, baseType: !452, size: 128, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !23, file: !11, line: 88, baseType: !473, size: 128, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !474, line: 413, baseType: !475)
!474 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !474, line: 411, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 395, size: 128, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !476, file: !474, line: 398, baseType: !37, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !476, file: !474, line: 399, baseType: !5, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !23, file: !11, line: 89, baseType: !21, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !23, file: !11, line: 90, baseType: !482, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !11, line: 80, baseType: !10)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !23, file: !11, line: 91, baseType: !37, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !23, file: !11, line: 92, baseType: !37, size: 64, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !23, file: !11, line: 93, baseType: !68, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !23, file: !11, line: 94, baseType: !68, size: 32, offset: 480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !23, file: !11, line: 95, baseType: !489, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !474, line: 417, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !11, line: 146, size: 320, elements: !492)
!492 = !{!493, !501, !502, !503, !504}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !491, file: !11, line: 148, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !27, line: 12, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !497, line: 51, size: 192, elements: !498)
!497 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !496, file: !497, line: 52, baseType: !56, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !496, file: !497, line: 53, baseType: !60, size: 128, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !491, file: !11, line: 149, baseType: !68, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !491, file: !11, line: 156, baseType: !68, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !491, file: !11, line: 159, baseType: !68, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !491, file: !11, line: 160, baseType: !473, size: 128, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !23, file: !11, line: 96, baseType: !68, size: 32, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !23, file: !11, line: 97, baseType: !489, size: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !23, file: !11, line: 98, baseType: !68, size: 32, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !23, file: !11, line: 99, baseType: !68, size: 32, offset: 736)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !23, file: !11, line: 100, baseType: !68, size: 32, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !23, file: !11, line: 102, baseType: !511, size: 512, offset: 832)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !512, line: 372, baseType: !513)
!512 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 512, elements: !384)
!514 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !23, file: !11, line: 104, baseType: !68, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !23, file: !11, line: 106, baseType: !37, size: 64, offset: 1408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !23, file: !11, line: 107, baseType: !37, size: 64, offset: 1472)
!518 = !{i32 2, !"Dwarf Version", i32 4}
!519 = !{i32 2, !"Debug Info Version", i32 3}
!520 = !{i32 1, !"wchar_size", i32 4}
!521 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!522 = distinct !DISubprogram(name: "pthread_kill", scope: !1, file: !1, line: 57, type: !523, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!68, !473, !68}
!525 = !{!526, !527, !528, !529}
!526 = !DILocalVariable(name: "thread", arg: 1, scope: !522, file: !1, line: 57, type: !473)
!527 = !DILocalVariable(name: "sig", arg: 2, scope: !522, file: !1, line: 57, type: !68)
!528 = !DILocalVariable(name: "result", scope: !522, file: !1, line: 86, type: !68)
!529 = !DILocalVariable(name: "tp", scope: !522, file: !1, line: 87, type: !21)
!530 = !DILocation(line: 57, column: 25, scope: !522)
!531 = !DILocation(line: 57, column: 37, scope: !522)
!532 = !DILocation(line: 86, column: 7, scope: !522)
!533 = !DILocation(line: 90, column: 20, scope: !522)
!534 = !{!535, !535, i64 0}
!535 = !{!"any pointer", !536, i64 0}
!536 = !{!"omnipotent char", !537, i64 0}
!537 = !{!"Simple C/C++ TBAA"}
!538 = !DILocation(line: 90, column: 3, scope: !522)
!539 = !DILocation(line: 87, column: 18, scope: !522)
!540 = !DILocation(line: 101, column: 21, scope: !522)
!541 = !DILocation(line: 101, column: 3, scope: !522)
!542 = !DILocation(line: 104, column: 25, scope: !522)
!543 = !{!544, !535, i64 0}
!544 = !{!"pte_thread_t_", !535, i64 0, !545, i64 8, !535, i64 24, !536, i64 32, !535, i64 40, !535, i64 48, !546, i64 56, !546, i64 60, !535, i64 64, !546, i64 72, !535, i64 80, !546, i64 88, !546, i64 92, !546, i64 96, !536, i64 104, !546, i64 168, !535, i64 176, !535, i64 184}
!545 = !{!"", !535, i64 0, !546, i64 8}
!546 = !{!"int", !536, i64 0}
!547 = !DILocation(line: 104, column: 12, scope: !522)
!548 = !DILocation(line: 115, column: 3, scope: !522)
