; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_spin_destroy.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_spin_destroy.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_mutex = type { i32, %struct.uk_thread*, %struct.uk_waitq }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }
%struct.uk_thread_list = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_spin_destroy.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !{!11, !12, !19}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !13, line: 423, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_spinlock_t_", file: !16, line: 190, size: 128, elements: !17)
!16 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "interlock", scope: !15, file: !16, line: 192, baseType: !19, size: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !15, file: !16, line: 197, baseType: !21, size: 64, offset: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !15, file: !16, line: 193, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !21, file: !16, line: 195, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !21, file: !16, line: 196, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !13, line: 417, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !16, line: 146, size: 320, elements: !28)
!28 = !{!29, !478, !479, !480, !481}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !27, file: !16, line: 148, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !31, line: 12, baseType: !32)
!31 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !34, line: 51, size: 192, elements: !35)
!34 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !33, file: !34, line: 52, baseType: !37, size: 64)
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !33, file: !34, line: 53, baseType: !39, size: 128, offset: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !40, line: 42, size: 128, elements: !41)
!40 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !{!42, !476}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !39, file: !40, line: 42, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !40, line: 35, size: 192, elements: !45)
!45 = !{!46, !47, !472}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !44, file: !40, line: 36, baseType: !19, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !44, file: !40, line: 37, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !50, line: 59, size: 1024, elements: !51)
!50 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !{!52, !56, !57, !58, !59, !65, !70, !75, !77, !78, !227, !228, !229, !442}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 60, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !49, file: !50, line: 61, baseType: !11, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !49, file: !50, line: 62, baseType: !11, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !49, file: !50, line: 63, baseType: !11, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !49, file: !50, line: 64, baseType: !60, size: 128, offset: 256)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !49, file: !50, line: 64, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !60, file: !50, line: 64, baseType: !48, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !60, file: !50, line: 64, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !50, line: 65, baseType: !66, size: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !67, line: 48, baseType: !68)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !69, line: 79, baseType: !5)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !49, file: !50, line: 66, baseType: !71, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !72, line: 49, baseType: !73)
!72 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !74, line: 128, baseType: !37)
!74 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !49, file: !50, line: 67, baseType: !76, size: 8, offset: 512)
!76 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !49, file: !50, line: 68, baseType: !39, size: 128, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !49, file: !50, line: 69, baseType: !79, size: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !81, line: 90, size: 2176, elements: !82)
!81 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !{!83, !88, !106, !111, !113, !115, !120, !128, !133, !139, !140, !141, !146, !224, !225, !226}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !80, file: !81, line: 91, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !81, line: 68, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !79}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !80, file: !81, line: 93, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !81, line: 71, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!19, !79, !48, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !96, line: 62, baseType: !97)
!96 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !96, line: 55, size: 128, elements: !98)
!98 = !{!99, !100, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !97, file: !96, line: 57, baseType: !76, size: 8)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !97, file: !96, line: 59, baseType: !101, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !96, line: 53, baseType: !19)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !97, file: !96, line: 61, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !72, line: 48, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !74, line: 129, baseType: !105)
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !80, file: !81, line: 94, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !81, line: 74, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !79, !48}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !80, file: !81, line: 95, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !81, line: 76, baseType: !108)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !80, file: !81, line: 96, baseType: !114, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !81, line: 78, baseType: !108)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !80, file: !81, line: 98, baseType: !116, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !81, line: 81, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!19, !79, !48, !101}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !80, file: !81, line: 99, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !81, line: 83, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!19, !79, !125, !127}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !80, file: !81, line: 100, baseType: !129, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !81, line: 85, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!19, !79, !48, !19}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !80, file: !81, line: 101, baseType: !134, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !81, line: 87, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!19, !79, !125, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !80, file: !81, line: 104, baseType: !76, size: 8, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !80, file: !81, line: 105, baseType: !49, size: 1024, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !80, file: !81, line: 106, baseType: !142, size: 128, offset: 1664)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !50, line: 93, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !142, file: !50, line: 93, baseType: !48, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !142, file: !50, line: 93, baseType: !64, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !80, file: !81, line: 107, baseType: !147, size: 192, offset: 1792)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !148, line: 59, size: 192, elements: !149)
!148 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!149 = !{!150, !215, !219}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !147, file: !148, line: 61, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !148, line: 51, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!11, !155, !105, !105}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !157, line: 77, size: 832, elements: !158)
!157 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!158 = !{!159, !166, !171, !176, !182, !184, !189, !190, !191, !196, !201, !206, !207, !208}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !156, file: !157, line: 79, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !157, line: 54, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!11, !155, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 58, baseType: !105)
!165 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!166 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !156, file: !157, line: 80, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !157, line: 56, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!11, !155, !164, !164}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !156, file: !157, line: 81, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !157, line: 62, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!11, !155, !11, !164}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !156, file: !157, line: 82, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !157, line: 58, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!19, !155, !181, !164, !164}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !156, file: !157, line: 83, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !157, line: 60, baseType: !168)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !156, file: !157, line: 84, baseType: !185, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !157, line: 64, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !155, !11}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !156, file: !157, line: 87, baseType: !185, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !156, file: !157, line: 88, baseType: !160, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !156, file: !157, line: 92, baseType: !192, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !157, line: 66, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!11, !155, !105}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !156, file: !157, line: 93, baseType: !197, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !157, line: 68, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !155, !11, !105}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !156, file: !157, line: 99, baseType: !202, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !157, line: 70, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!19, !155, !11, !164}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !157, line: 100, baseType: !164, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !157, line: 103, baseType: !155, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !156, file: !157, line: 104, baseType: !209, offset: 832)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, elements: !213)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !67, line: 20, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !69, line: 41, baseType: !212)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !{!214}
!214 = !DISubrange(count: -1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !147, file: !148, line: 63, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !11}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !147, file: !148, line: 65, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !148, line: 56, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !11, !11}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !80, file: !81, line: 108, baseType: !155, size: 64, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !80, file: !81, line: 109, baseType: !79, size: 64, offset: 2048)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !80, file: !81, line: 110, baseType: !11, size: 64, offset: 2112)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !49, file: !50, line: 70, baseType: !11, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !49, file: !50, line: 72, baseType: !19, size: 32, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !49, file: !50, line: 82, baseType: !230, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !232, line: 569, size: 14912, elements: !233)
!232 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!233 = !{!234, !235, !310, !311, !312, !313, !317, !318, !321, !322, !326, !338, !339, !340, !342, !343, !344, !406, !427, !428, !433, !440}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !231, file: !232, line: 571, baseType: !19, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !231, file: !232, line: 576, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !232, line: 287, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !232, line: 181, size: 1408, elements: !239)
!239 = !{!240, !243, !244, !245, !247, !248, !253, !254, !255, !262, !266, !271, !275, !276, !277, !278, !282, !286, !287, !288, !290, !291, !295, !309}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !238, file: !232, line: 182, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !238, file: !232, line: 183, baseType: !19, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !238, file: !232, line: 184, baseType: !19, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !238, file: !232, line: 185, baseType: !246, size: 16, offset: 128)
!246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !238, file: !232, line: 186, baseType: !246, size: 16, offset: 144)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !238, file: !232, line: 187, baseType: !249, size: 128, offset: 192)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !232, line: 117, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !249, file: !232, line: 118, baseType: !241, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !249, file: !232, line: 119, baseType: !19, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !238, file: !232, line: 188, baseType: !19, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !238, file: !232, line: 195, baseType: !11, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !238, file: !232, line: 197, baseType: !256, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !230, !11, !261, !19}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !260, line: 145, baseType: !37)
!260 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !238, file: !232, line: 199, baseType: !263, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!259, !230, !11, !53, !19}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !238, file: !232, line: 202, baseType: !267, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !230, !11, !270, !19}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !260, line: 114, baseType: !37)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !238, file: !232, line: 203, baseType: !272, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!19, !230, !11}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !238, file: !232, line: 206, baseType: !249, size: 128, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !238, file: !232, line: 207, baseType: !241, size: 64, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !238, file: !232, line: 208, baseType: !19, size: 32, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !238, file: !232, line: 211, baseType: !279, size: 24, offset: 928)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 24, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 3)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !238, file: !232, line: 212, baseType: !283, size: 8, offset: 952)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 8, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 1)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !238, file: !232, line: 215, baseType: !249, size: 128, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !238, file: !232, line: 218, baseType: !19, size: 32, offset: 1088)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !238, file: !232, line: 219, baseType: !289, size: 64, offset: 1152)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !260, line: 44, baseType: !37)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !238, file: !232, line: 222, baseType: !230, size: 64, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !238, file: !232, line: 226, baseType: !292, size: 32, offset: 1280)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !260, line: 175, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !294, line: 12, baseType: !19)
!294 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !238, file: !232, line: 228, baseType: !296, size: 64, offset: 1312)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !260, line: 171, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 163, size: 64, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !297, file: !260, line: 165, baseType: !19, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !297, file: !260, line: 170, baseType: !301, size: 32, offset: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !297, file: !260, line: 166, size: 32, elements: !302)
!302 = !{!303, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !301, file: !260, line: 168, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !165, line: 124, baseType: !5)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !301, file: !260, line: 169, baseType: !306, size: 32)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 32, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 4)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !238, file: !232, line: 229, baseType: !19, size: 32, offset: 1376)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !231, file: !232, line: 576, baseType: !236, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !231, file: !232, line: 576, baseType: !236, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !231, file: !232, line: 578, baseType: !19, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !231, file: !232, line: 579, baseType: !314, size: 200, offset: 288)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 200, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 25)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !231, file: !232, line: 582, baseType: !19, size: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !231, file: !232, line: 583, baseType: !319, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !232, line: 40, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !231, file: !232, line: 585, baseType: !19, size: 32, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !231, file: !232, line: 587, baseType: !323, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !230}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !231, file: !232, line: 590, baseType: !327, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !232, line: 47, size: 256, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !328, file: !232, line: 49, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !328, file: !232, line: 50, baseType: !19, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !328, file: !232, line: 50, baseType: !19, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !328, file: !232, line: 50, baseType: !19, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !328, file: !232, line: 50, baseType: !19, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !328, file: !232, line: 51, baseType: !336, size: 32, offset: 192)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !284)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !232, line: 25, baseType: !5)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !231, file: !232, line: 591, baseType: !19, size: 32, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !231, file: !232, line: 592, baseType: !327, size: 64, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !231, file: !232, line: 593, baseType: !341, size: 64, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !231, file: !232, line: 596, baseType: !19, size: 32, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !231, file: !232, line: 597, baseType: !261, size: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !231, file: !232, line: 632, baseType: !345, size: 2880, offset: 1152)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !232, line: 599, size: 2880, elements: !346)
!346 = !{!347, !397}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !345, file: !232, line: 622, baseType: !348, size: 1728)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !232, line: 601, size: 1728, elements: !349)
!349 = !{!350, !351, !352, !356, !368, !369, !371, !379, !380, !381, !382, !386, !390, !391, !392, !393, !394, !395, !396}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !348, file: !232, line: 603, baseType: !5, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !348, file: !232, line: 604, baseType: !261, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !348, file: !232, line: 605, baseType: !353, size: 208, offset: 128)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 208, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 26)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !348, file: !232, line: 606, baseType: !357, size: 288, offset: 352)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !232, line: 55, size: 288, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !357, file: !232, line: 57, baseType: !19, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !357, file: !232, line: 58, baseType: !19, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !357, file: !232, line: 59, baseType: !19, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !357, file: !232, line: 60, baseType: !19, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !357, file: !232, line: 61, baseType: !19, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !357, file: !232, line: 62, baseType: !19, size: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !357, file: !232, line: 63, baseType: !19, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !357, file: !232, line: 64, baseType: !19, size: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !357, file: !232, line: 65, baseType: !19, size: 32, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !348, file: !232, line: 607, baseType: !19, size: 32, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !348, file: !232, line: 608, baseType: !370, size: 64, offset: 704)
!370 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !348, file: !232, line: 609, baseType: !372, size: 112, offset: 768)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !232, line: 319, size: 112, elements: !373)
!373 = !{!374, !377, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !372, file: !232, line: 320, baseType: !375, size: 48)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 48, elements: !280)
!376 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !372, file: !232, line: 321, baseType: !375, size: 48, offset: 48)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !372, file: !232, line: 322, baseType: !376, size: 16, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !348, file: !232, line: 610, baseType: !296, size: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !348, file: !232, line: 611, baseType: !296, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !348, file: !232, line: 612, baseType: !296, size: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !348, file: !232, line: 613, baseType: !383, size: 64, offset: 1088)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !348, file: !232, line: 614, baseType: !387, size: 192, offset: 1152)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 192, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 24)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !348, file: !232, line: 615, baseType: !19, size: 32, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !348, file: !232, line: 616, baseType: !296, size: 64, offset: 1376)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !348, file: !232, line: 617, baseType: !296, size: 64, offset: 1440)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !348, file: !232, line: 618, baseType: !296, size: 64, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !348, file: !232, line: 619, baseType: !296, size: 64, offset: 1568)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !348, file: !232, line: 620, baseType: !296, size: 64, offset: 1632)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !348, file: !232, line: 621, baseType: !19, size: 32, offset: 1696)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !345, file: !232, line: 631, baseType: !398, size: 2880)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !232, line: 626, size: 2880, elements: !399)
!399 = !{!400, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !398, file: !232, line: 629, baseType: !401, size: 1920)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 1920, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 30)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !398, file: !232, line: 630, baseType: !405, size: 960, offset: 1920)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !402)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !231, file: !232, line: 636, baseType: !407, size: 64, offset: 4032)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !232, line: 93, size: 6336, elements: !409)
!409 = !{!410, !411, !412, !419}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !408, file: !232, line: 94, baseType: !407, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !408, file: !232, line: 95, baseType: !19, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !408, file: !232, line: 97, baseType: !413, size: 2048, offset: 128)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 2048, elements: !417)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null}
!417 = !{!418}
!418 = !DISubrange(count: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !408, file: !232, line: 98, baseType: !420, size: 4160, offset: 2176)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !232, line: 74, size: 4160, elements: !421)
!421 = !{!422, !424, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !420, file: !232, line: 75, baseType: !423, size: 2048)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !417)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !420, file: !232, line: 76, baseType: !423, size: 2048, offset: 2048)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !420, file: !232, line: 78, baseType: !337, size: 32, offset: 4096)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !420, file: !232, line: 81, baseType: !337, size: 32, offset: 4128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !231, file: !232, line: 637, baseType: !408, size: 6336, offset: 4096)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !231, file: !232, line: 641, baseType: !429, size: 64, offset: 10432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !19}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !231, file: !232, line: 646, baseType: !434, size: 192, offset: 10496)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !232, line: 291, size: 192, elements: !435)
!435 = !{!436, !438, !439}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !434, file: !232, line: 293, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !434, file: !232, line: 294, baseType: !19, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !434, file: !232, line: 295, baseType: !236, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !231, file: !232, line: 648, baseType: !441, size: 4224, offset: 10688)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 4224, elements: !280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !49, file: !50, line: 85, baseType: !443, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !445)
!445 = !{!446, !450, !451, !458, !471}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !444, file: !4, line: 116, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !448, line: 64, baseType: !449)
!448 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !448, line: 63, baseType: !105)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !444, file: !4, line: 118, baseType: !447, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !444, file: !4, line: 120, baseType: !452, size: 128, offset: 128)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !453, line: 51, size: 128, elements: !454)
!453 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!454 = !{!455, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !452, file: !453, line: 52, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !452, file: !453, line: 53, baseType: !456, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !444, file: !4, line: 122, baseType: !459, size: 256, offset: 256)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !459, file: !4, line: 107, baseType: !3, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !459, file: !4, line: 109, baseType: !447, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !459, file: !4, line: 111, baseType: !464, size: 96, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !448, line: 72, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 68, size: 96, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !465, file: !448, line: 69, baseType: !19, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !465, file: !448, line: 70, baseType: !19, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !465, file: !448, line: 71, baseType: !470, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !448, line: 61, baseType: !19)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !444, file: !4, line: 124, baseType: !452, size: 128, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !44, file: !40, line: 38, baseType: !473, size: 64, offset: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !40, line: 38, size: 64, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !473, file: !40, line: 38, baseType: !43, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !39, file: !40, line: 42, baseType: !477, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !27, file: !16, line: 149, baseType: !19, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !27, file: !16, line: 156, baseType: !19, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !27, file: !16, line: 159, baseType: !19, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !27, file: !16, line: 160, baseType: !482, size: 128, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !13, line: 413, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !13, line: 411, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 395, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !484, file: !13, line: 398, baseType: !11, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !484, file: !13, line: 399, baseType: !5, size: 32, offset: 64)
!488 = !{i32 2, !"Dwarf Version", i32 4}
!489 = !{i32 2, !"Debug Info Version", i32 3}
!490 = !{i32 1, !"wchar_size", i32 4}
!491 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!492 = distinct !DISubprogram(name: "pthread_spin_destroy", scope: !1, file: !1, line: 50, type: !493, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !496)
!493 = !DISubroutineType(types: !494)
!494 = !{!19, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!496 = !{!497, !498, !499, !500, !506}
!497 = !DILocalVariable(name: "lock", arg: 1, scope: !492, file: !1, line: 50, type: !495)
!498 = !DILocalVariable(name: "s", scope: !492, file: !1, line: 52, type: !12)
!499 = !DILocalVariable(name: "result", scope: !492, file: !1, line: 53, type: !19)
!500 = !DILocalVariable(name: "__orig", scope: !501, file: !1, line: 67, type: !19)
!501 = distinct !DILexicalBlock(scope: !502, file: !1, line: 67, column: 16)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 66, column: 16)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 62, column: 11)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 61, column: 5)
!505 = distinct !DILexicalBlock(scope: !492, file: !1, line: 60, column: 7)
!506 = !DILocalVariable(name: "stored", scope: !507, file: !1, line: 67, type: !19)
!507 = distinct !DILexicalBlock(scope: !501, file: !1, line: 67, column: 16)
!508 = !DILocation(line: 50, column: 44, scope: !492)
!509 = !DILocation(line: 53, column: 7, scope: !492)
!510 = !DILocation(line: 55, column: 12, scope: !511)
!511 = distinct !DILexicalBlock(scope: !492, file: !1, line: 55, column: 7)
!512 = !DILocation(line: 55, column: 20, scope: !511)
!513 = !DILocation(line: 55, column: 23, scope: !511)
!514 = !{!515, !515, i64 0}
!515 = !{!"any pointer", !516, i64 0}
!516 = !{!"omnipotent char", !517, i64 0}
!517 = !{!"Simple C/C++ TBAA"}
!518 = !DILocation(line: 55, column: 7, scope: !492)
!519 = !DILocation(line: 62, column: 14, scope: !503)
!520 = !{!521, !522, i64 0}
!521 = !{!"pthread_spinlock_t_", !522, i64 0, !516, i64 8}
!522 = !{!"int", !516, i64 0}
!523 = !DILocation(line: 62, column: 24, scope: !503)
!524 = !DILocation(line: 62, column: 11, scope: !504)
!525 = !DILocation(line: 67, column: 16, scope: !501)
!526 = !DILocation(line: 67, column: 16, scope: !507)
!527 = !DILocation(line: 66, column: 34, scope: !502)
!528 = !DILocation(line: 64, column: 50, scope: !529)
!529 = distinct !DILexicalBlock(scope: !503, file: !1, line: 63, column: 9)
!530 = !DILocation(line: 64, column: 20, scope: !529)
!531 = !DILocation(line: 75, column: 13, scope: !532)
!532 = distinct !DILexicalBlock(scope: !504, file: !1, line: 75, column: 11)
!533 = !DILocation(line: 75, column: 11, scope: !504)
!534 = !DILocation(line: 81, column: 17, scope: !535)
!535 = distinct !DILexicalBlock(scope: !532, file: !1, line: 76, column: 9)
!536 = !DILocation(line: 82, column: 24, scope: !535)
!537 = !DILocation(line: 82, column: 18, scope: !535)
!538 = !DILocation(line: 83, column: 9, scope: !535)
!539 = !DILocation(line: 91, column: 24, scope: !540)
!540 = distinct !DILexicalBlock(scope: !505, file: !1, line: 86, column: 5)
!541 = !DILocation(line: 91, column: 7, scope: !540)
!542 = !DILocation(line: 96, column: 11, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !1, line: 96, column: 11)
!544 = !DILocation(line: 96, column: 17, scope: !543)
!545 = !DILocation(line: 96, column: 11, scope: !540)
!546 = !DILocation(line: 104, column: 17, scope: !547)
!547 = distinct !DILexicalBlock(scope: !543, file: !1, line: 97, column: 9)
!548 = !DILocation(line: 105, column: 9, scope: !547)
!549 = !DILocation(line: 0, scope: !550)
!550 = distinct !DILexicalBlock(scope: !543, file: !1, line: 107, column: 9)
!551 = !DILocation(line: 115, column: 25, scope: !540)
