; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_terminate.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_terminate.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pthread_key_t_ = type { i32, void (i8*)*, %struct.pthread_mutex_t_*, i8* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !25)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_terminate.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10, !20}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 61, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18, !19}
!13 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 182, baseType: !5, size: 32, elements: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "PTE_FALSE", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "PTE_TRUE", value: 1, isUnsigned: true)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !11, line: 83, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !11, line: 85, size: 1536, elements: !30)
!30 = !{!31, !477, !484, !485, !488, !489, !490, !491, !492, !509, !510, !511, !512, !513, !514, !519, !520, !521}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !29, file: !11, line: 87, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !33, line: 11, baseType: !34)
!33 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !36, line: 59, size: 1024, elements: !37)
!36 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!37 = !{!38, !42, !43, !44, !45, !51, !56, !62, !64, !81, !232, !233, !234, !447}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !36, line: 60, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !35, file: !36, line: 61, baseType: !26, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !35, file: !36, line: 62, baseType: !26, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !35, file: !36, line: 63, baseType: !26, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !35, file: !36, line: 64, baseType: !46, size: 128, offset: 256)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !36, line: 64, size: 128, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !46, file: !36, line: 64, baseType: !34, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !46, file: !36, line: 64, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !35, file: !36, line: 65, baseType: !52, size: 32, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 48, baseType: !54)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !55, line: 79, baseType: !5)
!55 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !35, file: !36, line: 66, baseType: !57, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !58, line: 49, baseType: !59)
!58 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !60, line: 128, baseType: !61)
!60 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !35, file: !36, line: 67, baseType: !63, size: 8, offset: 512)
!63 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !35, file: !36, line: 68, baseType: !65, size: 128, offset: 576)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !66, line: 42, size: 128, elements: !67)
!66 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !{!68, !79}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !65, file: !66, line: 42, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !66, line: 35, size: 192, elements: !71)
!71 = !{!72, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !70, file: !66, line: 36, baseType: !73, size: 32)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !70, file: !66, line: 37, baseType: !34, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !70, file: !66, line: 38, baseType: !76, size: 64, offset: 128)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !66, line: 38, size: 64, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !76, file: !66, line: 38, baseType: !69, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !65, file: !66, line: 42, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !35, file: !36, line: 69, baseType: !82, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !84, line: 90, size: 2176, elements: !85)
!84 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !{!86, !91, !109, !114, !116, !118, !123, !131, !136, !142, !143, !144, !149, !229, !230, !231}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !83, file: !84, line: 91, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !84, line: 68, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !82}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !83, file: !84, line: 93, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !84, line: 71, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!73, !82, !34, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !99, line: 62, baseType: !100)
!99 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !99, line: 55, size: 128, elements: !101)
!101 = !{!102, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !100, file: !99, line: 57, baseType: !63, size: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !100, file: !99, line: 59, baseType: !104, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !99, line: 53, baseType: !73)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !100, file: !99, line: 61, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !58, line: 48, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !60, line: 129, baseType: !108)
!108 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !83, file: !84, line: 94, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !84, line: 74, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !82, !34}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !83, file: !84, line: 95, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !84, line: 76, baseType: !111)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !83, file: !84, line: 96, baseType: !117, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !84, line: 78, baseType: !111)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !83, file: !84, line: 98, baseType: !119, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !84, line: 81, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!73, !82, !34, !104}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !83, file: !84, line: 99, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !84, line: 83, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!73, !82, !128, !130}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !83, file: !84, line: 100, baseType: !132, size: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !84, line: 85, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!73, !82, !34, !73}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !83, file: !84, line: 101, baseType: !137, size: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !84, line: 87, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!73, !82, !128, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !83, file: !84, line: 104, baseType: !63, size: 8, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !83, file: !84, line: 105, baseType: !35, size: 1024, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !83, file: !84, line: 106, baseType: !145, size: 128, offset: 1664)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !36, line: 93, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !145, file: !36, line: 93, baseType: !34, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !145, file: !36, line: 93, baseType: !50, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !83, file: !84, line: 107, baseType: !150, size: 192, offset: 1792)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !151, line: 59, size: 192, elements: !152)
!151 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!152 = !{!153, !220, !224}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !150, file: !151, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !151, line: 51, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!26, !158, !108, !108}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !160, line: 77, size: 832, elements: !161)
!160 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!161 = !{!162, !171, !176, !181, !187, !189, !194, !195, !196, !201, !206, !211, !212, !213}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !159, file: !160, line: 79, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !160, line: 54, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!26, !158, !167}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !168, line: 40, baseType: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !170, line: 129, baseType: !108)
!170 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!171 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !159, file: !160, line: 80, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !160, line: 56, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!26, !158, !167, !167}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !159, file: !160, line: 81, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !160, line: 62, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!26, !158, !26, !167}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !159, file: !160, line: 82, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !160, line: 58, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!73, !158, !186, !167, !167}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !159, file: !160, line: 83, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !160, line: 60, baseType: !173)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !159, file: !160, line: 84, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !160, line: 64, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !158, !26}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !159, file: !160, line: 87, baseType: !190, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !159, file: !160, line: 88, baseType: !163, size: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !159, file: !160, line: 92, baseType: !197, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !160, line: 66, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!26, !158, !108}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !159, file: !160, line: 93, baseType: !202, size: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !160, line: 68, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !158, !26, !108}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !159, file: !160, line: 99, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !160, line: 70, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!73, !158, !26, !167}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !159, file: !160, line: 100, baseType: !167, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !160, line: 103, baseType: !158, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !159, file: !160, line: 104, baseType: !214, offset: 832)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, elements: !218)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !53, line: 20, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !55, line: 41, baseType: !217)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !{!219}
!219 = !DISubrange(count: -1)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !150, file: !151, line: 63, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !26}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !150, file: !151, line: 65, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !151, line: 56, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !26, !26}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !83, file: !84, line: 108, baseType: !158, size: 64, offset: 1984)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !84, line: 109, baseType: !82, size: 64, offset: 2048)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !83, file: !84, line: 110, baseType: !26, size: 64, offset: 2112)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !35, file: !36, line: 70, baseType: !26, size: 64, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !35, file: !36, line: 72, baseType: !73, size: 32, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !35, file: !36, line: 82, baseType: !235, size: 64, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !237, line: 569, size: 14912, elements: !238)
!237 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!238 = !{!239, !240, !315, !316, !317, !318, !322, !323, !326, !327, !331, !343, !344, !345, !347, !348, !349, !411, !432, !433, !438, !445}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !236, file: !237, line: 571, baseType: !73, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !236, file: !237, line: 576, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !237, line: 287, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !237, line: 181, size: 1408, elements: !244)
!244 = !{!245, !248, !249, !250, !252, !253, !258, !259, !260, !266, !270, !275, !279, !280, !281, !282, !286, !290, !291, !292, !294, !295, !299, !314}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !243, file: !237, line: 182, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !243, file: !237, line: 183, baseType: !73, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !243, file: !237, line: 184, baseType: !73, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !243, file: !237, line: 185, baseType: !251, size: 16, offset: 128)
!251 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !243, file: !237, line: 186, baseType: !251, size: 16, offset: 144)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !243, file: !237, line: 187, baseType: !254, size: 128, offset: 192)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !237, line: 117, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !254, file: !237, line: 118, baseType: !246, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !254, file: !237, line: 119, baseType: !73, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !243, file: !237, line: 188, baseType: !73, size: 32, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !243, file: !237, line: 195, baseType: !26, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !243, file: !237, line: 197, baseType: !261, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !235, !26, !265, !73}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !170, line: 145, baseType: !61)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !243, file: !237, line: 199, baseType: !267, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!264, !235, !26, !39, !73}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !243, file: !237, line: 202, baseType: !271, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !235, !26, !274, !73}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !170, line: 114, baseType: !61)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !243, file: !237, line: 203, baseType: !276, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!73, !235, !26}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !243, file: !237, line: 206, baseType: !254, size: 128, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !243, file: !237, line: 207, baseType: !246, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !243, file: !237, line: 208, baseType: !73, size: 32, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !243, file: !237, line: 211, baseType: !283, size: 24, offset: 928)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 24, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 3)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !243, file: !237, line: 212, baseType: !287, size: 8, offset: 952)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 1)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !243, file: !237, line: 215, baseType: !254, size: 128, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !243, file: !237, line: 218, baseType: !73, size: 32, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !243, file: !237, line: 219, baseType: !293, size: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !170, line: 44, baseType: !61)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !243, file: !237, line: 222, baseType: !235, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !243, file: !237, line: 226, baseType: !296, size: 32, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !170, line: 175, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !298, line: 12, baseType: !73)
!298 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !243, file: !237, line: 228, baseType: !300, size: 64, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !170, line: 171, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 163, size: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !301, file: !170, line: 165, baseType: !73, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !301, file: !170, line: 170, baseType: !305, size: 32, offset: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !170, line: 166, size: 32, elements: !306)
!306 = !{!307, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !305, file: !170, line: 168, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !309, line: 124, baseType: !5)
!309 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !305, file: !170, line: 169, baseType: !311, size: 32)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 32, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 4)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !243, file: !237, line: 229, baseType: !73, size: 32, offset: 1376)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !236, file: !237, line: 576, baseType: !241, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !236, file: !237, line: 576, baseType: !241, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !236, file: !237, line: 578, baseType: !73, size: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !236, file: !237, line: 579, baseType: !319, size: 200, offset: 288)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 200, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 25)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !236, file: !237, line: 582, baseType: !73, size: 32, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !236, file: !237, line: 583, baseType: !324, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !237, line: 40, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !236, file: !237, line: 585, baseType: !73, size: 32, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !236, file: !237, line: 587, baseType: !328, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !235}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !236, file: !237, line: 590, baseType: !332, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !237, line: 47, size: 256, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !333, file: !237, line: 49, baseType: !332, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !333, file: !237, line: 50, baseType: !73, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !333, file: !237, line: 50, baseType: !73, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !333, file: !237, line: 50, baseType: !73, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !333, file: !237, line: 50, baseType: !73, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !333, file: !237, line: 51, baseType: !341, size: 32, offset: 192)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 32, elements: !288)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !237, line: 25, baseType: !5)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !236, file: !237, line: 591, baseType: !73, size: 32, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !236, file: !237, line: 592, baseType: !332, size: 64, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !236, file: !237, line: 593, baseType: !346, size: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !236, file: !237, line: 596, baseType: !73, size: 32, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !236, file: !237, line: 597, baseType: !265, size: 64, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !236, file: !237, line: 632, baseType: !350, size: 2880, offset: 1152)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !237, line: 599, size: 2880, elements: !351)
!351 = !{!352, !402}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !350, file: !237, line: 622, baseType: !353, size: 1728)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !350, file: !237, line: 601, size: 1728, elements: !354)
!354 = !{!355, !356, !357, !361, !373, !374, !376, !384, !385, !386, !387, !391, !395, !396, !397, !398, !399, !400, !401}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !353, file: !237, line: 603, baseType: !5, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !353, file: !237, line: 604, baseType: !265, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !353, file: !237, line: 605, baseType: !358, size: 208, offset: 128)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 208, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 26)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !353, file: !237, line: 606, baseType: !362, size: 288, offset: 352)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !237, line: 55, size: 288, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !362, file: !237, line: 57, baseType: !73, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !362, file: !237, line: 58, baseType: !73, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !362, file: !237, line: 59, baseType: !73, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !362, file: !237, line: 60, baseType: !73, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !362, file: !237, line: 61, baseType: !73, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !362, file: !237, line: 62, baseType: !73, size: 32, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !362, file: !237, line: 63, baseType: !73, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !362, file: !237, line: 64, baseType: !73, size: 32, offset: 224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !362, file: !237, line: 65, baseType: !73, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !353, file: !237, line: 607, baseType: !73, size: 32, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !353, file: !237, line: 608, baseType: !375, size: 64, offset: 704)
!375 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !353, file: !237, line: 609, baseType: !377, size: 112, offset: 768)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !237, line: 319, size: 112, elements: !378)
!378 = !{!379, !382, !383}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !377, file: !237, line: 320, baseType: !380, size: 48)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 48, elements: !284)
!381 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !377, file: !237, line: 321, baseType: !380, size: 48, offset: 48)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !377, file: !237, line: 322, baseType: !381, size: 16, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !353, file: !237, line: 610, baseType: !300, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !353, file: !237, line: 611, baseType: !300, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !353, file: !237, line: 612, baseType: !300, size: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !353, file: !237, line: 613, baseType: !388, size: 64, offset: 1088)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 8)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !353, file: !237, line: 614, baseType: !392, size: 192, offset: 1152)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 24)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !353, file: !237, line: 615, baseType: !73, size: 32, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !353, file: !237, line: 616, baseType: !300, size: 64, offset: 1376)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !353, file: !237, line: 617, baseType: !300, size: 64, offset: 1440)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !353, file: !237, line: 618, baseType: !300, size: 64, offset: 1504)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !353, file: !237, line: 619, baseType: !300, size: 64, offset: 1568)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !353, file: !237, line: 620, baseType: !300, size: 64, offset: 1632)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !353, file: !237, line: 621, baseType: !73, size: 32, offset: 1696)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !350, file: !237, line: 631, baseType: !403, size: 2880)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !350, file: !237, line: 626, size: 2880, elements: !404)
!404 = !{!405, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !403, file: !237, line: 629, baseType: !406, size: 1920)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1920, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 30)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !403, file: !237, line: 630, baseType: !410, size: 960, offset: 1920)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !407)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !236, file: !237, line: 636, baseType: !412, size: 64, offset: 4032)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !237, line: 93, size: 6336, elements: !414)
!414 = !{!415, !416, !417, !424}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !413, file: !237, line: 94, baseType: !412, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !413, file: !237, line: 95, baseType: !73, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !413, file: !237, line: 97, baseType: !418, size: 2048, offset: 128)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 2048, elements: !422)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null}
!422 = !{!423}
!423 = !DISubrange(count: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !413, file: !237, line: 98, baseType: !425, size: 4160, offset: 2176)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !237, line: 74, size: 4160, elements: !426)
!426 = !{!427, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !425, file: !237, line: 75, baseType: !428, size: 2048)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !422)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !425, file: !237, line: 76, baseType: !428, size: 2048, offset: 2048)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !425, file: !237, line: 78, baseType: !342, size: 32, offset: 4096)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !425, file: !237, line: 81, baseType: !342, size: 32, offset: 4128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !236, file: !237, line: 637, baseType: !413, size: 6336, offset: 4096)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !236, file: !237, line: 641, baseType: !434, size: 64, offset: 10432)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !73}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !236, file: !237, line: 646, baseType: !439, size: 192, offset: 10496)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !237, line: 291, size: 192, elements: !440)
!440 = !{!441, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !439, file: !237, line: 293, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !439, file: !237, line: 294, baseType: !73, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !439, file: !237, line: 295, baseType: !241, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !236, file: !237, line: 648, baseType: !446, size: 4224, offset: 10688)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 4224, elements: !284)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !35, file: !36, line: 85, baseType: !448, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !450)
!450 = !{!451, !455, !456, !463, !476}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !449, file: !4, line: 116, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !453, line: 64, baseType: !454)
!453 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !453, line: 63, baseType: !108)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !449, file: !4, line: 118, baseType: !452, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !449, file: !4, line: 120, baseType: !457, size: 128, offset: 128)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !458, line: 51, size: 128, elements: !459)
!458 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!459 = !{!460, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !458, line: 52, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !458, line: 53, baseType: !461, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !449, file: !4, line: 122, baseType: !464, size: 256, offset: 256)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !464, file: !4, line: 107, baseType: !3, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !464, file: !4, line: 109, baseType: !452, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !464, file: !4, line: 111, baseType: !469, size: 96, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !453, line: 72, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 68, size: 96, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !470, file: !453, line: 69, baseType: !73, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !470, file: !453, line: 70, baseType: !73, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !470, file: !453, line: 71, baseType: !475, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !453, line: 61, baseType: !73)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !449, file: !4, line: 124, baseType: !457, size: 128, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !29, file: !11, line: 88, baseType: !478, size: 128, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !21, line: 413, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !21, line: 411, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 395, size: 128, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !480, file: !21, line: 398, baseType: !26, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !480, file: !21, line: 399, baseType: !5, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !29, file: !11, line: 89, baseType: !27, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !29, file: !11, line: 90, baseType: !486, size: 32, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !11, line: 80, baseType: !10)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !29, file: !11, line: 91, baseType: !26, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !29, file: !11, line: 92, baseType: !26, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !29, file: !11, line: 93, baseType: !73, size: 32, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !29, file: !11, line: 94, baseType: !73, size: 32, offset: 480)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !29, file: !11, line: 95, baseType: !493, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !21, line: 417, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !11, line: 146, size: 320, elements: !496)
!496 = !{!497, !505, !506, !507, !508}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !495, file: !11, line: 148, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !33, line: 12, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !501, line: 51, size: 192, elements: !502)
!501 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !500, file: !501, line: 52, baseType: !61, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !500, file: !501, line: 53, baseType: !65, size: 128, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !495, file: !11, line: 149, baseType: !73, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !495, file: !11, line: 156, baseType: !73, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !495, file: !11, line: 159, baseType: !73, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !495, file: !11, line: 160, baseType: !478, size: 128, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !29, file: !11, line: 96, baseType: !73, size: 32, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !29, file: !11, line: 97, baseType: !493, size: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !29, file: !11, line: 98, baseType: !73, size: 32, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !29, file: !11, line: 99, baseType: !73, size: 32, offset: 736)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !29, file: !11, line: 100, baseType: !73, size: 32, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !29, file: !11, line: 102, baseType: !515, size: 512, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !516, line: 372, baseType: !517)
!516 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 512, elements: !389)
!518 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !29, file: !11, line: 104, baseType: !73, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !29, file: !11, line: 106, baseType: !26, size: 64, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !29, file: !11, line: 107, baseType: !26, size: 64, offset: 1472)
!522 = !{i32 2, !"Dwarf Version", i32 4}
!523 = !{i32 2, !"Debug Info Version", i32 3}
!524 = !{i32 1, !"wchar_size", i32 4}
!525 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!526 = distinct !DISubprogram(name: "pthread_terminate", scope: !1, file: !1, line: 50, type: !420, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !527)
!527 = !{!528, !531}
!528 = !DILocalVariable(name: "tp", scope: !529, file: !1, line: 54, type: !27)
!529 = distinct !DILexicalBlock(scope: !530, file: !1, line: 53, column: 5)
!530 = distinct !DILexicalBlock(scope: !526, file: !1, line: 52, column: 7)
!531 = !DILocalVariable(name: "tpNext", scope: !529, file: !1, line: 54, type: !27)
!532 = !DILocation(line: 52, column: 7, scope: !530)
!533 = !{!534, !534, i64 0}
!534 = !{!"int", !535, i64 0}
!535 = !{!"omnipotent char", !536, i64 0}
!536 = !{!"Simple C/C++ TBAA"}
!537 = !DILocation(line: 52, column: 7, scope: !526)
!538 = !DILocation(line: 56, column: 11, scope: !539)
!539 = distinct !DILexicalBlock(scope: !529, file: !1, line: 56, column: 11)
!540 = !{!541, !541, i64 0}
!541 = !{!"any pointer", !535, i64 0}
!542 = !DILocation(line: 56, column: 29, scope: !539)
!543 = !DILocation(line: 56, column: 11, scope: !529)
!544 = !DILocation(line: 61, column: 11, scope: !545)
!545 = distinct !DILexicalBlock(scope: !539, file: !1, line: 57, column: 9)
!546 = !DILocation(line: 63, column: 29, scope: !545)
!547 = !DILocation(line: 64, column: 9, scope: !545)
!548 = !DILocation(line: 66, column: 11, scope: !549)
!549 = distinct !DILexicalBlock(scope: !529, file: !1, line: 66, column: 11)
!550 = !DILocation(line: 66, column: 26, scope: !549)
!551 = !DILocation(line: 66, column: 11, scope: !529)
!552 = !DILocation(line: 71, column: 11, scope: !553)
!553 = distinct !DILexicalBlock(scope: !549, file: !1, line: 67, column: 9)
!554 = !DILocation(line: 73, column: 26, scope: !553)
!555 = !DILocation(line: 74, column: 9, scope: !553)
!556 = !DILocation(line: 76, column: 24, scope: !529)
!557 = !DILocation(line: 76, column: 7, scope: !529)
!558 = !DILocation(line: 79, column: 12, scope: !529)
!559 = !DILocation(line: 54, column: 22, scope: !529)
!560 = !DILocation(line: 80, column: 17, scope: !529)
!561 = !DILocation(line: 80, column: 7, scope: !529)
!562 = !DILocation(line: 0, scope: !529)
!563 = !DILocation(line: 82, column: 24, scope: !564)
!564 = distinct !DILexicalBlock(scope: !529, file: !1, line: 81, column: 9)
!565 = !{!566, !541, i64 24}
!566 = !{!"pte_thread_t_", !541, i64 0, !567, i64 8, !541, i64 24, !535, i64 32, !541, i64 40, !541, i64 48, !534, i64 56, !534, i64 60, !541, i64 64, !534, i64 72, !541, i64 80, !534, i64 88, !534, i64 92, !534, i64 96, !535, i64 104, !534, i64 168, !541, i64 176, !541, i64 184}
!567 = !{!"", !541, i64 0, !534, i64 8}
!568 = !DILocation(line: 54, column: 28, scope: !529)
!569 = !DILocation(line: 83, column: 11, scope: !564)
!570 = distinct !{!570, !561, !571}
!571 = !DILocation(line: 85, column: 9, scope: !529)
!572 = !DILocation(line: 87, column: 25, scope: !529)
!573 = !DILocation(line: 87, column: 7, scope: !529)
!574 = !DILocation(line: 89, column: 30, scope: !529)
!575 = !DILocation(line: 90, column: 5, scope: !529)
!576 = !DILocation(line: 92, column: 1, scope: !526)
