; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/pubsub.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/pubsub.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/pubsub.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !7, !23, !33, !43}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !9, line: 51, size: 24, elements: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !{!11, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !8, file: !9, line: 52, baseType: !12, size: 8)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !16)
!15 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !8, file: !9, line: 53, baseType: !12, size: 8, offset: 8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !8, file: !9, line: 54, baseType: !16, size: 8, offset: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !8, file: !9, line: 55, baseType: !20, offset: 24)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: -1)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !9, line: 57, size: 40, elements: !25)
!25 = !{!26, !30, !31, !32}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, file: !9, line: 58, baseType: !27, size: 16)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 36, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 57, baseType: !29)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !24, file: !9, line: 59, baseType: !27, size: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !24, file: !9, line: 60, baseType: !16, size: 8, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !24, file: !9, line: 61, baseType: !20, offset: 40)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !9, line: 63, size: 72, elements: !35)
!35 = !{!36, !40, !41, !42}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !9, line: 64, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 48, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 79, baseType: !39)
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !34, file: !9, line: 65, baseType: !37, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !9, line: 66, baseType: !16, size: 8, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !34, file: !9, line: 67, baseType: !20, offset: 72)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !9, line: 69, size: 136, elements: !45)
!45 = !{!46, !50, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !44, file: !9, line: 70, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 60, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !15, line: 105, baseType: !49)
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !44, file: !9, line: 71, baseType: !47, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !9, line: 72, baseType: !16, size: 8, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !44, file: !9, line: 73, baseType: !20, offset: 136)
!53 = !{i32 2, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!57 = distinct !DISubprogram(name: "freePubsubPattern", scope: !1, file: !1, line: 36, type: !58, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !60)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !4}
!60 = !{!61, !62}
!61 = !DILocalVariable(name: "p", arg: 1, scope: !57, file: !1, line: 36, type: !4)
!62 = !DILocalVariable(name: "pat", scope: !57, file: !1, line: 37, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "pubsubPattern", file: !65, line: 1303, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pubsubPattern", file: !65, line: 1300, size: 128, elements: !67)
!67 = !{!68, !310}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !66, file: !65, line: 1301, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !65, line: 780, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !65, line: 723, size: 135360, elements: !72)
!72 = !{!73, !74, !76, !179, !189, !191, !196, !197, !198, !199, !201, !225, !226, !227, !228, !229, !230, !232, !233, !236, !237, !238, !239, !240, !241, !242, !243, !248, !249, !250, !251, !252, !253, !254, !255, !259, !260, !264, !265, !281, !282, !299, !300, !301, !302, !303, !304, !305, !306}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !71, file: !65, line: 724, baseType: !47, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !71, file: !65, line: 725, baseType: !75, size: 32, offset: 64)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !71, file: !65, line: 726, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !65, line: 656, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !65, line: 647, size: 512, elements: !80)
!80 = !{!81, !145, !146, !147, !148, !149, !150, !152}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !79, file: !65, line: 648, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !84, line: 82, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !84, line: 76, size: 768, elements: !86)
!86 = !{!87, !112, !113, !143, !144}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !84, line: 77, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !84, line: 65, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !84, line: 58, size: 384, elements: !91)
!91 = !{!92, !98, !102, !103, !107, !111}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !90, file: !84, line: 59, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!47, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !90, file: !84, line: 60, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!4, !4, !96}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !90, file: !84, line: 61, baseType: !99, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !90, file: !84, line: 62, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!75, !4, !96, !96}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !90, file: !84, line: 63, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !4, !4}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !90, file: !84, line: 64, baseType: !108, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !85, file: !84, line: 78, baseType: !4, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !85, file: !84, line: 79, baseType: !114, size: 512, offset: 128)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !141)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !84, line: 74, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !84, line: 69, size: 256, elements: !117)
!117 = !{!118, !138, !139, !140}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !116, file: !84, line: 70, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !84, line: 56, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !84, line: 47, size: 192, elements: !123)
!123 = !{!124, !125, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !122, file: !84, line: 48, baseType: !4, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !122, file: !84, line: 54, baseType: !126, size: 64, offset: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !122, file: !84, line: 49, size: 64, elements: !127)
!127 = !{!128, !129, !130, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !84, line: 50, baseType: !4, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !126, file: !84, line: 51, baseType: !47, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !126, file: !84, line: 52, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 56, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !15, line: 103, baseType: !133)
!133 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !126, file: !84, line: 53, baseType: !135, size: 64)
!135 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !84, line: 55, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !84, line: 71, baseType: !49, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !116, file: !84, line: 72, baseType: !49, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !116, file: !84, line: 73, baseType: !49, size: 64, offset: 192)
!141 = !{!142}
!142 = !DISubrange(count: 2)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !85, file: !84, line: 80, baseType: !133, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !85, file: !84, line: 81, baseType: !49, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !79, file: !65, line: 649, baseType: !82, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !79, file: !65, line: 650, baseType: !82, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !79, file: !65, line: 651, baseType: !82, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !79, file: !65, line: 652, baseType: !82, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !79, file: !65, line: 653, baseType: !75, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !79, file: !65, line: 654, baseType: !151, size: 64, offset: 384)
!151 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !79, file: !65, line: 655, baseType: !153, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !155, line: 54, baseType: !156)
!155 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !155, line: 47, size: 384, elements: !157)
!157 = !{!158, !167, !168, !172, !174, !178}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !156, file: !155, line: 48, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !155, line: 40, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !155, line: 36, size: 192, elements: !162)
!162 = !{!163, !165, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !155, line: 37, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !155, line: 38, baseType: !164, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !161, file: !155, line: 39, baseType: !4, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !155, line: 49, baseType: !159, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !156, file: !155, line: 50, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!4, !4}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !156, file: !155, line: 51, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !156, file: !155, line: 52, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!75, !4, !4}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !155, line: 53, baseType: !49, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !65, line: 727, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !65, line: 622, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !65, line: 614, size: 128, elements: !183)
!183 = !{!184, !185, !186, !187, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !65, line: 615, baseType: !39, size: 4, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !182, file: !65, line: 616, baseType: !39, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !182, file: !65, line: 617, baseType: !39, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !182, file: !65, line: 620, baseType: !75, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !182, file: !65, line: 621, baseType: !4, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !71, file: !65, line: 728, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !9, line: 43, baseType: !5)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !71, file: !65, line: 729, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !193, line: 40, baseType: !194)
!193 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !195, line: 129, baseType: !49)
!195 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !71, file: !65, line: 730, baseType: !190, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !71, file: !65, line: 734, baseType: !192, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !71, file: !65, line: 735, baseType: !75, size: 32, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !71, file: !65, line: 736, baseType: !200, size: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !71, file: !65, line: 737, baseType: !202, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !65, line: 1307, size: 640, elements: !204)
!204 = !{!205, !206, !211, !212, !213, !214, !220, !221, !222, !223, !224}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !65, line: 1308, baseType: !5, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !203, file: !65, line: 1309, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !65, line: 1305, baseType: !209)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !69}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !203, file: !65, line: 1310, baseType: !75, size: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !203, file: !65, line: 1311, baseType: !5, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !203, file: !65, line: 1312, baseType: !75, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !203, file: !65, line: 1315, baseType: !215, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !65, line: 1306, baseType: !217)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !202, !200, !75, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !203, file: !65, line: 1317, baseType: !75, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !203, file: !65, line: 1318, baseType: !75, size: 32, offset: 416)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !203, file: !65, line: 1319, baseType: !75, size: 32, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !203, file: !65, line: 1320, baseType: !151, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !203, file: !65, line: 1320, baseType: !151, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !71, file: !65, line: 737, baseType: !202, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !71, file: !65, line: 738, baseType: !75, size: 32, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !71, file: !65, line: 739, baseType: !75, size: 32, offset: 800)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !71, file: !65, line: 740, baseType: !133, size: 64, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !71, file: !65, line: 741, baseType: !153, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !71, file: !65, line: 742, baseType: !231, size: 64, offset: 960)
!231 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !71, file: !65, line: 743, baseType: !192, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !71, file: !65, line: 745, baseType: !234, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !235, line: 34, baseType: !133)
!235 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !71, file: !65, line: 746, baseType: !234, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !71, file: !65, line: 747, baseType: !234, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !71, file: !65, line: 748, baseType: !75, size: 32, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !71, file: !65, line: 749, baseType: !75, size: 32, offset: 1312)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !71, file: !65, line: 750, baseType: !75, size: 32, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !71, file: !65, line: 751, baseType: !75, size: 32, offset: 1376)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !71, file: !65, line: 752, baseType: !75, size: 32, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !71, file: !65, line: 753, baseType: !244, size: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !245, line: 173, baseType: !246)
!245 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !195, line: 100, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !195, line: 44, baseType: !133)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !71, file: !65, line: 754, baseType: !244, size: 64, offset: 1536)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !71, file: !65, line: 755, baseType: !190, size: 64, offset: 1600)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !71, file: !65, line: 756, baseType: !151, size: 64, offset: 1664)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !71, file: !65, line: 757, baseType: !151, size: 64, offset: 1728)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !71, file: !65, line: 758, baseType: !151, size: 64, offset: 1792)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !71, file: !65, line: 759, baseType: !151, size: 64, offset: 1856)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !71, file: !65, line: 760, baseType: !151, size: 64, offset: 1920)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !71, file: !65, line: 763, baseType: !256, size: 328, offset: 1984)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 328, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 41)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !71, file: !65, line: 764, baseType: !75, size: 32, offset: 2336)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !71, file: !65, line: 765, baseType: !261, size: 368, offset: 2368)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 368, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 46)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !71, file: !65, line: 766, baseType: !75, size: 32, offset: 2752)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !71, file: !65, line: 767, baseType: !266, size: 256, offset: 2816)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !65, line: 673, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !65, line: 665, size: 256, elements: !268)
!268 = !{!269, !277, !278, !279, !280}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !267, file: !65, line: 666, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !65, line: 663, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !65, line: 659, size: 192, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !272, file: !65, line: 660, baseType: !200, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !272, file: !65, line: 661, baseType: !75, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !272, file: !65, line: 662, baseType: !202, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !267, file: !65, line: 667, baseType: !75, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !267, file: !65, line: 668, baseType: !75, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !267, file: !65, line: 671, baseType: !75, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !267, file: !65, line: 672, baseType: !234, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !71, file: !65, line: 768, baseType: !75, size: 32, offset: 3072)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !71, file: !65, line: 769, baseType: !283, size: 704, offset: 3136)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !65, line: 703, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !65, line: 677, size: 704, elements: !285)
!285 = !{!286, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !284, file: !65, line: 679, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !65, line: 52, baseType: !151)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !284, file: !65, line: 683, baseType: !82, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !284, file: !65, line: 685, baseType: !180, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !284, file: !65, line: 689, baseType: !192, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !284, file: !65, line: 690, baseType: !180, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !284, file: !65, line: 691, baseType: !180, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !284, file: !65, line: 692, baseType: !287, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !284, file: !65, line: 692, baseType: !287, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !284, file: !65, line: 693, baseType: !75, size: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !284, file: !65, line: 696, baseType: !75, size: 32, offset: 544)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !284, file: !65, line: 697, baseType: !151, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !284, file: !65, line: 700, baseType: !4, size: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !71, file: !65, line: 770, baseType: !151, size: 64, offset: 3840)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !71, file: !65, line: 771, baseType: !153, size: 64, offset: 3904)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !71, file: !65, line: 772, baseType: !82, size: 64, offset: 3968)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !71, file: !65, line: 773, baseType: !153, size: 64, offset: 4032)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !71, file: !65, line: 774, baseType: !190, size: 64, offset: 4096)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !71, file: !65, line: 775, baseType: !159, size: 64, offset: 4160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !71, file: !65, line: 778, baseType: !75, size: 32, offset: 4224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !71, file: !65, line: 779, baseType: !307, size: 131072, offset: 4256)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 131072, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 16384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !66, file: !65, line: 1302, baseType: !180, size: 64, offset: 64)
!311 = !DILocation(line: 36, column: 30, scope: !57)
!312 = !DILocation(line: 37, column: 20, scope: !57)
!313 = !DILocation(line: 39, column: 23, scope: !57)
!314 = !{!315, !316, i64 8}
!315 = !{!"pubsubPattern", !316, i64 0, !316, i64 8}
!316 = !{!"any pointer", !317, i64 0}
!317 = !{!"omnipotent char", !318, i64 0}
!318 = !{!"Simple C/C++ TBAA"}
!319 = !DILocation(line: 39, column: 5, scope: !57)
!320 = !DILocation(line: 40, column: 5, scope: !57)
!321 = !DILocation(line: 41, column: 1, scope: !57)
!322 = distinct !DISubprogram(name: "listMatchPubsubPattern", scope: !1, file: !1, line: 43, type: !176, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !323)
!323 = !{!324, !325, !326, !327}
!324 = !DILocalVariable(name: "a", arg: 1, scope: !322, file: !1, line: 43, type: !4)
!325 = !DILocalVariable(name: "b", arg: 2, scope: !322, file: !1, line: 43, type: !4)
!326 = !DILocalVariable(name: "pa", scope: !322, file: !1, line: 44, type: !63)
!327 = !DILocalVariable(name: "pb", scope: !322, file: !1, line: 44, type: !63)
!328 = !DILocation(line: 43, column: 34, scope: !322)
!329 = !DILocation(line: 43, column: 43, scope: !322)
!330 = !DILocation(line: 46, column: 17, scope: !322)
!331 = !{!315, !316, i64 0}
!332 = !DILocation(line: 46, column: 31, scope: !322)
!333 = !DILocation(line: 46, column: 24, scope: !322)
!334 = !DILocation(line: 46, column: 39, scope: !322)
!335 = !DILocation(line: 44, column: 29, scope: !322)
!336 = !DILocation(line: 44, column: 20, scope: !322)
!337 = !DILocation(line: 47, column: 36, scope: !322)
!338 = !DILocation(line: 47, column: 48, scope: !322)
!339 = !DILocation(line: 47, column: 13, scope: !322)
!340 = !DILocation(line: 46, column: 5, scope: !322)
!341 = distinct !DISubprogram(name: "clientSubscriptionsCount", scope: !1, file: !1, line: 51, type: !342, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !344)
!342 = !DISubroutineType(types: !343)
!343 = !{!75, !69}
!344 = !{!345}
!345 = !DILocalVariable(name: "c", arg: 1, scope: !341, file: !1, line: 51, type: !69)
!346 = !DILocation(line: 51, column: 38, scope: !341)
!347 = !DILocation(line: 52, column: 12, scope: !341)
!348 = !{!349, !316, i64 496}
!349 = !{!"client", !350, i64 0, !351, i64 8, !316, i64 16, !316, i64 24, !316, i64 32, !350, i64 40, !316, i64 48, !350, i64 56, !351, i64 64, !316, i64 72, !316, i64 80, !316, i64 88, !351, i64 96, !351, i64 100, !350, i64 104, !316, i64 112, !352, i64 120, !350, i64 128, !350, i64 136, !350, i64 144, !350, i64 152, !351, i64 160, !351, i64 164, !351, i64 168, !351, i64 172, !351, i64 176, !350, i64 184, !350, i64 192, !316, i64 200, !352, i64 208, !352, i64 216, !352, i64 224, !352, i64 232, !352, i64 240, !317, i64 248, !351, i64 292, !317, i64 296, !351, i64 344, !353, i64 352, !351, i64 384, !354, i64 392, !352, i64 480, !316, i64 488, !316, i64 496, !316, i64 504, !316, i64 512, !316, i64 520, !351, i64 528, !317, i64 532}
!350 = !{!"long", !317, i64 0}
!351 = !{!"int", !317, i64 0}
!352 = !{!"long long", !317, i64 0}
!353 = !{!"multiState", !316, i64 0, !351, i64 8, !351, i64 12, !351, i64 16, !350, i64 24}
!354 = !{!"blockingState", !352, i64 0, !316, i64 8, !316, i64 16, !350, i64 24, !316, i64 32, !316, i64 40, !352, i64 48, !352, i64 56, !351, i64 64, !351, i64 68, !352, i64 72, !316, i64 80}
!355 = !{!356, !350, i64 24}
!356 = !{!"dictht", !316, i64 0, !350, i64 8, !350, i64 16, !350, i64 24}
!357 = !DILocation(line: 53, column: 12, scope: !341)
!358 = !{!349, !316, i64 504}
!359 = !{!360, !350, i64 40}
!360 = !{!"list", !316, i64 0, !316, i64 8, !316, i64 16, !316, i64 24, !316, i64 32, !350, i64 40}
!361 = !DILocation(line: 52, column: 40, scope: !341)
!362 = !DILocation(line: 52, column: 5, scope: !341)
!363 = distinct !DISubprogram(name: "pubsubSubscribeChannel", scope: !1, file: !1, line: 58, type: !364, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!75, !69, !180}
!366 = !{!367, !368, !369, !370, !371}
!367 = !DILocalVariable(name: "c", arg: 1, scope: !363, file: !1, line: 58, type: !69)
!368 = !DILocalVariable(name: "channel", arg: 2, scope: !363, file: !1, line: 58, type: !180)
!369 = !DILocalVariable(name: "de", scope: !363, file: !1, line: 59, type: !120)
!370 = !DILocalVariable(name: "clients", scope: !363, file: !1, line: 60, type: !153)
!371 = !DILocalVariable(name: "retval", scope: !363, file: !1, line: 61, type: !75)
!372 = !DILocation(line: 58, column: 36, scope: !363)
!373 = !DILocation(line: 58, column: 45, scope: !363)
!374 = !DILocation(line: 60, column: 11, scope: !363)
!375 = !DILocation(line: 61, column: 9, scope: !363)
!376 = !DILocation(line: 64, column: 20, scope: !377)
!377 = distinct !DILexicalBlock(scope: !363, file: !1, line: 64, column: 9)
!378 = !DILocation(line: 64, column: 36, scope: !377)
!379 = !DILocation(line: 64, column: 9, scope: !377)
!380 = !DILocation(line: 64, column: 50, scope: !377)
!381 = !DILocation(line: 64, column: 9, scope: !363)
!382 = !DILocation(line: 66, column: 9, scope: !383)
!383 = distinct !DILexicalBlock(scope: !377, file: !1, line: 64, column: 62)
!384 = !DILocation(line: 68, column: 30, scope: !383)
!385 = !{!386, !316, i64 2904}
!386 = !{!"redisServer", !351, i64 0, !316, i64 8, !316, i64 16, !316, i64 24, !351, i64 32, !351, i64 36, !351, i64 40, !316, i64 48, !316, i64 56, !316, i64 64, !316, i64 72, !351, i64 80, !351, i64 84, !351, i64 88, !351, i64 92, !316, i64 96, !316, i64 104, !351, i64 112, !351, i64 116, !317, i64 120, !351, i64 164, !350, i64 168, !351, i64 176, !316, i64 184, !316, i64 192, !316, i64 200, !317, i64 208, !351, i64 216, !351, i64 220, !317, i64 224, !351, i64 352, !316, i64 360, !351, i64 368, !317, i64 372, !351, i64 436, !351, i64 440, !317, i64 444, !351, i64 508, !316, i64 512, !316, i64 520, !316, i64 528, !316, i64 536, !316, i64 544, !316, i64 552, !316, i64 560, !351, i64 568, !352, i64 576, !317, i64 584, !316, i64 840, !350, i64 848, !351, i64 856, !351, i64 860, !350, i64 864, !350, i64 872, !350, i64 880, !350, i64 888, !316, i64 896, !316, i64 904, !316, i64 912, !316, i64 920, !316, i64 928, !316, i64 936, !316, i64 944, !316, i64 952, !316, i64 960, !316, i64 968, !316, i64 976, !316, i64 984, !316, i64 992, !350, i64 1000, !352, i64 1008, !352, i64 1016, !352, i64 1024, !387, i64 1032, !352, i64 1040, !352, i64 1048, !352, i64 1056, !352, i64 1064, !352, i64 1072, !352, i64 1080, !352, i64 1088, !352, i64 1096, !352, i64 1104, !350, i64 1112, !352, i64 1120, !387, i64 1128, !352, i64 1136, !352, i64 1144, !352, i64 1152, !352, i64 1160, !316, i64 1168, !352, i64 1176, !352, i64 1184, !350, i64 1192, !388, i64 1200, !352, i64 1240, !352, i64 1248, !350, i64 1256, !350, i64 1264, !317, i64 1272, !351, i64 1728, !351, i64 1732, !351, i64 1736, !351, i64 1740, !351, i64 1744, !350, i64 1752, !351, i64 1760, !351, i64 1764, !351, i64 1768, !351, i64 1772, !350, i64 1776, !350, i64 1784, !351, i64 1792, !351, i64 1796, !351, i64 1800, !351, i64 1804, !317, i64 1808, !351, i64 1880, !351, i64 1884, !316, i64 1888, !351, i64 1896, !351, i64 1900, !350, i64 1904, !350, i64 1912, !350, i64 1920, !350, i64 1928, !351, i64 1936, !351, i64 1940, !316, i64 1944, !316, i64 1952, !351, i64 1960, !351, i64 1964, !350, i64 1968, !350, i64 1976, !350, i64 1984, !350, i64 1992, !351, i64 2000, !350, i64 2008, !351, i64 2016, !351, i64 2020, !351, i64 2024, !351, i64 2028, !351, i64 2032, !351, i64 2036, !351, i64 2040, !351, i64 2044, !351, i64 2048, !351, i64 2052, !351, i64 2056, !351, i64 2060, !351, i64 2064, !316, i64 2072, !352, i64 2080, !352, i64 2088, !351, i64 2096, !316, i64 2104, !351, i64 2112, !316, i64 2120, !351, i64 2128, !351, i64 2132, !350, i64 2136, !350, i64 2144, !350, i64 2152, !350, i64 2160, !351, i64 2168, !351, i64 2172, !351, i64 2176, !351, i64 2180, !351, i64 2184, !351, i64 2188, !317, i64 2192, !389, i64 2200, !390, i64 2224, !316, i64 2240, !351, i64 2248, !316, i64 2256, !351, i64 2264, !317, i64 2268, !317, i64 2309, !352, i64 2352, !352, i64 2360, !351, i64 2368, !351, i64 2372, !316, i64 2376, !352, i64 2384, !352, i64 2392, !352, i64 2400, !352, i64 2408, !350, i64 2416, !350, i64 2424, !351, i64 2432, !351, i64 2436, !351, i64 2440, !351, i64 2444, !351, i64 2448, !316, i64 2456, !316, i64 2464, !351, i64 2472, !351, i64 2476, !316, i64 2480, !316, i64 2488, !351, i64 2496, !351, i64 2500, !350, i64 2504, !350, i64 2512, !350, i64 2520, !351, i64 2528, !351, i64 2532, !316, i64 2536, !350, i64 2544, !351, i64 2552, !351, i64 2556, !351, i64 2560, !350, i64 2568, !351, i64 2576, !351, i64 2580, !351, i64 2584, !316, i64 2592, !317, i64 2600, !352, i64 2648, !351, i64 2656, !316, i64 2664, !316, i64 2672, !351, i64 2680, !316, i64 2688, !351, i64 2696, !351, i64 2700, !352, i64 2704, !351, i64 2712, !351, i64 2716, !351, i64 2720, !351, i64 2724, !352, i64 2728, !351, i64 2736, !317, i64 2740, !316, i64 2768, !316, i64 2776, !351, i64 2784, !351, i64 2788, !351, i64 2792, !351, i64 2796, !350, i64 2800, !350, i64 2808, !350, i64 2816, !350, i64 2824, !350, i64 2832, !350, i64 2840, !350, i64 2848, !350, i64 2856, !351, i64 2864, !351, i64 2868, !350, i64 2872, !350, i64 2880, !351, i64 2888, !352, i64 2896, !316, i64 2904, !316, i64 2912, !351, i64 2920, !351, i64 2924, !352, i64 2928, !316, i64 2936, !316, i64 2944, !351, i64 2952, !351, i64 2956, !351, i64 2960, !351, i64 2964, !316, i64 2968, !351, i64 2976, !351, i64 2980, !351, i64 2984, !316, i64 2992, !316, i64 3000, !316, i64 3008, !316, i64 3016, !352, i64 3024, !352, i64 3032, !352, i64 3040, !351, i64 3048, !351, i64 3052, !351, i64 3056, !351, i64 3060, !351, i64 3064, !351, i64 3068, !351, i64 3072, !351, i64 3076, !351, i64 3080, !351, i64 3084, !351, i64 3088, !352, i64 3096, !316, i64 3104, !316, i64 3112, !316, i64 3120, !351, i64 3128, !351, i64 3132, !351, i64 3136, !350, i64 3144, !316, i64 3152, !316, i64 3160, !316, i64 3168}
!387 = !{!"double", !317, i64 0}
!388 = !{!"malloc_stats", !350, i64 0, !350, i64 8, !350, i64 16, !350, i64 24, !350, i64 32}
!389 = !{!"", !351, i64 0, !350, i64 8, !352, i64 16}
!390 = !{!"redisOpArray", !316, i64 0, !351, i64 8}
!391 = !DILocation(line: 68, column: 14, scope: !383)
!392 = !DILocation(line: 59, column: 16, scope: !363)
!393 = !DILocation(line: 69, column: 16, scope: !394)
!394 = distinct !DILexicalBlock(scope: !383, file: !1, line: 69, column: 13)
!395 = !DILocation(line: 69, column: 13, scope: !383)
!396 = !DILocation(line: 70, column: 23, scope: !397)
!397 = distinct !DILexicalBlock(scope: !394, file: !1, line: 69, column: 25)
!398 = !DILocation(line: 71, column: 28, scope: !397)
!399 = !DILocation(line: 71, column: 52, scope: !397)
!400 = !DILocation(line: 71, column: 13, scope: !397)
!401 = !DILocation(line: 72, column: 13, scope: !397)
!402 = !DILocation(line: 73, column: 9, scope: !397)
!403 = !DILocation(line: 74, column: 23, scope: !404)
!404 = distinct !DILexicalBlock(scope: !394, file: !1, line: 73, column: 16)
!405 = !{!317, !317, i64 0}
!406 = !DILocation(line: 0, scope: !404)
!407 = !DILocation(line: 76, column: 33, scope: !383)
!408 = !DILocation(line: 76, column: 9, scope: !383)
!409 = !DILocation(line: 77, column: 5, scope: !383)
!410 = !DILocation(line: 0, scope: !363)
!411 = !DILocation(line: 79, column: 16, scope: !363)
!412 = !{!316, !316, i64 0}
!413 = !DILocation(line: 79, column: 5, scope: !363)
!414 = !DILocation(line: 80, column: 23, scope: !363)
!415 = !{!416, !316, i64 264}
!416 = !{!"sharedObjectsStruct", !316, i64 0, !316, i64 8, !316, i64 16, !316, i64 24, !316, i64 32, !316, i64 40, !316, i64 48, !316, i64 56, !316, i64 64, !316, i64 72, !316, i64 80, !316, i64 88, !316, i64 96, !316, i64 104, !316, i64 112, !316, i64 120, !316, i64 128, !316, i64 136, !316, i64 144, !316, i64 152, !316, i64 160, !316, i64 168, !316, i64 176, !316, i64 184, !316, i64 192, !316, i64 200, !316, i64 208, !316, i64 216, !316, i64 224, !316, i64 232, !316, i64 240, !316, i64 248, !316, i64 256, !316, i64 264, !316, i64 272, !316, i64 280, !316, i64 288, !316, i64 296, !316, i64 304, !316, i64 312, !316, i64 320, !316, i64 328, !316, i64 336, !316, i64 344, !316, i64 352, !316, i64 360, !317, i64 368, !317, i64 448, !317, i64 80448, !317, i64 80704, !316, i64 80960, !316, i64 80968}
!417 = !DILocation(line: 80, column: 5, scope: !363)
!418 = !DILocation(line: 81, column: 5, scope: !363)
!419 = !DILocation(line: 51, column: 38, scope: !341, inlinedAt: !420)
!420 = distinct !DILocation(line: 82, column: 24, scope: !363)
!421 = !DILocation(line: 52, column: 12, scope: !341, inlinedAt: !420)
!422 = !DILocation(line: 53, column: 12, scope: !341, inlinedAt: !420)
!423 = !DILocation(line: 52, column: 40, scope: !341, inlinedAt: !420)
!424 = !DILocation(line: 52, column: 5, scope: !341, inlinedAt: !420)
!425 = !DILocation(line: 82, column: 24, scope: !363)
!426 = !DILocation(line: 82, column: 5, scope: !363)
!427 = !DILocation(line: 83, column: 5, scope: !363)
!428 = distinct !DISubprogram(name: "pubsubUnsubscribeChannel", scope: !1, file: !1, line: 88, type: !429, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!75, !69, !180, !75}
!431 = !{!432, !433, !434, !435, !436, !437, !438}
!432 = !DILocalVariable(name: "c", arg: 1, scope: !428, file: !1, line: 88, type: !69)
!433 = !DILocalVariable(name: "channel", arg: 2, scope: !428, file: !1, line: 88, type: !180)
!434 = !DILocalVariable(name: "notify", arg: 3, scope: !428, file: !1, line: 88, type: !75)
!435 = !DILocalVariable(name: "de", scope: !428, file: !1, line: 89, type: !120)
!436 = !DILocalVariable(name: "clients", scope: !428, file: !1, line: 90, type: !153)
!437 = !DILocalVariable(name: "ln", scope: !428, file: !1, line: 91, type: !159)
!438 = !DILocalVariable(name: "retval", scope: !428, file: !1, line: 92, type: !75)
!439 = !DILocation(line: 88, column: 38, scope: !428)
!440 = !DILocation(line: 88, column: 47, scope: !428)
!441 = !DILocation(line: 88, column: 60, scope: !428)
!442 = !DILocation(line: 92, column: 9, scope: !428)
!443 = !DILocation(line: 95, column: 5, scope: !428)
!444 = !DILocation(line: 97, column: 23, scope: !445)
!445 = distinct !DILexicalBlock(scope: !428, file: !1, line: 97, column: 9)
!446 = !DILocation(line: 97, column: 39, scope: !445)
!447 = !DILocation(line: 97, column: 9, scope: !445)
!448 = !DILocation(line: 97, column: 48, scope: !445)
!449 = !DILocation(line: 97, column: 9, scope: !428)
!450 = !DILocation(line: 100, column: 30, scope: !451)
!451 = distinct !DILexicalBlock(scope: !445, file: !1, line: 97, column: 60)
!452 = !DILocation(line: 100, column: 14, scope: !451)
!453 = !DILocation(line: 89, column: 16, scope: !428)
!454 = !DILocation(line: 101, column: 9, scope: !451)
!455 = !DILocation(line: 102, column: 19, scope: !451)
!456 = !DILocation(line: 90, column: 11, scope: !428)
!457 = !DILocation(line: 103, column: 36, scope: !451)
!458 = !DILocation(line: 103, column: 14, scope: !451)
!459 = !DILocation(line: 91, column: 15, scope: !428)
!460 = !DILocation(line: 104, column: 9, scope: !451)
!461 = !DILocation(line: 105, column: 9, scope: !451)
!462 = !DILocation(line: 106, column: 13, scope: !463)
!463 = distinct !DILexicalBlock(scope: !451, file: !1, line: 106, column: 13)
!464 = !DILocation(line: 106, column: 33, scope: !463)
!465 = !DILocation(line: 106, column: 13, scope: !451)
!466 = !DILocation(line: 110, column: 31, scope: !467)
!467 = distinct !DILexicalBlock(scope: !463, file: !1, line: 106, column: 39)
!468 = !DILocation(line: 110, column: 13, scope: !467)
!469 = !DILocation(line: 111, column: 9, scope: !467)
!470 = !DILocation(line: 0, scope: !428)
!471 = !DILocation(line: 114, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !428, file: !1, line: 114, column: 9)
!473 = !DILocation(line: 114, column: 9, scope: !428)
!474 = !DILocation(line: 115, column: 20, scope: !475)
!475 = distinct !DILexicalBlock(scope: !472, file: !1, line: 114, column: 17)
!476 = !DILocation(line: 115, column: 9, scope: !475)
!477 = !DILocation(line: 116, column: 27, scope: !475)
!478 = !{!416, !316, i64 272}
!479 = !DILocation(line: 116, column: 9, scope: !475)
!480 = !DILocation(line: 117, column: 9, scope: !475)
!481 = !DILocation(line: 118, column: 28, scope: !475)
!482 = !DILocation(line: 119, column: 24, scope: !475)
!483 = !DILocation(line: 118, column: 56, scope: !475)
!484 = !DILocation(line: 118, column: 9, scope: !475)
!485 = !DILocation(line: 121, column: 5, scope: !475)
!486 = !DILocation(line: 122, column: 5, scope: !428)
!487 = !DILocation(line: 123, column: 5, scope: !428)
!488 = distinct !DISubprogram(name: "pubsubSubscribePattern", scope: !1, file: !1, line: 127, type: !364, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DILocalVariable(name: "c", arg: 1, scope: !488, file: !1, line: 127, type: !69)
!491 = !DILocalVariable(name: "pattern", arg: 2, scope: !488, file: !1, line: 127, type: !180)
!492 = !DILocalVariable(name: "retval", scope: !488, file: !1, line: 128, type: !75)
!493 = !DILocalVariable(name: "pat", scope: !494, file: !1, line: 132, type: !63)
!494 = distinct !DILexicalBlock(scope: !495, file: !1, line: 130, column: 60)
!495 = distinct !DILexicalBlock(scope: !488, file: !1, line: 130, column: 9)
!496 = !DILocation(line: 127, column: 36, scope: !488)
!497 = !DILocation(line: 127, column: 45, scope: !488)
!498 = !DILocation(line: 128, column: 9, scope: !488)
!499 = !DILocation(line: 130, column: 26, scope: !495)
!500 = !DILocation(line: 130, column: 42, scope: !495)
!501 = !DILocation(line: 130, column: 9, scope: !495)
!502 = !DILocation(line: 130, column: 51, scope: !495)
!503 = !DILocation(line: 130, column: 9, scope: !488)
!504 = !DILocation(line: 133, column: 28, scope: !494)
!505 = !DILocation(line: 133, column: 9, scope: !494)
!506 = !DILocation(line: 134, column: 9, scope: !494)
!507 = !DILocation(line: 135, column: 15, scope: !494)
!508 = !DILocation(line: 132, column: 24, scope: !494)
!509 = !DILocation(line: 136, column: 24, scope: !494)
!510 = !DILocation(line: 136, column: 14, scope: !494)
!511 = !DILocation(line: 136, column: 22, scope: !494)
!512 = !DILocation(line: 137, column: 14, scope: !494)
!513 = !DILocation(line: 137, column: 21, scope: !494)
!514 = !DILocation(line: 138, column: 32, scope: !494)
!515 = !{!386, !316, i64 2912}
!516 = !DILocation(line: 138, column: 9, scope: !494)
!517 = !DILocation(line: 139, column: 5, scope: !494)
!518 = !DILocation(line: 0, scope: !488)
!519 = !DILocation(line: 141, column: 16, scope: !488)
!520 = !DILocation(line: 141, column: 5, scope: !488)
!521 = !DILocation(line: 142, column: 23, scope: !488)
!522 = !{!416, !316, i64 280}
!523 = !DILocation(line: 142, column: 5, scope: !488)
!524 = !DILocation(line: 143, column: 5, scope: !488)
!525 = !DILocation(line: 51, column: 38, scope: !341, inlinedAt: !526)
!526 = distinct !DILocation(line: 144, column: 24, scope: !488)
!527 = !DILocation(line: 52, column: 12, scope: !341, inlinedAt: !526)
!528 = !DILocation(line: 53, column: 12, scope: !341, inlinedAt: !526)
!529 = !DILocation(line: 52, column: 40, scope: !341, inlinedAt: !526)
!530 = !DILocation(line: 52, column: 5, scope: !341, inlinedAt: !526)
!531 = !DILocation(line: 144, column: 24, scope: !488)
!532 = !DILocation(line: 144, column: 5, scope: !488)
!533 = !DILocation(line: 145, column: 5, scope: !488)
!534 = distinct !DISubprogram(name: "pubsubUnsubscribePattern", scope: !1, file: !1, line: 150, type: !429, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !535)
!535 = !{!536, !537, !538, !539, !540, !541}
!536 = !DILocalVariable(name: "c", arg: 1, scope: !534, file: !1, line: 150, type: !69)
!537 = !DILocalVariable(name: "pattern", arg: 2, scope: !534, file: !1, line: 150, type: !180)
!538 = !DILocalVariable(name: "notify", arg: 3, scope: !534, file: !1, line: 150, type: !75)
!539 = !DILocalVariable(name: "ln", scope: !534, file: !1, line: 151, type: !159)
!540 = !DILocalVariable(name: "pat", scope: !534, file: !1, line: 152, type: !64)
!541 = !DILocalVariable(name: "retval", scope: !534, file: !1, line: 153, type: !75)
!542 = !DILocation(line: 150, column: 38, scope: !534)
!543 = !DILocation(line: 150, column: 47, scope: !534)
!544 = !DILocation(line: 150, column: 60, scope: !534)
!545 = !DILocation(line: 152, column: 5, scope: !534)
!546 = !DILocation(line: 153, column: 9, scope: !534)
!547 = !DILocation(line: 155, column: 5, scope: !534)
!548 = !DILocation(line: 156, column: 32, scope: !549)
!549 = distinct !DILexicalBlock(scope: !534, file: !1, line: 156, column: 9)
!550 = !DILocation(line: 156, column: 48, scope: !549)
!551 = !DILocation(line: 156, column: 15, scope: !549)
!552 = !DILocation(line: 151, column: 15, scope: !534)
!553 = !DILocation(line: 156, column: 58, scope: !549)
!554 = !DILocation(line: 156, column: 9, scope: !534)
!555 = !DILocation(line: 158, column: 24, scope: !556)
!556 = distinct !DILexicalBlock(scope: !549, file: !1, line: 156, column: 67)
!557 = !DILocation(line: 158, column: 9, scope: !556)
!558 = !DILocation(line: 159, column: 13, scope: !556)
!559 = !DILocation(line: 159, column: 20, scope: !556)
!560 = !DILocation(line: 160, column: 13, scope: !556)
!561 = !DILocation(line: 160, column: 21, scope: !556)
!562 = !DILocation(line: 161, column: 35, scope: !556)
!563 = !DILocation(line: 161, column: 14, scope: !556)
!564 = !DILocation(line: 162, column: 28, scope: !556)
!565 = !DILocation(line: 162, column: 9, scope: !556)
!566 = !DILocation(line: 163, column: 5, scope: !556)
!567 = !DILocation(line: 0, scope: !534)
!568 = !DILocation(line: 165, column: 9, scope: !569)
!569 = distinct !DILexicalBlock(scope: !534, file: !1, line: 165, column: 9)
!570 = !DILocation(line: 165, column: 9, scope: !534)
!571 = !DILocation(line: 166, column: 20, scope: !572)
!572 = distinct !DILexicalBlock(scope: !569, file: !1, line: 165, column: 17)
!573 = !DILocation(line: 166, column: 9, scope: !572)
!574 = !DILocation(line: 167, column: 27, scope: !572)
!575 = !{!416, !316, i64 288}
!576 = !DILocation(line: 167, column: 9, scope: !572)
!577 = !DILocation(line: 168, column: 9, scope: !572)
!578 = !DILocation(line: 169, column: 28, scope: !572)
!579 = !DILocation(line: 170, column: 24, scope: !572)
!580 = !DILocation(line: 169, column: 56, scope: !572)
!581 = !DILocation(line: 169, column: 9, scope: !572)
!582 = !DILocation(line: 171, column: 5, scope: !572)
!583 = !DILocation(line: 172, column: 5, scope: !534)
!584 = !DILocation(line: 174, column: 1, scope: !534)
!585 = !DILocation(line: 173, column: 5, scope: !534)
!586 = distinct !DISubprogram(name: "pubsubUnsubscribeAllChannels", scope: !1, file: !1, line: 178, type: !587, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!75, !69, !75}
!589 = !{!590, !591, !592, !604, !605, !606}
!590 = !DILocalVariable(name: "c", arg: 1, scope: !586, file: !1, line: 178, type: !69)
!591 = !DILocalVariable(name: "notify", arg: 2, scope: !586, file: !1, line: 178, type: !75)
!592 = !DILocalVariable(name: "di", scope: !586, file: !1, line: 179, type: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !84, line: 95, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !84, line: 88, size: 384, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !595, file: !84, line: 89, baseType: !82, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !595, file: !84, line: 90, baseType: !133, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !595, file: !84, line: 91, baseType: !75, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !595, file: !84, line: 91, baseType: !75, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !595, file: !84, line: 92, baseType: !120, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !595, file: !84, line: 92, baseType: !120, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !595, file: !84, line: 94, baseType: !151, size: 64, offset: 320)
!604 = !DILocalVariable(name: "de", scope: !586, file: !1, line: 180, type: !120)
!605 = !DILocalVariable(name: "count", scope: !586, file: !1, line: 181, type: !75)
!606 = !DILocalVariable(name: "channel", scope: !607, file: !1, line: 184, type: !180)
!607 = distinct !DILexicalBlock(scope: !586, file: !1, line: 183, column: 40)
!608 = !DILocation(line: 178, column: 42, scope: !586)
!609 = !DILocation(line: 178, column: 49, scope: !586)
!610 = !DILocation(line: 179, column: 47, scope: !586)
!611 = !DILocation(line: 179, column: 24, scope: !586)
!612 = !DILocation(line: 179, column: 19, scope: !586)
!613 = !DILocation(line: 181, column: 9, scope: !586)
!614 = !DILocation(line: 183, column: 17, scope: !586)
!615 = !DILocation(line: 180, column: 16, scope: !586)
!616 = !DILocation(line: 183, column: 31, scope: !586)
!617 = !DILocation(line: 183, column: 5, scope: !586)
!618 = !DILocation(line: 184, column: 25, scope: !607)
!619 = !{!620, !316, i64 0}
!620 = !{!"dictEntry", !316, i64 0, !317, i64 8, !316, i64 16}
!621 = !DILocation(line: 184, column: 15, scope: !607)
!622 = !DILocation(line: 186, column: 18, scope: !607)
!623 = !DILocation(line: 186, column: 15, scope: !607)
!624 = distinct !{!624, !617, !625}
!625 = !DILocation(line: 187, column: 5, scope: !586)
!626 = !DILocation(line: 0, scope: !607)
!627 = !DILocation(line: 189, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !586, file: !1, line: 189, column: 9)
!629 = !DILocation(line: 189, column: 25, scope: !628)
!630 = !DILocation(line: 189, column: 16, scope: !628)
!631 = !DILocation(line: 190, column: 20, scope: !632)
!632 = distinct !DILexicalBlock(scope: !628, file: !1, line: 189, column: 31)
!633 = !DILocation(line: 190, column: 9, scope: !632)
!634 = !DILocation(line: 191, column: 27, scope: !632)
!635 = !DILocation(line: 191, column: 9, scope: !632)
!636 = !DILocation(line: 192, column: 27, scope: !632)
!637 = !{!416, !316, i64 80}
!638 = !DILocation(line: 192, column: 9, scope: !632)
!639 = !DILocation(line: 193, column: 28, scope: !632)
!640 = !DILocation(line: 194, column: 24, scope: !632)
!641 = !DILocation(line: 193, column: 56, scope: !632)
!642 = !DILocation(line: 193, column: 9, scope: !632)
!643 = !DILocation(line: 195, column: 5, scope: !632)
!644 = !DILocation(line: 196, column: 5, scope: !586)
!645 = !DILocation(line: 197, column: 5, scope: !586)
!646 = distinct !DISubprogram(name: "pubsubUnsubscribeAllPatterns", scope: !1, file: !1, line: 202, type: !587, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !647)
!647 = !{!648, !649, !650, !651, !657, !658}
!648 = !DILocalVariable(name: "c", arg: 1, scope: !646, file: !1, line: 202, type: !69)
!649 = !DILocalVariable(name: "notify", arg: 2, scope: !646, file: !1, line: 202, type: !75)
!650 = !DILocalVariable(name: "ln", scope: !646, file: !1, line: 203, type: !159)
!651 = !DILocalVariable(name: "li", scope: !646, file: !1, line: 204, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !155, line: 45, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !155, line: 42, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !155, line: 43, baseType: !159, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !653, file: !155, line: 44, baseType: !75, size: 32, offset: 64)
!657 = !DILocalVariable(name: "count", scope: !646, file: !1, line: 205, type: !75)
!658 = !DILocalVariable(name: "pattern", scope: !659, file: !1, line: 209, type: !180)
!659 = distinct !DILexicalBlock(scope: !646, file: !1, line: 208, column: 42)
!660 = !DILocation(line: 202, column: 42, scope: !646)
!661 = !DILocation(line: 202, column: 49, scope: !646)
!662 = !DILocation(line: 204, column: 5, scope: !646)
!663 = !DILocation(line: 205, column: 9, scope: !646)
!664 = !DILocation(line: 207, column: 19, scope: !646)
!665 = !DILocation(line: 204, column: 14, scope: !646)
!666 = !DILocation(line: 207, column: 5, scope: !646)
!667 = !DILocation(line: 208, column: 18, scope: !646)
!668 = !DILocation(line: 203, column: 15, scope: !646)
!669 = !DILocation(line: 208, column: 33, scope: !646)
!670 = !DILocation(line: 208, column: 5, scope: !646)
!671 = !DILocation(line: 209, column: 29, scope: !659)
!672 = !{!673, !316, i64 16}
!673 = !{!"listNode", !316, i64 0, !316, i64 8, !316, i64 16}
!674 = !DILocation(line: 209, column: 15, scope: !659)
!675 = !DILocation(line: 211, column: 18, scope: !659)
!676 = !DILocation(line: 211, column: 15, scope: !659)
!677 = distinct !{!677, !670, !678}
!678 = !DILocation(line: 212, column: 5, scope: !646)
!679 = !DILocation(line: 0, scope: !659)
!680 = !DILocation(line: 213, column: 9, scope: !681)
!681 = distinct !DILexicalBlock(scope: !646, file: !1, line: 213, column: 9)
!682 = !DILocation(line: 213, column: 25, scope: !681)
!683 = !DILocation(line: 213, column: 16, scope: !681)
!684 = !DILocation(line: 215, column: 20, scope: !685)
!685 = distinct !DILexicalBlock(scope: !681, file: !1, line: 213, column: 31)
!686 = !DILocation(line: 215, column: 9, scope: !685)
!687 = !DILocation(line: 216, column: 27, scope: !685)
!688 = !DILocation(line: 216, column: 9, scope: !685)
!689 = !DILocation(line: 217, column: 27, scope: !685)
!690 = !DILocation(line: 217, column: 9, scope: !685)
!691 = !DILocation(line: 218, column: 28, scope: !685)
!692 = !DILocation(line: 219, column: 24, scope: !685)
!693 = !DILocation(line: 218, column: 56, scope: !685)
!694 = !DILocation(line: 218, column: 9, scope: !685)
!695 = !DILocation(line: 220, column: 5, scope: !685)
!696 = !DILocation(line: 222, column: 1, scope: !646)
!697 = !DILocation(line: 221, column: 5, scope: !646)
!698 = distinct !DISubprogram(name: "pubsubPublishMessage", scope: !1, file: !1, line: 225, type: !699, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{!75, !180, !180}
!701 = !{!702, !703, !704, !705, !706, !707, !708, !711, !712, !713, !715}
!702 = !DILocalVariable(name: "channel", arg: 1, scope: !698, file: !1, line: 225, type: !180)
!703 = !DILocalVariable(name: "message", arg: 2, scope: !698, file: !1, line: 225, type: !180)
!704 = !DILocalVariable(name: "receivers", scope: !698, file: !1, line: 226, type: !75)
!705 = !DILocalVariable(name: "de", scope: !698, file: !1, line: 227, type: !120)
!706 = !DILocalVariable(name: "ln", scope: !698, file: !1, line: 228, type: !159)
!707 = !DILocalVariable(name: "li", scope: !698, file: !1, line: 229, type: !652)
!708 = !DILocalVariable(name: "list", scope: !709, file: !1, line: 234, type: !153)
!709 = distinct !DILexicalBlock(scope: !710, file: !1, line: 233, column: 13)
!710 = distinct !DILexicalBlock(scope: !698, file: !1, line: 233, column: 9)
!711 = !DILocalVariable(name: "ln", scope: !709, file: !1, line: 235, type: !159)
!712 = !DILocalVariable(name: "li", scope: !709, file: !1, line: 236, type: !652)
!713 = !DILocalVariable(name: "c", scope: !714, file: !1, line: 240, type: !69)
!714 = distinct !DILexicalBlock(scope: !709, file: !1, line: 239, column: 46)
!715 = !DILocalVariable(name: "pat", scope: !716, file: !1, line: 254, type: !63)
