; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/putw.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/putw.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @putw(i32, %struct.__sFILE*) local_unnamed_addr #0 !dbg !11 {
  %3 = alloca i32, align 4
  call void @llvm.dbg.value(metadata i32 %0, metadata !235, metadata !DIExpression()), !dbg !237
  store i32 %0, i32* %3, align 4, !tbaa !238
  call void @llvm.dbg.value(metadata %struct.__sFILE* %1, metadata !236, metadata !DIExpression()), !dbg !237
  %4 = bitcast i32* %3 to i8*, !dbg !242
  %5 = call i64 @fwrite(i8* nonnull %4, i64 4, i64 1, %struct.__sFILE* %1) #3, !dbg !244
  %6 = icmp ne i64 %5, 1, !dbg !245
  %7 = sext i1 %6 to i32, !dbg !246
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !247
  ret i32 %7, !dbg !247
}

; Function Attrs: noredzone
declare dso_local i64 @fwrite(i8*, i64, i64, %struct.__sFILE*) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.value(metadata, metadata, metadata) #2

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!7, !8, !9}
!llvm.ident = !{!10}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/putw.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!11 = distinct !DISubprogram(name: "putw", scope: !1, file: !1, line: 58, type: !12, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !234)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !14, !15}
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 66, baseType: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !19, line: 287, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !19, line: 181, size: 1408, elements: !21)
!21 = !{!22, !25, !26, !27, !29, !30, !35, !36, !38, !203, !207, !212, !216, !217, !218, !219, !221, !223, !224, !225, !227, !228, !232, !233}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !20, file: !19, line: 182, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !20, file: !19, line: 183, baseType: !14, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !20, file: !19, line: 184, baseType: !14, size: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !19, line: 185, baseType: !28, size: 16, offset: 128)
!28 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !20, file: !19, line: 186, baseType: !28, size: 16, offset: 144)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !20, file: !19, line: 187, baseType: !31, size: 128, offset: 192)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !19, line: 117, size: 128, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !31, file: !19, line: 118, baseType: !23, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !31, file: !19, line: 119, baseType: !14, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !20, file: !19, line: 188, baseType: !14, size: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !20, file: !19, line: 195, baseType: !37, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !20, file: !19, line: 197, baseType: !39, size: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !45, !37, !88, !14}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !43, line: 145, baseType: !44)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !19, line: 569, size: 14912, elements: !47)
!47 = !{!48, !49, !51, !52, !53, !54, !58, !59, !62, !63, !67, !82, !83, !84, !86, !87, !89, !167, !188, !189, !194, !201}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !46, file: !19, line: 571, baseType: !14, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !46, file: !19, line: 576, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !46, file: !19, line: 576, baseType: !50, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !46, file: !19, line: 576, baseType: !50, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !46, file: !19, line: 578, baseType: !14, size: 32, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !46, file: !19, line: 579, baseType: !55, size: 200, offset: 288)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 200, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 25)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !46, file: !19, line: 582, baseType: !14, size: 32, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !46, file: !19, line: 583, baseType: !60, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !19, line: 40, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !46, file: !19, line: 585, baseType: !14, size: 32, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !46, file: !19, line: 587, baseType: !64, size: 64, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !45}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !46, file: !19, line: 590, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !19, line: 47, size: 256, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !69, file: !19, line: 49, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !69, file: !19, line: 50, baseType: !14, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !69, file: !19, line: 50, baseType: !14, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !69, file: !19, line: 50, baseType: !14, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !69, file: !19, line: 50, baseType: !14, size: 32, offset: 160)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !69, file: !19, line: 51, baseType: !77, size: 32, offset: 192)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 32, elements: !80)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !19, line: 25, baseType: !79)
!79 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !46, file: !19, line: 591, baseType: !14, size: 32, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !46, file: !19, line: 592, baseType: !68, size: 64, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !46, file: !19, line: 593, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !46, file: !19, line: 596, baseType: !14, size: 32, offset: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !46, file: !19, line: 597, baseType: !88, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !46, file: !19, line: 632, baseType: !90, size: 2880, offset: 1152)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !46, file: !19, line: 599, size: 2880, elements: !91)
!91 = !{!92, !158}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !90, file: !19, line: 622, baseType: !93, size: 1728)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !19, line: 601, size: 1728, elements: !94)
!94 = !{!95, !96, !97, !101, !113, !114, !116, !126, !141, !142, !143, !147, !151, !152, !153, !154, !155, !156, !157}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !93, file: !19, line: 603, baseType: !79, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !93, file: !19, line: 604, baseType: !88, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !93, file: !19, line: 605, baseType: !98, size: 208, offset: 128)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 208, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 26)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !93, file: !19, line: 606, baseType: !102, size: 288, offset: 352)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !19, line: 55, size: 288, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !102, file: !19, line: 57, baseType: !14, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !102, file: !19, line: 58, baseType: !14, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !102, file: !19, line: 59, baseType: !14, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !102, file: !19, line: 60, baseType: !14, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !102, file: !19, line: 61, baseType: !14, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !102, file: !19, line: 62, baseType: !14, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !102, file: !19, line: 63, baseType: !14, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !102, file: !19, line: 64, baseType: !14, size: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !102, file: !19, line: 65, baseType: !14, size: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !93, file: !19, line: 607, baseType: !14, size: 32, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !93, file: !19, line: 608, baseType: !115, size: 64, offset: 704)
!115 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !93, file: !19, line: 609, baseType: !117, size: 112, offset: 768)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !19, line: 319, size: 112, elements: !118)
!118 = !{!119, !124, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !117, file: !19, line: 320, baseType: !120, size: 48)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 48, elements: !122)
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !{!123}
!123 = !DISubrange(count: 3)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !117, file: !19, line: 321, baseType: !120, size: 48, offset: 48)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !117, file: !19, line: 322, baseType: !121, size: 16, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !93, file: !19, line: 610, baseType: !127, size: 64, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !43, line: 171, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 163, size: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !128, file: !43, line: 165, baseType: !14, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !128, file: !43, line: 170, baseType: !132, size: 32, offset: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !43, line: 166, size: 32, elements: !133)
!133 = !{!134, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !132, file: !43, line: 168, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !136, line: 124, baseType: !79)
!136 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !132, file: !43, line: 169, baseType: !138, size: 32)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 4)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !93, file: !19, line: 611, baseType: !127, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !93, file: !19, line: 612, baseType: !127, size: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !93, file: !19, line: 613, baseType: !144, size: 64, offset: 1088)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !93, file: !19, line: 614, baseType: !148, size: 192, offset: 1152)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 24)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !93, file: !19, line: 615, baseType: !14, size: 32, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !93, file: !19, line: 616, baseType: !127, size: 64, offset: 1376)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !93, file: !19, line: 617, baseType: !127, size: 64, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !93, file: !19, line: 618, baseType: !127, size: 64, offset: 1504)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !93, file: !19, line: 619, baseType: !127, size: 64, offset: 1568)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !93, file: !19, line: 620, baseType: !127, size: 64, offset: 1632)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !93, file: !19, line: 621, baseType: !14, size: 32, offset: 1696)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !90, file: !19, line: 631, baseType: !159, size: 2880)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !19, line: 626, size: 2880, elements: !160)
!160 = !{!161, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !159, file: !19, line: 629, baseType: !162, size: 1920)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1920, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 30)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !159, file: !19, line: 630, baseType: !166, size: 960, offset: 1920)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 960, elements: !163)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !46, file: !19, line: 636, baseType: !168, size: 64, offset: 4032)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !19, line: 93, size: 6336, elements: !170)
!170 = !{!171, !172, !173, !180}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !169, file: !19, line: 94, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !169, file: !19, line: 95, baseType: !14, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !169, file: !19, line: 97, baseType: !174, size: 2048, offset: 128)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 2048, elements: !178)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null}
!178 = !{!179}
!179 = !DISubrange(count: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !169, file: !19, line: 98, baseType: !181, size: 4160, offset: 2176)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !19, line: 74, size: 4160, elements: !182)
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !181, file: !19, line: 75, baseType: !184, size: 2048)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !178)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !181, file: !19, line: 76, baseType: !184, size: 2048, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !181, file: !19, line: 78, baseType: !78, size: 32, offset: 4096)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !181, file: !19, line: 81, baseType: !78, size: 32, offset: 4128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !46, file: !19, line: 637, baseType: !169, size: 6336, offset: 4096)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !46, file: !19, line: 641, baseType: !190, size: 64, offset: 10432)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !14}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !46, file: !19, line: 646, baseType: !195, size: 192, offset: 10496)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !19, line: 291, size: 192, elements: !196)
!196 = !{!197, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !195, file: !19, line: 293, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !195, file: !19, line: 294, baseType: !14, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !195, file: !19, line: 295, baseType: !50, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !46, file: !19, line: 648, baseType: !202, size: 4224, offset: 10688)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 4224, elements: !122)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !20, file: !19, line: 199, baseType: !204, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!42, !45, !37, !4, !14}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !20, file: !19, line: 202, baseType: !208, size: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !45, !37, !211, !14}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !43, line: 114, baseType: !44)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !20, file: !19, line: 203, baseType: !213, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!14, !45, !37}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !20, file: !19, line: 206, baseType: !31, size: 128, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !20, file: !19, line: 207, baseType: !23, size: 64, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !20, file: !19, line: 208, baseType: !14, size: 32, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !20, file: !19, line: 211, baseType: !220, size: 24, offset: 928)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, elements: !122)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !20, file: !19, line: 212, baseType: !222, size: 8, offset: 952)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !20, file: !19, line: 215, baseType: !31, size: 128, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !20, file: !19, line: 218, baseType: !14, size: 32, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !19, line: 219, baseType: !226, size: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !43, line: 44, baseType: !44)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !20, file: !19, line: 222, baseType: !45, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !19, line: 226, baseType: !229, size: 32, offset: 1280)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !43, line: 175, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !231, line: 12, baseType: !14)
!231 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !20, file: !19, line: 228, baseType: !127, size: 64, offset: 1312)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !19, line: 229, baseType: !14, size: 32, offset: 1376)
!234 = !{!235, !236}
!235 = !DILocalVariable(name: "w", arg: 1, scope: !11, file: !1, line: 58, type: !14)
!236 = !DILocalVariable(name: "fp", arg: 2, scope: !11, file: !1, line: 58, type: !15)
!237 = !DILocation(line: 58, column: 1, scope: !11)
!238 = !{!239, !239, i64 0}
!239 = !{!"int", !240, i64 0}
!240 = !{!"omnipotent char", !241, i64 0}
!241 = !{!"Simple C/C++ TBAA"}
!242 = !DILocation(line: 62, column: 15, scope: !243)
!243 = distinct !DILexicalBlock(scope: !11, file: !1, line: 62, column: 7)
!244 = !DILocation(line: 62, column: 7, scope: !243)
!245 = !DILocation(line: 62, column: 52, scope: !243)
!246 = !DILocation(line: 64, column: 3, scope: !11)
!247 = !DILocation(line: 65, column: 1, scope: !11)
