; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/regcomp.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/regcomp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cclass = type { i8*, i32 }
%struct.cname = type { i8*, i8 }
%struct.regex_t = type { i32, i64, i8*, %struct.re_guts* }
%struct.re_guts = type { i32, i64*, i32, i32, %struct.cset*, i8*, i32, i64, i64, i64, i32, i32, i32, i32, i8*, i8*, i32, i32*, i32*, i32, i64, i32, i64, [1 x i8] }
%struct.cset = type { i8*, i8, i16, i64, i8* }
%struct.parse = type { i8*, i8*, i32, i64*, i64, i64, i32, %struct.re_guts*, [10 x i64], [10 x i64] }

@.str = private unnamed_addr constant [7 x i8] c"[:<:]]\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"[:>:]]\00", align 1
@__collate_load_error = external dso_local local_unnamed_addr global i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cclasses", scope: !2, file: !6, line: 49, type: !99, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !83)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/regcomp.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 42, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/cclass.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "CALNUM", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CALPHA", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CBLANK", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CCNTRL", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "CDIGIT", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "CGRAPH", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "CLOWER", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "CPRINT", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "CPUNCT", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "CSPACE", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "CUPPER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "CXDIGIT", value: 11, isUnsigned: true)
!21 = !{!22, !24, !82, !50, !31, !32, !7, !29, !43, !37, !42, !23, !72, !45}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_guts", file: !26, line: 143, size: 1344, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/regex2.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !30, !34, !35, !36, !55, !56, !57, !60, !61, !62, !63, !64, !65, !66, !69, !70, !71, !73, !74, !75, !76, !77, !78}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !25, file: !26, line: 144, baseType: !29, size: 32)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !25, file: !26, line: 146, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "sop", file: !26, line: 79, baseType: !33)
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "csetsize", scope: !25, file: !26, line: 147, baseType: !29, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ncsets", scope: !25, file: !26, line: 148, baseType: !29, size: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sets", scope: !25, file: !26, line: 149, baseType: !37, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "cset", file: !26, line: 128, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 122, size: 256, elements: !40)
!40 = !{!41, !46, !47, !49, !54}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !39, file: !26, line: 123, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !44, line: 45, baseType: !45)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/utils.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !39, file: !26, line: 124, baseType: !43, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !39, file: !26, line: 125, baseType: !48, size: 16, offset: 80)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "smultis", scope: !39, file: !26, line: 126, baseType: !50, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 40, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !53, line: 129, baseType: !33)
!53 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "multis", scope: !39, file: !26, line: 127, baseType: !22, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "setbits", scope: !25, file: !26, line: 150, baseType: !42, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cflags", scope: !25, file: !26, line: 151, baseType: !29, size: 32, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nstates", scope: !25, file: !26, line: 152, baseType: !58, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "sopno", file: !26, line: 80, baseType: !59)
!59 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "firststate", scope: !25, file: !26, line: 153, baseType: !58, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "laststate", scope: !25, file: !26, line: 154, baseType: !58, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !25, file: !26, line: 155, baseType: !29, size: 32, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nbol", scope: !25, file: !26, line: 159, baseType: !29, size: 32, offset: 608)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "neol", scope: !25, file: !26, line: 160, baseType: !29, size: 32, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ncategories", scope: !25, file: !26, line: 161, baseType: !29, size: 32, offset: 672)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !25, file: !26, line: 162, baseType: !67, size: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "cat_t", file: !26, line: 138, baseType: !45)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "must", scope: !25, file: !26, line: 163, baseType: !22, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "moffset", scope: !25, file: !26, line: 164, baseType: !29, size: 32, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "charjump", scope: !25, file: !26, line: 165, baseType: !72, size: 64, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "matchjump", scope: !25, file: !26, line: 166, baseType: !72, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mlen", scope: !25, file: !26, line: 167, baseType: !29, size: 32, offset: 1024)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "nsub", scope: !25, file: !26, line: 168, baseType: !50, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "backrefs", scope: !25, file: !26, line: 169, baseType: !29, size: 32, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nplus", scope: !25, file: !26, line: 170, baseType: !58, size: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "catspace", scope: !25, file: !26, line: 172, baseType: !79, size: 8, offset: 1280)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !{!0, !84, !94}
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "cnames", scope: !2, file: !86, line: 45, type: !87, isLocal: true, isDefinition: true)
!86 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/posix/cname.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 12288, elements: !92)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cname", file: !86, line: 42, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !86, line: 43, baseType: !22, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !88, file: !86, line: 44, baseType: !23, size: 8, offset: 64)
!92 = !{!93}
!93 = !DISubrange(count: 96)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "nuls", scope: !2, file: !3, line: 134, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 80, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 10)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1664, elements: !105)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cclass", file: !6, line: 46, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !6, line: 47, baseType: !22, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "fidx", scope: !100, file: !6, line: 48, baseType: !104, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "citype", file: !6, line: 43, baseType: !5)
!105 = !{!106}
!106 = !DISubrange(count: 13)
!107 = !{i32 2, !"Dwarf Version", i32 4}
!108 = !{i32 2, !"Debug Info Version", i32 3}
!109 = !{i32 1, !"wchar_size", i32 4}
!110 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!111 = distinct !DISubprogram(name: "regcomp", scope: !3, file: !3, line: 188, type: !112, isLocal: false, isDefinition: true, scopeLine: 192, isOptimized: true, unit: !2, retainedNodes: !127)
!112 = !DISubroutineType(types: !113)
!113 = !{!29, !114, !126, !29}
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !117, line: 50, baseType: !118)
!117 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/regex.h", directory: "/root/.unikraft/apps/redis/build")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 45, size: 256, elements: !119)
!119 = !{!120, !121, !122, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "re_magic", scope: !118, file: !117, line: 46, baseType: !29, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !118, file: !117, line: 47, baseType: !50, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "re_endp", scope: !118, file: !117, line: 48, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "re_g", scope: !118, file: !117, line: 49, baseType: !24, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !123)
!127 = !{!128, !129, !130, !131, !145, !146, !148, !149}
!128 = !DILocalVariable(name: "preg", arg: 1, scope: !111, file: !3, line: 189, type: !114)
!129 = !DILocalVariable(name: "pattern", arg: 2, scope: !111, file: !3, line: 190, type: !126)
!130 = !DILocalVariable(name: "cflags", arg: 3, scope: !111, file: !3, line: 191, type: !29)
!131 = !DILocalVariable(name: "pa", scope: !111, file: !3, line: 193, type: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !3, line: 63, size: 1792, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !144}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !3, line: 64, baseType: !22, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !132, file: !3, line: 65, baseType: !22, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !132, file: !3, line: 66, baseType: !29, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !132, file: !3, line: 67, baseType: !31, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ssize", scope: !132, file: !3, line: 68, baseType: !58, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !132, file: !3, line: 69, baseType: !58, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ncsalloc", scope: !132, file: !3, line: 70, baseType: !29, size: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !132, file: !3, line: 71, baseType: !24, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pbegin", scope: !132, file: !3, line: 73, baseType: !143, size: 640, offset: 512)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 640, elements: !97)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !132, file: !3, line: 74, baseType: !143, size: 640, offset: 1152)
!145 = !DILocalVariable(name: "g", scope: !111, file: !3, line: 194, type: !24)
!146 = !DILocalVariable(name: "p", scope: !111, file: !3, line: 195, type: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!148 = !DILocalVariable(name: "i", scope: !111, file: !3, line: 196, type: !29)
!149 = !DILocalVariable(name: "len", scope: !111, file: !3, line: 197, type: !50)
!150 = !DILocation(line: 189, column: 21, scope: !111)
!151 = !DILocation(line: 190, column: 24, scope: !111)
!152 = !DILocation(line: 191, column: 5, scope: !111)
!153 = !DILocation(line: 193, column: 2, scope: !111)
!154 = !DILocation(line: 195, column: 16, scope: !111)
!155 = !DILocation(line: 204, column: 11, scope: !111)
!156 = !DILocation(line: 205, column: 13, scope: !157)
!157 = distinct !DILexicalBlock(scope: !111, file: !3, line: 205, column: 6)
!158 = !DILocation(line: 205, column: 28, scope: !157)
!159 = !DILocation(line: 205, column: 38, scope: !157)
!160 = !DILocation(line: 208, column: 12, scope: !161)
!161 = distinct !DILexicalBlock(scope: !111, file: !3, line: 208, column: 6)
!162 = !DILocation(line: 208, column: 6, scope: !111)
!163 = !DILocation(line: 209, column: 13, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !3, line: 209, column: 7)
!165 = distinct !DILexicalBlock(scope: !161, file: !3, line: 208, column: 23)
!166 = !{!167, !172, i64 16}
!167 = !{!"", !168, i64 0, !171, i64 8, !172, i64 16, !172, i64 24}
!168 = !{!"int", !169, i64 0}
!169 = !{!"omnipotent char", !170, i64 0}
!170 = !{!"Simple C/C++ TBAA"}
!171 = !{!"long", !169, i64 0}
!172 = !{!"any pointer", !169, i64 0}
!173 = !DILocation(line: 209, column: 21, scope: !164)
!174 = !DILocation(line: 209, column: 7, scope: !165)
!175 = !DILocation(line: 211, column: 23, scope: !165)
!176 = !DILocation(line: 197, column: 9, scope: !111)
!177 = !DILocation(line: 212, column: 2, scope: !165)
!178 = !DILocation(line: 213, column: 9, scope: !161)
!179 = !DILocation(line: 0, scope: !161)
!180 = !DILocation(line: 216, column: 24, scope: !111)
!181 = !DILocation(line: 194, column: 18, scope: !111)
!182 = !DILocation(line: 218, column: 8, scope: !183)
!183 = distinct !DILexicalBlock(scope: !111, file: !3, line: 218, column: 6)
!184 = !DILocation(line: 218, column: 6, scope: !111)
!185 = !DILocation(line: 220, column: 16, scope: !111)
!186 = !DILocation(line: 220, column: 26, scope: !111)
!187 = !DILocation(line: 220, column: 37, scope: !111)
!188 = !DILocation(line: 220, column: 5, scope: !111)
!189 = !DILocation(line: 220, column: 11, scope: !111)
!190 = !{!191, !171, i64 32}
!191 = !{!"parse", !172, i64 0, !172, i64 8, !168, i64 16, !172, i64 24, !171, i64 32, !171, i64 40, !168, i64 48, !172, i64 56, !169, i64 64, !169, i64 144}
!192 = !DILocation(line: 221, column: 36, scope: !111)
!193 = !DILocation(line: 221, column: 20, scope: !111)
!194 = !DILocation(line: 221, column: 5, scope: !111)
!195 = !DILocation(line: 221, column: 11, scope: !111)
!196 = !{!191, !172, i64 24}
!197 = !DILocation(line: 222, column: 5, scope: !111)
!198 = !DILocation(line: 222, column: 10, scope: !111)
!199 = !{!191, !171, i64 40}
!200 = !DILocation(line: 223, column: 15, scope: !201)
!201 = distinct !DILexicalBlock(scope: !111, file: !3, line: 223, column: 6)
!202 = !DILocation(line: 223, column: 6, scope: !111)
!203 = !DILocation(line: 224, column: 3, scope: !204)
!204 = distinct !DILexicalBlock(scope: !201, file: !3, line: 223, column: 24)
!205 = !DILocation(line: 225, column: 3, scope: !204)
!206 = !DILocation(line: 229, column: 5, scope: !111)
!207 = !DILocation(line: 229, column: 7, scope: !111)
!208 = !{!191, !172, i64 56}
!209 = !DILocation(line: 230, column: 5, scope: !111)
!210 = !DILocation(line: 230, column: 10, scope: !111)
!211 = !{!191, !172, i64 0}
!212 = !DILocation(line: 231, column: 19, scope: !111)
!213 = !DILocation(line: 231, column: 5, scope: !111)
