; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { {}*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, {}*, {}*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [11 x i8] c"SDS_NOINIT\00", align 1
@SDS_NOINIT = dso_local local_unnamed_addr global i8* getelementptr inbounds ([11 x i8], [11 x i8]* @.str, i64 0, i64 0), align 8, !dbg !0
@.str.2 = private unnamed_addr constant [71 x i8] c"/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.c\00", align 1
@__func__.sdsIncrLen = private unnamed_addr constant [11 x i8] c"sdsIncrLen\00", align 1
@.str.3 = private unnamed_addr constant [80 x i8] c"(incr > 0 && oldlen+incr < 32) || (incr < 0 && oldlen >= (unsigned int)(-incr))\00", align 1
@.str.4 = private unnamed_addr constant [91 x i8] c"(incr >= 0 && sh->alloc-sh->len >= incr) || (incr < 0 && sh->len >= (unsigned int)(-incr))\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "SDS_NOINIT", scope: !2, file: !3, line: 42, type: !76, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !69)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !6, line: 68, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!13 = !{!14, !15, !17, !7, !19, !24, !29, !18, !30, !43, !53, !62}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !20, line: 60, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !22, line: 105, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 200, baseType: !26)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !27, line: 145, baseType: !28)
!27 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !32, line: 51, size: 24, elements: !33)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !{!34, !37, !38, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, file: !32, line: 52, baseType: !35, size: 8)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !20, line: 24, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !22, line: 43, baseType: !18)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !31, file: !32, line: 53, baseType: !35, size: 8, offset: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !31, file: !32, line: 54, baseType: !18, size: 8, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !31, file: !32, line: 55, baseType: !40, offset: 24)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: -1)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !32, line: 57, size: 40, elements: !45)
!45 = !{!46, !50, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !44, file: !32, line: 58, baseType: !47, size: 16)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 36, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !22, line: 57, baseType: !49)
!49 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !44, file: !32, line: 59, baseType: !47, size: 16, offset: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !32, line: 60, baseType: !18, size: 8, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !44, file: !32, line: 61, baseType: !40, offset: 40)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !32, line: 63, size: 72, elements: !55)
!55 = !{!56, !59, !60, !61}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !32, line: 64, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 48, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 79, baseType: !7)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !54, file: !32, line: 65, baseType: !57, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !32, line: 66, baseType: !18, size: 8, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !54, file: !32, line: 67, baseType: !40, offset: 72)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !32, line: 69, size: 136, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !32, line: 70, baseType: !19, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !63, file: !32, line: 71, baseType: !19, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !32, line: 72, baseType: !18, size: 8, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !63, file: !32, line: 73, baseType: !40, offset: 136)
!69 = !{!0, !70, !98}
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "__str", scope: !72, file: !73, line: 198, type: !95, isLocal: true, isDefinition: true)
!72 = distinct !DISubprogram(name: "uk_pr_crit", scope: !73, file: !73, line: 194, type: !74, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !78)
!73 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76, null}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!78 = !{!79, !80}
!79 = !DILocalVariable(name: "fmt", arg: 1, scope: !72, file: !73, line: 194, type: !76)
!80 = !DILocalVariable(name: "argp", scope: !72, file: !73, line: 196, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !82, line: 46, baseType: !83)
!82 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !84, line: 51, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 523, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 192, elements: !93)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 519, size: 192, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !87, file: !3, line: 519, baseType: !7, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !87, file: !3, line: 519, baseType: !7, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !87, file: !3, line: 519, baseType: !14, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !87, file: !3, line: 519, baseType: !14, size: 64, offset: 128)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 136, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 17)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "__str", scope: !72, file: !73, line: 198, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 48, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 6)
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{i32 1, !"wchar_size", i32 4}
!106 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!107 = distinct !DISubprogram(name: "sdsnewlen", scope: !3, file: !3, line: 89, type: !108, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !116)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !111, !113}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !32, line: 43, baseType: !15)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 40, baseType: !115)
!114 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !27, line: 129, baseType: !23)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !127, !129, !131}
!117 = !DILocalVariable(name: "init", arg: 1, scope: !107, file: !3, line: 89, type: !111)
!118 = !DILocalVariable(name: "initlen", arg: 2, scope: !107, file: !3, line: 89, type: !113)
!119 = !DILocalVariable(name: "sh", scope: !107, file: !3, line: 90, type: !14)
!120 = !DILocalVariable(name: "s", scope: !107, file: !3, line: 91, type: !110)
!121 = !DILocalVariable(name: "type", scope: !107, file: !3, line: 92, type: !16)
!122 = !DILocalVariable(name: "hdrlen", scope: !107, file: !3, line: 96, type: !29)
!123 = !DILocalVariable(name: "fp", scope: !107, file: !3, line: 97, type: !17)
!124 = !DILocalVariable(name: "sh", scope: !125, file: !3, line: 113, type: !30)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 112, column: 26)
!126 = distinct !DILexicalBlock(scope: !107, file: !3, line: 107, column: 18)
!127 = !DILocalVariable(name: "sh", scope: !128, file: !3, line: 120, type: !43)
!128 = distinct !DILexicalBlock(scope: !126, file: !3, line: 119, column: 27)
!129 = !DILocalVariable(name: "sh", scope: !130, file: !3, line: 127, type: !53)
!130 = distinct !DILexicalBlock(scope: !126, file: !3, line: 126, column: 27)
!131 = !DILocalVariable(name: "sh", scope: !132, file: !3, line: 134, type: !62)
!132 = distinct !DILexicalBlock(scope: !126, file: !3, line: 133, column: 27)
!133 = !DILocation(line: 89, column: 27, scope: !107)
!134 = !DILocation(line: 89, column: 40, scope: !107)
!135 = !DILocalVariable(name: "string_size", arg: 1, scope: !136, file: !3, line: 60, type: !113)
!136 = distinct !DISubprogram(name: "sdsReqType", scope: !3, file: !3, line: 60, type: !137, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{!16, !113}
!139 = !{!135}
!140 = !DILocation(line: 60, column: 38, scope: !136, inlinedAt: !141)
!141 = distinct !DILocation(line: 92, column: 17, scope: !107)
!142 = !DILocation(line: 61, column: 21, scope: !143, inlinedAt: !141)
!143 = distinct !DILexicalBlock(scope: !136, file: !3, line: 61, column: 9)
!144 = !DILocation(line: 61, column: 9, scope: !136, inlinedAt: !141)
!145 = !DILocation(line: 63, column: 21, scope: !146, inlinedAt: !141)
!146 = distinct !DILexicalBlock(scope: !136, file: !3, line: 63, column: 9)
!147 = !DILocation(line: 63, column: 9, scope: !136, inlinedAt: !141)
!148 = !DILocation(line: 65, column: 21, scope: !149, inlinedAt: !141)
!149 = distinct !DILexicalBlock(scope: !136, file: !3, line: 65, column: 9)
!150 = !DILocation(line: 65, column: 9, scope: !136, inlinedAt: !141)
!151 = !DILocation(line: 68, column: 21, scope: !152, inlinedAt: !141)
!152 = distinct !DILexicalBlock(scope: !136, file: !3, line: 68, column: 9)
!153 = !DILocation(line: 69, column: 9, scope: !152, inlinedAt: !141)
!154 = !DILocation(line: 0, scope: !136, inlinedAt: !141)
!155 = !DILocation(line: 74, column: 1, scope: !136, inlinedAt: !141)
!156 = !DILocation(line: 92, column: 10, scope: !107)
!157 = !DILocation(line: 95, column: 14, scope: !158)
!158 = distinct !DILexicalBlock(scope: !107, file: !3, line: 95, column: 9)
!159 = !DILocation(line: 95, column: 39, scope: !158)
!160 = !DILocation(line: 95, column: 28, scope: !158)
!161 = !DILocalVariable(name: "type", arg: 1, scope: !162, file: !3, line: 44, type: !16)
!162 = distinct !DISubprogram(name: "sdsHdrSize", scope: !3, file: !3, line: 44, type: !163, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{!29, !16}
!165 = !{!161}
!166 = !DILocation(line: 44, column: 35, scope: !162, inlinedAt: !167)
!167 = distinct !DILocation(line: 96, column: 18, scope: !107)
!168 = !DILocation(line: 45, column: 5, scope: !162, inlinedAt: !167)
!169 = !DILocation(line: 58, column: 1, scope: !162, inlinedAt: !167)
!170 = !DILocation(line: 99, column: 25, scope: !107)
!171 = !DILocation(line: 99, column: 33, scope: !107)
!172 = !DILocalVariable(name: "size", arg: 1, scope: !173, file: !174, line: 52, type: !113)
!173 = distinct !DISubprogram(name: "s_malloc", scope: !174, file: !174, line: 52, type: !175, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !177)
!174 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sdsalloc.h", directory: "/root/.unikraft/apps/redis/build")
!175 = !DISubroutineType(types: !176)
!176 = !{!14, !113}
!177 = !{!172}
!178 = !DILocation(line: 52, column: 37, scope: !173, inlinedAt: !179)
!179 = distinct !DILocation(line: 99, column: 10, scope: !107)
!180 = !DILocation(line: 53, column: 19, scope: !173, inlinedAt: !179)
!181 = !{!182, !182, i64 0}
!182 = !{!"any pointer", !183, i64 0}
!183 = !{!"omnipotent char", !184, i64 0}
!184 = !{!"Simple C/C++ TBAA"}
!185 = !DILocalVariable(name: "a", arg: 1, scope: !186, file: !187, line: 157, type: !190)
!186 = distinct !DISubprogram(name: "uk_malloc", scope: !187, file: !187, line: 157, type: !188, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !243)
!187 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!188 = !DISubroutineType(types: !189)
!189 = !{!14, !190, !113}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !187, line: 77, size: 832, elements: !192)
!192 = !{!193, !196, !201, !206, !212, !214, !219, !220, !221, !226, !231, !236, !237, !238}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !191, file: !187, line: 79, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !187, line: 54, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !191, file: !187, line: 80, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !187, line: 56, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!14, !190, !113, !113}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !191, file: !187, line: 81, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !187, line: 62, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!14, !190, !14, !113}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !191, file: !187, line: 82, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !187, line: 58, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !190, !211, !113, !113}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !191, file: !187, line: 83, baseType: !213, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !187, line: 60, baseType: !198)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !191, file: !187, line: 84, baseType: !215, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !187, line: 64, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !190, !14}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !191, file: !187, line: 87, baseType: !215, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !191, file: !187, line: 88, baseType: !194, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !191, file: !187, line: 92, baseType: !222, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !187, line: 66, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!14, !190, !23}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !191, file: !187, line: 93, baseType: !227, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !187, line: 68, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !190, !14, !23}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !191, file: !187, line: 99, baseType: !232, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !187, line: 70, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!29, !190, !14, !113}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !187, line: 100, baseType: !113, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !187, line: 103, baseType: !190, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !191, file: !187, line: 104, baseType: !239, offset: 832)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, elements: !41)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !20, line: 20, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !22, line: 41, baseType: !242)
!242 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!243 = !{!185, !244}
!244 = !DILocalVariable(name: "size", arg: 2, scope: !186, file: !187, line: 157, type: !113)
!245 = !DILocation(line: 157, column: 48, scope: !186, inlinedAt: !246)
!246 = distinct !DILocation(line: 53, column: 9, scope: !173, inlinedAt: !179)
!247 = !DILocation(line: 157, column: 58, scope: !186, inlinedAt: !246)
!248 = !DILocation(line: 159, column: 6, scope: !249, inlinedAt: !246)
!249 = distinct !DILexicalBlock(scope: !186, file: !187, line: 159, column: 6)
!250 = !DILocation(line: 159, column: 6, scope: !186, inlinedAt: !246)
!251 = !{!"branch_weights", i32 1, i32 2000}
!252 = !DILocation(line: 160, column: 3, scope: !253, inlinedAt: !246)
!253 = distinct !DILexicalBlock(scope: !249, file: !187, line: 159, column: 20)
!254 = !DILocation(line: 160, column: 9, scope: !253, inlinedAt: !246)
!255 = !{!256, !256, i64 0}
!256 = !{!"int", !183, i64 0}
!257 = !DILocation(line: 161, column: 3, scope: !253, inlinedAt: !246)
!258 = !DILocalVariable(name: "a", arg: 1, scope: !259, file: !187, line: 151, type: !190)
!259 = distinct !DISubprogram(name: "uk_do_malloc", scope: !187, file: !187, line: 151, type: !188, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !260)
!260 = !{!258, !261}
!261 = !DILocalVariable(name: "size", arg: 2, scope: !259, file: !187, line: 151, type: !113)
!262 = !DILocation(line: 151, column: 51, scope: !259, inlinedAt: !263)
!263 = distinct !DILocation(line: 163, column: 9, scope: !186, inlinedAt: !246)
!264 = !DILocation(line: 151, column: 61, scope: !259, inlinedAt: !263)
!265 = !DILocation(line: 154, column: 12, scope: !259, inlinedAt: !263)
!266 = !DILocation(line: 154, column: 9, scope: !259, inlinedAt: !263)
!267 = !DILocation(line: 154, column: 2, scope: !259, inlinedAt: !263)
!268 = !DILocation(line: 163, column: 2, scope: !186, inlinedAt: !246)
!269 = !DILocation(line: 0, scope: !186, inlinedAt: !246)
!270 = !DILocation(line: 164, column: 1, scope: !186, inlinedAt: !246)
!271 = !DILocation(line: 53, column: 2, scope: !173, inlinedAt: !179)
!272 = !DILocation(line: 90, column: 11, scope: !107)
!273 = !DILocation(line: 100, column: 15, scope: !274)
!274 = distinct !DILexicalBlock(scope: !107, file: !3, line: 100, column: 9)
!275 = !DILocation(line: 100, column: 13, scope: !274)
!276 = !DILocation(line: 100, column: 9, scope: !107)
!277 = !DILocation(line: 102, column: 15, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !3, line: 102, column: 14)
!279 = !DILocation(line: 102, column: 14, scope: !274)
!280 = !DILocation(line: 103, column: 9, scope: !278)
!281 = !DILocation(line: 104, column: 12, scope: !282)
!282 = distinct !DILexicalBlock(scope: !107, file: !3, line: 104, column: 9)
!283 = !DILocation(line: 104, column: 9, scope: !107)
!284 = !DILocation(line: 105, column: 18, scope: !107)
!285 = !DILocation(line: 91, column: 9, scope: !107)
!286 = !DILocation(line: 106, column: 29, scope: !107)
!287 = !DILocation(line: 97, column: 20, scope: !107)
!288 = !DILocation(line: 107, column: 5, scope: !107)
!289 = !DILocation(line: 109, column: 19, scope: !290)
!290 = distinct !DILexicalBlock(scope: !126, file: !3, line: 108, column: 26)
!291 = !DILocation(line: 110, column: 13, scope: !290)
!292 = !DILocation(line: 113, column: 13, scope: !125)
!293 = !DILocation(line: 114, column: 23, scope: !125)
!294 = !DILocation(line: 114, column: 21, scope: !125)
!295 = !{!183, !183, i64 0}
!296 = !DILocation(line: 115, column: 17, scope: !125)
