; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/setlinebuf.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/setlinebuf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @setlinebuf(%struct.__sFILE*) local_unnamed_addr #0 !dbg !14 {
  %2 = tail call i32 @setvbuf(%struct.__sFILE* %0, i8* null, i32 1, i64 0) #3, !dbg !239
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !240
  ret i32 %2, !dbg !240
}

; Function Attrs: noredzone
declare dso_local i32 @setvbuf(%struct.__sFILE*, i8*, i32, i64) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.module.flags = !{!10, !11, !12}
!llvm.ident = !{!13}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/setlinebuf.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !6, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 58, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{i32 1, !"wchar_size", i32 4}
!13 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!14 = distinct !DISubprogram(name: "setlinebuf", scope: !1, file: !1, line: 64, type: !15, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !236)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 66, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !22, line: 287, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 181, size: 1408, elements: !24)
!24 = !{!25, !28, !29, !30, !32, !33, !38, !39, !40, !203, !209, !214, !218, !219, !220, !221, !223, !225, !226, !227, !229, !230, !234, !235}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !23, file: !22, line: 182, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !23, file: !22, line: 183, baseType: !17, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !23, file: !22, line: 184, baseType: !17, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !23, file: !22, line: 185, baseType: !31, size: 16, offset: 128)
!31 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !23, file: !22, line: 186, baseType: !31, size: 16, offset: 144)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !23, file: !22, line: 187, baseType: !34, size: 128, offset: 192)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 117, size: 128, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !34, file: !22, line: 118, baseType: !26, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !34, file: !22, line: 119, baseType: !17, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !23, file: !22, line: 188, baseType: !17, size: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !23, file: !22, line: 195, baseType: !6, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !23, file: !22, line: 197, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !47, !6, !4, !17}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !45, line: 145, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !22, line: 569, size: 14912, elements: !49)
!49 = !{!50, !51, !53, !54, !55, !56, !60, !61, !64, !65, !69, !84, !85, !86, !88, !89, !90, !167, !188, !189, !194, !201}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !48, file: !22, line: 571, baseType: !17, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !48, file: !22, line: 576, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !48, file: !22, line: 576, baseType: !52, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !48, file: !22, line: 576, baseType: !52, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !48, file: !22, line: 578, baseType: !17, size: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !48, file: !22, line: 579, baseType: !57, size: 200, offset: 288)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 200, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 25)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !48, file: !22, line: 582, baseType: !17, size: 32, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !48, file: !22, line: 583, baseType: !62, size: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !22, line: 40, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !48, file: !22, line: 585, baseType: !17, size: 32, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !48, file: !22, line: 587, baseType: !66, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !47}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !48, file: !22, line: 590, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !22, line: 47, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !22, line: 49, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !71, file: !22, line: 50, baseType: !17, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !71, file: !22, line: 50, baseType: !17, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !71, file: !22, line: 50, baseType: !17, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !71, file: !22, line: 50, baseType: !17, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !71, file: !22, line: 51, baseType: !79, size: 32, offset: 192)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !82)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !22, line: 25, baseType: !81)
!81 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !48, file: !22, line: 591, baseType: !17, size: 32, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !48, file: !22, line: 592, baseType: !70, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !48, file: !22, line: 593, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !48, file: !22, line: 596, baseType: !17, size: 32, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !48, file: !22, line: 597, baseType: !4, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !48, file: !22, line: 632, baseType: !91, size: 2880, offset: 1152)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !48, file: !22, line: 599, size: 2880, elements: !92)
!92 = !{!93, !158}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !91, file: !22, line: 622, baseType: !94, size: 1728)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !91, file: !22, line: 601, size: 1728, elements: !95)
!95 = !{!96, !97, !98, !102, !114, !115, !117, !127, !141, !142, !143, !147, !151, !152, !153, !154, !155, !156, !157}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !94, file: !22, line: 603, baseType: !81, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !94, file: !22, line: 604, baseType: !4, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !94, file: !22, line: 605, baseType: !99, size: 208, offset: 128)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 208, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 26)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !94, file: !22, line: 606, baseType: !103, size: 288, offset: 352)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !22, line: 55, size: 288, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !103, file: !22, line: 57, baseType: !17, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !103, file: !22, line: 58, baseType: !17, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !103, file: !22, line: 59, baseType: !17, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !103, file: !22, line: 60, baseType: !17, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !103, file: !22, line: 61, baseType: !17, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !103, file: !22, line: 62, baseType: !17, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !103, file: !22, line: 63, baseType: !17, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !103, file: !22, line: 64, baseType: !17, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !103, file: !22, line: 65, baseType: !17, size: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !94, file: !22, line: 607, baseType: !17, size: 32, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !94, file: !22, line: 608, baseType: !116, size: 64, offset: 704)
!116 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !94, file: !22, line: 609, baseType: !118, size: 112, offset: 768)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !22, line: 319, size: 112, elements: !119)
!119 = !{!120, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !118, file: !22, line: 320, baseType: !121, size: 48)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 48, elements: !123)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !{!124}
!124 = !DISubrange(count: 3)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !118, file: !22, line: 321, baseType: !121, size: 48, offset: 48)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !118, file: !22, line: 322, baseType: !122, size: 16, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !94, file: !22, line: 610, baseType: !128, size: 64, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !45, line: 171, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 163, size: 64, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !129, file: !45, line: 165, baseType: !17, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !129, file: !45, line: 170, baseType: !133, size: 32, offset: 32)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !45, line: 166, size: 32, elements: !134)
!134 = !{!135, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !133, file: !45, line: 168, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !8, line: 124, baseType: !81)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !133, file: !45, line: 169, baseType: !138, size: 32)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 4)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !94, file: !22, line: 611, baseType: !128, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !94, file: !22, line: 612, baseType: !128, size: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !94, file: !22, line: 613, baseType: !144, size: 64, offset: 1088)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !94, file: !22, line: 614, baseType: !148, size: 192, offset: 1152)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 24)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !94, file: !22, line: 615, baseType: !17, size: 32, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !94, file: !22, line: 616, baseType: !128, size: 64, offset: 1376)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !94, file: !22, line: 617, baseType: !128, size: 64, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !94, file: !22, line: 618, baseType: !128, size: 64, offset: 1504)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !94, file: !22, line: 619, baseType: !128, size: 64, offset: 1568)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !94, file: !22, line: 620, baseType: !128, size: 64, offset: 1632)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !94, file: !22, line: 621, baseType: !17, size: 32, offset: 1696)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !91, file: !22, line: 631, baseType: !159, size: 2880)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !91, file: !22, line: 626, size: 2880, elements: !160)
!160 = !{!161, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !159, file: !22, line: 629, baseType: !162, size: 1920)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1920, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 30)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !159, file: !22, line: 630, baseType: !166, size: 960, offset: 1920)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 960, elements: !163)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !48, file: !22, line: 636, baseType: !168, size: 64, offset: 4032)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !22, line: 93, size: 6336, elements: !170)
!170 = !{!171, !172, !173, !180}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !169, file: !22, line: 94, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !169, file: !22, line: 95, baseType: !17, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !169, file: !22, line: 97, baseType: !174, size: 2048, offset: 128)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 2048, elements: !178)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null}
!178 = !{!179}
!179 = !DISubrange(count: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !169, file: !22, line: 98, baseType: !181, size: 4160, offset: 2176)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !22, line: 74, size: 4160, elements: !182)
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !181, file: !22, line: 75, baseType: !184, size: 2048)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2048, elements: !178)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !181, file: !22, line: 76, baseType: !184, size: 2048, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !181, file: !22, line: 78, baseType: !80, size: 32, offset: 4096)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !181, file: !22, line: 81, baseType: !80, size: 32, offset: 4128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !48, file: !22, line: 637, baseType: !169, size: 6336, offset: 4096)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !48, file: !22, line: 641, baseType: !190, size: 64, offset: 10432)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !17}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !48, file: !22, line: 646, baseType: !195, size: 192, offset: 10496)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !22, line: 291, size: 192, elements: !196)
!196 = !{!197, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !195, file: !22, line: 293, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !195, file: !22, line: 294, baseType: !17, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !195, file: !22, line: 295, baseType: !52, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !48, file: !22, line: 648, baseType: !202, size: 4224, offset: 10688)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 4224, elements: !123)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !23, file: !22, line: 199, baseType: !204, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!44, !47, !6, !207, !17}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !23, file: !22, line: 202, baseType: !210, size: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !47, !6, !213, !17}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !45, line: 114, baseType: !46)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !23, file: !22, line: 203, baseType: !215, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!17, !47, !6}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !23, file: !22, line: 206, baseType: !34, size: 128, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !23, file: !22, line: 207, baseType: !26, size: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !23, file: !22, line: 208, baseType: !17, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !23, file: !22, line: 211, baseType: !222, size: 24, offset: 928)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !123)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !23, file: !22, line: 212, baseType: !224, size: 8, offset: 952)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !82)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !23, file: !22, line: 215, baseType: !34, size: 128, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !23, file: !22, line: 218, baseType: !17, size: 32, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !23, file: !22, line: 219, baseType: !228, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !45, line: 44, baseType: !46)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !23, file: !22, line: 222, baseType: !47, size: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !23, file: !22, line: 226, baseType: !231, size: 32, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !45, line: 175, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !233, line: 12, baseType: !17)
!233 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !23, file: !22, line: 228, baseType: !128, size: 64, offset: 1312)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !23, file: !22, line: 229, baseType: !17, size: 32, offset: 1376)
!236 = !{!237}
!237 = !DILocalVariable(name: "fp", arg: 1, scope: !14, file: !1, line: 64, type: !18)
!238 = !DILocation(line: 64, column: 1, scope: !14)
!239 = !DILocation(line: 67, column: 11, scope: !14)
!240 = !DILocation(line: 67, column: 3, scope: !14)
