; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/strftime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/strftime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_time_T = type { [12 x i8*], [12 x i8*], [7 x i8*], [7 x i8*], i8*, i8*, i8*, [2 x i8*], i8*, [12 x i8*], i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/strftime.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!12 = distinct !DISubprogram(name: "strftime", scope: !1, file: !1, line: 1442, type: !13, isLocal: false, isDefinition: true, scopeLine: 1447, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !46)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !18, !21, !25, !28}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 58, baseType: !17)
!16 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 40, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !24, line: 129, baseType: !17)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!28 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !32, line: 31, size: 448, elements: !33)
!32 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !45}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !31, file: !32, line: 32, baseType: !4, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !31, file: !32, line: 33, baseType: !4, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !31, file: !32, line: 34, baseType: !4, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !31, file: !32, line: 35, baseType: !4, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !31, file: !32, line: 36, baseType: !4, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !31, file: !32, line: 37, baseType: !4, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !31, file: !32, line: 38, baseType: !4, size: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !31, file: !32, line: 39, baseType: !4, size: 32, offset: 224)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !31, file: !32, line: 40, baseType: !4, size: 32, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !31, file: !32, line: 41, baseType: !44, size: 64, offset: 320)
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !31, file: !32, line: 42, baseType: !26, size: 64, offset: 384)
!46 = !{!47, !48, !49, !50}
!47 = !DILocalVariable(name: "s", arg: 1, scope: !12, file: !1, line: 1442, type: !18)
!48 = !DILocalVariable(name: "maxsize", arg: 2, scope: !12, file: !1, line: 1442, type: !21)
!49 = !DILocalVariable(name: "format", arg: 3, scope: !12, file: !1, line: 1442, type: !25)
!50 = !DILocalVariable(name: "tim_p", arg: 4, scope: !12, file: !1, line: 1442, type: !28)
!51 = !DILocation(line: 1442, column: 1, scope: !12)
!52 = !DILocation(line: 230, column: 10, scope: !53, inlinedAt: !322)
!53 = distinct !DISubprogram(name: "__get_current_locale", scope: !54, file: !54, line: 228, type: !55, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !2)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DISubroutineType(types: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !54, line: 178, size: 3392, elements: !59)
!59 = !{!60, !65, !280, !285, !286, !287, !315, !319, !321}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !58, file: !54, line: 180, baseType: !61, size: 1792)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1792, elements: !62)
!62 = !{!63, !64}
!63 = !DISubrange(count: 7)
!64 = !DISubrange(count: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !58, file: !54, line: 181, baseType: !66, size: 64, offset: 1792)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!4, !69, !19, !276, !277}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !71, line: 569, size: 14912, elements: !72)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !{!73, !74, !147, !148, !149, !150, !154, !155, !156, !157, !161, !173, !174, !175, !177, !178, !179, !241, !261, !262, !267, !274}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !70, file: !71, line: 571, baseType: !4, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !70, file: !71, line: 576, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !71, line: 287, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !71, line: 181, size: 1408, elements: !78)
!78 = !{!79, !81, !82, !83, !85, !86, !91, !92, !94, !99, !103, !108, !112, !113, !114, !115, !119, !123, !124, !125, !127, !128, !132, !146}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !77, file: !71, line: 182, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !77, file: !71, line: 183, baseType: !4, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !77, file: !71, line: 184, baseType: !4, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !71, line: 185, baseType: !84, size: 16, offset: 128)
!84 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !77, file: !71, line: 186, baseType: !84, size: 16, offset: 144)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !77, file: !71, line: 187, baseType: !87, size: 128, offset: 192)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !71, line: 117, size: 128, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !87, file: !71, line: 118, baseType: !80, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !87, file: !71, line: 119, baseType: !4, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !77, file: !71, line: 188, baseType: !4, size: 32, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !77, file: !71, line: 195, baseType: !93, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !77, file: !71, line: 197, baseType: !95, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !69, !93, !19, !4}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !24, line: 145, baseType: !44)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !77, file: !71, line: 199, baseType: !100, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!98, !69, !93, !26, !4}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !77, file: !71, line: 202, baseType: !104, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !69, !93, !107, !4}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !24, line: 114, baseType: !44)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !77, file: !71, line: 203, baseType: !109, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!4, !69, !93}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !77, file: !71, line: 206, baseType: !87, size: 128, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !77, file: !71, line: 207, baseType: !80, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !77, file: !71, line: 208, baseType: !4, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !77, file: !71, line: 211, baseType: !116, size: 24, offset: 928)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 24, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !77, file: !71, line: 212, baseType: !120, size: 8, offset: 952)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !77, file: !71, line: 215, baseType: !87, size: 128, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !77, file: !71, line: 218, baseType: !4, size: 32, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !71, line: 219, baseType: !126, size: 64, offset: 1152)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !24, line: 44, baseType: !44)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !77, file: !71, line: 222, baseType: !69, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !77, file: !71, line: 226, baseType: !129, size: 32, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !24, line: 175, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !131, line: 12, baseType: !4)
!131 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !77, file: !71, line: 228, baseType: !133, size: 64, offset: 1312)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !24, line: 171, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 163, size: 64, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !134, file: !24, line: 165, baseType: !4, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !134, file: !24, line: 170, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !24, line: 166, size: 32, elements: !139)
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !138, file: !24, line: 168, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !16, line: 124, baseType: !7)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !138, file: !24, line: 169, baseType: !143, size: 32)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 4)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !77, file: !71, line: 229, baseType: !4, size: 32, offset: 1376)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !70, file: !71, line: 576, baseType: !75, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !70, file: !71, line: 576, baseType: !75, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !70, file: !71, line: 578, baseType: !4, size: 32, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !70, file: !71, line: 579, baseType: !151, size: 200, offset: 288)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 25)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !70, file: !71, line: 582, baseType: !4, size: 32, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !70, file: !71, line: 583, baseType: !57, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !70, file: !71, line: 585, baseType: !4, size: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !70, file: !71, line: 587, baseType: !158, size: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !69}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !70, file: !71, line: 590, baseType: !162, size: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !71, line: 47, size: 256, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !163, file: !71, line: 49, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !163, file: !71, line: 50, baseType: !4, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !163, file: !71, line: 50, baseType: !4, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !163, file: !71, line: 50, baseType: !4, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !163, file: !71, line: 50, baseType: !4, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !163, file: !71, line: 51, baseType: !171, size: 32, offset: 192)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 32, elements: !121)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !71, line: 25, baseType: !7)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !70, file: !71, line: 591, baseType: !4, size: 32, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !70, file: !71, line: 592, baseType: !162, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !70, file: !71, line: 593, baseType: !176, size: 64, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !70, file: !71, line: 596, baseType: !4, size: 32, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !70, file: !71, line: 597, baseType: !19, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !70, file: !71, line: 632, baseType: !180, size: 2880, offset: 1152)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !71, line: 599, size: 2880, elements: !181)
!181 = !{!182, !232}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !180, file: !71, line: 622, baseType: !183, size: 1728)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !71, line: 601, size: 1728, elements: !184)
!184 = !{!185, !186, !187, !191, !203, !204, !206, !214, !215, !216, !217, !221, !225, !226, !227, !228, !229, !230, !231}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !183, file: !71, line: 603, baseType: !7, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !183, file: !71, line: 604, baseType: !19, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !183, file: !71, line: 605, baseType: !188, size: 208, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 208, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 26)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !183, file: !71, line: 606, baseType: !192, size: 288, offset: 352)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !71, line: 55, size: 288, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !192, file: !71, line: 57, baseType: !4, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !192, file: !71, line: 58, baseType: !4, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !192, file: !71, line: 59, baseType: !4, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !192, file: !71, line: 60, baseType: !4, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !192, file: !71, line: 61, baseType: !4, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !192, file: !71, line: 62, baseType: !4, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !192, file: !71, line: 63, baseType: !4, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !192, file: !71, line: 64, baseType: !4, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !192, file: !71, line: 65, baseType: !4, size: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !183, file: !71, line: 607, baseType: !4, size: 32, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !183, file: !71, line: 608, baseType: !205, size: 64, offset: 704)
!205 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !183, file: !71, line: 609, baseType: !207, size: 112, offset: 768)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !71, line: 319, size: 112, elements: !208)
!208 = !{!209, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !207, file: !71, line: 320, baseType: !210, size: 48)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 48, elements: !117)
!211 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !207, file: !71, line: 321, baseType: !210, size: 48, offset: 48)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !207, file: !71, line: 322, baseType: !211, size: 16, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !183, file: !71, line: 610, baseType: !133, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !183, file: !71, line: 611, baseType: !133, size: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !183, file: !71, line: 612, baseType: !133, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !183, file: !71, line: 613, baseType: !218, size: 64, offset: 1088)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !183, file: !71, line: 614, baseType: !222, size: 192, offset: 1152)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 192, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 24)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !183, file: !71, line: 615, baseType: !4, size: 32, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !183, file: !71, line: 616, baseType: !133, size: 64, offset: 1376)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !183, file: !71, line: 617, baseType: !133, size: 64, offset: 1440)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !183, file: !71, line: 618, baseType: !133, size: 64, offset: 1504)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !183, file: !71, line: 619, baseType: !133, size: 64, offset: 1568)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !183, file: !71, line: 620, baseType: !133, size: 64, offset: 1632)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !183, file: !71, line: 621, baseType: !4, size: 32, offset: 1696)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !180, file: !71, line: 631, baseType: !233, size: 2880)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !71, line: 626, size: 2880, elements: !234)
!234 = !{!235, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !233, file: !71, line: 629, baseType: !236, size: 1920)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 1920, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 30)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !233, file: !71, line: 630, baseType: !240, size: 960, offset: 1920)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !237)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !70, file: !71, line: 636, baseType: !242, size: 64, offset: 4032)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !71, line: 93, size: 6336, elements: !244)
!244 = !{!245, !246, !247, !253}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !243, file: !71, line: 94, baseType: !242, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !243, file: !71, line: 95, baseType: !4, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !243, file: !71, line: 97, baseType: !248, size: 2048, offset: 128)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 2048, elements: !252)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null}
!252 = !{!64}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !243, file: !71, line: 98, baseType: !254, size: 4160, offset: 2176)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !71, line: 74, size: 4160, elements: !255)
!255 = !{!256, !258, !259, !260}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !254, file: !71, line: 75, baseType: !257, size: 2048)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !252)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !254, file: !71, line: 76, baseType: !257, size: 2048, offset: 2048)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !254, file: !71, line: 78, baseType: !172, size: 32, offset: 4096)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !254, file: !71, line: 81, baseType: !172, size: 32, offset: 4128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !70, file: !71, line: 637, baseType: !243, size: 6336, offset: 4096)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !70, file: !71, line: 641, baseType: !263, size: 64, offset: 10432)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !70, file: !71, line: 646, baseType: !268, size: 192, offset: 10496)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !71, line: 291, size: 192, elements: !269)
!269 = !{!270, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !268, file: !71, line: 293, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !268, file: !71, line: 294, baseType: !4, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !268, file: !71, line: 295, baseType: !75, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !70, file: !71, line: 648, baseType: !275, size: 4224, offset: 10688)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 4224, elements: !117)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !16, line: 83, baseType: !4)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !279, line: 86, baseType: !133)
!279 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !58, file: !54, line: 183, baseType: !281, size: 64, offset: 1856)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!4, !69, !284, !26, !21, !277}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !58, file: !54, line: 185, baseType: !4, size: 32, offset: 1920)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !58, file: !54, line: 186, baseType: !19, size: 64, offset: 1984)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !58, file: !54, line: 187, baseType: !288, size: 768, offset: 2048)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !289, line: 42, size: 768, elements: !290)
!289 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !288, file: !289, line: 44, baseType: !19, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !288, file: !289, line: 45, baseType: !19, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !288, file: !289, line: 46, baseType: !19, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !288, file: !289, line: 47, baseType: !19, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !288, file: !289, line: 48, baseType: !19, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !288, file: !289, line: 49, baseType: !19, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !288, file: !289, line: 50, baseType: !19, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !288, file: !289, line: 51, baseType: !19, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !288, file: !289, line: 52, baseType: !19, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !288, file: !289, line: 53, baseType: !19, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !288, file: !289, line: 54, baseType: !20, size: 8, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !288, file: !289, line: 55, baseType: !20, size: 8, offset: 648)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !288, file: !289, line: 56, baseType: !20, size: 8, offset: 656)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !288, file: !289, line: 57, baseType: !20, size: 8, offset: 664)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !288, file: !289, line: 58, baseType: !20, size: 8, offset: 672)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !288, file: !289, line: 59, baseType: !20, size: 8, offset: 680)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !288, file: !289, line: 60, baseType: !20, size: 8, offset: 688)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !288, file: !289, line: 61, baseType: !20, size: 8, offset: 696)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !288, file: !289, line: 62, baseType: !20, size: 8, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !288, file: !289, line: 63, baseType: !20, size: 8, offset: 712)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !288, file: !289, line: 64, baseType: !20, size: 8, offset: 720)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !288, file: !289, line: 65, baseType: !20, size: 8, offset: 728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !288, file: !289, line: 66, baseType: !20, size: 8, offset: 736)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !288, file: !289, line: 67, baseType: !20, size: 8, offset: 744)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !58, file: !54, line: 189, baseType: !316, size: 16, offset: 2816)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 16, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 2)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !58, file: !54, line: 190, baseType: !320, size: 256, offset: 2832)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !252)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !58, file: !54, line: 191, baseType: !320, size: 256, offset: 3088)
!322 = distinct !DILocation(line: 1459, column: 10, scope: !12)
!323 = !DILocation(line: 230, column: 18, scope: !53, inlinedAt: !322)
!324 = !{!325, !329, i64 72}
!325 = !{!"_reent", !326, i64 0, !329, i64 8, !329, i64 16, !329, i64 24, !326, i64 32, !327, i64 36, !326, i64 64, !329, i64 72, !326, i64 80, !329, i64 88, !329, i64 96, !326, i64 104, !329, i64 112, !329, i64 120, !326, i64 128, !329, i64 136, !327, i64 144, !329, i64 504, !330, i64 512, !329, i64 1304, !332, i64 1312, !327, i64 1336}
!326 = !{!"int", !327, i64 0}
!327 = !{!"omnipotent char", !328, i64 0}
!328 = !{!"Simple C/C++ TBAA"}
!329 = !{!"any pointer", !327, i64 0}
!330 = !{!"_atexit", !329, i64 0, !326, i64 8, !327, i64 16, !331, i64 272}
!331 = !{!"_on_exit_args", !327, i64 0, !327, i64 256, !326, i64 512, !326, i64 516}
!332 = !{!"_glue", !329, i64 0, !326, i64 8, !329, i64 16}
!333 = !DILocation(line: 213, column: 3, scope: !334, inlinedAt: !335)
!334 = distinct !DISubprogram(name: "__get_global_locale", scope: !54, file: !54, line: 210, type: !55, isLocal: true, isDefinition: true, scopeLine: 211, isOptimized: true, unit: !0, retainedNodes: !2)
!335 = distinct !DILocation(line: 230, column: 29, scope: !53, inlinedAt: !322)
!336 = !DILocation(line: 230, column: 3, scope: !53, inlinedAt: !322)
!337 = !DILocation(line: 1459, column: 10, scope: !12)
!338 = !DILocation(line: 1459, column: 3, scope: !12)
!339 = distinct !DISubprogram(name: "__strftime", scope: !1, file: !1, line: 685, type: !340, isLocal: true, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{!21, !19, !21, !26, !29, !57}
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !385, !391, !395, !396, !397, !398, !400, !401, !403, !404, !406, !407, !408, !409, !413, !414, !415, !417, !423, !425, !449, !451, !452, !453, !455, !458, !460, !461, !462, !463, !466, !467, !470}
!343 = !DILocalVariable(name: "s", arg: 1, scope: !339, file: !1, line: 685, type: !19)
!344 = !DILocalVariable(name: "maxsize", arg: 2, scope: !339, file: !1, line: 685, type: !21)
!345 = !DILocalVariable(name: "format", arg: 3, scope: !339, file: !1, line: 685, type: !26)
!346 = !DILocalVariable(name: "tim_p", arg: 4, scope: !339, file: !1, line: 686, type: !29)
!347 = !DILocalVariable(name: "locale", arg: 5, scope: !339, file: !1, line: 686, type: !57)
!348 = !DILocalVariable(name: "count", scope: !339, file: !1, line: 691, type: !21)
!349 = !DILocalVariable(name: "len", scope: !339, file: !1, line: 692, type: !4)
!350 = !DILocalVariable(name: "ctloc", scope: !339, file: !1, line: 693, type: !26)
!351 = !DILocalVariable(name: "i", scope: !339, file: !1, line: 697, type: !21)
!352 = !DILocalVariable(name: "ctloclen", scope: !339, file: !1, line: 697, type: !21)
!353 = !DILocalVariable(name: "alt", scope: !339, file: !1, line: 698, type: !20)
!354 = !DILocalVariable(name: "pad", scope: !339, file: !1, line: 699, type: !20)
!355 = !DILocalVariable(name: "width", scope: !339, file: !1, line: 700, type: !17)
!356 = !DILocalVariable(name: "tzset_called", scope: !339, file: !1, line: 701, type: !4)
!357 = !DILocalVariable(name: "_CurrentTimeLocale", scope: !339, file: !1, line: 703, type: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_time_T", file: !54, line: 116, size: 4032, elements: !361)
!361 = !{!362, !366, !367, !370, !371, !372, !373, !374, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !360, file: !54, line: 118, baseType: !363, size: 768)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 768, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !360, file: !54, line: 119, baseType: !363, size: 768, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "wday", scope: !360, file: !54, line: 120, baseType: !368, size: 448, offset: 1536)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 448, elements: !369)
!369 = !{!63}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !360, file: !54, line: 121, baseType: !368, size: 448, offset: 1984)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "X_fmt", scope: !360, file: !54, line: 122, baseType: !26, size: 64, offset: 2432)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "x_fmt", scope: !360, file: !54, line: 123, baseType: !26, size: 64, offset: 2496)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "c_fmt", scope: !360, file: !54, line: 124, baseType: !26, size: 64, offset: 2560)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "am_pm", scope: !360, file: !54, line: 125, baseType: !375, size: 128, offset: 2624)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !317)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "date_fmt", scope: !360, file: !54, line: 126, baseType: !26, size: 64, offset: 2752)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "alt_month", scope: !360, file: !54, line: 127, baseType: !363, size: 768, offset: 2816)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "md_order", scope: !360, file: !54, line: 128, baseType: !26, size: 64, offset: 3584)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ampm_fmt", scope: !360, file: !54, line: 129, baseType: !26, size: 64, offset: 3648)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !360, file: !54, line: 130, baseType: !26, size: 64, offset: 3712)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !360, file: !54, line: 131, baseType: !26, size: 64, offset: 3776)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !360, file: !54, line: 132, baseType: !26, size: 64, offset: 3840)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !360, file: !54, line: 133, baseType: !26, size: 64, offset: 3904)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !360, file: !54, line: 134, baseType: !26, size: 64, offset: 3968)
!385 = !DILocalVariable(name: "fp", scope: !386, file: !1, line: 727, type: !19)
!386 = distinct !DILexicalBlock(scope: !387, file: !1, line: 726, column: 8)
!387 = distinct !DILexicalBlock(scope: !388, file: !1, line: 725, column: 11)
!388 = distinct !DILexicalBlock(scope: !389, file: !1, line: 705, column: 5)
!389 = distinct !DILexicalBlock(scope: !390, file: !1, line: 704, column: 3)
!390 = distinct !DILexicalBlock(scope: !339, file: !1, line: 704, column: 3)
!391 = !DILocalVariable(name: "fmt", scope: !392, file: !1, line: 870, type: !19)
!392 = distinct !DILexicalBlock(scope: !393, file: !1, line: 869, column: 8)
!393 = distinct !DILexicalBlock(scope: !394, file: !1, line: 842, column: 4)
!394 = distinct !DILexicalBlock(scope: !388, file: !1, line: 761, column: 2)
!395 = !DILocalVariable(name: "pos", scope: !392, file: !1, line: 871, type: !19)
!396 = !DILocalVariable(name: "neg", scope: !392, file: !1, line: 872, type: !4)
!397 = !DILocalVariable(name: "century", scope: !392, file: !1, line: 873, type: !4)
!398 = !DILocalVariable(name: "fmtbuf", scope: !399, file: !1, line: 931, type: !320)
!399 = distinct !DILexicalBlock(scope: !394, file: !1, line: 929, column: 4)
!400 = !DILocalVariable(name: "fmt", scope: !399, file: !1, line: 931, type: !19)
!401 = !DILocalVariable(name: "adjust", scope: !402, file: !1, line: 962, type: !4)
!402 = distinct !DILexicalBlock(scope: !394, file: !1, line: 961, column: 4)
!403 = !DILocalVariable(name: "year", scope: !402, file: !1, line: 963, type: !4)
!404 = !DILocalVariable(name: "sign", scope: !405, file: !1, line: 979, type: !4)
!405 = distinct !DILexicalBlock(scope: !394, file: !1, line: 975, column: 4)
!406 = !DILocalVariable(name: "adjust", scope: !405, file: !1, line: 980, type: !4)
!407 = !DILocalVariable(name: "century", scope: !405, file: !1, line: 981, type: !4)
!408 = !DILocalVariable(name: "year", scope: !405, file: !1, line: 984, type: !4)
!409 = !DILocalVariable(name: "fmtbuf", scope: !405, file: !1, line: 1001, type: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 10)
!413 = !DILocalVariable(name: "fmt", scope: !405, file: !1, line: 1001, type: !19)
!414 = !DILocalVariable(name: "p_year", scope: !405, file: !1, line: 1003, type: !7)
!415 = !DILocalVariable(name: "h12", scope: !416, file: !1, line: 1046, type: !4)
!416 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1045, column: 4)
!417 = !DILocalVariable(name: "__x", scope: !418, file: !1, line: 1096, type: !4)
!418 = distinct !DILexicalBlock(scope: !419, file: !1, line: 1096, column: 38)
!419 = distinct !DILexicalBlock(scope: !420, file: !1, line: 1095, column: 12)
!420 = distinct !DILexicalBlock(scope: !421, file: !1, line: 1094, column: 6)
!421 = distinct !DILexicalBlock(scope: !422, file: !1, line: 1093, column: 4)
!422 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1093, column: 4)
!423 = !DILocalVariable(name: "offset", scope: !424, file: !1, line: 1134, type: !44)
!424 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1133, column: 4)
!425 = !DILocalVariable(name: "tz", scope: !426, file: !1, line: 1157, type: !428)
!426 = distinct !DILexicalBlock(scope: !427, file: !1, line: 1138, column: 8)
!427 = distinct !DILexicalBlock(scope: !424, file: !1, line: 1137, column: 10)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzinfo_type", file: !430, line: 65, baseType: !431)
!430 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzinfo_struct", file: !430, line: 60, size: 704, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__tznorth", scope: !431, file: !430, line: 62, baseType: !4, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__tzyear", scope: !431, file: !430, line: 63, baseType: !4, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__tzrule", scope: !431, file: !430, line: 64, baseType: !436, size: 640, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 640, elements: !317)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzrule_type", file: !430, line: 58, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzrule_struct", file: !430, line: 49, size: 320, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !448}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !438, file: !430, line: 51, baseType: !20, size: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !438, file: !430, line: 52, baseType: !4, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !438, file: !430, line: 53, baseType: !4, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !438, file: !430, line: 54, baseType: !4, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !438, file: !430, line: 55, baseType: !4, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !438, file: !430, line: 56, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !447, line: 34, baseType: !44)
!447 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!448 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !438, file: !430, line: 57, baseType: !44, size: 64, offset: 256)
!449 = !DILocalVariable(name: "adjust", scope: !450, file: !1, line: 1234, type: !4)
!450 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1233, column: 4)
!451 = !DILocalVariable(name: "wday", scope: !450, file: !1, line: 1235, type: !4)
!452 = !DILocalVariable(name: "week", scope: !450, file: !1, line: 1236, type: !4)
!453 = !DILocalVariable(name: "wday", scope: !454, file: !1, line: 1275, type: !4)
!454 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1274, column: 4)
!455 = !DILocalVariable(name: "year", scope: !456, file: !1, line: 1297, type: !4)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 1294, column: 3)
!457 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1287, column: 6)
!458 = !DILocalVariable(name: "fmtbuf", scope: !459, file: !1, line: 1320, type: !410)
!459 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1319, column: 6)
!460 = !DILocalVariable(name: "fmt", scope: !459, file: !1, line: 1320, type: !19)
!461 = !DILocalVariable(name: "sign", scope: !459, file: !1, line: 1321, type: !4)
!462 = !DILocalVariable(name: "year", scope: !459, file: !1, line: 1323, type: !7)
!463 = !DILocalVariable(name: "offset", scope: !464, file: !1, line: 1349, type: !44)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 1348, column: 13)
!465 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1347, column: 15)
!466 = !DILocalVariable(name: "tz", scope: !464, file: !1, line: 1369, type: !428)
!467 = !DILocalVariable(name: "size", scope: !468, file: !1, line: 1385, type: !21)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 1384, column: 6)
!469 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1383, column: 8)
!470 = !DILocalVariable(name: "tznam", scope: !468, file: !1, line: 1386, type: !26)
!471 = !DILocation(line: 685, column: 19, scope: !339)
!472 = !DILocation(line: 685, column: 29, scope: !339)
!473 = !DILocation(line: 685, column: 50, scope: !339)
!474 = !DILocation(line: 686, column: 23, scope: !339)
!475 = !DILocation(line: 686, column: 49, scope: !339)
!476 = !DILocation(line: 691, column: 10, scope: !339)
!477 = !DILocation(line: 692, column: 7, scope: !339)
!478 = !DILocation(line: 701, column: 7, scope: !339)
!479 = !DILocalVariable(name: "locale", arg: 1, scope: !480, file: !54, line: 364, type: !57)
!480 = distinct !DISubprogram(name: "__get_time_locale", scope: !54, file: !54, line: 364, type: !481, isLocal: true, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!358, !57}
!483 = !{!479}
!484 = !DILocation(line: 364, column: 39, scope: !480, inlinedAt: !485)
!485 = distinct !DILocation(line: 703, column: 48, scope: !339)
!486 = !DILocation(line: 366, column: 3, scope: !480, inlinedAt: !485)
!487 = !DILocation(line: 703, column: 27, scope: !339)
!488 = !DILocation(line: 704, column: 3, scope: !339)
!489 = !DILocation(line: 0, scope: !490)
!490 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1422, column: 8)
!491 = !DILocation(line: 706, column: 7, scope: !388)
!492 = !DILocation(line: 0, scope: !493)
!493 = distinct !DILexicalBlock(scope: !494, file: !1, line: 708, column: 8)
!494 = distinct !DILexicalBlock(scope: !388, file: !1, line: 707, column: 2)
!495 = !DILocation(line: 706, column: 14, scope: !388)
!496 = !{!327, !327, i64 0}
!497 = !DILocation(line: 706, column: 22, scope: !388)
!498 = !DILocation(line: 708, column: 14, scope: !493)
!499 = !DILocation(line: 708, column: 8, scope: !494)
!500 = !DILocation(line: 709, column: 26, scope: !493)
!501 = !DILocation(line: 709, column: 13, scope: !493)
!502 = !DILocation(line: 709, column: 6, scope: !493)
!503 = !DILocation(line: 709, column: 17, scope: !493)
!504 = distinct !{!504, !491, !505}
!505 = !DILocation(line: 712, column: 2, scope: !388)
