; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/strptime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/strptime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_time_T = type { [12 x i8*], [12 x i8*], [7 x i8*], [7 x i8*], i8*, i8*, i8*, [2 x i8*], i8*, [12 x i8*], i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "tm_year_base", scope: !2, file: !3, line: 61, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !11)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/strptime.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !9}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !{!0, !12}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "_DAYS_BEFORE_MONTH", scope: !2, file: !3, line: 48, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 384, elements: !16)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!16 = !{!17}
!17 = !DISubrange(count: 12)
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{i32 1, !"wchar_size", i32 4}
!21 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!22 = distinct !DISubprogram(name: "strptime_l", scope: !3, file: !3, line: 157, type: !23, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !317)
!23 = !DISubroutineType(types: !24)
!24 = !{!9, !25, !25, !27, !43}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !29, line: 31, size: 448, elements: !30)
!29 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !42}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !28, file: !29, line: 32, baseType: !6, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !28, file: !29, line: 33, baseType: !6, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !28, file: !29, line: 34, baseType: !6, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !28, file: !29, line: 35, baseType: !6, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !28, file: !29, line: 36, baseType: !6, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !28, file: !29, line: 37, baseType: !6, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !28, file: !29, line: 38, baseType: !6, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !28, file: !29, line: 39, baseType: !6, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !28, file: !29, line: 40, baseType: !6, size: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !28, file: !29, line: 41, baseType: !41, size: 64, offset: 320)
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !28, file: !29, line: 42, baseType: !25, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !44, line: 10, baseType: !45)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !47, line: 178, size: 3392, elements: !48)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !{!49, !54, !271, !280, !281, !282, !310, !314, !316}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !46, file: !47, line: 180, baseType: !50, size: 1792)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1792, elements: !51)
!51 = !{!52, !53}
!52 = !DISubrange(count: 7)
!53 = !DISubrange(count: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !46, file: !47, line: 181, baseType: !55, size: 64, offset: 1792)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!6, !58, !9, !267, !268}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !60, line: 569, size: 14912, elements: !61)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !{!62, !63, !138, !139, !140, !141, !145, !146, !147, !148, !152, !164, !165, !166, !168, !169, !170, !232, !252, !253, !258, !265}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !59, file: !60, line: 571, baseType: !6, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !60, line: 287, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !60, line: 181, size: 1408, elements: !67)
!67 = !{!68, !70, !71, !72, !74, !75, !80, !81, !82, !88, !92, !97, !101, !102, !103, !104, !108, !112, !113, !114, !116, !117, !121, !137}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !66, file: !60, line: 182, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !66, file: !60, line: 183, baseType: !6, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !66, file: !60, line: 184, baseType: !6, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !60, line: 185, baseType: !73, size: 16, offset: 128)
!73 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !66, file: !60, line: 186, baseType: !73, size: 16, offset: 144)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !66, file: !60, line: 187, baseType: !76, size: 128, offset: 192)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !60, line: 117, size: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !76, file: !60, line: 118, baseType: !69, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !76, file: !60, line: 119, baseType: !6, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !66, file: !60, line: 188, baseType: !6, size: 32, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !66, file: !60, line: 195, baseType: !8, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !66, file: !60, line: 197, baseType: !83, size: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !58, !8, !9, !6}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !87, line: 145, baseType: !41)
!87 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !66, file: !60, line: 199, baseType: !89, size: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!86, !58, !8, !25, !6}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !66, file: !60, line: 202, baseType: !93, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !58, !8, !96, !6}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !87, line: 114, baseType: !41)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !66, file: !60, line: 203, baseType: !98, size: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!6, !58, !8}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !66, file: !60, line: 206, baseType: !76, size: 128, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !66, file: !60, line: 207, baseType: !69, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !66, file: !60, line: 208, baseType: !6, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !66, file: !60, line: 211, baseType: !105, size: 24, offset: 928)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 3)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !66, file: !60, line: 212, baseType: !109, size: 8, offset: 952)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !66, file: !60, line: 215, baseType: !76, size: 128, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !66, file: !60, line: 218, baseType: !6, size: 32, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !60, line: 219, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !87, line: 44, baseType: !41)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !66, file: !60, line: 222, baseType: !58, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !60, line: 226, baseType: !118, size: 32, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !87, line: 175, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !120, line: 12, baseType: !6)
!120 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !66, file: !60, line: 228, baseType: !122, size: 64, offset: 1312)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !87, line: 171, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 163, size: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !123, file: !87, line: 165, baseType: !6, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !123, file: !87, line: 170, baseType: !127, size: 32, offset: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !87, line: 166, size: 32, elements: !128)
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !127, file: !87, line: 168, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !131, line: 124, baseType: !132)
!131 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !127, file: !87, line: 169, baseType: !134, size: 32)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 4)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !60, line: 229, baseType: !6, size: 32, offset: 1376)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !59, file: !60, line: 578, baseType: !6, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !59, file: !60, line: 579, baseType: !142, size: 200, offset: 288)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 200, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 25)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !59, file: !60, line: 582, baseType: !6, size: 32, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !59, file: !60, line: 583, baseType: !45, size: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !59, file: !60, line: 585, baseType: !6, size: 32, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !59, file: !60, line: 587, baseType: !149, size: 64, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !58}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !59, file: !60, line: 590, baseType: !153, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !60, line: 47, size: 256, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !154, file: !60, line: 49, baseType: !153, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !154, file: !60, line: 50, baseType: !6, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !154, file: !60, line: 50, baseType: !6, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !154, file: !60, line: 50, baseType: !6, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !154, file: !60, line: 50, baseType: !6, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !154, file: !60, line: 51, baseType: !162, size: 32, offset: 192)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 32, elements: !110)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !60, line: 25, baseType: !132)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !59, file: !60, line: 591, baseType: !6, size: 32, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !59, file: !60, line: 592, baseType: !153, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !59, file: !60, line: 593, baseType: !167, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !59, file: !60, line: 596, baseType: !6, size: 32, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !59, file: !60, line: 597, baseType: !9, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !59, file: !60, line: 632, baseType: !171, size: 2880, offset: 1152)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !60, line: 599, size: 2880, elements: !172)
!172 = !{!173, !223}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !171, file: !60, line: 622, baseType: !174, size: 1728)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !60, line: 601, size: 1728, elements: !175)
!175 = !{!176, !177, !178, !182, !194, !195, !197, !205, !206, !207, !208, !212, !216, !217, !218, !219, !220, !221, !222}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !174, file: !60, line: 603, baseType: !132, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !174, file: !60, line: 604, baseType: !9, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !174, file: !60, line: 605, baseType: !179, size: 208, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 208, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 26)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !174, file: !60, line: 606, baseType: !183, size: 288, offset: 352)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !60, line: 55, size: 288, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !183, file: !60, line: 57, baseType: !6, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !183, file: !60, line: 58, baseType: !6, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !183, file: !60, line: 59, baseType: !6, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !183, file: !60, line: 60, baseType: !6, size: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !183, file: !60, line: 61, baseType: !6, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !183, file: !60, line: 62, baseType: !6, size: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !183, file: !60, line: 63, baseType: !6, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !183, file: !60, line: 64, baseType: !6, size: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !183, file: !60, line: 65, baseType: !6, size: 32, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !174, file: !60, line: 607, baseType: !6, size: 32, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !174, file: !60, line: 608, baseType: !196, size: 64, offset: 704)
!196 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !174, file: !60, line: 609, baseType: !198, size: 112, offset: 768)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !60, line: 319, size: 112, elements: !199)
!199 = !{!200, !203, !204}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !198, file: !60, line: 320, baseType: !201, size: 48)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 48, elements: !106)
!202 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !198, file: !60, line: 321, baseType: !201, size: 48, offset: 48)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !198, file: !60, line: 322, baseType: !202, size: 16, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !174, file: !60, line: 610, baseType: !122, size: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !174, file: !60, line: 611, baseType: !122, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !174, file: !60, line: 612, baseType: !122, size: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !174, file: !60, line: 613, baseType: !209, size: 64, offset: 1088)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !174, file: !60, line: 614, baseType: !213, size: 192, offset: 1152)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 24)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !174, file: !60, line: 615, baseType: !6, size: 32, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !174, file: !60, line: 616, baseType: !122, size: 64, offset: 1376)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !174, file: !60, line: 617, baseType: !122, size: 64, offset: 1440)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !174, file: !60, line: 618, baseType: !122, size: 64, offset: 1504)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !174, file: !60, line: 619, baseType: !122, size: 64, offset: 1568)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !174, file: !60, line: 620, baseType: !122, size: 64, offset: 1632)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !174, file: !60, line: 621, baseType: !6, size: 32, offset: 1696)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !171, file: !60, line: 631, baseType: !224, size: 2880)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !60, line: 626, size: 2880, elements: !225)
!225 = !{!226, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !224, file: !60, line: 629, baseType: !227, size: 1920)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1920, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 30)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !224, file: !60, line: 630, baseType: !231, size: 960, offset: 1920)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 960, elements: !228)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !59, file: !60, line: 636, baseType: !233, size: 64, offset: 4032)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !60, line: 93, size: 6336, elements: !235)
!235 = !{!236, !237, !238, !244}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !234, file: !60, line: 94, baseType: !233, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !234, file: !60, line: 95, baseType: !6, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !234, file: !60, line: 97, baseType: !239, size: 2048, offset: 128)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 2048, elements: !243)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !{!53}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !234, file: !60, line: 98, baseType: !245, size: 4160, offset: 2176)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !60, line: 74, size: 4160, elements: !246)
!246 = !{!247, !249, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !245, file: !60, line: 75, baseType: !248, size: 2048)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !243)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !245, file: !60, line: 76, baseType: !248, size: 2048, offset: 2048)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !245, file: !60, line: 78, baseType: !163, size: 32, offset: 4096)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !245, file: !60, line: 81, baseType: !163, size: 32, offset: 4128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !59, file: !60, line: 637, baseType: !234, size: 6336, offset: 4096)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !59, file: !60, line: 641, baseType: !254, size: 64, offset: 10432)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !6}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !59, file: !60, line: 646, baseType: !259, size: 192, offset: 10496)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !60, line: 291, size: 192, elements: !260)
!260 = !{!261, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !259, file: !60, line: 293, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !259, file: !60, line: 294, baseType: !6, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !259, file: !60, line: 295, baseType: !64, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !59, file: !60, line: 648, baseType: !266, size: 4224, offset: 10688)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 4224, elements: !106)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !131, line: 83, baseType: !6)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !270, line: 86, baseType: !122)
!270 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !46, file: !47, line: 183, baseType: !272, size: 64, offset: 1856)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!6, !58, !275, !25, !276, !268}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 40, baseType: !278)
!277 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !87, line: 129, baseType: !279)
!279 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !46, file: !47, line: 185, baseType: !6, size: 32, offset: 1920)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !46, file: !47, line: 186, baseType: !9, size: 64, offset: 1984)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !46, file: !47, line: 187, baseType: !283, size: 768, offset: 2048)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !284, line: 42, size: 768, elements: !285)
!284 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !283, file: !284, line: 44, baseType: !9, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !283, file: !284, line: 45, baseType: !9, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !283, file: !284, line: 46, baseType: !9, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !283, file: !284, line: 47, baseType: !9, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !283, file: !284, line: 48, baseType: !9, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !283, file: !284, line: 49, baseType: !9, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !283, file: !284, line: 50, baseType: !9, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !283, file: !284, line: 51, baseType: !9, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !283, file: !284, line: 52, baseType: !9, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !283, file: !284, line: 53, baseType: !9, size: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !283, file: !284, line: 54, baseType: !10, size: 8, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !283, file: !284, line: 55, baseType: !10, size: 8, offset: 648)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !283, file: !284, line: 56, baseType: !10, size: 8, offset: 656)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !283, file: !284, line: 57, baseType: !10, size: 8, offset: 664)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !283, file: !284, line: 58, baseType: !10, size: 8, offset: 672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !283, file: !284, line: 59, baseType: !10, size: 8, offset: 680)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !283, file: !284, line: 60, baseType: !10, size: 8, offset: 688)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !283, file: !284, line: 61, baseType: !10, size: 8, offset: 696)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !283, file: !284, line: 62, baseType: !10, size: 8, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !283, file: !284, line: 63, baseType: !10, size: 8, offset: 712)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !283, file: !284, line: 64, baseType: !10, size: 8, offset: 720)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !283, file: !284, line: 65, baseType: !10, size: 8, offset: 728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !283, file: !284, line: 66, baseType: !10, size: 8, offset: 736)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !283, file: !284, line: 67, baseType: !10, size: 8, offset: 744)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !46, file: !47, line: 189, baseType: !311, size: 16, offset: 2816)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 2)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !46, file: !47, line: 190, baseType: !315, size: 256, offset: 2832)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, elements: !243)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !46, file: !47, line: 191, baseType: !315, size: 256, offset: 3088)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !350, !354, !355, !362, !365, !366, !374, !375}
!318 = !DILocalVariable(name: "buf", arg: 1, scope: !22, file: !3, line: 157, type: !25)
!319 = !DILocalVariable(name: "format", arg: 2, scope: !22, file: !3, line: 157, type: !25)
!320 = !DILocalVariable(name: "timeptr", arg: 3, scope: !22, file: !3, line: 157, type: !27)
!321 = !DILocalVariable(name: "locale", arg: 4, scope: !22, file: !3, line: 158, type: !43)
!322 = !DILocalVariable(name: "c", scope: !22, file: !3, line: 160, type: !10)
!323 = !DILocalVariable(name: "ymd", scope: !22, file: !3, line: 161, type: !6)
!324 = !DILocalVariable(name: "_CurrentTimeLocale", scope: !22, file: !3, line: 163, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_time_T", file: !47, line: 116, size: 4032, elements: !328)
!328 = !{!329, !331, !332, !335, !336, !337, !338, !339, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !327, file: !47, line: 118, baseType: !330, size: 768)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 768, elements: !16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !327, file: !47, line: 119, baseType: !330, size: 768, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "wday", scope: !327, file: !47, line: 120, baseType: !333, size: 448, offset: 1536)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 448, elements: !334)
!334 = !{!52}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !327, file: !47, line: 121, baseType: !333, size: 448, offset: 1984)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "X_fmt", scope: !327, file: !47, line: 122, baseType: !25, size: 64, offset: 2432)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "x_fmt", scope: !327, file: !47, line: 123, baseType: !25, size: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "c_fmt", scope: !327, file: !47, line: 124, baseType: !25, size: 64, offset: 2560)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "am_pm", scope: !327, file: !47, line: 125, baseType: !340, size: 128, offset: 2624)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "date_fmt", scope: !327, file: !47, line: 126, baseType: !25, size: 64, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alt_month", scope: !327, file: !47, line: 127, baseType: !330, size: 768, offset: 2816)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "md_order", scope: !327, file: !47, line: 128, baseType: !25, size: 64, offset: 3584)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ampm_fmt", scope: !327, file: !47, line: 129, baseType: !25, size: 64, offset: 3648)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !327, file: !47, line: 130, baseType: !25, size: 64, offset: 3712)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !327, file: !47, line: 131, baseType: !25, size: 64, offset: 3776)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !327, file: !47, line: 132, baseType: !25, size: 64, offset: 3840)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !327, file: !47, line: 133, baseType: !25, size: 64, offset: 3904)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !327, file: !47, line: 134, baseType: !25, size: 64, offset: 3968)
!350 = !DILocalVariable(name: "s", scope: !351, file: !3, line: 165, type: !9)
!351 = distinct !DILexicalBlock(scope: !352, file: !3, line: 164, column: 45)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 164, column: 5)
!353 = distinct !DILexicalBlock(scope: !22, file: !3, line: 164, column: 5)
!354 = !DILocalVariable(name: "ret", scope: !351, file: !3, line: 166, type: !6)
!355 = !DILocalVariable(name: "sec", scope: !356, file: !3, line: 315, type: !361)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 314, column: 3)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 175, column: 17)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 171, column: 44)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 171, column: 13)
!360 = distinct !DILexicalBlock(scope: !351, file: !3, line: 168, column: 6)
!361 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!362 = !DILocalVariable(name: "t", scope: !356, file: !3, line: 316, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !364, line: 34, baseType: !41)
!364 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!365 = !DILocalVariable(name: "save_errno", scope: !356, file: !3, line: 317, type: !6)
!366 = !DILocalVariable(name: "leap", scope: !367, file: !3, line: 474, type: !6)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 473, column: 11)
!368 = distinct !DILexicalBlock(scope: !369, file: !3, line: 471, column: 10)
!369 = distinct !DILexicalBlock(scope: !370, file: !3, line: 469, column: 24)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 469, column: 6)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 466, column: 70)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 466, column: 14)
!373 = distinct !DILexicalBlock(scope: !22, file: !3, line: 451, column: 9)
!374 = !DILocalVariable(name: "i", scope: !367, file: !3, line: 475, type: !6)
!375 = !DILocalVariable(name: "fday", scope: !376, file: !3, line: 498, type: !6)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 496, column: 76)
!377 = distinct !DILexicalBlock(scope: !22, file: !3, line: 496, column: 9)
!378 = !DILocation(line: 157, column: 25, scope: !22)
!379 = !DILocation(line: 157, column: 42, scope: !22)
!380 = !DILocation(line: 157, column: 61, scope: !22)
!381 = !DILocation(line: 158, column: 15, scope: !22)
!382 = !DILocation(line: 161, column: 9, scope: !22)
!383 = !DILocalVariable(name: "locale", arg: 1, scope: !384, file: !47, line: 364, type: !45)
!384 = distinct !DISubprogram(name: "__get_time_locale", scope: !47, file: !47, line: 364, type: !385, isLocal: true, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{!325, !45}
!387 = !{!383}
!388 = !DILocation(line: 364, column: 39, scope: !384, inlinedAt: !389)
!389 = distinct !DILocation(line: 163, column: 50, scope: !22)
!390 = !DILocation(line: 366, column: 3, scope: !384, inlinedAt: !389)
!391 = !DILocation(line: 163, column: 29, scope: !22)
!392 = !DILocation(line: 164, column: 17, scope: !352)
!393 = !{!394, !394, i64 0}
!394 = !{!"omnipotent char", !395, i64 0}
!395 = !{!"Simple C/C++ TBAA"}
!396 = !DILocation(line: 160, column: 10, scope: !22)
!397 = !DILocation(line: 164, column: 26, scope: !352)
!398 = !DILocation(line: 164, column: 5, scope: !353)
!399 = !DILocation(line: 165, column: 2, scope: !351)
!400 = !DILocation(line: 168, column: 6, scope: !360)
!401 = !DILocation(line: 168, column: 6, scope: !351)
!402 = !DILocation(line: 169, column: 13, scope: !403)
!403 = distinct !DILexicalBlock(scope: !360, file: !3, line: 168, column: 45)
!404 = !DILocation(line: 169, column: 6, scope: !403)
