; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/string/strtok.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/string/strtok.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i8* @strtok(i8* noalias, i8* noalias) local_unnamed_addr #0 !dbg !7 {
  %3 = tail call %struct._reent* @__getreent() #3, !dbg !237
  %4 = getelementptr inbounds %struct._reent, %struct._reent* %3, i64 0, i32 16, i32 0, i32 0, i64 1, !dbg !239
  %5 = tail call i8* @__strtok_r(i8* %0, i8* %1, i8** nonnull %4, i32 1) #3, !dbg !240
  store volatile i32 42, i32* @__A_VARIABLE, align 4, !dbg !241
  ret i8* %5, !dbg !241
}

; Function Attrs: noredzone
declare dso_local %struct._reent* @__getreent() local_unnamed_addr #1

; Function Attrs: noredzone
declare dso_local i8* @__strtok_r(i8*, i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.module.flags = !{!3, !4, !5}
!llvm.ident = !{!6}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/string/strtok.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "strtok", scope: !1, file: !1, line: 97, type: !8, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !16)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !10)
!13 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!16 = !{!17, !18, !19}
!17 = !DILocalVariable(name: "s", arg: 1, scope: !7, file: !1, line: 97, type: !12)
!18 = !DILocalVariable(name: "delim", arg: 2, scope: !7, file: !1, line: 97, type: !13)
!19 = !DILocalVariable(name: "reent", scope: !7, file: !1, line: 101, type: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !22, line: 569, size: 14912, elements: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !{!24, !26, !104, !105, !106, !107, !111, !112, !115, !116, !120, !132, !133, !134, !136, !137, !138, !200, !221, !222, !227, !234}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !21, file: !22, line: 571, baseType: !25, size: 32)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !21, file: !22, line: 576, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !22, line: 287, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 181, size: 1408, elements: !30)
!30 = !{!31, !34, !35, !36, !38, !39, !44, !45, !47, !54, !58, !63, !67, !68, !69, !70, !74, !78, !79, !80, !82, !83, !87, !103}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !29, file: !22, line: 182, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !29, file: !22, line: 183, baseType: !25, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !29, file: !22, line: 184, baseType: !25, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !22, line: 185, baseType: !37, size: 16, offset: 128)
!37 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !29, file: !22, line: 186, baseType: !37, size: 16, offset: 144)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !29, file: !22, line: 187, baseType: !40, size: 128, offset: 192)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 117, size: 128, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !40, file: !22, line: 118, baseType: !32, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !40, file: !22, line: 119, baseType: !25, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !29, file: !22, line: 188, baseType: !25, size: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !29, file: !22, line: 195, baseType: !46, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !29, file: !22, line: 197, baseType: !48, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !20, !46, !10, !25}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !52, line: 145, baseType: !53)
!52 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !29, file: !22, line: 199, baseType: !55, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!51, !20, !46, !14, !25}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !29, file: !22, line: 202, baseType: !59, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !20, !46, !62, !25}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !52, line: 114, baseType: !53)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !29, file: !22, line: 203, baseType: !64, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!25, !20, !46}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !29, file: !22, line: 206, baseType: !40, size: 128, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !29, file: !22, line: 207, baseType: !32, size: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !29, file: !22, line: 208, baseType: !25, size: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !29, file: !22, line: 211, baseType: !71, size: 24, offset: 928)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !29, file: !22, line: 212, baseType: !75, size: 8, offset: 952)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !29, file: !22, line: 215, baseType: !40, size: 128, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !29, file: !22, line: 218, baseType: !25, size: 32, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !22, line: 219, baseType: !81, size: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !52, line: 44, baseType: !53)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !29, file: !22, line: 222, baseType: !20, size: 64, offset: 1216)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !29, file: !22, line: 226, baseType: !84, size: 32, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !52, line: 175, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !86, line: 12, baseType: !25)
!86 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !29, file: !22, line: 228, baseType: !88, size: 64, offset: 1312)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !52, line: 171, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 163, size: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !89, file: !52, line: 165, baseType: !25, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !89, file: !52, line: 170, baseType: !93, size: 32, offset: 32)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !52, line: 166, size: 32, elements: !94)
!94 = !{!95, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !93, file: !52, line: 168, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !97, line: 124, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!98 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !93, file: !52, line: 169, baseType: !100, size: 32)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 4)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !29, file: !22, line: 229, baseType: !25, size: 32, offset: 1376)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !21, file: !22, line: 576, baseType: !27, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !21, file: !22, line: 576, baseType: !27, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !21, file: !22, line: 578, baseType: !25, size: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !21, file: !22, line: 579, baseType: !108, size: 200, offset: 288)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 200, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 25)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !21, file: !22, line: 582, baseType: !25, size: 32, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !21, file: !22, line: 583, baseType: !113, size: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !22, line: 40, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !21, file: !22, line: 585, baseType: !25, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !21, file: !22, line: 587, baseType: !117, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !20}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !21, file: !22, line: 590, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !22, line: 47, size: 256, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !122, file: !22, line: 49, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !122, file: !22, line: 50, baseType: !25, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !122, file: !22, line: 50, baseType: !25, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !122, file: !22, line: 50, baseType: !25, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !122, file: !22, line: 50, baseType: !25, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !122, file: !22, line: 51, baseType: !130, size: 32, offset: 192)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !76)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !22, line: 25, baseType: !98)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !21, file: !22, line: 591, baseType: !25, size: 32, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !21, file: !22, line: 592, baseType: !121, size: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !21, file: !22, line: 593, baseType: !135, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !21, file: !22, line: 596, baseType: !25, size: 32, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !21, file: !22, line: 597, baseType: !10, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !21, file: !22, line: 632, baseType: !139, size: 2880, offset: 1152)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !22, line: 599, size: 2880, elements: !140)
!140 = !{!141, !191}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !139, file: !22, line: 622, baseType: !142, size: 1728)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !139, file: !22, line: 601, size: 1728, elements: !143)
!143 = !{!144, !145, !146, !150, !162, !163, !165, !173, !174, !175, !176, !180, !184, !185, !186, !187, !188, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !142, file: !22, line: 603, baseType: !98, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !142, file: !22, line: 604, baseType: !10, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !142, file: !22, line: 605, baseType: !147, size: 208, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 208, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 26)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !142, file: !22, line: 606, baseType: !151, size: 288, offset: 352)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !22, line: 55, size: 288, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !151, file: !22, line: 57, baseType: !25, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !151, file: !22, line: 58, baseType: !25, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !151, file: !22, line: 59, baseType: !25, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !151, file: !22, line: 60, baseType: !25, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !151, file: !22, line: 61, baseType: !25, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !151, file: !22, line: 62, baseType: !25, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !151, file: !22, line: 63, baseType: !25, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !151, file: !22, line: 64, baseType: !25, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !151, file: !22, line: 65, baseType: !25, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !142, file: !22, line: 607, baseType: !25, size: 32, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !142, file: !22, line: 608, baseType: !164, size: 64, offset: 704)
!164 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !142, file: !22, line: 609, baseType: !166, size: 112, offset: 768)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !22, line: 319, size: 112, elements: !167)
!167 = !{!168, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !166, file: !22, line: 320, baseType: !169, size: 48)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !72)
!170 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !166, file: !22, line: 321, baseType: !169, size: 48, offset: 48)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !166, file: !22, line: 322, baseType: !170, size: 16, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !142, file: !22, line: 610, baseType: !88, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !142, file: !22, line: 611, baseType: !88, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !142, file: !22, line: 612, baseType: !88, size: 64, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !142, file: !22, line: 613, baseType: !177, size: 64, offset: 1088)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !142, file: !22, line: 614, baseType: !181, size: 192, offset: 1152)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 24)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !142, file: !22, line: 615, baseType: !25, size: 32, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !142, file: !22, line: 616, baseType: !88, size: 64, offset: 1376)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !142, file: !22, line: 617, baseType: !88, size: 64, offset: 1440)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !142, file: !22, line: 618, baseType: !88, size: 64, offset: 1504)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !142, file: !22, line: 619, baseType: !88, size: 64, offset: 1568)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !142, file: !22, line: 620, baseType: !88, size: 64, offset: 1632)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !142, file: !22, line: 621, baseType: !25, size: 32, offset: 1696)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !139, file: !22, line: 631, baseType: !192, size: 2880)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !139, file: !22, line: 626, size: 2880, elements: !193)
!193 = !{!194, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !192, file: !22, line: 629, baseType: !195, size: 1920)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1920, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 30)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !192, file: !22, line: 630, baseType: !199, size: 960, offset: 1920)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 960, elements: !196)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !21, file: !22, line: 636, baseType: !201, size: 64, offset: 4032)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !22, line: 93, size: 6336, elements: !203)
!203 = !{!204, !205, !206, !213}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !202, file: !22, line: 94, baseType: !201, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !202, file: !22, line: 95, baseType: !25, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !202, file: !22, line: 97, baseType: !207, size: 2048, offset: 128)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 2048, elements: !211)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null}
!211 = !{!212}
!212 = !DISubrange(count: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !202, file: !22, line: 98, baseType: !214, size: 4160, offset: 2176)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !22, line: 74, size: 4160, elements: !215)
!215 = !{!216, !218, !219, !220}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !214, file: !22, line: 75, baseType: !217, size: 2048)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !211)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !214, file: !22, line: 76, baseType: !217, size: 2048, offset: 2048)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !214, file: !22, line: 78, baseType: !131, size: 32, offset: 4096)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !214, file: !22, line: 81, baseType: !131, size: 32, offset: 4128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !21, file: !22, line: 637, baseType: !202, size: 6336, offset: 4096)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !21, file: !22, line: 641, baseType: !223, size: 64, offset: 10432)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !25}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !21, file: !22, line: 646, baseType: !228, size: 192, offset: 10496)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !22, line: 291, size: 192, elements: !229)
!229 = !{!230, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !228, file: !22, line: 293, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !228, file: !22, line: 294, baseType: !25, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !228, file: !22, line: 295, baseType: !27, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !21, file: !22, line: 648, baseType: !235, size: 4224, offset: 10688)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 4224, elements: !72)
!236 = !DILocation(line: 97, column: 1, scope: !7)
!237 = !DILocation(line: 101, column: 25, scope: !7)
!238 = !DILocation(line: 101, column: 17, scope: !7)
!239 = !DILocation(line: 104, column: 33, scope: !7)
!240 = !DILocation(line: 104, column: 9, scope: !7)
!241 = !DILocation(line: 104, column: 2, scope: !7)
