; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/sys.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/sys.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sys_sem_t = type { %struct.uk_semaphore, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }
%struct.uk_thread_list = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/sys.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 53, baseType: !12, size: 32, elements: !13)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!14 = !DIEnumerator(name: "ERR_OK", value: 0)
!15 = !DIEnumerator(name: "ERR_MEM", value: -1)
!16 = !DIEnumerator(name: "ERR_BUF", value: -2)
!17 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!18 = !DIEnumerator(name: "ERR_RTE", value: -4)
!19 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!20 = !DIEnumerator(name: "ERR_VAL", value: -6)
!21 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!22 = !DIEnumerator(name: "ERR_USE", value: -8)
!23 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!24 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!25 = !DIEnumerator(name: "ERR_CONN", value: -11)
!26 = !DIEnumerator(name: "ERR_IF", value: -12)
!27 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!28 = !DIEnumerator(name: "ERR_RST", value: -14)
!29 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!30 = !DIEnumerator(name: "ERR_ARG", value: -16)
!31 = !{i32 2, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!35 = distinct !DISubprogram(name: "sys_msleep", scope: !1, file: !1, line: 135, type: !36, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !44)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !39, line: 129, baseType: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 48, baseType: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !43, line: 79, baseType: !5)
!43 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !{!45, !46, !498}
!45 = !DILocalVariable(name: "ms", arg: 1, scope: !35, file: !1, line: 135, type: !38)
!46 = !DILocalVariable(name: "delaysem", scope: !47, file: !1, line: 138, type: !49)
!47 = distinct !DILexicalBlock(scope: !48, file: !1, line: 137, column: 15)
!48 = distinct !DILexicalBlock(scope: !35, file: !1, line: 137, column: 7)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sem_t", file: !50, line: 72, baseType: !51)
!50 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/sys_arch.h", directory: "/root/.unikraft/apps/redis/build")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 69, size: 256, elements: !52)
!52 = !{!53, !497}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !51, file: !50, line: 70, baseType: !54, size: 192)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !55, line: 51, size: 192, elements: !56)
!55 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !54, file: !55, line: 52, baseType: !58, size: 64)
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !54, file: !55, line: 53, baseType: !60, size: 128, offset: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !61, line: 42, size: 128, elements: !62)
!61 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !{!63, !495}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !60, file: !61, line: 42, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !61, line: 35, size: 192, elements: !66)
!66 = !{!67, !68, !491}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !65, file: !61, line: 36, baseType: !12, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !65, file: !61, line: 37, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !71, line: 59, size: 1024, elements: !72)
!71 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !{!73, !77, !79, !80, !81, !87, !88, !93, !95, !96, !245, !246, !247, !461}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 60, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !70, file: !71, line: 61, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !70, file: !71, line: 62, baseType: !78, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !70, file: !71, line: 63, baseType: !78, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !70, file: !71, line: 64, baseType: !82, size: 128, offset: 256)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !71, line: 64, size: 128, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !82, file: !71, line: 64, baseType: !69, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !82, file: !71, line: 64, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !71, line: 65, baseType: !40, size: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !70, file: !71, line: 66, baseType: !89, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !90, line: 49, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !92, line: 128, baseType: !58)
!92 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !70, file: !71, line: 67, baseType: !94, size: 8, offset: 512)
!94 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !70, file: !71, line: 68, baseType: !60, size: 128, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !70, file: !71, line: 69, baseType: !97, size: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !99, line: 90, size: 2176, elements: !100)
!99 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !{!101, !106, !124, !129, !131, !133, !138, !146, !151, !157, !158, !159, !164, !242, !243, !244}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !98, file: !99, line: 91, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !99, line: 68, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !97}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !98, file: !99, line: 93, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !99, line: 71, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!12, !97, !69, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !114, line: 62, baseType: !115)
!114 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !114, line: 55, size: 128, elements: !116)
!116 = !{!117, !118, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !115, file: !114, line: 57, baseType: !94, size: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !115, file: !114, line: 59, baseType: !119, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !114, line: 53, baseType: !12)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !115, file: !114, line: 61, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !90, line: 48, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !92, line: 129, baseType: !123)
!123 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !98, file: !99, line: 94, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !99, line: 74, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !97, !69}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !98, file: !99, line: 95, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !99, line: 76, baseType: !126)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !98, file: !99, line: 96, baseType: !132, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !99, line: 78, baseType: !126)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !98, file: !99, line: 98, baseType: !134, size: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !99, line: 81, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!12, !97, !69, !119}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !98, file: !99, line: 99, baseType: !139, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !99, line: 83, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!12, !97, !143, !145}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !98, file: !99, line: 100, baseType: !147, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !99, line: 85, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!12, !97, !69, !12}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !98, file: !99, line: 101, baseType: !152, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !99, line: 87, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!12, !97, !143, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !98, file: !99, line: 104, baseType: !94, size: 8, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !98, file: !99, line: 105, baseType: !70, size: 1024, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !98, file: !99, line: 106, baseType: !160, size: 128, offset: 1664)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !71, line: 93, size: 128, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !160, file: !71, line: 93, baseType: !69, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !160, file: !71, line: 93, baseType: !86, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !98, file: !99, line: 107, baseType: !165, size: 192, offset: 1792)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !166, line: 59, size: 192, elements: !167)
!166 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!167 = !{!168, !233, !237}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !165, file: !166, line: 61, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !166, line: 51, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!78, !173, !123, !123}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !175, line: 77, size: 832, elements: !176)
!175 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!176 = !{!177, !184, !189, !194, !200, !202, !207, !208, !209, !214, !219, !224, !225, !226}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !174, file: !175, line: 79, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !175, line: 54, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!78, !173, !182}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !183, line: 58, baseType: !123)
!183 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !174, file: !175, line: 80, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !175, line: 56, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!78, !173, !182, !182}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !174, file: !175, line: 81, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !175, line: 62, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!78, !173, !78, !182}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !174, file: !175, line: 82, baseType: !195, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !175, line: 58, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!12, !173, !199, !182, !182}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !174, file: !175, line: 83, baseType: !201, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !175, line: 60, baseType: !186)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !174, file: !175, line: 84, baseType: !203, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !175, line: 64, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !173, !78}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !174, file: !175, line: 87, baseType: !203, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !174, file: !175, line: 88, baseType: !178, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !174, file: !175, line: 92, baseType: !210, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !175, line: 66, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!78, !173, !123}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !174, file: !175, line: 93, baseType: !215, size: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !175, line: 68, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !173, !78, !123}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !174, file: !175, line: 99, baseType: !220, size: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !175, line: 70, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!12, !173, !78, !182}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !174, file: !175, line: 100, baseType: !182, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !175, line: 103, baseType: !173, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !174, file: !175, line: 104, baseType: !227, offset: 832)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, elements: !231)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !41, line: 20, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !43, line: 41, baseType: !230)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !{!232}
!232 = !DISubrange(count: -1)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !165, file: !166, line: 63, baseType: !234, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !78}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !165, file: !166, line: 65, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !166, line: 56, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !78, !78}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !98, file: !99, line: 108, baseType: !173, size: 64, offset: 1984)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !99, line: 109, baseType: !97, size: 64, offset: 2048)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !98, file: !99, line: 110, baseType: !78, size: 64, offset: 2112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !70, file: !71, line: 70, baseType: !78, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !70, file: !71, line: 72, baseType: !12, size: 32, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !70, file: !71, line: 82, baseType: !248, size: 64, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !250, line: 569, size: 14912, elements: !251)
!250 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!251 = !{!252, !253, !328, !329, !330, !331, !335, !336, !340, !341, !345, !357, !358, !359, !361, !362, !363, !425, !446, !447, !452, !459}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !249, file: !250, line: 571, baseType: !12, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !249, file: !250, line: 576, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !250, line: 287, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !250, line: 181, size: 1408, elements: !257)
!257 = !{!258, !261, !262, !263, !265, !266, !271, !272, !273, !280, !284, !289, !293, !294, !295, !296, !300, !304, !305, !306, !308, !309, !313, !327}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !256, file: !250, line: 182, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !256, file: !250, line: 183, baseType: !12, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !256, file: !250, line: 184, baseType: !12, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !256, file: !250, line: 185, baseType: !264, size: 16, offset: 128)
!264 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !256, file: !250, line: 186, baseType: !264, size: 16, offset: 144)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !256, file: !250, line: 187, baseType: !267, size: 128, offset: 192)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !250, line: 117, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !267, file: !250, line: 118, baseType: !259, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !267, file: !250, line: 119, baseType: !12, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !256, file: !250, line: 188, baseType: !12, size: 32, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !256, file: !250, line: 195, baseType: !78, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !256, file: !250, line: 197, baseType: !274, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !248, !78, !279, !12}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !278, line: 145, baseType: !58)
!278 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !256, file: !250, line: 199, baseType: !281, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!277, !248, !78, !74, !12}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !256, file: !250, line: 202, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !248, !78, !288, !12}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !278, line: 114, baseType: !58)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !256, file: !250, line: 203, baseType: !290, size: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!12, !248, !78}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !256, file: !250, line: 206, baseType: !267, size: 128, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !256, file: !250, line: 207, baseType: !259, size: 64, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !256, file: !250, line: 208, baseType: !12, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !256, file: !250, line: 211, baseType: !297, size: 24, offset: 928)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 24, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !256, file: !250, line: 212, baseType: !301, size: 8, offset: 952)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 8, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !256, file: !250, line: 215, baseType: !267, size: 128, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !256, file: !250, line: 218, baseType: !12, size: 32, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !256, file: !250, line: 219, baseType: !307, size: 64, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !278, line: 44, baseType: !58)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !256, file: !250, line: 222, baseType: !248, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !256, file: !250, line: 226, baseType: !310, size: 32, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !278, line: 175, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !312, line: 12, baseType: !12)
!312 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !256, file: !250, line: 228, baseType: !314, size: 64, offset: 1312)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !278, line: 171, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 163, size: 64, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !315, file: !278, line: 165, baseType: !12, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !315, file: !278, line: 170, baseType: !319, size: 32, offset: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !315, file: !278, line: 166, size: 32, elements: !320)
!320 = !{!321, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !319, file: !278, line: 168, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !183, line: 124, baseType: !5)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !319, file: !278, line: 169, baseType: !324, size: 32)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 4)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !256, file: !250, line: 229, baseType: !12, size: 32, offset: 1376)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !249, file: !250, line: 576, baseType: !254, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !249, file: !250, line: 576, baseType: !254, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !249, file: !250, line: 578, baseType: !12, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !249, file: !250, line: 579, baseType: !332, size: 200, offset: 288)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 200, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 25)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !249, file: !250, line: 582, baseType: !12, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !249, file: !250, line: 583, baseType: !337, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !339, line: 9, flags: DIFlagFwdDecl)
!339 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !249, file: !250, line: 585, baseType: !12, size: 32, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !249, file: !250, line: 587, baseType: !342, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !248}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !249, file: !250, line: 590, baseType: !346, size: 64, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !250, line: 47, size: 256, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !347, file: !250, line: 49, baseType: !346, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !347, file: !250, line: 50, baseType: !12, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !347, file: !250, line: 50, baseType: !12, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !347, file: !250, line: 50, baseType: !12, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !347, file: !250, line: 50, baseType: !12, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !347, file: !250, line: 51, baseType: !355, size: 32, offset: 192)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 32, elements: !302)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !250, line: 25, baseType: !5)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !249, file: !250, line: 591, baseType: !12, size: 32, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !249, file: !250, line: 592, baseType: !346, size: 64, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !249, file: !250, line: 593, baseType: !360, size: 64, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !249, file: !250, line: 596, baseType: !12, size: 32, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !249, file: !250, line: 597, baseType: !279, size: 64, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !249, file: !250, line: 632, baseType: !364, size: 2880, offset: 1152)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !250, line: 599, size: 2880, elements: !365)
!365 = !{!366, !416}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !364, file: !250, line: 622, baseType: !367, size: 1728)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !250, line: 601, size: 1728, elements: !368)
!368 = !{!369, !370, !371, !375, !387, !388, !390, !398, !399, !400, !401, !405, !409, !410, !411, !412, !413, !414, !415}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !367, file: !250, line: 603, baseType: !5, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !367, file: !250, line: 604, baseType: !279, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !367, file: !250, line: 605, baseType: !372, size: 208, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 208, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 26)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !367, file: !250, line: 606, baseType: !376, size: 288, offset: 352)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !250, line: 55, size: 288, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !376, file: !250, line: 57, baseType: !12, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !376, file: !250, line: 58, baseType: !12, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !376, file: !250, line: 59, baseType: !12, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !376, file: !250, line: 60, baseType: !12, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !376, file: !250, line: 61, baseType: !12, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !376, file: !250, line: 62, baseType: !12, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !376, file: !250, line: 63, baseType: !12, size: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !376, file: !250, line: 64, baseType: !12, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !376, file: !250, line: 65, baseType: !12, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !367, file: !250, line: 607, baseType: !12, size: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !367, file: !250, line: 608, baseType: !389, size: 64, offset: 704)
!389 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !367, file: !250, line: 609, baseType: !391, size: 112, offset: 768)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !250, line: 319, size: 112, elements: !392)
!392 = !{!393, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !391, file: !250, line: 320, baseType: !394, size: 48)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 48, elements: !298)
!395 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !391, file: !250, line: 321, baseType: !394, size: 48, offset: 48)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !391, file: !250, line: 322, baseType: !395, size: 16, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !367, file: !250, line: 610, baseType: !314, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !367, file: !250, line: 611, baseType: !314, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !367, file: !250, line: 612, baseType: !314, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !367, file: !250, line: 613, baseType: !402, size: 64, offset: 1088)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !367, file: !250, line: 614, baseType: !406, size: 192, offset: 1152)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 24)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !367, file: !250, line: 615, baseType: !12, size: 32, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !367, file: !250, line: 616, baseType: !314, size: 64, offset: 1376)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !367, file: !250, line: 617, baseType: !314, size: 64, offset: 1440)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !367, file: !250, line: 618, baseType: !314, size: 64, offset: 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !367, file: !250, line: 619, baseType: !314, size: 64, offset: 1568)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !367, file: !250, line: 620, baseType: !314, size: 64, offset: 1632)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !367, file: !250, line: 621, baseType: !12, size: 32, offset: 1696)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !364, file: !250, line: 631, baseType: !417, size: 2880)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !250, line: 626, size: 2880, elements: !418)
!418 = !{!419, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !417, file: !250, line: 629, baseType: !420, size: 1920)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 1920, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 30)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !417, file: !250, line: 630, baseType: !424, size: 960, offset: 1920)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !421)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !249, file: !250, line: 636, baseType: !426, size: 64, offset: 4032)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !250, line: 93, size: 6336, elements: !428)
!428 = !{!429, !430, !431, !438}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !427, file: !250, line: 94, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !427, file: !250, line: 95, baseType: !12, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !427, file: !250, line: 97, baseType: !432, size: 2048, offset: 128)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 2048, elements: !436)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null}
!436 = !{!437}
!437 = !DISubrange(count: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !427, file: !250, line: 98, baseType: !439, size: 4160, offset: 2176)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !250, line: 74, size: 4160, elements: !440)
!440 = !{!441, !443, !444, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !439, file: !250, line: 75, baseType: !442, size: 2048)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 2048, elements: !436)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !439, file: !250, line: 76, baseType: !442, size: 2048, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !439, file: !250, line: 78, baseType: !356, size: 32, offset: 4096)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !439, file: !250, line: 81, baseType: !356, size: 32, offset: 4128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !249, file: !250, line: 637, baseType: !427, size: 6336, offset: 4096)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !249, file: !250, line: 641, baseType: !448, size: 64, offset: 10432)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !12}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !249, file: !250, line: 646, baseType: !453, size: 192, offset: 10496)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !250, line: 291, size: 192, elements: !454)
!454 = !{!455, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !453, file: !250, line: 293, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !453, file: !250, line: 294, baseType: !12, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !453, file: !250, line: 295, baseType: !254, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !249, file: !250, line: 648, baseType: !460, size: 4224, offset: 10688)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 4224, elements: !298)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !70, file: !71, line: 85, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !464)
!464 = !{!465, !469, !470, !477, !490}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !463, file: !4, line: 116, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !467, line: 64, baseType: !468)
!467 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !467, line: 63, baseType: !123)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !463, file: !4, line: 118, baseType: !466, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !463, file: !4, line: 120, baseType: !471, size: 128, offset: 128)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !472, line: 51, size: 128, elements: !473)
!472 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !472, line: 52, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !472, line: 53, baseType: !475, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !463, file: !4, line: 122, baseType: !478, size: 256, offset: 256)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !478, file: !4, line: 107, baseType: !3, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !478, file: !4, line: 109, baseType: !466, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !478, file: !4, line: 111, baseType: !483, size: 96, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !467, line: 72, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 68, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !484, file: !467, line: 69, baseType: !12, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !484, file: !467, line: 70, baseType: !12, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !484, file: !467, line: 71, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !467, line: 61, baseType: !12)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !463, file: !4, line: 124, baseType: !471, size: 128, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !65, file: !61, line: 38, baseType: !492, size: 64, offset: 128)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !65, file: !61, line: 38, size: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !492, file: !61, line: 38, baseType: !64, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !60, file: !61, line: 42, baseType: !496, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !51, file: !50, line: 71, baseType: !12, size: 32, offset: 192)
!498 = !DILocalVariable(name: "err", scope: !47, file: !1, line: 139, type: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !11, line: 96, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !39, line: 126, baseType: !228)
!501 = !DILocation(line: 135, column: 18, scope: !35)
!502 = !DILocation(line: 137, column: 10, scope: !48)
!503 = !DILocation(line: 137, column: 7, scope: !35)
!504 = !DILocation(line: 138, column: 5, scope: !47)
!505 = !DILocation(line: 138, column: 15, scope: !47)
!506 = !DILocation(line: 139, column: 17, scope: !47)
!507 = !DILocation(line: 139, column: 11, scope: !47)
!508 = !DILocation(line: 140, column: 13, scope: !509)
!509 = distinct !DILexicalBlock(scope: !47, file: !1, line: 140, column: 9)
!510 = !DILocation(line: 140, column: 9, scope: !47)
!511 = !DILocation(line: 141, column: 7, scope: !512)
!512 = distinct !DILexicalBlock(scope: !509, file: !1, line: 140, column: 24)
!513 = !DILocation(line: 142, column: 7, scope: !512)
!514 = !DILocation(line: 143, column: 5, scope: !512)
!515 = !DILocation(line: 144, column: 3, scope: !48)
!516 = !DILocation(line: 144, column: 3, scope: !47)
!517 = !DILocation(line: 145, column: 1, scope: !35)
