; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !6, !9, !38, !39, !54, !64, !73}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !11, line: 80, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !11, line: 73, size: 320, elements: !13)
!13 = !{!14, !31, !32, !34, !35, !37}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !12, file: !11, line: 74, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !11, line: 55, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !11, line: 44, size: 256, elements: !18)
!18 = !{!19, !21, !22, !23, !25, !26, !27, !28, !29, !30}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !17, file: !11, line: 45, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !11, line: 46, baseType: !20, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !17, file: !11, line: 47, baseType: !7, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !17, file: !11, line: 48, baseType: !24, size: 32, offset: 192)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !17, file: !11, line: 49, baseType: !24, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !17, file: !11, line: 50, baseType: !24, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !17, file: !11, line: 51, baseType: !24, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !17, file: !11, line: 52, baseType: !24, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !17, file: !11, line: 53, baseType: !24, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !17, file: !11, line: 54, baseType: !24, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !12, file: !11, line: 75, baseType: !15, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !12, file: !11, line: 76, baseType: !33, size: 64, offset: 128)
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !11, line: 77, baseType: !33, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !12, file: !11, line: 78, baseType: !36, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !12, file: !11, line: 79, baseType: !24, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !41, line: 51, size: 24, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !48, !49, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !41, line: 52, baseType: !44, size: 8)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 43, baseType: !8)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !41, line: 53, baseType: !44, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !41, line: 54, baseType: !8, size: 8, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !41, line: 55, baseType: !51, offset: 24)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: -1)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !41, line: 57, size: 40, elements: !56)
!56 = !{!57, !61, !62, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !41, line: 58, baseType: !58, size: 16)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 36, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !47, line: 57, baseType: !60)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !55, file: !41, line: 59, baseType: !58, size: 16, offset: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !41, line: 60, baseType: !8, size: 8, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !55, file: !41, line: 61, baseType: !51, offset: 40)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !41, line: 63, size: 72, elements: !66)
!66 = !{!67, !70, !71, !72}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !41, line: 64, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 48, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 79, baseType: !24)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !65, file: !41, line: 65, baseType: !68, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !41, line: 66, baseType: !8, size: 8, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !65, file: !41, line: 67, baseType: !51, offset: 72)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !41, line: 69, size: 136, elements: !75)
!75 = !{!76, !79, !80, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !41, line: 70, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 60, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !47, line: 105, baseType: !33)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !74, file: !41, line: 71, baseType: !77, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !41, line: 72, baseType: !8, size: 8, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !74, file: !41, line: 73, baseType: !51, offset: 136)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!86 = distinct !DISubprogram(name: "listTypePush", scope: !1, file: !1, line: 41, type: !87, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !99)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !89, !36}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !91, line: 622, baseType: !92)
!91 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !91, line: 614, size: 128, elements: !93)
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !91, line: 615, baseType: !24, size: 4, flags: DIFlagBitField, extraData: i64 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !92, file: !91, line: 616, baseType: !24, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !92, file: !91, line: 617, baseType: !24, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !92, file: !91, line: 620, baseType: !36, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, file: !91, line: 621, baseType: !38, size: 64, offset: 64)
!99 = !{!100, !101, !102, !103, !106}
!100 = !DILocalVariable(name: "subject", arg: 1, scope: !86, file: !1, line: 41, type: !89)
!101 = !DILocalVariable(name: "value", arg: 2, scope: !86, file: !1, line: 41, type: !89)
!102 = !DILocalVariable(name: "where", arg: 3, scope: !86, file: !1, line: 41, type: !36)
!103 = !DILocalVariable(name: "pos", scope: !104, file: !1, line: 43, type: !36)
!104 = distinct !DILexicalBlock(scope: !105, file: !1, line: 42, column: 54)
!105 = distinct !DILexicalBlock(scope: !86, file: !1, line: 42, column: 9)
!106 = !DILocalVariable(name: "len", scope: !104, file: !1, line: 45, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 40, baseType: !109)
!108 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !110, line: 129, baseType: !33)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!111 = !DILocation(line: 41, column: 25, scope: !86)
!112 = !DILocation(line: 41, column: 40, scope: !86)
!113 = !DILocation(line: 41, column: 51, scope: !86)
!114 = !DILocation(line: 42, column: 18, scope: !105)
!115 = !DILocation(line: 42, column: 27, scope: !105)
!116 = !DILocation(line: 42, column: 9, scope: !86)
!117 = !DILocation(line: 43, column: 26, scope: !104)
!118 = !DILocation(line: 43, column: 19, scope: !104)
!119 = !DILocation(line: 43, column: 13, scope: !104)
!120 = !DILocation(line: 44, column: 17, scope: !104)
!121 = !DILocation(line: 45, column: 36, scope: !104)
!122 = !{!123, !127, i64 8}
!123 = !{!"redisObject", !124, i64 0, !124, i64 0, !124, i64 1, !124, i64 4, !127, i64 8}
!124 = !{!"int", !125, i64 0}
!125 = !{!"omnipotent char", !126, i64 0}
!126 = !{!"Simple C/C++ TBAA"}
!127 = !{!"any pointer", !125, i64 0}
!128 = !DILocalVariable(name: "s", arg: 1, scope: !129, file: !41, line: 87, type: !134)
!129 = distinct !DISubprogram(name: "sdslen", scope: !41, file: !41, line: 87, type: !130, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !136)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 58, baseType: !33)
!133 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !41, line: 43, baseType: !4)
!136 = !{!128, !137}
!137 = !DILocalVariable(name: "flags", scope: !129, file: !41, line: 88, type: !8)
!138 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !139)
!139 = distinct !DILocation(line: 45, column: 22, scope: !104)
!140 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !139)
!141 = !{!125, !125, i64 0}
!142 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !139)
!143 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !139)
!144 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !139)
!145 = distinct !DILexicalBlock(scope: !129, file: !41, line: 89, column: 33)
!146 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !139)
!147 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !139)
!148 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !139)
!149 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !139)
!150 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !139)
!151 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !139)
!152 = !{!153, !153, i64 0}
!153 = !{!"short", !125, i64 0}
!154 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !139)
!155 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !139)
!156 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !139)
!157 = !{!124, !124, i64 0}
!158 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !139)
!159 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !139)
!160 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !139)
!161 = !{!162, !162, i64 0}
!162 = !{!"long", !125, i64 0}
!163 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !139)
!164 = !DILocation(line: 0, scope: !145, inlinedAt: !139)
!165 = !DILocation(line: 102, column: 1, scope: !129, inlinedAt: !139)
!166 = !DILocation(line: 45, column: 16, scope: !104)
!167 = !DILocation(line: 46, column: 32, scope: !104)
!168 = !DILocation(line: 46, column: 9, scope: !104)
!169 = !DILocation(line: 47, column: 9, scope: !104)
!170 = !DILocation(line: 51, column: 1, scope: !86)
!171 = !DILocation(line: 49, column: 9, scope: !172)
!172 = distinct !DILexicalBlock(scope: !105, file: !1, line: 48, column: 12)
!173 = distinct !DISubprogram(name: "listPopSaver", scope: !1, file: !1, line: 53, type: !174, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{!38, !7, !24}
!176 = !{!177, !178}
!177 = !DILocalVariable(name: "data", arg: 1, scope: !173, file: !1, line: 53, type: !7)
!178 = !DILocalVariable(name: "sz", arg: 2, scope: !173, file: !1, line: 53, type: !24)
!179 = !DILocation(line: 53, column: 35, scope: !173)
!180 = !DILocation(line: 53, column: 54, scope: !173)
!181 = !DILocation(line: 54, column: 43, scope: !173)
!182 = !DILocation(line: 54, column: 12, scope: !173)
!183 = !DILocation(line: 54, column: 5, scope: !173)
!184 = distinct !DISubprogram(name: "listTypePop", scope: !1, file: !1, line: 57, type: !185, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !187)
!185 = !DISubroutineType(types: !186)
!186 = !{!89, !89, !36}
!187 = !{!188, !189, !190, !192, !193}
!188 = !DILocalVariable(name: "subject", arg: 1, scope: !184, file: !1, line: 57, type: !89)
!189 = !DILocalVariable(name: "where", arg: 2, scope: !184, file: !1, line: 57, type: !36)
!190 = !DILocalVariable(name: "vlong", scope: !184, file: !1, line: 58, type: !191)
!191 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!192 = !DILocalVariable(name: "value", scope: !184, file: !1, line: 59, type: !89)
!193 = !DILocalVariable(name: "ql_where", scope: !184, file: !1, line: 61, type: !36)
!194 = !DILocation(line: 57, column: 25, scope: !184)
!195 = !DILocation(line: 57, column: 38, scope: !184)
!196 = !DILocation(line: 58, column: 5, scope: !184)
!197 = !DILocation(line: 59, column: 5, scope: !184)
!198 = !DILocation(line: 59, column: 11, scope: !184)
!199 = !{!127, !127, i64 0}
!200 = !DILocation(line: 62, column: 18, scope: !201)
!201 = distinct !DILexicalBlock(scope: !184, file: !1, line: 62, column: 9)
!202 = !DILocation(line: 62, column: 27, scope: !201)
!203 = !DILocation(line: 62, column: 9, scope: !184)
!204 = !DILocation(line: 61, column: 26, scope: !184)
!205 = !DILocation(line: 61, column: 20, scope: !184)
!206 = !DILocation(line: 61, column: 9, scope: !184)
!207 = !DILocation(line: 63, column: 41, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !1, line: 63, column: 13)
!209 = distinct !DILexicalBlock(scope: !201, file: !1, line: 62, column: 54)
!210 = !DILocation(line: 63, column: 56, scope: !208)
!211 = !DILocation(line: 58, column: 15, scope: !184)
!212 = !DILocation(line: 63, column: 13, scope: !208)
!213 = !DILocation(line: 65, column: 18, scope: !214)
!214 = distinct !DILexicalBlock(scope: !215, file: !1, line: 65, column: 17)
!215 = distinct !DILexicalBlock(scope: !208, file: !1, line: 64, column: 61)
!216 = !DILocation(line: 63, column: 13, scope: !209)
!217 = !DILocation(line: 66, column: 56, scope: !214)
!218 = !{!219, !219, i64 0}
!219 = !{!"long long", !125, i64 0}
!220 = !DILocation(line: 66, column: 25, scope: !214)
!221 = !DILocation(line: 66, column: 23, scope: !214)
!222 = !DILocation(line: 66, column: 17, scope: !214)
!223 = !DILocation(line: 69, column: 9, scope: !224)
!224 = distinct !DILexicalBlock(scope: !201, file: !1, line: 68, column: 12)
!225 = !DILocation(line: 71, column: 12, scope: !184)
!226 = !DILocation(line: 72, column: 1, scope: !184)
!227 = !DILocation(line: 71, column: 5, scope: !184)
!228 = distinct !DISubprogram(name: "listTypeLength", scope: !1, file: !1, line: 74, type: !229, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !233)
!229 = !DISubroutineType(types: !230)
!230 = !{!33, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!233 = !{!234}
!234 = !DILocalVariable(name: "subject", arg: 1, scope: !228, file: !1, line: 74, type: !231)
!235 = !DILocation(line: 74, column: 42, scope: !228)
!236 = !DILocation(line: 75, column: 18, scope: !237)
!237 = distinct !DILexicalBlock(scope: !228, file: !1, line: 75, column: 9)
!238 = !DILocation(line: 75, column: 27, scope: !237)
!239 = !DILocation(line: 75, column: 9, scope: !228)
!240 = !DILocation(line: 76, column: 40, scope: !241)
!241 = distinct !DILexicalBlock(scope: !237, file: !1, line: 75, column: 54)
!242 = !DILocation(line: 76, column: 16, scope: !241)
!243 = !DILocation(line: 76, column: 9, scope: !241)
!244 = !DILocation(line: 78, column: 9, scope: !245)
!245 = distinct !DILexicalBlock(scope: !237, file: !1, line: 77, column: 12)
!246 = distinct !DISubprogram(name: "listTypeInitIterator", scope: !1, file: !1, line: 83, type: !247, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !269)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !89, !267, !8}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeIterator", file: !91, line: 1347, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 1342, size: 192, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !251, file: !91, line: 1343, baseType: !89, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !251, file: !91, line: 1344, baseType: !8, size: 8, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !251, file: !91, line: 1345, baseType: !8, size: 8, offset: 72)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !251, file: !91, line: 1346, baseType: !257, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistIter", file: !11, line: 88, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistIter", file: !11, line: 82, size: 320, elements: !260)
!260 = !{!261, !264, !265, !266, !268}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !259, file: !11, line: 83, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !259, file: !11, line: 84, baseType: !15, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !259, file: !11, line: 85, baseType: !7, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !259, file: !11, line: 86, baseType: !267, size: 64, offset: 192)
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !259, file: !11, line: 87, baseType: !36, size: 32, offset: 256)
!269 = !{!270, !271, !272, !273, !274}
!270 = !DILocalVariable(name: "subject", arg: 1, scope: !246, file: !1, line: 83, type: !89)
!271 = !DILocalVariable(name: "index", arg: 2, scope: !246, file: !1, line: 83, type: !267)
!272 = !DILocalVariable(name: "direction", arg: 3, scope: !246, file: !1, line: 84, type: !8)
!273 = !DILocalVariable(name: "li", scope: !246, file: !1, line: 85, type: !249)
!274 = !DILocalVariable(name: "iter_direction", scope: !246, file: !1, line: 92, type: !36)
!275 = !DILocation(line: 83, column: 46, scope: !246)
!276 = !DILocation(line: 83, column: 60, scope: !246)
!277 = !DILocation(line: 84, column: 54, scope: !246)
!278 = !DILocation(line: 85, column: 28, scope: !246)
!279 = !DILocation(line: 86, column: 9, scope: !246)
!280 = !DILocation(line: 86, column: 17, scope: !246)
!281 = !{!282, !127, i64 0}
!282 = !{!"", !127, i64 0, !125, i64 8, !125, i64 9, !127, i64 16}
!283 = !DILocation(line: 87, column: 29, scope: !246)
!284 = !DILocation(line: 87, column: 20, scope: !246)
!285 = !DILocation(line: 87, column: 9, scope: !246)
!286 = !DILocation(line: 87, column: 18, scope: !246)
!287 = !{!282, !125, i64 8}
!288 = !DILocation(line: 88, column: 9, scope: !246)
!289 = !DILocation(line: 88, column: 19, scope: !246)
!290 = !{!282, !125, i64 9}
!291 = !DILocation(line: 89, column: 9, scope: !246)
!292 = !DILocation(line: 89, column: 14, scope: !246)
!293 = !{!282, !127, i64 16}
!294 = !DILocation(line: 94, column: 22, scope: !295)
!295 = distinct !DILexicalBlock(scope: !246, file: !1, line: 94, column: 9)
!296 = !DILocation(line: 94, column: 9, scope: !246)
!297 = !DILocation(line: 93, column: 19, scope: !246)
!298 = !DILocation(line: 93, column: 9, scope: !246)
!299 = !DILocation(line: 92, column: 9, scope: !246)
!300 = !DILocation(line: 85, column: 23, scope: !246)
!301 = !DILocation(line: 95, column: 59, scope: !302)
!302 = distinct !DILexicalBlock(scope: !295, file: !1, line: 94, column: 49)
!303 = !DILocation(line: 95, column: 20, scope: !302)
!304 = !DILocation(line: 95, column: 18, scope: !302)
!305 = !DILocation(line: 100, column: 5, scope: !246)
!306 = !DILocation(line: 98, column: 9, scope: !307)
!307 = distinct !DILexicalBlock(scope: !295, file: !1, line: 97, column: 12)
!308 = distinct !DISubprogram(name: "listTypeReleaseIterator", scope: !1, file: !1, line: 104, type: !309, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !311)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !249}
!311 = !{!312}
!312 = !DILocalVariable(name: "li", arg: 1, scope: !308, file: !1, line: 104, type: !249)
!313 = !DILocation(line: 104, column: 48, scope: !308)
!314 = !DILocation(line: 105, column: 15, scope: !308)
!315 = !DILocation(line: 105, column: 5, scope: !308)
!316 = !DILocation(line: 106, column: 11, scope: !308)
!317 = !DILocation(line: 106, column: 5, scope: !308)
!318 = !DILocation(line: 107, column: 1, scope: !308)
!319 = distinct !DISubprogram(name: "listTypeNext", scope: !1, file: !1, line: 112, type: !320, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !338)
!320 = !DISubroutineType(types: !321)
!321 = !{!36, !249, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeEntry", file: !91, line: 1353, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 1350, size: 448, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "li", scope: !324, file: !91, line: 1351, baseType: !249, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !324, file: !91, line: 1352, baseType: !328, size: 384, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistEntry", file: !11, line: 98, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistEntry", file: !11, line: 90, size: 384, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !329, file: !11, line: 91, baseType: !262, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !329, file: !11, line: 92, baseType: !15, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !329, file: !11, line: 93, baseType: !7, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !329, file: !11, line: 94, baseType: !7, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "longval", scope: !329, file: !11, line: 95, baseType: !191, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !329, file: !11, line: 96, baseType: !24, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !329, file: !11, line: 97, baseType: !36, size: 32, offset: 352)
!338 = !{!339, !340}
!339 = !DILocalVariable(name: "li", arg: 1, scope: !319, file: !1, line: 112, type: !249)
!340 = !DILocalVariable(name: "entry", arg: 2, scope: !319, file: !1, line: 112, type: !322)
!341 = !DILocation(line: 112, column: 36, scope: !319)
!342 = !DILocation(line: 112, column: 55, scope: !319)
!343 = !DILocation(line: 114, column: 5, scope: !319)
!344 = !DILocation(line: 116, column: 12, scope: !319)
!345 = !DILocation(line: 116, column: 15, scope: !319)
!346 = !{!347, !127, i64 0}
!347 = !{!"", !127, i64 0, !348, i64 8}
!348 = !{!"quicklistEntry", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !219, i64 32, !124, i64 40, !124, i64 44}
!349 = !DILocation(line: 117, column: 22, scope: !350)
!350 = distinct !DILexicalBlock(scope: !319, file: !1, line: 117, column: 9)
!351 = !DILocation(line: 117, column: 9, scope: !319)
!352 = !DILocation(line: 118, column: 34, scope: !353)
!353 = distinct !DILexicalBlock(scope: !350, file: !1, line: 117, column: 49)
!354 = !DILocation(line: 118, column: 48, scope: !353)
!355 = !DILocation(line: 118, column: 16, scope: !353)
!356 = !DILocation(line: 118, column: 9, scope: !353)
!357 = !DILocation(line: 120, column: 9, scope: !358)
!358 = distinct !DILexicalBlock(scope: !350, file: !1, line: 119, column: 12)
!359 = distinct !DISubprogram(name: "listTypeGet", scope: !1, file: !1, line: 126, type: !360, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{!89, !322}
!362 = !{!363, !364}
!363 = !DILocalVariable(name: "entry", arg: 1, scope: !359, file: !1, line: 126, type: !322)
!364 = !DILocalVariable(name: "value", scope: !359, file: !1, line: 127, type: !89)
!365 = !DILocation(line: 126, column: 34, scope: !359)
!366 = !DILocation(line: 127, column: 11, scope: !359)
!367 = !DILocation(line: 128, column: 16, scope: !368)
!368 = distinct !DILexicalBlock(scope: !359, file: !1, line: 128, column: 9)
!369 = !DILocation(line: 128, column: 20, scope: !368)
!370 = !DILocation(line: 128, column: 29, scope: !368)
!371 = !DILocation(line: 128, column: 9, scope: !359)
!372 = !DILocation(line: 129, column: 26, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !1, line: 129, column: 13)
!374 = distinct !DILexicalBlock(scope: !368, file: !1, line: 128, column: 56)
!375 = !{!347, !127, i64 32}
!376 = !DILocation(line: 129, column: 13, scope: !373)
!377 = !DILocation(line: 129, column: 13, scope: !374)
!378 = !DILocation(line: 131, column: 53, scope: !379)
!379 = distinct !DILexicalBlock(scope: !373, file: !1, line: 129, column: 33)
!380 = !{!347, !124, i64 48}
!381 = !DILocation(line: 131, column: 40, scope: !379)
!382 = !DILocation(line: 130, column: 21, scope: !379)
!383 = !DILocation(line: 132, column: 9, scope: !379)
!384 = !DILocation(line: 133, column: 65, scope: !385)
!385 = distinct !DILexicalBlock(scope: !373, file: !1, line: 132, column: 16)
!386 = !{!347, !219, i64 40}
!387 = !DILocation(line: 133, column: 21, scope: !385)
!388 = !DILocation(line: 136, column: 9, scope: !389)
!389 = distinct !DILexicalBlock(scope: !368, file: !1, line: 135, column: 12)
!390 = !DILocation(line: 0, scope: !385)
!391 = !DILocation(line: 138, column: 5, scope: !359)
!392 = distinct !DISubprogram(name: "listTypeInsert", scope: !1, file: !1, line: 141, type: !393, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !322, !89, !36}
!395 = !{!396, !397, !398, !399, !402}
!396 = !DILocalVariable(name: "entry", arg: 1, scope: !392, file: !1, line: 141, type: !322)
!397 = !DILocalVariable(name: "value", arg: 2, scope: !392, file: !1, line: 141, type: !89)
!398 = !DILocalVariable(name: "where", arg: 3, scope: !392, file: !1, line: 141, type: !36)
!399 = !DILocalVariable(name: "str", scope: !400, file: !1, line: 144, type: !135)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 142, column: 56)
!401 = distinct !DILexicalBlock(scope: !392, file: !1, line: 142, column: 9)
!402 = !DILocalVariable(name: "len", scope: !400, file: !1, line: 145, type: !107)
!403 = !DILocation(line: 141, column: 36, scope: !392)
!404 = !DILocation(line: 141, column: 49, scope: !392)
!405 = !DILocation(line: 141, column: 60, scope: !392)
!406 = !DILocation(line: 142, column: 16, scope: !401)
!407 = !DILocation(line: 142, column: 20, scope: !401)
!408 = !DILocation(line: 142, column: 29, scope: !401)
!409 = !DILocation(line: 142, column: 9, scope: !392)
!410 = !DILocation(line: 143, column: 17, scope: !400)
!411 = !DILocation(line: 144, column: 26, scope: !400)
!412 = !DILocation(line: 144, column: 13, scope: !400)
!413 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !414)
!414 = distinct !DILocation(line: 145, column: 22, scope: !400)
!415 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !414)
!416 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !414)
!417 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !414)
!418 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !414)
!419 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !414)
!420 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !414)
!421 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !414)
!422 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !414)
!423 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !414)
!424 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !414)
!425 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !414)
!426 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !414)
!427 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !414)
!428 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !414)
!429 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !414)
!430 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !414)
!431 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !414)
!432 = !DILocation(line: 0, scope: !145, inlinedAt: !414)
!433 = !DILocation(line: 102, column: 1, scope: !129, inlinedAt: !414)
!434 = !DILocation(line: 145, column: 16, scope: !400)
!435 = !DILocation(line: 146, column: 13, scope: !400)
!436 = !DILocation(line: 147, column: 54, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !1, line: 146, column: 33)
!438 = distinct !DILexicalBlock(scope: !400, file: !1, line: 146, column: 13)
!439 = !DILocation(line: 147, column: 60, scope: !437)
!440 = !{!347, !127, i64 8}
!441 = !DILocation(line: 147, column: 13, scope: !437)
!442 = !DILocation(line: 149, column: 9, scope: !437)
!443 = !DILocation(line: 150, column: 55, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 149, column: 40)
!445 = distinct !DILexicalBlock(scope: !438, file: !1, line: 149, column: 20)
!446 = !DILocation(line: 150, column: 61, scope: !444)
!447 = !DILocation(line: 150, column: 13, scope: !444)
!448 = !DILocation(line: 152, column: 9, scope: !444)
!449 = !DILocation(line: 153, column: 9, scope: !400)
!450 = !DILocation(line: 157, column: 1, scope: !392)
!451 = !DILocation(line: 155, column: 9, scope: !452)
!452 = distinct !DILexicalBlock(scope: !401, file: !1, line: 154, column: 12)
!453 = distinct !DISubprogram(name: "listTypeEqual", scope: !1, file: !1, line: 160, type: !454, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!36, !322, !89}
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "entry", arg: 1, scope: !453, file: !1, line: 160, type: !322)
!458 = !DILocalVariable(name: "o", arg: 2, scope: !453, file: !1, line: 160, type: !89)
!459 = !DILocation(line: 160, column: 34, scope: !453)
!460 = !DILocation(line: 160, column: 47, scope: !453)
!461 = !DILocation(line: 161, column: 16, scope: !462)
!462 = distinct !DILexicalBlock(scope: !453, file: !1, line: 161, column: 9)
!463 = !DILocation(line: 161, column: 20, scope: !462)
!464 = !DILocation(line: 161, column: 29, scope: !462)
!465 = !DILocation(line: 161, column: 9, scope: !453)
!466 = !DILocation(line: 162, column: 9, scope: !467)
!467 = distinct !DILexicalBlock(scope: !462, file: !1, line: 161, column: 56)
!468 = !DILocation(line: 163, column: 46, scope: !467)
!469 = !{!347, !127, i64 24}
!470 = !DILocation(line: 163, column: 52, scope: !467)
!471 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !472)
!472 = distinct !DILocation(line: 163, column: 56, scope: !467)
!473 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !472)
!474 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !472)
!475 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !472)
!476 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !472)
!477 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !472)
!478 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !472)
!479 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !472)
!480 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !472)
!481 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !472)
!482 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !472)
!483 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !472)
!484 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !472)
!485 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !472)
!486 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !472)
!487 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !472)
!488 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !472)
!489 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !472)
!490 = !DILocation(line: 0, scope: !145, inlinedAt: !472)
!491 = !DILocation(line: 102, column: 1, scope: !129, inlinedAt: !472)
!492 = !DILocation(line: 163, column: 56, scope: !467)
!493 = !DILocation(line: 163, column: 16, scope: !467)
!494 = !DILocation(line: 163, column: 9, scope: !467)
!495 = !DILocation(line: 165, column: 9, scope: !496)
!496 = distinct !DILexicalBlock(scope: !462, file: !1, line: 164, column: 12)
!497 = distinct !DISubprogram(name: "listTypeDelete", scope: !1, file: !1, line: 170, type: !498, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !249, !322}
!500 = !{!501, !502}
!501 = !DILocalVariable(name: "iter", arg: 1, scope: !497, file: !1, line: 170, type: !249)
!502 = !DILocalVariable(name: "entry", arg: 2, scope: !497, file: !1, line: 170, type: !322)
!503 = !DILocation(line: 170, column: 39, scope: !497)
!504 = !DILocation(line: 170, column: 60, scope: !497)
!505 = !DILocation(line: 171, column: 16, scope: !506)
!506 = distinct !DILexicalBlock(scope: !497, file: !1, line: 171, column: 9)
!507 = !DILocation(line: 171, column: 20, scope: !506)
!508 = !DILocation(line: 171, column: 29, scope: !506)
!509 = !DILocation(line: 171, column: 9, scope: !497)
!510 = !DILocation(line: 172, column: 33, scope: !511)
!511 = distinct !DILexicalBlock(scope: !506, file: !1, line: 171, column: 56)
!512 = !DILocation(line: 172, column: 47, scope: !511)
!513 = !DILocation(line: 172, column: 9, scope: !511)
!514 = !DILocation(line: 176, column: 1, scope: !497)
!515 = !DILocation(line: 174, column: 9, scope: !516)
!516 = distinct !DILexicalBlock(scope: !506, file: !1, line: 173, column: 12)
!517 = distinct !DISubprogram(name: "listTypeConvert", scope: !1, file: !1, line: 179, type: !518, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !89, !36}
!520 = !{!521, !522, !523, !526}
!521 = !DILocalVariable(name: "subject", arg: 1, scope: !517, file: !1, line: 179, type: !89)
!522 = !DILocalVariable(name: "enc", arg: 2, scope: !517, file: !1, line: 179, type: !36)
!523 = !DILocalVariable(name: "zlen", scope: !524, file: !1, line: 184, type: !107)
!524 = distinct !DILexicalBlock(scope: !525, file: !1, line: 183, column: 40)
!525 = distinct !DILexicalBlock(scope: !517, file: !1, line: 183, column: 9)
!526 = !DILocalVariable(name: "depth", scope: !524, file: !1, line: 185, type: !36)
!527 = !DILocation(line: 179, column: 28, scope: !517)
!528 = !DILocation(line: 179, column: 41, scope: !517)
!529 = !DILocation(line: 180, column: 5, scope: !517)
!530 = !DILocation(line: 181, column: 5, scope: !517)
!531 = !DILocation(line: 183, column: 13, scope: !525)
!532 = !DILocation(line: 183, column: 9, scope: !517)
!533 = !DILocation(line: 184, column: 30, scope: !524)
!534 = !{!535, !124, i64 2864}
!535 = !{!"redisServer", !124, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !124, i64 32, !124, i64 36, !124, i64 40, !127, i64 48, !127, i64 56, !127, i64 64, !127, i64 72, !124, i64 80, !124, i64 84, !124, i64 88, !124, i64 92, !127, i64 96, !127, i64 104, !124, i64 112, !124, i64 116, !125, i64 120, !124, i64 164, !162, i64 168, !124, i64 176, !127, i64 184, !127, i64 192, !127, i64 200, !125, i64 208, !124, i64 216, !124, i64 220, !125, i64 224, !124, i64 352, !127, i64 360, !124, i64 368, !125, i64 372, !124, i64 436, !124, i64 440, !125, i64 444, !124, i64 508, !127, i64 512, !127, i64 520, !127, i64 528, !127, i64 536, !127, i64 544, !127, i64 552, !127, i64 560, !124, i64 568, !219, i64 576, !125, i64 584, !127, i64 840, !162, i64 848, !124, i64 856, !124, i64 860, !162, i64 864, !162, i64 872, !162, i64 880, !162, i64 888, !127, i64 896, !127, i64 904, !127, i64 912, !127, i64 920, !127, i64 928, !127, i64 936, !127, i64 944, !127, i64 952, !127, i64 960, !127, i64 968, !127, i64 976, !127, i64 984, !127, i64 992, !162, i64 1000, !219, i64 1008, !219, i64 1016, !219, i64 1024, !536, i64 1032, !219, i64 1040, !219, i64 1048, !219, i64 1056, !219, i64 1064, !219, i64 1072, !219, i64 1080, !219, i64 1088, !219, i64 1096, !219, i64 1104, !162, i64 1112, !219, i64 1120, !536, i64 1128, !219, i64 1136, !219, i64 1144, !219, i64 1152, !219, i64 1160, !127, i64 1168, !219, i64 1176, !219, i64 1184, !162, i64 1192, !537, i64 1200, !219, i64 1240, !219, i64 1248, !162, i64 1256, !162, i64 1264, !125, i64 1272, !124, i64 1728, !124, i64 1732, !124, i64 1736, !124, i64 1740, !124, i64 1744, !162, i64 1752, !124, i64 1760, !124, i64 1764, !124, i64 1768, !124, i64 1772, !162, i64 1776, !162, i64 1784, !124, i64 1792, !124, i64 1796, !124, i64 1800, !124, i64 1804, !125, i64 1808, !124, i64 1880, !124, i64 1884, !127, i64 1888, !124, i64 1896, !124, i64 1900, !162, i64 1904, !162, i64 1912, !162, i64 1920, !162, i64 1928, !124, i64 1936, !124, i64 1940, !127, i64 1944, !127, i64 1952, !124, i64 1960, !124, i64 1964, !162, i64 1968, !162, i64 1976, !162, i64 1984, !162, i64 1992, !124, i64 2000, !162, i64 2008, !124, i64 2016, !124, i64 2020, !124, i64 2024, !124, i64 2028, !124, i64 2032, !124, i64 2036, !124, i64 2040, !124, i64 2044, !124, i64 2048, !124, i64 2052, !124, i64 2056, !124, i64 2060, !124, i64 2064, !127, i64 2072, !219, i64 2080, !219, i64 2088, !124, i64 2096, !127, i64 2104, !124, i64 2112, !127, i64 2120, !124, i64 2128, !124, i64 2132, !162, i64 2136, !162, i64 2144, !162, i64 2152, !162, i64 2160, !124, i64 2168, !124, i64 2172, !124, i64 2176, !124, i64 2180, !124, i64 2184, !124, i64 2188, !125, i64 2192, !538, i64 2200, !539, i64 2224, !127, i64 2240, !124, i64 2248, !127, i64 2256, !124, i64 2264, !125, i64 2268, !125, i64 2309, !219, i64 2352, !219, i64 2360, !124, i64 2368, !124, i64 2372, !127, i64 2376, !219, i64 2384, !219, i64 2392, !219, i64 2400, !219, i64 2408, !162, i64 2416, !162, i64 2424, !124, i64 2432, !124, i64 2436, !124, i64 2440, !124, i64 2444, !124, i64 2448, !127, i64 2456, !127, i64 2464, !124, i64 2472, !124, i64 2476, !127, i64 2480, !127, i64 2488, !124, i64 2496, !124, i64 2500, !162, i64 2504, !162, i64 2512, !162, i64 2520, !124, i64 2528, !124, i64 2532, !127, i64 2536, !162, i64 2544, !124, i64 2552, !124, i64 2556, !124, i64 2560, !162, i64 2568, !124, i64 2576, !124, i64 2580, !124, i64 2584, !127, i64 2592, !125, i64 2600, !219, i64 2648, !124, i64 2656, !127, i64 2664, !127, i64 2672, !124, i64 2680, !127, i64 2688, !124, i64 2696, !124, i64 2700, !219, i64 2704, !124, i64 2712, !124, i64 2716, !124, i64 2720, !124, i64 2724, !219, i64 2728, !124, i64 2736, !125, i64 2740, !127, i64 2768, !127, i64 2776, !124, i64 2784, !124, i64 2788, !124, i64 2792, !124, i64 2796, !162, i64 2800, !162, i64 2808, !162, i64 2816, !162, i64 2824, !162, i64 2832, !162, i64 2840, !162, i64 2848, !162, i64 2856, !124, i64 2864, !124, i64 2868, !162, i64 2872, !162, i64 2880, !124, i64 2888, !219, i64 2896, !127, i64 2904, !127, i64 2912, !124, i64 2920, !124, i64 2924, !219, i64 2928, !127, i64 2936, !127, i64 2944, !124, i64 2952, !124, i64 2956, !124, i64 2960, !124, i64 2964, !127, i64 2968, !124, i64 2976, !124, i64 2980, !124, i64 2984, !127, i64 2992, !127, i64 3000, !127, i64 3008, !127, i64 3016, !219, i64 3024, !219, i64 3032, !219, i64 3040, !124, i64 3048, !124, i64 3052, !124, i64 3056, !124, i64 3060, !124, i64 3064, !124, i64 3068, !124, i64 3072, !124, i64 3076, !124, i64 3080, !124, i64 3084, !124, i64 3088, !219, i64 3096, !127, i64 3104, !127, i64 3112, !127, i64 3120, !124, i64 3128, !124, i64 3132, !124, i64 3136, !162, i64 3144, !127, i64 3152, !127, i64 3160, !127, i64 3168}
!536 = !{!"double", !125, i64 0}
!537 = !{!"malloc_stats", !162, i64 0, !162, i64 8, !162, i64 16, !162, i64 24, !162, i64 32}
!538 = !{!"", !124, i64 0, !162, i64 8, !219, i64 16}
!539 = !{!"redisOpArray", !127, i64 0, !124, i64 8}
!540 = !DILocation(line: 185, column: 28, scope: !524)
!541 = !{!535, !124, i64 2868}
!542 = !DILocation(line: 185, column: 13, scope: !524)
!543 = !DILocation(line: 186, column: 73, scope: !524)
!544 = !DILocation(line: 186, column: 24, scope: !524)
!545 = !DILocation(line: 186, column: 22, scope: !524)
!546 = !DILocation(line: 187, column: 27, scope: !524)
!547 = !DILocation(line: 191, column: 1, scope: !517)
!548 = !DILocation(line: 189, column: 9, scope: !549)
!549 = distinct !DILexicalBlock(scope: !525, file: !1, line: 188, column: 12)
!550 = distinct !DISubprogram(name: "pushGenericCommand", scope: !1, file: !1, line: 197, type: !551, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !779)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !553, !36}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !91, line: 780, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !91, line: 723, size: 135360, elements: !556)
!556 = !{!557, !558, !559, !662, !663, !664, !665, !666, !667, !668, !670, !694, !695, !696, !697, !698, !699, !701, !702, !705, !706, !707, !708, !709, !710, !711, !712, !717, !718, !719, !720, !721, !722, !723, !724, !728, !729, !733, !734, !750, !751, !768, !769, !770, !771, !772, !773, !774, !775}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !555, file: !91, line: 724, baseType: !77, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !555, file: !91, line: 725, baseType: !36, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !555, file: !91, line: 726, baseType: !560, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !91, line: 656, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !91, line: 647, size: 512, elements: !563)
!563 = !{!564, !627, !628, !629, !630, !631, !632, !633}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !562, file: !91, line: 648, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !567, line: 82, baseType: !568)
!567 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !567, line: 76, size: 768, elements: !569)
!569 = !{!570, !595, !596, !625, !626}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !568, file: !567, line: 77, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !567, line: 65, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !567, line: 58, size: 384, elements: !574)
!574 = !{!575, !581, !585, !586, !590, !594}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !573, file: !567, line: 59, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!77, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !573, file: !567, line: 60, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!38, !38, !579}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !573, file: !567, line: 61, baseType: !582, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !573, file: !567, line: 62, baseType: !587, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!36, !38, !579, !579}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !573, file: !567, line: 63, baseType: !591, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !38, !38}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !573, file: !567, line: 64, baseType: !591, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !568, file: !567, line: 78, baseType: !38, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !568, file: !567, line: 79, baseType: !597, size: 512, offset: 128)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 512, elements: !623)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !567, line: 74, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !567, line: 69, size: 256, elements: !600)
!600 = !{!601, !620, !621, !622}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !599, file: !567, line: 70, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !567, line: 56, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !567, line: 47, size: 192, elements: !606)
!606 = !{!607, !608, !618}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !605, file: !567, line: 48, baseType: !38, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !605, file: !567, line: 54, baseType: !609, size: 64, offset: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !567, line: 49, size: 64, elements: !610)
!610 = !{!611, !612, !613, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !609, file: !567, line: 50, baseType: !38, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !609, file: !567, line: 51, baseType: !77, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !609, file: !567, line: 52, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !45, line: 56, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !47, line: 103, baseType: !267)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !609, file: !567, line: 53, baseType: !617, size: 64)
!617 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !567, line: 55, baseType: !619, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !599, file: !567, line: 71, baseType: !33, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !599, file: !567, line: 72, baseType: !33, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !599, file: !567, line: 73, baseType: !33, size: 64, offset: 192)
!623 = !{!624}
!624 = !DISubrange(count: 2)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !568, file: !567, line: 80, baseType: !267, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !568, file: !567, line: 81, baseType: !33, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !562, file: !91, line: 649, baseType: !565, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !562, file: !91, line: 650, baseType: !565, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !562, file: !91, line: 651, baseType: !565, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !562, file: !91, line: 652, baseType: !565, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !562, file: !91, line: 653, baseType: !36, size: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !562, file: !91, line: 654, baseType: !191, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !562, file: !91, line: 655, baseType: !634, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !636, line: 54, baseType: !637)
!636 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !636, line: 47, size: 384, elements: !638)
!638 = !{!639, !648, !649, !653, !657, !661}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !637, file: !636, line: 48, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !636, line: 40, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !636, line: 36, size: 192, elements: !643)
!643 = !{!644, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !642, file: !636, line: 37, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !642, file: !636, line: 38, baseType: !645, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !642, file: !636, line: 39, baseType: !38, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !637, file: !636, line: 49, baseType: !640, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !637, file: !636, line: 50, baseType: !650, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!38, !38}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !637, file: !636, line: 51, baseType: !654, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !38}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !637, file: !636, line: 52, baseType: !658, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!36, !38, !38}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !637, file: !636, line: 53, baseType: !33, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !91, line: 727, baseType: !89, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !555, file: !91, line: 728, baseType: !135, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !555, file: !91, line: 729, baseType: !107, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !555, file: !91, line: 730, baseType: !135, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !555, file: !91, line: 734, baseType: !107, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !555, file: !91, line: 735, baseType: !36, size: 32, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !555, file: !91, line: 736, baseType: !669, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !555, file: !91, line: 737, baseType: !671, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !91, line: 1307, size: 640, elements: !673)
!673 = !{!674, !675, !680, !681, !682, !683, !689, !690, !691, !692, !693}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !91, line: 1308, baseType: !4, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !672, file: !91, line: 1309, baseType: !676, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !91, line: 1305, baseType: !678)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !553}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !672, file: !91, line: 1310, baseType: !36, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !672, file: !91, line: 1311, baseType: !4, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !672, file: !91, line: 1312, baseType: !36, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !672, file: !91, line: 1315, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !91, line: 1306, baseType: !686)
!686 = !DISubroutineType(types: !687)
!687 = !{!688, !671, !669, !36, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !672, file: !91, line: 1317, baseType: !36, size: 32, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !672, file: !91, line: 1318, baseType: !36, size: 32, offset: 416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !672, file: !91, line: 1319, baseType: !36, size: 32, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !672, file: !91, line: 1320, baseType: !191, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !672, file: !91, line: 1320, baseType: !191, size: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !555, file: !91, line: 737, baseType: !671, size: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !555, file: !91, line: 738, baseType: !36, size: 32, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !555, file: !91, line: 739, baseType: !36, size: 32, offset: 800)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !555, file: !91, line: 740, baseType: !267, size: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !555, file: !91, line: 741, baseType: !634, size: 64, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !555, file: !91, line: 742, baseType: !700, size: 64, offset: 960)
!700 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !555, file: !91, line: 743, baseType: !107, size: 64, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !555, file: !91, line: 745, baseType: !703, size: 64, offset: 1088)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !704, line: 34, baseType: !267)
!704 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !555, file: !91, line: 746, baseType: !703, size: 64, offset: 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !555, file: !91, line: 747, baseType: !703, size: 64, offset: 1216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !555, file: !91, line: 748, baseType: !36, size: 32, offset: 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !555, file: !91, line: 749, baseType: !36, size: 32, offset: 1312)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !555, file: !91, line: 750, baseType: !36, size: 32, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !555, file: !91, line: 751, baseType: !36, size: 32, offset: 1376)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !555, file: !91, line: 752, baseType: !36, size: 32, offset: 1408)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !555, file: !91, line: 753, baseType: !713, size: 64, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !714, line: 173, baseType: !715)
!714 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !110, line: 100, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !110, line: 44, baseType: !267)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !555, file: !91, line: 754, baseType: !713, size: 64, offset: 1536)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !555, file: !91, line: 755, baseType: !135, size: 64, offset: 1600)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !555, file: !91, line: 756, baseType: !191, size: 64, offset: 1664)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !555, file: !91, line: 757, baseType: !191, size: 64, offset: 1728)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !555, file: !91, line: 758, baseType: !191, size: 64, offset: 1792)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !555, file: !91, line: 759, baseType: !191, size: 64, offset: 1856)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !555, file: !91, line: 760, baseType: !191, size: 64, offset: 1920)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !555, file: !91, line: 763, baseType: !725, size: 328, offset: 1984)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 328, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 41)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !555, file: !91, line: 764, baseType: !36, size: 32, offset: 2336)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !555, file: !91, line: 765, baseType: !730, size: 368, offset: 2368)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 368, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 46)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !555, file: !91, line: 766, baseType: !36, size: 32, offset: 2752)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !555, file: !91, line: 767, baseType: !735, size: 256, offset: 2816)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !91, line: 673, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !91, line: 665, size: 256, elements: !737)
!737 = !{!738, !746, !747, !748, !749}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !736, file: !91, line: 666, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !91, line: 663, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !91, line: 659, size: 192, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !741, file: !91, line: 660, baseType: !669, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !741, file: !91, line: 661, baseType: !36, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !741, file: !91, line: 662, baseType: !671, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !736, file: !91, line: 667, baseType: !36, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !736, file: !91, line: 668, baseType: !36, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !736, file: !91, line: 671, baseType: !36, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !736, file: !91, line: 672, baseType: !703, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !555, file: !91, line: 768, baseType: !36, size: 32, offset: 3072)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !555, file: !91, line: 769, baseType: !752, size: 704, offset: 3136)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !91, line: 703, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !91, line: 677, size: 704, elements: !754)
!754 = !{!755, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !753, file: !91, line: 679, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !91, line: 52, baseType: !191)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !753, file: !91, line: 683, baseType: !565, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !753, file: !91, line: 685, baseType: !89, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !753, file: !91, line: 689, baseType: !107, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !753, file: !91, line: 690, baseType: !89, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !753, file: !91, line: 691, baseType: !89, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !753, file: !91, line: 692, baseType: !756, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !753, file: !91, line: 692, baseType: !756, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !753, file: !91, line: 693, baseType: !36, size: 32, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !753, file: !91, line: 696, baseType: !36, size: 32, offset: 544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !753, file: !91, line: 697, baseType: !191, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !753, file: !91, line: 700, baseType: !38, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !555, file: !91, line: 770, baseType: !191, size: 64, offset: 3840)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !555, file: !91, line: 771, baseType: !634, size: 64, offset: 3904)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !555, file: !91, line: 772, baseType: !565, size: 64, offset: 3968)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !555, file: !91, line: 773, baseType: !634, size: 64, offset: 4032)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !555, file: !91, line: 774, baseType: !135, size: 64, offset: 4096)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !555, file: !91, line: 775, baseType: !640, size: 64, offset: 4160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !555, file: !91, line: 778, baseType: !36, size: 32, offset: 4224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !555, file: !91, line: 779, baseType: !776, size: 131072, offset: 4256)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 131072, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 16384)
!779 = !{!780, !781, !782, !783, !784, !785}
!780 = !DILocalVariable(name: "c", arg: 1, scope: !550, file: !1, line: 197, type: !553)
!781 = !DILocalVariable(name: "where", arg: 2, scope: !550, file: !1, line: 197, type: !36)
!782 = !DILocalVariable(name: "j", scope: !550, file: !1, line: 198, type: !36)
!783 = !DILocalVariable(name: "pushed", scope: !550, file: !1, line: 198, type: !36)
!784 = !DILocalVariable(name: "lobj", scope: !550, file: !1, line: 199, type: !89)
!785 = !DILocalVariable(name: "event", scope: !786, file: !1, line: 218, type: !4)
!786 = distinct !DILexicalBlock(scope: !787, file: !1, line: 217, column: 17)
!787 = distinct !DILexicalBlock(scope: !550, file: !1, line: 217, column: 9)
!788 = !DILocation(line: 197, column: 33, scope: !550)
!789 = !DILocation(line: 197, column: 40, scope: !550)
!790 = !DILocation(line: 198, column: 12, scope: !550)
!791 = !DILocation(line: 199, column: 36, scope: !550)
!792 = !{!793, !127, i64 16}
!793 = !{!"client", !162, i64 0, !124, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !162, i64 40, !127, i64 48, !162, i64 56, !124, i64 64, !127, i64 72, !127, i64 80, !127, i64 88, !124, i64 96, !124, i64 100, !162, i64 104, !127, i64 112, !219, i64 120, !162, i64 128, !162, i64 136, !162, i64 144, !162, i64 152, !124, i64 160, !124, i64 164, !124, i64 168, !124, i64 172, !124, i64 176, !162, i64 184, !162, i64 192, !127, i64 200, !219, i64 208, !219, i64 216, !219, i64 224, !219, i64 232, !219, i64 240, !125, i64 248, !124, i64 292, !125, i64 296, !124, i64 344, !794, i64 352, !124, i64 384, !795, i64 392, !219, i64 480, !127, i64 488, !127, i64 496, !127, i64 504, !127, i64 512, !127, i64 520, !124, i64 528, !125, i64 532}
!794 = !{!"multiState", !127, i64 0, !124, i64 8, !124, i64 12, !124, i64 16, !162, i64 24}
!795 = !{!"blockingState", !219, i64 0, !127, i64 8, !127, i64 16, !162, i64 24, !127, i64 32, !127, i64 40, !219, i64 48, !219, i64 56, !124, i64 64, !124, i64 68, !219, i64 72, !127, i64 80}
!796 = !DILocation(line: 199, column: 42, scope: !550)
!797 = !{!793, !127, i64 72}
!798 = !DILocation(line: 199, column: 39, scope: !550)
!799 = !DILocation(line: 199, column: 18, scope: !550)
!800 = !DILocation(line: 199, column: 11, scope: !550)
!801 = !DILocation(line: 201, column: 9, scope: !802)
!802 = distinct !DILexicalBlock(scope: !550, file: !1, line: 201, column: 9)
!803 = !DILocation(line: 201, column: 14, scope: !802)
!804 = !DILocation(line: 201, column: 23, scope: !802)
!805 = !DILocation(line: 201, column: 28, scope: !802)
!806 = !DILocation(line: 201, column: 9, scope: !550)
!807 = !DILocation(line: 202, column: 27, scope: !808)
!808 = distinct !DILexicalBlock(scope: !802, file: !1, line: 201, column: 41)
!809 = !{!810, !127, i64 112}
!810 = !{!"sharedObjectsStruct", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !127, i64 40, !127, i64 48, !127, i64 56, !127, i64 64, !127, i64 72, !127, i64 80, !127, i64 88, !127, i64 96, !127, i64 104, !127, i64 112, !127, i64 120, !127, i64 128, !127, i64 136, !127, i64 144, !127, i64 152, !127, i64 160, !127, i64 168, !127, i64 176, !127, i64 184, !127, i64 192, !127, i64 200, !127, i64 208, !127, i64 216, !127, i64 224, !127, i64 232, !127, i64 240, !127, i64 248, !127, i64 256, !127, i64 264, !127, i64 272, !127, i64 280, !127, i64 288, !127, i64 296, !127, i64 304, !127, i64 312, !127, i64 320, !127, i64 328, !127, i64 336, !127, i64 344, !127, i64 352, !127, i64 360, !125, i64 368, !125, i64 448, !125, i64 80448, !125, i64 80704, !127, i64 80960, !127, i64 80968}
!811 = !DILocation(line: 202, column: 9, scope: !808)
!812 = !DILocation(line: 203, column: 9, scope: !808)
!813 = !DILocation(line: 198, column: 9, scope: !550)
