; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_string.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_string.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sharedObjectsStruct = type { %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, [10 x %struct.redisObject*], [10000 x %struct.redisObject*], [32 x %struct.redisObject*], [32 x %struct.redisObject*], i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_string.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !7, !8, !9, !25, !35, !45}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!8 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !11, line: 51, size: 24, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !19, !20, !21}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, file: !11, line: 52, baseType: !14, size: 8)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 24, baseType: !16)
!15 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 43, baseType: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !10, file: !11, line: 53, baseType: !14, size: 8, offset: 8)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !10, file: !11, line: 54, baseType: !18, size: 8, offset: 16)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !10, file: !11, line: 55, baseType: !22, offset: 24)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: -1)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !11, line: 57, size: 40, elements: !27)
!27 = !{!28, !32, !33, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !11, line: 58, baseType: !29, size: 16)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 36, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !17, line: 57, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !26, file: !11, line: 59, baseType: !29, size: 16, offset: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !11, line: 60, baseType: !18, size: 8, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !26, file: !11, line: 61, baseType: !22, offset: 40)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !11, line: 63, size: 72, elements: !37)
!37 = !{!38, !42, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !11, line: 64, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 48, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 79, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !36, file: !11, line: 65, baseType: !39, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !11, line: 66, baseType: !18, size: 8, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !36, file: !11, line: 67, baseType: !22, offset: 72)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !11, line: 69, size: 136, elements: !47)
!47 = !{!48, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !11, line: 70, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 60, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !17, line: 105, baseType: !51)
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !11, line: 71, baseType: !49, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !11, line: 72, baseType: !18, size: 8, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !11, line: 73, baseType: !22, offset: 136)
!55 = !{i32 2, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!59 = distinct !DISubprogram(name: "setGenericCommand", scope: !1, file: !1, line: 67, type: !60, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !304)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !69, !175, !175, !175, !69, !175, !175}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !64, line: 780, baseType: !65)
!64 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !64, line: 723, size: 135360, elements: !66)
!66 = !{!67, !68, !70, !174, !184, !186, !191, !192, !193, !194, !196, !220, !221, !222, !223, !224, !225, !226, !227, !230, !231, !232, !233, !234, !235, !236, !237, !242, !243, !244, !245, !246, !247, !248, !249, !253, !254, !258, !259, !275, !276, !293, !294, !295, !296, !297, !298, !299, !300}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !64, line: 724, baseType: !49, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !65, file: !64, line: 725, baseType: !69, size: 32, offset: 64)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !65, file: !64, line: 726, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !64, line: 656, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !64, line: 647, size: 512, elements: !74)
!74 = !{!75, !138, !139, !140, !141, !142, !143, !145}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !73, file: !64, line: 648, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !78, line: 82, baseType: !79)
!78 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !78, line: 76, size: 768, elements: !80)
!80 = !{!81, !106, !107, !136, !137}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !78, line: 77, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !78, line: 65, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !78, line: 58, size: 384, elements: !85)
!85 = !{!86, !92, !96, !97, !101, !105}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !84, file: !78, line: 59, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!49, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !84, file: !78, line: 60, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!4, !4, !90}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !84, file: !78, line: 61, baseType: !93, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !84, file: !78, line: 62, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!69, !4, !90, !90}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !84, file: !78, line: 63, baseType: !102, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !4, !4}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !84, file: !78, line: 64, baseType: !102, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !79, file: !78, line: 78, baseType: !4, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !79, file: !78, line: 79, baseType: !108, size: 512, offset: 128)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 512, elements: !134)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !78, line: 74, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !78, line: 69, size: 256, elements: !111)
!111 = !{!112, !131, !132, !133}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !110, file: !78, line: 70, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !78, line: 56, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !78, line: 47, size: 192, elements: !117)
!117 = !{!118, !119, !129}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !116, file: !78, line: 48, baseType: !4, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !116, file: !78, line: 54, baseType: !120, size: 64, offset: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !78, line: 49, size: 64, elements: !121)
!121 = !{!122, !123, !124, !127}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !120, file: !78, line: 50, baseType: !4, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !120, file: !78, line: 51, baseType: !49, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !120, file: !78, line: 52, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !15, line: 56, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !17, line: 103, baseType: !7)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !120, file: !78, line: 53, baseType: !128, size: 64)
!128 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !78, line: 55, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !78, line: 71, baseType: !51, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !110, file: !78, line: 72, baseType: !51, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !110, file: !78, line: 73, baseType: !51, size: 64, offset: 192)
!134 = !{!135}
!135 = !DISubrange(count: 2)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !79, file: !78, line: 80, baseType: !7, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !79, file: !78, line: 81, baseType: !51, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !73, file: !64, line: 649, baseType: !76, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !73, file: !64, line: 650, baseType: !76, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !73, file: !64, line: 651, baseType: !76, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !73, file: !64, line: 652, baseType: !76, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !73, file: !64, line: 653, baseType: !69, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !73, file: !64, line: 654, baseType: !144, size: 64, offset: 384)
!144 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !73, file: !64, line: 655, baseType: !146, size: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !148, line: 54, baseType: !149)
!148 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !148, line: 47, size: 384, elements: !150)
!150 = !{!151, !160, !161, !165, !169, !173}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !149, file: !148, line: 48, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !148, line: 40, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !148, line: 36, size: 192, elements: !155)
!155 = !{!156, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !148, line: 37, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !148, line: 38, baseType: !157, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !154, file: !148, line: 39, baseType: !4, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !149, file: !148, line: 49, baseType: !152, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !149, file: !148, line: 50, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!4, !4}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !149, file: !148, line: 51, baseType: !166, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !4}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !149, file: !148, line: 52, baseType: !170, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!69, !4, !4}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !148, line: 53, baseType: !51, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 727, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !64, line: 622, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !64, line: 614, size: 128, elements: !178)
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !64, line: 615, baseType: !41, size: 4, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !177, file: !64, line: 616, baseType: !41, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !177, file: !64, line: 617, baseType: !41, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !177, file: !64, line: 620, baseType: !69, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !177, file: !64, line: 621, baseType: !4, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !65, file: !64, line: 728, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !11, line: 43, baseType: !5)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !65, file: !64, line: 729, baseType: !187, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 40, baseType: !189)
!188 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !190, line: 129, baseType: !51)
!190 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !65, file: !64, line: 730, baseType: !185, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !65, file: !64, line: 734, baseType: !187, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !65, file: !64, line: 735, baseType: !69, size: 32, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !65, file: !64, line: 736, baseType: !195, size: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !65, file: !64, line: 737, baseType: !197, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !64, line: 1307, size: 640, elements: !199)
!199 = !{!200, !201, !206, !207, !208, !209, !215, !216, !217, !218, !219}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !64, line: 1308, baseType: !5, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !198, file: !64, line: 1309, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !64, line: 1305, baseType: !204)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !62}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !198, file: !64, line: 1310, baseType: !69, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !198, file: !64, line: 1311, baseType: !5, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !64, line: 1312, baseType: !69, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !198, file: !64, line: 1315, baseType: !210, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !64, line: 1306, baseType: !212)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !197, !195, !69, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !198, file: !64, line: 1317, baseType: !69, size: 32, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !198, file: !64, line: 1318, baseType: !69, size: 32, offset: 416)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !198, file: !64, line: 1319, baseType: !69, size: 32, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !198, file: !64, line: 1320, baseType: !144, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !198, file: !64, line: 1320, baseType: !144, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !65, file: !64, line: 737, baseType: !197, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !65, file: !64, line: 738, baseType: !69, size: 32, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !65, file: !64, line: 739, baseType: !69, size: 32, offset: 800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !65, file: !64, line: 740, baseType: !7, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !65, file: !64, line: 741, baseType: !146, size: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !65, file: !64, line: 742, baseType: !8, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !65, file: !64, line: 743, baseType: !187, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !65, file: !64, line: 745, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !229, line: 34, baseType: !7)
!229 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !65, file: !64, line: 746, baseType: !228, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !65, file: !64, line: 747, baseType: !228, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !64, line: 748, baseType: !69, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !65, file: !64, line: 749, baseType: !69, size: 32, offset: 1312)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !65, file: !64, line: 750, baseType: !69, size: 32, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !65, file: !64, line: 751, baseType: !69, size: 32, offset: 1376)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !65, file: !64, line: 752, baseType: !69, size: 32, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !65, file: !64, line: 753, baseType: !238, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !239, line: 173, baseType: !240)
!239 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !190, line: 100, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !190, line: 44, baseType: !7)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !65, file: !64, line: 754, baseType: !238, size: 64, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !65, file: !64, line: 755, baseType: !185, size: 64, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !65, file: !64, line: 756, baseType: !144, size: 64, offset: 1664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !65, file: !64, line: 757, baseType: !144, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !65, file: !64, line: 758, baseType: !144, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !65, file: !64, line: 759, baseType: !144, size: 64, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !65, file: !64, line: 760, baseType: !144, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !65, file: !64, line: 763, baseType: !250, size: 328, offset: 1984)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 328, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 41)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !65, file: !64, line: 764, baseType: !69, size: 32, offset: 2336)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !65, file: !64, line: 765, baseType: !255, size: 368, offset: 2368)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 368, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 46)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !65, file: !64, line: 766, baseType: !69, size: 32, offset: 2752)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !65, file: !64, line: 767, baseType: !260, size: 256, offset: 2816)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !64, line: 673, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !64, line: 665, size: 256, elements: !262)
!262 = !{!263, !271, !272, !273, !274}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !261, file: !64, line: 666, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !64, line: 663, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !64, line: 659, size: 192, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !266, file: !64, line: 660, baseType: !195, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !266, file: !64, line: 661, baseType: !69, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !266, file: !64, line: 662, baseType: !197, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !64, line: 667, baseType: !69, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !261, file: !64, line: 668, baseType: !69, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !261, file: !64, line: 671, baseType: !69, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !261, file: !64, line: 672, baseType: !228, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !65, file: !64, line: 768, baseType: !69, size: 32, offset: 3072)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !65, file: !64, line: 769, baseType: !277, size: 704, offset: 3136)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !64, line: 703, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !64, line: 677, size: 704, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !278, file: !64, line: 679, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !64, line: 52, baseType: !144)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !278, file: !64, line: 683, baseType: !76, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !278, file: !64, line: 685, baseType: !175, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !278, file: !64, line: 689, baseType: !187, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !278, file: !64, line: 690, baseType: !175, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !278, file: !64, line: 691, baseType: !175, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !278, file: !64, line: 692, baseType: !281, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !278, file: !64, line: 692, baseType: !281, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !278, file: !64, line: 693, baseType: !69, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !278, file: !64, line: 696, baseType: !69, size: 32, offset: 544)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !278, file: !64, line: 697, baseType: !144, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !278, file: !64, line: 700, baseType: !4, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !65, file: !64, line: 770, baseType: !144, size: 64, offset: 3840)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !65, file: !64, line: 771, baseType: !146, size: 64, offset: 3904)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !65, file: !64, line: 772, baseType: !76, size: 64, offset: 3968)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !65, file: !64, line: 773, baseType: !146, size: 64, offset: 4032)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !65, file: !64, line: 774, baseType: !185, size: 64, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !65, file: !64, line: 775, baseType: !152, size: 64, offset: 4160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !65, file: !64, line: 778, baseType: !69, size: 32, offset: 4224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !65, file: !64, line: 779, baseType: !301, size: 131072, offset: 4256)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 131072, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 16384)
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313}
!305 = !DILocalVariable(name: "c", arg: 1, scope: !59, file: !1, line: 67, type: !62)
!306 = !DILocalVariable(name: "flags", arg: 2, scope: !59, file: !1, line: 67, type: !69)
!307 = !DILocalVariable(name: "key", arg: 3, scope: !59, file: !1, line: 67, type: !175)
!308 = !DILocalVariable(name: "val", arg: 4, scope: !59, file: !1, line: 67, type: !175)
!309 = !DILocalVariable(name: "expire", arg: 5, scope: !59, file: !1, line: 67, type: !175)
!310 = !DILocalVariable(name: "unit", arg: 6, scope: !59, file: !1, line: 67, type: !69)
!311 = !DILocalVariable(name: "ok_reply", arg: 7, scope: !59, file: !1, line: 67, type: !175)
!312 = !DILocalVariable(name: "abort_reply", arg: 8, scope: !59, file: !1, line: 67, type: !175)
!313 = !DILocalVariable(name: "milliseconds", scope: !59, file: !1, line: 68, type: !144)
!314 = !DILocation(line: 67, column: 32, scope: !59)
!315 = !DILocation(line: 67, column: 39, scope: !59)
!316 = !DILocation(line: 67, column: 52, scope: !59)
!317 = !DILocation(line: 67, column: 63, scope: !59)
!318 = !DILocation(line: 67, column: 74, scope: !59)
!319 = !DILocation(line: 67, column: 86, scope: !59)
!320 = !DILocation(line: 67, column: 98, scope: !59)
!321 = !DILocation(line: 67, column: 114, scope: !59)
!322 = !DILocation(line: 68, column: 5, scope: !59)
!323 = !DILocation(line: 68, column: 15, scope: !59)
!324 = !{!325, !325, i64 0}
!325 = !{!"long long", !326, i64 0}
!326 = !{!"omnipotent char", !327, i64 0}
!327 = !{!"Simple C/C++ TBAA"}
!328 = !DILocation(line: 70, column: 9, scope: !329)
!329 = distinct !DILexicalBlock(scope: !59, file: !1, line: 70, column: 9)
!330 = !DILocation(line: 70, column: 9, scope: !59)
!331 = !DILocation(line: 71, column: 13, scope: !332)
!332 = distinct !DILexicalBlock(scope: !333, file: !1, line: 71, column: 13)
!333 = distinct !DILexicalBlock(scope: !329, file: !1, line: 70, column: 17)
!334 = !DILocation(line: 71, column: 74, scope: !332)
!335 = !DILocation(line: 71, column: 13, scope: !333)
!336 = !DILocation(line: 73, column: 13, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !1, line: 73, column: 13)
!338 = !DILocation(line: 73, column: 26, scope: !337)
!339 = !DILocation(line: 73, column: 13, scope: !333)
!340 = !DILocation(line: 74, column: 66, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !1, line: 73, column: 32)
!342 = !{!343, !346, i64 80}
!343 = !{!"client", !344, i64 0, !345, i64 8, !346, i64 16, !346, i64 24, !346, i64 32, !344, i64 40, !346, i64 48, !344, i64 56, !345, i64 64, !346, i64 72, !346, i64 80, !346, i64 88, !345, i64 96, !345, i64 100, !344, i64 104, !346, i64 112, !325, i64 120, !344, i64 128, !344, i64 136, !344, i64 144, !344, i64 152, !345, i64 160, !345, i64 164, !345, i64 168, !345, i64 172, !345, i64 176, !344, i64 184, !344, i64 192, !346, i64 200, !325, i64 208, !325, i64 216, !325, i64 224, !325, i64 232, !325, i64 240, !326, i64 248, !345, i64 292, !326, i64 296, !345, i64 344, !347, i64 352, !345, i64 384, !348, i64 392, !325, i64 480, !346, i64 488, !346, i64 496, !346, i64 504, !346, i64 512, !346, i64 520, !345, i64 528, !326, i64 532}
!344 = !{!"long", !326, i64 0}
!345 = !{!"int", !326, i64 0}
!346 = !{!"any pointer", !326, i64 0}
!347 = !{!"multiState", !346, i64 0, !345, i64 8, !345, i64 12, !345, i64 16, !344, i64 24}
!348 = !{!"blockingState", !325, i64 0, !346, i64 8, !346, i64 16, !344, i64 24, !346, i64 32, !346, i64 40, !325, i64 48, !325, i64 56, !345, i64 64, !345, i64 68, !325, i64 72, !346, i64 80}
!349 = !DILocation(line: 74, column: 71, scope: !341)
!350 = !{!351, !346, i64 0}
