; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/timelocal.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/timelocal.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_time_T = type { [12 x i8*], [12 x i8*], [7 x i8*], [7 x i8*], i8*, i8*, i8*, [2 x i8*], i8*, [12 x i8*], i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_C_time_locale", scope: !2, file: !3, line: 35, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/timelocal.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_time_T", file: !8, line: 116, size: 4032, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !17, !18, !22, !23, !24, !25, !26, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !7, file: !8, line: 118, baseType: !11, size: 768)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !15)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !{!16}
!16 = !DISubrange(count: 12)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !7, file: !8, line: 119, baseType: !11, size: 768, offset: 768)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "wday", scope: !7, file: !8, line: 120, baseType: !19, size: 448, offset: 1536)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 448, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 7)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !7, file: !8, line: 121, baseType: !19, size: 448, offset: 1984)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "X_fmt", scope: !7, file: !8, line: 122, baseType: !12, size: 64, offset: 2432)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x_fmt", scope: !7, file: !8, line: 123, baseType: !12, size: 64, offset: 2496)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "c_fmt", scope: !7, file: !8, line: 124, baseType: !12, size: 64, offset: 2560)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "am_pm", scope: !7, file: !8, line: 125, baseType: !27, size: 128, offset: 2624)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 2)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "date_fmt", scope: !7, file: !8, line: 126, baseType: !12, size: 64, offset: 2752)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "alt_month", scope: !7, file: !8, line: 127, baseType: !11, size: 768, offset: 2816)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "md_order", scope: !7, file: !8, line: 128, baseType: !12, size: 64, offset: 3584)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ampm_fmt", scope: !7, file: !8, line: 129, baseType: !12, size: 64, offset: 3648)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !7, file: !8, line: 130, baseType: !12, size: 64, offset: 3712)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !7, file: !8, line: 131, baseType: !12, size: 64, offset: 3776)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !7, file: !8, line: 132, baseType: !12, size: 64, offset: 3840)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !7, file: !8, line: 133, baseType: !12, size: 64, offset: 3904)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !7, file: !8, line: 134, baseType: !12, size: 64, offset: 3968)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!43 = distinct !DISubprogram(name: "__time_load_locale", scope: !3, file: !3, line: 147, type: !44, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !319)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !47, !12, !83, !12}
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !8, line: 178, size: 3392, elements: !49)
!49 = !{!50, !54, !275, !284, !285, !286, !314, !316, !318}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !48, file: !8, line: 180, baseType: !51, size: 1792)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1792, elements: !52)
!52 = !{!21, !53}
!53 = !DISubrange(count: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !48, file: !8, line: 181, baseType: !55, size: 64, offset: 1792)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!46, !58, !91, !271, !272}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !60, line: 569, size: 14912, elements: !61)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !{!62, !63, !142, !143, !144, !145, !149, !150, !151, !152, !156, !168, !169, !170, !172, !173, !174, !236, !256, !257, !262, !269}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !59, file: !60, line: 571, baseType: !46, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !60, line: 287, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !60, line: 181, size: 1408, elements: !67)
!67 = !{!68, !71, !72, !73, !75, !76, !81, !82, !84, !92, !96, !101, !105, !106, !107, !108, !112, !116, !117, !118, !120, !121, !125, !141}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !66, file: !60, line: 182, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !66, file: !60, line: 183, baseType: !46, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !66, file: !60, line: 184, baseType: !46, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !60, line: 185, baseType: !74, size: 16, offset: 128)
!74 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !66, file: !60, line: 186, baseType: !74, size: 16, offset: 144)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !66, file: !60, line: 187, baseType: !77, size: 128, offset: 192)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !60, line: 117, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !77, file: !60, line: 118, baseType: !69, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !77, file: !60, line: 119, baseType: !46, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !66, file: !60, line: 188, baseType: !46, size: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !66, file: !60, line: 195, baseType: !83, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !66, file: !60, line: 197, baseType: !85, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !58, !83, !91, !46}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !89, line: 145, baseType: !90)
!89 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !66, file: !60, line: 199, baseType: !93, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!88, !58, !83, !12, !46}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !66, file: !60, line: 202, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !58, !83, !100, !46}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !89, line: 114, baseType: !90)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !66, file: !60, line: 203, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!46, !58, !83}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !66, file: !60, line: 206, baseType: !77, size: 128, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !66, file: !60, line: 207, baseType: !69, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !66, file: !60, line: 208, baseType: !46, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !66, file: !60, line: 211, baseType: !109, size: 24, offset: 928)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 24, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !66, file: !60, line: 212, baseType: !113, size: 8, offset: 952)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !66, file: !60, line: 215, baseType: !77, size: 128, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !66, file: !60, line: 218, baseType: !46, size: 32, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !60, line: 219, baseType: !119, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !89, line: 44, baseType: !90)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !66, file: !60, line: 222, baseType: !58, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !60, line: 226, baseType: !122, size: 32, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !89, line: 175, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !124, line: 12, baseType: !46)
!124 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !66, file: !60, line: 228, baseType: !126, size: 64, offset: 1312)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !89, line: 171, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 163, size: 64, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !127, file: !89, line: 165, baseType: !46, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !127, file: !89, line: 170, baseType: !131, size: 32, offset: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !89, line: 166, size: 32, elements: !132)
!132 = !{!133, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !131, file: !89, line: 168, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !135, line: 124, baseType: !136)
!135 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!136 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !131, file: !89, line: 169, baseType: !138, size: 32)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 4)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !60, line: 229, baseType: !46, size: 32, offset: 1376)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !59, file: !60, line: 576, baseType: !64, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !59, file: !60, line: 578, baseType: !46, size: 32, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !59, file: !60, line: 579, baseType: !146, size: 200, offset: 288)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 200, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 25)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !59, file: !60, line: 582, baseType: !46, size: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !59, file: !60, line: 583, baseType: !47, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !59, file: !60, line: 585, baseType: !46, size: 32, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !59, file: !60, line: 587, baseType: !153, size: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !58}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !59, file: !60, line: 590, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !60, line: 47, size: 256, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !158, file: !60, line: 49, baseType: !157, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !158, file: !60, line: 50, baseType: !46, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !158, file: !60, line: 50, baseType: !46, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !158, file: !60, line: 50, baseType: !46, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !158, file: !60, line: 50, baseType: !46, size: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !158, file: !60, line: 51, baseType: !166, size: 32, offset: 192)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 32, elements: !114)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !60, line: 25, baseType: !136)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !59, file: !60, line: 591, baseType: !46, size: 32, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !59, file: !60, line: 592, baseType: !157, size: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !59, file: !60, line: 593, baseType: !171, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !59, file: !60, line: 596, baseType: !46, size: 32, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !59, file: !60, line: 597, baseType: !91, size: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !59, file: !60, line: 632, baseType: !175, size: 2880, offset: 1152)
!175 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !60, line: 599, size: 2880, elements: !176)
!176 = !{!177, !227}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !175, file: !60, line: 622, baseType: !178, size: 1728)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !175, file: !60, line: 601, size: 1728, elements: !179)
!179 = !{!180, !181, !182, !186, !198, !199, !201, !209, !210, !211, !212, !216, !220, !221, !222, !223, !224, !225, !226}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !178, file: !60, line: 603, baseType: !136, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !178, file: !60, line: 604, baseType: !91, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !178, file: !60, line: 605, baseType: !183, size: 208, offset: 128)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 208, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 26)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !178, file: !60, line: 606, baseType: !187, size: 288, offset: 352)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !60, line: 55, size: 288, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !187, file: !60, line: 57, baseType: !46, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !187, file: !60, line: 58, baseType: !46, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !187, file: !60, line: 59, baseType: !46, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !187, file: !60, line: 60, baseType: !46, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !187, file: !60, line: 61, baseType: !46, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !187, file: !60, line: 62, baseType: !46, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !187, file: !60, line: 63, baseType: !46, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !187, file: !60, line: 64, baseType: !46, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !187, file: !60, line: 65, baseType: !46, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !178, file: !60, line: 607, baseType: !46, size: 32, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !178, file: !60, line: 608, baseType: !200, size: 64, offset: 704)
!200 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !178, file: !60, line: 609, baseType: !202, size: 112, offset: 768)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !60, line: 319, size: 112, elements: !203)
!203 = !{!204, !207, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !202, file: !60, line: 320, baseType: !205, size: 48)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 48, elements: !110)
!206 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !202, file: !60, line: 321, baseType: !205, size: 48, offset: 48)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !202, file: !60, line: 322, baseType: !206, size: 16, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !178, file: !60, line: 610, baseType: !126, size: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !178, file: !60, line: 611, baseType: !126, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !178, file: !60, line: 612, baseType: !126, size: 64, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !178, file: !60, line: 613, baseType: !213, size: 64, offset: 1088)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 8)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !178, file: !60, line: 614, baseType: !217, size: 192, offset: 1152)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 24)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !178, file: !60, line: 615, baseType: !46, size: 32, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !178, file: !60, line: 616, baseType: !126, size: 64, offset: 1376)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !178, file: !60, line: 617, baseType: !126, size: 64, offset: 1440)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !178, file: !60, line: 618, baseType: !126, size: 64, offset: 1504)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !178, file: !60, line: 619, baseType: !126, size: 64, offset: 1568)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !178, file: !60, line: 620, baseType: !126, size: 64, offset: 1632)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !178, file: !60, line: 621, baseType: !46, size: 32, offset: 1696)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !175, file: !60, line: 631, baseType: !228, size: 2880)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !175, file: !60, line: 626, size: 2880, elements: !229)
!229 = !{!230, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !228, file: !60, line: 629, baseType: !231, size: 1920)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1920, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 30)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !228, file: !60, line: 630, baseType: !235, size: 960, offset: 1920)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 960, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !59, file: !60, line: 636, baseType: !237, size: 64, offset: 4032)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !60, line: 93, size: 6336, elements: !239)
!239 = !{!240, !241, !242, !248}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !238, file: !60, line: 94, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !238, file: !60, line: 95, baseType: !46, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !238, file: !60, line: 97, baseType: !243, size: 2048, offset: 128)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 2048, elements: !247)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null}
!247 = !{!53}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !238, file: !60, line: 98, baseType: !249, size: 4160, offset: 2176)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !60, line: 74, size: 4160, elements: !250)
!250 = !{!251, !253, !254, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !249, file: !60, line: 75, baseType: !252, size: 2048)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2048, elements: !247)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !249, file: !60, line: 76, baseType: !252, size: 2048, offset: 2048)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !249, file: !60, line: 78, baseType: !167, size: 32, offset: 4096)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !249, file: !60, line: 81, baseType: !167, size: 32, offset: 4128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !59, file: !60, line: 637, baseType: !238, size: 6336, offset: 4096)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !59, file: !60, line: 641, baseType: !258, size: 64, offset: 10432)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !46}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !59, file: !60, line: 646, baseType: !263, size: 192, offset: 10496)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !60, line: 291, size: 192, elements: !264)
!264 = !{!265, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !263, file: !60, line: 293, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !263, file: !60, line: 294, baseType: !46, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !263, file: !60, line: 295, baseType: !64, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !59, file: !60, line: 648, baseType: !270, size: 4224, offset: 10688)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 4224, elements: !110)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !135, line: 83, baseType: !46)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !274, line: 86, baseType: !126)
!274 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !48, file: !8, line: 183, baseType: !276, size: 64, offset: 1856)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!46, !58, !279, !12, !280, !272}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !281, line: 40, baseType: !282)
!281 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !89, line: 129, baseType: !283)
!283 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !48, file: !8, line: 185, baseType: !46, size: 32, offset: 1920)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !48, file: !8, line: 186, baseType: !91, size: 64, offset: 1984)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !48, file: !8, line: 187, baseType: !287, size: 768, offset: 2048)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !288, line: 42, size: 768, elements: !289)
!288 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !287, file: !288, line: 44, baseType: !91, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !287, file: !288, line: 45, baseType: !91, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !287, file: !288, line: 46, baseType: !91, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !287, file: !288, line: 47, baseType: !91, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !287, file: !288, line: 48, baseType: !91, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !287, file: !288, line: 49, baseType: !91, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !287, file: !288, line: 50, baseType: !91, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !287, file: !288, line: 51, baseType: !91, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !287, file: !288, line: 52, baseType: !91, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !287, file: !288, line: 53, baseType: !91, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !287, file: !288, line: 54, baseType: !14, size: 8, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !287, file: !288, line: 55, baseType: !14, size: 8, offset: 648)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !287, file: !288, line: 56, baseType: !14, size: 8, offset: 656)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !287, file: !288, line: 57, baseType: !14, size: 8, offset: 664)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !287, file: !288, line: 58, baseType: !14, size: 8, offset: 672)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !287, file: !288, line: 59, baseType: !14, size: 8, offset: 680)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !287, file: !288, line: 60, baseType: !14, size: 8, offset: 688)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !287, file: !288, line: 61, baseType: !14, size: 8, offset: 696)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !287, file: !288, line: 62, baseType: !14, size: 8, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !287, file: !288, line: 63, baseType: !14, size: 8, offset: 712)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !287, file: !288, line: 64, baseType: !14, size: 8, offset: 720)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !287, file: !288, line: 65, baseType: !14, size: 8, offset: 728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !287, file: !288, line: 66, baseType: !14, size: 8, offset: 736)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !287, file: !288, line: 67, baseType: !14, size: 8, offset: 744)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !48, file: !8, line: 189, baseType: !315, size: 16, offset: 2816)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 16, elements: !28)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !48, file: !8, line: 190, baseType: !317, size: 256, offset: 2832)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !247)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !48, file: !8, line: 191, baseType: !317, size: 256, offset: 3088)
!319 = !{!320, !321, !322, !323, !324, !325, !326}
!320 = !DILocalVariable(name: "locale", arg: 1, scope: !43, file: !3, line: 147, type: !47)
!321 = !DILocalVariable(name: "name", arg: 2, scope: !43, file: !3, line: 147, type: !12)
!322 = !DILocalVariable(name: "f_wctomb", arg: 3, scope: !43, file: !3, line: 148, type: !83)
!323 = !DILocalVariable(name: "charset", arg: 4, scope: !43, file: !3, line: 148, type: !12)
!324 = !DILocalVariable(name: "ret", scope: !43, file: !3, line: 150, type: !46)
!325 = !DILocalVariable(name: "ti", scope: !43, file: !3, line: 151, type: !7)
!326 = !DILocalVariable(name: "bufp", scope: !43, file: !3, line: 152, type: !91)
!327 = !DILocation(line: 147, column: 40, scope: !43)
!328 = !DILocation(line: 147, column: 60, scope: !43)
!329 = !DILocation(line: 148, column: 13, scope: !43)
!330 = !DILocation(line: 148, column: 35, scope: !43)
!331 = !DILocation(line: 152, column: 9, scope: !43)
!332 = !DILocation(line: 189, column: 3, scope: !43)
