; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/tzcalc_limits.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/tzcalc_limits.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__tzinfo_struct = type { i32, i32, [2 x %struct.__tzrule_struct] }
%struct.__tzrule_struct = type { i8, i32, i32, i32, i32, i64, i64 }

@__month_lengths = external dso_local local_unnamed_addr constant [2 x [12 x i32]], align 16
@__A_VARIABLE = internal global i32 0

; Function Attrs: noredzone nounwind
define dso_local i32 @__tzcalc_limits(i32) local_unnamed_addr #0 !dbg !7 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !12, metadata !DIExpression()), !dbg !59
  %2 = tail call %struct.__tzinfo_struct* @__gettzinfo() #3, !dbg !60
  call void @llvm.dbg.value(metadata %struct.__tzinfo_struct* %2, metadata !18, metadata !DIExpression()), !dbg !61
  %3 = icmp slt i32 %0, 1970, !dbg !62
  br i1 %3, label %172, label %4, !dbg !64

; <label>:4:                                      ; preds = %1
  %5 = getelementptr inbounds %struct.__tzinfo_struct, %struct.__tzinfo_struct* %2, i64 0, i32 1, !dbg !65
  store i32 %0, i32* %5, align 4, !dbg !66, !tbaa !67
  call void @llvm.dbg.value(metadata i32 %0, metadata !15, metadata !DIExpression(DW_OP_constu, 1970, DW_OP_minus, DW_OP_stack_value)), !dbg !72
  %6 = mul i32 %0, 365, !dbg !73

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/tzcalc_limits.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "__tzcalc_limits", scope: !1, file: !1, line: 14, type: !8, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !11)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !45, !53, !54, !55, !56}
!12 = !DILocalVariable(name: "year", arg: 1, scope: !7, file: !1, line: 14, type: !10)
!13 = !DILocalVariable(name: "days", scope: !7, file: !1, line: 17, type: !10)
!14 = !DILocalVariable(name: "year_days", scope: !7, file: !1, line: 17, type: !10)
!15 = !DILocalVariable(name: "years", scope: !7, file: !1, line: 17, type: !10)
!16 = !DILocalVariable(name: "i", scope: !7, file: !1, line: 18, type: !10)
!17 = !DILocalVariable(name: "j", scope: !7, file: !1, line: 18, type: !10)
!18 = !DILocalVariable(name: "tz", scope: !7, file: !1, line: 19, type: !19)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzinfo_type", file: !22, line: 65, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzinfo_struct", file: !22, line: 60, size: 704, elements: !24)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__tznorth", scope: !23, file: !22, line: 62, baseType: !10, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__tzyear", scope: !23, file: !22, line: 63, baseType: !10, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__tzrule", scope: !23, file: !22, line: 64, baseType: !28, size: 640, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 640, elements: !43)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzrule_type", file: !22, line: 58, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzrule_struct", file: !22, line: 49, size: 320, elements: !31)
!31 = !{!32, !34, !35, !36, !37, !38, !42}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !30, file: !22, line: 51, baseType: !33, size: 8)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !30, file: !22, line: 52, baseType: !10, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !30, file: !22, line: 53, baseType: !10, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !30, file: !22, line: 54, baseType: !10, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !30, file: !22, line: 55, baseType: !10, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !30, file: !22, line: 56, baseType: !39, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !40, line: 34, baseType: !41)
!40 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !30, file: !22, line: 57, baseType: !41, size: 64, offset: 256)
!43 = !{!44}
!44 = !DISubrange(count: 2)
!45 = !DILocalVariable(name: "yleap", scope: !46, file: !1, line: 47, type: !52)
!46 = distinct !DILexicalBlock(scope: !47, file: !1, line: 46, column: 2)
!47 = distinct !DILexicalBlock(scope: !48, file: !1, line: 43, column: 16)
!48 = distinct !DILexicalBlock(scope: !49, file: !1, line: 35, column: 11)
!49 = distinct !DILexicalBlock(scope: !50, file: !1, line: 34, column: 5)
!50 = distinct !DILexicalBlock(scope: !51, file: !1, line: 33, column: 3)
!51 = distinct !DILexicalBlock(scope: !7, file: !1, line: 33, column: 3)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!53 = !DILocalVariable(name: "m_day", scope: !46, file: !1, line: 48, type: !10)
!54 = !DILocalVariable(name: "m_wday", scope: !46, file: !1, line: 48, type: !10)
!55 = !DILocalVariable(name: "wday_diff", scope: !46, file: !1, line: 48, type: !10)
!56 = !DILocalVariable(name: "ip", scope: !46, file: !1, line: 49, type: !57)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!59 = !DILocation(line: 14, column: 1, scope: !7)
!60 = !DILocation(line: 19, column: 30, scope: !7)
!61 = !DILocation(line: 19, column: 25, scope: !7)
!62 = !DILocation(line: 21, column: 12, scope: !63)
!63 = distinct !DILexicalBlock(scope: !7, file: !1, line: 21, column: 7)
!64 = !DILocation(line: 21, column: 7, scope: !7)
!65 = !DILocation(line: 24, column: 7, scope: !7)
!66 = !DILocation(line: 24, column: 16, scope: !7)
!67 = !{!68, !69, i64 4}
!68 = !{!"__tzinfo_struct", !69, i64 0, !69, i64 4, !70, i64 8}
!69 = !{!"int", !70, i64 0}
!70 = !{!"omnipotent char", !71, i64 0}
!71 = !{!"Simple C/C++ TBAA"}
!72 = !DILocation(line: 17, column: 24, scope: !7)
!73 = !DILocation(line: 28, column: 21, scope: !7)
!74 = !DILocation(line: 29, column: 16, scope: !7)
!75 = !DILocation(line: 29, column: 42, scope: !7)
!76 = !DILocation(line: 28, column: 27, scope: !7)
!77 = !DILocation(line: 30, column: 16, scope: !7)
!78 = !DILocation(line: 29, column: 46, scope: !7)
!79 = !DILocation(line: 31, column: 16, scope: !7)
!80 = !DILocation(line: 31, column: 50, scope: !7)
!81 = !DILocation(line: 30, column: 51, scope: !7)
!82 = !DILocation(line: 17, column: 13, scope: !7)
!83 = !DILocation(line: 18, column: 7, scope: !7)
!84 = !DILocation(line: 35, column: 27, scope: !48)
!85 = !{!86, !70, i64 0}
!86 = !{!"__tzrule_struct", !70, i64 0, !69, i64 4, !69, i64 8, !69, i64 12, !69, i64 16, !87, i64 24, !87, i64 32}
!87 = !{!"long", !70, i64 0}
!88 = !DILocation(line: 35, column: 11, scope: !49)
!89 = !DILocation(line: 38, column: 39, scope: !90)
!90 = distinct !DILexicalBlock(scope: !48, file: !1, line: 36, column: 2)
!91 = !{!86, !69, i64 12}
!92 = !DILocation(line: 39, column: 41, scope: !90)
!93 = !DILocation(line: 39, column: 7, scope: !90)
!94 = !DILocation(line: 39, column: 20, scope: !90)
!95 = !DILocation(line: 17, column: 7, scope: !7)
!96 = !DILocation(line: 38, column: 41, scope: !90)
!97 = !DILocation(line: 41, column: 4, scope: !90)
!98 = !DILocation(line: 42, column: 2, scope: !90)
!99 = !DILocation(line: 44, column: 37, scope: !47)
!100 = !DILocation(line: 44, column: 19, scope: !47)
!101 = !DILocation(line: 44, column: 2, scope: !47)
!102 = !DILocation(line: 49, column: 28, scope: !46)
!103 = !DILocation(line: 47, column: 15, scope: !46)
!104 = !DILocation(line: 18, column: 10, scope: !7)
!105 = !DILocation(line: 53, column: 36, scope: !106)
!106 = distinct !DILexicalBlock(scope: !107, file: !1, line: 53, column: 4)
!107 = distinct !DILexicalBlock(scope: !46, file: !1, line: 53, column: 4)
!108 = !{!86, !69, i64 4}
!109 = !DILocation(line: 53, column: 18, scope: !106)
!110 = !DILocation(line: 53, column: 4, scope: !107)
!111 = !DILocation(line: 54, column: 18, scope: !106)
!112 = !DILocation(line: 54, column: 14, scope: !106)
!113 = !{!69, !69, i64 0}
