; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/udp.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/udp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stats_ = type { %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_sys, %struct.stats_proto, %struct.stats_proto, %struct.stats_proto, %struct.stats_igmp, %struct.stats_proto }
%struct.stats_sys = type { %struct.stats_syselem, %struct.stats_syselem, %struct.stats_syselem }
%struct.stats_syselem = type { i16, i16, i16 }
%struct.stats_igmp = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.stats_proto = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.ip_globals = type { %struct.netif*, %struct.netif*, %struct.ip_hdr*, %struct.ip6_hdr*, i16, %struct.ip_addr, %struct.ip_addr }

!37 = !DIEnumerator(name: "ICMP_DUR_NET", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "ICMP_DUR_HOST", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "ICMP_DUR_PROTO", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "ICMP_DUR_PORT", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "ICMP_DUR_FRAG", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "ICMP_DUR_SR", value: 5, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 53, baseType: !45, size: 32, elements: !46)
!44 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!47 = !DIEnumerator(name: "ERR_OK", value: 0)
!48 = !DIEnumerator(name: "ERR_MEM", value: -1)
!49 = !DIEnumerator(name: "ERR_BUF", value: -2)
!50 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!51 = !DIEnumerator(name: "ERR_RTE", value: -4)
!52 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!53 = !DIEnumerator(name: "ERR_VAL", value: -6)
!54 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!55 = !DIEnumerator(name: "ERR_USE", value: -8)
!56 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!57 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!58 = !DIEnumerator(name: "ERR_CONN", value: -11)
!59 = !DIEnumerator(name: "ERR_IF", value: -12)
!60 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!61 = !DIEnumerator(name: "ERR_RST", value: -14)
!62 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!63 = !DIEnumerator(name: "ERR_ARG", value: -16)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 89, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !{!67, !68, !69, !70, !71}
!67 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!68 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!69 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!70 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 145, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!75 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!77 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 52, baseType: !7, size: 32, elements: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/memp.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!81 = !DIEnumerator(name: "MEMP_UDP_PCB", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "MEMP_TCP_PCB", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!99 = !{!100, !107, !108, !116, !119, !126, !148, !152, !134, !169, !203, !204}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !101, line: 127, baseType: !102)
!101 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !103, line: 36, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !105, line: 57, baseType: !106)
!105 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!106 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_hdr", file: !110, line: 53, size: 64, elements: !111)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/udp.h", directory: "/root/.unikraft/apps/redis/build")
!111 = !{!112, !113, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !109, file: !110, line: 54, baseType: !100, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !109, file: !110, line: 55, baseType: !100, size: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !110, line: 56, baseType: !100, size: 16, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !109, file: !110, line: 57, baseType: !100, size: 16, offset: 48)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !101, line: 129, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !103, line: 48, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !105, line: 79, baseType: !7)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !122, line: 57, baseType: !123)
!122 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !122, line: 51, size: 32, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !123, file: !122, line: 52, baseType: !116, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !129, line: 80, size: 320, elements: !130)
!129 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!130 = !{!131, !132, !133, !138, !139, !147}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_v_tc_fl", scope: !128, file: !129, line: 82, baseType: !116, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_plen", scope: !128, file: !129, line: 84, baseType: !100, size: 16, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_nexth", scope: !128, file: !129, line: 86, baseType: !134, size: 8, offset: 48)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !101, line: 125, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !103, line: 24, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !105, line: 43, baseType: !137)
!137 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_hoplim", scope: !128, file: !129, line: 88, baseType: !134, size: 8, offset: 56)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !128, file: !129, line: 90, baseType: !140, size: 128, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !129, line: 60, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !129, line: 53, size: 128, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !129, line: 54, baseType: !144, size: 128)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !128, file: !129, line: 91, baseType: !140, size: 128, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !101, line: 128, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !103, line: 32, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !105, line: 55, baseType: !151)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !19, line: 76, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !19, line: 69, size: 192, elements: !156)
!156 = !{!157, !168}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !155, file: !19, line: 73, baseType: !158, size: 160)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !19, line: 70, size: 160, elements: !159)
!159 = !{!160, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !158, file: !19, line: 71, baseType: !161, size: 160)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !162, line: 67, baseType: !163)
!162 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !162, line: 59, size: 160, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !163, file: !162, line: 60, baseType: !144, size: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !163, file: !162, line: 62, baseType: !134, size: 8, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !158, file: !19, line: 72, baseType: !121, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !19, line: 75, baseType: !134, size: 8, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_pcb", file: !171, line: 81, size: 768, elements: !172)
!171 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/udp.h", directory: "/root/.unikraft/apps/redis/build")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !202}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !170, file: !171, line: 83, baseType: !154, size: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !170, file: !171, line: 83, baseType: !154, size: 192, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !170, file: !171, line: 83, baseType: !134, size: 8, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !170, file: !171, line: 83, baseType: !134, size: 8, offset: 392)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !170, file: !171, line: 83, baseType: !134, size: 8, offset: 400)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !170, file: !171, line: 83, baseType: !134, size: 8, offset: 408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !171, line: 87, baseType: !169, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !171, line: 89, baseType: !134, size: 8, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !170, file: !171, line: 91, baseType: !100, size: 16, offset: 528)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !170, file: !171, line: 91, baseType: !100, size: 16, offset: 544)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ip4", scope: !170, file: !171, line: 96, baseType: !121, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ifindex", scope: !170, file: !171, line: 99, baseType: !134, size: 8, offset: 608)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !170, file: !171, line: 101, baseType: !134, size: 8, offset: 616)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !170, file: !171, line: 110, baseType: !187, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "udp_recv_fn", file: !171, line: 77, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !107, !169, !191, !152, !100}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !65, line: 186, size: 192, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !65, line: 188, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !192, file: !65, line: 191, baseType: !107, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !192, file: !65, line: 200, baseType: !100, size: 16, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !192, file: !65, line: 203, baseType: !100, size: 16, offset: 144)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !192, file: !65, line: 208, baseType: !134, size: 8, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !65, line: 211, baseType: !134, size: 8, offset: 168)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !192, file: !65, line: 218, baseType: !134, size: 8, offset: 176)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !192, file: !65, line: 221, baseType: !134, size: 8, offset: 184)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "recv_arg", scope: !170, file: !171, line: 112, baseType: !107, size: 64, offset: 704)
!203 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!205 = !{!206, !0, !208, !235}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "udp_pcbs", scope: !2, file: !3, line: 83, type: !169, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "__str", scope: !210, file: !211, line: 198, type: !232, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "uk_pr_crit", scope: !211, file: !211, line: 194, type: !212, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !217)
!211 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!212 = !DISubroutineType(types: !213)
!213 = !{null, !214, null}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!217 = !{!218, !219}
!218 = !DILocalVariable(name: "fmt", arg: 1, scope: !210, file: !211, line: 194, type: !214)
!219 = !DILocalVariable(name: "argp", scope: !210, file: !211, line: 196, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !221, line: 32, baseType: !222)
!221 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 192, elements: !230)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !225)
!225 = !{!226, !227, !228, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !224, file: !3, line: 196, baseType: !7, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !224, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !224, file: !3, line: 196, baseType: !107, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !224, file: !3, line: 196, baseType: !107, size: 64, offset: 128)
!230 = !{!231}
!231 = !DISubrange(count: 1)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 64, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 8)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "__str", scope: !210, file: !211, line: 198, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 48, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 6)
!240 = !{i32 2, !"Dwarf Version", i32 4}
!241 = !{i32 2, !"Debug Info Version", i32 3}
!242 = !{i32 1, !"wchar_size", i32 4}
!243 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!244 = distinct !DISubprogram(name: "udp_init", scope: !3, file: !3, line: 89, type: !245, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{null}
!247 = !{}
!248 = !DILocation(line: 65, column: 2, scope: !249, inlinedAt: !266)
!249 = distinct !DISubprogram(name: "isolated_rand", scope: !250, file: !250, line: 63, type: !251, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !255)
!250 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/cc.h", directory: "/root/.unikraft/apps/redis/build")
!251 = !DISubroutineType(types: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !254, line: 88, baseType: !7)
!254 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!255 = !{!256, !257, !263}
!256 = !DILocalVariable(name: "randn", scope: !249, file: !250, line: 65, type: !253)
!257 = !DILocalVariable(name: "tid", scope: !258, file: !250, line: 66, type: !117)
!258 = distinct !DILexicalBlock(scope: !259, file: !250, line: 66, column: 2)
!259 = distinct !DILexicalBlock(scope: !260, file: !250, line: 66, column: 2)
!260 = distinct !DILexicalBlock(scope: !261, file: !250, line: 66, column: 2)
!261 = distinct !DILexicalBlock(scope: !262, file: !250, line: 66, column: 2)
!262 = distinct !DILexicalBlock(scope: !249, file: !250, line: 66, column: 2)
!263 = !DILocalVariable(name: "_ret", scope: !258, file: !250, line: 66, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !103, line: 60, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !105, line: 105, baseType: !203)
!266 = distinct !DILocation(line: 92, column: 14, scope: !244)
!267 = !DILocation(line: 120, column: 2, scope: !268, inlinedAt: !274)
!268 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !269, file: !269, line: 116, type: !270, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !272)
!269 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!270 = !DISubroutineType(types: !271)
!271 = !{!203}
!272 = !{!273}
!273 = !DILocalVariable(name: "sp", scope: !268, file: !269, line: 118, type: !203)
!274 = distinct !DILocation(line: 66, column: 2, scope: !261, inlinedAt: !266)
!275 = !{i32 556556}
!276 = !DILocation(line: 118, column: 16, scope: !268, inlinedAt: !274)
!277 = !DILocation(line: 121, column: 2, scope: !268, inlinedAt: !274)
!278 = !DILocation(line: 66, column: 2, scope: !261, inlinedAt: !266)
!279 = !DILocation(line: 120, column: 2, scope: !268, inlinedAt: !280)
!280 = distinct !DILocation(line: 66, column: 2, scope: !261, inlinedAt: !266)
!281 = !DILocation(line: 118, column: 16, scope: !268, inlinedAt: !280)
!282 = !DILocation(line: 121, column: 2, scope: !268, inlinedAt: !280)
!283 = !DILocation(line: 66, column: 2, scope: !262, inlinedAt: !266)
!284 = !DILocation(line: 65, column: 11, scope: !285, inlinedAt: !290)
!285 = distinct !DISubprogram(name: "uk_swrand_randr", scope: !286, file: !286, line: 60, type: !251, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !287)
!286 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukswrand/include/uk/swrand.h", directory: "/root/.unikraft/apps/redis/build")
!287 = !{!288, !289}
!288 = !DILocalVariable(name: "iflags", scope: !285, file: !286, line: 62, type: !203)
!289 = !DILocalVariable(name: "ret", scope: !285, file: !286, line: 63, type: !253)
!290 = distinct !DILocation(line: 66, column: 2, scope: !291, inlinedAt: !266)
!291 = distinct !DILexicalBlock(scope: !261, file: !250, line: 66, column: 2)
!292 = !DILocation(line: 62, column: 16, scope: !285, inlinedAt: !290)
!293 = !DILocation(line: 66, column: 8, scope: !285, inlinedAt: !290)
!294 = !DILocation(line: 63, column: 8, scope: !285, inlinedAt: !290)
!295 = !DILocation(line: 67, column: 2, scope: !285, inlinedAt: !290)
!296 = !DILocation(line: 69, column: 2, scope: !285, inlinedAt: !290)
!297 = !DILocation(line: 65, column: 8, scope: !249, inlinedAt: !266)
!298 = !DILocation(line: 66, column: 2, scope: !291, inlinedAt: !266)
!299 = !{!300, !300, i64 0}
!300 = !{!"int", !301, i64 0}
!301 = !{!"omnipotent char", !302, i64 0}
!302 = !{!"Simple C/C++ TBAA"}
!303 = !DILocation(line: 120, column: 2, scope: !268, inlinedAt: !304)
!304 = distinct !DILocation(line: 49, column: 21, scope: !305, inlinedAt: !311)
!305 = distinct !DISubprogram(name: "uk_thread_get_tid", scope: !306, file: !306, line: 47, type: !307, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !309)
!306 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku-impl.h", directory: "/root/.unikraft/apps/redis/build")
!307 = !DISubroutineType(types: !308)
!308 = !{!45}
!309 = !{!310}
!310 = !DILocalVariable(name: "sp", scope: !305, file: !306, line: 49, type: !203)
!311 = distinct !DILocation(line: 66, column: 2, scope: !258, inlinedAt: !266)
!312 = !DILocation(line: 118, column: 16, scope: !268, inlinedAt: !304)
!313 = !DILocation(line: 121, column: 2, scope: !268, inlinedAt: !304)
!314 = !DILocation(line: 49, column: 16, scope: !305, inlinedAt: !311)
!315 = !DILocation(line: 50, column: 19, scope: !305, inlinedAt: !311)
!316 = !DILocation(line: 50, column: 11, scope: !305, inlinedAt: !311)
!317 = !DILocation(line: 50, column: 9, scope: !305, inlinedAt: !311)
!318 = !DILocation(line: 50, column: 2, scope: !305, inlinedAt: !311)
!319 = !DILocation(line: 66, column: 2, scope: !258, inlinedAt: !266)
!320 = !{i32 -2146799726, i32 -2146799713, i32 -2146799688, i32 -2146799664, i32 -2146799639, i32 -2146799564, i32 -2146799539, i32 -2146799395, i32 -2146796302, i32 -2146796213, i32 -2146796092, i32 -2146795997, i32 -2146795896, i32 -2146795869, i32 -2146795786, i32 -2146795697, i32 -2146795576, i32 -2146795476, i32 -2146795370, i32 -2146795262, i32 -2146799112, i32 -2146799059, i32 -2146799028, i32 -2146798997, i32 -2146798976, i32 -2146798954, i32 -2146798905, i32 -2146798884, i32 -2146795179, i32 -2146795090, i32 -2146794969, i32 -2146794870, i32 -2146794764, i32 -2146794662, i32 -2146794629, i32 -2146794556, i32 -2146794488, i32 -2146798582, i32 -2146798523, i32 -2146798470, i32 -2146798439, i32 -2146798408, i32 -2146798387, i32 -2146798365, i32 -2146798316, i32 -2146798295, i32 -2146794437, i32 -2146794348, i32 -2146794227, i32 -2146794128, i32 -2146794022, i32 -2146793920, i32 -2146793887, i32 -2146793804, i32 -2146793715, i32 -2146793594, i32 -2146793494, i32 -2146793468, i32 -2146793365, i32 -2146793339, i32 -2146798037, i32 -2146797970, i32 -2146797945, i32 -2146797881, i32 -2146797799, i32 -2146797776, i32 -2146797751, i32 -2146797726}
!321 = !DILocation(line: 66, column: 2, scope: !322, inlinedAt: !266)
!322 = distinct !DILexicalBlock(scope: !323, file: !250, line: 66, column: 2)
!323 = distinct !DILexicalBlock(scope: !258, file: !250, line: 66, column: 2)
!324 = !{i32 -2146796779, i32 -2146796762}
!325 = !DILocation(line: 67, column: 9, scope: !249, inlinedAt: !266)
!326 = !DILocation(line: 68, column: 1, scope: !249, inlinedAt: !266)
!327 = !DILocation(line: 67, column: 2, scope: !249, inlinedAt: !266)
!328 = !DILocation(line: 92, column: 14, scope: !244)
!329 = !DILocation(line: 92, column: 12, scope: !244)
!330 = !{!331, !331, i64 0}
!331 = !{!"short", !301, i64 0}
!332 = !DILocation(line: 94, column: 1, scope: !244)
!333 = distinct !DISubprogram(name: "udp_input", scope: !3, file: !3, line: 196, type: !334, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !407)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !191, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !6, line: 260, size: 2240, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !347, !349, !351, !352, !362, !367, !372, !379, !384, !385, !386, !388, !389, !390, !391, !393, !394, !395, !399, !400, !401, !402}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !6, line: 263, baseType: !336, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !337, file: !6, line: 268, baseType: !154, size: 192, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !337, file: !6, line: 269, baseType: !154, size: 192, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !337, file: !6, line: 270, baseType: !154, size: 192, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !337, file: !6, line: 274, baseType: !344, size: 576, offset: 640)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 576, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 3)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !337, file: !6, line: 277, baseType: !348, size: 24, offset: 1216)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !345)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !337, file: !6, line: 282, baseType: !350, size: 96, offset: 1248)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 96, elements: !345)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !337, file: !6, line: 283, baseType: !350, size: 96, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !337, file: !6, line: 288, baseType: !353, size: 64, offset: 1472)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !6, line: 178, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !191, !336}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !44, line: 96, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !101, line: 126, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !103, line: 20, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !105, line: 41, baseType: !361)
!361 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !337, file: !6, line: 294, baseType: !363, size: 64, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !6, line: 189, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!357, !336, !191, !119}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !337, file: !6, line: 299, baseType: !368, size: 64, offset: 1600)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !6, line: 212, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!357, !336, !191}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !337, file: !6, line: 305, baseType: !373, size: 64, offset: 1664)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !6, line: 202, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!357, !336, !191, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !337, file: !6, line: 310, baseType: !380, size: 64, offset: 1728)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !6, line: 214, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !336}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !337, file: !6, line: 319, baseType: !380, size: 64, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !337, file: !6, line: 323, baseType: !107, size: 64, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !337, file: !6, line: 325, baseType: !387, size: 64, offset: 1920)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !230)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !337, file: !6, line: 332, baseType: !100, size: 16, offset: 1984)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !337, file: !6, line: 335, baseType: !100, size: 16, offset: 2000)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !337, file: !6, line: 338, baseType: !100, size: 16, offset: 2016)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !337, file: !6, line: 341, baseType: !392, size: 48, offset: 2032)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 48, elements: !238)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !337, file: !6, line: 343, baseType: !134, size: 8, offset: 2080)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !337, file: !6, line: 345, baseType: !134, size: 8, offset: 2088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !6, line: 347, baseType: !396, size: 16, offset: 2096)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 16, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !337, file: !6, line: 350, baseType: !134, size: 8, offset: 2112)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !337, file: !6, line: 353, baseType: !134, size: 8, offset: 2120)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !337, file: !6, line: 357, baseType: !134, size: 8, offset: 2128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !337, file: !6, line: 377, baseType: !403, size: 64, offset: 2176)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !6, line: 222, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!357, !336, !377, !5}
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!408 = !DILocalVariable(name: "p", arg: 1, scope: !333, file: !3, line: 196, type: !191)
!409 = !DILocalVariable(name: "inp", arg: 2, scope: !333, file: !3, line: 196, type: !336)
!410 = !DILocalVariable(name: "udphdr", scope: !333, file: !3, line: 198, type: !108)
!411 = !DILocalVariable(name: "pcb", scope: !333, file: !3, line: 199, type: !169)
!412 = !DILocalVariable(name: "prev", scope: !333, file: !3, line: 199, type: !169)
!413 = !DILocalVariable(name: "uncon_pcb", scope: !333, file: !3, line: 200, type: !169)
!414 = !DILocalVariable(name: "src", scope: !333, file: !3, line: 201, type: !100)
!415 = !DILocalVariable(name: "dest", scope: !333, file: !3, line: 201, type: !100)
!416 = !DILocalVariable(name: "broadcast", scope: !333, file: !3, line: 202, type: !134)
!417 = !DILocalVariable(name: "for_us", scope: !333, file: !3, line: 203, type: !134)
!418 = !DILocation(line: 196, column: 24, scope: !333)
!419 = !DILocation(line: 196, column: 41, scope: !333)
!420 = !DILocation(line: 203, column: 8, scope: !333)
!421 = !DILocation(line: 209, column: 3, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !3, line: 209, column: 3)
!423 = distinct !DILexicalBlock(scope: !333, file: !3, line: 209, column: 3)
!424 = !DILocation(line: 209, column: 3, scope: !423)
!425 = !DILocation(line: 209, column: 3, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !3, line: 209, column: 3)
!427 = distinct !DILexicalBlock(scope: !422, file: !3, line: 209, column: 3)
!428 = !DILocation(line: 209, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !3, line: 209, column: 3)
!430 = distinct !DILexicalBlock(scope: !431, file: !3, line: 209, column: 3)
!431 = distinct !DILexicalBlock(scope: !426, file: !3, line: 209, column: 3)
!432 = !DILocation(line: 210, column: 3, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !3, line: 210, column: 3)
!434 = distinct !DILexicalBlock(scope: !333, file: !3, line: 210, column: 3)
!435 = !DILocation(line: 210, column: 3, scope: !434)
!436 = !DILocation(line: 210, column: 3, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 210, column: 3)
!438 = distinct !DILexicalBlock(scope: !433, file: !3, line: 210, column: 3)
!439 = !DILocation(line: 210, column: 3, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !3, line: 210, column: 3)
!441 = distinct !DILexicalBlock(scope: !442, file: !3, line: 210, column: 3)
!442 = distinct !DILexicalBlock(scope: !437, file: !3, line: 210, column: 3)
!443 = !DILocation(line: 214, column: 3, scope: !333)
!444 = !{!445, !331, i64 122}
!445 = !{!"stats_", !446, i64 0, !446, i64 24, !446, i64 48, !446, i64 72, !446, i64 96, !446, i64 120, !446, i64 144, !447, i64 168, !446, i64 186, !446, i64 210, !446, i64 234, !449, i64 258, !446, i64 286}
!446 = !{!"stats_proto", !331, i64 0, !331, i64 2, !331, i64 4, !331, i64 6, !331, i64 8, !331, i64 10, !331, i64 12, !331, i64 14, !331, i64 16, !331, i64 18, !331, i64 20, !331, i64 22}
!447 = !{!"stats_sys", !448, i64 0, !448, i64 6, !448, i64 12}
!448 = !{!"stats_syselem", !331, i64 0, !331, i64 2, !331, i64 4}
!449 = !{!"stats_igmp", !331, i64 0, !331, i64 2, !331, i64 4, !331, i64 6, !331, i64 8, !331, i64 10, !331, i64 12, !331, i64 14, !331, i64 16, !331, i64 18, !331, i64 20, !331, i64 22, !331, i64 24, !331, i64 26}
!450 = !DILocation(line: 217, column: 10, scope: !451)
!451 = distinct !DILexicalBlock(scope: !333, file: !3, line: 217, column: 7)
!452 = !{!453, !331, i64 18}
