; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vwprintf.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vwprintf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vwprintf.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "vwprintf", scope: !1, file: !1, line: 29, type: !8, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !25)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !16}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !15, line: 83, baseType: !10)
!15 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !18)
!18 = !{!19, !21, !22, !24}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !17, file: !1, baseType: !20, size: 32)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !17, file: !1, baseType: !20, size: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !17, file: !1, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !17, file: !1, baseType: !23, size: 64, offset: 128)
!25 = !{!26, !27, !28}
!26 = !DILocalVariable(name: "fmt", arg: 1, scope: !7, file: !1, line: 29, type: !11)
!27 = !DILocalVariable(name: "ap", arg: 2, scope: !7, file: !1, line: 29, type: !16)
!28 = !DILocalVariable(name: "reent", scope: !7, file: !1, line: 33, type: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !31, line: 569, size: 14912, elements: !32)
!31 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!32 = !{!33, !34, !113, !114, !115, !116, !120, !121, !124, !125, !129, !141, !142, !143, !145, !146, !147, !209, !230, !231, !236, !243}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !30, file: !31, line: 571, baseType: !10, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !30, file: !31, line: 576, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !31, line: 287, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !31, line: 181, size: 1408, elements: !38)
!38 = !{!39, !42, !43, !44, !46, !47, !52, !53, !54, !63, !69, !74, !78, !79, !80, !81, !85, !89, !90, !91, !93, !94, !98, !112}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !37, file: !31, line: 182, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !37, file: !31, line: 183, baseType: !10, size: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !37, file: !31, line: 184, baseType: !10, size: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !31, line: 185, baseType: !45, size: 16, offset: 128)
!45 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !37, file: !31, line: 186, baseType: !45, size: 16, offset: 144)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !37, file: !31, line: 187, baseType: !48, size: 128, offset: 192)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !31, line: 117, size: 128, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !48, file: !31, line: 118, baseType: !40, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !48, file: !31, line: 119, baseType: !10, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !37, file: !31, line: 188, baseType: !10, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !37, file: !31, line: 195, baseType: !23, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !37, file: !31, line: 197, baseType: !55, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !29, !23, !61, !10}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !59, line: 145, baseType: !60)
!59 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !37, file: !31, line: 199, baseType: !64, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!58, !29, !23, !67, !10}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !37, file: !31, line: 202, baseType: !70, size: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !29, !23, !73, !10}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !59, line: 114, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !37, file: !31, line: 203, baseType: !75, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!10, !29, !23}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !37, file: !31, line: 206, baseType: !48, size: 128, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !37, file: !31, line: 207, baseType: !40, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !37, file: !31, line: 208, baseType: !10, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !37, file: !31, line: 211, baseType: !82, size: 24, offset: 928)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 24, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 3)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !37, file: !31, line: 212, baseType: !86, size: 8, offset: 952)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !37, file: !31, line: 215, baseType: !48, size: 128, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !37, file: !31, line: 218, baseType: !10, size: 32, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !31, line: 219, baseType: !92, size: 64, offset: 1152)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !59, line: 44, baseType: !60)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !37, file: !31, line: 222, baseType: !29, size: 64, offset: 1216)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !31, line: 226, baseType: !95, size: 32, offset: 1280)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !59, line: 175, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !97, line: 12, baseType: !10)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !37, file: !31, line: 228, baseType: !99, size: 64, offset: 1312)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !59, line: 171, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 163, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !100, file: !59, line: 165, baseType: !10, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !100, file: !59, line: 170, baseType: !104, size: 32, offset: 32)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !59, line: 166, size: 32, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !104, file: !59, line: 168, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !15, line: 124, baseType: !20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !104, file: !59, line: 169, baseType: !109, size: 32)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 4)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !31, line: 229, baseType: !10, size: 32, offset: 1376)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !30, file: !31, line: 576, baseType: !35, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !30, file: !31, line: 576, baseType: !35, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !30, file: !31, line: 578, baseType: !10, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !30, file: !31, line: 579, baseType: !117, size: 200, offset: 288)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 200, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 25)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !30, file: !31, line: 582, baseType: !10, size: 32, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !30, file: !31, line: 583, baseType: !122, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !31, line: 40, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !30, file: !31, line: 585, baseType: !10, size: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !30, file: !31, line: 587, baseType: !126, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !29}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !30, file: !31, line: 590, baseType: !130, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !31, line: 47, size: 256, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !131, file: !31, line: 49, baseType: !130, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !131, file: !31, line: 50, baseType: !10, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !131, file: !31, line: 50, baseType: !10, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !131, file: !31, line: 50, baseType: !10, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !131, file: !31, line: 50, baseType: !10, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !131, file: !31, line: 51, baseType: !139, size: 32, offset: 192)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 32, elements: !87)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !31, line: 25, baseType: !20)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !30, file: !31, line: 591, baseType: !10, size: 32, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !30, file: !31, line: 592, baseType: !130, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !30, file: !31, line: 593, baseType: !144, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !30, file: !31, line: 596, baseType: !10, size: 32, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !30, file: !31, line: 597, baseType: !61, size: 64, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !30, file: !31, line: 632, baseType: !148, size: 2880, offset: 1152)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !30, file: !31, line: 599, size: 2880, elements: !149)
!149 = !{!150, !200}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !148, file: !31, line: 622, baseType: !151, size: 1728)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !31, line: 601, size: 1728, elements: !152)
!152 = !{!153, !154, !155, !159, !171, !172, !174, !182, !183, !184, !185, !189, !193, !194, !195, !196, !197, !198, !199}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !151, file: !31, line: 603, baseType: !20, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !151, file: !31, line: 604, baseType: !61, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !151, file: !31, line: 605, baseType: !156, size: 208, offset: 128)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 208, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 26)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !151, file: !31, line: 606, baseType: !160, size: 288, offset: 352)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !31, line: 55, size: 288, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !160, file: !31, line: 57, baseType: !10, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !160, file: !31, line: 58, baseType: !10, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !160, file: !31, line: 59, baseType: !10, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !160, file: !31, line: 60, baseType: !10, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !160, file: !31, line: 61, baseType: !10, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !160, file: !31, line: 62, baseType: !10, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !160, file: !31, line: 63, baseType: !10, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !160, file: !31, line: 64, baseType: !10, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !160, file: !31, line: 65, baseType: !10, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !151, file: !31, line: 607, baseType: !10, size: 32, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !151, file: !31, line: 608, baseType: !173, size: 64, offset: 704)
!173 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !151, file: !31, line: 609, baseType: !175, size: 112, offset: 768)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !31, line: 319, size: 112, elements: !176)
!176 = !{!177, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !175, file: !31, line: 320, baseType: !178, size: 48)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 48, elements: !83)
!179 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !175, file: !31, line: 321, baseType: !178, size: 48, offset: 48)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !175, file: !31, line: 322, baseType: !179, size: 16, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !151, file: !31, line: 610, baseType: !99, size: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !151, file: !31, line: 611, baseType: !99, size: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !151, file: !31, line: 612, baseType: !99, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !151, file: !31, line: 613, baseType: !186, size: 64, offset: 1088)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !151, file: !31, line: 614, baseType: !190, size: 192, offset: 1152)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 192, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 24)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !151, file: !31, line: 615, baseType: !10, size: 32, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !151, file: !31, line: 616, baseType: !99, size: 64, offset: 1376)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !151, file: !31, line: 617, baseType: !99, size: 64, offset: 1440)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !151, file: !31, line: 618, baseType: !99, size: 64, offset: 1504)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !151, file: !31, line: 619, baseType: !99, size: 64, offset: 1568)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !151, file: !31, line: 620, baseType: !99, size: 64, offset: 1632)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !151, file: !31, line: 621, baseType: !10, size: 32, offset: 1696)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !148, file: !31, line: 631, baseType: !201, size: 2880)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !31, line: 626, size: 2880, elements: !202)
!202 = !{!203, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !201, file: !31, line: 629, baseType: !204, size: 1920)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1920, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 30)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !201, file: !31, line: 630, baseType: !208, size: 960, offset: 1920)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 960, elements: !205)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !30, file: !31, line: 636, baseType: !210, size: 64, offset: 4032)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !31, line: 93, size: 6336, elements: !212)
!212 = !{!213, !214, !215, !222}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !211, file: !31, line: 94, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !211, file: !31, line: 95, baseType: !10, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !211, file: !31, line: 97, baseType: !216, size: 2048, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 2048, elements: !220)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = !{!221}
!221 = !DISubrange(count: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !211, file: !31, line: 98, baseType: !223, size: 4160, offset: 2176)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !31, line: 74, size: 4160, elements: !224)
!224 = !{!225, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !223, file: !31, line: 75, baseType: !226, size: 2048)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !220)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !223, file: !31, line: 76, baseType: !226, size: 2048, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !223, file: !31, line: 78, baseType: !140, size: 32, offset: 4096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !223, file: !31, line: 81, baseType: !140, size: 32, offset: 4128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !30, file: !31, line: 637, baseType: !211, size: 6336, offset: 4096)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !30, file: !31, line: 641, baseType: !232, size: 64, offset: 10432)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !10}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !30, file: !31, line: 646, baseType: !237, size: 192, offset: 10496)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !31, line: 291, size: 192, elements: !238)
!238 = !{!239, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !237, file: !31, line: 293, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !237, file: !31, line: 294, baseType: !10, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !237, file: !31, line: 295, baseType: !35, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !30, file: !31, line: 648, baseType: !244, size: 4224, offset: 10688)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 4224, elements: !83)
!245 = !DILocation(line: 29, column: 1, scope: !7)
!246 = !DILocation(line: 33, column: 26, scope: !7)
!247 = !DILocation(line: 33, column: 18, scope: !7)
!248 = !DILocation(line: 36, column: 31, scope: !7)
!249 = !{!250, !254, i64 16}
!250 = !{!"_reent", !251, i64 0, !254, i64 8, !254, i64 16, !254, i64 24, !251, i64 32, !252, i64 36, !251, i64 64, !254, i64 72, !251, i64 80, !254, i64 88, !254, i64 96, !251, i64 104, !254, i64 112, !254, i64 120, !251, i64 128, !254, i64 136, !252, i64 144, !254, i64 504, !255, i64 512, !254, i64 1304, !257, i64 1312, !252, i64 1336}
!251 = !{!"int", !252, i64 0}
!252 = !{!"omnipotent char", !253, i64 0}
!253 = !{!"Simple C/C++ TBAA"}
!254 = !{!"any pointer", !252, i64 0}
!255 = !{!"_atexit", !254, i64 0, !251, i64 8, !252, i64 16, !256, i64 272}
!256 = !{!"_on_exit_args", !252, i64 0, !252, i64 256, !251, i64 512, !251, i64 516}
!257 = !{!"_glue", !254, i64 0, !251, i64 8, !254, i64 16}
!258 = !DILocation(line: 36, column: 10, scope: !7)
!259 = !DILocation(line: 36, column: 3, scope: !7)
!260 = distinct !DISubprogram(name: "_vwprintf_r", scope: !1, file: !1, line: 42, type: !261, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{!10, !29, !12, !16}
!263 = !{!264, !265, !266}
!264 = !DILocalVariable(name: "ptr", arg: 1, scope: !260, file: !1, line: 42, type: !29)
!265 = !DILocalVariable(name: "fmt", arg: 2, scope: !260, file: !1, line: 42, type: !12)
!266 = !DILocalVariable(name: "ap", arg: 3, scope: !260, file: !1, line: 42, type: !16)
!267 = !DILocation(line: 42, column: 1, scope: !260)
!268 = !DILocation(line: 48, column: 29, scope: !260)
!269 = !DILocation(line: 48, column: 10, scope: !260)
!270 = !DILocation(line: 48, column: 3, scope: !260)
