; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/wcsftime.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/wcsftime.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_time_T = type { [12 x i8*], [12 x i8*], [7 x i8*], [7 x i8*], i8*, i8*, i8*, [2 x i8*], i8*, [12 x i8*], i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/wcsftime.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !9, !12, !11}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 40, baseType: !6)
!5 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !7, line: 129, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !10, line: 124, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 4}
!16 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!17 = distinct !DISubprogram(name: "__ctloc", scope: !18, file: !18, line: 331, type: !19, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !30)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/../time/strftime.c", directory: "/root/.unikraft/apps/redis/build")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !25, !26, !29}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !10, line: 83, baseType: !24)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!30 = !{!31, !32, !33}
!31 = !DILocalVariable(name: "buf", arg: 1, scope: !17, file: !18, line: 331, type: !25)
!32 = !DILocalVariable(name: "elem", arg: 2, scope: !17, file: !18, line: 331, type: !26)
!33 = !DILocalVariable(name: "len_ret", arg: 3, scope: !17, file: !18, line: 331, type: !29)
!34 = !DILocation(line: 331, column: 23, scope: !17)
!35 = !DILocation(line: 331, column: 40, scope: !17)
!36 = !DILocation(line: 331, column: 54, scope: !17)
!37 = !DILocation(line: 333, column: 7, scope: !17)
!38 = !DILocation(line: 333, column: 28, scope: !17)
!39 = !{!40, !40, i64 0}
!40 = !{!"int", !41, i64 0}
!41 = !{!"omnipotent char", !42, i64 0}
!42 = !{!"Simple C/C++ TBAA"}
!43 = !DILocation(line: 334, column: 18, scope: !17)
!44 = !DILocation(line: 335, column: 20, scope: !45)
!45 = distinct !DILexicalBlock(scope: !17, file: !18, line: 335, column: 11)
!46 = !DILocation(line: 335, column: 11, scope: !17)
!47 = !DILocation(line: 0, scope: !17)
!48 = !{!49, !49, i64 0}
!49 = !{!"long", !41, i64 0}
!50 = !DILocation(line: 337, column: 7, scope: !17)
!51 = distinct !DISubprogram(name: "wcsftime", scope: !18, file: !18, line: 1442, type: !52, isLocal: false, isDefinition: true, scopeLine: 1447, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !75)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !55, !4, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 58, baseType: !8)
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !25)
!56 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !21)
!57 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !61, line: 31, size: 448, elements: !62)
!61 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/musl-imported/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !74}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !60, file: !61, line: 32, baseType: !24, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !60, file: !61, line: 33, baseType: !24, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !60, file: !61, line: 34, baseType: !24, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !60, file: !61, line: 35, baseType: !24, size: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !60, file: !61, line: 36, baseType: !24, size: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !60, file: !61, line: 37, baseType: !24, size: 32, offset: 160)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !60, file: !61, line: 38, baseType: !24, size: 32, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !60, file: !61, line: 39, baseType: !24, size: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !60, file: !61, line: 40, baseType: !24, size: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !60, file: !61, line: 41, baseType: !73, size: 64, offset: 320)
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !60, file: !61, line: 42, baseType: !26, size: 64, offset: 384)
!75 = !{!76, !77, !78, !79}
!76 = !DILocalVariable(name: "s", arg: 1, scope: !51, file: !18, line: 1442, type: !55)
!77 = !DILocalVariable(name: "maxsize", arg: 2, scope: !51, file: !18, line: 1442, type: !4)
!78 = !DILocalVariable(name: "format", arg: 3, scope: !51, file: !18, line: 1442, type: !56)
!79 = !DILocalVariable(name: "tim_p", arg: 4, scope: !51, file: !18, line: 1442, type: !57)
!80 = !DILocation(line: 1442, column: 1, scope: !51)
!81 = !DILocation(line: 230, column: 10, scope: !82, inlinedAt: !350)
!82 = distinct !DISubprogram(name: "__get_current_locale", scope: !83, file: !83, line: 228, type: !84, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !2)
!83 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/time/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !DISubroutineType(types: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !83, line: 178, size: 3392, elements: !88)
!88 = !{!89, !94, !309, !313, !314, !315, !343, !347, !349}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !87, file: !83, line: 180, baseType: !90, size: 1792)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1792, elements: !91)
!91 = !{!92, !93}
!92 = !DISubrange(count: 7)
!93 = !DISubrange(count: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !87, file: !83, line: 181, baseType: !95, size: 64, offset: 1792)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!24, !98, !129, !23, !306}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !100, line: 569, size: 14912, elements: !101)
!100 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!101 = !{!102, !103, !177, !178, !179, !180, !184, !185, !186, !187, !191, !203, !204, !205, !207, !208, !209, !271, !291, !292, !297, !304}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !99, file: !100, line: 571, baseType: !24, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !99, file: !100, line: 576, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !100, line: 287, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !100, line: 181, size: 1408, elements: !107)
!107 = !{!108, !111, !112, !113, !115, !116, !121, !122, !124, !130, !134, !139, !143, !144, !145, !146, !150, !154, !155, !156, !158, !159, !163, !176}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !106, file: !100, line: 182, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !106, file: !100, line: 183, baseType: !24, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !106, file: !100, line: 184, baseType: !24, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !106, file: !100, line: 185, baseType: !114, size: 16, offset: 128)
!114 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !106, file: !100, line: 186, baseType: !114, size: 16, offset: 144)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !106, file: !100, line: 187, baseType: !117, size: 128, offset: 192)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !100, line: 117, size: 128, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !117, file: !100, line: 118, baseType: !109, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !117, file: !100, line: 119, baseType: !24, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !106, file: !100, line: 188, baseType: !24, size: 32, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !106, file: !100, line: 195, baseType: !123, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !106, file: !100, line: 197, baseType: !125, size: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !98, !123, !129, !24}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !7, line: 145, baseType: !73)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !106, file: !100, line: 199, baseType: !131, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!128, !98, !123, !26, !24}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !106, file: !100, line: 202, baseType: !135, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !98, !123, !138, !24}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !7, line: 114, baseType: !73)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !106, file: !100, line: 203, baseType: !140, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!24, !98, !123}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !106, file: !100, line: 206, baseType: !117, size: 128, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !106, file: !100, line: 207, baseType: !109, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !106, file: !100, line: 208, baseType: !24, size: 32, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !106, file: !100, line: 211, baseType: !147, size: 24, offset: 928)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 24, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 3)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !106, file: !100, line: 212, baseType: !151, size: 8, offset: 952)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !106, file: !100, line: 215, baseType: !117, size: 128, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !106, file: !100, line: 218, baseType: !24, size: 32, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !106, file: !100, line: 219, baseType: !157, size: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !7, line: 44, baseType: !73)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !106, file: !100, line: 222, baseType: !98, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !106, file: !100, line: 226, baseType: !160, size: 32, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !7, line: 175, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !162, line: 12, baseType: !24)
!162 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !106, file: !100, line: 228, baseType: !164, size: 64, offset: 1312)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !7, line: 171, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 163, size: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !165, file: !7, line: 165, baseType: !24, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !165, file: !7, line: 170, baseType: !169, size: 32, offset: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !7, line: 166, size: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !169, file: !7, line: 168, baseType: !9, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !169, file: !7, line: 169, baseType: !173, size: 32)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 4)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !106, file: !100, line: 229, baseType: !24, size: 32, offset: 1376)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !99, file: !100, line: 576, baseType: !104, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !99, file: !100, line: 576, baseType: !104, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !99, file: !100, line: 578, baseType: !24, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !99, file: !100, line: 579, baseType: !181, size: 200, offset: 288)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 200, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 25)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !99, file: !100, line: 582, baseType: !24, size: 32, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !99, file: !100, line: 583, baseType: !86, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !99, file: !100, line: 585, baseType: !24, size: 32, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !99, file: !100, line: 587, baseType: !188, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !98}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !99, file: !100, line: 590, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !100, line: 47, size: 256, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !193, file: !100, line: 49, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !193, file: !100, line: 50, baseType: !24, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !193, file: !100, line: 50, baseType: !24, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !193, file: !100, line: 50, baseType: !24, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !193, file: !100, line: 50, baseType: !24, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !193, file: !100, line: 51, baseType: !201, size: 32, offset: 192)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 32, elements: !152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !100, line: 25, baseType: !11)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !99, file: !100, line: 591, baseType: !24, size: 32, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !99, file: !100, line: 592, baseType: !192, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !99, file: !100, line: 593, baseType: !206, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !99, file: !100, line: 596, baseType: !24, size: 32, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !99, file: !100, line: 597, baseType: !129, size: 64, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !99, file: !100, line: 632, baseType: !210, size: 2880, offset: 1152)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !100, line: 599, size: 2880, elements: !211)
!211 = !{!212, !262}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !210, file: !100, line: 622, baseType: !213, size: 1728)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !100, line: 601, size: 1728, elements: !214)
!214 = !{!215, !216, !217, !221, !233, !234, !236, !244, !245, !246, !247, !251, !255, !256, !257, !258, !259, !260, !261}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !213, file: !100, line: 603, baseType: !11, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !213, file: !100, line: 604, baseType: !129, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !213, file: !100, line: 605, baseType: !218, size: 208, offset: 128)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 208, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 26)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !213, file: !100, line: 606, baseType: !222, size: 288, offset: 352)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !100, line: 55, size: 288, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !222, file: !100, line: 57, baseType: !24, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !222, file: !100, line: 58, baseType: !24, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !222, file: !100, line: 59, baseType: !24, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !222, file: !100, line: 60, baseType: !24, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !222, file: !100, line: 61, baseType: !24, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !222, file: !100, line: 62, baseType: !24, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !222, file: !100, line: 63, baseType: !24, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !222, file: !100, line: 64, baseType: !24, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !222, file: !100, line: 65, baseType: !24, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !213, file: !100, line: 607, baseType: !24, size: 32, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !213, file: !100, line: 608, baseType: !235, size: 64, offset: 704)
!235 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !213, file: !100, line: 609, baseType: !237, size: 112, offset: 768)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !100, line: 319, size: 112, elements: !238)
!238 = !{!239, !242, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !237, file: !100, line: 320, baseType: !240, size: 48)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 48, elements: !148)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !237, file: !100, line: 321, baseType: !240, size: 48, offset: 48)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !237, file: !100, line: 322, baseType: !241, size: 16, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !213, file: !100, line: 610, baseType: !164, size: 64, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !213, file: !100, line: 611, baseType: !164, size: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !213, file: !100, line: 612, baseType: !164, size: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !213, file: !100, line: 613, baseType: !248, size: 64, offset: 1088)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !213, file: !100, line: 614, baseType: !252, size: 192, offset: 1152)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 24)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !213, file: !100, line: 615, baseType: !24, size: 32, offset: 1344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !213, file: !100, line: 616, baseType: !164, size: 64, offset: 1376)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !213, file: !100, line: 617, baseType: !164, size: 64, offset: 1440)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !213, file: !100, line: 618, baseType: !164, size: 64, offset: 1504)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !213, file: !100, line: 619, baseType: !164, size: 64, offset: 1568)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !213, file: !100, line: 620, baseType: !164, size: 64, offset: 1632)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !213, file: !100, line: 621, baseType: !24, size: 32, offset: 1696)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !210, file: !100, line: 631, baseType: !263, size: 2880)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !100, line: 626, size: 2880, elements: !264)
!264 = !{!265, !269}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !263, file: !100, line: 629, baseType: !266, size: 1920)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 1920, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 30)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !263, file: !100, line: 630, baseType: !270, size: 960, offset: 1920)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 960, elements: !267)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !99, file: !100, line: 636, baseType: !272, size: 64, offset: 4032)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !100, line: 93, size: 6336, elements: !274)
!274 = !{!275, !276, !277, !283}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !273, file: !100, line: 94, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !273, file: !100, line: 95, baseType: !24, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !273, file: !100, line: 97, baseType: !278, size: 2048, offset: 128)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 2048, elements: !282)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null}
!282 = !{!93}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !273, file: !100, line: 98, baseType: !284, size: 4160, offset: 2176)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !100, line: 74, size: 4160, elements: !285)
!285 = !{!286, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !284, file: !100, line: 75, baseType: !287, size: 2048)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !282)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !284, file: !100, line: 76, baseType: !287, size: 2048, offset: 2048)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !284, file: !100, line: 78, baseType: !202, size: 32, offset: 4096)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !284, file: !100, line: 81, baseType: !202, size: 32, offset: 4128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !99, file: !100, line: 637, baseType: !273, size: 6336, offset: 4096)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !99, file: !100, line: 641, baseType: !293, size: 64, offset: 10432)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !24}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !99, file: !100, line: 646, baseType: !298, size: 192, offset: 10496)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !100, line: 291, size: 192, elements: !299)
!299 = !{!300, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !298, file: !100, line: 293, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !298, file: !100, line: 294, baseType: !24, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !298, file: !100, line: 295, baseType: !104, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !99, file: !100, line: 648, baseType: !305, size: 4224, offset: 10688)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 4224, elements: !148)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !308, line: 86, baseType: !164)
!308 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !87, file: !83, line: 183, baseType: !310, size: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!24, !98, !25, !26, !4, !306}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !87, file: !83, line: 185, baseType: !24, size: 32, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !87, file: !83, line: 186, baseType: !129, size: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !87, file: !83, line: 187, baseType: !316, size: 768, offset: 2048)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !317, line: 42, size: 768, elements: !318)
!317 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !316, file: !317, line: 44, baseType: !129, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !316, file: !317, line: 45, baseType: !129, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !316, file: !317, line: 46, baseType: !129, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !316, file: !317, line: 47, baseType: !129, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !316, file: !317, line: 48, baseType: !129, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !316, file: !317, line: 49, baseType: !129, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !316, file: !317, line: 50, baseType: !129, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !316, file: !317, line: 51, baseType: !129, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !316, file: !317, line: 52, baseType: !129, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !316, file: !317, line: 53, baseType: !129, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !316, file: !317, line: 54, baseType: !28, size: 8, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !316, file: !317, line: 55, baseType: !28, size: 8, offset: 648)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !316, file: !317, line: 56, baseType: !28, size: 8, offset: 656)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !316, file: !317, line: 57, baseType: !28, size: 8, offset: 664)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !316, file: !317, line: 58, baseType: !28, size: 8, offset: 672)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !316, file: !317, line: 59, baseType: !28, size: 8, offset: 680)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !316, file: !317, line: 60, baseType: !28, size: 8, offset: 688)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !316, file: !317, line: 61, baseType: !28, size: 8, offset: 696)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !316, file: !317, line: 62, baseType: !28, size: 8, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !316, file: !317, line: 63, baseType: !28, size: 8, offset: 712)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !316, file: !317, line: 64, baseType: !28, size: 8, offset: 720)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !316, file: !317, line: 65, baseType: !28, size: 8, offset: 728)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !316, file: !317, line: 66, baseType: !28, size: 8, offset: 736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !316, file: !317, line: 67, baseType: !28, size: 8, offset: 744)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !87, file: !83, line: 189, baseType: !344, size: 16, offset: 2816)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 16, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 2)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !87, file: !83, line: 190, baseType: !348, size: 256, offset: 2832)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !282)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !87, file: !83, line: 191, baseType: !348, size: 256, offset: 3088)
!350 = distinct !DILocation(line: 1459, column: 10, scope: !51)
!351 = !DILocation(line: 230, column: 18, scope: !82, inlinedAt: !350)
!352 = !{!353, !354, i64 72}
!353 = !{!"_reent", !40, i64 0, !354, i64 8, !354, i64 16, !354, i64 24, !40, i64 32, !41, i64 36, !40, i64 64, !354, i64 72, !40, i64 80, !354, i64 88, !354, i64 96, !40, i64 104, !354, i64 112, !354, i64 120, !40, i64 128, !354, i64 136, !41, i64 144, !354, i64 504, !355, i64 512, !354, i64 1304, !357, i64 1312, !41, i64 1336}
!354 = !{!"any pointer", !41, i64 0}
!355 = !{!"_atexit", !354, i64 0, !40, i64 8, !41, i64 16, !356, i64 272}
!356 = !{!"_on_exit_args", !41, i64 0, !41, i64 256, !40, i64 512, !40, i64 516}
!357 = !{!"_glue", !354, i64 0, !40, i64 8, !354, i64 16}
!358 = !DILocation(line: 213, column: 3, scope: !359, inlinedAt: !360)
!359 = distinct !DISubprogram(name: "__get_global_locale", scope: !83, file: !83, line: 210, type: !84, isLocal: true, isDefinition: true, scopeLine: 211, isOptimized: true, unit: !0, retainedNodes: !2)
!360 = distinct !DILocation(line: 230, column: 29, scope: !82, inlinedAt: !350)
!361 = !DILocation(line: 230, column: 3, scope: !82, inlinedAt: !350)
!362 = !DILocation(line: 1459, column: 10, scope: !51)
!363 = !DILocation(line: 1459, column: 3, scope: !51)
!364 = distinct !DISubprogram(name: "__strftime", scope: !18, file: !18, line: 685, type: !365, isLocal: true, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{!4, !25, !4, !21, !58, !86}
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !380, !381, !382, !383, !384, !385, !386, !414, !420, !424, !425, !426, !427, !430, !431, !433, !434, !436, !437, !438, !439, !443, !444, !445, !447, !449, !473, !475, !476, !477, !479, !482, !484, !485, !486, !487, !490, !491, !494}
!368 = !DILocalVariable(name: "s", arg: 1, scope: !364, file: !18, line: 685, type: !25)
!369 = !DILocalVariable(name: "maxsize", arg: 2, scope: !364, file: !18, line: 685, type: !4)
!370 = !DILocalVariable(name: "format", arg: 3, scope: !364, file: !18, line: 685, type: !21)
!371 = !DILocalVariable(name: "tim_p", arg: 4, scope: !364, file: !18, line: 686, type: !58)
!372 = !DILocalVariable(name: "locale", arg: 5, scope: !364, file: !18, line: 686, type: !86)
!373 = !DILocalVariable(name: "count", scope: !364, file: !18, line: 691, type: !4)
!374 = !DILocalVariable(name: "len", scope: !364, file: !18, line: 692, type: !24)
!375 = !DILocalVariable(name: "ctloc", scope: !364, file: !18, line: 693, type: !21)
!376 = !DILocalVariable(name: "ctlocbuf", scope: !364, file: !18, line: 695, type: !377)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 256)
!380 = !DILocalVariable(name: "i", scope: !364, file: !18, line: 697, type: !4)
!381 = !DILocalVariable(name: "ctloclen", scope: !364, file: !18, line: 697, type: !4)
!382 = !DILocalVariable(name: "alt", scope: !364, file: !18, line: 698, type: !23)
!383 = !DILocalVariable(name: "pad", scope: !364, file: !18, line: 699, type: !23)
!384 = !DILocalVariable(name: "width", scope: !364, file: !18, line: 700, type: !8)
!385 = !DILocalVariable(name: "tzset_called", scope: !364, file: !18, line: 701, type: !24)
!386 = !DILocalVariable(name: "_CurrentTimeLocale", scope: !364, file: !18, line: 703, type: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_time_T", file: !83, line: 116, size: 4032, elements: !390)
!390 = !{!391, !395, !396, !399, !400, !401, !402, !403, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !389, file: !83, line: 118, baseType: !392, size: 768)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 768, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 12)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !389, file: !83, line: 119, baseType: !392, size: 768, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wday", scope: !389, file: !83, line: 120, baseType: !397, size: 448, offset: 1536)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 448, elements: !398)
!398 = !{!92}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !389, file: !83, line: 121, baseType: !397, size: 448, offset: 1984)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "X_fmt", scope: !389, file: !83, line: 122, baseType: !26, size: 64, offset: 2432)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "x_fmt", scope: !389, file: !83, line: 123, baseType: !26, size: 64, offset: 2496)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "c_fmt", scope: !389, file: !83, line: 124, baseType: !26, size: 64, offset: 2560)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "am_pm", scope: !389, file: !83, line: 125, baseType: !404, size: 128, offset: 2624)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !345)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "date_fmt", scope: !389, file: !83, line: 126, baseType: !26, size: 64, offset: 2752)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "alt_month", scope: !389, file: !83, line: 127, baseType: !392, size: 768, offset: 2816)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "md_order", scope: !389, file: !83, line: 128, baseType: !26, size: 64, offset: 3584)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ampm_fmt", scope: !389, file: !83, line: 129, baseType: !26, size: 64, offset: 3648)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !389, file: !83, line: 130, baseType: !26, size: 64, offset: 3712)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !389, file: !83, line: 131, baseType: !26, size: 64, offset: 3776)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !389, file: !83, line: 132, baseType: !26, size: 64, offset: 3840)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !389, file: !83, line: 133, baseType: !26, size: 64, offset: 3904)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !389, file: !83, line: 134, baseType: !26, size: 64, offset: 3968)
!414 = !DILocalVariable(name: "fp", scope: !415, file: !18, line: 727, type: !25)
!415 = distinct !DILexicalBlock(scope: !416, file: !18, line: 726, column: 8)
!416 = distinct !DILexicalBlock(scope: !417, file: !18, line: 725, column: 11)
!417 = distinct !DILexicalBlock(scope: !418, file: !18, line: 705, column: 5)
!418 = distinct !DILexicalBlock(scope: !419, file: !18, line: 704, column: 3)
!419 = distinct !DILexicalBlock(scope: !364, file: !18, line: 704, column: 3)
!420 = !DILocalVariable(name: "fmt", scope: !421, file: !18, line: 870, type: !25)
!421 = distinct !DILexicalBlock(scope: !422, file: !18, line: 869, column: 8)
!422 = distinct !DILexicalBlock(scope: !423, file: !18, line: 842, column: 4)
!423 = distinct !DILexicalBlock(scope: !417, file: !18, line: 761, column: 2)
!424 = !DILocalVariable(name: "pos", scope: !421, file: !18, line: 871, type: !129)
!425 = !DILocalVariable(name: "neg", scope: !421, file: !18, line: 872, type: !24)
!426 = !DILocalVariable(name: "century", scope: !421, file: !18, line: 873, type: !24)
!427 = !DILocalVariable(name: "fmtbuf", scope: !428, file: !18, line: 931, type: !429)
!428 = distinct !DILexicalBlock(scope: !423, file: !18, line: 929, column: 4)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1024, elements: !282)
!430 = !DILocalVariable(name: "fmt", scope: !428, file: !18, line: 931, type: !25)
!431 = !DILocalVariable(name: "adjust", scope: !432, file: !18, line: 962, type: !24)
!432 = distinct !DILexicalBlock(scope: !423, file: !18, line: 961, column: 4)
!433 = !DILocalVariable(name: "year", scope: !432, file: !18, line: 963, type: !24)
!434 = !DILocalVariable(name: "sign", scope: !435, file: !18, line: 979, type: !24)
!435 = distinct !DILexicalBlock(scope: !423, file: !18, line: 975, column: 4)
!436 = !DILocalVariable(name: "adjust", scope: !435, file: !18, line: 980, type: !24)
!437 = !DILocalVariable(name: "century", scope: !435, file: !18, line: 981, type: !24)
!438 = !DILocalVariable(name: "year", scope: !435, file: !18, line: 984, type: !24)
!439 = !DILocalVariable(name: "fmtbuf", scope: !435, file: !18, line: 1001, type: !440)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 320, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 10)
!443 = !DILocalVariable(name: "fmt", scope: !435, file: !18, line: 1001, type: !25)
!444 = !DILocalVariable(name: "p_year", scope: !435, file: !18, line: 1003, type: !11)
!445 = !DILocalVariable(name: "h12", scope: !446, file: !18, line: 1046, type: !24)
!446 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1045, column: 4)
!447 = !DILocalVariable(name: "offset", scope: !448, file: !18, line: 1134, type: !73)
!448 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1133, column: 4)
!449 = !DILocalVariable(name: "tz", scope: !450, file: !18, line: 1157, type: !452)
!450 = distinct !DILexicalBlock(scope: !451, file: !18, line: 1138, column: 8)
!451 = distinct !DILexicalBlock(scope: !448, file: !18, line: 1137, column: 10)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzinfo_type", file: !454, line: 65, baseType: !455)
!454 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/time.h", directory: "/root/.unikraft/apps/redis/build")
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzinfo_struct", file: !454, line: 60, size: 704, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__tznorth", scope: !455, file: !454, line: 62, baseType: !24, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__tzyear", scope: !455, file: !454, line: 63, baseType: !24, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__tzrule", scope: !455, file: !454, line: 64, baseType: !460, size: 640, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 640, elements: !345)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__tzrule_type", file: !454, line: 58, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tzrule_struct", file: !454, line: 49, size: 320, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !472}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !462, file: !454, line: 51, baseType: !28, size: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !462, file: !454, line: 52, baseType: !24, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !462, file: !454, line: 53, baseType: !24, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !462, file: !454, line: 54, baseType: !24, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !462, file: !454, line: 55, baseType: !24, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !462, file: !454, line: 56, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !471, line: 34, baseType: !73)
!471 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!472 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !462, file: !454, line: 57, baseType: !73, size: 64, offset: 256)
!473 = !DILocalVariable(name: "adjust", scope: !474, file: !18, line: 1234, type: !24)
!474 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1233, column: 4)
!475 = !DILocalVariable(name: "wday", scope: !474, file: !18, line: 1235, type: !24)
!476 = !DILocalVariable(name: "week", scope: !474, file: !18, line: 1236, type: !24)
!477 = !DILocalVariable(name: "wday", scope: !478, file: !18, line: 1275, type: !24)
!478 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1274, column: 4)
!479 = !DILocalVariable(name: "year", scope: !480, file: !18, line: 1297, type: !24)
!480 = distinct !DILexicalBlock(scope: !481, file: !18, line: 1294, column: 3)
!481 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1287, column: 6)
!482 = !DILocalVariable(name: "fmtbuf", scope: !483, file: !18, line: 1320, type: !440)
!483 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1319, column: 6)
!484 = !DILocalVariable(name: "fmt", scope: !483, file: !18, line: 1320, type: !25)
!485 = !DILocalVariable(name: "sign", scope: !483, file: !18, line: 1321, type: !24)
!486 = !DILocalVariable(name: "year", scope: !483, file: !18, line: 1323, type: !11)
!487 = !DILocalVariable(name: "offset", scope: !488, file: !18, line: 1349, type: !73)
!488 = distinct !DILexicalBlock(scope: !489, file: !18, line: 1348, column: 13)
!489 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1347, column: 15)
!490 = !DILocalVariable(name: "tz", scope: !488, file: !18, line: 1369, type: !452)
!491 = !DILocalVariable(name: "size", scope: !492, file: !18, line: 1385, type: !4)
!492 = distinct !DILexicalBlock(scope: !493, file: !18, line: 1384, column: 6)
!493 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1383, column: 8)
!494 = !DILocalVariable(name: "tznam", scope: !492, file: !18, line: 1386, type: !26)
!495 = !DILocation(line: 685, column: 19, scope: !364)
!496 = !DILocation(line: 685, column: 29, scope: !364)
!497 = !DILocation(line: 685, column: 50, scope: !364)
!498 = !DILocation(line: 686, column: 23, scope: !364)
!499 = !DILocation(line: 686, column: 49, scope: !364)
!500 = !DILocation(line: 691, column: 10, scope: !364)
!501 = !DILocation(line: 692, column: 7, scope: !364)
!502 = !DILocation(line: 695, column: 3, scope: !364)
!503 = !DILocation(line: 695, column: 8, scope: !364)
!504 = !DILocation(line: 701, column: 7, scope: !364)
!505 = !DILocalVariable(name: "locale", arg: 1, scope: !506, file: !83, line: 364, type: !86)
!506 = distinct !DISubprogram(name: "__get_time_locale", scope: !83, file: !83, line: 364, type: !507, isLocal: true, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!387, !86}
!509 = !{!505}
!510 = !DILocation(line: 364, column: 39, scope: !506, inlinedAt: !511)
!511 = distinct !DILocation(line: 703, column: 48, scope: !364)
!512 = !DILocation(line: 366, column: 3, scope: !506, inlinedAt: !511)
!513 = !DILocation(line: 703, column: 27, scope: !364)
!514 = !DILocation(line: 704, column: 3, scope: !364)
!515 = !DILocation(line: 0, scope: !516)
!516 = distinct !DILexicalBlock(scope: !423, file: !18, line: 1422, column: 8)
!517 = !DILocation(line: 706, column: 7, scope: !417)
!518 = !DILocation(line: 0, scope: !519)
!519 = distinct !DILexicalBlock(scope: !520, file: !18, line: 708, column: 8)
!520 = distinct !DILexicalBlock(scope: !417, file: !18, line: 707, column: 2)
!521 = !DILocation(line: 706, column: 14, scope: !417)
!522 = !DILocation(line: 706, column: 22, scope: !417)
!523 = !DILocation(line: 708, column: 14, scope: !519)
!524 = !DILocation(line: 708, column: 8, scope: !520)
!525 = !DILocation(line: 709, column: 26, scope: !519)
!526 = !DILocation(line: 709, column: 13, scope: !519)
!527 = !DILocation(line: 709, column: 6, scope: !519)
!528 = !DILocation(line: 709, column: 17, scope: !519)
