; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "last_write_error_log", scope: !2, file: !3, line: 409, type: !79, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "flushAppendOnlyFile", scope: !3, file: !3, line: 337, type: !4, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !69)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/aof.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !68)
!8 = !{}
!9 = !{!10, !11, !15, !16, !17, !18, !6, !20, !22, !23, !24, !39, !49, !59}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !12, line: 200, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !14, line: 145, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !26, line: 51, size: 24, elements: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !{!28, !33, !34, !35}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, file: !26, line: 52, baseType: !29, size: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 24, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !32, line: 43, baseType: !19)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !25, file: !26, line: 53, baseType: !29, size: 8, offset: 8)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !25, file: !26, line: 54, baseType: !19, size: 8, offset: 16)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !25, file: !26, line: 55, baseType: !36, offset: 24)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: -1)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !26, line: 57, size: 40, elements: !41)
!41 = !{!42, !46, !47, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !26, line: 58, baseType: !43, size: 16)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 36, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !32, line: 57, baseType: !45)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !26, line: 59, baseType: !43, size: 16, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !26, line: 60, baseType: !19, size: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !26, line: 61, baseType: !36, offset: 40)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !26, line: 63, size: 72, elements: !51)
!51 = !{!52, !56, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !26, line: 64, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 48, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !32, line: 79, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !50, file: !26, line: 65, baseType: !53, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !26, line: 66, baseType: !19, size: 8, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !50, file: !26, line: 67, baseType: !36, offset: 72)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !26, line: 69, size: 136, elements: !61)
!61 = !{!62, !65, !66, !67}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, file: !26, line: 70, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 60, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !32, line: 105, baseType: !17)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !60, file: !26, line: 71, baseType: !63, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !26, line: 72, baseType: !19, size: 8, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !60, file: !26, line: 73, baseType: !36, offset: 136)
!68 = !{!0}
!69 = !{!70, !71, !72, !73, !76}
!70 = !DILocalVariable(name: "force", arg: 1, scope: !2, file: !3, line: 337, type: !6)
!71 = !DILocalVariable(name: "nwritten", scope: !2, file: !3, line: 338, type: !11)
!72 = !DILocalVariable(name: "sync_in_progress", scope: !2, file: !3, line: 339, type: !6)
!73 = !DILocalVariable(name: "latency", scope: !2, file: !3, line: 340, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !75, line: 52, baseType: !16)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DILocalVariable(name: "can_log", scope: !77, file: !3, line: 410, type: !6)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 408, column: 54)
!78 = distinct !DILexicalBlock(scope: !2, file: !3, line: 408, column: 9)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !80, line: 34, baseType: !15)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!85 = distinct !DISubprogram(name: "aofRewriteBufferReset", scope: !3, file: !3, line: 70, type: !86, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!86 = !DISubroutineType(types: !87)
!87 = !{null}
!88 = !DILocation(line: 71, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !85, file: !3, line: 71, column: 9)
!90 = !{!91, !95, i64 1944}
!91 = !{!"redisServer", !92, i64 0, !95, i64 8, !95, i64 16, !95, i64 24, !92, i64 32, !92, i64 36, !92, i64 40, !95, i64 48, !95, i64 56, !95, i64 64, !95, i64 72, !92, i64 80, !92, i64 84, !92, i64 88, !92, i64 92, !95, i64 96, !95, i64 104, !92, i64 112, !92, i64 116, !93, i64 120, !92, i64 164, !96, i64 168, !92, i64 176, !95, i64 184, !95, i64 192, !95, i64 200, !93, i64 208, !92, i64 216, !92, i64 220, !93, i64 224, !92, i64 352, !95, i64 360, !92, i64 368, !93, i64 372, !92, i64 436, !92, i64 440, !93, i64 444, !92, i64 508, !95, i64 512, !95, i64 520, !95, i64 528, !95, i64 536, !95, i64 544, !95, i64 552, !95, i64 560, !92, i64 568, !97, i64 576, !93, i64 584, !95, i64 840, !96, i64 848, !92, i64 856, !92, i64 860, !96, i64 864, !96, i64 872, !96, i64 880, !96, i64 888, !95, i64 896, !95, i64 904, !95, i64 912, !95, i64 920, !95, i64 928, !95, i64 936, !95, i64 944, !95, i64 952, !95, i64 960, !95, i64 968, !95, i64 976, !95, i64 984, !95, i64 992, !96, i64 1000, !97, i64 1008, !97, i64 1016, !97, i64 1024, !98, i64 1032, !97, i64 1040, !97, i64 1048, !97, i64 1056, !97, i64 1064, !97, i64 1072, !97, i64 1080, !97, i64 1088, !97, i64 1096, !97, i64 1104, !96, i64 1112, !97, i64 1120, !98, i64 1128, !97, i64 1136, !97, i64 1144, !97, i64 1152, !97, i64 1160, !95, i64 1168, !97, i64 1176, !97, i64 1184, !96, i64 1192, !99, i64 1200, !97, i64 1240, !97, i64 1248, !96, i64 1256, !96, i64 1264, !93, i64 1272, !92, i64 1728, !92, i64 1732, !92, i64 1736, !92, i64 1740, !92, i64 1744, !96, i64 1752, !92, i64 1760, !92, i64 1764, !92, i64 1768, !92, i64 1772, !96, i64 1776, !96, i64 1784, !92, i64 1792, !92, i64 1796, !92, i64 1800, !92, i64 1804, !93, i64 1808, !92, i64 1880, !92, i64 1884, !95, i64 1888, !92, i64 1896, !92, i64 1900, !96, i64 1904, !96, i64 1912, !96, i64 1920, !96, i64 1928, !92, i64 1936, !92, i64 1940, !95, i64 1944, !95, i64 1952, !92, i64 1960, !92, i64 1964, !96, i64 1968, !96, i64 1976, !96, i64 1984, !96, i64 1992, !92, i64 2000, !96, i64 2008, !92, i64 2016, !92, i64 2020, !92, i64 2024, !92, i64 2028, !92, i64 2032, !92, i64 2036, !92, i64 2040, !92, i64 2044, !92, i64 2048, !92, i64 2052, !92, i64 2056, !92, i64 2060, !92, i64 2064, !95, i64 2072, !97, i64 2080, !97, i64 2088, !92, i64 2096, !95, i64 2104, !92, i64 2112, !95, i64 2120, !92, i64 2128, !92, i64 2132, !96, i64 2136, !96, i64 2144, !96, i64 2152, !96, i64 2160, !92, i64 2168, !92, i64 2172, !92, i64 2176, !92, i64 2180, !92, i64 2184, !92, i64 2188, !93, i64 2192, !100, i64 2200, !101, i64 2224, !95, i64 2240, !92, i64 2248, !95, i64 2256, !92, i64 2264, !93, i64 2268, !93, i64 2309, !97, i64 2352, !97, i64 2360, !92, i64 2368, !92, i64 2372, !95, i64 2376, !97, i64 2384, !97, i64 2392, !97, i64 2400, !97, i64 2408, !96, i64 2416, !96, i64 2424, !92, i64 2432, !92, i64 2436, !92, i64 2440, !92, i64 2444, !92, i64 2448, !95, i64 2456, !95, i64 2464, !92, i64 2472, !92, i64 2476, !95, i64 2480, !95, i64 2488, !92, i64 2496, !92, i64 2500, !96, i64 2504, !96, i64 2512, !96, i64 2520, !92, i64 2528, !92, i64 2532, !95, i64 2536, !96, i64 2544, !92, i64 2552, !92, i64 2556, !92, i64 2560, !96, i64 2568, !92, i64 2576, !92, i64 2580, !92, i64 2584, !95, i64 2592, !93, i64 2600, !97, i64 2648, !92, i64 2656, !95, i64 2664, !95, i64 2672, !92, i64 2680, !95, i64 2688, !92, i64 2696, !92, i64 2700, !97, i64 2704, !92, i64 2712, !92, i64 2716, !92, i64 2720, !92, i64 2724, !97, i64 2728, !92, i64 2736, !93, i64 2740, !95, i64 2768, !95, i64 2776, !92, i64 2784, !92, i64 2788, !92, i64 2792, !92, i64 2796, !96, i64 2800, !96, i64 2808, !96, i64 2816, !96, i64 2824, !96, i64 2832, !96, i64 2840, !96, i64 2848, !96, i64 2856, !92, i64 2864, !92, i64 2868, !96, i64 2872, !96, i64 2880, !92, i64 2888, !97, i64 2896, !95, i64 2904, !95, i64 2912, !92, i64 2920, !92, i64 2924, !97, i64 2928, !95, i64 2936, !95, i64 2944, !92, i64 2952, !92, i64 2956, !92, i64 2960, !92, i64 2964, !95, i64 2968, !92, i64 2976, !92, i64 2980, !92, i64 2984, !95, i64 2992, !95, i64 3000, !95, i64 3008, !95, i64 3016, !97, i64 3024, !97, i64 3032, !97, i64 3040, !92, i64 3048, !92, i64 3052, !92, i64 3056, !92, i64 3060, !92, i64 3064, !92, i64 3068, !92, i64 3072, !92, i64 3076, !92, i64 3080, !92, i64 3084, !92, i64 3088, !97, i64 3096, !95, i64 3104, !95, i64 3112, !95, i64 3120, !92, i64 3128, !92, i64 3132, !92, i64 3136, !96, i64 3144, !95, i64 3152, !95, i64 3160, !95, i64 3168}
!92 = !{!"int", !93, i64 0}
!93 = !{!"omnipotent char", !94, i64 0}
!94 = !{!"Simple C/C++ TBAA"}
!95 = !{!"any pointer", !93, i64 0}
!96 = !{!"long", !93, i64 0}
!97 = !{!"long long", !93, i64 0}
!98 = !{!"double", !93, i64 0}
!99 = !{!"malloc_stats", !96, i64 0, !96, i64 8, !96, i64 16, !96, i64 24, !96, i64 32}
!100 = !{!"", !92, i64 0, !96, i64 8, !97, i64 16}
!101 = !{!"redisOpArray", !95, i64 0, !92, i64 8}
!102 = !DILocation(line: 71, column: 9, scope: !89)
!103 = !DILocation(line: 71, column: 9, scope: !85)
!104 = !DILocation(line: 72, column: 9, scope: !89)
!105 = !DILocation(line: 74, column: 37, scope: !85)
!106 = !DILocation(line: 74, column: 35, scope: !85)
!107 = !DILocation(line: 75, column: 5, scope: !85)
!108 = !{!109, !95, i64 24}
!109 = !{!"list", !95, i64 0, !95, i64 8, !95, i64 16, !95, i64 24, !95, i64 32, !96, i64 40}
!110 = !DILocation(line: 76, column: 1, scope: !85)
!111 = distinct !DISubprogram(name: "aofRewriteBufferSize", scope: !3, file: !3, line: 79, type: !112, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!17}
!114 = !{!115, !125, !131, !132}
!115 = !DILocalVariable(name: "ln", scope: !111, file: !3, line: 80, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !118, line: 40, baseType: !119)
!118 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !118, line: 36, size: 192, elements: !120)
!120 = !{!121, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !118, line: 37, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !118, line: 38, baseType: !122, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !118, line: 39, baseType: !10, size: 64, offset: 128)
!125 = !DILocalVariable(name: "li", scope: !111, file: !3, line: 81, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !118, line: 45, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !118, line: 42, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !118, line: 43, baseType: !116, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !127, file: !118, line: 44, baseType: !6, size: 32, offset: 64)
!131 = !DILocalVariable(name: "size", scope: !111, file: !3, line: 82, type: !17)
!132 = !DILocalVariable(name: "block", scope: !133, file: !3, line: 86, type: !134)
!133 = distinct !DILexicalBlock(scope: !111, file: !3, line: 85, column: 33)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "aofrwblock", file: !3, line: 65, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aofrwblock", file: !3, line: 62, size: 83886208, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !136, file: !3, line: 63, baseType: !17, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !136, file: !3, line: 63, baseType: !17, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !136, file: !3, line: 64, baseType: !141, size: 83886080, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 83886080, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 10485760)
!144 = !DILocation(line: 81, column: 5, scope: !111)
!145 = !DILocation(line: 82, column: 19, scope: !111)
!146 = !DILocation(line: 84, column: 23, scope: !111)
!147 = !DILocation(line: 81, column: 14, scope: !111)
!148 = !DILocation(line: 84, column: 5, scope: !111)
!149 = !DILocation(line: 85, column: 17, scope: !111)
!150 = !DILocation(line: 80, column: 15, scope: !111)
!151 = !DILocation(line: 85, column: 5, scope: !111)
!152 = !DILocation(line: 86, column: 29, scope: !133)
!153 = !{!154, !95, i64 16}
!154 = !{!"listNode", !95, i64 0, !95, i64 8, !95, i64 16}
!155 = !DILocation(line: 86, column: 21, scope: !133)
!156 = !DILocation(line: 87, column: 24, scope: !133)
!157 = !{!158, !96, i64 0}
!158 = !{!"aofrwblock", !96, i64 0, !96, i64 8, !93, i64 16}
!159 = !DILocation(line: 87, column: 14, scope: !133)
!160 = distinct !{!160, !151, !161}
!161 = !DILocation(line: 88, column: 5, scope: !111)
!162 = !DILocation(line: 0, scope: !133)
!163 = !DILocation(line: 90, column: 1, scope: !111)
!164 = !DILocation(line: 89, column: 5, scope: !111)
!165 = distinct !DISubprogram(name: "aofChildWriteDiffData", scope: !3, file: !3, line: 95, type: !166, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !228)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !6, !10, !6}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !170, line: 109, baseType: !171)
!170 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !170, line: 97, size: 640, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !191, !198, !220, !221, !222, !227}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !171, file: !170, line: 98, baseType: !6, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !171, file: !170, line: 99, baseType: !6, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !171, file: !170, line: 100, baseType: !16, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !171, file: !170, line: 101, baseType: !79, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !171, file: !170, line: 102, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !170, line: 76, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !170, line: 71, size: 256, elements: !181)
!181 = !{!182, !183, !189, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !180, file: !170, line: 72, baseType: !6, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !180, file: !170, line: 73, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !170, line: 65, baseType: !186)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !188, !6, !10, !6}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !180, file: !170, line: 74, baseType: !184, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !180, file: !170, line: 75, baseType: !10, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !171, file: !170, line: 103, baseType: !192, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !170, line: 94, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !170, line: 91, size: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !194, file: !170, line: 92, baseType: !6, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !194, file: !170, line: 93, baseType: !6, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !171, file: !170, line: 104, baseType: !199, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !170, line: 88, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !170, line: 79, size: 512, elements: !202)
!202 = !{!203, !204, !205, !206, !211, !216, !217, !219}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !170, line: 80, baseType: !16, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !201, file: !170, line: 81, baseType: !15, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !201, file: !170, line: 82, baseType: !15, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !201, file: !170, line: 83, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !170, line: 66, baseType: !209)
!209 = !DISubroutineType(types: !210)
!210 = !{!6, !188, !16, !10}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !201, file: !170, line: 84, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !170, line: 67, baseType: !214)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !188, !10}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !201, file: !170, line: 85, baseType: !10, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !170, line: 86, baseType: !218, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !170, line: 87, baseType: !218, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !171, file: !170, line: 105, baseType: !6, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !171, file: !170, line: 106, baseType: !10, size: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !171, file: !170, line: 107, baseType: !223, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !170, line: 68, baseType: !225)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !188}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !171, file: !170, line: 108, baseType: !223, size: 64, offset: 576)
!228 = !{!229, !230, !231, !232, !233, !234, !235}
!229 = !DILocalVariable(name: "el", arg: 1, scope: !165, file: !3, line: 95, type: !168)
!230 = !DILocalVariable(name: "fd", arg: 2, scope: !165, file: !3, line: 95, type: !6)
!231 = !DILocalVariable(name: "privdata", arg: 3, scope: !165, file: !3, line: 95, type: !10)
!232 = !DILocalVariable(name: "mask", arg: 4, scope: !165, file: !3, line: 95, type: !6)
!233 = !DILocalVariable(name: "ln", scope: !165, file: !3, line: 96, type: !116)
!234 = !DILocalVariable(name: "block", scope: !165, file: !3, line: 97, type: !134)
!235 = !DILocalVariable(name: "nwritten", scope: !165, file: !3, line: 98, type: !11)
!236 = !DILocation(line: 95, column: 41, scope: !165)
!237 = !DILocation(line: 95, column: 49, scope: !165)
!238 = !DILocation(line: 95, column: 59, scope: !165)
!239 = !DILocation(line: 95, column: 73, scope: !165)
!240 = !DILocation(line: 105, column: 14, scope: !241)
!241 = distinct !DILexicalBlock(scope: !165, file: !3, line: 104, column: 14)
!242 = !{!109, !95, i64 0}
!243 = !DILocation(line: 96, column: 15, scope: !165)
!244 = !DILocation(line: 106, column: 17, scope: !241)
!245 = !DILocation(line: 106, column: 26, scope: !241)
!246 = !DILocation(line: 97, column: 17, scope: !165)
!247 = !DILocation(line: 107, column: 20, scope: !248)
!248 = distinct !DILexicalBlock(scope: !241, file: !3, line: 107, column: 13)
!249 = !{!91, !92, i64 2064}
!250 = !DILocation(line: 107, column: 13, scope: !248)
!251 = !DILocation(line: 107, column: 46, scope: !248)
!252 = !DILocation(line: 107, column: 42, scope: !248)
!253 = !DILocation(line: 108, column: 38, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !3, line: 107, column: 53)
!255 = !{!91, !95, i64 72}
!256 = !DILocation(line: 108, column: 48, scope: !254)
!257 = !{!91, !92, i64 2040}
!258 = !DILocation(line: 108, column: 13, scope: !254)
!259 = !DILocation(line: 110, column: 13, scope: !254)
!260 = !DILocation(line: 112, column: 20, scope: !261)
!261 = distinct !DILexicalBlock(scope: !241, file: !3, line: 112, column: 13)
!262 = !DILocation(line: 112, column: 25, scope: !261)
!263 = !DILocation(line: 112, column: 13, scope: !241)
!264 = !DILocation(line: 113, column: 37, scope: !265)
!265 = distinct !DILexicalBlock(scope: !261, file: !3, line: 112, column: 30)
!266 = !DILocation(line: 114, column: 30, scope: !265)
!267 = !DILocation(line: 113, column: 24, scope: !265)
!268 = !DILocation(line: 98, column: 13, scope: !165)
!269 = !DILocation(line: 115, column: 26, scope: !270)
!270 = distinct !DILexicalBlock(scope: !265, file: !3, line: 115, column: 17)
!271 = !DILocation(line: 115, column: 17, scope: !265)
!272 = !DILocation(line: 116, column: 42, scope: !265)
!273 = !DILocation(line: 116, column: 59, scope: !265)
!274 = !DILocation(line: 116, column: 63, scope: !265)
!275 = !DILocation(line: 116, column: 13, scope: !265)
!276 = !DILocation(line: 117, column: 25, scope: !265)
!277 = !DILocation(line: 118, column: 20, scope: !265)
!278 = !DILocation(line: 118, column: 25, scope: !265)
!279 = !{!158, !96, i64 8}
!280 = !DILocation(line: 120, column: 25, scope: !281)
!281 = distinct !DILexicalBlock(scope: !241, file: !3, line: 120, column: 13)
!282 = !DILocation(line: 120, column: 13, scope: !241)
!283 = !DILocation(line: 120, column: 50, scope: !281)
!284 = !DILocation(line: 120, column: 31, scope: !281)
!285 = distinct !{!285, !286, !287}
!286 = !DILocation(line: 104, column: 5, scope: !165)
!287 = !DILocation(line: 121, column: 5, scope: !165)
!288 = !DILocation(line: 122, column: 1, scope: !165)
!289 = distinct !DISubprogram(name: "aofRewriteBufferAppend", scope: !3, file: !3, line: 125, type: !290, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !18, !17}
!292 = !{!293, !294, !295, !296, !297, !301, !304}
!293 = !DILocalVariable(name: "s", arg: 1, scope: !289, file: !3, line: 125, type: !18)
!294 = !DILocalVariable(name: "len", arg: 2, scope: !289, file: !3, line: 125, type: !17)
!295 = !DILocalVariable(name: "ln", scope: !289, file: !3, line: 126, type: !116)
!296 = !DILocalVariable(name: "block", scope: !289, file: !3, line: 127, type: !134)
!297 = !DILocalVariable(name: "thislen", scope: !298, file: !3, line: 133, type: !17)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 132, column: 20)
!299 = distinct !DILexicalBlock(scope: !300, file: !3, line: 132, column: 13)
!300 = distinct !DILexicalBlock(scope: !289, file: !3, line: 129, column: 16)
!301 = !DILocalVariable(name: "numblocks", scope: !302, file: !3, line: 144, type: !6)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 143, column: 18)
!303 = distinct !DILexicalBlock(scope: !300, file: !3, line: 143, column: 13)
!304 = !DILocalVariable(name: "level", scope: !305, file: !3, line: 155, type: !6)
!305 = distinct !DILexicalBlock(scope: !306, file: !3, line: 154, column: 44)
!306 = distinct !DILexicalBlock(scope: !302, file: !3, line: 154, column: 17)
!307 = !DILocation(line: 125, column: 44, scope: !289)
!308 = !DILocation(line: 125, column: 61, scope: !289)
!309 = !DILocation(line: 126, column: 20, scope: !289)
!310 = !{!109, !95, i64 8}
!311 = !DILocation(line: 126, column: 15, scope: !289)
!312 = !DILocation(line: 127, column: 25, scope: !289)
!313 = !DILocation(line: 127, column: 34, scope: !289)
!314 = !DILocation(line: 127, column: 17, scope: !289)
!315 = !DILocation(line: 129, column: 5, scope: !289)
!316 = !DILocation(line: 132, column: 13, scope: !299)
!317 = !DILocation(line: 132, column: 13, scope: !300)
!318 = !DILocation(line: 133, column: 45, scope: !298)
!319 = !DILocation(line: 133, column: 50, scope: !298)
!320 = !DILocation(line: 133, column: 37, scope: !298)
!321 = !DILocation(line: 133, column: 27, scope: !298)
!322 = !DILocation(line: 134, column: 17, scope: !323)
!323 = distinct !DILexicalBlock(scope: !298, file: !3, line: 134, column: 17)
!324 = !DILocation(line: 134, column: 17, scope: !298)
!325 = !DILocation(line: 135, column: 42, scope: !326)
!326 = distinct !DILexicalBlock(scope: !323, file: !3, line: 134, column: 26)
!327 = !DILocation(line: 135, column: 34, scope: !326)
!328 = !DILocation(line: 135, column: 17, scope: !326)
!329 = !DILocation(line: 136, column: 29, scope: !326)
!330 = !DILocation(line: 137, column: 29, scope: !326)
!331 = !DILocation(line: 138, column: 19, scope: !326)
!332 = !DILocation(line: 139, column: 21, scope: !326)
!333 = !DILocation(line: 143, column: 13, scope: !303)
!334 = !DILocation(line: 143, column: 13, scope: !300)
!335 = !DILocation(line: 146, column: 21, scope: !302)
!336 = !DILocation(line: 148, column: 25, scope: !302)
!337 = !{!96, !96, i64 0}
!338 = !DILocation(line: 149, column: 36, scope: !302)
!339 = !DILocation(line: 149, column: 13, scope: !302)
!340 = !DILocation(line: 153, column: 25, scope: !302)
!341 = !{!109, !96, i64 40}
!342 = !DILocation(line: 144, column: 17, scope: !302)
!343 = !DILocation(line: 154, column: 28, scope: !306)
!344 = !DILocation(line: 154, column: 32, scope: !306)
!345 = !DILocation(line: 154, column: 38, scope: !306)
!346 = !DILocation(line: 154, column: 17, scope: !302)
!347 = !DILocation(line: 155, column: 44, scope: !305)
!348 = !DILocation(line: 155, column: 51, scope: !305)
!349 = !DILocation(line: 155, column: 29, scope: !305)
!350 = !DILocation(line: 155, column: 21, scope: !305)
!351 = !DILocation(line: 81, column: 5, scope: !111, inlinedAt: !352)
!352 = distinct !DILocation(line: 158, column: 21, scope: !305)
!353 = !DILocation(line: 82, column: 19, scope: !111, inlinedAt: !352)
!354 = !DILocation(line: 81, column: 14, scope: !111, inlinedAt: !352)
!355 = !DILocation(line: 84, column: 5, scope: !111, inlinedAt: !352)
!356 = !DILocation(line: 85, column: 17, scope: !111, inlinedAt: !352)
!357 = !DILocation(line: 80, column: 15, scope: !111, inlinedAt: !352)
!358 = !DILocation(line: 85, column: 5, scope: !111, inlinedAt: !352)
!359 = !DILocation(line: 86, column: 29, scope: !133, inlinedAt: !352)
!360 = !DILocation(line: 86, column: 21, scope: !133, inlinedAt: !352)
!361 = !DILocation(line: 87, column: 24, scope: !133, inlinedAt: !352)
!362 = !DILocation(line: 87, column: 14, scope: !133, inlinedAt: !352)
!363 = !DILocation(line: 0, scope: !133, inlinedAt: !352)
!364 = !DILocation(line: 90, column: 1, scope: !111, inlinedAt: !352)
!365 = !DILocation(line: 158, column: 43, scope: !305)
!366 = !DILocation(line: 157, column: 17, scope: !305)
!367 = !DILocation(line: 159, column: 13, scope: !305)
!368 = distinct !{!368, !315, !369}
!369 = !DILocation(line: 161, column: 5, scope: !289)
!370 = !DILocation(line: 165, column: 32, scope: !371)
!371 = distinct !DILexicalBlock(scope: !289, file: !3, line: 165, column: 9)
!372 = !DILocation(line: 165, column: 42, scope: !371)
!373 = !DILocation(line: 165, column: 9, scope: !371)
!374 = !DILocation(line: 165, column: 72, scope: !371)
!375 = !DILocation(line: 165, column: 9, scope: !289)
!376 = !DILocation(line: 166, column: 34, scope: !377)
!377 = distinct !DILexicalBlock(scope: !371, file: !3, line: 165, column: 78)
!378 = !DILocation(line: 166, column: 45, scope: !377)
!379 = !DILocation(line: 166, column: 9, scope: !377)
!380 = !DILocation(line: 168, column: 5, scope: !377)
!381 = !DILocation(line: 169, column: 1, scope: !289)
!382 = distinct !DISubprogram(name: "aofRewriteBufferWrite", scope: !3, file: !3, line: 174, type: !383, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!11, !6}
!385 = !{!386, !387, !388, !389, !390, !392}
!386 = !DILocalVariable(name: "fd", arg: 1, scope: !382, file: !3, line: 174, type: !6)
!387 = !DILocalVariable(name: "ln", scope: !382, file: !3, line: 175, type: !116)
!388 = !DILocalVariable(name: "li", scope: !382, file: !3, line: 176, type: !126)
!389 = !DILocalVariable(name: "count", scope: !382, file: !3, line: 177, type: !11)
!390 = !DILocalVariable(name: "block", scope: !391, file: !3, line: 181, type: !134)
!391 = distinct !DILexicalBlock(scope: !382, file: !3, line: 180, column: 33)
!392 = !DILocalVariable(name: "nwritten", scope: !391, file: !3, line: 182, type: !11)
!393 = !DILocation(line: 174, column: 35, scope: !382)
!394 = !DILocation(line: 176, column: 5, scope: !382)
!395 = !DILocation(line: 177, column: 13, scope: !382)
!396 = !DILocation(line: 179, column: 23, scope: !382)
!397 = !DILocation(line: 176, column: 14, scope: !382)
!398 = !DILocation(line: 179, column: 5, scope: !382)
!399 = !DILocation(line: 180, column: 17, scope: !382)
!400 = !DILocation(line: 175, column: 15, scope: !382)
!401 = !DILocation(line: 180, column: 5, scope: !382)
!402 = !DILocation(line: 181, column: 29, scope: !391)
!403 = !DILocation(line: 181, column: 21, scope: !391)
!404 = !DILocation(line: 184, column: 20, scope: !405)
!405 = distinct !DILexicalBlock(scope: !391, file: !3, line: 184, column: 13)
!406 = !DILocation(line: 184, column: 13, scope: !405)
!407 = !DILocation(line: 184, column: 13, scope: !391)
!408 = !DILocation(line: 185, column: 33, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !3, line: 184, column: 26)
!410 = !DILocation(line: 185, column: 24, scope: !409)
!411 = !DILocation(line: 182, column: 17, scope: !391)
!412 = !DILocation(line: 186, column: 45, scope: !413)
!413 = distinct !DILexicalBlock(scope: !409, file: !3, line: 186, column: 17)
!414 = !DILocation(line: 186, column: 26, scope: !413)
!415 = !DILocation(line: 186, column: 17, scope: !409)
!416 = !DILocation(line: 187, column: 30, scope: !417)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 187, column: 21)
!418 = distinct !DILexicalBlock(scope: !413, file: !3, line: 186, column: 51)
!419 = !DILocation(line: 187, column: 21, scope: !418)
!420 = !DILocation(line: 187, column: 36, scope: !417)
!421 = !DILocation(line: 187, column: 42, scope: !417)
!422 = !{!92, !92, i64 0}
!423 = !DILocation(line: 190, column: 19, scope: !409)
!424 = !DILocation(line: 191, column: 9, scope: !409)
!425 = !DILocation(line: 0, scope: !409)
!426 = !DILocation(line: 0, scope: !382)
!427 = !DILocation(line: 194, column: 1, scope: !382)
!428 = distinct !DISubprogram(name: "aofFsyncInProgress", scope: !3, file: !3, line: 202, type: !429, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!429 = !DISubroutineType(types: !430)
!430 = !{!6}
!431 = !DILocation(line: 203, column: 12, scope: !428)
!432 = !DILocation(line: 203, column: 48, scope: !428)
!433 = !DILocation(line: 203, column: 5, scope: !428)
!434 = distinct !DISubprogram(name: "aof_background_fsync", scope: !3, file: !3, line: 208, type: !4, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !435)
!435 = !{!436}
!436 = !DILocalVariable(name: "fd", arg: 1, scope: !434, file: !3, line: 208, type: !6)
!437 = !DILocation(line: 208, column: 31, scope: !434)
!438 = !DILocation(line: 209, column: 49, scope: !434)
!439 = !DILocation(line: 209, column: 42, scope: !434)
!440 = !DILocation(line: 209, column: 5, scope: !434)
!441 = !DILocation(line: 210, column: 1, scope: !434)
!442 = distinct !DISubprogram(name: "stopAppendOnly", scope: !3, file: !3, line: 234, type: !86, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!443 = !DILocation(line: 235, column: 5, scope: !442)
!444 = !{!91, !92, i64 1880}
!445 = !DILocation(line: 236, column: 5, scope: !442)
!446 = !DILocation(line: 237, column: 24, scope: !442)
!447 = !{!91, !92, i64 1960}
!448 = !DILocation(line: 237, column: 5, scope: !442)
!449 = !DILocation(line: 238, column: 18, scope: !442)
!450 = !DILocation(line: 238, column: 5, scope: !442)
!451 = !DILocation(line: 240, column: 19, scope: !442)
!452 = !DILocation(line: 241, column: 28, scope: !442)
!453 = !{!91, !92, i64 1964}
!454 = !DILocation(line: 242, column: 22, scope: !442)
!455 = !DILocation(line: 243, column: 5, scope: !442)
!456 = !DILocation(line: 244, column: 1, scope: !442)
!457 = !DILocation(line: 337, column: 30, scope: !2)
!458 = !DILocation(line: 339, column: 9, scope: !2)
!459 = !DILocation(line: 342, column: 23, scope: !460)
!460 = distinct !DILexicalBlock(scope: !2, file: !3, line: 342, column: 9)
!461 = !{!91, !95, i64 1952}
!462 = !DILocalVariable(name: "s", arg: 1, scope: !463, file: !26, line: 87, type: !468)
!463 = distinct !DISubprogram(name: "sdslen", scope: !26, file: !26, line: 87, type: !464, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !470)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !468}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !467, line: 58, baseType: !17)
!467 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !26, line: 43, baseType: !20)
!470 = !{!462, !471}
!471 = !DILocalVariable(name: "flags", scope: !463, file: !26, line: 88, type: !19)
!472 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !473)
!473 = distinct !DILocation(line: 342, column: 9, scope: !460)
!474 = !DILocation(line: 88, column: 27, scope: !463, inlinedAt: !473)
!475 = !{!93, !93, i64 0}
!476 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !473)
!477 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !473)
!478 = !DILocation(line: 0, scope: !479)
!479 = distinct !DILexicalBlock(scope: !2, file: !3, line: 358, column: 9)
!480 = !{!91, !92, i64 1884}
!481 = !DILocation(line: 348, column: 52, scope: !482)
!482 = distinct !DILexicalBlock(scope: !483, file: !3, line: 348, column: 13)
!483 = distinct !DILexicalBlock(scope: !460, file: !3, line: 342, column: 38)
!484 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !473)
!485 = distinct !DILexicalBlock(scope: !463, file: !26, line: 89, column: 33)
!486 = !DILocation(line: 91, column: 13, scope: !485, inlinedAt: !473)
!487 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !473)
!488 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !473)
!489 = !DILocation(line: 93, column: 13, scope: !485, inlinedAt: !473)
!490 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !473)
!491 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !473)
!492 = !{!493, !493, i64 0}
!493 = !{!"short", !93, i64 0}
!494 = !DILocation(line: 95, column: 13, scope: !485, inlinedAt: !473)
!495 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !473)
!496 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !473)
!497 = !DILocation(line: 97, column: 13, scope: !485, inlinedAt: !473)
!498 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !473)
!499 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !473)
!500 = !DILocation(line: 99, column: 13, scope: !485, inlinedAt: !473)
!501 = !DILocation(line: 0, scope: !485, inlinedAt: !473)
!502 = !DILocation(line: 342, column: 32, scope: !460)
!503 = !DILocation(line: 342, column: 9, scope: !2)
!504 = !DILocation(line: 349, column: 20, scope: !482)
!505 = !{!91, !96, i64 1928}
!506 = !DILocation(line: 349, column: 47, scope: !482)
!507 = !{!91, !96, i64 1920}
!508 = !DILocation(line: 349, column: 37, scope: !482)
!509 = !DILocation(line: 349, column: 64, scope: !482)
!510 = !DILocation(line: 350, column: 20, scope: !482)
!511 = !{!91, !96, i64 2872}
!512 = !DILocation(line: 350, column: 38, scope: !482)
!513 = !{!91, !96, i64 1976}
!514 = !DILocation(line: 350, column: 29, scope: !482)
!515 = !DILocation(line: 350, column: 53, scope: !482)
!516 = !DILocation(line: 203, column: 12, scope: !428, inlinedAt: !517)
!517 = distinct !DILocation(line: 351, column: 34, scope: !482)
!518 = !DILocation(line: 203, column: 48, scope: !428, inlinedAt: !517)
!519 = !DILocation(line: 348, column: 13, scope: !483)
!520 = !DILocation(line: 358, column: 9, scope: !2)
!521 = !DILocation(line: 203, column: 12, scope: !428, inlinedAt: !522)
!522 = distinct !DILocation(line: 359, column: 28, scope: !479)
!523 = !DILocation(line: 203, column: 48, scope: !428, inlinedAt: !522)
!524 = !DILocation(line: 361, column: 16, scope: !525)
!525 = distinct !DILexicalBlock(scope: !2, file: !3, line: 361, column: 9)
!526 = !DILocation(line: 361, column: 26, scope: !525)
!527 = !DILocation(line: 361, column: 52, scope: !525)
!528 = !DILocation(line: 361, column: 48, scope: !525)
!529 = !DILocation(line: 366, column: 24, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !3, line: 366, column: 17)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 365, column: 31)
!532 = distinct !DILexicalBlock(scope: !533, file: !3, line: 365, column: 13)
!533 = distinct !DILexicalBlock(scope: !525, file: !3, line: 361, column: 59)
!534 = !{!91, !96, i64 1968}
!535 = !DILocation(line: 366, column: 50, scope: !530)
!536 = !DILocation(line: 0, scope: !537)
!537 = distinct !DILexicalBlock(scope: !530, file: !3, line: 371, column: 24)
!538 = !DILocation(line: 366, column: 17, scope: !531)
!539 = !DILocation(line: 369, column: 50, scope: !540)
!540 = distinct !DILexicalBlock(scope: !530, file: !3, line: 366, column: 56)
!541 = !DILocation(line: 370, column: 17, scope: !540)
!542 = !DILocation(line: 371, column: 40, scope: !537)
!543 = !DILocation(line: 371, column: 75, scope: !537)
!544 = !DILocation(line: 371, column: 24, scope: !530)
!545 = !DILocation(line: 378, column: 37, scope: !531)
!546 = !{!91, !96, i64 2008}
!547 = !DILocation(line: 379, column: 13, scope: !531)
!548 = !DILocation(line: 380, column: 9, scope: !531)
!549 = !DILocation(line: 388, column: 5, scope: !550)
!550 = distinct !DILexicalBlock(scope: !2, file: !3, line: 388, column: 5)
!551 = !{!91, !97, i64 3096}
!552 = !DILocation(line: 388, column: 5, scope: !2)
!553 = !DILocation(line: 388, column: 5, scope: !554)
!554 = distinct !DILexicalBlock(scope: !550, file: !3, line: 388, column: 5)
!555 = !DILocation(line: 340, column: 14, scope: !2)
!556 = !DILocation(line: 389, column: 32, scope: !2)
!557 = !DILocation(line: 389, column: 46, scope: !2)
!558 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !559)
!559 = distinct !DILocation(line: 389, column: 54, scope: !2)
!560 = !DILocation(line: 88, column: 27, scope: !463, inlinedAt: !559)
!561 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !559)
!562 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !559)
!563 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !559)
!564 = !DILocation(line: 91, column: 13, scope: !485, inlinedAt: !559)
!565 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !559)
!566 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !559)
!567 = !DILocation(line: 93, column: 13, scope: !485, inlinedAt: !559)
!568 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !559)
!569 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !559)
!570 = !DILocation(line: 95, column: 13, scope: !485, inlinedAt: !559)
!571 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !559)
!572 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !559)
!573 = !DILocation(line: 97, column: 13, scope: !485, inlinedAt: !559)
!574 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !559)
!575 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !559)
!576 = !DILocation(line: 99, column: 13, scope: !485, inlinedAt: !559)
!577 = !DILocation(line: 300, column: 5, scope: !578, inlinedAt: !592)
!578 = distinct !DISubprogram(name: "aofWrite", scope: !3, file: !3, line: 297, type: !579, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !586)
!579 = !DISubroutineType(types: !580)
!580 = !{!11, !6, !581, !583}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !584, line: 40, baseType: !585)
!584 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !14, line: 129, baseType: !17)
!586 = !{!587, !588, !589, !590, !591}
!587 = !DILocalVariable(name: "fd", arg: 1, scope: !578, file: !3, line: 297, type: !6)
!588 = !DILocalVariable(name: "buf", arg: 2, scope: !578, file: !3, line: 297, type: !581)
!589 = !DILocalVariable(name: "len", arg: 3, scope: !578, file: !3, line: 297, type: !583)
!590 = !DILocalVariable(name: "nwritten", scope: !578, file: !3, line: 298, type: !11)
!591 = !DILocalVariable(name: "totwritten", scope: !578, file: !3, line: 298, type: !11)
!592 = distinct !DILocation(line: 389, column: 16, scope: !2)
!593 = !DILocation(line: 298, column: 27, scope: !578, inlinedAt: !592)
!594 = !DILocation(line: 297, column: 50, scope: !578, inlinedAt: !592)
!595 = !DILocation(line: 297, column: 38, scope: !578, inlinedAt: !592)
!596 = !DILocation(line: 301, column: 20, scope: !597, inlinedAt: !592)
!597 = distinct !DILexicalBlock(scope: !578, file: !3, line: 300, column: 16)
!598 = !DILocation(line: 298, column: 13, scope: !578, inlinedAt: !592)
!599 = !DILocation(line: 303, column: 22, scope: !600, inlinedAt: !592)
!600 = distinct !DILexicalBlock(scope: !597, file: !3, line: 303, column: 13)
!601 = !DILocation(line: 303, column: 13, scope: !597, inlinedAt: !592)
!602 = !DILocation(line: 304, column: 17, scope: !603, inlinedAt: !592)
!603 = distinct !DILexicalBlock(scope: !604, file: !3, line: 304, column: 17)
!604 = distinct !DILexicalBlock(scope: !600, file: !3, line: 303, column: 27)
!605 = !DILocation(line: 304, column: 23, scope: !603, inlinedAt: !592)
!606 = !DILocation(line: 304, column: 17, scope: !604, inlinedAt: !592)
!607 = distinct !{!607, !608, !609}
!608 = !DILocation(line: 300, column: 5, scope: !578)
!609 = !DILocation(line: 313, column: 5, scope: !578)
!610 = !DILocation(line: 307, column: 20, scope: !604, inlinedAt: !592)
!611 = !DILocation(line: 307, column: 13, scope: !604, inlinedAt: !592)
!612 = !DILocation(line: 310, column: 13, scope: !597, inlinedAt: !592)
!613 = !DILocation(line: 311, column: 13, scope: !597, inlinedAt: !592)
!614 = !DILocation(line: 312, column: 20, scope: !597, inlinedAt: !592)
!615 = !DILocation(line: 0, scope: !578, inlinedAt: !592)
!616 = !DILocation(line: 338, column: 13, scope: !2)
!617 = !DILocation(line: 390, column: 5, scope: !618)
!618 = distinct !DILexicalBlock(scope: !2, file: !3, line: 390, column: 5)
!619 = !DILocation(line: 390, column: 5, scope: !2)
!620 = !DILocation(line: 390, column: 5, scope: !621)
!621 = distinct !DILexicalBlock(scope: !618, file: !3, line: 390, column: 5)
!622 = !DILocation(line: 0, scope: !554)
!623 = !DILocation(line: 396, column: 9, scope: !2)
!624 = !DILocation(line: 397, column: 9, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !3, line: 397, column: 9)
!626 = distinct !DILexicalBlock(scope: !627, file: !3, line: 396, column: 27)
!627 = distinct !DILexicalBlock(scope: !2, file: !3, line: 396, column: 9)
!628 = !DILocation(line: 398, column: 23, scope: !629)
!629 = distinct !DILexicalBlock(scope: !627, file: !3, line: 398, column: 16)
!630 = !{!91, !92, i64 1940}
!631 = !DILocation(line: 398, column: 53, scope: !629)
!632 = !DILocation(line: 398, column: 43, scope: !629)
!633 = !DILocation(line: 0, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 401, column: 9)
!635 = distinct !DILexicalBlock(scope: !629, file: !3, line: 400, column: 12)
!636 = !DILocation(line: 0, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !3, line: 399, column: 9)
!638 = distinct !DILexicalBlock(scope: !629, file: !3, line: 398, column: 74)
!639 = !DILocation(line: 399, column: 9, scope: !637)
!640 = !DILocation(line: 401, column: 9, scope: !634)
!641 = !DILocation(line: 403, column: 5, scope: !642)
!642 = distinct !DILexicalBlock(scope: !2, file: !3, line: 403, column: 5)
!643 = !DILocation(line: 406, column: 38, scope: !2)
!644 = !DILocation(line: 408, column: 44, scope: !78)
!645 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !646)
!646 = distinct !DILocation(line: 408, column: 30, scope: !78)
!647 = !DILocation(line: 88, column: 27, scope: !463, inlinedAt: !646)
!648 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !646)
!649 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !646)
!650 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !646)
!651 = !DILocation(line: 91, column: 13, scope: !485, inlinedAt: !646)
!652 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !646)
!653 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !646)
!654 = !DILocation(line: 93, column: 13, scope: !485, inlinedAt: !646)
!655 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !646)
!656 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !646)
!657 = !DILocation(line: 95, column: 13, scope: !485, inlinedAt: !646)
!658 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !646)
!659 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !646)
!660 = !DILocation(line: 97, column: 13, scope: !485, inlinedAt: !646)
!661 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !646)
!662 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !646)
!663 = !DILocation(line: 99, column: 13, scope: !485, inlinedAt: !646)
!664 = !DILocation(line: 0, scope: !485, inlinedAt: !646)
!665 = !DILocation(line: 408, column: 18, scope: !78)
!666 = !DILocation(line: 408, column: 9, scope: !2)
!667 = !DILocation(line: 410, column: 13, scope: !77)
!668 = !DILocation(line: 413, column: 21, scope: !669)
!669 = distinct !DILexicalBlock(scope: !77, file: !3, line: 413, column: 13)
!670 = !DILocation(line: 413, column: 32, scope: !669)
!671 = !DILocation(line: 413, column: 30, scope: !669)
!672 = !DILocation(line: 413, column: 54, scope: !669)
!673 = !DILocation(line: 413, column: 13, scope: !77)
!674 = !DILocation(line: 415, column: 34, scope: !675)
!675 = distinct !DILexicalBlock(scope: !669, file: !3, line: 413, column: 82)
!676 = !DILocation(line: 416, column: 9, scope: !675)
!677 = !DILocation(line: 419, column: 22, scope: !678)
!678 = distinct !DILexicalBlock(scope: !77, file: !3, line: 419, column: 13)
!679 = !DILocation(line: 419, column: 13, scope: !77)
!680 = !DILocation(line: 420, column: 17, scope: !681)
!681 = distinct !DILexicalBlock(scope: !678, file: !3, line: 419, column: 29)
!682 = !DILocation(line: 422, column: 30, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !3, line: 420, column: 26)
!684 = distinct !DILexicalBlock(scope: !681, file: !3, line: 420, column: 17)
!685 = !DILocation(line: 422, column: 21, scope: !683)
!686 = !DILocation(line: 421, column: 17, scope: !683)
!687 = !DILocation(line: 423, column: 47, scope: !683)
!688 = !DILocation(line: 424, column: 13, scope: !683)
!689 = !DILocation(line: 426, column: 17, scope: !690)
!690 = distinct !DILexicalBlock(scope: !678, file: !3, line: 425, column: 16)
!691 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !692)
!692 = distinct !DILocation(line: 431, column: 51, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !3, line: 426, column: 26)
!694 = distinct !DILexicalBlock(scope: !690, file: !3, line: 426, column: 17)
!695 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !692)
!696 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !692)
!697 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !692)
!698 = !DILocation(line: 91, column: 13, scope: !485, inlinedAt: !692)
!699 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !692)
!700 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !692)
!701 = !DILocation(line: 93, column: 13, scope: !485, inlinedAt: !692)
!702 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !692)
!703 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !692)
!704 = !DILocation(line: 95, column: 13, scope: !485, inlinedAt: !692)
!705 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !692)
!706 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !692)
!707 = !DILocation(line: 97, column: 13, scope: !485, inlinedAt: !692)
!708 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !692)
!709 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !692)
!710 = !DILocation(line: 99, column: 13, scope: !485, inlinedAt: !692)
!711 = !DILocation(line: 0, scope: !485, inlinedAt: !692)
!712 = !DILocation(line: 427, column: 17, scope: !693)
!713 = !DILocation(line: 432, column: 13, scope: !693)
!714 = !DILocation(line: 434, column: 34, scope: !715)
!715 = distinct !DILexicalBlock(scope: !690, file: !3, line: 434, column: 17)
!716 = !DILocation(line: 434, column: 49, scope: !715)
!717 = !DILocation(line: 434, column: 17, scope: !715)
!718 = !DILocation(line: 434, column: 67, scope: !715)
!719 = !DILocation(line: 434, column: 17, scope: !690)
!720 = !DILocation(line: 439, column: 56, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !3, line: 435, column: 30)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 435, column: 21)
!723 = distinct !DILexicalBlock(scope: !715, file: !3, line: 434, column: 74)
!724 = !DILocation(line: 439, column: 47, scope: !721)
!725 = !DILocation(line: 436, column: 21, scope: !721)
!726 = !DILocation(line: 440, column: 17, scope: !721)
!727 = !DILocation(line: 0, scope: !690)
!728 = !{!91, !92, i64 2028}
!729 = !DILocation(line: 450, column: 20, scope: !730)
!730 = distinct !DILexicalBlock(scope: !77, file: !3, line: 450, column: 13)
!731 = !DILocation(line: 389, column: 14, scope: !2)
!732 = !DILocation(line: 450, column: 30, scope: !730)
!733 = !DILocation(line: 450, column: 13, scope: !77)
!734 = !DILocation(line: 455, column: 13, scope: !735)
!735 = distinct !DILexicalBlock(scope: !730, file: !3, line: 450, column: 51)
!736 = !DILocation(line: 456, column: 13, scope: !735)
!737 = !DILocation(line: 461, column: 42, scope: !738)
!738 = distinct !DILexicalBlock(scope: !730, file: !3, line: 457, column: 16)
!739 = !{!91, !92, i64 2024}
!740 = !DILocation(line: 465, column: 26, scope: !741)
!741 = distinct !DILexicalBlock(scope: !738, file: !3, line: 465, column: 17)
!742 = !DILocation(line: 465, column: 17, scope: !738)
!743 = !DILocation(line: 466, column: 41, scope: !744)
!744 = distinct !DILexicalBlock(scope: !741, file: !3, line: 465, column: 31)
!745 = !DILocation(line: 467, column: 33, scope: !744)
!746 = !DILocation(line: 467, column: 17, scope: !744)
!747 = !DILocation(line: 468, column: 13, scope: !744)
!748 = !DILocation(line: 474, column: 20, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 474, column: 13)
!750 = distinct !DILexicalBlock(scope: !78, file: !3, line: 471, column: 12)
!751 = !DILocation(line: 474, column: 42, scope: !749)
!752 = !DILocation(line: 474, column: 13, scope: !750)
!753 = !DILocation(line: 475, column: 13, scope: !754)
!754 = distinct !DILexicalBlock(scope: !749, file: !3, line: 474, column: 52)
!755 = !DILocation(line: 477, column: 42, scope: !754)
!756 = !DILocation(line: 484, column: 24, scope: !757)
!757 = distinct !DILexicalBlock(scope: !2, file: !3, line: 484, column: 9)
!758 = !DILocation(line: 88, column: 27, scope: !463, inlinedAt: !759)
!759 = distinct !DILocation(line: 484, column: 10, scope: !757)
!760 = !DILocation(line: 478, column: 9, scope: !754)
!761 = !DILocation(line: 480, column: 29, scope: !2)
!762 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !759)
!763 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !759)
!764 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !759)
!765 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !759)
!766 = !DILocalVariable(name: "s", arg: 1, scope: !767, file: !26, line: 104, type: !468)
!767 = distinct !DISubprogram(name: "sdsavail", scope: !26, file: !26, line: 104, type: !464, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !768)
!768 = !{!766, !769, !770, !773, !775, !777}
!769 = !DILocalVariable(name: "flags", scope: !767, file: !26, line: 105, type: !19)
!770 = !DILocalVariable(name: "sh", scope: !771, file: !26, line: 111, type: !24)
!771 = distinct !DILexicalBlock(scope: !772, file: !26, line: 110, column: 26)
!772 = distinct !DILexicalBlock(scope: !767, file: !26, line: 106, column: 33)
!773 = !DILocalVariable(name: "sh", scope: !774, file: !26, line: 115, type: !39)
!774 = distinct !DILexicalBlock(scope: !772, file: !26, line: 114, column: 27)
!775 = !DILocalVariable(name: "sh", scope: !776, file: !26, line: 119, type: !49)
!776 = distinct !DILexicalBlock(scope: !772, file: !26, line: 118, column: 27)
!777 = !DILocalVariable(name: "sh", scope: !778, file: !26, line: 123, type: !59)
!778 = distinct !DILexicalBlock(scope: !772, file: !26, line: 122, column: 27)
!779 = !DILocation(line: 104, column: 41, scope: !767, inlinedAt: !780)
!780 = distinct !DILocation(line: 484, column: 33, scope: !757)
!781 = !DILocation(line: 105, column: 19, scope: !767, inlinedAt: !780)
!782 = !DILocation(line: 106, column: 5, scope: !767, inlinedAt: !780)
!783 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !759)
!784 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !759)
!785 = !DILocation(line: 111, column: 13, scope: !771, inlinedAt: !780)
!786 = !DILocation(line: 112, column: 24, scope: !771, inlinedAt: !780)
!787 = !DILocation(line: 112, column: 20, scope: !771, inlinedAt: !780)
!788 = !DILocation(line: 112, column: 30, scope: !771, inlinedAt: !780)
!789 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !759)
!790 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !759)
!791 = !DILocation(line: 115, column: 13, scope: !774, inlinedAt: !780)
!792 = !DILocation(line: 116, column: 24, scope: !774, inlinedAt: !780)
!793 = !DILocation(line: 116, column: 20, scope: !774, inlinedAt: !780)
!794 = !DILocation(line: 116, column: 30, scope: !774, inlinedAt: !780)
!795 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !759)
!796 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !759)
!797 = !DILocation(line: 119, column: 13, scope: !776, inlinedAt: !780)
!798 = !DILocation(line: 120, column: 24, scope: !776, inlinedAt: !780)
!799 = !DILocation(line: 120, column: 30, scope: !776, inlinedAt: !780)
!800 = !DILocation(line: 120, column: 20, scope: !776, inlinedAt: !780)
!801 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !759)
!802 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !759)
!803 = !DILocation(line: 123, column: 13, scope: !778, inlinedAt: !780)
!804 = !DILocation(line: 124, column: 24, scope: !778, inlinedAt: !780)
!805 = !DILocation(line: 124, column: 30, scope: !778, inlinedAt: !780)
!806 = !DILocation(line: 0, scope: !807, inlinedAt: !780)
!807 = distinct !DILexicalBlock(scope: !772, file: !26, line: 107, column: 26)
!808 = !DILocation(line: 484, column: 32, scope: !757)
!809 = !DILocation(line: 484, column: 59, scope: !757)
!810 = !DILocation(line: 484, column: 9, scope: !2)
!811 = !DILocation(line: 485, column: 9, scope: !812)
!812 = distinct !DILexicalBlock(scope: !757, file: !3, line: 484, column: 67)
!813 = !DILocation(line: 486, column: 5, scope: !812)
!814 = !DILocation(line: 487, column: 9, scope: !815)
!815 = distinct !DILexicalBlock(scope: !757, file: !3, line: 486, column: 12)
!816 = !DILocation(line: 488, column: 26, scope: !815)
!817 = !DILocation(line: 488, column: 24, scope: !815)
!818 = !DILocation(line: 494, column: 16, scope: !819)
!819 = distinct !DILexicalBlock(scope: !2, file: !3, line: 494, column: 9)
!820 = !{!91, !92, i64 1896}
!821 = !DILocation(line: 494, column: 9, scope: !819)
!822 = !DILocation(line: 494, column: 40, scope: !819)
!823 = !DILocation(line: 495, column: 17, scope: !819)
!824 = !DILocation(line: 495, column: 47, scope: !819)
!825 = !DILocation(line: 495, column: 37, scope: !819)
!826 = !DILocation(line: 499, column: 16, scope: !827)
!827 = distinct !DILexicalBlock(scope: !2, file: !3, line: 499, column: 9)
!828 = !DILocation(line: 499, column: 9, scope: !2)
!829 = !DILocation(line: 502, column: 9, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 502, column: 9)
!831 = distinct !DILexicalBlock(scope: !827, file: !3, line: 499, column: 47)
!832 = !DILocation(line: 502, column: 9, scope: !831)
!833 = !DILocation(line: 502, column: 9, scope: !834)
!834 = distinct !DILexicalBlock(scope: !830, file: !3, line: 502, column: 9)
!835 = !DILocation(line: 503, column: 28, scope: !831)
!836 = !DILocation(line: 503, column: 9, scope: !831)
!837 = !DILocation(line: 504, column: 9, scope: !838)
!838 = distinct !DILexicalBlock(scope: !831, file: !3, line: 504, column: 9)
!839 = !DILocation(line: 504, column: 9, scope: !831)
!840 = !DILocation(line: 504, column: 9, scope: !841)
!841 = distinct !DILexicalBlock(scope: !838, file: !3, line: 504, column: 9)
!842 = !DILocation(line: 505, column: 9, scope: !843)
!843 = distinct !DILexicalBlock(scope: !831, file: !3, line: 505, column: 9)
!844 = !DILocation(line: 506, column: 42, scope: !831)
!845 = !DILocation(line: 506, column: 33, scope: !831)
!846 = !DILocation(line: 507, column: 40, scope: !831)
!847 = !DILocation(line: 507, column: 31, scope: !831)
!848 = !DILocation(line: 508, column: 5, scope: !831)
!849 = !DILocation(line: 509, column: 24, scope: !850)
!850 = distinct !DILexicalBlock(scope: !827, file: !3, line: 508, column: 16)
!851 = !DILocation(line: 509, column: 42, scope: !850)
!852 = !DILocation(line: 509, column: 33, scope: !850)
!853 = !DILocation(line: 508, column: 16, scope: !827)
!854 = !DILocation(line: 510, column: 14, scope: !855)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 510, column: 13)
!856 = distinct !DILexicalBlock(scope: !850, file: !3, line: 509, column: 59)
!857 = !DILocation(line: 510, column: 13, scope: !856)
!858 = !DILocation(line: 511, column: 41, scope: !859)
!859 = distinct !DILexicalBlock(scope: !855, file: !3, line: 510, column: 32)
!860 = !DILocation(line: 208, column: 31, scope: !434, inlinedAt: !861)
!861 = distinct !DILocation(line: 511, column: 13, scope: !859)
!862 = !DILocation(line: 209, column: 49, scope: !434, inlinedAt: !861)
!863 = !DILocation(line: 209, column: 42, scope: !434, inlinedAt: !861)
!864 = !DILocation(line: 209, column: 5, scope: !434, inlinedAt: !861)
!865 = !DILocation(line: 512, column: 46, scope: !859)
!866 = !DILocation(line: 512, column: 37, scope: !859)
!867 = !DILocation(line: 514, column: 40, scope: !856)
!868 = !DILocation(line: 513, column: 9, scope: !859)
!869 = !DILocation(line: 514, column: 31, scope: !856)
!870 = !DILocation(line: 515, column: 5, scope: !856)
!871 = !DILocation(line: 516, column: 1, scope: !2)
!872 = distinct !DISubprogram(name: "killAppendOnlyChild", scope: !3, file: !3, line: 213, type: !86, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !873)
!873 = !{!874}
!874 = !DILocalVariable(name: "statloc", scope: !872, file: !3, line: 214, type: !6)
!875 = !DILocalVariable(name: "tmpfile", scope: !876, file: !3, line: 1633, type: !883)
!876 = distinct !DISubprogram(name: "aofRemoveTempFile", scope: !3, file: !3, line: 1632, type: !877, isLocal: false, isDefinition: true, scopeLine: 1632, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !881)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !879}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !880, line: 61, baseType: !6)
!880 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!881 = !{!882, !875}
!882 = !DILocalVariable(name: "childpid", arg: 1, scope: !876, file: !3, line: 1632, type: !879)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 256)
!886 = !DILocation(line: 1633, column: 10, scope: !876, inlinedAt: !887)
!887 = distinct !DILocation(line: 225, column: 5, scope: !872)
!888 = !DILocation(line: 214, column: 5, scope: !872)
!889 = !DILocation(line: 216, column: 16, scope: !890)
!890 = distinct !DILexicalBlock(scope: !872, file: !3, line: 216, column: 9)
!891 = !DILocation(line: 216, column: 30, scope: !890)
!892 = !DILocation(line: 216, column: 9, scope: !872)
!893 = !DILocation(line: 219, column: 9, scope: !872)
!894 = !DILocation(line: 218, column: 5, scope: !872)
!895 = !DILocation(line: 220, column: 21, scope: !896)
!896 = distinct !DILexicalBlock(scope: !872, file: !3, line: 220, column: 9)
!897 = !DILocation(line: 220, column: 9, scope: !896)
!898 = !DILocation(line: 220, column: 44, scope: !896)
!899 = !DILocation(line: 220, column: 9, scope: !872)
!900 = !DILocation(line: 214, column: 9, scope: !872)
!901 = !DILocation(line: 221, column: 15, scope: !902)
!902 = distinct !DILexicalBlock(scope: !896, file: !3, line: 220, column: 51)
!903 = !DILocation(line: 221, column: 48, scope: !902)
!904 = !DILocation(line: 221, column: 38, scope: !902)
!905 = !DILocation(line: 221, column: 9, scope: !902)
!906 = distinct !{!906, !905, !907}
!907 = !DILocation(line: 221, column: 62, scope: !902)
!908 = !DILocation(line: 71, column: 16, scope: !89, inlinedAt: !909)
!909 = distinct !DILocation(line: 224, column: 5, scope: !872)
!910 = !DILocation(line: 71, column: 9, scope: !89, inlinedAt: !909)
!911 = !DILocation(line: 71, column: 9, scope: !85, inlinedAt: !909)
!912 = !DILocation(line: 72, column: 9, scope: !89, inlinedAt: !909)
!913 = !DILocation(line: 74, column: 37, scope: !85, inlinedAt: !909)
!914 = !DILocation(line: 74, column: 35, scope: !85, inlinedAt: !909)
!915 = !DILocation(line: 75, column: 5, scope: !85, inlinedAt: !909)
!916 = !DILocation(line: 225, column: 30, scope: !872)
!917 = !DILocation(line: 1632, column: 30, scope: !876, inlinedAt: !887)
!918 = !DILocation(line: 1633, column: 5, scope: !876, inlinedAt: !887)
!919 = !DILocation(line: 1635, column: 5, scope: !876, inlinedAt: !887)
!920 = !DILocation(line: 1636, column: 5, scope: !876, inlinedAt: !887)
!921 = !DILocation(line: 1637, column: 1, scope: !876, inlinedAt: !887)
!922 = !DILocation(line: 226, column: 26, scope: !872)
!923 = !DILocation(line: 227, column: 35, scope: !872)
!924 = !{!91, !96, i64 1992}
!925 = !DILocation(line: 1533, column: 30, scope: !926, inlinedAt: !927)
!926 = distinct !DISubprogram(name: "aofClosePipes", scope: !3, file: !3, line: 1532, type: !86, isLocal: false, isDefinition: true, scopeLine: 1532, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !8)
!927 = distinct !DILocation(line: 229, column: 5, scope: !872)
!928 = !DILocation(line: 1533, column: 40, scope: !926, inlinedAt: !927)
!929 = !{!91, !92, i64 2052}
!930 = !DILocation(line: 1533, column: 5, scope: !926, inlinedAt: !927)
!931 = !DILocation(line: 1534, column: 30, scope: !926, inlinedAt: !927)
!932 = !DILocation(line: 1534, column: 40, scope: !926, inlinedAt: !927)
!933 = !DILocation(line: 1534, column: 5, scope: !926, inlinedAt: !927)
!934 = !DILocation(line: 1535, column: 18, scope: !926, inlinedAt: !927)
!935 = !DILocation(line: 1535, column: 5, scope: !926, inlinedAt: !927)
!936 = !DILocation(line: 1536, column: 18, scope: !926, inlinedAt: !927)
!937 = !{!91, !92, i64 2044}
!938 = !DILocation(line: 1536, column: 5, scope: !926, inlinedAt: !927)
!939 = !DILocation(line: 1537, column: 18, scope: !926, inlinedAt: !927)
!940 = !{!91, !92, i64 2048}
!941 = !DILocation(line: 1537, column: 5, scope: !926, inlinedAt: !927)
!942 = !DILocation(line: 1538, column: 18, scope: !926, inlinedAt: !927)
!943 = !DILocation(line: 1538, column: 5, scope: !926, inlinedAt: !927)
!944 = !DILocation(line: 1539, column: 18, scope: !926, inlinedAt: !927)
!945 = !{!91, !92, i64 2056}
!946 = !DILocation(line: 1539, column: 5, scope: !926, inlinedAt: !927)
!947 = !DILocation(line: 1540, column: 18, scope: !926, inlinedAt: !927)
!948 = !{!91, !92, i64 2060}
!949 = !DILocation(line: 1540, column: 5, scope: !926, inlinedAt: !927)
!950 = !DILocation(line: 230, column: 1, scope: !872)
!951 = distinct !DISubprogram(name: "startAppendOnly", scope: !3, file: !3, line: 248, type: !429, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !952)
!952 = !{!953, !957, !958}
!953 = !DILocalVariable(name: "cwd", scope: !951, file: !3, line: 249, type: !954)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1024)
!957 = !DILocalVariable(name: "newfd", scope: !951, file: !3, line: 250, type: !6)
!958 = !DILocalVariable(name: "cwdp", scope: !959, file: !3, line: 255, type: !20)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 254, column: 22)
!960 = distinct !DILexicalBlock(scope: !951, file: !3, line: 254, column: 9)
!961 = !DILocation(line: 249, column: 5, scope: !951)
!962 = !DILocation(line: 249, column: 10, scope: !951)
!963 = !DILocation(line: 252, column: 25, scope: !951)
!964 = !{!91, !95, i64 1888}
!965 = !DILocation(line: 252, column: 13, scope: !951)
!966 = !DILocation(line: 250, column: 9, scope: !951)
!967 = !DILocation(line: 253, column: 5, scope: !951)
!968 = !DILocation(line: 254, column: 15, scope: !960)
!969 = !DILocation(line: 254, column: 9, scope: !951)
!970 = !DILocation(line: 255, column: 22, scope: !959)
!971 = !DILocation(line: 255, column: 15, scope: !959)
!972 = !DILocation(line: 260, column: 20, scope: !959)
!973 = !DILocation(line: 261, column: 13, scope: !959)
!974 = !DILocation(line: 262, column: 22, scope: !959)
!975 = !DILocation(line: 262, column: 13, scope: !959)
!976 = !DILocation(line: 257, column: 9, scope: !959)
!977 = !DILocation(line: 265, column: 16, scope: !978)
!978 = distinct !DILexicalBlock(scope: !951, file: !3, line: 265, column: 9)
!979 = !{!91, !92, i64 2096}
!980 = !DILocation(line: 265, column: 30, scope: !978)
!981 = !DILocation(line: 265, column: 9, scope: !951)
!982 = !DILocation(line: 266, column: 38, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !3, line: 265, column: 37)
!984 = !{!91, !92, i64 1936}
!985 = !DILocation(line: 267, column: 9, scope: !983)
!986 = !DILocation(line: 268, column: 5, scope: !983)
!987 = !DILocation(line: 272, column: 20, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 272, column: 13)
!989 = distinct !DILexicalBlock(scope: !978, file: !3, line: 268, column: 12)
!990 = !DILocation(line: 272, column: 34, scope: !988)
!991 = !DILocation(line: 272, column: 13, scope: !989)
!992 = !DILocation(line: 273, column: 13, scope: !993)
!993 = distinct !DILexicalBlock(scope: !988, file: !3, line: 272, column: 41)
!994 = !DILocation(line: 274, column: 13, scope: !993)
!995 = !DILocation(line: 275, column: 9, scope: !993)
!996 = !DILocation(line: 276, column: 13, scope: !997)
!997 = distinct !DILexicalBlock(scope: !989, file: !3, line: 276, column: 13)
!998 = !DILocation(line: 276, column: 47, scope: !997)
!999 = !DILocation(line: 276, column: 13, scope: !989)
!1000 = !DILocation(line: 277, column: 13, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !997, file: !3, line: 276, column: 57)
!1002 = !DILocation(line: 278, column: 13, scope: !1001)
!1003 = !DILocation(line: 279, column: 13, scope: !1001)
!1004 = !DILocation(line: 284, column: 22, scope: !951)
!1005 = !DILocation(line: 285, column: 36, scope: !951)
!1006 = !DILocation(line: 285, column: 27, scope: !951)
!1007 = !DILocation(line: 286, column: 19, scope: !951)
!1008 = !DILocation(line: 287, column: 5, scope: !951)
!1009 = !DILocation(line: 0, scope: !1001)
!1010 = !DILocation(line: 288, column: 1, scope: !951)
!1011 = distinct !DISubprogram(name: "rewriteAppendOnlyFileBackground", scope: !3, file: !3, line: 1559, type: !429, isLocal: false, isDefinition: true, scopeLine: 1559, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1012)
!1012 = !{!1013, !1014, !1015, !1018}
!1013 = !DILocalVariable(name: "childpid", scope: !1011, file: !3, line: 1560, type: !879)
!1014 = !DILocalVariable(name: "start", scope: !1011, file: !3, line: 1561, type: !16)
!1015 = !DILocalVariable(name: "tmpfile", scope: !1016, file: !3, line: 1568, type: !883)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 1567, column: 35)
!1017 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 1567, column: 9)
!1018 = !DILocalVariable(name: "private_dirty", scope: !1019, file: !3, line: 1575, type: !583)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1574, column: 53)
!1020 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 1574, column: 13)
!1021 = !DILocation(line: 1563, column: 16, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 1563, column: 9)
!1023 = !DILocation(line: 1563, column: 46, scope: !1022)
!1024 = !DILocation(line: 1563, column: 36, scope: !1022)
!1025 = !DILocation(line: 1564, column: 9, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 1564, column: 9)
!1027 = !DILocation(line: 1564, column: 26, scope: !1026)
!1028 = !DILocation(line: 1564, column: 9, scope: !1011)
!1029 = !DILocation(line: 1565, column: 5, scope: !1011)
!1030 = !DILocation(line: 1566, column: 13, scope: !1011)
!1031 = !DILocation(line: 1561, column: 15, scope: !1011)
!1032 = !DILocation(line: 1567, column: 21, scope: !1017)
!1033 = !DILocation(line: 1560, column: 11, scope: !1011)
!1034 = !DILocation(line: 1567, column: 29, scope: !1017)
!1035 = !DILocation(line: 1567, column: 9, scope: !1011)
!1036 = !DILocation(line: 1568, column: 9, scope: !1016)
!1037 = !DILocation(line: 1568, column: 14, scope: !1016)
!1038 = !DILocation(line: 1571, column: 9, scope: !1016)
!1039 = !DILocation(line: 1572, column: 9, scope: !1016)
!1040 = !DILocation(line: 1573, column: 65, scope: !1016)
!1041 = !DILocation(line: 1573, column: 9, scope: !1016)
!1042 = !DILocation(line: 1574, column: 13, scope: !1020)
!1043 = !DILocation(line: 1574, column: 44, scope: !1020)
!1044 = !DILocation(line: 1574, column: 13, scope: !1016)
!1045 = !DILocation(line: 1575, column: 36, scope: !1019)
!1046 = !DILocation(line: 1575, column: 20, scope: !1019)
!1047 = !DILocation(line: 1577, column: 17, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 1577, column: 17)
!1049 = !DILocation(line: 1577, column: 17, scope: !1019)
!1050 = !DILocation(line: 1580, column: 34, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 1577, column: 32)
!1052 = !DILocation(line: 1578, column: 17, scope: !1051)
!1053 = !DILocation(line: 1581, column: 13, scope: !1051)
!1054 = !DILocation(line: 1583, column: 45, scope: !1019)
!1055 = !{!91, !96, i64 2208}
!1056 = !DILocation(line: 1584, column: 13, scope: !1019)
!1057 = !DILocation(line: 1585, column: 13, scope: !1019)
!1058 = !DILocation(line: 1586, column: 9, scope: !1019)
!1059 = !DILocation(line: 1587, column: 13, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1586, column: 16)
!1061 = !DILocation(line: 1589, column: 5, scope: !1017)
!1062 = !DILocation(line: 1616, column: 5, scope: !1011)
!1063 = !DILocation(line: 1591, column: 33, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 1589, column: 12)
!1065 = !DILocation(line: 1591, column: 41, scope: !1064)
!1066 = !DILocation(line: 1591, column: 31, scope: !1064)
!1067 = !{!91, !97, i64 1120}
!1068 = !DILocation(line: 1592, column: 42, scope: !1064)
!1069 = !DILocation(line: 1592, column: 33, scope: !1064)
!1070 = !DILocation(line: 1592, column: 64, scope: !1064)
!1071 = !DILocation(line: 1592, column: 83, scope: !1064)
!1072 = !DILocation(line: 1592, column: 76, scope: !1064)
!1073 = !DILocation(line: 1592, column: 74, scope: !1064)
!1074 = !DILocation(line: 1592, column: 98, scope: !1064)
!1075 = !DILocation(line: 1592, column: 31, scope: !1064)
!1076 = !{!91, !98, i64 1128}
!1077 = !DILocation(line: 1593, column: 9, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1593, column: 9)
!1079 = !DILocation(line: 1593, column: 9, scope: !1064)
!1080 = !DILocation(line: 1594, column: 22, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1594, column: 13)
!1082 = !DILocation(line: 1594, column: 13, scope: !1064)
!1083 = !DILocation(line: 1595, column: 13, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 1594, column: 29)
!1085 = !DILocation(line: 1598, column: 26, scope: !1084)
!1086 = !DILocation(line: 1598, column: 17, scope: !1084)
!1087 = !DILocation(line: 1596, column: 13, scope: !1084)
!1088 = !DILocation(line: 1533, column: 30, scope: !926, inlinedAt: !1089)
!1089 = distinct !DILocation(line: 1599, column: 13, scope: !1084)
!1090 = !DILocation(line: 1533, column: 40, scope: !926, inlinedAt: !1089)
!1091 = !DILocation(line: 1533, column: 5, scope: !926, inlinedAt: !1089)
!1092 = !DILocation(line: 1534, column: 30, scope: !926, inlinedAt: !1089)
!1093 = !DILocation(line: 1534, column: 40, scope: !926, inlinedAt: !1089)
!1094 = !DILocation(line: 1534, column: 5, scope: !926, inlinedAt: !1089)
!1095 = !DILocation(line: 1535, column: 18, scope: !926, inlinedAt: !1089)
!1096 = !DILocation(line: 1535, column: 5, scope: !926, inlinedAt: !1089)
!1097 = !DILocation(line: 1536, column: 18, scope: !926, inlinedAt: !1089)
!1098 = !DILocation(line: 1536, column: 5, scope: !926, inlinedAt: !1089)
!1099 = !DILocation(line: 1537, column: 18, scope: !926, inlinedAt: !1089)
!1100 = !DILocation(line: 1537, column: 5, scope: !926, inlinedAt: !1089)
!1101 = !DILocation(line: 1538, column: 18, scope: !926, inlinedAt: !1089)
!1102 = !DILocation(line: 1538, column: 5, scope: !926, inlinedAt: !1089)
!1103 = !DILocation(line: 1539, column: 18, scope: !926, inlinedAt: !1089)
!1104 = !DILocation(line: 1539, column: 5, scope: !926, inlinedAt: !1089)
!1105 = !DILocation(line: 1540, column: 18, scope: !926, inlinedAt: !1089)
!1106 = !DILocation(line: 1540, column: 5, scope: !926, inlinedAt: !1089)
!1107 = !DILocation(line: 1600, column: 13, scope: !1084)
!1108 = !DILocation(line: 1602, column: 9, scope: !1064)
!1109 = !DILocation(line: 1604, column: 38, scope: !1064)
!1110 = !DILocation(line: 1605, column: 41, scope: !1064)
!1111 = !DILocation(line: 1605, column: 39, scope: !1064)
!1112 = !DILocation(line: 1606, column: 30, scope: !1064)
!1113 = !DILocation(line: 1607, column: 9, scope: !1064)
!1114 = !DILocation(line: 1612, column: 32, scope: !1064)
!1115 = !DILocation(line: 1613, column: 9, scope: !1064)
!1116 = !DILocation(line: 1614, column: 9, scope: !1064)
!1117 = !DILocation(line: 0, scope: !1064)
!1118 = !DILocation(line: 1617, column: 1, scope: !1011)
!1119 = !DILocation(line: 297, column: 22, scope: !578)
!1120 = !DILocation(line: 297, column: 38, scope: !578)
!1121 = !DILocation(line: 297, column: 50, scope: !578)
!1122 = !DILocation(line: 298, column: 13, scope: !578)
!1123 = !DILocation(line: 298, column: 27, scope: !578)
!1124 = !DILocation(line: 301, column: 20, scope: !597)
!1125 = !DILocation(line: 303, column: 22, scope: !600)
!1126 = !DILocation(line: 303, column: 13, scope: !597)
!1127 = !DILocation(line: 304, column: 17, scope: !603)
!1128 = !DILocation(line: 304, column: 23, scope: !603)
!1129 = !DILocation(line: 304, column: 17, scope: !604)
!1130 = !DILocation(line: 307, column: 20, scope: !604)
!1131 = !DILocation(line: 307, column: 13, scope: !604)
!1132 = !DILocation(line: 310, column: 13, scope: !597)
!1133 = !DILocation(line: 311, column: 13, scope: !597)
!1134 = !DILocation(line: 312, column: 20, scope: !597)
!1135 = !DILocation(line: 0, scope: !578)
!1136 = !DILocation(line: 316, column: 1, scope: !578)
!1137 = distinct !DISubprogram(name: "catAppendOnlyGenericCommand", scope: !3, file: !3, line: 518, type: !1138, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1150)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!469, !469, !6, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !75, line: 622, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !75, line: 614, size: 128, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1143, file: !75, line: 615, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1143, file: !75, line: 616, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1143, file: !75, line: 617, baseType: !55, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1143, file: !75, line: 620, baseType: !6, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1143, file: !75, line: 621, baseType: !10, size: 64, offset: 64)
!1150 = !{!1151, !1152, !1153, !1154, !1158, !1159, !1160}
!1151 = !DILocalVariable(name: "dst", arg: 1, scope: !1137, file: !3, line: 518, type: !469)
!1152 = !DILocalVariable(name: "argc", arg: 2, scope: !1137, file: !3, line: 518, type: !6)
!1153 = !DILocalVariable(name: "argv", arg: 3, scope: !1137, file: !3, line: 518, type: !1140)
!1154 = !DILocalVariable(name: "buf", scope: !1137, file: !3, line: 519, type: !1155)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !1156)
!1156 = !{!1157}
!1157 = !DISubrange(count: 32)
!1158 = !DILocalVariable(name: "len", scope: !1137, file: !3, line: 520, type: !6)
!1159 = !DILocalVariable(name: "j", scope: !1137, file: !3, line: 520, type: !6)
!1160 = !DILocalVariable(name: "o", scope: !1137, file: !3, line: 521, type: !1141)
!1161 = !DILocation(line: 518, column: 37, scope: !1137)
!1162 = !DILocation(line: 518, column: 46, scope: !1137)
!1163 = !DILocation(line: 518, column: 59, scope: !1137)
!1164 = !DILocation(line: 519, column: 5, scope: !1137)
!1165 = !DILocation(line: 519, column: 10, scope: !1137)
!1166 = !DILocation(line: 523, column: 12, scope: !1137)
!1167 = !DILocation(line: 524, column: 26, scope: !1137)
!1168 = !DILocation(line: 524, column: 43, scope: !1137)
!1169 = !DILocation(line: 524, column: 13, scope: !1137)
!1170 = !DILocation(line: 524, column: 12, scope: !1137)
!1171 = !DILocation(line: 520, column: 9, scope: !1137)
!1172 = !DILocation(line: 525, column: 12, scope: !1137)
!1173 = !DILocation(line: 525, column: 5, scope: !1137)
!1174 = !DILocation(line: 525, column: 16, scope: !1137)
!1175 = !DILocation(line: 526, column: 12, scope: !1137)
!1176 = !DILocation(line: 526, column: 5, scope: !1137)
!1177 = !DILocation(line: 526, column: 16, scope: !1137)
!1178 = !DILocation(line: 527, column: 29, scope: !1137)
!1179 = !DILocation(line: 527, column: 11, scope: !1137)
!1180 = !DILocation(line: 520, column: 14, scope: !1137)
!1181 = !DILocation(line: 529, column: 19, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 529, column: 5)
!1183 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 529, column: 5)
!1184 = !DILocation(line: 529, column: 5, scope: !1183)
!1185 = !DILocation(line: 530, column: 30, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 529, column: 32)
!1187 = !{!95, !95, i64 0}
!1188 = !DILocation(line: 530, column: 13, scope: !1186)
!1189 = !DILocation(line: 521, column: 11, scope: !1137)
!1190 = !DILocation(line: 531, column: 16, scope: !1186)
!1191 = !DILocation(line: 532, column: 57, scope: !1186)
!1192 = !{!1193, !95, i64 8}
!1193 = !{!"redisObject", !92, i64 0, !92, i64 0, !92, i64 1, !92, i64 4, !95, i64 8}
!1194 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 532, column: 47, scope: !1186)
!1196 = !DILocation(line: 88, column: 27, scope: !463, inlinedAt: !1195)
!1197 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !1195)
!1198 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !1195)
!1199 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !1195)
!1200 = !DILocation(line: 91, column: 13, scope: !485, inlinedAt: !1195)
!1201 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !1195)
!1202 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !1195)
!1203 = !DILocation(line: 93, column: 13, scope: !485, inlinedAt: !1195)
!1204 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !1195)
!1205 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !1195)
!1206 = !DILocation(line: 95, column: 13, scope: !485, inlinedAt: !1195)
!1207 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !1195)
!1208 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !1195)
!1209 = !DILocation(line: 97, column: 13, scope: !485, inlinedAt: !1195)
!1210 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !1195)
!1211 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !1195)
!1212 = !DILocation(line: 99, column: 13, scope: !485, inlinedAt: !1195)
!1213 = !DILocation(line: 0, scope: !485, inlinedAt: !1195)
!1214 = !DILocation(line: 532, column: 17, scope: !1186)
!1215 = !DILocation(line: 532, column: 16, scope: !1186)
!1216 = !DILocation(line: 533, column: 16, scope: !1186)
!1217 = !DILocation(line: 533, column: 9, scope: !1186)
!1218 = !DILocation(line: 533, column: 20, scope: !1186)
!1219 = !DILocation(line: 534, column: 16, scope: !1186)
!1220 = !DILocation(line: 534, column: 9, scope: !1186)
!1221 = !DILocation(line: 534, column: 20, scope: !1186)
!1222 = !DILocation(line: 535, column: 33, scope: !1186)
!1223 = !DILocation(line: 535, column: 15, scope: !1186)
!1224 = !DILocation(line: 536, column: 32, scope: !1186)
!1225 = !DILocation(line: 87, column: 39, scope: !463, inlinedAt: !1226)
!1226 = distinct !DILocation(line: 536, column: 36, scope: !1186)
!1227 = !DILocation(line: 88, column: 27, scope: !463, inlinedAt: !1226)
!1228 = !DILocation(line: 88, column: 19, scope: !463, inlinedAt: !1226)
!1229 = !DILocation(line: 89, column: 5, scope: !463, inlinedAt: !1226)
!1230 = !DILocation(line: 91, column: 20, scope: !485, inlinedAt: !1226)
!1231 = !DILocation(line: 91, column: 13, scope: !485, inlinedAt: !1226)
!1232 = !DILocation(line: 93, column: 20, scope: !485, inlinedAt: !1226)
!1233 = !DILocation(line: 93, column: 34, scope: !485, inlinedAt: !1226)
!1234 = !DILocation(line: 93, column: 13, scope: !485, inlinedAt: !1226)
!1235 = !DILocation(line: 95, column: 20, scope: !485, inlinedAt: !1226)
!1236 = !DILocation(line: 95, column: 35, scope: !485, inlinedAt: !1226)
!1237 = !DILocation(line: 95, column: 13, scope: !485, inlinedAt: !1226)
!1238 = !DILocation(line: 97, column: 20, scope: !485, inlinedAt: !1226)
!1239 = !DILocation(line: 97, column: 35, scope: !485, inlinedAt: !1226)
!1240 = !DILocation(line: 97, column: 13, scope: !485, inlinedAt: !1226)
!1241 = !DILocation(line: 99, column: 20, scope: !485, inlinedAt: !1226)
!1242 = !DILocation(line: 99, column: 35, scope: !485, inlinedAt: !1226)
!1243 = !DILocation(line: 99, column: 13, scope: !485, inlinedAt: !1226)
!1244 = !DILocation(line: 0, scope: !485, inlinedAt: !1226)
!1245 = !DILocation(line: 536, column: 15, scope: !1186)
!1246 = !DILocation(line: 537, column: 15, scope: !1186)
!1247 = !DILocation(line: 538, column: 9, scope: !1186)
!1248 = !DILocation(line: 529, column: 28, scope: !1182)
!1249 = distinct !{!1249, !1184, !1250}
!1250 = !DILocation(line: 539, column: 5, scope: !1183)
!1251 = !DILocation(line: 0, scope: !1186)
!1252 = !DILocation(line: 541, column: 1, scope: !1137)
!1253 = !DILocation(line: 540, column: 5, scope: !1137)
!1254 = distinct !DISubprogram(name: "catAppendOnlyExpireAtCommand", scope: !3, file: !3, line: 550, type: !1255, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !1467)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!469, !469, !1257, !1141, !1141}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !75, line: 1307, size: 640, elements: !1259)
!1259 = !{!1260, !1261, !1453, !1454, !1455, !1456, !1462, !1463, !1464, !1465, !1466}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1258, file: !75, line: 1308, baseType: !20, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !1258, file: !75, line: 1309, baseType: !1262, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !75, line: 1305, baseType: !1264)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !75, line: 780, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !75, line: 723, size: 135360, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1403, !1404, !1408, !1409, !1425, !1426, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1268, file: !75, line: 724, baseType: !63, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1268, file: !75, line: 725, baseType: !6, size: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !1268, file: !75, line: 726, baseType: !1273, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !75, line: 656, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !75, line: 647, size: 512, elements: !1276)
!1276 = !{!1277, !1339, !1340, !1341, !1342, !1343, !1344, !1345}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !1275, file: !75, line: 648, baseType: !1278, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !1280, line: 82, baseType: !1281)
!1280 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !1280, line: 76, size: 768, elements: !1282)
!1282 = !{!1283, !1308, !1309, !1337, !1338}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1281, file: !1280, line: 77, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !1280, line: 65, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !1280, line: 58, size: 384, elements: !1287)
!1287 = !{!1288, !1294, !1298, !1299, !1303, !1307}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !1286, file: !1280, line: 59, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!63, !1292}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !1286, file: !1280, line: 60, baseType: !1295, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!10, !10, !1292}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !1286, file: !1280, line: 61, baseType: !1295, size: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !1286, file: !1280, line: 62, baseType: !1300, size: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!6, !10, !1292, !1292}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !1286, file: !1280, line: 63, baseType: !1304, size: 64, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{null, !10, !10}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !1286, file: !1280, line: 64, baseType: !1304, size: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !1281, file: !1280, line: 78, baseType: !10, size: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1281, file: !1280, line: 79, baseType: !1310, size: 512, offset: 128)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1311, size: 512, elements: !1335)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !1280, line: 74, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !1280, line: 69, size: 256, elements: !1313)
!1313 = !{!1314, !1332, !1333, !1334}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1312, file: !1280, line: 70, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !1280, line: 56, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !1280, line: 47, size: 192, elements: !1319)
!1319 = !{!1320, !1321, !1330}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1318, file: !1280, line: 48, baseType: !10, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1318, file: !1280, line: 54, baseType: !1322, size: 64, offset: 64)
!1322 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1318, file: !1280, line: 49, size: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1329}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1322, file: !1280, line: 50, baseType: !10, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !1322, file: !1280, line: 51, baseType: !63, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !1322, file: !1280, line: 52, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !30, line: 56, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !32, line: 103, baseType: !15)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !1322, file: !1280, line: 53, baseType: !23, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1318, file: !1280, line: 55, baseType: !1331, size: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1312, file: !1280, line: 71, baseType: !17, size: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !1312, file: !1280, line: 72, baseType: !17, size: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1312, file: !1280, line: 73, baseType: !17, size: 64, offset: 192)
!1335 = !{!1336}
!1336 = !DISubrange(count: 2)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !1281, file: !1280, line: 80, baseType: !15, size: 64, offset: 640)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !1281, file: !1280, line: 81, baseType: !17, size: 64, offset: 704)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1275, file: !75, line: 649, baseType: !1278, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !1275, file: !75, line: 650, baseType: !1278, size: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !1275, file: !75, line: 651, baseType: !1278, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !1275, file: !75, line: 652, baseType: !1278, size: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1275, file: !75, line: 653, baseType: !6, size: 32, offset: 320)
