; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/api_msg.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/api/api_msg.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.sys_mutex_t = type { %struct.uk_mutex, i32 }
%struct.uk_mutex = type { i32, %struct.uk_thread*, %struct.uk_waitq }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.9, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.9 = type { %struct.uk_thread*, %struct.uk_thread** }

!56 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcpbase.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!58 = !DIEnumerator(name: "CLOSED", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "LISTEN", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "SYN_SENT", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "SYN_RCVD", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "ESTABLISHED", value: 4, isUnsigned: true)
!63 = !DIEnumerator(name: "FIN_WAIT_1", value: 5, isUnsigned: true)
!64 = !DIEnumerator(name: "FIN_WAIT_2", value: 6, isUnsigned: true)
!65 = !DIEnumerator(name: "CLOSE_WAIT", value: 7, isUnsigned: true)
!66 = !DIEnumerator(name: "CLOSING", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "LAST_ACK", value: 9, isUnsigned: true)
!68 = !DIEnumerator(name: "TIME_WAIT", value: 10, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !70, line: 92, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netconn_evt", file: !35, line: 181, baseType: !7, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIEnumerator(name: "NETCONN_EVT_RCVPLUS", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "NETCONN_EVT_RCVMINUS", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "NETCONN_EVT_SENDPLUS", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "NETCONN_EVT_SENDMINUS", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "NETCONN_EVT_ERROR", value: 4, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netconn_igmp", file: !35, line: 191, baseType: !7, size: 32, elements: !83)
!83 = !{!84, !85}
!84 = !DIEnumerator(name: "NETCONN_JOIN", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "NETCONN_LEAVE", value: 1, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !87, line: 156, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !92, line: 54, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!96 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 52, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/memp.h", directory: "/root/.unikraft/apps/redis/build")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!100 = !DIEnumerator(name: "MEMP_UDP_PCB", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "MEMP_TCP_PCB", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "MEMP_TCP_PCB_LISTEN", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "MEMP_TCP_SEG", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "MEMP_REASSDATA", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "MEMP_FRAG_PBUF", value: 5, isUnsigned: true)
!106 = !DIEnumerator(name: "MEMP_NETBUF", value: 6, isUnsigned: true)
!107 = !DIEnumerator(name: "MEMP_NETCONN", value: 7, isUnsigned: true)
!108 = !DIEnumerator(name: "MEMP_TCPIP_MSG_API", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "MEMP_TCPIP_MSG_INPKT", value: 9, isUnsigned: true)
!110 = !DIEnumerator(name: "MEMP_SYS_TIMEOUT", value: 10, isUnsigned: true)
!111 = !DIEnumerator(name: "MEMP_NETDB", value: 11, isUnsigned: true)
!112 = !DIEnumerator(name: "MEMP_ND6_QUEUE", value: 12, isUnsigned: true)
!113 = !DIEnumerator(name: "MEMP_IP6_REASSDATA", value: 13, isUnsigned: true)
!114 = !DIEnumerator(name: "MEMP_MLD6_GROUP", value: 14, isUnsigned: true)
!115 = !DIEnumerator(name: "MEMP_PBUF", value: 15, isUnsigned: true)
!116 = !DIEnumerator(name: "MEMP_PBUF_POOL", value: 16, isUnsigned: true)
!117 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!118 = !{!119, !120, !125, !161, !152, !193, !865, !803, !242, !875, !876}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "api_msg", file: !122, line: 79, size: 512, elements: !123)
!122 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/api_msg.h", directory: "/root/.unikraft/apps/redis/build")
!123 = !{!124, !798, !799}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !121, file: !122, line: 82, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netconn", file: !35, line: 218, size: 1024, elements: !127)
!127 = !{!128, !129, !130, !337, !338, !779, !789, !790, !791, !792, !793}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !35, line: 220, baseType: !34, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !35, line: 222, baseType: !48, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pcb", scope: !126, file: !35, line: 229, baseType: !131, size: 64, offset: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !35, line: 224, size: 64, elements: !132)
!132 = !{!133, !177, !308, !334}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !131, file: !35, line: 225, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_pcb", file: !136, line: 91, size: 416, elements: !137)
!136 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip.h", directory: "/root/.unikraft/apps/redis/build")
!137 = !{!138, !172, !173, !174, !175, !176}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !135, file: !136, line: 93, baseType: !139, size: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !92, line: 76, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !92, line: 69, size: 192, elements: !141)
!141 = !{!142, !171}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !140, file: !92, line: 73, baseType: !143, size: 160)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !140, file: !92, line: 70, size: 160, elements: !144)
!144 = !{!145, !165}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !143, file: !92, line: 71, baseType: !146, size: 160)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !147, line: 67, baseType: !148)
!147 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !147, line: 59, size: 160, elements: !149)
!149 = !{!150, !160}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !148, file: !147, line: 60, baseType: !151, size: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !158)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !153, line: 129, baseType: !154)
!153 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !155, line: 48, baseType: !156)
!155 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !157, line: 79, baseType: !7)
!157 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!158 = !{!159}
!159 = !DISubrange(count: 4)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !148, file: !147, line: 62, baseType: !161, size: 8, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !153, line: 125, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !155, line: 24, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !157, line: 43, baseType: !164)
!164 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !143, file: !92, line: 72, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !167, line: 57, baseType: !168)
!167 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !167, line: 51, size: 32, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !168, file: !167, line: 52, baseType: !152, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !92, line: 75, baseType: !161, size: 8, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !135, file: !136, line: 93, baseType: !139, size: 192, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !135, file: !136, line: 93, baseType: !161, size: 8, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !135, file: !136, line: 93, baseType: !161, size: 8, offset: 392)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !135, file: !136, line: 93, baseType: !161, size: 8, offset: 400)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !135, file: !136, line: 93, baseType: !161, size: 8, offset: 408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !131, file: !35, line: 226, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb", file: !180, line: 242, size: 2240, elements: !181)
!180 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !197, !198, !200, !201, !202, !203, !204, !205, !207, !208, !209, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !239, !240, !241, !254, !279, !284, !289, !291, !296, !301, !302, !303, !304, !305, !306, !307}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !179, file: !180, line: 244, baseType: !139, size: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !179, file: !180, line: 244, baseType: !139, size: 192, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !179, file: !180, line: 244, baseType: !161, size: 8, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !179, file: !180, line: 244, baseType: !161, size: 8, offset: 392)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !179, file: !180, line: 244, baseType: !161, size: 8, offset: 400)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !179, file: !180, line: 244, baseType: !161, size: 8, offset: 408)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !180, line: 246, baseType: !178, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !179, file: !180, line: 246, baseType: !119, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !179, file: !180, line: 246, baseType: !55, size: 32, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !179, file: !180, line: 246, baseType: !161, size: 8, offset: 608)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !179, file: !180, line: 246, baseType: !193, size: 16, offset: 624)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !153, line: 127, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !155, line: 36, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !157, line: 57, baseType: !196)
!196 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !179, file: !180, line: 249, baseType: !193, size: 16, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !180, line: 251, baseType: !199, size: 16, offset: 656)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpflags_t", file: !180, line: 206, baseType: !193)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "polltmr", scope: !179, file: !180, line: 278, baseType: !161, size: 8, offset: 672)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pollinterval", scope: !179, file: !180, line: 278, baseType: !161, size: 8, offset: 680)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "last_timer", scope: !179, file: !180, line: 279, baseType: !161, size: 8, offset: 688)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !179, file: !180, line: 280, baseType: !152, size: 32, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !179, file: !180, line: 283, baseType: !152, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wnd", scope: !179, file: !180, line: 284, baseType: !206, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpwnd_size_t", file: !56, line: 51, baseType: !152)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_wnd", scope: !179, file: !180, line: 285, baseType: !206, size: 32, offset: 800)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_right_edge", scope: !179, file: !180, line: 286, baseType: !152, size: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rtime", scope: !179, file: !180, line: 295, baseType: !210, size: 16, offset: 864)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !153, line: 128, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !155, line: 32, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !157, line: 55, baseType: !213)
!213 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !179, file: !180, line: 297, baseType: !193, size: 16, offset: 880)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rttest", scope: !179, file: !180, line: 300, baseType: !152, size: 32, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "rtseq", scope: !179, file: !180, line: 301, baseType: !152, size: 32, offset: 928)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !179, file: !180, line: 302, baseType: !210, size: 16, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !179, file: !180, line: 302, baseType: !210, size: 16, offset: 976)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rto", scope: !179, file: !180, line: 304, baseType: !210, size: 16, offset: 992)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nrtx", scope: !179, file: !180, line: 305, baseType: !161, size: 8, offset: 1008)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dupacks", scope: !179, file: !180, line: 308, baseType: !161, size: 8, offset: 1016)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lastack", scope: !179, file: !180, line: 309, baseType: !152, size: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd", scope: !179, file: !180, line: 312, baseType: !206, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !179, file: !180, line: 313, baseType: !206, size: 32, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "rto_end", scope: !179, file: !180, line: 316, baseType: !152, size: 32, offset: 1120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !179, file: !180, line: 319, baseType: !152, size: 32, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl1", scope: !179, file: !180, line: 320, baseType: !152, size: 32, offset: 1184)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl2", scope: !179, file: !180, line: 320, baseType: !152, size: 32, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "snd_lbb", scope: !179, file: !180, line: 322, baseType: !152, size: 32, offset: 1248)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd", scope: !179, file: !180, line: 323, baseType: !206, size: 32, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd_max", scope: !179, file: !180, line: 324, baseType: !206, size: 32, offset: 1312)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "snd_buf", scope: !179, file: !180, line: 326, baseType: !206, size: 32, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "snd_queuelen", scope: !179, file: !180, line: 328, baseType: !193, size: 16, offset: 1376)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "unsent_oversize", scope: !179, file: !180, line: 332, baseType: !193, size: 16, offset: 1392)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !179, file: !180, line: 335, baseType: !206, size: 32, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "unsent", scope: !179, file: !180, line: 338, baseType: !237, size: 64, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_seg", file: !180, line: 338, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "unacked", scope: !179, file: !180, line: 339, baseType: !237, size: 64, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ooseq", scope: !179, file: !180, line: 341, baseType: !237, size: 64, offset: 1600)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "refused_data", scope: !179, file: !180, line: 344, baseType: !242, size: 64, offset: 1664)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !244, line: 186, size: 192, elements: !245)
!244 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !244, line: 188, baseType: !242, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !243, file: !244, line: 191, baseType: !119, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !243, file: !244, line: 200, baseType: !193, size: 16, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !244, line: 203, baseType: !193, size: 16, offset: 144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !243, file: !244, line: 208, baseType: !161, size: 8, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !244, line: 211, baseType: !161, size: 8, offset: 168)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !243, file: !244, line: 218, baseType: !161, size: 8, offset: 176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !243, file: !244, line: 221, baseType: !161, size: 8, offset: 184)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !179, file: !180, line: 347, baseType: !255, size: 64, offset: 1728)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb_listen", file: !180, line: 223, size: 704, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !256, file: !180, line: 225, baseType: !139, size: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !256, file: !180, line: 225, baseType: !139, size: 192, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !256, file: !180, line: 225, baseType: !161, size: 8, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !256, file: !180, line: 225, baseType: !161, size: 8, offset: 392)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !256, file: !180, line: 225, baseType: !161, size: 8, offset: 400)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !256, file: !180, line: 225, baseType: !161, size: 8, offset: 408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !180, line: 227, baseType: !255, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !256, file: !180, line: 227, baseType: !119, size: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !256, file: !180, line: 227, baseType: !55, size: 32, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !256, file: !180, line: 227, baseType: !161, size: 8, offset: 608)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !256, file: !180, line: 227, baseType: !193, size: 16, offset: 624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !256, file: !180, line: 231, baseType: !270, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_accept_fn", file: !180, line: 70, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !119, !178, !274}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !14, line: 96, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !153, line: 126, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !155, line: 20, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !157, line: 41, baseType: !278)
!278 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !179, file: !180, line: 352, baseType: !280, size: 64, offset: 1792)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_sent_fn", file: !180, line: 96, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!274, !119, !178, !193}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !179, file: !180, line: 354, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_recv_fn", file: !180, line: 82, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!274, !119, !178, !242, !274}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !179, file: !180, line: 356, baseType: !290, size: 64, offset: 1920)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connected_fn", file: !180, line: 134, baseType: !271)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !179, file: !180, line: 358, baseType: !292, size: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_poll_fn", file: !180, line: 108, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!274, !119, !178}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "errf", scope: !179, file: !180, line: 360, baseType: !297, size: 64, offset: 2048)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_err_fn", file: !180, line: 120, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !119, !274}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "keep_idle", scope: !179, file: !180, line: 369, baseType: !152, size: 32, offset: 2112)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "persist_cnt", scope: !179, file: !180, line: 376, baseType: !161, size: 8, offset: 2144)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "persist_backoff", scope: !179, file: !180, line: 378, baseType: !161, size: 8, offset: 2152)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "persist_probe", scope: !179, file: !180, line: 380, baseType: !161, size: 8, offset: 2160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "keep_cnt_sent", scope: !179, file: !180, line: 383, baseType: !161, size: 8, offset: 2168)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "snd_scale", scope: !179, file: !180, line: 386, baseType: !161, size: 8, offset: 2176)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_scale", scope: !179, file: !180, line: 387, baseType: !161, size: 8, offset: 2184)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !131, file: !35, line: 227, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_pcb", file: !311, line: 81, size: 768, elements: !312)
!311 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/udp.h", directory: "/root/.unikraft/apps/redis/build")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !333}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !310, file: !311, line: 83, baseType: !139, size: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !310, file: !311, line: 83, baseType: !139, size: 192, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !310, file: !311, line: 83, baseType: !161, size: 8, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !310, file: !311, line: 83, baseType: !161, size: 8, offset: 392)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !310, file: !311, line: 83, baseType: !161, size: 8, offset: 400)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !310, file: !311, line: 83, baseType: !161, size: 8, offset: 408)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !311, line: 87, baseType: !309, size: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !311, line: 89, baseType: !161, size: 8, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !310, file: !311, line: 91, baseType: !193, size: 16, offset: 528)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !310, file: !311, line: 91, baseType: !193, size: 16, offset: 544)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ip4", scope: !310, file: !311, line: 96, baseType: !166, size: 32, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ifindex", scope: !310, file: !311, line: 99, baseType: !161, size: 8, offset: 608)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !310, file: !311, line: 101, baseType: !161, size: 8, offset: 616)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !310, file: !311, line: 110, baseType: !327, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "udp_recv_fn", file: !311, line: 77, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !119, !309, !242, !331, !193}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "recv_arg", scope: !310, file: !311, line: 112, baseType: !119, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !131, file: !35, line: 228, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "raw_pcb", file: !35, line: 210, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pending_err", scope: !126, file: !35, line: 231, baseType: !274, size: 8, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "op_completed", scope: !126, file: !35, line: 234, baseType: !339, size: 256, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sem_t", file: !340, line: 72, baseType: !341)
!340 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/sys_arch.h", directory: "/root/.unikraft/apps/redis/build")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 69, size: 256, elements: !342)
!342 = !{!343, !778}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !341, file: !340, line: 70, baseType: !344, size: 192)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !345, line: 51, size: 192, elements: !346)
!345 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !344, file: !345, line: 52, baseType: !348, size: 64)
!348 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !344, file: !345, line: 53, baseType: !350, size: 128, offset: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !351, line: 42, size: 128, elements: !352)
!351 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!352 = !{!353, !776}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !350, file: !351, line: 42, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !351, line: 35, size: 192, elements: !356)
!356 = !{!357, !358, !772}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !355, file: !351, line: 36, baseType: !15, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !355, file: !351, line: 37, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !361, line: 59, size: 1024, elements: !362)
!361 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!362 = !{!363, !367, !368, !369, !370, !376, !377, !382, !384, !385, !531, !532, !533, !742}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !360, file: !361, line: 60, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !360, file: !361, line: 61, baseType: !119, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !360, file: !361, line: 62, baseType: !119, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !360, file: !361, line: 63, baseType: !119, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !360, file: !361, line: 64, baseType: !371, size: 128, offset: 256)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !361, line: 64, size: 128, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !371, file: !361, line: 64, baseType: !359, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !371, file: !361, line: 64, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !360, file: !361, line: 65, baseType: !154, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !360, file: !361, line: 66, baseType: !378, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !379, line: 49, baseType: !380)
!379 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !381, line: 128, baseType: !348)
!381 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !360, file: !361, line: 67, baseType: !383, size: 8, offset: 512)
!383 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !360, file: !361, line: 68, baseType: !350, size: 128, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !360, file: !361, line: 69, baseType: !386, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !388, line: 90, size: 2176, elements: !389)
!388 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!389 = !{!390, !395, !413, !418, !420, !422, !427, !435, !440, !446, !447, !448, !453, !528, !529, !530}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !387, file: !388, line: 91, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !388, line: 68, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !386}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !387, file: !388, line: 93, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !388, line: 71, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!15, !386, !359, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !403, line: 62, baseType: !404)
!403 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !403, line: 55, size: 128, elements: !405)
!405 = !{!406, !407, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !404, file: !403, line: 57, baseType: !383, size: 8)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !404, file: !403, line: 59, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !403, line: 53, baseType: !15)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !404, file: !403, line: 61, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !379, line: 48, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !381, line: 129, baseType: !412)
!412 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !387, file: !388, line: 94, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !388, line: 74, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !386, !359}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !387, file: !388, line: 95, baseType: !419, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !388, line: 76, baseType: !415)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !387, file: !388, line: 96, baseType: !421, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !388, line: 78, baseType: !415)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !387, file: !388, line: 98, baseType: !423, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !388, line: 81, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!15, !386, !359, !408}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !387, file: !388, line: 99, baseType: !428, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !388, line: 83, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!15, !386, !432, !434}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !387, file: !388, line: 100, baseType: !436, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !388, line: 85, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!15, !386, !359, !15}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !387, file: !388, line: 101, baseType: !441, size: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !388, line: 87, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!15, !386, !432, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !387, file: !388, line: 104, baseType: !383, size: 8, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !387, file: !388, line: 105, baseType: !360, size: 1024, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !387, file: !388, line: 106, baseType: !449, size: 128, offset: 1664)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !361, line: 93, size: 128, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !449, file: !361, line: 93, baseType: !359, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !449, file: !361, line: 93, baseType: !375, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !387, file: !388, line: 107, baseType: !454, size: 192, offset: 1792)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !455, line: 59, size: 192, elements: !456)
!455 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!456 = !{!457, !519, !523}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !454, file: !455, line: 61, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !455, line: 51, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!119, !462, !412, !412}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !464, line: 77, size: 832, elements: !465)
!464 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!465 = !{!466, !473, !478, !483, !489, !491, !496, !497, !498, !503, !508, !513, !514, !515}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !463, file: !464, line: 79, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !464, line: 54, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!119, !462, !471}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !472, line: 58, baseType: !412)
!472 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!473 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !463, file: !464, line: 80, baseType: !474, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !464, line: 56, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!119, !462, !471, !471}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !463, file: !464, line: 81, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !464, line: 62, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!119, !462, !119, !471}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !463, file: !464, line: 82, baseType: !484, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !464, line: 58, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!15, !462, !488, !471, !471}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !463, file: !464, line: 83, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !464, line: 60, baseType: !475)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !463, file: !464, line: 84, baseType: !492, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !464, line: 64, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !462, !119}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !463, file: !464, line: 87, baseType: !492, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !463, file: !464, line: 88, baseType: !467, size: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !463, file: !464, line: 92, baseType: !499, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !464, line: 66, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!119, !462, !412}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !463, file: !464, line: 93, baseType: !504, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !464, line: 68, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !462, !119, !412}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !463, file: !464, line: 99, baseType: !509, size: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !464, line: 70, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!15, !462, !119, !471}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !463, file: !464, line: 100, baseType: !471, size: 64, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !464, line: 103, baseType: !462, size: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !463, file: !464, line: 104, baseType: !516, offset: 832)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: -1)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !454, file: !455, line: 63, baseType: !520, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !119}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !454, file: !455, line: 65, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !455, line: 56, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !119, !119}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !387, file: !388, line: 108, baseType: !462, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !388, line: 109, baseType: !386, size: 64, offset: 2048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !387, file: !388, line: 110, baseType: !119, size: 64, offset: 2112)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !360, file: !361, line: 70, baseType: !119, size: 64, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !360, file: !361, line: 72, baseType: !15, size: 32, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !360, file: !361, line: 82, baseType: !534, size: 64, offset: 896)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !536, line: 569, size: 14912, elements: !537)
!536 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!537 = !{!538, !539, !610, !611, !612, !613, !617, !618, !622, !623, !627, !639, !640, !641, !643, !644, !645, !706, !727, !728, !733, !740}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !535, file: !536, line: 571, baseType: !15, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !535, file: !536, line: 576, baseType: !540, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !536, line: 287, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !536, line: 181, size: 1408, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550, !555, !556, !557, !564, !568, !573, !577, !578, !579, !580, !584, !588, !589, !590, !592, !593, !597, !609}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !542, file: !536, line: 182, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !542, file: !536, line: 183, baseType: !15, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !542, file: !536, line: 184, baseType: !15, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !542, file: !536, line: 185, baseType: !213, size: 16, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !542, file: !536, line: 186, baseType: !213, size: 16, offset: 144)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !542, file: !536, line: 187, baseType: !551, size: 128, offset: 192)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !536, line: 117, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !551, file: !536, line: 118, baseType: !545, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !551, file: !536, line: 119, baseType: !15, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !542, file: !536, line: 188, baseType: !15, size: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !542, file: !536, line: 195, baseType: !119, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !542, file: !536, line: 197, baseType: !558, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!561, !534, !119, !563, !15}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !562, line: 145, baseType: !348)
!562 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !542, file: !536, line: 199, baseType: !565, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!561, !534, !119, !364, !15}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !542, file: !536, line: 202, baseType: !569, size: 64, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!572, !534, !119, !572, !15}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !562, line: 114, baseType: !348)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !542, file: !536, line: 203, baseType: !574, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!15, !534, !119}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !542, file: !536, line: 206, baseType: !551, size: 128, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !542, file: !536, line: 207, baseType: !545, size: 64, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !542, file: !536, line: 208, baseType: !15, size: 32, offset: 896)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !542, file: !536, line: 211, baseType: !581, size: 24, offset: 928)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 24, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 3)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !542, file: !536, line: 212, baseType: !585, size: 8, offset: 952)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 1)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !542, file: !536, line: 215, baseType: !551, size: 128, offset: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !542, file: !536, line: 218, baseType: !15, size: 32, offset: 1088)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !542, file: !536, line: 219, baseType: !591, size: 64, offset: 1152)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !562, line: 44, baseType: !348)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !542, file: !536, line: 222, baseType: !534, size: 64, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !542, file: !536, line: 226, baseType: !594, size: 32, offset: 1280)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !562, line: 175, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !596, line: 12, baseType: !15)
!596 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !542, file: !536, line: 228, baseType: !598, size: 64, offset: 1312)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !562, line: 171, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 163, size: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !599, file: !562, line: 165, baseType: !15, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !599, file: !562, line: 170, baseType: !603, size: 32, offset: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !599, file: !562, line: 166, size: 32, elements: !604)
!604 = !{!605, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !603, file: !562, line: 168, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !472, line: 124, baseType: !7)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !603, file: !562, line: 169, baseType: !608, size: 32)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 32, elements: !158)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !542, file: !536, line: 229, baseType: !15, size: 32, offset: 1376)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !535, file: !536, line: 576, baseType: !540, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !535, file: !536, line: 576, baseType: !540, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !535, file: !536, line: 578, baseType: !15, size: 32, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !535, file: !536, line: 579, baseType: !614, size: 200, offset: 288)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 200, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 25)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !535, file: !536, line: 582, baseType: !15, size: 32, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !535, file: !536, line: 583, baseType: !619, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !621, line: 9, flags: DIFlagFwdDecl)
!621 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !535, file: !536, line: 585, baseType: !15, size: 32, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !535, file: !536, line: 587, baseType: !624, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !534}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !535, file: !536, line: 590, baseType: !628, size: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !536, line: 47, size: 256, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !629, file: !536, line: 49, baseType: !628, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !629, file: !536, line: 50, baseType: !15, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !629, file: !536, line: 50, baseType: !15, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !629, file: !536, line: 50, baseType: !15, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !629, file: !536, line: 50, baseType: !15, size: 32, offset: 160)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !629, file: !536, line: 51, baseType: !637, size: 32, offset: 192)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 32, elements: !586)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !536, line: 25, baseType: !7)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !535, file: !536, line: 591, baseType: !15, size: 32, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !535, file: !536, line: 592, baseType: !628, size: 64, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !535, file: !536, line: 593, baseType: !642, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !535, file: !536, line: 596, baseType: !15, size: 32, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !535, file: !536, line: 597, baseType: !563, size: 64, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !535, file: !536, line: 632, baseType: !646, size: 2880, offset: 1152)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !536, line: 599, size: 2880, elements: !647)
!647 = !{!648, !697}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !646, file: !536, line: 622, baseType: !649, size: 1728)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !536, line: 601, size: 1728, elements: !650)
!650 = !{!651, !652, !653, !657, !669, !670, !672, !679, !680, !681, !682, !686, !690, !691, !692, !693, !694, !695, !696}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !649, file: !536, line: 603, baseType: !7, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !649, file: !536, line: 604, baseType: !563, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !649, file: !536, line: 605, baseType: !654, size: 208, offset: 128)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 208, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 26)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !649, file: !536, line: 606, baseType: !658, size: 288, offset: 352)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !536, line: 55, size: 288, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !658, file: !536, line: 57, baseType: !15, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !658, file: !536, line: 58, baseType: !15, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !658, file: !536, line: 59, baseType: !15, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !658, file: !536, line: 60, baseType: !15, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !658, file: !536, line: 61, baseType: !15, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !658, file: !536, line: 62, baseType: !15, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !658, file: !536, line: 63, baseType: !15, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !658, file: !536, line: 64, baseType: !15, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !658, file: !536, line: 65, baseType: !15, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !649, file: !536, line: 607, baseType: !15, size: 32, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !649, file: !536, line: 608, baseType: !671, size: 64, offset: 704)
!671 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !649, file: !536, line: 609, baseType: !673, size: 112, offset: 768)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !536, line: 319, size: 112, elements: !674)
!674 = !{!675, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !673, file: !536, line: 320, baseType: !676, size: 48)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 48, elements: !582)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !673, file: !536, line: 321, baseType: !676, size: 48, offset: 48)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !673, file: !536, line: 322, baseType: !196, size: 16, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !649, file: !536, line: 610, baseType: !598, size: 64, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !649, file: !536, line: 611, baseType: !598, size: 64, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !649, file: !536, line: 612, baseType: !598, size: 64, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !649, file: !536, line: 613, baseType: !683, size: 64, offset: 1088)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 64, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 8)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !649, file: !536, line: 614, baseType: !687, size: 192, offset: 1152)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 192, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 24)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !649, file: !536, line: 615, baseType: !15, size: 32, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !649, file: !536, line: 616, baseType: !598, size: 64, offset: 1376)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !649, file: !536, line: 617, baseType: !598, size: 64, offset: 1440)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !649, file: !536, line: 618, baseType: !598, size: 64, offset: 1504)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !649, file: !536, line: 619, baseType: !598, size: 64, offset: 1568)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !649, file: !536, line: 620, baseType: !598, size: 64, offset: 1632)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !649, file: !536, line: 621, baseType: !15, size: 32, offset: 1696)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !646, file: !536, line: 631, baseType: !698, size: 2880)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !536, line: 626, size: 2880, elements: !699)
!699 = !{!700, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !698, file: !536, line: 629, baseType: !701, size: 1920)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 1920, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 30)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !698, file: !536, line: 630, baseType: !705, size: 960, offset: 1920)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !702)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !535, file: !536, line: 636, baseType: !707, size: 64, offset: 4032)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !536, line: 93, size: 6336, elements: !709)
!709 = !{!710, !711, !712, !719}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !708, file: !536, line: 94, baseType: !707, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !708, file: !536, line: 95, baseType: !15, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !708, file: !536, line: 97, baseType: !713, size: 2048, offset: 128)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 2048, elements: !717)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null}
!717 = !{!718}
!718 = !DISubrange(count: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !708, file: !536, line: 98, baseType: !720, size: 4160, offset: 2176)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !536, line: 74, size: 4160, elements: !721)
!721 = !{!722, !724, !725, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !720, file: !536, line: 75, baseType: !723, size: 2048)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2048, elements: !717)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !720, file: !536, line: 76, baseType: !723, size: 2048, offset: 2048)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !720, file: !536, line: 78, baseType: !638, size: 32, offset: 4096)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !720, file: !536, line: 81, baseType: !638, size: 32, offset: 4128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !535, file: !536, line: 637, baseType: !708, size: 6336, offset: 4096)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !535, file: !536, line: 641, baseType: !729, size: 64, offset: 10432)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !15}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !535, file: !536, line: 646, baseType: !734, size: 192, offset: 10496)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !536, line: 291, size: 192, elements: !735)
!735 = !{!736, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !734, file: !536, line: 293, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !734, file: !536, line: 294, baseType: !15, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !734, file: !536, line: 295, baseType: !540, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !535, file: !536, line: 648, baseType: !741, size: 4224, offset: 10688)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 4224, elements: !582)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !360, file: !361, line: 85, baseType: !743, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !70, line: 114, size: 640, elements: !745)
!745 = !{!746, !750, !751, !758, !771}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !744, file: !70, line: 116, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !748, line: 64, baseType: !749)
!748 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !748, line: 63, baseType: !412)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !744, file: !70, line: 118, baseType: !747, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !744, file: !70, line: 120, baseType: !752, size: 128, offset: 128)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !753, line: 51, size: 128, elements: !754)
!753 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!754 = !{!755, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !753, line: 52, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !752, file: !753, line: 53, baseType: !756, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !744, file: !70, line: 122, baseType: !759, size: 256, offset: 256)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !70, line: 98, size: 256, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !759, file: !70, line: 107, baseType: !69, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !759, file: !70, line: 109, baseType: !747, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !759, file: !70, line: 111, baseType: !764, size: 96, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !748, line: 72, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 68, size: 96, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !765, file: !748, line: 69, baseType: !15, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !765, file: !748, line: 70, baseType: !15, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !765, file: !748, line: 71, baseType: !770, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !748, line: 61, baseType: !15)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !744, file: !70, line: 124, baseType: !752, size: 128, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !355, file: !351, line: 38, baseType: !773, size: 64, offset: 128)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !351, line: 38, size: 64, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !773, file: !351, line: 38, baseType: !354, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !350, file: !351, line: 42, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !341, file: !340, line: 71, baseType: !15, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "recvmbox", scope: !126, file: !35, line: 238, baseType: !780, size: 192, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_mbox_t", file: !340, line: 78, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 74, size: 192, elements: !782)
!782 = !{!783, !784, !788}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !781, file: !340, line: 75, baseType: !462, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mbox", scope: !781, file: !340, line: 76, baseType: !785, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_mbox", file: !787, line: 48, flags: DIFlagFwdDecl)
!787 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukmpi/include/uk/mbox.h", directory: "/root/.unikraft/apps/redis/build")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !781, file: !340, line: 77, baseType: !15, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "acceptmbox", scope: !126, file: !35, line: 242, baseType: !780, size: 192, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !126, file: !35, line: 251, baseType: !15, size: 32, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !35, line: 277, baseType: !161, size: 8, offset: 864)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "current_msg", scope: !126, file: !35, line: 282, baseType: !120, size: 64, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !126, file: !35, line: 285, baseType: !794, size: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "netconn_callback", file: !35, line: 215, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !125, !75, !193}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !121, file: !122, line: 84, baseType: !274, size: 8, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !121, file: !122, line: 151, baseType: !800, size: 384, offset: 128)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !122, line: 86, size: 384, elements: !801)
!801 = !{!802, !811, !815, !821, !829, !849, !853, !858}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !800, file: !122, line: 88, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netbuf", file: !805, line: 60, size: 384, elements: !806)
!805 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!806 = !{!807, !808, !809, !810}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !804, file: !805, line: 61, baseType: !242, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !804, file: !805, line: 61, baseType: !242, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !804, file: !805, line: 62, baseType: !139, size: 192, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !804, file: !805, line: 63, baseType: !193, size: 16, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !800, file: !122, line: 92, baseType: !812, size: 8)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 90, size: 8, elements: !813)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !812, file: !122, line: 91, baseType: !161, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !800, file: !122, line: 98, baseType: !816, size: 128)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 94, size: 128, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !816, file: !122, line: 95, baseType: !331, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !816, file: !122, line: 96, baseType: !193, size: 16, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !816, file: !122, line: 97, baseType: !161, size: 8, offset: 80)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !800, file: !122, line: 104, baseType: !822, size: 192)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 100, size: 192, elements: !823)
!823 = !{!824, !826, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !822, file: !122, line: 101, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !822, file: !122, line: 102, baseType: !827, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !822, file: !122, line: 103, baseType: !161, size: 8, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !800, file: !122, line: 121, baseType: !830, size: 384)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 106, size: 384, elements: !831)
!831 = !{!832, !844, !845, !846, !847, !848}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !830, file: !122, line: 108, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netvector", file: !35, line: 293, size: 128, elements: !836)
!836 = !{!837, !840}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !835, file: !35, line: 295, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !835, file: !35, line: 297, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !842, line: 40, baseType: !843)
!842 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !562, line: 129, baseType: !412)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "vector_cnt", scope: !830, file: !122, line: 110, baseType: !193, size: 16, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "vector_off", scope: !830, file: !122, line: 112, baseType: !841, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !830, file: !122, line: 114, baseType: !841, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !830, file: !122, line: 116, baseType: !841, size: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "apiflags", scope: !830, file: !122, line: 117, baseType: !161, size: 8, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !800, file: !122, line: 125, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 123, size: 64, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !850, file: !122, line: 124, baseType: !841, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !800, file: !122, line: 135, baseType: !854, size: 16)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 128, size: 16, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "shut", scope: !854, file: !122, line: 129, baseType: !161, size: 8)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "polls_left", scope: !854, file: !122, line: 133, baseType: !161, size: 8, offset: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "jl", scope: !800, file: !122, line: 144, baseType: !859, size: 192)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !122, line: 139, size: 192, elements: !860)
!860 = !{!861, !862, !863, !864}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "multiaddr", scope: !859, file: !122, line: 140, baseType: !331, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "netif_addr", scope: !859, file: !122, line: 141, baseType: !331, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !859, file: !122, line: 142, baseType: !161, size: 8, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "join_or_leave", scope: !859, file: !122, line: 143, baseType: !82, size: 32, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_api_msg", file: !122, line: 169, size: 320, elements: !867)
!867 = !{!868, !869, !870, !871, !873}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !122, line: 174, baseType: !364, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !866, file: !122, line: 177, baseType: !825, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dns_addrtype", scope: !866, file: !122, line: 180, baseType: !161, size: 8, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !866, file: !122, line: 184, baseType: !872, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !866, file: !122, line: 186, baseType: !874, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !472, line: 49, baseType: !348)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!878 = !{!0, !879, !881, !883, !902}
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "netconn_reset", scope: !2, file: !3, line: 110, type: !877, isLocal: false, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "netconn_closed", scope: !2, file: !3, line: 111, type: !877, isLocal: false, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "__str", scope: !885, file: !886, line: 198, type: !683, isLocal: true, isDefinition: true)
!885 = distinct !DISubprogram(name: "uk_pr_crit", scope: !886, file: !886, line: 194, type: !887, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !889)
!886 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!887 = !DISubroutineType(types: !888)
!888 = !{null, !364, null}
!889 = !{!890, !891}
!890 = !DILocalVariable(name: "fmt", arg: 1, scope: !885, file: !886, line: 194, type: !364)
!891 = !DILocalVariable(name: "argp", scope: !885, file: !886, line: 196, type: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !893, line: 32, baseType: !894)
!893 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 192, elements: !586)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !896, file: !3, line: 196, baseType: !7, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !896, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !896, file: !3, line: 196, baseType: !119, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !896, file: !3, line: 196, baseType: !119, size: 64, offset: 128)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "__str", scope: !885, file: !886, line: 198, type: !904, isLocal: true, isDefinition: true)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 80, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 10)
!907 = !{i32 2, !"Dwarf Version", i32 4}
!908 = !{i32 2, !"Debug Info Version", i32 3}
!909 = !{i32 1, !"wchar_size", i32 4}
!910 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!911 = distinct !DISubprogram(name: "lwip_netconn_is_err_msg", scope: !3, file: !3, line: 131, type: !912, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !914)
!912 = !DISubroutineType(types: !913)
!913 = !{!15, !119, !874}
!914 = !{!915, !916}
!915 = !DILocalVariable(name: "msg", arg: 1, scope: !911, file: !3, line: 131, type: !119)
!916 = !DILocalVariable(name: "err", arg: 2, scope: !911, file: !3, line: 131, type: !874)
!917 = !DILocation(line: 131, column: 31, scope: !911)
!918 = !DILocation(line: 131, column: 43, scope: !911)
!919 = !DILocation(line: 133, column: 3, scope: !920)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 133, column: 3)
!921 = distinct !DILexicalBlock(scope: !911, file: !3, line: 133, column: 3)
!922 = !DILocation(line: 133, column: 3, scope: !921)
!923 = !DILocation(line: 133, column: 3, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 133, column: 3)
!925 = distinct !DILexicalBlock(scope: !920, file: !3, line: 133, column: 3)
!926 = !DILocation(line: 133, column: 3, scope: !927)
!927 = distinct !DILexicalBlock(scope: !928, file: !3, line: 133, column: 3)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 133, column: 3)
!929 = distinct !DILexicalBlock(scope: !924, file: !3, line: 133, column: 3)
!930 = !DILocation(line: 135, column: 11, scope: !931)
!931 = distinct !DILexicalBlock(scope: !911, file: !3, line: 135, column: 7)
!932 = !DILocation(line: 135, column: 7, scope: !911)
!933 = !DILocation(line: 138, column: 18, scope: !934)
!934 = distinct !DILexicalBlock(scope: !931, file: !3, line: 138, column: 14)
!935 = !DILocation(line: 138, column: 14, scope: !931)
!936 = !DILocation(line: 141, column: 18, scope: !937)
!937 = distinct !DILexicalBlock(scope: !934, file: !3, line: 141, column: 14)
!938 = !DILocation(line: 141, column: 14, scope: !934)
!939 = !DILocation(line: 0, scope: !940)
!940 = distinct !DILexicalBlock(scope: !931, file: !3, line: 135, column: 32)
!941 = !{!942, !942, i64 0}
!942 = !{!"omnipotent char", !943, i64 0}
!943 = !{!"Simple C/C++ TBAA"}
!944 = !DILocation(line: 146, column: 1, scope: !911)
!945 = !DILocation(line: 0, scope: !911)
!946 = !DILocation(line: 194, column: 43, scope: !885)
!947 = !DILocation(line: 196, column: 2, scope: !885)
!948 = !DILocation(line: 196, column: 10, scope: !885)
!949 = !DILocation(line: 197, column: 2, scope: !885)
!950 = !DILocation(line: 198, column: 2, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !886, line: 198, column: 2)
!952 = distinct !DILexicalBlock(scope: !885, file: !886, line: 198, column: 2)
!953 = !DILocation(line: 199, column: 2, scope: !885)
!954 = !DILocation(line: 200, column: 1, scope: !885)
!955 = distinct !DISubprogram(name: "lwip_netconn_do_newconn", scope: !3, file: !3, line: 680, type: !521, isLocal: false, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !956)
!956 = !{!957, !958}
!957 = !DILocalVariable(name: "m", arg: 1, scope: !955, file: !3, line: 680, type: !119)
!958 = !DILocalVariable(name: "msg", scope: !955, file: !3, line: 682, type: !120)
!959 = !DILocation(line: 680, column: 31, scope: !955)
!960 = !DILocation(line: 684, column: 8, scope: !955)
!961 = !DILocation(line: 684, column: 12, scope: !955)
!962 = !{!963, !942, i64 8}
!963 = !{!"api_msg", !964, i64 0, !942, i64 8, !942, i64 16}
!964 = !{!"any pointer", !942, i64 0}
!965 = !DILocation(line: 685, column: 12, scope: !966)
!966 = distinct !DILexicalBlock(scope: !955, file: !3, line: 685, column: 7)
!967 = !{!963, !964, i64 0}
!968 = !DILocation(line: 685, column: 18, scope: !966)
!969 = !DILocation(line: 685, column: 22, scope: !966)
!970 = !DILocation(line: 685, column: 26, scope: !966)
!971 = !DILocation(line: 685, column: 7, scope: !955)
!972 = !DILocation(line: 682, column: 19, scope: !955)
!973 = !DILocalVariable(name: "msg", arg: 1, scope: !974, file: !3, line: 609, type: !120)
!974 = distinct !DISubprogram(name: "pcb_new", scope: !3, file: !3, line: 609, type: !975, isLocal: true, isDefinition: true, scopeLine: 610, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !120}
!977 = !{!973, !978}
!978 = !DILocalVariable(name: "iptype", scope: !974, file: !3, line: 611, type: !91)
!979 = !DILocation(line: 609, column: 25, scope: !974, inlinedAt: !980)
!980 = distinct !DILocation(line: 686, column: 5, scope: !981)
!981 = distinct !DILexicalBlock(scope: !966, file: !3, line: 685, column: 35)
!982 = !DILocation(line: 611, column: 26, scope: !974, inlinedAt: !980)
!983 = !DILocation(line: 617, column: 7, scope: !984, inlinedAt: !980)
!984 = distinct !DILexicalBlock(scope: !974, file: !3, line: 617, column: 7)
!985 = !{!986, !942, i64 0}
!986 = !{!"netconn", !942, i64 0, !942, i64 4, !942, i64 8, !942, i64 16, !987, i64 24, !992, i64 56, !992, i64 80, !991, i64 104, !942, i64 108, !964, i64 112, !964, i64 120}
!987 = !{!"", !988, i64 0, !991, i64 24}
!988 = !{!"uk_semaphore", !989, i64 0, !990, i64 8}
!989 = !{!"long", !942, i64 0}
!990 = !{!"uk_waitq", !964, i64 0, !964, i64 8}
!991 = !{!"int", !942, i64 0}
!992 = !{!"", !964, i64 0, !964, i64 8, !991, i64 16}
!993 = !DILocation(line: 617, column: 7, scope: !974, inlinedAt: !980)
!994 = !DILocation(line: 623, column: 3, scope: !974, inlinedAt: !980)
!995 = !DILocation(line: 641, column: 28, scope: !996, inlinedAt: !980)
!996 = distinct !DILexicalBlock(scope: !974, file: !3, line: 623, column: 47)
!997 = !DILocation(line: 641, column: 12, scope: !996, inlinedAt: !980)
!998 = !DILocation(line: 641, column: 18, scope: !996, inlinedAt: !980)
!999 = !DILocation(line: 641, column: 22, scope: !996, inlinedAt: !980)
!1000 = !DILocation(line: 641, column: 26, scope: !996, inlinedAt: !980)
!1001 = !DILocation(line: 642, column: 16, scope: !1002, inlinedAt: !980)
!1002 = distinct !DILexicalBlock(scope: !996, file: !3, line: 642, column: 11)
!1003 = !DILocation(line: 642, column: 22, scope: !1002, inlinedAt: !980)
!1004 = !DILocation(line: 642, column: 26, scope: !1002, inlinedAt: !980)
!1005 = !DILocation(line: 642, column: 30, scope: !1002, inlinedAt: !980)
!1006 = !DILocation(line: 642, column: 11, scope: !996, inlinedAt: !980)
!1007 = !DILocation(line: 648, column: 13, scope: !1008, inlinedAt: !980)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 648, column: 13)
!1009 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 642, column: 39)
!1010 = !DILocation(line: 648, column: 13, scope: !1009, inlinedAt: !980)
!1011 = !DILocation(line: 649, column: 11, scope: !1012, inlinedAt: !980)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 648, column: 57)
!1013 = !{!1014, !942, i64 64}
!1014 = !{!"udp_pcb", !1015, i64 0, !1015, i64 24, !942, i64 48, !942, i64 49, !942, i64 50, !942, i64 51, !964, i64 56, !942, i64 64, !1016, i64 66, !1016, i64 68, !1017, i64 72, !942, i64 76, !942, i64 77, !964, i64 80, !964, i64 88}
!1015 = !{!"ip_addr", !942, i64 0, !942, i64 20}
!1016 = !{!"short", !942, i64 0}
!1017 = !{!"ip4_addr", !991, i64 0}
!1018 = !DILocation(line: 651, column: 33, scope: !1009, inlinedAt: !980)
!1019 = !DILocation(line: 650, column: 9, scope: !1012, inlinedAt: !980)
!1020 = !DILocation(line: 651, column: 48, scope: !1009, inlinedAt: !980)
!1021 = !DILocation(line: 651, column: 9, scope: !1009, inlinedAt: !980)
!1022 = !DILocation(line: 652, column: 7, scope: !1009, inlinedAt: !980)
!1023 = !DILocation(line: 657, column: 28, scope: !996, inlinedAt: !980)
!1024 = !DILocation(line: 657, column: 12, scope: !996, inlinedAt: !980)
!1025 = !DILocation(line: 657, column: 18, scope: !996, inlinedAt: !980)
!1026 = !DILocation(line: 657, column: 22, scope: !996, inlinedAt: !980)
!1027 = !DILocation(line: 657, column: 26, scope: !996, inlinedAt: !980)
!1028 = !DILocation(line: 658, column: 16, scope: !1029, inlinedAt: !980)
!1029 = distinct !DILexicalBlock(scope: !996, file: !3, line: 658, column: 11)
!1030 = !DILocation(line: 658, column: 22, scope: !1029, inlinedAt: !980)
!1031 = !DILocation(line: 658, column: 26, scope: !1029, inlinedAt: !980)
!1032 = !DILocation(line: 658, column: 30, scope: !1029, inlinedAt: !980)
!1033 = !DILocation(line: 658, column: 11, scope: !996, inlinedAt: !980)
!1034 = !DILocalVariable(name: "conn", arg: 1, scope: !1035, file: !3, line: 514, type: !125)
!1035 = distinct !DISubprogram(name: "setup_tcp", scope: !3, file: !3, line: 514, type: !1036, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1038)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !125}
!1038 = !{!1034, !1039}
!1039 = !DILocalVariable(name: "pcb", scope: !1035, file: !3, line: 516, type: !178)
!1040 = !DILocation(line: 514, column: 27, scope: !1035, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 659, column: 9, scope: !1042, inlinedAt: !980)
!1042 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 658, column: 39)
!1043 = !DILocation(line: 516, column: 19, scope: !1035, inlinedAt: !1041)
!1044 = !DILocation(line: 519, column: 16, scope: !1035, inlinedAt: !1041)
!1045 = !DILocation(line: 519, column: 3, scope: !1035, inlinedAt: !1041)
!1046 = !DILocation(line: 520, column: 3, scope: !1035, inlinedAt: !1041)
!1047 = !DILocation(line: 521, column: 3, scope: !1035, inlinedAt: !1041)
!1048 = !DILocation(line: 522, column: 3, scope: !1035, inlinedAt: !1041)
!1049 = !DILocation(line: 523, column: 3, scope: !1035, inlinedAt: !1041)
!1050 = !DILocation(line: 660, column: 7, scope: !1042, inlinedAt: !980)
!1051 = !DILocation(line: 665, column: 16, scope: !996, inlinedAt: !980)
!1052 = !DILocation(line: 666, column: 7, scope: !996, inlinedAt: !980)
!1053 = !DILocation(line: 668, column: 12, scope: !1054, inlinedAt: !980)
!1054 = distinct !DILexicalBlock(scope: !974, file: !3, line: 668, column: 7)
!1055 = !DILocation(line: 668, column: 22, scope: !1054, inlinedAt: !980)
!1056 = !DILocation(line: 668, column: 25, scope: !1054, inlinedAt: !980)
!1057 = !DILocation(line: 668, column: 7, scope: !974, inlinedAt: !980)
!1058 = !DILocation(line: 669, column: 14, scope: !1059, inlinedAt: !980)
!1059 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 668, column: 34)
!1060 = !DILocation(line: 670, column: 3, scope: !1059, inlinedAt: !980)
!1061 = !DILocation(line: 693, column: 1, scope: !955)
!1062 = distinct !DISubprogram(name: "netconn_alloc", scope: !3, file: !3, line: 707, type: !1063, isLocal: false, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1065)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!125, !34, !794}
!1065 = !{!1066, !1067, !1068, !1069, !1070}
!1066 = !DILocalVariable(name: "t", arg: 1, scope: !1062, file: !3, line: 707, type: !34)
!1067 = !DILocalVariable(name: "callback", arg: 2, scope: !1062, file: !3, line: 707, type: !794)
!1068 = !DILocalVariable(name: "conn", scope: !1062, file: !3, line: 709, type: !125)
!1069 = !DILocalVariable(name: "size", scope: !1062, file: !3, line: 710, type: !15)
!1070 = !DILocalVariable(name: "init_flags", scope: !1062, file: !3, line: 711, type: !161)
!1071 = !DILocation(line: 707, column: 33, scope: !1062)
!1072 = !DILocation(line: 707, column: 53, scope: !1062)
!1073 = !DILocation(line: 711, column: 8, scope: !1062)
!1074 = !DILocation(line: 714, column: 39, scope: !1062)
!1075 = !{!964, !964, i64 0}
!1076 = !DILocalVariable(name: "a", arg: 1, scope: !1077, file: !464, line: 173, type: !462)
!1077 = distinct !DISubprogram(name: "uk_calloc", scope: !464, file: !464, line: 173, type: !476, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1078)
!1078 = !{!1076, !1079, !1080}
!1079 = !DILocalVariable(name: "nmemb", arg: 2, scope: !1077, file: !464, line: 174, type: !471)
