; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/atol.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/atol.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

; Function Attrs: noredzone nounwind
define dso_local i64 @atol(i8*) local_unnamed_addr #0 !dbg !7 {
  %2 = tail call i64 @strtol(i8* %0, i8** null, i32 10) #3, !dbg !17
  ret i64 %2, !dbg !18
}

; Function Attrs: noredzone
declare dso_local i64 @strtol(i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: noredzone nounwind
define dso_local i64 @_atol_r(%struct._reent*, i8*) local_unnamed_addr #0 !dbg !19 {
  %3 = tail call i64 @_strtol_r(%struct._reent* %0, i8* %1, i8** null, i32 10) #3, !dbg !242
  ret i64 %3, !dbg !243
}

; Function Attrs: noredzone
declare dso_local i64 @_strtol_r(%struct._reent*, i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: nounwind readnone speculatable

attributes #0 = { noredzone nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { noredzone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #2 = { nounwind readnone speculatable }
attributes #3 = { nobuiltin noredzone nounwind }

!llvm.module.flags = !{!3, !4, !5}
!llvm.ident = !{!6}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/atol.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!7 = distinct !DISubprogram(name: "atol", scope: !1, file: !1, line: 10, type: !8, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !14)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !{!15}
!15 = !DILocalVariable(name: "s", arg: 1, scope: !7, file: !1, line: 10, type: !11)
!16 = !DILocation(line: 10, column: 1, scope: !7)
!17 = !DILocation(line: 12, column: 10, scope: !7)
!18 = !DILocation(line: 12, column: 3, scope: !7)
!19 = distinct !DISubprogram(name: "_atol_r", scope: !1, file: !1, line: 17, type: !20, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !238)
!20 = !DISubroutineType(types: !21)
!21 = !{!10, !22, !11}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !24, line: 569, size: 14912, elements: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !{!26, !28, !106, !107, !108, !109, !113, !114, !117, !118, !122, !134, !135, !136, !138, !139, !140, !202, !223, !224, !229, !236}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !23, file: !24, line: 571, baseType: !27, size: 32)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !23, file: !24, line: 576, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !24, line: 287, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !24, line: 181, size: 1408, elements: !32)
!32 = !{!33, !36, !37, !38, !40, !41, !46, !47, !49, !56, !60, !65, !69, !70, !71, !72, !76, !80, !81, !82, !84, !85, !89, !105}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !31, file: !24, line: 182, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !31, file: !24, line: 183, baseType: !27, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !31, file: !24, line: 184, baseType: !27, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !31, file: !24, line: 185, baseType: !39, size: 16, offset: 128)
!39 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !31, file: !24, line: 186, baseType: !39, size: 16, offset: 144)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !31, file: !24, line: 187, baseType: !42, size: 128, offset: 192)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !24, line: 117, size: 128, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !42, file: !24, line: 118, baseType: !34, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !42, file: !24, line: 119, baseType: !27, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !31, file: !24, line: 188, baseType: !27, size: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !31, file: !24, line: 195, baseType: !48, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !31, file: !24, line: 197, baseType: !50, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !22, !48, !55, !27}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !54, line: 145, baseType: !10)
!54 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !31, file: !24, line: 199, baseType: !57, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!53, !22, !48, !11, !27}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !31, file: !24, line: 202, baseType: !61, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !22, !48, !64, !27}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !54, line: 114, baseType: !10)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !31, file: !24, line: 203, baseType: !66, size: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!27, !22, !48}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !31, file: !24, line: 206, baseType: !42, size: 128, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !31, file: !24, line: 207, baseType: !34, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !31, file: !24, line: 208, baseType: !27, size: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !31, file: !24, line: 211, baseType: !73, size: 24, offset: 928)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 24, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !31, file: !24, line: 212, baseType: !77, size: 8, offset: 952)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !31, file: !24, line: 215, baseType: !42, size: 128, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !31, file: !24, line: 218, baseType: !27, size: 32, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !31, file: !24, line: 219, baseType: !83, size: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !54, line: 44, baseType: !10)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !31, file: !24, line: 222, baseType: !22, size: 64, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !31, file: !24, line: 226, baseType: !86, size: 32, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !54, line: 175, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !88, line: 12, baseType: !27)
!88 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !31, file: !24, line: 228, baseType: !90, size: 64, offset: 1312)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !54, line: 171, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 163, size: 64, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !91, file: !54, line: 165, baseType: !27, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !91, file: !54, line: 170, baseType: !95, size: 32, offset: 32)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !91, file: !54, line: 166, size: 32, elements: !96)
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !95, file: !54, line: 168, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !99, line: 124, baseType: !100)
!99 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !95, file: !54, line: 169, baseType: !102, size: 32)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 4)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !31, file: !24, line: 229, baseType: !27, size: 32, offset: 1376)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !23, file: !24, line: 576, baseType: !29, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !23, file: !24, line: 576, baseType: !29, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !23, file: !24, line: 578, baseType: !27, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !23, file: !24, line: 579, baseType: !110, size: 200, offset: 288)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 200, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 25)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !23, file: !24, line: 582, baseType: !27, size: 32, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !23, file: !24, line: 583, baseType: !115, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !24, line: 40, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !23, file: !24, line: 585, baseType: !27, size: 32, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !23, file: !24, line: 587, baseType: !119, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !22}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !23, file: !24, line: 590, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !24, line: 47, size: 256, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !124, file: !24, line: 49, baseType: !123, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !124, file: !24, line: 50, baseType: !27, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !124, file: !24, line: 50, baseType: !27, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !124, file: !24, line: 50, baseType: !27, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !124, file: !24, line: 50, baseType: !27, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !124, file: !24, line: 51, baseType: !132, size: 32, offset: 192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 32, elements: !78)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !24, line: 25, baseType: !100)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !23, file: !24, line: 591, baseType: !27, size: 32, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !23, file: !24, line: 592, baseType: !123, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !23, file: !24, line: 593, baseType: !137, size: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !23, file: !24, line: 596, baseType: !27, size: 32, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !23, file: !24, line: 597, baseType: !55, size: 64, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !23, file: !24, line: 632, baseType: !141, size: 2880, offset: 1152)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !23, file: !24, line: 599, size: 2880, elements: !142)
!142 = !{!143, !193}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !141, file: !24, line: 622, baseType: !144, size: 1728)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !24, line: 601, size: 1728, elements: !145)
!145 = !{!146, !147, !148, !152, !164, !165, !167, !175, !176, !177, !178, !182, !186, !187, !188, !189, !190, !191, !192}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !144, file: !24, line: 603, baseType: !100, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !144, file: !24, line: 604, baseType: !55, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !144, file: !24, line: 605, baseType: !149, size: 208, offset: 128)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 208, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 26)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !144, file: !24, line: 606, baseType: !153, size: 288, offset: 352)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !24, line: 55, size: 288, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !153, file: !24, line: 57, baseType: !27, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !153, file: !24, line: 58, baseType: !27, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !153, file: !24, line: 59, baseType: !27, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !153, file: !24, line: 60, baseType: !27, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !153, file: !24, line: 61, baseType: !27, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !153, file: !24, line: 62, baseType: !27, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !153, file: !24, line: 63, baseType: !27, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !153, file: !24, line: 64, baseType: !27, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !153, file: !24, line: 65, baseType: !27, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !144, file: !24, line: 607, baseType: !27, size: 32, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !144, file: !24, line: 608, baseType: !166, size: 64, offset: 704)
!166 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !144, file: !24, line: 609, baseType: !168, size: 112, offset: 768)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !24, line: 319, size: 112, elements: !169)
!169 = !{!170, !173, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !168, file: !24, line: 320, baseType: !171, size: 48)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 48, elements: !74)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !168, file: !24, line: 321, baseType: !171, size: 48, offset: 48)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !168, file: !24, line: 322, baseType: !172, size: 16, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !144, file: !24, line: 610, baseType: !90, size: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !144, file: !24, line: 611, baseType: !90, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !144, file: !24, line: 612, baseType: !90, size: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !144, file: !24, line: 613, baseType: !179, size: 64, offset: 1088)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !144, file: !24, line: 614, baseType: !183, size: 192, offset: 1152)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 24)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !144, file: !24, line: 615, baseType: !27, size: 32, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !144, file: !24, line: 616, baseType: !90, size: 64, offset: 1376)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !144, file: !24, line: 617, baseType: !90, size: 64, offset: 1440)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !144, file: !24, line: 618, baseType: !90, size: 64, offset: 1504)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !144, file: !24, line: 619, baseType: !90, size: 64, offset: 1568)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !144, file: !24, line: 620, baseType: !90, size: 64, offset: 1632)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !144, file: !24, line: 621, baseType: !27, size: 32, offset: 1696)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !141, file: !24, line: 631, baseType: !194, size: 2880)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !24, line: 626, size: 2880, elements: !195)
!195 = !{!196, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !194, file: !24, line: 629, baseType: !197, size: 1920)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1920, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 30)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !194, file: !24, line: 630, baseType: !201, size: 960, offset: 1920)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 960, elements: !198)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !23, file: !24, line: 636, baseType: !203, size: 64, offset: 4032)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !24, line: 93, size: 6336, elements: !205)
!205 = !{!206, !207, !208, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !204, file: !24, line: 94, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !204, file: !24, line: 95, baseType: !27, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !204, file: !24, line: 97, baseType: !209, size: 2048, offset: 128)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 2048, elements: !213)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null}
!213 = !{!214}
!214 = !DISubrange(count: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !204, file: !24, line: 98, baseType: !216, size: 4160, offset: 2176)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !24, line: 74, size: 4160, elements: !217)
!217 = !{!218, !220, !221, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !216, file: !24, line: 75, baseType: !219, size: 2048)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !213)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !216, file: !24, line: 76, baseType: !219, size: 2048, offset: 2048)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !216, file: !24, line: 78, baseType: !133, size: 32, offset: 4096)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !216, file: !24, line: 81, baseType: !133, size: 32, offset: 4128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !23, file: !24, line: 637, baseType: !204, size: 6336, offset: 4096)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !23, file: !24, line: 641, baseType: !225, size: 64, offset: 10432)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !27}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !23, file: !24, line: 646, baseType: !230, size: 192, offset: 10496)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !24, line: 291, size: 192, elements: !231)
!231 = !{!232, !234, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !230, file: !24, line: 293, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !230, file: !24, line: 294, baseType: !27, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !230, file: !24, line: 295, baseType: !29, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !23, file: !24, line: 648, baseType: !237, size: 4224, offset: 10688)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 4224, elements: !74)
!238 = !{!239, !240}
!239 = !DILocalVariable(name: "ptr", arg: 1, scope: !19, file: !1, line: 17, type: !22)
!240 = !DILocalVariable(name: "s", arg: 2, scope: !19, file: !1, line: 17, type: !11)
!241 = !DILocation(line: 17, column: 1, scope: !19)
!242 = !DILocation(line: 19, column: 10, scope: !19)
!243 = !DILocation(line: 19, column: 3, scope: !19)
