; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bitops.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bitops.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bitsinbyte", scope: !2, file: !3, line: 44, type: !84, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "redisPopcount", scope: !3, file: !3, line: 40, type: !4, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !70)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/bitops.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !9, line: 129, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !15, globals: !69)
!14 = !{}
!15 = !{!10, !16, !22, !24, !25, !27, !29, !6, !11, !12, !30, !33, !45, !55, !62}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 48, baseType: !19)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 79, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 60, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !20, line: 105, baseType: !10)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !18, line: 56, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !20, line: 103, baseType: !12)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 43, baseType: !23)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !35, line: 51, size: 24, elements: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !35, line: 52, baseType: !31, size: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !34, file: !35, line: 53, baseType: !31, size: 8, offset: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !35, line: 54, baseType: !23, size: 8, offset: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !34, file: !35, line: 55, baseType: !41, offset: 24)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, elements: !43)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !{!44}
!44 = !DISubrange(count: -1)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !35, line: 57, size: 40, elements: !47)
!47 = !{!48, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !35, line: 58, baseType: !49, size: 16)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 36, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 57, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !35, line: 59, baseType: !49, size: 16, offset: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !35, line: 60, baseType: !23, size: 8, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !35, line: 61, baseType: !41, offset: 40)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !35, line: 63, size: 72, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !35, line: 64, baseType: !17, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !56, file: !35, line: 65, baseType: !17, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !35, line: 66, baseType: !23, size: 8, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !35, line: 67, baseType: !41, offset: 72)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !35, line: 69, size: 136, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !35, line: 70, baseType: !25, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !63, file: !35, line: 71, baseType: !25, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !35, line: 72, baseType: !23, size: 8, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !63, file: !35, line: 73, baseType: !41, offset: 136)
!69 = !{!0}
!70 = !{!71, !72, !73, !74, !75, !76, !78, !79, !80, !81, !82, !83}
!71 = !DILocalVariable(name: "s", arg: 1, scope: !2, file: !3, line: 40, type: !11)
!72 = !DILocalVariable(name: "count", arg: 2, scope: !2, file: !3, line: 40, type: !12)
!73 = !DILocalVariable(name: "bits", scope: !2, file: !3, line: 41, type: !6)
!74 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 42, type: !22)
!75 = !DILocalVariable(name: "p4", scope: !2, file: !3, line: 43, type: !16)
!76 = !DILocalVariable(name: "aux1", scope: !77, file: !3, line: 55, type: !17)
!77 = distinct !DILexicalBlock(scope: !2, file: !3, line: 54, column: 22)
!78 = !DILocalVariable(name: "aux2", scope: !77, file: !3, line: 55, type: !17)
!79 = !DILocalVariable(name: "aux3", scope: !77, file: !3, line: 55, type: !17)
!80 = !DILocalVariable(name: "aux4", scope: !77, file: !3, line: 55, type: !17)
!81 = !DILocalVariable(name: "aux5", scope: !77, file: !3, line: 55, type: !17)
!82 = !DILocalVariable(name: "aux6", scope: !77, file: !3, line: 55, type: !17)
!83 = !DILocalVariable(name: "aux7", scope: !77, file: !3, line: 55, type: !17)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!86 = !{!87}
!87 = !DISubrange(count: 256)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!92 = !DILocation(line: 40, column: 28, scope: !2)
!93 = !DILocation(line: 40, column: 36, scope: !2)
!94 = !DILocation(line: 41, column: 12, scope: !2)
!95 = !DILocation(line: 42, column: 20, scope: !2)
!96 = !DILocation(line: 47, column: 11, scope: !2)
!97 = !DILocation(line: 47, column: 28, scope: !2)
!98 = !DILocation(line: 47, column: 32, scope: !2)
!99 = !DILocation(line: 47, column: 5, scope: !2)
!100 = !DILocation(line: 48, column: 30, scope: !101)
!101 = distinct !DILexicalBlock(scope: !2, file: !3, line: 47, column: 42)
!102 = !DILocation(line: 48, column: 28, scope: !101)
!103 = !{!104, !104, i64 0}
!104 = !{!"omnipotent char", !105, i64 0}
!105 = !{!"Simple C/C++ TBAA"}
!106 = !DILocation(line: 48, column: 17, scope: !101)
!107 = !DILocation(line: 48, column: 14, scope: !101)
!108 = !DILocation(line: 49, column: 14, scope: !101)
!109 = distinct !{!109, !99, !110}
!110 = !DILocation(line: 50, column: 5, scope: !2)
!111 = !DILocation(line: 0, scope: !101)
!112 = !DILocation(line: 53, column: 10, scope: !2)
!113 = !DILocation(line: 43, column: 15, scope: !2)
!114 = !DILocation(line: 54, column: 16, scope: !2)
!115 = !DILocation(line: 54, column: 5, scope: !2)
!116 = !DILocation(line: 57, column: 19, scope: !77)
!117 = !DILocation(line: 57, column: 16, scope: !77)
!118 = !{!119, !119, i64 0}
!119 = !{!"int", !104, i64 0}
!120 = !DILocation(line: 66, column: 30, scope: !77)
!121 = !DILocation(line: 66, column: 36, scope: !77)
!122 = !DILocation(line: 66, column: 21, scope: !77)
!123 = !DILocation(line: 67, column: 22, scope: !77)
!124 = !DILocation(line: 67, column: 45, scope: !77)
!125 = !DILocation(line: 67, column: 51, scope: !77)
!126 = !DILocation(line: 67, column: 36, scope: !77)
!127 = !DILocation(line: 68, column: 30, scope: !77)
!128 = !DILocation(line: 68, column: 36, scope: !77)
!129 = !DILocation(line: 68, column: 21, scope: !77)
!130 = !DILocation(line: 69, column: 22, scope: !77)
!131 = !DILocation(line: 69, column: 45, scope: !77)
!132 = !DILocation(line: 69, column: 51, scope: !77)
!133 = !DILocation(line: 69, column: 36, scope: !77)
!134 = !DILocation(line: 70, column: 30, scope: !77)
!135 = !DILocation(line: 70, column: 36, scope: !77)
!136 = !DILocation(line: 70, column: 21, scope: !77)
!137 = !DILocation(line: 71, column: 22, scope: !77)
!138 = !DILocation(line: 71, column: 45, scope: !77)
!139 = !DILocation(line: 71, column: 51, scope: !77)
!140 = !DILocation(line: 71, column: 36, scope: !77)
!141 = !DILocation(line: 72, column: 30, scope: !77)
!142 = !DILocation(line: 72, column: 36, scope: !77)
!143 = !DILocation(line: 72, column: 21, scope: !77)
!144 = !DILocation(line: 73, column: 22, scope: !77)
!145 = !DILocation(line: 73, column: 45, scope: !77)
!146 = !DILocation(line: 73, column: 51, scope: !77)
!147 = !DILocation(line: 73, column: 36, scope: !77)
!148 = !DILocation(line: 74, column: 30, scope: !77)
!149 = !DILocation(line: 74, column: 36, scope: !77)
!150 = !DILocation(line: 74, column: 21, scope: !77)
!151 = !DILocation(line: 75, column: 22, scope: !77)
!152 = !DILocation(line: 75, column: 45, scope: !77)
!153 = !DILocation(line: 75, column: 51, scope: !77)
!154 = !DILocation(line: 75, column: 36, scope: !77)
!155 = !DILocation(line: 76, column: 30, scope: !77)
!156 = !DILocation(line: 76, column: 36, scope: !77)
!157 = !DILocation(line: 76, column: 21, scope: !77)
!158 = !DILocation(line: 77, column: 22, scope: !77)
!159 = !DILocation(line: 77, column: 45, scope: !77)
!160 = !DILocation(line: 77, column: 51, scope: !77)
!161 = !DILocation(line: 77, column: 36, scope: !77)
!162 = !DILocation(line: 78, column: 30, scope: !77)
!163 = !DILocation(line: 78, column: 36, scope: !77)
!164 = !DILocation(line: 78, column: 21, scope: !77)
!165 = !DILocation(line: 79, column: 22, scope: !77)
!166 = !DILocation(line: 79, column: 45, scope: !77)
!167 = !DILocation(line: 79, column: 51, scope: !77)
!168 = !DILocation(line: 79, column: 36, scope: !77)
!169 = !DILocation(line: 80, column: 34, scope: !77)
!170 = !DILocation(line: 80, column: 26, scope: !77)
!171 = !DILocation(line: 80, column: 41, scope: !77)
!172 = !DILocation(line: 81, column: 36, scope: !77)
!173 = !DILocation(line: 81, column: 28, scope: !77)
!174 = !DILocation(line: 81, column: 43, scope: !77)
!175 = !DILocation(line: 80, column: 55, scope: !77)
!176 = !DILocation(line: 82, column: 36, scope: !77)
!177 = !DILocation(line: 82, column: 28, scope: !77)
!178 = !DILocation(line: 82, column: 43, scope: !77)
!179 = !DILocation(line: 81, column: 57, scope: !77)
!180 = !DILocation(line: 83, column: 36, scope: !77)
!181 = !DILocation(line: 83, column: 28, scope: !77)
!182 = !DILocation(line: 83, column: 43, scope: !77)
!183 = !DILocation(line: 82, column: 57, scope: !77)
!184 = !DILocation(line: 84, column: 36, scope: !77)
!185 = !DILocation(line: 84, column: 28, scope: !77)
!186 = !DILocation(line: 84, column: 43, scope: !77)
!187 = !DILocation(line: 83, column: 57, scope: !77)
!188 = !DILocation(line: 85, column: 36, scope: !77)
!189 = !DILocation(line: 85, column: 28, scope: !77)
!190 = !DILocation(line: 85, column: 43, scope: !77)
!191 = !DILocation(line: 84, column: 57, scope: !77)
!192 = !DILocation(line: 86, column: 36, scope: !77)
!193 = !DILocation(line: 86, column: 28, scope: !77)
!194 = !DILocation(line: 86, column: 43, scope: !77)
!195 = !DILocation(line: 85, column: 57, scope: !77)
!196 = !DILocation(line: 86, column: 57, scope: !77)
!197 = !DILocation(line: 86, column: 71, scope: !77)
!198 = !DILocation(line: 80, column: 17, scope: !77)
!199 = !DILocation(line: 80, column: 14, scope: !77)
!200 = distinct !{!200, !115, !201, !202}
!201 = !DILocation(line: 87, column: 5, scope: !2)
!202 = !{!"llvm.loop.isvectorized", i32 1}
!203 = !DILocation(line: 55, column: 18, scope: !77)
!204 = !DILocation(line: 58, column: 19, scope: !77)
!205 = !DILocation(line: 58, column: 16, scope: !77)
!206 = !DILocation(line: 55, column: 24, scope: !77)
!207 = !DILocation(line: 59, column: 19, scope: !77)
!208 = !DILocation(line: 59, column: 16, scope: !77)
!209 = !DILocation(line: 55, column: 30, scope: !77)
!210 = !DILocation(line: 60, column: 19, scope: !77)
!211 = !DILocation(line: 60, column: 16, scope: !77)
!212 = !DILocation(line: 55, column: 36, scope: !77)
!213 = !DILocation(line: 61, column: 19, scope: !77)
!214 = !DILocation(line: 61, column: 16, scope: !77)
!215 = !DILocation(line: 55, column: 42, scope: !77)
!216 = !DILocation(line: 62, column: 19, scope: !77)
!217 = !DILocation(line: 62, column: 16, scope: !77)
!218 = !DILocation(line: 55, column: 48, scope: !77)
!219 = !DILocation(line: 63, column: 19, scope: !77)
!220 = !DILocation(line: 63, column: 16, scope: !77)
!221 = !DILocation(line: 55, column: 54, scope: !77)
!222 = !DILocation(line: 64, column: 15, scope: !77)
!223 = distinct !{!223, !115, !201, !224, !202}
!224 = !{!"llvm.loop.unroll.runtime.disable"}
!225 = !DILocation(line: 89, column: 9, scope: !2)
!226 = !DILocation(line: 0, scope: !77)
!227 = !DILocation(line: 90, column: 5, scope: !2)
!228 = !DILocation(line: 90, column: 16, scope: !2)
!229 = !DILocation(line: 90, column: 41, scope: !2)
!230 = !DILocation(line: 90, column: 39, scope: !2)
!231 = !DILocation(line: 90, column: 28, scope: !2)
!232 = !DILocation(line: 90, column: 25, scope: !2)
!233 = distinct !{!233, !234}
!234 = !{!"llvm.loop.unroll.disable"}
!235 = distinct !{!235, !227, !236}
!236 = !DILocation(line: 90, column: 43, scope: !2)
!237 = !DILocation(line: 0, scope: !2)
!238 = !DILocation(line: 91, column: 5, scope: !2)
!239 = distinct !DISubprogram(name: "redisBitpos", scope: !3, file: !3, line: 101, type: !240, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !243)
!240 = !DISubroutineType(types: !241)
!241 = !{!12, !11, !10, !242}
!242 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!244 = !DILocalVariable(name: "s", arg: 1, scope: !239, file: !3, line: 101, type: !11)
!245 = !DILocalVariable(name: "count", arg: 2, scope: !239, file: !3, line: 101, type: !10)
!246 = !DILocalVariable(name: "bit", arg: 3, scope: !239, file: !3, line: 101, type: !242)
!247 = !DILocalVariable(name: "l", scope: !239, file: !3, line: 102, type: !24)
!248 = !DILocalVariable(name: "c", scope: !239, file: !3, line: 103, type: !22)
!249 = !DILocalVariable(name: "skipval", scope: !239, file: !3, line: 104, type: !10)
!250 = !DILocalVariable(name: "word", scope: !239, file: !3, line: 104, type: !10)
!251 = !DILocalVariable(name: "one", scope: !239, file: !3, line: 104, type: !10)
!252 = !DILocalVariable(name: "pos", scope: !239, file: !3, line: 105, type: !12)
!253 = !DILocalVariable(name: "j", scope: !239, file: !3, line: 106, type: !10)
!254 = !DILocalVariable(name: "found", scope: !239, file: !3, line: 107, type: !242)
!255 = !DILocation(line: 101, column: 24, scope: !239)
!256 = !DILocation(line: 101, column: 41, scope: !239)
!257 = !DILocation(line: 101, column: 52, scope: !239)
!258 = !DILocation(line: 104, column: 28, scope: !239)
!259 = !DILocation(line: 105, column: 10, scope: !239)
!260 = !DILocation(line: 119, column: 15, scope: !239)
!261 = !DILocation(line: 104, column: 19, scope: !239)
!262 = !DILocation(line: 103, column: 20, scope: !239)
!263 = !DILocation(line: 107, column: 9, scope: !239)
!264 = !DILocation(line: 122, column: 11, scope: !239)
!265 = !DILocation(line: 122, column: 28, scope: !239)
!266 = !DILocation(line: 122, column: 45, scope: !239)
!267 = !DILocation(line: 122, column: 5, scope: !239)
!268 = !DILocation(line: 123, column: 13, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 123, column: 13)
!270 = distinct !DILexicalBlock(scope: !239, file: !3, line: 122, column: 55)
!271 = !DILocation(line: 123, column: 16, scope: !269)
!272 = !DILocation(line: 123, column: 13, scope: !270)
!273 = !DILocation(line: 133, column: 9, scope: !239)
!274 = !DILocation(line: 102, column: 20, scope: !239)
!275 = !DILocation(line: 134, column: 9, scope: !239)
!276 = !DILocation(line: 127, column: 10, scope: !270)
!277 = !DILocation(line: 128, column: 14, scope: !270)
!278 = !DILocation(line: 129, column: 13, scope: !270)
!279 = distinct !{!279, !267, !280}
!280 = !DILocation(line: 130, column: 5, scope: !239)
!281 = !DILocation(line: 0, scope: !270)
!282 = !DILocation(line: 135, column: 19, scope: !283)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 134, column: 17)
!284 = distinct !DILexicalBlock(scope: !239, file: !3, line: 134, column: 9)
!285 = !DILocation(line: 136, column: 22, scope: !283)
!286 = !DILocation(line: 136, column: 9, scope: !283)
!287 = !DILocation(line: 137, column: 17, scope: !288)
!288 = distinct !DILexicalBlock(scope: !289, file: !3, line: 137, column: 17)
!289 = distinct !DILexicalBlock(scope: !283, file: !3, line: 136, column: 37)
!290 = !{!291, !291, i64 0}
!291 = !{!"long", !104, i64 0}
!292 = !DILocation(line: 137, column: 20, scope: !288)
!293 = !DILocation(line: 137, column: 17, scope: !289)
!294 = !DILocation(line: 138, column: 14, scope: !289)
!295 = !DILocation(line: 139, column: 19, scope: !289)
!296 = !DILocation(line: 140, column: 17, scope: !289)
!297 = distinct !{!297, !286, !298}
!298 = !DILocation(line: 141, column: 9, scope: !283)
!299 = !DILocation(line: 133, column: 7, scope: !239)
!300 = !DILocation(line: 106, column: 19, scope: !239)
!301 = !DILocation(line: 154, column: 13, scope: !302)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 154, column: 13)
!303 = distinct !DILexicalBlock(scope: !304, file: !3, line: 152, column: 38)
!304 = distinct !DILexicalBlock(scope: !305, file: !3, line: 152, column: 5)
!305 = distinct !DILexicalBlock(scope: !239, file: !3, line: 152, column: 5)
!306 = !DILocation(line: 154, column: 13, scope: !303)
!307 = !DILocation(line: 151, column: 9, scope: !239)
!308 = !DILocation(line: 155, column: 21, scope: !309)
!309 = distinct !DILexicalBlock(scope: !302, file: !3, line: 154, column: 20)
!310 = !DILocation(line: 158, column: 9, scope: !309)
!311 = !DILocation(line: 104, column: 38, scope: !239)
!312 = !DILocation(line: 177, column: 19, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 177, column: 13)
!314 = distinct !DILexicalBlock(scope: !239, file: !3, line: 176, column: 16)
!315 = !DILocation(line: 177, column: 27, scope: !313)
!316 = !DILocation(line: 177, column: 33, scope: !313)
!317 = !DILocation(line: 177, column: 13, scope: !314)
!318 = !DILocation(line: 179, column: 13, scope: !314)
!319 = !DILocation(line: 184, column: 5, scope: !239)
!320 = !DILocation(line: 178, column: 12, scope: !314)
!321 = !DILocation(line: 186, column: 1, scope: !239)
!322 = !DILocation(line: 0, scope: !313)
!323 = !DILocation(line: 153, column: 14, scope: !303)
!324 = !DILocation(line: 156, column: 14, scope: !309)
!325 = !DILocation(line: 155, column: 18, scope: !309)
!326 = !DILocation(line: 157, column: 18, scope: !309)
!327 = !DILocation(line: 0, scope: !303)
!328 = !DILocation(line: 166, column: 13, scope: !329)
!329 = distinct !DILexicalBlock(scope: !239, file: !3, line: 166, column: 9)
!330 = !DILocation(line: 166, column: 26, scope: !329)
!331 = !DILocation(line: 166, column: 18, scope: !329)
!332 = !DILocation(line: 176, column: 5, scope: !239)
!333 = distinct !{!333, !332, !334}
!334 = !DILocation(line: 180, column: 5, scope: !239)
!335 = distinct !DISubprogram(name: "setUnsignedBitfield", scope: !3, file: !3, line: 209, type: !336, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !22, !25, !25, !25}
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347}
!339 = !DILocalVariable(name: "p", arg: 1, scope: !335, file: !3, line: 209, type: !22)
!340 = !DILocalVariable(name: "offset", arg: 2, scope: !335, file: !3, line: 209, type: !25)
!341 = !DILocalVariable(name: "bits", arg: 3, scope: !335, file: !3, line: 209, type: !25)
!342 = !DILocalVariable(name: "value", arg: 4, scope: !335, file: !3, line: 209, type: !25)
!343 = !DILocalVariable(name: "byte", scope: !335, file: !3, line: 210, type: !25)
!344 = !DILocalVariable(name: "bit", scope: !335, file: !3, line: 210, type: !25)
!345 = !DILocalVariable(name: "byteval", scope: !335, file: !3, line: 210, type: !25)
!346 = !DILocalVariable(name: "bitval", scope: !335, file: !3, line: 210, type: !25)
!347 = !DILocalVariable(name: "j", scope: !335, file: !3, line: 210, type: !25)
!348 = !DILocation(line: 209, column: 41, scope: !335)
!349 = !DILocation(line: 209, column: 53, scope: !335)
!350 = !DILocation(line: 209, column: 70, scope: !335)
!351 = !DILocation(line: 209, column: 85, scope: !335)
!352 = !DILocation(line: 210, column: 42, scope: !335)
!353 = !DILocation(line: 212, column: 19, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 212, column: 5)
!355 = distinct !DILexicalBlock(scope: !335, file: !3, line: 212, column: 5)
!356 = !DILocation(line: 212, column: 5, scope: !355)
!357 = !DILocation(line: 213, column: 48, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !3, line: 212, column: 32)
!359 = !DILocation(line: 213, column: 39, scope: !358)
!360 = !DILocation(line: 213, column: 25, scope: !358)
!361 = !DILocation(line: 213, column: 54, scope: !358)
!362 = !DILocation(line: 213, column: 18, scope: !358)
!363 = !DILocation(line: 210, column: 34, scope: !335)
!364 = !DILocation(line: 214, column: 23, scope: !358)
!365 = !DILocation(line: 210, column: 14, scope: !335)
!366 = !DILocation(line: 215, column: 27, scope: !358)
!367 = !DILocation(line: 215, column: 17, scope: !358)
!368 = !DILocation(line: 210, column: 20, scope: !335)
!369 = !DILocation(line: 216, column: 19, scope: !358)
!370 = !DILocation(line: 210, column: 25, scope: !335)
!371 = !DILocation(line: 217, column: 24, scope: !358)
!372 = !DILocation(line: 217, column: 20, scope: !358)
!373 = !DILocation(line: 217, column: 17, scope: !358)
!374 = !DILocation(line: 218, column: 27, scope: !358)
!375 = !DILocation(line: 219, column: 27, scope: !358)
!376 = !DILocation(line: 219, column: 19, scope: !358)
!377 = !DILocation(line: 219, column: 17, scope: !358)
!378 = !DILocation(line: 220, column: 15, scope: !358)
!379 = !DILocation(line: 212, column: 28, scope: !354)
!380 = distinct !{!380, !356, !381}
!381 = !DILocation(line: 221, column: 5, scope: !355)
!382 = !DILocation(line: 222, column: 1, scope: !335)
!383 = distinct !DISubprogram(name: "setSignedBitfield", scope: !3, file: !3, line: 224, type: !384, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !22, !25, !25, !27}
!386 = !{!387, !388, !389, !390, !391}
!387 = !DILocalVariable(name: "p", arg: 1, scope: !383, file: !3, line: 224, type: !22)
!388 = !DILocalVariable(name: "offset", arg: 2, scope: !383, file: !3, line: 224, type: !25)
!389 = !DILocalVariable(name: "bits", arg: 3, scope: !383, file: !3, line: 224, type: !25)
!390 = !DILocalVariable(name: "value", arg: 4, scope: !383, file: !3, line: 224, type: !27)
!391 = !DILocalVariable(name: "uv", scope: !383, file: !3, line: 225, type: !25)
!392 = !DILocation(line: 224, column: 39, scope: !383)
!393 = !DILocation(line: 224, column: 51, scope: !383)
!394 = !DILocation(line: 224, column: 68, scope: !383)
!395 = !DILocation(line: 224, column: 82, scope: !383)
!396 = !DILocation(line: 225, column: 14, scope: !383)
!397 = !DILocation(line: 209, column: 41, scope: !335, inlinedAt: !398)
!398 = distinct !DILocation(line: 226, column: 5, scope: !383)
!399 = !DILocation(line: 209, column: 53, scope: !335, inlinedAt: !398)
!400 = !DILocation(line: 209, column: 70, scope: !335, inlinedAt: !398)
!401 = !DILocation(line: 209, column: 85, scope: !335, inlinedAt: !398)
!402 = !DILocation(line: 210, column: 42, scope: !335, inlinedAt: !398)
!403 = !DILocation(line: 212, column: 19, scope: !354, inlinedAt: !398)
!404 = !DILocation(line: 212, column: 5, scope: !355, inlinedAt: !398)
!405 = !DILocation(line: 213, column: 48, scope: !358, inlinedAt: !398)
!406 = !DILocation(line: 213, column: 39, scope: !358, inlinedAt: !398)
!407 = !DILocation(line: 213, column: 25, scope: !358, inlinedAt: !398)
!408 = !DILocation(line: 213, column: 54, scope: !358, inlinedAt: !398)
!409 = !DILocation(line: 213, column: 18, scope: !358, inlinedAt: !398)
!410 = !DILocation(line: 210, column: 34, scope: !335, inlinedAt: !398)
!411 = !DILocation(line: 214, column: 23, scope: !358, inlinedAt: !398)
!412 = !DILocation(line: 210, column: 14, scope: !335, inlinedAt: !398)
!413 = !DILocation(line: 215, column: 27, scope: !358, inlinedAt: !398)
!414 = !DILocation(line: 215, column: 17, scope: !358, inlinedAt: !398)
!415 = !DILocation(line: 210, column: 20, scope: !335, inlinedAt: !398)
!416 = !DILocation(line: 216, column: 19, scope: !358, inlinedAt: !398)
!417 = !DILocation(line: 210, column: 25, scope: !335, inlinedAt: !398)
!418 = !DILocation(line: 217, column: 24, scope: !358, inlinedAt: !398)
!419 = !DILocation(line: 217, column: 20, scope: !358, inlinedAt: !398)
!420 = !DILocation(line: 217, column: 17, scope: !358, inlinedAt: !398)
!421 = !DILocation(line: 218, column: 27, scope: !358, inlinedAt: !398)
!422 = !DILocation(line: 219, column: 27, scope: !358, inlinedAt: !398)
!423 = !DILocation(line: 219, column: 19, scope: !358, inlinedAt: !398)
!424 = !DILocation(line: 219, column: 17, scope: !358, inlinedAt: !398)
!425 = !DILocation(line: 220, column: 15, scope: !358, inlinedAt: !398)
!426 = !DILocation(line: 212, column: 28, scope: !354, inlinedAt: !398)
!427 = !DILocation(line: 227, column: 1, scope: !383)
!428 = distinct !DISubprogram(name: "getUnsignedBitfield", scope: !3, file: !3, line: 229, type: !429, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!25, !22, !25, !25}
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440}
!432 = !DILocalVariable(name: "p", arg: 1, scope: !428, file: !3, line: 229, type: !22)
!433 = !DILocalVariable(name: "offset", arg: 2, scope: !428, file: !3, line: 229, type: !25)
!434 = !DILocalVariable(name: "bits", arg: 3, scope: !428, file: !3, line: 229, type: !25)
!435 = !DILocalVariable(name: "byte", scope: !428, file: !3, line: 230, type: !25)
!436 = !DILocalVariable(name: "bit", scope: !428, file: !3, line: 230, type: !25)
!437 = !DILocalVariable(name: "byteval", scope: !428, file: !3, line: 230, type: !25)
!438 = !DILocalVariable(name: "bitval", scope: !428, file: !3, line: 230, type: !25)
!439 = !DILocalVariable(name: "j", scope: !428, file: !3, line: 230, type: !25)
!440 = !DILocalVariable(name: "value", scope: !428, file: !3, line: 230, type: !25)
!441 = !DILocation(line: 229, column: 45, scope: !428)
!442 = !DILocation(line: 229, column: 57, scope: !428)
!443 = !DILocation(line: 229, column: 74, scope: !428)
!444 = !DILocation(line: 230, column: 45, scope: !428)
!445 = !DILocation(line: 230, column: 42, scope: !428)
!446 = !DILocation(line: 232, column: 19, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 232, column: 5)
!448 = distinct !DILexicalBlock(scope: !428, file: !3, line: 232, column: 5)
!449 = !DILocation(line: 232, column: 5, scope: !448)
!450 = !DILocation(line: 233, column: 23, scope: !451)
!451 = distinct !DILexicalBlock(scope: !447, file: !3, line: 232, column: 32)
!452 = !DILocation(line: 230, column: 14, scope: !428)
!453 = !DILocation(line: 234, column: 27, scope: !451)
!454 = !DILocation(line: 234, column: 17, scope: !451)
!455 = !DILocation(line: 230, column: 20, scope: !428)
!456 = !DILocation(line: 235, column: 19, scope: !451)
!457 = !DILocation(line: 230, column: 25, scope: !428)
!458 = !DILocation(line: 236, column: 27, scope: !451)
!459 = !DILocation(line: 236, column: 35, scope: !451)
!460 = !DILocation(line: 230, column: 34, scope: !428)
!461 = !DILocation(line: 237, column: 23, scope: !451)
!462 = !DILocation(line: 237, column: 28, scope: !451)
!463 = !DILocation(line: 238, column: 15, scope: !451)
!464 = distinct !{!464, !449, !465}
!465 = !DILocation(line: 239, column: 5, scope: !448)
!466 = !DILocation(line: 240, column: 5, scope: !428)
!467 = !DILocation(line: 0, scope: !451)
!468 = distinct !DISubprogram(name: "getSignedBitfield", scope: !3, file: !3, line: 243, type: !469, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{!27, !22, !25, !25}
!471 = !{!472, !473, !474, !475, !476}
!472 = !DILocalVariable(name: "p", arg: 1, scope: !468, file: !3, line: 243, type: !22)
!473 = !DILocalVariable(name: "offset", arg: 2, scope: !468, file: !3, line: 243, type: !25)
!474 = !DILocalVariable(name: "bits", arg: 3, scope: !468, file: !3, line: 243, type: !25)
!475 = !DILocalVariable(name: "value", scope: !468, file: !3, line: 244, type: !27)
!476 = !DILocalVariable(name: "conv", scope: !468, file: !3, line: 245, type: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !468, file: !3, line: 245, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !477, file: !3, line: 245, baseType: !25, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !477, file: !3, line: 245, baseType: !27, size: 64)
!481 = !DILocation(line: 243, column: 42, scope: !468)
!482 = !DILocation(line: 243, column: 54, scope: !468)
!483 = !DILocation(line: 243, column: 71, scope: !468)
!484 = !DILocation(line: 229, column: 45, scope: !428, inlinedAt: !485)
!485 = distinct !DILocation(line: 254, column: 14, scope: !468)
!486 = !DILocation(line: 229, column: 57, scope: !428, inlinedAt: !485)
!487 = !DILocation(line: 229, column: 74, scope: !428, inlinedAt: !485)
!488 = !DILocation(line: 230, column: 45, scope: !428, inlinedAt: !485)
!489 = !DILocation(line: 230, column: 42, scope: !428, inlinedAt: !485)
!490 = !DILocation(line: 232, column: 19, scope: !447, inlinedAt: !485)
!491 = !DILocation(line: 232, column: 5, scope: !448, inlinedAt: !485)
!492 = !DILocation(line: 233, column: 23, scope: !451, inlinedAt: !485)
!493 = !DILocation(line: 230, column: 14, scope: !428, inlinedAt: !485)
!494 = !DILocation(line: 234, column: 27, scope: !451, inlinedAt: !485)
!495 = !DILocation(line: 234, column: 17, scope: !451, inlinedAt: !485)
!496 = !DILocation(line: 230, column: 20, scope: !428, inlinedAt: !485)
!497 = !DILocation(line: 235, column: 19, scope: !451, inlinedAt: !485)
!498 = !DILocation(line: 230, column: 25, scope: !428, inlinedAt: !485)
!499 = !DILocation(line: 236, column: 27, scope: !451, inlinedAt: !485)
!500 = !DILocation(line: 236, column: 35, scope: !451, inlinedAt: !485)
!501 = !DILocation(line: 230, column: 34, scope: !428, inlinedAt: !485)
!502 = !DILocation(line: 237, column: 23, scope: !451, inlinedAt: !485)
!503 = !DILocation(line: 237, column: 28, scope: !451, inlinedAt: !485)
!504 = !DILocation(line: 238, column: 15, scope: !451, inlinedAt: !485)
!505 = !DILocation(line: 260, column: 38, scope: !506)
!506 = distinct !DILexicalBlock(scope: !468, file: !3, line: 260, column: 9)
!507 = !DILocation(line: 0, scope: !451, inlinedAt: !485)
!508 = !DILocation(line: 245, column: 36, scope: !468)
!509 = !DILocation(line: 244, column: 13, scope: !468)
!510 = !DILocation(line: 260, column: 30, scope: !506)
!511 = !DILocation(line: 260, column: 15, scope: !506)
!512 = !DILocation(line: 261, column: 33, scope: !506)
!513 = !DILocation(line: 260, column: 9, scope: !468)
!514 = !DILocation(line: 262, column: 5, scope: !468)
!515 = distinct !DISubprogram(name: "checkUnsignedBitfieldOverflow", scope: !3, file: !3, line: 288, type: !516, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !519)
!516 = !DISubroutineType(types: !517)
!517 = !{!242, !25, !27, !25, !242, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !530}
!520 = !DILocalVariable(name: "value", arg: 1, scope: !515, file: !3, line: 288, type: !25)
!521 = !DILocalVariable(name: "incr", arg: 2, scope: !515, file: !3, line: 288, type: !27)
!522 = !DILocalVariable(name: "bits", arg: 3, scope: !515, file: !3, line: 288, type: !25)
!523 = !DILocalVariable(name: "owtype", arg: 4, scope: !515, file: !3, line: 288, type: !242)
!524 = !DILocalVariable(name: "limit", arg: 5, scope: !515, file: !3, line: 288, type: !518)
!525 = !DILocalVariable(name: "max", scope: !515, file: !3, line: 289, type: !25)
!526 = !DILocalVariable(name: "maxincr", scope: !515, file: !3, line: 290, type: !27)
!527 = !DILocalVariable(name: "minincr", scope: !515, file: !3, line: 291, type: !27)
!528 = !DILocalVariable(name: "mask", scope: !529, file: !3, line: 316, type: !25)
!529 = distinct !DILexicalBlock(scope: !515, file: !3, line: 315, column: 5)
!530 = !DILocalVariable(name: "res", scope: !529, file: !3, line: 317, type: !25)
!531 = !DILocation(line: 288, column: 44, scope: !515)
!532 = !DILocation(line: 288, column: 59, scope: !515)
!533 = !DILocation(line: 288, column: 74, scope: !515)
!534 = !DILocation(line: 288, column: 84, scope: !515)
!535 = !DILocation(line: 288, column: 102, scope: !515)
!536 = !DILocation(line: 289, column: 26, scope: !515)
!537 = !DILocation(line: 289, column: 68, scope: !515)
!538 = !DILocation(line: 289, column: 20, scope: !515)
!539 = !DILocation(line: 289, column: 14, scope: !515)
!540 = !DILocation(line: 291, column: 23, scope: !515)
!541 = !DILocation(line: 291, column: 13, scope: !515)
!542 = !DILocation(line: 293, column: 15, scope: !543)
!543 = distinct !DILexicalBlock(scope: !515, file: !3, line: 293, column: 9)
!544 = !DILocation(line: 293, column: 21, scope: !543)
!545 = !DILocation(line: 290, column: 26, scope: !515)
!546 = !DILocation(line: 290, column: 13, scope: !515)
!547 = !DILocation(line: 293, column: 30, scope: !543)
!548 = !DILocation(line: 293, column: 42, scope: !543)
!549 = !DILocation(line: 293, column: 34, scope: !543)
!550 = !DILocation(line: 294, column: 13, scope: !551)
!551 = distinct !DILexicalBlock(scope: !552, file: !3, line: 294, column: 13)
!552 = distinct !DILexicalBlock(scope: !543, file: !3, line: 293, column: 54)
!553 = !DILocation(line: 294, column: 13, scope: !552)
!554 = !DILocation(line: 295, column: 17, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !3, line: 294, column: 20)
!556 = !DILocation(line: 298, column: 24, scope: !557)
!557 = distinct !DILexicalBlock(scope: !558, file: !3, line: 297, column: 50)
!558 = distinct !DILexicalBlock(scope: !559, file: !3, line: 297, column: 24)
!559 = distinct !DILexicalBlock(scope: !555, file: !3, line: 295, column: 17)
!560 = !DILocation(line: 299, column: 13, scope: !557)
!561 = !DILocation(line: 302, column: 21, scope: !562)
!562 = distinct !DILexicalBlock(scope: !543, file: !3, line: 302, column: 16)
!563 = !DILocation(line: 302, column: 33, scope: !562)
!564 = !DILocation(line: 302, column: 25, scope: !562)
!565 = !DILocation(line: 303, column: 13, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !3, line: 303, column: 13)
!567 = distinct !DILexicalBlock(scope: !562, file: !3, line: 302, column: 44)
!568 = !DILocation(line: 303, column: 13, scope: !567)
!569 = !DILocation(line: 304, column: 17, scope: !570)
!570 = distinct !DILexicalBlock(scope: !566, file: !3, line: 303, column: 20)
!571 = !DILocation(line: 307, column: 24, scope: !572)
!572 = distinct !DILexicalBlock(scope: !573, file: !3, line: 306, column: 50)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 306, column: 24)
!574 = distinct !DILexicalBlock(scope: !570, file: !3, line: 304, column: 17)
!575 = !DILocation(line: 308, column: 13, scope: !572)
!576 = !DILocation(line: 316, column: 18, scope: !529)
!577 = !DILocation(line: 317, column: 29, scope: !529)
!578 = !DILocation(line: 317, column: 18, scope: !529)
!579 = !DILocation(line: 319, column: 13, scope: !529)
!580 = !DILocation(line: 320, column: 16, scope: !529)
!581 = !DILocation(line: 322, column: 5, scope: !515)
!582 = !DILocation(line: 0, scope: !515)
!583 = !DILocation(line: 323, column: 1, scope: !515)
!584 = distinct !DISubprogram(name: "checkSignedBitfieldOverflow", scope: !3, file: !3, line: 325, type: !585, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !588)
!585 = !DISubroutineType(types: !586)
!586 = !{!242, !27, !27, !25, !242, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601, !602, !603}
!589 = !DILocalVariable(name: "value", arg: 1, scope: !584, file: !3, line: 325, type: !27)
!590 = !DILocalVariable(name: "incr", arg: 2, scope: !584, file: !3, line: 325, type: !27)
!591 = !DILocalVariable(name: "bits", arg: 3, scope: !584, file: !3, line: 325, type: !25)
!592 = !DILocalVariable(name: "owtype", arg: 4, scope: !584, file: !3, line: 325, type: !242)
!593 = !DILocalVariable(name: "limit", arg: 5, scope: !584, file: !3, line: 325, type: !587)
!594 = !DILocalVariable(name: "max", scope: !584, file: !3, line: 326, type: !27)
!595 = !DILocalVariable(name: "min", scope: !584, file: !3, line: 327, type: !27)
!596 = !DILocalVariable(name: "maxincr", scope: !584, file: !3, line: 332, type: !27)
!597 = !DILocalVariable(name: "minincr", scope: !584, file: !3, line: 333, type: !27)
!598 = !DILocalVariable(name: "mask", scope: !599, file: !3, line: 359, type: !25)
!599 = distinct !DILexicalBlock(scope: !584, file: !3, line: 358, column: 5)
!600 = !DILocalVariable(name: "msb", scope: !599, file: !3, line: 360, type: !25)
!601 = !DILocalVariable(name: "a", scope: !599, file: !3, line: 361, type: !25)
!602 = !DILocalVariable(name: "b", scope: !599, file: !3, line: 361, type: !25)
!603 = !DILocalVariable(name: "c", scope: !599, file: !3, line: 361, type: !25)
!604 = !DILocation(line: 325, column: 41, scope: !584)
!605 = !DILocation(line: 325, column: 56, scope: !584)
!606 = !DILocation(line: 325, column: 71, scope: !584)
!607 = !DILocation(line: 325, column: 81, scope: !584)
!608 = !DILocation(line: 325, column: 98, scope: !584)
!609 = !DILocation(line: 326, column: 25, scope: !584)
!610 = !DILocation(line: 326, column: 19, scope: !584)
!611 = !DILocation(line: 326, column: 65, scope: !584)
!612 = !DILocation(line: 326, column: 69, scope: !584)
!613 = !DILocation(line: 326, column: 13, scope: !584)
!614 = !DILocation(line: 327, column: 13, scope: !584)
!615 = !DILocation(line: 335, column: 15, scope: !616)
!616 = distinct !DILexicalBlock(scope: !584, file: !3, line: 335, column: 9)
!617 = !DILocation(line: 332, column: 26, scope: !584)
!618 = !DILocation(line: 335, column: 44, scope: !616)
!619 = !DILocation(line: 335, column: 21, scope: !616)
!620 = !DILocation(line: 335, column: 65, scope: !616)
!621 = !DILocation(line: 335, column: 78, scope: !616)
!622 = !DILocation(line: 335, column: 70, scope: !616)
!623 = !DILocation(line: 337, column: 13, scope: !624)
!624 = distinct !DILexicalBlock(scope: !625, file: !3, line: 337, column: 13)
!625 = distinct !DILexicalBlock(scope: !616, file: !3, line: 336, column: 5)
!626 = !DILocation(line: 337, column: 13, scope: !625)
!627 = !DILocation(line: 338, column: 17, scope: !628)
!628 = distinct !DILexicalBlock(scope: !624, file: !3, line: 337, column: 20)
!629 = !DILocation(line: 341, column: 24, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !3, line: 340, column: 50)
!631 = distinct !DILexicalBlock(scope: !632, file: !3, line: 340, column: 24)
!632 = distinct !DILexicalBlock(scope: !628, file: !3, line: 338, column: 17)
!633 = !DILocation(line: 342, column: 13, scope: !630)
!634 = !DILocation(line: 333, column: 26, scope: !584)
!635 = !DILocation(line: 345, column: 22, scope: !636)
!636 = distinct !DILexicalBlock(scope: !616, file: !3, line: 345, column: 16)
!637 = !DILocation(line: 345, column: 51, scope: !636)
!638 = !DILocation(line: 345, column: 43, scope: !636)
!639 = !DILocation(line: 345, column: 28, scope: !636)
!640 = !DILocation(line: 345, column: 76, scope: !636)
!641 = !DILocation(line: 346, column: 13, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !3, line: 346, column: 13)
!643 = distinct !DILexicalBlock(scope: !636, file: !3, line: 345, column: 108)
!644 = !DILocation(line: 346, column: 13, scope: !643)
!645 = !DILocation(line: 347, column: 17, scope: !646)
!646 = distinct !DILexicalBlock(scope: !642, file: !3, line: 346, column: 20)
!647 = !DILocation(line: 350, column: 24, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 349, column: 50)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 349, column: 24)
!650 = distinct !DILexicalBlock(scope: !646, file: !3, line: 347, column: 17)
!651 = !DILocation(line: 351, column: 13, scope: !648)
!652 = !DILocation(line: 359, column: 40, scope: !599)
!653 = !DILocation(line: 359, column: 18, scope: !599)
!654 = !DILocation(line: 360, column: 44, scope: !599)
!655 = !DILocation(line: 360, column: 36, scope: !599)
!656 = !DILocation(line: 360, column: 18, scope: !599)
!657 = !DILocation(line: 361, column: 18, scope: !599)
!658 = !DILocation(line: 361, column: 29, scope: !599)
!659 = !DILocation(line: 362, column: 14, scope: !599)
!660 = !DILocation(line: 361, column: 39, scope: !599)
!661 = !DILocation(line: 367, column: 15, scope: !662)
!662 = distinct !DILexicalBlock(scope: !599, file: !3, line: 367, column: 13)
!663 = !DILocation(line: 368, column: 15, scope: !664)
!664 = distinct !DILexicalBlock(scope: !662, file: !3, line: 367, column: 22)
!665 = !DILocation(line: 370, column: 18, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !3, line: 369, column: 16)
!667 = !DILocation(line: 370, column: 15, scope: !666)
!668 = !DILocation(line: 367, column: 13, scope: !599)
!669 = !DILocation(line: 372, column: 16, scope: !599)
!670 = !DILocation(line: 374, column: 5, scope: !584)
!671 = !DILocation(line: 0, scope: !584)
!672 = !DILocation(line: 375, column: 1, scope: !584)
!673 = distinct !DISubprogram(name: "printBits", scope: !3, file: !3, line: 379, type: !674, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !22, !10}
!676 = !{!677, !678, !679, !680, !681}
!677 = !DILocalVariable(name: "p", arg: 1, scope: !673, file: !3, line: 379, type: !22)
!678 = !DILocalVariable(name: "count", arg: 2, scope: !673, file: !3, line: 379, type: !10)
!679 = !DILocalVariable(name: "j", scope: !673, file: !3, line: 380, type: !10)
!680 = !DILocalVariable(name: "i", scope: !673, file: !3, line: 380, type: !10)
!681 = !DILocalVariable(name: "byte", scope: !673, file: !3, line: 380, type: !10)
!682 = !DILocation(line: 379, column: 31, scope: !673)
!683 = !DILocation(line: 379, column: 48, scope: !673)
!684 = !DILocation(line: 380, column: 19, scope: !673)
!685 = !DILocation(line: 382, column: 19, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 382, column: 5)
!687 = distinct !DILexicalBlock(scope: !673, file: !3, line: 382, column: 5)
!688 = !DILocation(line: 382, column: 5, scope: !687)
!689 = !DILocation(line: 383, column: 16, scope: !690)
!690 = distinct !DILexicalBlock(scope: !686, file: !3, line: 382, column: 33)
!691 = !DILocation(line: 380, column: 25, scope: !673)
!692 = !DILocation(line: 380, column: 22, scope: !673)
!693 = !DILocation(line: 385, column: 26, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 384, column: 9)
!695 = distinct !DILexicalBlock(scope: !690, file: !3, line: 384, column: 9)
!696 = !DILocation(line: 385, column: 13, scope: !694)
!697 = !DILocation(line: 385, column: 32, scope: !694)
!698 = !DILocation(line: 386, column: 9, scope: !690)
!699 = !DILocation(line: 382, column: 29, scope: !686)
!700 = distinct !{!700, !688, !701}
!701 = !DILocation(line: 387, column: 5, scope: !687)
!702 = !DILocation(line: 388, column: 5, scope: !673)
!703 = !DILocation(line: 389, column: 1, scope: !673)
!704 = distinct !DISubprogram(name: "getBitOffsetFromArgument", scope: !3, file: !3, line: 411, type: !705, isLocal: false, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !944)
!705 = !DISubroutineType(types: !706)
!706 = !{!242, !707, !817, !943, !242, !242}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !709, line: 780, baseType: !710)
!709 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !709, line: 723, size: 135360, elements: !711)
!711 = !{!712, !713, !714, !816, !826, !829, !830, !831, !832, !833, !835, !859, !860, !861, !862, !863, !864, !865, !866, !869, !870, !871, !872, !873, !874, !875, !876, !881, !882, !883, !884, !885, !886, !887, !888, !892, !893, !897, !898, !914, !915, !932, !933, !934, !935, !936, !937, !938, !939}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !710, file: !709, line: 724, baseType: !25, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !710, file: !709, line: 725, baseType: !242, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !710, file: !709, line: 726, baseType: !715, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !709, line: 656, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !709, line: 647, size: 512, elements: !718)
!718 = !{!719, !780, !781, !782, !783, !784, !785, !787}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !717, file: !709, line: 648, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !722, line: 82, baseType: !723)
!722 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !722, line: 76, size: 768, elements: !724)
!724 = !{!725, !750, !751, !778, !779}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !722, line: 77, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !722, line: 65, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !722, line: 58, size: 384, elements: !729)
!729 = !{!730, !736, !740, !741, !745, !749}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !728, file: !722, line: 59, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!25, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !728, file: !722, line: 60, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!11, !11, !734}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !728, file: !722, line: 61, baseType: !737, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !728, file: !722, line: 62, baseType: !742, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!242, !11, !734, !734}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !728, file: !722, line: 63, baseType: !746, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !11, !11}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !728, file: !722, line: 64, baseType: !746, size: 64, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !723, file: !722, line: 78, baseType: !11, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !723, file: !722, line: 79, baseType: !752, size: 512, offset: 128)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 512, elements: !776)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !722, line: 74, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !722, line: 69, size: 256, elements: !755)
!755 = !{!756, !773, !774, !775}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !754, file: !722, line: 70, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !722, line: 56, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !722, line: 47, size: 192, elements: !761)
!761 = !{!762, !763, !771}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !760, file: !722, line: 48, baseType: !11, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !760, file: !722, line: 54, baseType: !764, size: 64, offset: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !760, file: !722, line: 49, size: 64, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !764, file: !722, line: 50, baseType: !11, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !764, file: !722, line: 51, baseType: !25, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !764, file: !722, line: 52, baseType: !27, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !764, file: !722, line: 53, baseType: !770, size: 64)
!770 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !722, line: 55, baseType: !772, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !754, file: !722, line: 71, baseType: !10, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !754, file: !722, line: 72, baseType: !10, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !754, file: !722, line: 73, baseType: !10, size: 64, offset: 192)
!776 = !{!777}
!777 = !DISubrange(count: 2)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !723, file: !722, line: 80, baseType: !12, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !723, file: !722, line: 81, baseType: !10, size: 64, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !717, file: !709, line: 649, baseType: !720, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !717, file: !709, line: 650, baseType: !720, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !717, file: !709, line: 651, baseType: !720, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !717, file: !709, line: 652, baseType: !720, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !709, line: 653, baseType: !242, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !717, file: !709, line: 654, baseType: !786, size: 64, offset: 384)
!786 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !717, file: !709, line: 655, baseType: !788, size: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !790, line: 54, baseType: !791)
!790 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !790, line: 47, size: 384, elements: !792)
!792 = !{!793, !802, !803, !807, !811, !815}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !791, file: !790, line: 48, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !790, line: 40, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !790, line: 36, size: 192, elements: !797)
!797 = !{!798, !800, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !790, line: 37, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !790, line: 38, baseType: !799, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !796, file: !790, line: 39, baseType: !11, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !791, file: !790, line: 49, baseType: !794, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !791, file: !790, line: 50, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!11, !11}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !791, file: !790, line: 51, baseType: !808, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !11}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !791, file: !790, line: 52, baseType: !812, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!242, !11, !11}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !791, file: !790, line: 53, baseType: !10, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !709, line: 727, baseType: !817, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !709, line: 622, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !709, line: 614, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !819, file: !709, line: 615, baseType: !21, size: 4, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !819, file: !709, line: 616, baseType: !21, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !819, file: !709, line: 617, baseType: !21, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !819, file: !709, line: 620, baseType: !242, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !819, file: !709, line: 621, baseType: !11, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !710, file: !709, line: 728, baseType: !827, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !35, line: 43, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !710, file: !709, line: 729, baseType: !6, size: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !710, file: !709, line: 730, baseType: !827, size: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !710, file: !709, line: 734, baseType: !6, size: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !710, file: !709, line: 735, baseType: !242, size: 32, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !710, file: !709, line: 736, baseType: !834, size: 64, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !710, file: !709, line: 737, baseType: !836, size: 64, offset: 640)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !709, line: 1307, size: 640, elements: !838)
!838 = !{!839, !840, !845, !846, !847, !848, !854, !855, !856, !857, !858}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !709, line: 1308, baseType: !828, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !837, file: !709, line: 1309, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !709, line: 1305, baseType: !843)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !707}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !837, file: !709, line: 1310, baseType: !242, size: 32, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !837, file: !709, line: 1311, baseType: !828, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !837, file: !709, line: 1312, baseType: !242, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !837, file: !709, line: 1315, baseType: !849, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !709, line: 1306, baseType: !851)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !836, !834, !242, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !837, file: !709, line: 1317, baseType: !242, size: 32, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !837, file: !709, line: 1318, baseType: !242, size: 32, offset: 416)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !837, file: !709, line: 1319, baseType: !242, size: 32, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !837, file: !709, line: 1320, baseType: !786, size: 64, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !837, file: !709, line: 1320, baseType: !786, size: 64, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !710, file: !709, line: 737, baseType: !836, size: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !710, file: !709, line: 738, baseType: !242, size: 32, offset: 768)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !710, file: !709, line: 739, baseType: !242, size: 32, offset: 800)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !710, file: !709, line: 740, baseType: !12, size: 64, offset: 832)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !710, file: !709, line: 741, baseType: !788, size: 64, offset: 896)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !710, file: !709, line: 742, baseType: !29, size: 64, offset: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !710, file: !709, line: 743, baseType: !6, size: 64, offset: 1024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !710, file: !709, line: 745, baseType: !867, size: 64, offset: 1088)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !868, line: 34, baseType: !12)
!868 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !710, file: !709, line: 746, baseType: !867, size: 64, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !710, file: !709, line: 747, baseType: !867, size: 64, offset: 1216)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !710, file: !709, line: 748, baseType: !242, size: 32, offset: 1280)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !710, file: !709, line: 749, baseType: !242, size: 32, offset: 1312)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !710, file: !709, line: 750, baseType: !242, size: 32, offset: 1344)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !710, file: !709, line: 751, baseType: !242, size: 32, offset: 1376)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !710, file: !709, line: 752, baseType: !242, size: 32, offset: 1408)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !710, file: !709, line: 753, baseType: !877, size: 64, offset: 1472)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !878, line: 173, baseType: !879)
!878 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !9, line: 100, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !9, line: 44, baseType: !12)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !710, file: !709, line: 754, baseType: !877, size: 64, offset: 1536)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !710, file: !709, line: 755, baseType: !827, size: 64, offset: 1600)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !710, file: !709, line: 756, baseType: !786, size: 64, offset: 1664)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !710, file: !709, line: 757, baseType: !786, size: 64, offset: 1728)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !710, file: !709, line: 758, baseType: !786, size: 64, offset: 1792)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !710, file: !709, line: 759, baseType: !786, size: 64, offset: 1856)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !710, file: !709, line: 760, baseType: !786, size: 64, offset: 1920)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !710, file: !709, line: 763, baseType: !889, size: 328, offset: 1984)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 328, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 41)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !710, file: !709, line: 764, baseType: !242, size: 32, offset: 2336)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !710, file: !709, line: 765, baseType: !894, size: 368, offset: 2368)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 368, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 46)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !710, file: !709, line: 766, baseType: !242, size: 32, offset: 2752)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !710, file: !709, line: 767, baseType: !899, size: 256, offset: 2816)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !709, line: 673, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !709, line: 665, size: 256, elements: !901)
!901 = !{!902, !910, !911, !912, !913}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !900, file: !709, line: 666, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !709, line: 663, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !709, line: 659, size: 192, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !905, file: !709, line: 660, baseType: !834, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !905, file: !709, line: 661, baseType: !242, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !905, file: !709, line: 662, baseType: !836, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !900, file: !709, line: 667, baseType: !242, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !900, file: !709, line: 668, baseType: !242, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !900, file: !709, line: 671, baseType: !242, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !900, file: !709, line: 672, baseType: !867, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !710, file: !709, line: 768, baseType: !242, size: 32, offset: 3072)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !710, file: !709, line: 769, baseType: !916, size: 704, offset: 3136)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !709, line: 703, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !709, line: 677, size: 704, elements: !918)
!918 = !{!919, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !917, file: !709, line: 679, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !709, line: 52, baseType: !786)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !917, file: !709, line: 683, baseType: !720, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !917, file: !709, line: 685, baseType: !817, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !917, file: !709, line: 689, baseType: !6, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !917, file: !709, line: 690, baseType: !817, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !917, file: !709, line: 691, baseType: !817, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !917, file: !709, line: 692, baseType: !920, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !917, file: !709, line: 692, baseType: !920, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !917, file: !709, line: 693, baseType: !242, size: 32, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !917, file: !709, line: 696, baseType: !242, size: 32, offset: 544)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !917, file: !709, line: 697, baseType: !786, size: 64, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !917, file: !709, line: 700, baseType: !11, size: 64, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !710, file: !709, line: 770, baseType: !786, size: 64, offset: 3840)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !710, file: !709, line: 771, baseType: !788, size: 64, offset: 3904)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !710, file: !709, line: 772, baseType: !720, size: 64, offset: 3968)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !710, file: !709, line: 773, baseType: !788, size: 64, offset: 4032)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !710, file: !709, line: 774, baseType: !827, size: 64, offset: 4096)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !710, file: !709, line: 775, baseType: !794, size: 64, offset: 4160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !710, file: !709, line: 778, baseType: !242, size: 32, offset: 4224)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !710, file: !709, line: 779, baseType: !940, size: 131072, offset: 4256)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 131072, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 16384)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!945 = !DILocalVariable(name: "c", arg: 1, scope: !704, file: !3, line: 411, type: !707)
!946 = !DILocalVariable(name: "o", arg: 2, scope: !704, file: !3, line: 411, type: !817)
!947 = !DILocalVariable(name: "offset", arg: 3, scope: !704, file: !3, line: 411, type: !943)
!948 = !DILocalVariable(name: "hash", arg: 4, scope: !704, file: !3, line: 411, type: !242)
!949 = !DILocalVariable(name: "bits", arg: 5, scope: !704, file: !3, line: 411, type: !242)
!950 = !DILocalVariable(name: "loffset", scope: !704, file: !3, line: 412, type: !786)
!951 = !DILocalVariable(name: "err", scope: !704, file: !3, line: 413, type: !828)
!952 = !DILocalVariable(name: "p", scope: !704, file: !3, line: 414, type: !828)
!953 = !DILocalVariable(name: "plen", scope: !704, file: !3, line: 415, type: !6)
!954 = !DILocalVariable(name: "usehash", scope: !704, file: !3, line: 416, type: !242)
!955 = !DILocation(line: 411, column: 38, scope: !704)
!956 = !DILocation(line: 411, column: 47, scope: !704)
!957 = !DILocation(line: 411, column: 58, scope: !704)
!958 = !DILocation(line: 411, column: 70, scope: !704)
!959 = !DILocation(line: 411, column: 80, scope: !704)
!960 = !DILocation(line: 412, column: 5, scope: !704)
!961 = !DILocation(line: 414, column: 18, scope: !704)
!962 = !{!963, !964, i64 8}
!963 = !{!"redisObject", !119, i64 0, !119, i64 0, !119, i64 1, !119, i64 4, !964, i64 8}
!964 = !{!"any pointer", !104, i64 0}
!965 = !DILocation(line: 414, column: 11, scope: !704)
!966 = !DILocalVariable(name: "s", arg: 1, scope: !967, file: !35, line: 87, type: !972)
!967 = distinct !DISubprogram(name: "sdslen", scope: !35, file: !35, line: 87, type: !968, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !973)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !972}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !971, line: 58, baseType: !10)
!971 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!973 = !{!966, !974}
!974 = !DILocalVariable(name: "flags", scope: !967, file: !35, line: 88, type: !23)
!975 = !DILocation(line: 87, column: 39, scope: !967, inlinedAt: !976)
!976 = distinct !DILocation(line: 415, column: 19, scope: !704)
!977 = !DILocation(line: 88, column: 27, scope: !967, inlinedAt: !976)
!978 = !DILocation(line: 88, column: 19, scope: !967, inlinedAt: !976)
!979 = !DILocation(line: 89, column: 5, scope: !967, inlinedAt: !976)
!980 = !DILocation(line: 91, column: 20, scope: !981, inlinedAt: !976)
!981 = distinct !DILexicalBlock(scope: !967, file: !35, line: 89, column: 33)
!982 = !DILocation(line: 91, column: 13, scope: !981, inlinedAt: !976)
!983 = !DILocation(line: 93, column: 20, scope: !981, inlinedAt: !976)
!984 = !DILocation(line: 93, column: 34, scope: !981, inlinedAt: !976)
!985 = !DILocation(line: 93, column: 13, scope: !981, inlinedAt: !976)
!986 = !DILocation(line: 95, column: 20, scope: !981, inlinedAt: !976)
!987 = !DILocation(line: 95, column: 35, scope: !981, inlinedAt: !976)
!988 = !{!989, !989, i64 0}
!989 = !{!"short", !104, i64 0}
!990 = !DILocation(line: 95, column: 13, scope: !981, inlinedAt: !976)
!991 = !DILocation(line: 97, column: 20, scope: !981, inlinedAt: !976)
!992 = !DILocation(line: 97, column: 35, scope: !981, inlinedAt: !976)
!993 = !DILocation(line: 97, column: 13, scope: !981, inlinedAt: !976)
!994 = !DILocation(line: 99, column: 20, scope: !981, inlinedAt: !976)
!995 = !DILocation(line: 99, column: 35, scope: !981, inlinedAt: !976)
!996 = !DILocation(line: 99, column: 13, scope: !981, inlinedAt: !976)
!997 = !DILocation(line: 0, scope: !981, inlinedAt: !976)
!998 = !DILocation(line: 415, column: 12, scope: !704)
!999 = !DILocation(line: 416, column: 9, scope: !704)
!1000 = !DILocation(line: 419, column: 9, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !704, file: !3, line: 419, column: 9)
!1002 = !DILocation(line: 419, column: 14, scope: !1001)
!1003 = !DILocation(line: 419, column: 24, scope: !1001)
!1004 = !DILocation(line: 419, column: 21, scope: !1001)
!1005 = !DILocation(line: 419, column: 37, scope: !1001)
!1006 = !DILocation(line: 421, column: 20, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !704, file: !3, line: 421, column: 9)
!1008 = !DILocation(line: 421, column: 33, scope: !1007)
!1009 = !DILocation(line: 412, column: 15, scope: !704)
!1010 = !DILocation(line: 421, column: 9, scope: !1007)
!1011 = !DILocation(line: 421, column: 52, scope: !1007)
!1012 = !DILocation(line: 421, column: 9, scope: !704)
!1013 = !DILocation(line: 422, column: 9, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 421, column: 58)
!1015 = !DILocation(line: 423, column: 9, scope: !1014)
!1016 = !DILocation(line: 427, column: 9, scope: !704)
!1017 = !DILocation(line: 427, column: 29, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !704, file: !3, line: 427, column: 9)
!1019 = !DILocation(line: 427, column: 26, scope: !1018)
!1020 = !{!1021, !1021, i64 0}
!1021 = !{!"long long", !104, i64 0}
!1022 = !DILocation(line: 427, column: 18, scope: !1018)
!1023 = !DILocation(line: 430, column: 10, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !704, file: !3, line: 430, column: 9)
!1025 = !DILocation(line: 430, column: 61, scope: !1024)
!1026 = !DILocation(line: 430, column: 23, scope: !1024)
!1027 = !DILocation(line: 432, column: 9, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 431, column: 5)
!1029 = !DILocation(line: 433, column: 9, scope: !1028)
!1030 = !DILocation(line: 436, column: 13, scope: !704)
!1031 = !DILocation(line: 437, column: 5, scope: !704)
!1032 = !DILocation(line: 0, scope: !704)
!1033 = !DILocation(line: 438, column: 1, scope: !704)
!1034 = distinct !DISubprogram(name: "getBitfieldTypeFromArgument", scope: !3, file: !3, line: 447, type: !1035, isLocal: false, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1037)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!242, !707, !817, !853, !853}
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1038 = !DILocalVariable(name: "c", arg: 1, scope: !1034, file: !3, line: 447, type: !707)
!1039 = !DILocalVariable(name: "o", arg: 2, scope: !1034, file: !3, line: 447, type: !817)
!1040 = !DILocalVariable(name: "sign", arg: 3, scope: !1034, file: !3, line: 447, type: !853)
!1041 = !DILocalVariable(name: "bits", arg: 4, scope: !1034, file: !3, line: 447, type: !853)
!1042 = !DILocalVariable(name: "p", scope: !1034, file: !3, line: 448, type: !828)
!1043 = !DILocalVariable(name: "err", scope: !1034, file: !3, line: 449, type: !828)
!1044 = !DILocalVariable(name: "llbits", scope: !1034, file: !3, line: 450, type: !786)
!1045 = !DILocation(line: 447, column: 41, scope: !1034)
!1046 = !DILocation(line: 447, column: 50, scope: !1034)
!1047 = !DILocation(line: 447, column: 58, scope: !1034)
!1048 = !DILocation(line: 447, column: 69, scope: !1034)
!1049 = !DILocation(line: 448, column: 18, scope: !1034)
!1050 = !DILocation(line: 448, column: 11, scope: !1034)
!1051 = !DILocation(line: 450, column: 5, scope: !1034)
!1052 = !DILocation(line: 452, column: 9, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 452, column: 9)
!1054 = !DILocation(line: 452, column: 9, scope: !1034)
!1055 = !DILocation(line: 457, column: 9, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 456, column: 12)
!1057 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 454, column: 16)
!1058 = !DILocation(line: 458, column: 9, scope: !1056)
!1059 = !DILocation(line: 0, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 452, column: 22)
!1061 = !DILocation(line: 461, column: 21, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 461, column: 9)
!1063 = !DILocation(line: 461, column: 24, scope: !1062)
!1064 = !DILocation(line: 450, column: 15, scope: !1034)
!1065 = !DILocation(line: 461, column: 10, scope: !1062)
!1066 = !DILocation(line: 461, column: 46, scope: !1062)
!1067 = !DILocation(line: 462, column: 9, scope: !1062)
!1068 = !DILocation(line: 462, column: 16, scope: !1062)
!1069 = !DILocation(line: 461, column: 51, scope: !1062)
!1070 = !DILocation(line: 463, column: 10, scope: !1062)
!1071 = !DILocation(line: 463, column: 16, scope: !1062)
!1072 = !DILocation(line: 463, column: 31, scope: !1062)
!1073 = !DILocation(line: 463, column: 21, scope: !1062)
!1074 = !DILocation(line: 464, column: 16, scope: !1062)
!1075 = !DILocation(line: 464, column: 31, scope: !1062)
!1076 = !DILocation(line: 464, column: 21, scope: !1062)
!1077 = !DILocation(line: 466, column: 9, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 465, column: 5)
!1079 = !DILocation(line: 467, column: 9, scope: !1078)
!1080 = !DILocation(line: 469, column: 13, scope: !1034)
!1081 = !DILocation(line: 469, column: 11, scope: !1034)
!1082 = !DILocation(line: 470, column: 5, scope: !1034)
!1083 = !DILocation(line: 0, scope: !1056)
!1084 = !DILocation(line: 471, column: 1, scope: !1034)
!1085 = distinct !DISubprogram(name: "lookupStringForBitCommand", scope: !3, file: !3, line: 478, type: !1086, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1088)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!817, !707, !6}
!1088 = !{!1089, !1090, !1091, !1092}
!1089 = !DILocalVariable(name: "c", arg: 1, scope: !1085, file: !3, line: 478, type: !707)
!1090 = !DILocalVariable(name: "maxbit", arg: 2, scope: !1085, file: !3, line: 478, type: !6)
!1091 = !DILocalVariable(name: "byte", scope: !1085, file: !3, line: 479, type: !6)
!1092 = !DILocalVariable(name: "o", scope: !1085, file: !3, line: 480, type: !817)
!1093 = !DILocation(line: 478, column: 41, scope: !1085)
!1094 = !DILocation(line: 478, column: 51, scope: !1085)
!1095 = !DILocation(line: 479, column: 26, scope: !1085)
!1096 = !DILocation(line: 479, column: 12, scope: !1085)
!1097 = !DILocation(line: 480, column: 33, scope: !1085)
!1098 = !{!1099, !964, i64 16}
!1099 = !{!"client", !291, i64 0, !119, i64 8, !964, i64 16, !964, i64 24, !964, i64 32, !291, i64 40, !964, i64 48, !291, i64 56, !119, i64 64, !964, i64 72, !964, i64 80, !964, i64 88, !119, i64 96, !119, i64 100, !291, i64 104, !964, i64 112, !1021, i64 120, !291, i64 128, !291, i64 136, !291, i64 144, !291, i64 152, !119, i64 160, !119, i64 164, !119, i64 168, !119, i64 172, !119, i64 176, !291, i64 184, !291, i64 192, !964, i64 200, !1021, i64 208, !1021, i64 216, !1021, i64 224, !1021, i64 232, !1021, i64 240, !104, i64 248, !119, i64 292, !104, i64 296, !119, i64 344, !1100, i64 352, !119, i64 384, !1101, i64 392, !1021, i64 480, !964, i64 488, !964, i64 496, !964, i64 504, !964, i64 512, !964, i64 520, !119, i64 528, !104, i64 532}
!1100 = !{!"multiState", !964, i64 0, !119, i64 8, !119, i64 12, !119, i64 16, !291, i64 24}
!1101 = !{!"blockingState", !1021, i64 0, !964, i64 8, !964, i64 16, !291, i64 24, !964, i64 32, !964, i64 40, !1021, i64 48, !1021, i64 56, !119, i64 64, !119, i64 68, !1021, i64 72, !964, i64 80}
!1102 = !DILocation(line: 480, column: 39, scope: !1085)
!1103 = !{!1099, !964, i64 72}
!1104 = !DILocation(line: 480, column: 36, scope: !1085)
!1105 = !{!964, !964, i64 0}
!1106 = !DILocation(line: 480, column: 15, scope: !1085)
!1107 = !DILocation(line: 480, column: 11, scope: !1085)
!1108 = !DILocation(line: 482, column: 11, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 482, column: 9)
!1110 = !DILocation(line: 482, column: 9, scope: !1085)
!1111 = !DILocation(line: 483, column: 57, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 482, column: 20)
!1113 = !DILocation(line: 483, column: 37, scope: !1112)
!1114 = !DILocation(line: 483, column: 13, scope: !1112)
!1115 = !DILocation(line: 484, column: 18, scope: !1112)
!1116 = !DILocation(line: 484, column: 24, scope: !1112)
!1117 = !DILocation(line: 484, column: 21, scope: !1112)
!1118 = !DILocation(line: 484, column: 9, scope: !1112)
!1119 = !DILocation(line: 485, column: 5, scope: !1112)
!1120 = !DILocation(line: 486, column: 13, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 486, column: 13)
!1122 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 485, column: 12)
!1123 = !DILocation(line: 486, column: 13, scope: !1122)
!1124 = !DILocation(line: 487, column: 37, scope: !1122)
!1125 = !DILocation(line: 487, column: 43, scope: !1122)
!1126 = !DILocation(line: 487, column: 40, scope: !1122)
!1127 = !DILocation(line: 487, column: 13, scope: !1122)
!1128 = !DILocation(line: 488, column: 33, scope: !1122)
!1129 = !DILocation(line: 488, column: 41, scope: !1122)
!1130 = !DILocation(line: 488, column: 18, scope: !1122)
!1131 = !DILocation(line: 488, column: 16, scope: !1122)
!1132 = !DILocation(line: 0, scope: !1121)
!1133 = !DILocation(line: 491, column: 1, scope: !1085)
!1134 = distinct !DISubprogram(name: "getObjectReadOnlyString", scope: !3, file: !3, line: 506, type: !1135, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1138)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!22, !817, !1137, !828}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!1138 = !{!1139, !1140, !1141, !1142}
!1139 = !DILocalVariable(name: "o", arg: 1, scope: !1134, file: !3, line: 506, type: !817)
!1140 = !DILocalVariable(name: "len", arg: 2, scope: !1134, file: !3, line: 506, type: !1137)
!1141 = !DILocalVariable(name: "llbuf", arg: 3, scope: !1134, file: !3, line: 506, type: !828)
!1142 = !DILocalVariable(name: "p", scope: !1134, file: !3, line: 508, type: !22)
!1143 = !DILocation(line: 506, column: 46, scope: !1134)
!1144 = !DILocation(line: 506, column: 55, scope: !1134)
!1145 = !DILocation(line: 506, column: 66, scope: !1134)
!1146 = !DILocation(line: 507, column: 5, scope: !1134)
!1147 = !DILocation(line: 508, column: 20, scope: !1134)
!1148 = !DILocation(line: 512, column: 17, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 512, column: 9)
!1150 = !DILocation(line: 512, column: 26, scope: !1149)
!1151 = !DILocation(line: 512, column: 11, scope: !1149)
!1152 = !DILocation(line: 514, column: 13, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 514, column: 13)
!1154 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 512, column: 47)
!1155 = !DILocation(line: 514, column: 13, scope: !1154)
!1156 = !DILocation(line: 514, column: 64, scope: !1153)
!1157 = !DILocation(line: 514, column: 25, scope: !1153)
!1158 = !DILocation(line: 514, column: 23, scope: !1153)
!1159 = !DILocation(line: 514, column: 18, scope: !1153)
!1160 = !DILocation(line: 516, column: 33, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 515, column: 19)
!1162 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 515, column: 16)
!1163 = !DILocation(line: 517, column: 13, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 517, column: 13)
!1165 = !DILocation(line: 517, column: 13, scope: !1161)
!1166 = !DILocation(line: 87, column: 39, scope: !967, inlinedAt: !1167)
!1167 = distinct !DILocation(line: 517, column: 25, scope: !1164)
!1168 = !DILocation(line: 88, column: 27, scope: !967, inlinedAt: !1167)
!1169 = !DILocation(line: 88, column: 19, scope: !967, inlinedAt: !1167)
!1170 = !DILocation(line: 89, column: 5, scope: !967, inlinedAt: !1167)
!1171 = !DILocation(line: 91, column: 20, scope: !981, inlinedAt: !1167)
!1172 = !DILocation(line: 91, column: 13, scope: !981, inlinedAt: !1167)
!1173 = !DILocation(line: 93, column: 20, scope: !981, inlinedAt: !1167)
!1174 = !DILocation(line: 93, column: 34, scope: !981, inlinedAt: !1167)
!1175 = !DILocation(line: 93, column: 13, scope: !981, inlinedAt: !1167)
!1176 = !DILocation(line: 95, column: 20, scope: !981, inlinedAt: !1167)
!1177 = !DILocation(line: 95, column: 35, scope: !981, inlinedAt: !1167)
!1178 = !DILocation(line: 95, column: 13, scope: !981, inlinedAt: !1167)
!1179 = !DILocation(line: 97, column: 20, scope: !981, inlinedAt: !1167)
!1180 = !DILocation(line: 97, column: 35, scope: !981, inlinedAt: !1167)
!1181 = !DILocation(line: 97, column: 13, scope: !981, inlinedAt: !1167)
!1182 = !DILocation(line: 99, column: 20, scope: !981, inlinedAt: !1167)
!1183 = !DILocation(line: 99, column: 35, scope: !981, inlinedAt: !1167)
!1184 = !DILocation(line: 99, column: 13, scope: !981, inlinedAt: !1167)
!1185 = !DILocation(line: 0, scope: !981, inlinedAt: !1167)
!1186 = !DILocation(line: 517, column: 23, scope: !1164)
!1187 = !DILocation(line: 517, column: 18, scope: !1164)
!1188 = !DILocation(line: 0, scope: !1134)
!1189 = !DILocation(line: 521, column: 5, scope: !1134)
!1190 = distinct !DISubprogram(name: "setbitCommand", scope: !3, file: !3, line: 525, type: !843, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, unit: !13, retainedNodes: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196, !1199, !1200, !1201, !1202}
!1192 = !DILocalVariable(name: "c", arg: 1, scope: !1190, file: !3, line: 525, type: !707)
!1193 = !DILocalVariable(name: "o", scope: !1190, file: !3, line: 526, type: !817)
!1194 = !DILocalVariable(name: "err", scope: !1190, file: !3, line: 527, type: !828)
!1195 = !DILocalVariable(name: "bitoffset", scope: !1190, file: !3, line: 528, type: !6)
!1196 = !DILocalVariable(name: "byte", scope: !1190, file: !3, line: 529, type: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !878, line: 200, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !9, line: 145, baseType: !12)
!1199 = !DILocalVariable(name: "bit", scope: !1190, file: !3, line: 529, type: !1197)
!1200 = !DILocalVariable(name: "byteval", scope: !1190, file: !3, line: 530, type: !242)
!1201 = !DILocalVariable(name: "bitval", scope: !1190, file: !3, line: 530, type: !242)
!1202 = !DILocalVariable(name: "on", scope: !1190, file: !3, line: 531, type: !12)
!1203 = !DILocation(line: 525, column: 28, scope: !1190)
!1204 = !DILocation(line: 531, column: 5, scope: !1190)
!1205 = !DILocation(line: 533, column: 39, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 533, column: 9)
!1207 = !DILocation(line: 533, column: 36, scope: !1206)
!1208 = !DILocation(line: 411, column: 38, scope: !704, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 533, column: 9, scope: !1206)
!1210 = !DILocation(line: 411, column: 47, scope: !704, inlinedAt: !1209)
!1211 = !DILocation(line: 411, column: 70, scope: !704, inlinedAt: !1209)
!1212 = !DILocation(line: 411, column: 80, scope: !704, inlinedAt: !1209)
!1213 = !DILocation(line: 412, column: 5, scope: !704, inlinedAt: !1209)
!1214 = !DILocation(line: 414, column: 18, scope: !704, inlinedAt: !1209)
!1215 = !DILocation(line: 414, column: 11, scope: !704, inlinedAt: !1209)
!1216 = !DILocation(line: 87, column: 39, scope: !967, inlinedAt: !1217)
!1217 = distinct !DILocation(line: 415, column: 19, scope: !704, inlinedAt: !1209)
!1218 = !DILocation(line: 88, column: 27, scope: !967, inlinedAt: !1217)
!1219 = !DILocation(line: 88, column: 19, scope: !967, inlinedAt: !1217)
!1220 = !DILocation(line: 89, column: 5, scope: !967, inlinedAt: !1217)
!1221 = !DILocation(line: 91, column: 20, scope: !981, inlinedAt: !1217)
!1222 = !DILocation(line: 91, column: 13, scope: !981, inlinedAt: !1217)
!1223 = !DILocation(line: 93, column: 20, scope: !981, inlinedAt: !1217)
!1224 = !DILocation(line: 93, column: 34, scope: !981, inlinedAt: !1217)
!1225 = !DILocation(line: 93, column: 13, scope: !981, inlinedAt: !1217)
!1226 = !DILocation(line: 95, column: 20, scope: !981, inlinedAt: !1217)
!1227 = !DILocation(line: 95, column: 35, scope: !981, inlinedAt: !1217)
!1228 = !DILocation(line: 95, column: 13, scope: !981, inlinedAt: !1217)
!1229 = !DILocation(line: 97, column: 20, scope: !981, inlinedAt: !1217)
!1230 = !DILocation(line: 97, column: 35, scope: !981, inlinedAt: !1217)
!1231 = !DILocation(line: 97, column: 13, scope: !981, inlinedAt: !1217)
!1232 = !DILocation(line: 99, column: 20, scope: !981, inlinedAt: !1217)
!1233 = !DILocation(line: 99, column: 35, scope: !981, inlinedAt: !1217)
!1234 = !DILocation(line: 99, column: 13, scope: !981, inlinedAt: !1217)
!1235 = !DILocation(line: 0, scope: !981, inlinedAt: !1217)
!1236 = !DILocation(line: 415, column: 12, scope: !704, inlinedAt: !1209)
!1237 = !DILocation(line: 416, column: 9, scope: !704, inlinedAt: !1209)
!1238 = !DILocation(line: 412, column: 15, scope: !704, inlinedAt: !1209)
!1239 = !DILocation(line: 421, column: 9, scope: !1007, inlinedAt: !1209)
!1240 = !DILocation(line: 421, column: 52, scope: !1007, inlinedAt: !1209)
!1241 = !DILocation(line: 421, column: 9, scope: !704, inlinedAt: !1209)
!1242 = !DILocation(line: 422, column: 9, scope: !1014, inlinedAt: !1209)
!1243 = !DILocation(line: 423, column: 9, scope: !1014, inlinedAt: !1209)
!1244 = !DILocation(line: 430, column: 10, scope: !1024, inlinedAt: !1209)
!1245 = !DILocation(line: 430, column: 61, scope: !1024, inlinedAt: !1209)
!1246 = !DILocation(line: 430, column: 23, scope: !1024, inlinedAt: !1209)
!1247 = !DILocation(line: 432, column: 9, scope: !1028, inlinedAt: !1209)
!1248 = !DILocation(line: 433, column: 9, scope: !1028, inlinedAt: !1209)
!1249 = !DILocation(line: 438, column: 1, scope: !704, inlinedAt: !1209)
!1250 = !DILocation(line: 533, column: 9, scope: !1190)
!1251 = !DILocation(line: 536, column: 39, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 536, column: 9)
!1253 = !DILocation(line: 536, column: 36, scope: !1252)
!1254 = !DILocation(line: 531, column: 10, scope: !1190)
!1255 = !DILocation(line: 536, column: 9, scope: !1252)
!1256 = !DILocation(line: 536, column: 56, scope: !1252)
!1257 = !DILocation(line: 536, column: 9, scope: !1190)
!1258 = !DILocation(line: 540, column: 9, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 540, column: 9)
!1260 = !DILocation(line: 540, column: 12, scope: !1259)
!1261 = !DILocation(line: 540, column: 9, scope: !1190)
!1262 = !DILocation(line: 541, column: 9, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 540, column: 18)
!1264 = !DILocation(line: 542, column: 9, scope: !1263)
!1265 = !DILocation(line: 528, column: 12, scope: !1190)
!1266 = !DILocation(line: 545, column: 14, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 545, column: 9)
!1268 = !DILocation(line: 526, column: 11, scope: !1190)
!1269 = !DILocation(line: 545, column: 54, scope: !1267)
!1270 = !DILocation(line: 545, column: 9, scope: !1190)
!1271 = !DILocation(line: 548, column: 22, scope: !1190)
!1272 = !DILocation(line: 529, column: 13, scope: !1190)
!1273 = !DILocation(line: 549, column: 29, scope: !1190)
!1274 = !DILocation(line: 549, column: 15, scope: !1190)
!1275 = !DILocation(line: 530, column: 9, scope: !1190)
!1276 = !DILocation(line: 550, column: 26, scope: !1190)
!1277 = !DILocation(line: 550, column: 13, scope: !1190)
!1278 = !DILocation(line: 529, column: 19, scope: !1190)
!1279 = !DILocation(line: 551, column: 27, scope: !1190)
!1280 = !DILocation(line: 551, column: 22, scope: !1190)
!1281 = !DILocation(line: 530, column: 18, scope: !1190)
!1282 = !DILocation(line: 554, column: 16, scope: !1190)
!1283 = !DILocation(line: 554, column: 13, scope: !1190)
!1284 = !DILocation(line: 555, column: 18, scope: !1190)
!1285 = !DILocation(line: 555, column: 21, scope: !1190)
!1286 = !DILocation(line: 555, column: 28, scope: !1190)
!1287 = !DILocation(line: 555, column: 13, scope: !1190)
!1288 = !DILocation(line: 556, column: 32, scope: !1190)
!1289 = !DILocation(line: 556, column: 30, scope: !1190)
!1290 = !DILocation(line: 557, column: 26, scope: !1190)
!1291 = !DILocation(line: 557, column: 32, scope: !1190)
!1292 = !DILocation(line: 557, column: 29, scope: !1190)
!1293 = !DILocation(line: 557, column: 5, scope: !1190)
!1294 = !DILocation(line: 558, column: 51, scope: !1190)
!1295 = !DILocation(line: 558, column: 48, scope: !1190)
!1296 = !DILocation(line: 558, column: 62, scope: !1190)
!1297 = !DILocation(line: 558, column: 66, scope: !1190)
!1298 = !{!1299, !119, i64 40}
!1299 = !{!"redisDb", !964, i64 0, !964, i64 8, !964, i64 16, !964, i64 24, !964, i64 32, !119, i64 40, !1021, i64 48, !964, i64 56}
!1300 = !DILocation(line: 558, column: 5, scope: !1190)
!1301 = !DILocation(line: 559, column: 17, scope: !1190)
!1302 = !{!1303, !1021, i64 2080}
