; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/blocked.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/blocked.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/blocked.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !22, !32, !42}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !7, line: 51, size: 24, elements: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !{!9, !15, !16, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !6, file: !7, line: 52, baseType: !10, size: 8)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 24, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !13, line: 43, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !6, file: !7, line: 53, baseType: !10, size: 8, offset: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !6, file: !7, line: 54, baseType: !14, size: 8, offset: 16)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !6, file: !7, line: 55, baseType: !18, offset: 24)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !{!21}
!21 = !DISubrange(count: -1)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !7, line: 57, size: 40, elements: !24)
!24 = !{!25, !29, !30, !31}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !23, file: !7, line: 58, baseType: !26, size: 16)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 36, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !13, line: 57, baseType: !28)
!28 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !23, file: !7, line: 59, baseType: !26, size: 16, offset: 16)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !7, line: 60, baseType: !14, size: 8, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !23, file: !7, line: 61, baseType: !18, offset: 40)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !7, line: 63, size: 72, elements: !34)
!34 = !{!35, !39, !40, !41}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !33, file: !7, line: 64, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 48, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !13, line: 79, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !33, file: !7, line: 65, baseType: !36, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !7, line: 66, baseType: !14, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !7, line: 67, baseType: !18, offset: 72)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !7, line: 69, size: 136, elements: !44)
!44 = !{!45, !49, !50, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !7, line: 70, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 60, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !13, line: 105, baseType: !48)
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !43, file: !7, line: 71, baseType: !46, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !7, line: 72, baseType: !14, size: 8, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !43, file: !7, line: 73, baseType: !18, offset: 136)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "getTimeoutFromObjectOrReply", scope: !1, file: !1, line: 78, type: !57, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !305)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !60, !173, !304, !59}
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !62, line: 780, baseType: !63)
!62 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !62, line: 723, size: 135360, elements: !64)
!64 = !{!65, !66, !67, !172, !182, !185, !190, !191, !192, !193, !195, !219, !220, !221, !222, !223, !224, !226, !227, !230, !231, !232, !233, !234, !235, !236, !237, !242, !243, !244, !245, !246, !247, !248, !249, !253, !254, !258, !259, !275, !276, !293, !294, !295, !296, !297, !298, !299, !300}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !62, line: 724, baseType: !46, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !63, file: !62, line: 725, baseType: !59, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !63, file: !62, line: 726, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !62, line: 656, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !62, line: 647, size: 512, elements: !71)
!71 = !{!72, !136, !137, !138, !139, !140, !141, !143}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !70, file: !62, line: 648, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !75, line: 82, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !75, line: 76, size: 768, elements: !77)
!77 = !{!78, !103, !104, !134, !135}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !75, line: 77, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !75, line: 65, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !75, line: 58, size: 384, elements: !82)
!82 = !{!83, !89, !93, !94, !98, !102}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !81, file: !75, line: 59, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!46, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !81, file: !75, line: 60, baseType: !90, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!4, !4, !87}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !81, file: !75, line: 61, baseType: !90, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !81, file: !75, line: 62, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!59, !4, !87, !87}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !81, file: !75, line: 63, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !4, !4}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !81, file: !75, line: 64, baseType: !99, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !76, file: !75, line: 78, baseType: !4, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !76, file: !75, line: 79, baseType: !105, size: 512, offset: 128)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, elements: !132)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !75, line: 74, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !75, line: 69, size: 256, elements: !108)
!108 = !{!109, !129, !130, !131}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !107, file: !75, line: 70, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !75, line: 56, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !75, line: 47, size: 192, elements: !114)
!114 = !{!115, !116, !127}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !75, line: 48, baseType: !4, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !113, file: !75, line: 54, baseType: !117, size: 64, offset: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !75, line: 49, size: 64, elements: !118)
!118 = !{!119, !120, !121, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !117, file: !75, line: 50, baseType: !4, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !117, file: !75, line: 51, baseType: !46, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !117, file: !75, line: 52, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !11, line: 56, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !13, line: 103, baseType: !124)
!124 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !117, file: !75, line: 53, baseType: !126, size: 64)
!126 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !75, line: 55, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !107, file: !75, line: 71, baseType: !48, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !107, file: !75, line: 72, baseType: !48, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !107, file: !75, line: 73, baseType: !48, size: 64, offset: 192)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !76, file: !75, line: 80, baseType: !124, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !76, file: !75, line: 81, baseType: !48, size: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !70, file: !62, line: 649, baseType: !73, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !70, file: !62, line: 650, baseType: !73, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !70, file: !62, line: 651, baseType: !73, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !70, file: !62, line: 652, baseType: !73, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !62, line: 653, baseType: !59, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !70, file: !62, line: 654, baseType: !142, size: 64, offset: 384)
!142 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !70, file: !62, line: 655, baseType: !144, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !146, line: 54, baseType: !147)
!146 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !146, line: 47, size: 384, elements: !148)
!148 = !{!149, !158, !159, !163, !167, !171}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !147, file: !146, line: 48, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !146, line: 40, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !146, line: 36, size: 192, elements: !153)
!153 = !{!154, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !146, line: 37, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !146, line: 38, baseType: !155, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !146, line: 39, baseType: !4, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !146, line: 49, baseType: !150, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !147, file: !146, line: 50, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!4, !4}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !147, file: !146, line: 51, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !4}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !147, file: !146, line: 52, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!59, !4, !4}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !147, file: !146, line: 53, baseType: !48, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !62, line: 727, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !62, line: 622, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !62, line: 614, size: 128, elements: !176)
!176 = !{!177, !178, !179, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !62, line: 615, baseType: !38, size: 4, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !175, file: !62, line: 616, baseType: !38, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !175, file: !62, line: 617, baseType: !38, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !175, file: !62, line: 620, baseType: !59, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !175, file: !62, line: 621, baseType: !4, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !63, file: !62, line: 728, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !7, line: 43, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !63, file: !62, line: 729, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !187, line: 40, baseType: !188)
!187 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !189, line: 129, baseType: !48)
!189 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !63, file: !62, line: 730, baseType: !183, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !63, file: !62, line: 734, baseType: !186, size: 64, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !63, file: !62, line: 735, baseType: !59, size: 32, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !63, file: !62, line: 736, baseType: !194, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !63, file: !62, line: 737, baseType: !196, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !62, line: 1307, size: 640, elements: !198)
!198 = !{!199, !200, !205, !206, !207, !208, !214, !215, !216, !217, !218}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !62, line: 1308, baseType: !184, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !197, file: !62, line: 1309, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !62, line: 1305, baseType: !203)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !60}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !197, file: !62, line: 1310, baseType: !59, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !197, file: !62, line: 1311, baseType: !184, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !62, line: 1312, baseType: !59, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !197, file: !62, line: 1315, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !62, line: 1306, baseType: !211)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !196, !194, !59, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !197, file: !62, line: 1317, baseType: !59, size: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !197, file: !62, line: 1318, baseType: !59, size: 32, offset: 416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !197, file: !62, line: 1319, baseType: !59, size: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !197, file: !62, line: 1320, baseType: !142, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !197, file: !62, line: 1320, baseType: !142, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !63, file: !62, line: 737, baseType: !196, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !63, file: !62, line: 738, baseType: !59, size: 32, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !63, file: !62, line: 739, baseType: !59, size: 32, offset: 800)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !63, file: !62, line: 740, baseType: !124, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !63, file: !62, line: 741, baseType: !144, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !63, file: !62, line: 742, baseType: !225, size: 64, offset: 960)
!225 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !63, file: !62, line: 743, baseType: !186, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !63, file: !62, line: 745, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !229, line: 34, baseType: !124)
!229 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !63, file: !62, line: 746, baseType: !228, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !63, file: !62, line: 747, baseType: !228, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !62, line: 748, baseType: !59, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !63, file: !62, line: 749, baseType: !59, size: 32, offset: 1312)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !63, file: !62, line: 750, baseType: !59, size: 32, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !63, file: !62, line: 751, baseType: !59, size: 32, offset: 1376)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !63, file: !62, line: 752, baseType: !59, size: 32, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !63, file: !62, line: 753, baseType: !238, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !239, line: 173, baseType: !240)
!239 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !189, line: 100, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !189, line: 44, baseType: !124)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !63, file: !62, line: 754, baseType: !238, size: 64, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !63, file: !62, line: 755, baseType: !183, size: 64, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !63, file: !62, line: 756, baseType: !142, size: 64, offset: 1664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !63, file: !62, line: 757, baseType: !142, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !63, file: !62, line: 758, baseType: !142, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !63, file: !62, line: 759, baseType: !142, size: 64, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !63, file: !62, line: 760, baseType: !142, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !63, file: !62, line: 763, baseType: !250, size: 328, offset: 1984)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 328, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 41)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !63, file: !62, line: 764, baseType: !59, size: 32, offset: 2336)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !63, file: !62, line: 765, baseType: !255, size: 368, offset: 2368)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 368, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 46)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !63, file: !62, line: 766, baseType: !59, size: 32, offset: 2752)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !63, file: !62, line: 767, baseType: !260, size: 256, offset: 2816)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !62, line: 673, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !62, line: 665, size: 256, elements: !262)
!262 = !{!263, !271, !272, !273, !274}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !261, file: !62, line: 666, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !62, line: 663, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !62, line: 659, size: 192, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !266, file: !62, line: 660, baseType: !194, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !266, file: !62, line: 661, baseType: !59, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !266, file: !62, line: 662, baseType: !196, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !62, line: 667, baseType: !59, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !261, file: !62, line: 668, baseType: !59, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !261, file: !62, line: 671, baseType: !59, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !261, file: !62, line: 672, baseType: !228, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !63, file: !62, line: 768, baseType: !59, size: 32, offset: 3072)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !63, file: !62, line: 769, baseType: !277, size: 704, offset: 3136)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !62, line: 703, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !62, line: 677, size: 704, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !278, file: !62, line: 679, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !62, line: 52, baseType: !142)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !278, file: !62, line: 683, baseType: !73, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !278, file: !62, line: 685, baseType: !173, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !278, file: !62, line: 689, baseType: !186, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !278, file: !62, line: 690, baseType: !173, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !278, file: !62, line: 691, baseType: !173, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !278, file: !62, line: 692, baseType: !281, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !278, file: !62, line: 692, baseType: !281, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !278, file: !62, line: 693, baseType: !59, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !278, file: !62, line: 696, baseType: !59, size: 32, offset: 544)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !278, file: !62, line: 697, baseType: !142, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !278, file: !62, line: 700, baseType: !4, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !63, file: !62, line: 770, baseType: !142, size: 64, offset: 3840)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !63, file: !62, line: 771, baseType: !144, size: 64, offset: 3904)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !63, file: !62, line: 772, baseType: !73, size: 64, offset: 3968)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !63, file: !62, line: 773, baseType: !144, size: 64, offset: 4032)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !63, file: !62, line: 774, baseType: !183, size: 64, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !63, file: !62, line: 775, baseType: !150, size: 64, offset: 4160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !63, file: !62, line: 778, baseType: !59, size: 32, offset: 4224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !63, file: !62, line: 779, baseType: !301, size: 131072, offset: 4256)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 131072, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 16384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DILocalVariable(name: "c", arg: 1, scope: !56, file: !1, line: 78, type: !60)
!307 = !DILocalVariable(name: "object", arg: 2, scope: !56, file: !1, line: 78, type: !173)
!308 = !DILocalVariable(name: "timeout", arg: 3, scope: !56, file: !1, line: 78, type: !304)
!309 = !DILocalVariable(name: "unit", arg: 4, scope: !56, file: !1, line: 78, type: !59)
!310 = !DILocalVariable(name: "tval", scope: !56, file: !1, line: 79, type: !142)
!311 = !DILocation(line: 78, column: 41, scope: !56)
!312 = !DILocation(line: 78, column: 50, scope: !56)
!313 = !DILocation(line: 78, column: 68, scope: !56)
!314 = !DILocation(line: 78, column: 81, scope: !56)
!315 = !DILocation(line: 79, column: 5, scope: !56)
!316 = !DILocation(line: 79, column: 15, scope: !56)
!317 = !DILocation(line: 81, column: 9, scope: !318)
!318 = distinct !DILexicalBlock(scope: !56, file: !1, line: 81, column: 9)
!319 = !DILocation(line: 82, column: 54, scope: !318)
!320 = !DILocation(line: 81, column: 9, scope: !56)
!321 = !DILocation(line: 85, column: 9, scope: !322)
!322 = distinct !DILexicalBlock(scope: !56, file: !1, line: 85, column: 9)
!323 = !{!324, !324, i64 0}
!324 = !{!"long long", !325, i64 0}
!325 = !{!"omnipotent char", !326, i64 0}
!326 = !{!"Simple C/C++ TBAA"}
!327 = !DILocation(line: 85, column: 14, scope: !322)
!328 = !DILocation(line: 85, column: 9, scope: !56)
!329 = !DILocation(line: 86, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !322, file: !1, line: 85, column: 19)
!331 = !DILocation(line: 87, column: 9, scope: !330)
!332 = !DILocation(line: 90, column: 14, scope: !333)
!333 = distinct !DILexicalBlock(scope: !56, file: !1, line: 90, column: 9)
!334 = !DILocation(line: 90, column: 9, scope: !56)
!335 = !DILocation(line: 91, column: 18, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !1, line: 91, column: 13)
!337 = distinct !DILexicalBlock(scope: !333, file: !1, line: 90, column: 19)
!338 = !DILocation(line: 91, column: 13, scope: !337)
!339 = !DILocation(line: 91, column: 40, scope: !336)
!340 = !DILocation(line: 91, column: 35, scope: !336)
!341 = !DILocation(line: 92, column: 17, scope: !337)
!342 = !DILocation(line: 92, column: 14, scope: !337)
!343 = !DILocation(line: 93, column: 5, scope: !337)
!344 = !DILocation(line: 94, column: 16, scope: !56)
!345 = !DILocation(line: 94, column: 14, scope: !56)
!346 = !DILocation(line: 96, column: 5, scope: !56)
!347 = !DILocation(line: 0, scope: !56)
!348 = !DILocation(line: 97, column: 1, scope: !56)
!349 = distinct !DISubprogram(name: "blockClient", scope: !1, file: !1, line: 102, type: !350, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !60, !59}
!352 = !{!353, !354}
!353 = !DILocalVariable(name: "c", arg: 1, scope: !349, file: !1, line: 102, type: !60)
!354 = !DILocalVariable(name: "btype", arg: 2, scope: !349, file: !1, line: 102, type: !59)
!355 = !DILocation(line: 102, column: 26, scope: !349)
!356 = !DILocation(line: 102, column: 33, scope: !349)
!357 = !DILocation(line: 103, column: 8, scope: !349)
!358 = !DILocation(line: 103, column: 14, scope: !349)
!359 = !{!360, !362, i64 160}
!360 = !{!"client", !361, i64 0, !362, i64 8, !363, i64 16, !363, i64 24, !363, i64 32, !361, i64 40, !363, i64 48, !361, i64 56, !362, i64 64, !363, i64 72, !363, i64 80, !363, i64 88, !362, i64 96, !362, i64 100, !361, i64 104, !363, i64 112, !324, i64 120, !361, i64 128, !361, i64 136, !361, i64 144, !361, i64 152, !362, i64 160, !362, i64 164, !362, i64 168, !362, i64 172, !362, i64 176, !361, i64 184, !361, i64 192, !363, i64 200, !324, i64 208, !324, i64 216, !324, i64 224, !324, i64 232, !324, i64 240, !325, i64 248, !362, i64 292, !325, i64 296, !362, i64 344, !364, i64 352, !362, i64 384, !365, i64 392, !324, i64 480, !363, i64 488, !363, i64 496, !363, i64 504, !363, i64 512, !363, i64 520, !362, i64 528, !325, i64 532}
!361 = !{!"long", !325, i64 0}
!362 = !{!"int", !325, i64 0}
!363 = !{!"any pointer", !325, i64 0}
!364 = !{!"multiState", !363, i64 0, !362, i64 8, !362, i64 12, !362, i64 16, !361, i64 24}
!365 = !{!"blockingState", !324, i64 0, !363, i64 8, !363, i64 16, !361, i64 24, !363, i64 32, !363, i64 40, !324, i64 48, !324, i64 56, !362, i64 64, !362, i64 68, !324, i64 72, !363, i64 80}
!366 = !DILocation(line: 104, column: 8, scope: !349)
!367 = !DILocation(line: 104, column: 14, scope: !349)
!368 = !{!360, !362, i64 384}
!369 = !DILocation(line: 105, column: 27, scope: !349)
!370 = !{!371, !362, i64 2736}
!371 = !{!"redisServer", !362, i64 0, !363, i64 8, !363, i64 16, !363, i64 24, !362, i64 32, !362, i64 36, !362, i64 40, !363, i64 48, !363, i64 56, !363, i64 64, !363, i64 72, !362, i64 80, !362, i64 84, !362, i64 88, !362, i64 92, !363, i64 96, !363, i64 104, !362, i64 112, !362, i64 116, !325, i64 120, !362, i64 164, !361, i64 168, !362, i64 176, !363, i64 184, !363, i64 192, !363, i64 200, !325, i64 208, !362, i64 216, !362, i64 220, !325, i64 224, !362, i64 352, !363, i64 360, !362, i64 368, !325, i64 372, !362, i64 436, !362, i64 440, !325, i64 444, !362, i64 508, !363, i64 512, !363, i64 520, !363, i64 528, !363, i64 536, !363, i64 544, !363, i64 552, !363, i64 560, !362, i64 568, !324, i64 576, !325, i64 584, !363, i64 840, !361, i64 848, !362, i64 856, !362, i64 860, !361, i64 864, !361, i64 872, !361, i64 880, !361, i64 888, !363, i64 896, !363, i64 904, !363, i64 912, !363, i64 920, !363, i64 928, !363, i64 936, !363, i64 944, !363, i64 952, !363, i64 960, !363, i64 968, !363, i64 976, !363, i64 984, !363, i64 992, !361, i64 1000, !324, i64 1008, !324, i64 1016, !324, i64 1024, !372, i64 1032, !324, i64 1040, !324, i64 1048, !324, i64 1056, !324, i64 1064, !324, i64 1072, !324, i64 1080, !324, i64 1088, !324, i64 1096, !324, i64 1104, !361, i64 1112, !324, i64 1120, !372, i64 1128, !324, i64 1136, !324, i64 1144, !324, i64 1152, !324, i64 1160, !363, i64 1168, !324, i64 1176, !324, i64 1184, !361, i64 1192, !373, i64 1200, !324, i64 1240, !324, i64 1248, !361, i64 1256, !361, i64 1264, !325, i64 1272, !362, i64 1728, !362, i64 1732, !362, i64 1736, !362, i64 1740, !362, i64 1744, !361, i64 1752, !362, i64 1760, !362, i64 1764, !362, i64 1768, !362, i64 1772, !361, i64 1776, !361, i64 1784, !362, i64 1792, !362, i64 1796, !362, i64 1800, !362, i64 1804, !325, i64 1808, !362, i64 1880, !362, i64 1884, !363, i64 1888, !362, i64 1896, !362, i64 1900, !361, i64 1904, !361, i64 1912, !361, i64 1920, !361, i64 1928, !362, i64 1936, !362, i64 1940, !363, i64 1944, !363, i64 1952, !362, i64 1960, !362, i64 1964, !361, i64 1968, !361, i64 1976, !361, i64 1984, !361, i64 1992, !362, i64 2000, !361, i64 2008, !362, i64 2016, !362, i64 2020, !362, i64 2024, !362, i64 2028, !362, i64 2032, !362, i64 2036, !362, i64 2040, !362, i64 2044, !362, i64 2048, !362, i64 2052, !362, i64 2056, !362, i64 2060, !362, i64 2064, !363, i64 2072, !324, i64 2080, !324, i64 2088, !362, i64 2096, !363, i64 2104, !362, i64 2112, !363, i64 2120, !362, i64 2128, !362, i64 2132, !361, i64 2136, !361, i64 2144, !361, i64 2152, !361, i64 2160, !362, i64 2168, !362, i64 2172, !362, i64 2176, !362, i64 2180, !362, i64 2184, !362, i64 2188, !325, i64 2192, !374, i64 2200, !375, i64 2224, !363, i64 2240, !362, i64 2248, !363, i64 2256, !362, i64 2264, !325, i64 2268, !325, i64 2309, !324, i64 2352, !324, i64 2360, !362, i64 2368, !362, i64 2372, !363, i64 2376, !324, i64 2384, !324, i64 2392, !324, i64 2400, !324, i64 2408, !361, i64 2416, !361, i64 2424, !362, i64 2432, !362, i64 2436, !362, i64 2440, !362, i64 2444, !362, i64 2448, !363, i64 2456, !363, i64 2464, !362, i64 2472, !362, i64 2476, !363, i64 2480, !363, i64 2488, !362, i64 2496, !362, i64 2500, !361, i64 2504, !361, i64 2512, !361, i64 2520, !362, i64 2528, !362, i64 2532, !363, i64 2536, !361, i64 2544, !362, i64 2552, !362, i64 2556, !362, i64 2560, !361, i64 2568, !362, i64 2576, !362, i64 2580, !362, i64 2584, !363, i64 2592, !325, i64 2600, !324, i64 2648, !362, i64 2656, !363, i64 2664, !363, i64 2672, !362, i64 2680, !363, i64 2688, !362, i64 2696, !362, i64 2700, !324, i64 2704, !362, i64 2712, !362, i64 2716, !362, i64 2720, !362, i64 2724, !324, i64 2728, !362, i64 2736, !325, i64 2740, !363, i64 2768, !363, i64 2776, !362, i64 2784, !362, i64 2788, !362, i64 2792, !362, i64 2796, !361, i64 2800, !361, i64 2808, !361, i64 2816, !361, i64 2824, !361, i64 2832, !361, i64 2840, !361, i64 2848, !361, i64 2856, !362, i64 2864, !362, i64 2868, !361, i64 2872, !361, i64 2880, !362, i64 2888, !324, i64 2896, !363, i64 2904, !363, i64 2912, !362, i64 2920, !362, i64 2924, !324, i64 2928, !363, i64 2936, !363, i64 2944, !362, i64 2952, !362, i64 2956, !362, i64 2960, !362, i64 2964, !363, i64 2968, !362, i64 2976, !362, i64 2980, !362, i64 2984, !363, i64 2992, !363, i64 3000, !363, i64 3008, !363, i64 3016, !324, i64 3024, !324, i64 3032, !324, i64 3040, !362, i64 3048, !362, i64 3052, !362, i64 3056, !362, i64 3060, !362, i64 3064, !362, i64 3068, !362, i64 3072, !362, i64 3076, !362, i64 3080, !362, i64 3084, !362, i64 3088, !324, i64 3096, !363, i64 3104, !363, i64 3112, !363, i64 3120, !362, i64 3128, !362, i64 3132, !362, i64 3136, !361, i64 3144, !363, i64 3152, !363, i64 3160, !363, i64 3168}
!372 = !{!"double", !325, i64 0}
!373 = !{!"malloc_stats", !361, i64 0, !361, i64 8, !361, i64 16, !361, i64 24, !361, i64 32}
!374 = !{!"", !362, i64 0, !361, i64 8, !324, i64 16}
!375 = !{!"redisOpArray", !363, i64 0, !362, i64 8}
!376 = !DILocation(line: 106, column: 5, scope: !349)
!377 = !DILocation(line: 106, column: 42, scope: !349)
!378 = !{!362, !362, i64 0}
!379 = !DILocation(line: 107, column: 1, scope: !349)
!380 = distinct !DISubprogram(name: "processUnblockedClients", scope: !1, file: !1, line: 112, type: !381, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{null}
!383 = !{!384, !385}
!384 = !DILocalVariable(name: "ln", scope: !380, file: !1, line: 113, type: !150)
!385 = !DILocalVariable(name: "c", scope: !380, file: !1, line: 114, type: !60)
!386 = !DILocation(line: 116, column: 12, scope: !380)
!387 = !{!371, !363, i64 2768}
!388 = !{!389, !361, i64 40}
!389 = !{!"list", !363, i64 0, !363, i64 8, !363, i64 16, !363, i64 24, !363, i64 32, !361, i64 40}
!390 = !DILocation(line: 116, column: 5, scope: !380)
!391 = !DILocation(line: 117, column: 14, scope: !392)
!392 = distinct !DILexicalBlock(scope: !380, file: !1, line: 116, column: 50)
!393 = !{!389, !363, i64 0}
!394 = !DILocation(line: 113, column: 15, scope: !380)
!395 = !DILocation(line: 118, column: 9, scope: !392)
!396 = !DILocation(line: 119, column: 17, scope: !392)
!397 = !{!398, !363, i64 16}
!398 = !{!"listNode", !363, i64 0, !363, i64 8, !363, i64 16}
!399 = !DILocation(line: 114, column: 13, scope: !380)
!400 = !DILocation(line: 120, column: 9, scope: !392)
!401 = !DILocation(line: 121, column: 12, scope: !392)
!402 = !DILocation(line: 121, column: 18, scope: !392)
!403 = !DILocation(line: 127, column: 24, scope: !404)
!404 = distinct !DILexicalBlock(scope: !392, file: !1, line: 127, column: 13)
!405 = !DILocation(line: 127, column: 13, scope: !392)
!406 = !DILocation(line: 128, column: 20, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !1, line: 128, column: 17)
!408 = distinct !DILexicalBlock(scope: !404, file: !1, line: 127, column: 43)
!409 = !{!360, !363, i64 32}
!410 = !DILocation(line: 128, column: 17, scope: !407)
!411 = !DILocation(line: 128, column: 29, scope: !407)
!412 = !DILocalVariable(name: "s", arg: 1, scope: !413, file: !7, line: 87, type: !418)
!413 = distinct !DISubprogram(name: "sdslen", scope: !7, file: !7, line: 87, type: !414, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !419)
!414 = !DISubroutineType(types: !415)
!415 = !{!416, !418}
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !417, line: 58, baseType: !48)
!417 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!419 = !{!412, !420}
!420 = !DILocalVariable(name: "flags", scope: !413, file: !7, line: 88, type: !14)
!421 = !DILocation(line: 87, column: 39, scope: !413, inlinedAt: !422)
!422 = distinct !DILocation(line: 128, column: 32, scope: !407)
!423 = !DILocation(line: 88, column: 27, scope: !413, inlinedAt: !422)
!424 = !{!325, !325, i64 0}
!425 = !DILocation(line: 88, column: 19, scope: !413, inlinedAt: !422)
!426 = !DILocation(line: 89, column: 5, scope: !413, inlinedAt: !422)
!427 = !DILocation(line: 91, column: 20, scope: !428, inlinedAt: !422)
!428 = distinct !DILexicalBlock(scope: !413, file: !7, line: 89, column: 33)
!429 = !DILocation(line: 91, column: 13, scope: !428, inlinedAt: !422)
!430 = !DILocation(line: 93, column: 20, scope: !428, inlinedAt: !422)
!431 = !DILocation(line: 93, column: 34, scope: !428, inlinedAt: !422)
!432 = !DILocation(line: 93, column: 13, scope: !428, inlinedAt: !422)
!433 = !DILocation(line: 95, column: 20, scope: !428, inlinedAt: !422)
!434 = !DILocation(line: 95, column: 35, scope: !428, inlinedAt: !422)
!435 = !{!436, !436, i64 0}
!436 = !{!"short", !325, i64 0}
!437 = !DILocation(line: 95, column: 13, scope: !428, inlinedAt: !422)
!438 = !DILocation(line: 97, column: 20, scope: !428, inlinedAt: !422)
!439 = !DILocation(line: 97, column: 35, scope: !428, inlinedAt: !422)
!440 = !DILocation(line: 97, column: 13, scope: !428, inlinedAt: !422)
!441 = !DILocation(line: 99, column: 20, scope: !428, inlinedAt: !422)
!442 = !DILocation(line: 99, column: 35, scope: !428, inlinedAt: !422)
!443 = !{!361, !361, i64 0}
!444 = !DILocation(line: 99, column: 13, scope: !428, inlinedAt: !422)
!445 = !DILocation(line: 0, scope: !428, inlinedAt: !422)
!446 = !DILocation(line: 128, column: 52, scope: !407)
!447 = !DILocation(line: 128, column: 17, scope: !408)
!448 = !DILocation(line: 129, column: 17, scope: !449)
!449 = distinct !DILexicalBlock(scope: !407, file: !1, line: 128, column: 57)
!450 = !DILocation(line: 130, column: 13, scope: !449)
!451 = distinct !{!451, !390, !452}
!452 = !DILocation(line: 132, column: 5, scope: !380)
!453 = !DILocation(line: 133, column: 1, scope: !380)
!454 = distinct !DISubprogram(name: "queueClientForReprocessing", scope: !1, file: !1, line: 151, type: !203, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !455)
!455 = !{!456}
!456 = !DILocalVariable(name: "c", arg: 1, scope: !454, file: !1, line: 151, type: !60)
!457 = !DILocation(line: 151, column: 41, scope: !454)
!458 = !DILocation(line: 154, column: 14, scope: !459)
!459 = distinct !DILexicalBlock(scope: !454, file: !1, line: 154, column: 9)
!460 = !DILocation(line: 154, column: 20, scope: !459)
!461 = !DILocation(line: 154, column: 9, scope: !454)
!462 = !DILocation(line: 155, column: 18, scope: !463)
!463 = distinct !DILexicalBlock(scope: !459, file: !1, line: 154, column: 41)
!464 = !DILocation(line: 156, column: 32, scope: !463)
!465 = !DILocation(line: 156, column: 50, scope: !463)
!466 = !DILocation(line: 156, column: 9, scope: !463)
!467 = !DILocation(line: 157, column: 5, scope: !463)
!468 = !DILocation(line: 158, column: 1, scope: !454)
!469 = distinct !DISubprogram(name: "unblockClient", scope: !1, file: !1, line: 162, type: !203, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !470)
!470 = !{!471}
!471 = !DILocalVariable(name: "c", arg: 1, scope: !469, file: !1, line: 162, type: !60)
!472 = !DILocation(line: 162, column: 28, scope: !469)
!473 = !DILocation(line: 163, column: 12, scope: !474)
!474 = distinct !DILexicalBlock(scope: !469, file: !1, line: 163, column: 9)
!475 = !DILocation(line: 163, column: 34, scope: !474)
!476 = !DILocation(line: 166, column: 9, scope: !477)
!477 = distinct !DILexicalBlock(scope: !474, file: !1, line: 165, column: 37)
!478 = !DILocation(line: 167, column: 5, scope: !477)
!479 = !DILocation(line: 168, column: 9, scope: !480)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 167, column: 42)
!481 = distinct !DILexicalBlock(scope: !474, file: !1, line: 167, column: 16)
!482 = !DILocation(line: 169, column: 5, scope: !480)
!483 = !DILocation(line: 170, column: 9, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 169, column: 44)
!485 = distinct !DILexicalBlock(scope: !481, file: !1, line: 169, column: 16)
!486 = !DILocation(line: 172, column: 9, scope: !487)
!487 = distinct !DILexicalBlock(scope: !485, file: !1, line: 171, column: 12)
!488 = !DILocation(line: 176, column: 27, scope: !469)
!489 = !DILocation(line: 177, column: 39, scope: !469)
!490 = !DILocation(line: 177, column: 5, scope: !469)
!491 = !DILocation(line: 177, column: 45, scope: !469)
!492 = !DILocation(line: 178, column: 8, scope: !469)
!493 = !DILocation(line: 178, column: 14, scope: !469)
!494 = !DILocation(line: 179, column: 14, scope: !469)
!495 = !DILocation(line: 151, column: 41, scope: !454, inlinedAt: !496)
!496 = distinct !DILocation(line: 180, column: 5, scope: !469)
!497 = !DILocation(line: 154, column: 20, scope: !459, inlinedAt: !496)
!498 = !DILocation(line: 154, column: 9, scope: !454, inlinedAt: !496)
!499 = !DILocation(line: 155, column: 18, scope: !463, inlinedAt: !496)
!500 = !DILocation(line: 156, column: 32, scope: !463, inlinedAt: !496)
!501 = !DILocation(line: 156, column: 50, scope: !463, inlinedAt: !496)
!502 = !DILocation(line: 156, column: 9, scope: !463, inlinedAt: !496)
!503 = !DILocation(line: 157, column: 5, scope: !463, inlinedAt: !496)
!504 = !DILocation(line: 181, column: 1, scope: !469)
!505 = distinct !DISubprogram(name: "unblockClientWaitingData", scope: !1, file: !1, line: 543, type: !203, isLocal: false, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !506)
!506 = !{!507, !508, !509, !521, !522}
!507 = !DILocalVariable(name: "c", arg: 1, scope: !505, file: !1, line: 543, type: !60)
!508 = !DILocalVariable(name: "de", scope: !505, file: !1, line: 544, type: !111)
!509 = !DILocalVariable(name: "di", scope: !505, file: !1, line: 545, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !75, line: 95, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !75, line: 88, size: 384, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !512, file: !75, line: 89, baseType: !73, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !512, file: !75, line: 90, baseType: !124, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !512, file: !75, line: 91, baseType: !59, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !512, file: !75, line: 91, baseType: !59, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !512, file: !75, line: 92, baseType: !111, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !512, file: !75, line: 92, baseType: !111, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !512, file: !75, line: 94, baseType: !142, size: 64, offset: 320)
!521 = !DILocalVariable(name: "l", scope: !505, file: !1, line: 546, type: !144)
!522 = !DILocalVariable(name: "key", scope: !523, file: !1, line: 552, type: !173)
!523 = distinct !DILexicalBlock(scope: !505, file: !1, line: 551, column: 40)
!524 = !DILocation(line: 543, column: 39, scope: !505)
!525 = !DILocation(line: 548, column: 5, scope: !505)
!526 = !{!360, !363, i64 400}
!527 = !{!528, !361, i64 24}
!528 = !{!"dictht", !363, i64 0, !361, i64 8, !361, i64 16, !361, i64 24}
!529 = !DILocation(line: 549, column: 10, scope: !505)
!530 = !DILocation(line: 545, column: 19, scope: !505)
!531 = !DILocation(line: 551, column: 17, scope: !505)
!532 = !DILocation(line: 544, column: 16, scope: !505)
!533 = !DILocation(line: 551, column: 31, scope: !505)
!534 = !DILocation(line: 551, column: 5, scope: !505)
!535 = !DILocation(line: 552, column: 21, scope: !523)
!536 = !{!537, !363, i64 0}
!537 = !{!"dictEntry", !363, i64 0, !325, i64 8, !363, i64 16}
!538 = !DILocation(line: 555, column: 31, scope: !523)
!539 = !{!360, !363, i64 16}
!540 = !DILocation(line: 555, column: 35, scope: !523)
!541 = !{!542, !363, i64 16}
!542 = !{!"redisDb", !363, i64 0, !363, i64 8, !363, i64 16, !363, i64 24, !363, i64 32, !362, i64 40, !324, i64 48, !363, i64 56}
!543 = !DILocation(line: 555, column: 13, scope: !523)
!544 = !DILocation(line: 546, column: 11, scope: !505)
!545 = !DILocation(line: 556, column: 9, scope: !523)
!546 = !DILocation(line: 552, column: 15, scope: !523)
!547 = !DILocation(line: 557, column: 23, scope: !523)
!548 = !DILocation(line: 557, column: 9, scope: !523)
!549 = !DILocation(line: 559, column: 13, scope: !550)
!550 = distinct !DILexicalBlock(scope: !523, file: !1, line: 559, column: 13)
!551 = !DILocation(line: 559, column: 27, scope: !550)
!552 = !DILocation(line: 559, column: 13, scope: !523)
!553 = !DILocation(line: 560, column: 27, scope: !550)
!554 = !DILocation(line: 560, column: 31, scope: !550)
!555 = !DILocation(line: 560, column: 13, scope: !550)
!556 = distinct !{!556, !534, !557}
!557 = !DILocation(line: 561, column: 5, scope: !505)
!558 = !DILocation(line: 562, column: 5, scope: !505)
!559 = !DILocation(line: 565, column: 23, scope: !505)
!560 = !DILocation(line: 565, column: 5, scope: !505)
!561 = !DILocation(line: 566, column: 17, scope: !562)
!562 = distinct !DILexicalBlock(scope: !505, file: !1, line: 566, column: 9)
!563 = !{!360, !363, i64 408}
!564 = !DILocation(line: 566, column: 9, scope: !562)
!565 = !DILocation(line: 566, column: 9, scope: !505)
!566 = !DILocation(line: 567, column: 9, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !1, line: 566, column: 25)
!568 = !DILocation(line: 568, column: 24, scope: !567)
!569 = !DILocation(line: 569, column: 5, scope: !567)
!570 = !DILocation(line: 570, column: 17, scope: !571)
!571 = distinct !DILexicalBlock(scope: !505, file: !1, line: 570, column: 9)
!572 = !{!360, !363, i64 424}
!573 = !DILocation(line: 570, column: 9, scope: !571)
!574 = !DILocation(line: 570, column: 9, scope: !505)
!575 = !DILocation(line: 571, column: 9, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !1, line: 570, column: 30)
!577 = !DILocation(line: 572, column: 30, scope: !576)
!578 = !{!360, !363, i64 432}
!579 = !DILocation(line: 572, column: 9, scope: !576)
!580 = !DILocation(line: 573, column: 29, scope: !576)
!581 = !{!363, !363, i64 0}
!582 = !DILocation(line: 575, column: 5, scope: !576)
!583 = !DILocation(line: 576, column: 1, scope: !505)
!584 = distinct !DISubprogram(name: "replyToBlockedClientTimedOut", scope: !1, file: !1, line: 186, type: !203, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !585)
!585 = !{!586}
!586 = !DILocalVariable(name: "c", arg: 1, scope: !584, file: !1, line: 186, type: !60)
!587 = !DILocation(line: 186, column: 43, scope: !584)
!588 = !DILocation(line: 187, column: 12, scope: !589)
!589 = distinct !DILexicalBlock(scope: !584, file: !1, line: 187, column: 9)
!590 = !DILocation(line: 187, column: 34, scope: !589)
!591 = !DILocation(line: 190, column: 27, scope: !592)
!592 = distinct !DILexicalBlock(scope: !589, file: !1, line: 189, column: 37)
!593 = !{!594, !363, i64 88}
!594 = !{!"sharedObjectsStruct", !363, i64 0, !363, i64 8, !363, i64 16, !363, i64 24, !363, i64 32, !363, i64 40, !363, i64 48, !363, i64 56, !363, i64 64, !363, i64 72, !363, i64 80, !363, i64 88, !363, i64 96, !363, i64 104, !363, i64 112, !363, i64 120, !363, i64 128, !363, i64 136, !363, i64 144, !363, i64 152, !363, i64 160, !363, i64 168, !363, i64 176, !363, i64 184, !363, i64 192, !363, i64 200, !363, i64 208, !363, i64 216, !363, i64 224, !363, i64 232, !363, i64 240, !363, i64 248, !363, i64 256, !363, i64 264, !363, i64 272, !363, i64 280, !363, i64 288, !363, i64 296, !363, i64 304, !363, i64 312, !363, i64 320, !363, i64 328, !363, i64 336, !363, i64 344, !363, i64 352, !363, i64 360, !325, i64 368, !325, i64 448, !325, i64 80448, !325, i64 80704, !363, i64 80960, !363, i64 80968}
!595 = !DILocation(line: 190, column: 9, scope: !592)
!596 = !DILocation(line: 191, column: 5, scope: !592)
!597 = !DILocation(line: 192, column: 65, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 191, column: 42)
!599 = distinct !DILexicalBlock(scope: !589, file: !1, line: 191, column: 16)
!600 = !{!360, !324, i64 464}
!601 = !DILocation(line: 192, column: 28, scope: !598)
!602 = !DILocation(line: 192, column: 9, scope: !598)
!603 = !DILocation(line: 193, column: 5, scope: !598)
!604 = !DILocation(line: 194, column: 9, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 193, column: 44)
!606 = distinct !DILexicalBlock(scope: !599, file: !1, line: 193, column: 16)
!607 = !DILocation(line: 196, column: 9, scope: !608)
!608 = distinct !DILexicalBlock(scope: !606, file: !1, line: 195, column: 12)
!609 = !DILocation(line: 198, column: 1, scope: !584)
!610 = distinct !DISubprogram(name: "disconnectAllBlockedClients", scope: !1, file: !1, line: 207, type: !381, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !611)
!611 = !{!612, !613, !619}
!612 = !DILocalVariable(name: "ln", scope: !610, file: !1, line: 208, type: !150)
!613 = !DILocalVariable(name: "li", scope: !610, file: !1, line: 209, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !146, line: 45, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !146, line: 42, size: 128, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !615, file: !146, line: 43, baseType: !150, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !615, file: !146, line: 44, baseType: !59, size: 32, offset: 64)
!619 = !DILocalVariable(name: "c", scope: !620, file: !1, line: 213, type: !60)
!620 = distinct !DILexicalBlock(scope: !610, file: !1, line: 212, column: 33)
!621 = !DILocation(line: 209, column: 5, scope: !610)
!622 = !DILocation(line: 211, column: 23, scope: !610)
!623 = !{!371, !363, i64 512}
!624 = !DILocation(line: 209, column: 14, scope: !610)
!625 = !DILocation(line: 211, column: 5, scope: !610)
!626 = !DILocation(line: 212, column: 17, scope: !610)
!627 = !DILocation(line: 208, column: 15, scope: !610)
!628 = !DILocation(line: 212, column: 5, scope: !610)
!629 = !DILocation(line: 213, column: 21, scope: !620)
!630 = !DILocation(line: 213, column: 17, scope: !620)
!631 = !DILocation(line: 215, column: 16, scope: !632)
!632 = distinct !DILexicalBlock(scope: !620, file: !1, line: 215, column: 13)
!633 = !DILocation(line: 215, column: 22, scope: !632)
!634 = !DILocation(line: 215, column: 13, scope: !620)
!635 = !DILocation(line: 216, column: 27, scope: !636)
!636 = distinct !DILexicalBlock(scope: !632, file: !1, line: 215, column: 40)
!637 = !DILocation(line: 216, column: 13, scope: !636)
!638 = !DILocation(line: 219, column: 13, scope: !636)
!639 = !DILocation(line: 220, column: 22, scope: !636)
!640 = !DILocation(line: 221, column: 9, scope: !636)
!641 = distinct !{!641, !628, !642}
!642 = !DILocation(line: 222, column: 5, scope: !610)
!643 = !DILocation(line: 223, column: 1, scope: !610)
!644 = distinct !DISubprogram(name: "handleClientsBlockedOnKeys", scope: !1, file: !1, line: 246, type: !381, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !645)
!645 = !{!646, !648, !650, !657, !658, !661, !664, !665, !667, !668, !669, !670, !671, !674, !677, !678, !679, !681, !682, !683, !685, !686, !689, !722, !725, !726, !727, !729, !731, !739, !742, !750, !751}
!646 = !DILocalVariable(name: "l", scope: !647, file: !1, line: 248, type: !144)
!647 = distinct !DILexicalBlock(scope: !644, file: !1, line: 247, column: 47)
!648 = !DILocalVariable(name: "ln", scope: !649, file: !1, line: 258, type: !150)
!649 = distinct !DILexicalBlock(scope: !647, file: !1, line: 257, column: 35)
!650 = !DILocalVariable(name: "rl", scope: !649, file: !1, line: 259, type: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "readyList", file: !62, line: 719, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "readyList", file: !62, line: 716, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !653, file: !62, line: 717, baseType: !68, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !653, file: !62, line: 718, baseType: !173, size: 64, offset: 64)
!657 = !DILocalVariable(name: "o", scope: !649, file: !1, line: 266, type: !173)
!658 = !DILocalVariable(name: "de", scope: !659, file: !1, line: 268, type: !111)
!659 = distinct !DILexicalBlock(scope: !660, file: !1, line: 267, column: 51)
!660 = distinct !DILexicalBlock(scope: !649, file: !1, line: 267, column: 17)
!661 = !DILocalVariable(name: "clients", scope: !662, file: !1, line: 274, type: !144)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 273, column: 25)
!663 = distinct !DILexicalBlock(scope: !659, file: !1, line: 273, column: 21)
!664 = !DILocalVariable(name: "numclients", scope: !662, file: !1, line: 275, type: !59)
!665 = !DILocalVariable(name: "clientnode", scope: !666, file: !1, line: 278, type: !150)
!666 = distinct !DILexicalBlock(scope: !662, file: !1, line: 277, column: 41)
!667 = !DILocalVariable(name: "receiver", scope: !666, file: !1, line: 279, type: !60)
!668 = !DILocalVariable(name: "dstkey", scope: !666, file: !1, line: 289, type: !173)
!669 = !DILocalVariable(name: "where", scope: !666, file: !1, line: 290, type: !59)
!670 = !DILocalVariable(name: "value", scope: !666, file: !1, line: 293, type: !173)
!671 = !DILocalVariable(name: "de", scope: !672, file: !1, line: 329, type: !111)
!672 = distinct !DILexicalBlock(scope: !673, file: !1, line: 328, column: 56)
!673 = distinct !DILexicalBlock(scope: !660, file: !1, line: 328, column: 22)
!674 = !DILocalVariable(name: "clients", scope: !675, file: !1, line: 335, type: !144)
!675 = distinct !DILexicalBlock(scope: !676, file: !1, line: 334, column: 25)
!676 = distinct !DILexicalBlock(scope: !672, file: !1, line: 334, column: 21)
!677 = !DILocalVariable(name: "numclients", scope: !675, file: !1, line: 336, type: !59)
!678 = !DILocalVariable(name: "zcard", scope: !675, file: !1, line: 337, type: !48)
!679 = !DILocalVariable(name: "clientnode", scope: !680, file: !1, line: 340, type: !150)
!680 = distinct !DILexicalBlock(scope: !675, file: !1, line: 339, column: 50)
!681 = !DILocalVariable(name: "receiver", scope: !680, file: !1, line: 341, type: !60)
!682 = !DILocalVariable(name: "where", scope: !680, file: !1, line: 351, type: !59)
!683 = !DILocalVariable(name: "argv", scope: !680, file: !1, line: 359, type: !684)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 128, elements: !132)
!685 = !DILocalVariable(name: "cmd", scope: !680, file: !1, line: 360, type: !196)
!686 = !DILocalVariable(name: "de", scope: !687, file: !1, line: 376, type: !111)
!687 = distinct !DILexicalBlock(scope: !688, file: !1, line: 375, column: 58)
!688 = distinct !DILexicalBlock(scope: !673, file: !1, line: 375, column: 22)
!689 = !DILocalVariable(name: "s", scope: !687, file: !1, line: 377, type: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !692, line: 21, baseType: !693)
!692 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !692, line: 16, size: 320, elements: !694)
!694 = !{!695, !714, !715, !721}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !693, file: !692, line: 17, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !698, line: 137, baseType: !699)
!698 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !698, line: 133, size: 192, elements: !700)
!700 = !{!701, !712, !713}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !699, file: !698, line: 134, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !698, line: 131, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !698, line: 98, size: 32, elements: !705)
!705 = !{!706, !707, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !704, file: !698, line: 99, baseType: !36, size: 1, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !704, file: !698, line: 100, baseType: !36, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !704, file: !698, line: 101, baseType: !36, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !704, file: !698, line: 102, baseType: !36, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !704, file: !698, line: 130, baseType: !711, offset: 32)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, elements: !20)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !699, file: !698, line: 135, baseType: !46, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !699, file: !698, line: 136, baseType: !46, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !693, file: !692, line: 18, baseType: !46, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !693, file: !692, line: 19, baseType: !716, size: 128, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !692, line: 14, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !692, line: 11, size: 128, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !717, file: !692, line: 12, baseType: !46, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !717, file: !692, line: 13, baseType: !46, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !693, file: !692, line: 20, baseType: !696, size: 64, offset: 256)
!722 = !DILocalVariable(name: "clients", scope: !723, file: !1, line: 383, type: !144)
!723 = distinct !DILexicalBlock(scope: !724, file: !1, line: 382, column: 25)
!724 = distinct !DILexicalBlock(scope: !687, file: !1, line: 382, column: 21)
!725 = !DILocalVariable(name: "ln", scope: !723, file: !1, line: 384, type: !150)
!726 = !DILocalVariable(name: "li", scope: !723, file: !1, line: 385, type: !614)
!727 = !DILocalVariable(name: "receiver", scope: !728, file: !1, line: 389, type: !60)
!728 = distinct !DILexicalBlock(scope: !723, file: !1, line: 388, column: 49)
!729 = !DILocalVariable(name: "gt", scope: !728, file: !1, line: 391, type: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!731 = !DILocalVariable(name: "group", scope: !728, file: !1, line: 403, type: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamCG", file: !692, line: 64, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamCG", file: !692, line: 51, size: 256, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !734, file: !692, line: 52, baseType: !716, size: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pel", scope: !734, file: !692, line: 55, baseType: !696, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "consumers", scope: !734, file: !692, line: 61, baseType: !696, size: 64, offset: 192)
!739 = !DILocalVariable(name: "start", scope: !740, file: !1, line: 421, type: !716)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 420, column: 67)
!741 = distinct !DILexicalBlock(scope: !728, file: !1, line: 420, column: 29)
!742 = !DILocalVariable(name: "consumer", scope: !740, file: !1, line: 425, type: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamConsumer", file: !692, line: 79, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamConsumer", file: !692, line: 67, size: 192, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "seen_time", scope: !745, file: !692, line: 68, baseType: !281, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !692, line: 69, baseType: !183, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pel", scope: !745, file: !692, line: 72, baseType: !696, size: 64, offset: 128)
!750 = !DILocalVariable(name: "noack", scope: !740, file: !1, line: 426, type: !59)
!751 = !DILocalVariable(name: "pi", scope: !740, file: !1, line: 443, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamPropInfo", file: !692, line: 94, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sreamPropInfo", file: !692, line: 91, size: 128, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "keyname", scope: !753, file: !692, line: 92, baseType: !173, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "groupname", scope: !753, file: !692, line: 93, baseType: !173, size: 64, offset: 64)
!757 = !DILocation(line: 247, column: 11, scope: !644)
!758 = !{!371, !363, i64 2776}
!759 = !DILocation(line: 247, column: 41, scope: !644)
!760 = !DILocation(line: 247, column: 5, scope: !644)
!761 = !DILocation(line: 248, column: 15, scope: !647)
!762 = !DILocation(line: 255, column: 29, scope: !647)
!763 = !DILocation(line: 255, column: 27, scope: !647)
!764 = !DILocation(line: 257, column: 15, scope: !647)
!765 = !DILocation(line: 257, column: 29, scope: !647)
!766 = !DILocation(line: 257, column: 9, scope: !647)
!767 = !DILocation(line: 258, column: 28, scope: !649)
!768 = !DILocation(line: 258, column: 23, scope: !649)
!769 = !DILocation(line: 259, column: 33, scope: !649)
!770 = !DILocation(line: 259, column: 24, scope: !649)
!771 = !DILocation(line: 263, column: 28, scope: !649)
!772 = !{!773, !363, i64 0}
!773 = !{!"readyList", !363, i64 0, !363, i64 8}
!774 = !DILocation(line: 263, column: 32, scope: !649)
!775 = !{!542, !363, i64 24}
!776 = !DILocation(line: 263, column: 47, scope: !649)
!777 = !{!773, !363, i64 8}
!778 = !DILocation(line: 263, column: 13, scope: !649)
!779 = !DILocation(line: 266, column: 42, scope: !649)
!780 = !DILocation(line: 266, column: 49, scope: !649)
!781 = !DILocation(line: 266, column: 23, scope: !649)
!782 = !DILocation(line: 266, column: 19, scope: !649)
!783 = !DILocation(line: 267, column: 19, scope: !660)
!784 = !DILocation(line: 267, column: 27, scope: !660)
!785 = !DILocation(line: 267, column: 33, scope: !660)
!786 = !DILocation(line: 267, column: 17, scope: !649)
!787 = !DILocation(line: 272, column: 35, scope: !659)
!788 = !DILocation(line: 272, column: 39, scope: !659)
!789 = !DILocation(line: 272, column: 57, scope: !659)
!790 = !DILocation(line: 272, column: 22, scope: !659)
!791 = !DILocation(line: 268, column: 28, scope: !659)
!792 = !DILocation(line: 273, column: 21, scope: !663)
!793 = !DILocation(line: 273, column: 21, scope: !659)
!794 = !DILocation(line: 274, column: 37, scope: !662)
!795 = !DILocation(line: 274, column: 27, scope: !662)
!796 = !DILocation(line: 275, column: 38, scope: !662)
!797 = !DILocation(line: 275, column: 25, scope: !662)
!798 = !DILocation(line: 277, column: 21, scope: !662)
!799 = !DILocation(line: 277, column: 37, scope: !662)
!800 = !DILocation(line: 278, column: 48, scope: !666)
!801 = !DILocation(line: 278, column: 35, scope: !666)
!802 = !DILocation(line: 279, column: 56, scope: !666)
!803 = !DILocation(line: 279, column: 44, scope: !666)
!804 = !DILocation(line: 279, column: 33, scope: !666)
!805 = !DILocation(line: 281, column: 39, scope: !806)
!806 = distinct !DILexicalBlock(scope: !666, file: !1, line: 281, column: 29)
!807 = !DILocation(line: 281, column: 45, scope: !806)
!808 = !DILocation(line: 281, column: 29, scope: !666)
!809 = !DILocation(line: 284, column: 29, scope: !810)
!810 = distinct !DILexicalBlock(scope: !806, file: !1, line: 281, column: 62)
!811 = !DILocation(line: 285, column: 29, scope: !810)
!812 = !DILocation(line: 286, column: 29, scope: !810)
!813 = distinct !{!813, !798, !814}
!814 = !DILocation(line: 316, column: 21, scope: !662)
!815 = !DILocation(line: 289, column: 55, scope: !666)
!816 = !DILocation(line: 289, column: 31, scope: !666)
!817 = !DILocation(line: 290, column: 48, scope: !666)
!818 = !{!360, !363, i64 88}
!819 = !DILocation(line: 290, column: 38, scope: !666)
!820 = !DILocation(line: 290, column: 56, scope: !666)
!821 = !DILocation(line: 291, column: 57, scope: !666)
!822 = !{!823, !363, i64 8}
!823 = !{!"redisCommand", !363, i64 0, !363, i64 8, !362, i64 16, !363, i64 24, !362, i64 32, !363, i64 40, !362, i64 48, !362, i64 52, !362, i64 56, !324, i64 64, !324, i64 72}
!824 = !DILocation(line: 291, column: 62, scope: !666)
!825 = !DILocation(line: 0, scope: !666)
!826 = !DILocation(line: 290, column: 37, scope: !666)
!827 = !DILocation(line: 290, column: 29, scope: !666)
