; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/cluster.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/cluster.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.clusterNode = type { i64, [40 x i8], i32, i64, [2048 x i8], i32, i32, %struct.clusterNode**, %struct.clusterNode*, i64, i64, i64, i64, i64, i64, i64, [46 x i8], i32, i32, %struct.clusterLink*, %struct.list* }
%struct.clusterLink = type { i64, i32, i8*, i8*, %struct.clusterNode* }
%struct.list = type { %struct.listNode*, %struct.listNode*, i8* (i8*)*, void (i8*)*, i32 (i8*, i8*)*, i64 }
%struct.listNode = type { %struct.listNode*, %struct.listNode*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "myself", scope: !2, file: !3, line: 47, type: !378, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !278)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/cluster.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !14, !16, !51, !73, !92, !106, !177, !178, !179, !186, !184, !104, !246, !247, !257, !264, !271}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !9, line: 173, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 100, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !11, line: 44, baseType: !13)
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !9, line: 200, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !11, line: 145, baseType: !13)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !18, line: 73, size: 128, elements: !19)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/sockets.h", directory: "/root/.unikraft/apps/redis/build")
!19 = !{!20, !28, !30, !36, !46}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sin_len", scope: !17, file: !18, line: 74, baseType: !21, size: 8)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !22, line: 125, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 24, baseType: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !26, line: 43, baseType: !27)
!26 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !17, file: !18, line: 75, baseType: !29, size: 8, offset: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !18, line: 63, baseType: !21)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !17, file: !18, line: 76, baseType: !31, size: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !18, line: 68, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !22, line: 127, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !24, line: 36, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !26, line: 57, baseType: !35)
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !17, file: !18, line: 77, baseType: !37, size: 32, offset: 32)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !38, line: 58, size: 32, elements: !39)
!38 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/inet.h", directory: "/root/.unikraft/apps/redis/build")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !37, file: !38, line: 59, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !38, line: 55, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !22, line: 129, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 48, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !26, line: 79, baseType: !45)
!45 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !17, file: !18, line: 79, baseType: !47, size: 64, offset: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !49)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !{!50}
!50 = !DISubrange(count: 8)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !18, line: 84, size: 224, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !72}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !52, file: !18, line: 85, baseType: !21, size: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !52, file: !18, line: 86, baseType: !29, size: 8, offset: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !52, file: !18, line: 87, baseType: !31, size: 16, offset: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !52, file: !18, line: 88, baseType: !42, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !52, file: !18, line: 89, baseType: !59, size: 128, offset: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !38, line: 62, size: 128, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !59, file: !38, line: 66, baseType: !62, size: 128)
!62 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !38, line: 63, size: 128, elements: !63)
!63 = !{!64, !68}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "u32_addr", scope: !62, file: !38, line: 64, baseType: !65, size: 128)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "u8_addr", scope: !62, file: !38, line: 65, baseType: !69, size: 128)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !52, file: !18, line: 90, baseType: !42, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterMsgDataGossip", file: !75, line: 197, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/cluster.h", directory: "/root/.unikraft/apps/redis/build")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 188, size: 832, elements: !77)
!77 = !{!78, !82, !83, !84, !88, !89, !90, !91}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !76, file: !75, line: 189, baseType: !79, size: 320)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 320, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 40)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ping_sent", scope: !76, file: !75, line: 190, baseType: !43, size: 32, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pong_received", scope: !76, file: !75, line: 191, baseType: !43, size: 32, offset: 352)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !76, file: !75, line: 192, baseType: !85, size: 368, offset: 384)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 368, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 46)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !76, file: !75, line: 193, baseType: !33, size: 16, offset: 752)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cport", scope: !76, file: !75, line: 194, baseType: !33, size: 16, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !76, file: !75, line: 195, baseType: !33, size: 16, offset: 784)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "notused1", scope: !76, file: !75, line: 196, baseType: !43, size: 32, offset: 800)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterMsg", file: !75, line: 275, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 252, size: 34816, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !102, !103, !107, !108, !109, !110, !114, !115, !116, !120, !121, !122, !123, !127}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !94, file: !75, line: 253, baseType: !97, size: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !66)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "totlen", scope: !94, file: !75, line: 254, baseType: !43, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !94, file: !75, line: 255, baseType: !33, size: 16, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !94, file: !75, line: 256, baseType: !33, size: 16, offset: 80)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !75, line: 257, baseType: !33, size: 16, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !94, file: !75, line: 258, baseType: !33, size: 16, offset: 112)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "currentEpoch", scope: !94, file: !75, line: 259, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !24, line: 60, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !26, line: 105, baseType: !106)
!106 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "configEpoch", scope: !94, file: !75, line: 260, baseType: !104, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !94, file: !75, line: 263, baseType: !104, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sender", scope: !94, file: !75, line: 265, baseType: !79, size: 320, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "myslots", scope: !94, file: !75, line: 266, baseType: !111, size: 16384, offset: 640)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 16384, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 2048)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "slaveof", scope: !94, file: !75, line: 267, baseType: !79, size: 320, offset: 17024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "myip", scope: !94, file: !75, line: 268, baseType: !85, size: 368, offset: 17344)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "notused1", scope: !94, file: !75, line: 269, baseType: !117, size: 272, offset: 17712)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 272, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 34)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cport", scope: !94, file: !75, line: 270, baseType: !33, size: 16, offset: 17984)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !75, line: 271, baseType: !33, size: 16, offset: 18000)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !94, file: !75, line: 272, baseType: !27, size: 8, offset: 18016)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mflags", scope: !94, file: !75, line: 273, baseType: !124, size: 24, offset: 18024)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 3)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !75, line: 274, baseType: !128, size: 16768, offset: 18048)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "clusterMsgData", file: !75, line: 222, size: 16768, elements: !129)
!129 = !{!130, !137, !145, !156, !166}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !128, file: !75, line: 227, baseType: !131, size: 832)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !75, line: 224, size: 832, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "gossip", scope: !131, file: !75, line: 226, baseType: !134, size: 832)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 832, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !128, file: !75, line: 232, baseType: !138, size: 320)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !75, line: 230, size: 320, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "about", scope: !138, file: !75, line: 231, baseType: !141, size: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterMsgDataFail", file: !75, line: 201, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 199, size: 320, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !142, file: !75, line: 200, baseType: !79, size: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "publish", scope: !128, file: !75, line: 237, baseType: !146, size: 128)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !75, line: 235, size: 128, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !146, file: !75, line: 236, baseType: !149, size: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterMsgDataPublish", file: !75, line: 207, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 203, size: 128, elements: !151)
!151 = !{!152, !153, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "channel_len", scope: !150, file: !75, line: 204, baseType: !43, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "message_len", scope: !150, file: !75, line: 205, baseType: !43, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bulk_data", scope: !150, file: !75, line: 206, baseType: !155, size: 64, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !49)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !128, file: !75, line: 242, baseType: !157, size: 16768)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !75, line: 240, size: 16768, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nodecfg", scope: !157, file: !75, line: 241, baseType: !160, size: 16768)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterMsgDataUpdate", file: !75, line: 213, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 209, size: 16768, elements: !162)
!162 = !{!163, !164, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "configEpoch", scope: !161, file: !75, line: 210, baseType: !104, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !161, file: !75, line: 211, baseType: !79, size: 320, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !161, file: !75, line: 212, baseType: !111, size: 16384, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !128, file: !75, line: 247, baseType: !167, size: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !75, line: 245, size: 128, elements: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !167, file: !75, line: 246, baseType: !170, size: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterMsgModule", file: !75, line: 220, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 215, size: 128, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "module_id", scope: !171, file: !75, line: 216, baseType: !104, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !171, file: !75, line: 217, baseType: !43, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !75, line: 218, baseType: !23, size: 8, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bulk_data", scope: !171, file: !75, line: 219, baseType: !124, size: 24, offset: 104)
!177 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterLink", file: !75, line: 47, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clusterLink", file: !75, line: 41, size: 320, elements: !182)
!182 = !{!183, !187, !188, !191, !192}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !181, file: !75, line: 42, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !185, line: 52, baseType: !186)
!185 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!186 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !181, file: !75, line: 43, baseType: !177, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !181, file: !75, line: 44, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !190, line: 43, baseType: !178)
!190 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !181, file: !75, line: 45, baseType: !189, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !181, file: !75, line: 46, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clusterNode", file: !75, line: 116, size: 18112, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !194, file: !75, line: 117, baseType: !184, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !75, line: 118, baseType: !79, size: 320, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !75, line: 119, baseType: !177, size: 32, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "configEpoch", scope: !194, file: !75, line: 120, baseType: !104, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !194, file: !75, line: 121, baseType: !111, size: 16384, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "numslots", scope: !194, file: !75, line: 122, baseType: !177, size: 32, offset: 16896)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "numslaves", scope: !194, file: !75, line: 123, baseType: !177, size: 32, offset: 16928)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "slaves", scope: !194, file: !75, line: 124, baseType: !204, size: 64, offset: 16960)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slaveof", scope: !194, file: !75, line: 125, baseType: !193, size: 64, offset: 17024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ping_sent", scope: !194, file: !75, line: 129, baseType: !184, size: 64, offset: 17088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pong_received", scope: !194, file: !75, line: 130, baseType: !184, size: 64, offset: 17152)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !194, file: !75, line: 131, baseType: !184, size: 64, offset: 17216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "voted_time", scope: !194, file: !75, line: 132, baseType: !184, size: 64, offset: 17280)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "repl_offset_time", scope: !194, file: !75, line: 133, baseType: !184, size: 64, offset: 17344)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "orphaned_time", scope: !194, file: !75, line: 134, baseType: !184, size: 64, offset: 17408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "repl_offset", scope: !194, file: !75, line: 135, baseType: !186, size: 64, offset: 17472)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !194, file: !75, line: 136, baseType: !85, size: 368, offset: 17536)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !194, file: !75, line: 137, baseType: !177, size: 32, offset: 17920)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cport", scope: !194, file: !75, line: 138, baseType: !177, size: 32, offset: 17952)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !194, file: !75, line: 139, baseType: !179, size: 64, offset: 17984)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fail_reports", scope: !194, file: !75, line: 140, baseType: !218, size: 64, offset: 18048)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !220, line: 54, baseType: !221)
!220 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !220, line: 47, size: 384, elements: !222)
!222 = !{!223, !232, !233, !237, !241, !245}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !221, file: !220, line: 48, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !220, line: 40, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !220, line: 36, size: 192, elements: !227)
!227 = !{!228, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !226, file: !220, line: 37, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !220, line: 38, baseType: !229, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !226, file: !220, line: 39, baseType: !6, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !221, file: !220, line: 49, baseType: !224, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !221, file: !220, line: 50, baseType: !234, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!6, !6}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !221, file: !220, line: 51, baseType: !238, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !6}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !221, file: !220, line: 52, baseType: !242, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!177, !6, !6}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !221, file: !220, line: 53, baseType: !106, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !190, line: 51, size: 24, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !190, line: 52, baseType: !23, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !248, file: !190, line: 53, baseType: !23, size: 8, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !190, line: 54, baseType: !27, size: 8, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !248, file: !190, line: 55, baseType: !254, offset: 24)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: -1)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !190, line: 57, size: 40, elements: !259)
!259 = !{!260, !261, !262, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !190, line: 58, baseType: !33, size: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !258, file: !190, line: 59, baseType: !33, size: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !190, line: 60, baseType: !27, size: 8, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !190, line: 61, baseType: !254, offset: 40)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !190, line: 63, size: 72, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !190, line: 64, baseType: !43, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !265, file: !190, line: 65, baseType: !43, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !190, line: 66, baseType: !27, size: 8, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !265, file: !190, line: 67, baseType: !254, offset: 72)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !190, line: 69, size: 136, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !272, file: !190, line: 70, baseType: !104, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !272, file: !190, line: 71, baseType: !104, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !272, file: !190, line: 72, baseType: !27, size: 8, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !272, file: !190, line: 73, baseType: !254, offset: 136)
!278 = !{!0, !279, !290, !404, !406, !423, !425}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "lastlog_time", scope: !281, file: !3, line: 2863, type: !288, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "clusterLogCantFailover", scope: !3, file: !3, line: 2861, type: !282, isLocal: false, isDefinition: true, scopeLine: 2861, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !177}
!284 = !{!285, !286, !287}
!285 = !DILocalVariable(name: "reason", arg: 1, scope: !281, file: !3, line: 2861, type: !177)
!286 = !DILocalVariable(name: "msg", scope: !281, file: !3, line: 2862, type: !178)
!287 = !DILocalVariable(name: "nolog_fail_time", scope: !281, file: !3, line: 2864, type: !184)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !289, line: 34, baseType: !13)
!289 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "iteration", scope: !292, file: !3, line: 3319, type: !7, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "clusterCron", scope: !3, file: !3, line: 3310, type: !293, isLocal: false, isDefinition: true, scopeLine: 3310, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{null}
!295 = !{!296, !370, !371, !372, !373, !374, !375, !376, !377, !380, !381, !383, !384, !386, !389, !390, !391, !394, !398, !400, !401}
!296 = !DILocalVariable(name: "di", scope: !292, file: !3, line: 3311, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !299, line: 95, baseType: !300)
!299 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !299, line: 88, size: 384, elements: !301)
!301 = !{!302, !364, !365, !366, !367, !368, !369}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !300, file: !299, line: 89, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !299, line: 82, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !299, line: 76, size: 768, elements: !306)
!306 = !{!307, !332, !333, !362, !363}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !299, line: 77, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !299, line: 65, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !299, line: 58, size: 384, elements: !311)
!311 = !{!312, !318, !322, !323, !327, !331}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !310, file: !299, line: 59, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!104, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !310, file: !299, line: 60, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!6, !6, !316}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !310, file: !299, line: 61, baseType: !319, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !310, file: !299, line: 62, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!177, !6, !316, !316}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !310, file: !299, line: 63, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !6, !6}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !310, file: !299, line: 64, baseType: !328, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !305, file: !299, line: 78, baseType: !6, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !305, file: !299, line: 79, baseType: !334, size: 512, offset: 128)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 512, elements: !360)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !299, line: 74, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !299, line: 69, size: 256, elements: !337)
!337 = !{!338, !357, !358, !359}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !336, file: !299, line: 70, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !299, line: 56, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !299, line: 47, size: 192, elements: !343)
!343 = !{!344, !345, !355}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !342, file: !299, line: 48, baseType: !6, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !342, file: !299, line: 54, baseType: !346, size: 64, offset: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !299, line: 49, size: 64, elements: !347)
!347 = !{!348, !349, !350, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !346, file: !299, line: 50, baseType: !6, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !346, file: !299, line: 51, baseType: !104, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !346, file: !299, line: 52, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !24, line: 56, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !26, line: 103, baseType: !13)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !346, file: !299, line: 53, baseType: !354, size: 64)
!354 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !299, line: 55, baseType: !356, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !299, line: 71, baseType: !106, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !336, file: !299, line: 72, baseType: !106, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !336, file: !299, line: 73, baseType: !106, size: 64, offset: 192)
!360 = !{!361}
!361 = !DISubrange(count: 2)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !305, file: !299, line: 80, baseType: !13, size: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !305, file: !299, line: 81, baseType: !106, size: 64, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !300, file: !299, line: 90, baseType: !13, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !300, file: !299, line: 91, baseType: !177, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !300, file: !299, line: 91, baseType: !177, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !300, file: !299, line: 92, baseType: !340, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !300, file: !299, line: 92, baseType: !340, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !300, file: !299, line: 94, baseType: !186, size: 64, offset: 320)
!370 = !DILocalVariable(name: "de", scope: !292, file: !3, line: 3312, type: !340)
!371 = !DILocalVariable(name: "update_state", scope: !292, file: !3, line: 3313, type: !177)
!372 = !DILocalVariable(name: "orphaned_masters", scope: !292, file: !3, line: 3314, type: !177)
!373 = !DILocalVariable(name: "max_slaves", scope: !292, file: !3, line: 3315, type: !177)
!374 = !DILocalVariable(name: "this_slaves", scope: !292, file: !3, line: 3316, type: !177)
!375 = !DILocalVariable(name: "min_pong", scope: !292, file: !3, line: 3317, type: !184)
!376 = !DILocalVariable(name: "now", scope: !292, file: !3, line: 3317, type: !184)
!377 = !DILocalVariable(name: "min_pong_node", scope: !292, file: !3, line: 3318, type: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "clusterNode", file: !75, line: 141, baseType: !194)
!380 = !DILocalVariable(name: "handshake_timeout", scope: !292, file: !3, line: 3320, type: !184)
!381 = !DILocalVariable(name: "curr_ip", scope: !382, file: !3, line: 3329, type: !178)
!382 = distinct !DILexicalBlock(scope: !292, file: !3, line: 3327, column: 5)
!383 = !DILocalVariable(name: "changed", scope: !382, file: !3, line: 3330, type: !177)
!384 = !DILocalVariable(name: "node", scope: !385, file: !3, line: 3369, type: !378)
!385 = distinct !DILexicalBlock(scope: !292, file: !3, line: 3368, column: 40)
!386 = !DILocalVariable(name: "fd", scope: !387, file: !3, line: 3386, type: !177)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 3385, column: 33)
!388 = distinct !DILexicalBlock(scope: !385, file: !3, line: 3385, column: 13)
!389 = !DILocalVariable(name: "old_ping_sent", scope: !387, file: !3, line: 3387, type: !184)
!390 = !DILocalVariable(name: "link", scope: !387, file: !3, line: 3388, type: !179)
!391 = !DILocalVariable(name: "j", scope: !392, file: !3, line: 3440, type: !177)
!392 = distinct !DILexicalBlock(scope: !393, file: !3, line: 3439, column: 28)
!393 = distinct !DILexicalBlock(scope: !292, file: !3, line: 3439, column: 9)
!394 = !DILocalVariable(name: "this", scope: !395, file: !3, line: 3446, type: !378)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 3444, column: 33)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 3444, column: 9)
!397 = distinct !DILexicalBlock(scope: !392, file: !3, line: 3444, column: 9)
!398 = !DILocalVariable(name: "node", scope: !399, file: !3, line: 3474, type: !378)
!399 = distinct !DILexicalBlock(scope: !292, file: !3, line: 3473, column: 40)
!400 = !DILocalVariable(name: "delay", scope: !399, file: !3, line: 3476, type: !184)
!401 = !DILocalVariable(name: "okslaves", scope: !402, file: !3, line: 3485, type: !177)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 3484, column: 77)
!403 = distinct !DILexicalBlock(scope: !399, file: !3, line: 3484, column: 13)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "prev_ip", scope: !292, file: !3, line: 3328, type: !178, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "among_minority_time", scope: !408, file: !3, line: 3763, type: !184, isLocal: true, isDefinition: true)
!408 = distinct !DISubprogram(name: "clusterUpdateState", scope: !3, file: !3, line: 3760, type: !293, isLocal: false, isDefinition: true, scopeLine: 3760, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !409)
!409 = !{!410, !411, !412, !413, !415, !416, !418, !420}
!410 = !DILocalVariable(name: "j", scope: !408, file: !3, line: 3761, type: !177)
!411 = !DILocalVariable(name: "new_state", scope: !408, file: !3, line: 3761, type: !177)
!412 = !DILocalVariable(name: "reachable_masters", scope: !408, file: !3, line: 3762, type: !177)
!413 = !DILocalVariable(name: "di", scope: !414, file: !3, line: 3801, type: !297)
!414 = distinct !DILexicalBlock(scope: !408, file: !3, line: 3800, column: 5)
!415 = !DILocalVariable(name: "de", scope: !414, file: !3, line: 3802, type: !340)
!416 = !DILocalVariable(name: "node", scope: !417, file: !3, line: 3807, type: !378)
!417 = distinct !DILexicalBlock(scope: !414, file: !3, line: 3806, column: 44)
!418 = !DILocalVariable(name: "needed_quorum", scope: !419, file: !3, line: 3821, type: !177)
!419 = distinct !DILexicalBlock(scope: !408, file: !3, line: 3820, column: 5)
!420 = !DILocalVariable(name: "rejoin_delay", scope: !421, file: !3, line: 3831, type: !184)
!421 = distinct !DILexicalBlock(scope: !422, file: !3, line: 3830, column: 45)
!422 = distinct !DILexicalBlock(scope: !408, file: !3, line: 3830, column: 9)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "first_call_time", scope: !408, file: !3, line: 3764, type: !184, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "redisNodeFlagsTable", scope: !2, file: !3, line: 3960, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 1024, elements: !49)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisNodeFlags", file: !3, line: 3955, size: 128, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !3, line: 3956, baseType: !33, size: 16)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !428, file: !3, line: 3957, baseType: !178, size: 64, offset: 64)
!432 = !{i32 2, !"Dwarf Version", i32 4}
!433 = !{i32 2, !"Debug Info Version", i32 3}
!434 = !{i32 1, !"wchar_size", i32 4}
!435 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!436 = distinct !DISubprogram(name: "clusterLoadConfig", scope: !3, file: !3, line: 90, type: !437, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{!177, !178}
!439 = !{!440, !441, !638, !675, !676, !677, !678, !680, !682, !683, !684, !685, !686, !687, !688, !692, !693, !696, !697}
!440 = !DILocalVariable(name: "filename", arg: 1, scope: !436, file: !3, line: 90, type: !178)
!441 = !DILocalVariable(name: "fp", scope: !436, file: !3, line: 91, type: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !444, line: 66, baseType: !445)
!444 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !446, line: 287, baseType: !447)
!446 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !446, line: 181, size: 1408, elements: !448)
!448 = !{!449, !450, !451, !452, !454, !455, !460, !461, !462, !607, !613, !618, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !636, !637}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !447, file: !446, line: 182, baseType: !246, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !447, file: !446, line: 183, baseType: !177, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !447, file: !446, line: 184, baseType: !177, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !447, file: !446, line: 185, baseType: !453, size: 16, offset: 128)
!453 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !447, file: !446, line: 186, baseType: !453, size: 16, offset: 144)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !447, file: !446, line: 187, baseType: !456, size: 128, offset: 192)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !446, line: 117, size: 128, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !456, file: !446, line: 118, baseType: !246, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !456, file: !446, line: 119, baseType: !177, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !447, file: !446, line: 188, baseType: !177, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !447, file: !446, line: 195, baseType: !6, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !447, file: !446, line: 197, baseType: !463, size: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!15, !466, !6, !178, !177}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !446, line: 569, size: 14912, elements: !468)
!468 = !{!469, !470, !472, !473, !474, !475, !479, !480, !483, !484, !488, !500, !501, !502, !504, !505, !506, !575, !594, !595, !598, !605}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !467, file: !446, line: 571, baseType: !177, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !467, file: !446, line: 576, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !467, file: !446, line: 576, baseType: !471, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !467, file: !446, line: 576, baseType: !471, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !467, file: !446, line: 578, baseType: !177, size: 32, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !467, file: !446, line: 579, baseType: !476, size: 200, offset: 288)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 200, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 25)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !467, file: !446, line: 582, baseType: !177, size: 32, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !467, file: !446, line: 583, baseType: !481, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !446, line: 40, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !467, file: !446, line: 585, baseType: !177, size: 32, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !467, file: !446, line: 587, baseType: !485, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !466}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !467, file: !446, line: 590, baseType: !489, size: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !446, line: 47, size: 256, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !490, file: !446, line: 49, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !490, file: !446, line: 50, baseType: !177, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !490, file: !446, line: 50, baseType: !177, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !490, file: !446, line: 50, baseType: !177, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !490, file: !446, line: 50, baseType: !177, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !490, file: !446, line: 51, baseType: !498, size: 32, offset: 192)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 32, elements: !135)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !446, line: 25, baseType: !45)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !467, file: !446, line: 591, baseType: !177, size: 32, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !467, file: !446, line: 592, baseType: !489, size: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !467, file: !446, line: 593, baseType: !503, size: 64, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !467, file: !446, line: 596, baseType: !177, size: 32, offset: 1024)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !467, file: !446, line: 597, baseType: !178, size: 64, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !467, file: !446, line: 632, baseType: !507, size: 2880, offset: 1152)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !467, file: !446, line: 599, size: 2880, elements: !508)
!508 = !{!509, !566}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !507, file: !446, line: 622, baseType: !510, size: 1728)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !446, line: 601, size: 1728, elements: !511)
!511 = !{!512, !513, !514, !518, !530, !531, !532, !539, !552, !553, !554, !555, !559, !560, !561, !562, !563, !564, !565}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !510, file: !446, line: 603, baseType: !45, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !510, file: !446, line: 604, baseType: !178, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !510, file: !446, line: 605, baseType: !515, size: 208, offset: 128)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 208, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 26)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !510, file: !446, line: 606, baseType: !519, size: 288, offset: 352)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !446, line: 55, size: 288, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !519, file: !446, line: 57, baseType: !177, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !519, file: !446, line: 58, baseType: !177, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !519, file: !446, line: 59, baseType: !177, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !519, file: !446, line: 60, baseType: !177, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !519, file: !446, line: 61, baseType: !177, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !519, file: !446, line: 62, baseType: !177, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !519, file: !446, line: 63, baseType: !177, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !519, file: !446, line: 64, baseType: !177, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !519, file: !446, line: 65, baseType: !177, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !510, file: !446, line: 607, baseType: !177, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !510, file: !446, line: 608, baseType: !7, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !510, file: !446, line: 609, baseType: !533, size: 112, offset: 768)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !446, line: 319, size: 112, elements: !534)
!534 = !{!535, !537, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !533, file: !446, line: 320, baseType: !536, size: 48)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 48, elements: !125)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !533, file: !446, line: 321, baseType: !536, size: 48, offset: 48)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !533, file: !446, line: 322, baseType: !35, size: 16, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !510, file: !446, line: 610, baseType: !540, size: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !11, line: 171, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 163, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !541, file: !11, line: 165, baseType: !177, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !541, file: !11, line: 170, baseType: !545, size: 32, offset: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !541, file: !11, line: 166, size: 32, elements: !546)
!546 = !{!547, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !545, file: !11, line: 168, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !549, line: 124, baseType: !45)
!549 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !545, file: !11, line: 169, baseType: !551, size: 32)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !66)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !510, file: !446, line: 611, baseType: !540, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !510, file: !446, line: 612, baseType: !540, size: 64, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !510, file: !446, line: 613, baseType: !47, size: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !510, file: !446, line: 614, baseType: !556, size: 192, offset: 1152)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 192, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 24)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !510, file: !446, line: 615, baseType: !177, size: 32, offset: 1344)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !510, file: !446, line: 616, baseType: !540, size: 64, offset: 1376)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !510, file: !446, line: 617, baseType: !540, size: 64, offset: 1440)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !510, file: !446, line: 618, baseType: !540, size: 64, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !510, file: !446, line: 619, baseType: !540, size: 64, offset: 1568)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !510, file: !446, line: 620, baseType: !540, size: 64, offset: 1632)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !510, file: !446, line: 621, baseType: !177, size: 32, offset: 1696)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !507, file: !446, line: 631, baseType: !567, size: 2880)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !446, line: 626, size: 2880, elements: !568)
!568 = !{!569, !573}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !567, file: !446, line: 629, baseType: !570, size: 1920)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1920, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 30)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !567, file: !446, line: 630, baseType: !574, size: 960, offset: 1920)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 960, elements: !571)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !467, file: !446, line: 636, baseType: !576, size: 64, offset: 4032)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !446, line: 93, size: 6336, elements: !578)
!578 = !{!579, !580, !581, !586}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !577, file: !446, line: 94, baseType: !576, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !577, file: !446, line: 95, baseType: !177, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !577, file: !446, line: 97, baseType: !582, size: 2048, offset: 128)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 2048, elements: !584)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!584 = !{!585}
!585 = !DISubrange(count: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !577, file: !446, line: 98, baseType: !587, size: 4160, offset: 2176)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !446, line: 74, size: 4160, elements: !588)
!588 = !{!589, !591, !592, !593}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !587, file: !446, line: 75, baseType: !590, size: 2048)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2048, elements: !584)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !587, file: !446, line: 76, baseType: !590, size: 2048, offset: 2048)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !587, file: !446, line: 78, baseType: !499, size: 32, offset: 4096)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !587, file: !446, line: 81, baseType: !499, size: 32, offset: 4128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !467, file: !446, line: 637, baseType: !577, size: 6336, offset: 4096)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !467, file: !446, line: 641, baseType: !596, size: 64, offset: 10432)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !467, file: !446, line: 646, baseType: !599, size: 192, offset: 10496)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !446, line: 291, size: 192, elements: !600)
!600 = !{!601, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !599, file: !446, line: 293, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !599, file: !446, line: 294, baseType: !177, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !599, file: !446, line: 295, baseType: !471, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !467, file: !446, line: 648, baseType: !606, size: 4224, offset: 10688)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 4224, elements: !125)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !447, file: !446, line: 199, baseType: !608, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!15, !466, !6, !611, !177}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !447, file: !446, line: 202, baseType: !614, size: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !466, !6, !617, !177}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !11, line: 114, baseType: !13)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !447, file: !446, line: 203, baseType: !619, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!177, !466, !6}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !447, file: !446, line: 206, baseType: !456, size: 128, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !447, file: !446, line: 207, baseType: !246, size: 64, offset: 832)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !447, file: !446, line: 208, baseType: !177, size: 32, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !447, file: !446, line: 211, baseType: !124, size: 24, offset: 928)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !447, file: !446, line: 212, baseType: !627, size: 8, offset: 952)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !135)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !447, file: !446, line: 215, baseType: !456, size: 128, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !447, file: !446, line: 218, baseType: !177, size: 32, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !447, file: !446, line: 219, baseType: !12, size: 64, offset: 1152)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !447, file: !446, line: 222, baseType: !466, size: 64, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !447, file: !446, line: 226, baseType: !633, size: 32, offset: 1280)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !11, line: 175, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !635, line: 12, baseType: !177)
!635 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !447, file: !446, line: 228, baseType: !540, size: 64, offset: 1312)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !447, file: !446, line: 229, baseType: !177, size: 32, offset: 1376)
!638 = !DILocalVariable(name: "sb", scope: !436, file: !3, line: 92, type: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !640, line: 27, size: 704, elements: !641)
!640 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/stat.h", directory: "/root/.unikraft/apps/redis/build")
!641 = !{!642, !645, !648, !651, !654, !657, !660, !661, !662, !667, !668, !669, !672}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !639, file: !640, line: 29, baseType: !643, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !9, line: 177, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !11, line: 54, baseType: !453)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !639, file: !640, line: 30, baseType: !646, size: 16, offset: 16)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !9, line: 155, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !11, line: 73, baseType: !35)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !639, file: !640, line: 31, baseType: !649, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !9, line: 205, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !11, line: 88, baseType: !44)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !639, file: !640, line: 32, baseType: !652, size: 16, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !9, line: 210, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !11, line: 210, baseType: !35)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !639, file: !640, line: 33, baseType: !655, size: 16, offset: 80)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !9, line: 181, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !11, line: 58, baseType: !35)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !639, file: !640, line: 34, baseType: !658, size: 16, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !9, line: 185, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !11, line: 61, baseType: !35)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !639, file: !640, line: 35, baseType: !643, size: 16, offset: 112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !639, file: !640, line: 36, baseType: !8, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !639, file: !640, line: 37, baseType: !663, size: 128, offset: 192)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !289, line: 52, size: 128, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !663, file: !289, line: 53, baseType: !288, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !663, file: !289, line: 54, baseType: !13, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !639, file: !640, line: 38, baseType: !663, size: 128, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !639, file: !640, line: 39, baseType: !663, size: 128, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !639, file: !640, line: 40, baseType: !670, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !9, line: 118, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !11, line: 32, baseType: !13)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !639, file: !640, line: 41, baseType: !673, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !9, line: 113, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !11, line: 28, baseType: !13)
!675 = !DILocalVariable(name: "line", scope: !436, file: !3, line: 93, type: !178)
!676 = !DILocalVariable(name: "maxline", scope: !436, file: !3, line: 94, type: !177)
!677 = !DILocalVariable(name: "j", scope: !436, file: !3, line: 94, type: !177)
!678 = !DILocalVariable(name: "argc", scope: !679, file: !3, line: 124, type: !177)
!679 = distinct !DILexicalBlock(scope: !436, file: !3, line: 123, column: 43)
!680 = !DILocalVariable(name: "argv", scope: !679, file: !3, line: 125, type: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!682 = !DILocalVariable(name: "n", scope: !679, file: !3, line: 126, type: !378)
!683 = !DILocalVariable(name: "master", scope: !679, file: !3, line: 126, type: !378)
!684 = !DILocalVariable(name: "p", scope: !679, file: !3, line: 127, type: !178)
!685 = !DILocalVariable(name: "s", scope: !679, file: !3, line: 127, type: !178)
!686 = !DILocalVariable(name: "port", scope: !679, file: !3, line: 172, type: !178)
!687 = !DILocalVariable(name: "busp", scope: !679, file: !3, line: 173, type: !178)
!688 = !DILocalVariable(name: "start", scope: !689, file: !3, line: 237, type: !177)
!689 = distinct !DILexicalBlock(scope: !690, file: !3, line: 236, column: 36)
!690 = distinct !DILexicalBlock(scope: !691, file: !3, line: 236, column: 9)
!691 = distinct !DILexicalBlock(scope: !679, file: !3, line: 236, column: 9)
!692 = !DILocalVariable(name: "stop", scope: !689, file: !3, line: 237, type: !177)
!693 = !DILocalVariable(name: "slot", scope: !694, file: !3, line: 241, type: !177)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 239, column: 36)
!695 = distinct !DILexicalBlock(scope: !689, file: !3, line: 239, column: 17)
!696 = !DILocalVariable(name: "direction", scope: !694, file: !3, line: 242, type: !48)
!697 = !DILocalVariable(name: "cn", scope: !694, file: !3, line: 243, type: !378)
!698 = !DILocation(line: 90, column: 29, scope: !436)
!699 = !DILocation(line: 91, column: 16, scope: !436)
!700 = !DILocation(line: 91, column: 11, scope: !436)
!701 = !DILocation(line: 92, column: 5, scope: !436)
!702 = !DILocation(line: 96, column: 12, scope: !703)
!703 = distinct !DILexicalBlock(scope: !436, file: !3, line: 96, column: 9)
!704 = !DILocation(line: 96, column: 9, scope: !436)
!705 = !DILocation(line: 97, column: 13, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !3, line: 97, column: 13)
!707 = distinct !DILexicalBlock(scope: !703, file: !3, line: 96, column: 21)
!708 = !{!709, !709, i64 0}
!709 = !{!"int", !710, i64 0}
!710 = !{!"omnipotent char", !711, i64 0}
!711 = !{!"Simple C/C++ TBAA"}
!712 = !DILocation(line: 97, column: 19, scope: !706)
!713 = !DILocation(line: 97, column: 13, scope: !707)
!714 = !DILocation(line: 102, column: 36, scope: !715)
!715 = distinct !DILexicalBlock(scope: !706, file: !3, line: 99, column: 16)
!716 = !DILocation(line: 102, column: 27, scope: !715)
!717 = !DILocation(line: 100, column: 13, scope: !715)
!718 = !DILocation(line: 103, column: 13, scope: !715)
!719 = !DILocation(line: 109, column: 15, scope: !720)
!720 = distinct !DILexicalBlock(scope: !436, file: !3, line: 109, column: 9)
!721 = !DILocation(line: 92, column: 17, scope: !436)
!722 = !DILocation(line: 109, column: 9, scope: !720)
!723 = !DILocation(line: 109, column: 31, scope: !720)
!724 = !DILocation(line: 109, column: 37, scope: !720)
!725 = !DILocation(line: 109, column: 43, scope: !720)
!726 = !{!727, !729, i64 16}
!727 = !{!"stat", !728, i64 0, !728, i64 2, !709, i64 4, !728, i64 8, !728, i64 10, !728, i64 12, !728, i64 14, !729, i64 16, !730, i64 24, !730, i64 40, !730, i64 56, !729, i64 72, !729, i64 80}
!728 = !{!"short", !710, i64 0}
!729 = !{!"long", !710, i64 0}
!730 = !{!"timespec", !729, i64 0, !729, i64 8}
!731 = !DILocation(line: 109, column: 51, scope: !720)
!732 = !DILocation(line: 109, column: 9, scope: !436)
!733 = !DILocation(line: 110, column: 9, scope: !734)
!734 = distinct !DILexicalBlock(scope: !720, file: !3, line: 109, column: 57)
!735 = !DILocation(line: 111, column: 9, scope: !734)
!736 = !DILocation(line: 94, column: 9, scope: !436)
!737 = !DILocation(line: 122, column: 12, scope: !436)
!738 = !DILocation(line: 93, column: 11, scope: !436)
!739 = !DILocation(line: 123, column: 11, scope: !436)
!740 = !DILocation(line: 123, column: 34, scope: !436)
!741 = !DILocation(line: 123, column: 5, scope: !436)
!742 = !DILocation(line: 124, column: 9, scope: !679)
!743 = !DILocation(line: 132, column: 13, scope: !744)
!744 = distinct !DILexicalBlock(scope: !679, file: !3, line: 132, column: 13)
!745 = !{!710, !710, i64 0}
!746 = !DILocation(line: 132, column: 29, scope: !744)
!747 = distinct !{!747, !741, !748}
!748 = !DILocation(line: 276, column: 5, scope: !436)
!749 = !DILocation(line: 124, column: 13, scope: !679)
!750 = !DILocation(line: 135, column: 16, scope: !679)
!751 = !DILocation(line: 125, column: 14, scope: !679)
!752 = !DILocation(line: 136, column: 18, scope: !753)
!753 = distinct !DILexicalBlock(scope: !679, file: !3, line: 136, column: 13)
!754 = !DILocation(line: 136, column: 13, scope: !679)
!755 = !DILocation(line: 140, column: 24, scope: !756)
!756 = distinct !DILexicalBlock(scope: !679, file: !3, line: 140, column: 13)
!757 = !{!758, !758, i64 0}
!758 = !{!"any pointer", !710, i64 0}
!759 = !DILocation(line: 140, column: 13, scope: !756)
!760 = !DILocation(line: 140, column: 40, scope: !756)
!761 = !DILocation(line: 0, scope: !762)
!762 = distinct !DILexicalBlock(scope: !679, file: !3, line: 160, column: 13)
!763 = !DILocation(line: 140, column: 13, scope: !679)
!764 = !DILocation(line: 141, column: 24, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 141, column: 17)
!766 = distinct !DILexicalBlock(scope: !756, file: !3, line: 140, column: 46)
!767 = !DILocation(line: 141, column: 17, scope: !766)
!768 = !DILocation(line: 94, column: 18, scope: !436)
!769 = !DILocation(line: 142, column: 27, scope: !770)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 142, column: 13)
!771 = distinct !DILexicalBlock(scope: !766, file: !3, line: 142, column: 13)
!772 = !DILocation(line: 142, column: 13, scope: !771)
!773 = !DILocation(line: 143, column: 32, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 143, column: 21)
!775 = distinct !DILexicalBlock(scope: !770, file: !3, line: 142, column: 43)
!776 = !DILocation(line: 143, column: 21, scope: !774)
!777 = !DILocation(line: 143, column: 56, scope: !774)
!778 = !DILocation(line: 143, column: 21, scope: !775)
!779 = !DILocation(line: 145, column: 44, scope: !780)
!780 = distinct !DILexicalBlock(scope: !774, file: !3, line: 143, column: 62)
!781 = !DILocation(line: 145, column: 38, scope: !780)
!782 = !DILocation(line: 145, column: 29, scope: !780)
!783 = !DILocation(line: 144, column: 28, scope: !780)
!784 = !{!785, !758, i64 2944}
!785 = !{!"redisServer", !709, i64 0, !758, i64 8, !758, i64 16, !758, i64 24, !709, i64 32, !709, i64 36, !709, i64 40, !758, i64 48, !758, i64 56, !758, i64 64, !758, i64 72, !709, i64 80, !709, i64 84, !709, i64 88, !709, i64 92, !758, i64 96, !758, i64 104, !709, i64 112, !709, i64 116, !710, i64 120, !709, i64 164, !729, i64 168, !709, i64 176, !758, i64 184, !758, i64 192, !758, i64 200, !710, i64 208, !709, i64 216, !709, i64 220, !710, i64 224, !709, i64 352, !758, i64 360, !709, i64 368, !710, i64 372, !709, i64 436, !709, i64 440, !710, i64 444, !709, i64 508, !758, i64 512, !758, i64 520, !758, i64 528, !758, i64 536, !758, i64 544, !758, i64 552, !758, i64 560, !709, i64 568, !786, i64 576, !710, i64 584, !758, i64 840, !729, i64 848, !709, i64 856, !709, i64 860, !729, i64 864, !729, i64 872, !729, i64 880, !729, i64 888, !758, i64 896, !758, i64 904, !758, i64 912, !758, i64 920, !758, i64 928, !758, i64 936, !758, i64 944, !758, i64 952, !758, i64 960, !758, i64 968, !758, i64 976, !758, i64 984, !758, i64 992, !729, i64 1000, !786, i64 1008, !786, i64 1016, !786, i64 1024, !787, i64 1032, !786, i64 1040, !786, i64 1048, !786, i64 1056, !786, i64 1064, !786, i64 1072, !786, i64 1080, !786, i64 1088, !786, i64 1096, !786, i64 1104, !729, i64 1112, !786, i64 1120, !787, i64 1128, !786, i64 1136, !786, i64 1144, !786, i64 1152, !786, i64 1160, !758, i64 1168, !786, i64 1176, !786, i64 1184, !729, i64 1192, !788, i64 1200, !786, i64 1240, !786, i64 1248, !729, i64 1256, !729, i64 1264, !710, i64 1272, !709, i64 1728, !709, i64 1732, !709, i64 1736, !709, i64 1740, !709, i64 1744, !729, i64 1752, !709, i64 1760, !709, i64 1764, !709, i64 1768, !709, i64 1772, !729, i64 1776, !729, i64 1784, !709, i64 1792, !709, i64 1796, !709, i64 1800, !709, i64 1804, !710, i64 1808, !709, i64 1880, !709, i64 1884, !758, i64 1888, !709, i64 1896, !709, i64 1900, !729, i64 1904, !729, i64 1912, !729, i64 1920, !729, i64 1928, !709, i64 1936, !709, i64 1940, !758, i64 1944, !758, i64 1952, !709, i64 1960, !709, i64 1964, !729, i64 1968, !729, i64 1976, !729, i64 1984, !729, i64 1992, !709, i64 2000, !729, i64 2008, !709, i64 2016, !709, i64 2020, !709, i64 2024, !709, i64 2028, !709, i64 2032, !709, i64 2036, !709, i64 2040, !709, i64 2044, !709, i64 2048, !709, i64 2052, !709, i64 2056, !709, i64 2060, !709, i64 2064, !758, i64 2072, !786, i64 2080, !786, i64 2088, !709, i64 2096, !758, i64 2104, !709, i64 2112, !758, i64 2120, !709, i64 2128, !709, i64 2132, !729, i64 2136, !729, i64 2144, !729, i64 2152, !729, i64 2160, !709, i64 2168, !709, i64 2172, !709, i64 2176, !709, i64 2180, !709, i64 2184, !709, i64 2188, !710, i64 2192, !789, i64 2200, !790, i64 2224, !758, i64 2240, !709, i64 2248, !758, i64 2256, !709, i64 2264, !710, i64 2268, !710, i64 2309, !786, i64 2352, !786, i64 2360, !709, i64 2368, !709, i64 2372, !758, i64 2376, !786, i64 2384, !786, i64 2392, !786, i64 2400, !786, i64 2408, !729, i64 2416, !729, i64 2424, !709, i64 2432, !709, i64 2436, !709, i64 2440, !709, i64 2444, !709, i64 2448, !758, i64 2456, !758, i64 2464, !709, i64 2472, !709, i64 2476, !758, i64 2480, !758, i64 2488, !709, i64 2496, !709, i64 2500, !729, i64 2504, !729, i64 2512, !729, i64 2520, !709, i64 2528, !709, i64 2532, !758, i64 2536, !729, i64 2544, !709, i64 2552, !709, i64 2556, !709, i64 2560, !729, i64 2568, !709, i64 2576, !709, i64 2580, !709, i64 2584, !758, i64 2592, !710, i64 2600, !786, i64 2648, !709, i64 2656, !758, i64 2664, !758, i64 2672, !709, i64 2680, !758, i64 2688, !709, i64 2696, !709, i64 2700, !786, i64 2704, !709, i64 2712, !709, i64 2716, !709, i64 2720, !709, i64 2724, !786, i64 2728, !709, i64 2736, !710, i64 2740, !758, i64 2768, !758, i64 2776, !709, i64 2784, !709, i64 2788, !709, i64 2792, !709, i64 2796, !729, i64 2800, !729, i64 2808, !729, i64 2816, !729, i64 2824, !729, i64 2832, !729, i64 2840, !729, i64 2848, !729, i64 2856, !709, i64 2864, !709, i64 2868, !729, i64 2872, !729, i64 2880, !709, i64 2888, !786, i64 2896, !758, i64 2904, !758, i64 2912, !709, i64 2920, !709, i64 2924, !786, i64 2928, !758, i64 2936, !758, i64 2944, !709, i64 2952, !709, i64 2956, !709, i64 2960, !709, i64 2964, !758, i64 2968, !709, i64 2976, !709, i64 2980, !709, i64 2984, !758, i64 2992, !758, i64 3000, !758, i64 3008, !758, i64 3016, !786, i64 3024, !786, i64 3032, !786, i64 3040, !709, i64 3048, !709, i64 3052, !709, i64 3056, !709, i64 3060, !709, i64 3064, !709, i64 3068, !709, i64 3072, !709, i64 3076, !709, i64 3080, !709, i64 3084, !709, i64 3088, !786, i64 3096, !758, i64 3104, !758, i64 3112, !758, i64 3120, !709, i64 3128, !709, i64 3132, !709, i64 3136, !729, i64 3144, !758, i64 3152, !758, i64 3160, !758, i64 3168}
!786 = !{!"long long", !710, i64 0}
!787 = !{!"double", !710, i64 0}
!788 = !{!"malloc_stats", !729, i64 0, !729, i64 8, !729, i64 16, !729, i64 24, !729, i64 32}
!789 = !{!"", !709, i64 0, !729, i64 8, !786, i64 16}
!790 = !{!"redisOpArray", !758, i64 0, !709, i64 8}
!791 = !DILocation(line: 144, column: 37, scope: !780)
!792 = !DILocation(line: 144, column: 50, scope: !780)
!793 = !{!794, !729, i64 8}
!794 = !{!"clusterState", !758, i64 0, !729, i64 8, !709, i64 16, !709, i64 20, !758, i64 24, !758, i64 32, !710, i64 40, !710, i64 131112, !710, i64 262184, !710, i64 393256, !758, i64 524328, !786, i64 524336, !709, i64 524344, !709, i64 524348, !709, i64 524352, !729, i64 524360, !709, i64 524368, !786, i64 524376, !758, i64 524384, !786, i64 524392, !709, i64 524400, !729, i64 524408, !709, i64 524416, !710, i64 524424, !710, i64 524504, !786, i64 524584}
!795 = !DILocation(line: 146, column: 17, scope: !780)
!796 = !DILocation(line: 146, column: 28, scope: !797)
!797 = distinct !DILexicalBlock(scope: !774, file: !3, line: 146, column: 28)
!798 = !DILocation(line: 146, column: 64, scope: !797)
!799 = !DILocation(line: 146, column: 28, scope: !774)
!800 = !DILocation(line: 148, column: 44, scope: !801)
!801 = distinct !DILexicalBlock(scope: !797, file: !3, line: 146, column: 70)
!802 = !DILocation(line: 148, column: 38, scope: !801)
!803 = !DILocation(line: 148, column: 29, scope: !801)
!804 = !DILocation(line: 147, column: 28, scope: !801)
!805 = !DILocation(line: 147, column: 37, scope: !801)
!806 = !DILocation(line: 147, column: 51, scope: !801)
!807 = !{!794, !729, i64 524408}
!808 = !DILocation(line: 149, column: 17, scope: !801)
!809 = !DILocation(line: 150, column: 21, scope: !810)
!810 = distinct !DILexicalBlock(scope: !797, file: !3, line: 149, column: 24)
!811 = !DILocation(line: 142, column: 37, scope: !770)
!812 = !DILocation(line: 142, column: 29, scope: !770)
!813 = distinct !{!813, !772, !814}
!814 = !DILocation(line: 154, column: 13, scope: !771)
!815 = !DILocation(line: 155, column: 13, scope: !766)
!816 = !DILocation(line: 156, column: 13, scope: !766)
!817 = !DILocation(line: 160, column: 18, scope: !762)
!818 = !DILocation(line: 160, column: 13, scope: !679)
!819 = !DILocalVariable(name: "name", arg: 1, scope: !820, file: !3, line: 936, type: !611)
!820 = distinct !DISubprogram(name: "clusterLookupNode", scope: !3, file: !3, line: 936, type: !821, isLocal: false, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{!378, !611}
!823 = !{!819, !824, !825}
!824 = !DILocalVariable(name: "s", scope: !820, file: !3, line: 937, type: !189)
!825 = !DILocalVariable(name: "de", scope: !820, file: !3, line: 938, type: !340)
!826 = !DILocation(line: 936, column: 44, scope: !820, inlinedAt: !827)
!827 = distinct !DILocation(line: 163, column: 13, scope: !679)
!828 = !DILocation(line: 937, column: 13, scope: !820, inlinedAt: !827)
!829 = !DILocation(line: 937, column: 9, scope: !820, inlinedAt: !827)
!830 = !DILocation(line: 940, column: 26, scope: !820, inlinedAt: !827)
!831 = !DILocation(line: 940, column: 35, scope: !820, inlinedAt: !827)
!832 = !{!794, !758, i64 24}
!833 = !DILocation(line: 940, column: 10, scope: !820, inlinedAt: !827)
!834 = !DILocation(line: 938, column: 16, scope: !820, inlinedAt: !827)
!835 = !DILocation(line: 941, column: 5, scope: !820, inlinedAt: !827)
!836 = !DILocation(line: 942, column: 12, scope: !837, inlinedAt: !827)
!837 = distinct !DILexicalBlock(scope: !820, file: !3, line: 942, column: 9)
!838 = !DILocation(line: 942, column: 9, scope: !820, inlinedAt: !827)
!839 = !DILocation(line: 943, column: 12, scope: !820, inlinedAt: !827)
!840 = !DILocation(line: 126, column: 22, scope: !679)
!841 = !DILocation(line: 164, column: 14, scope: !842)
!842 = distinct !DILexicalBlock(scope: !679, file: !3, line: 164, column: 13)
!843 = !DILocation(line: 164, column: 13, scope: !679)
!844 = !DILocation(line: 165, column: 35, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !3, line: 164, column: 17)
!846 = !DILocation(line: 165, column: 17, scope: !845)
!847 = !DILocalVariable(name: "node", arg: 1, scope: !848, file: !3, line: 887, type: !378)
!848 = distinct !DISubprogram(name: "clusterAddNode", scope: !3, file: !3, line: 887, type: !849, isLocal: false, isDefinition: true, scopeLine: 887, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{!177, !378}
!851 = !{!847, !852}
!852 = !DILocalVariable(name: "retval", scope: !848, file: !3, line: 888, type: !177)
!853 = !DILocation(line: 887, column: 33, scope: !848, inlinedAt: !854)
!854 = distinct !DILocation(line: 166, column: 13, scope: !845)
!855 = !DILocation(line: 890, column: 29, scope: !848, inlinedAt: !854)
!856 = !DILocation(line: 890, column: 38, scope: !848, inlinedAt: !854)
!857 = !DILocation(line: 891, column: 23, scope: !848, inlinedAt: !854)
!858 = !DILocation(line: 891, column: 13, scope: !848, inlinedAt: !854)
!859 = !DILocation(line: 891, column: 52, scope: !848, inlinedAt: !854)
!860 = !DILocation(line: 890, column: 14, scope: !848, inlinedAt: !854)
!861 = !DILocation(line: 888, column: 9, scope: !848, inlinedAt: !854)
!862 = !DILocation(line: 167, column: 9, scope: !845)
!863 = !DILocation(line: 0, scope: !845)
!864 = !DILocation(line: 169, column: 26, scope: !865)
!865 = distinct !DILexicalBlock(scope: !679, file: !3, line: 169, column: 13)
!866 = !DILocation(line: 169, column: 18, scope: !865)
!867 = !DILocation(line: 127, column: 15, scope: !679)
!868 = !DILocation(line: 169, column: 40, scope: !865)
!869 = !DILocation(line: 169, column: 13, scope: !679)
!870 = !DILocation(line: 170, column: 12, scope: !679)
!871 = !DILocation(line: 171, column: 16, scope: !679)
!872 = !DILocation(line: 171, column: 22, scope: !679)
!873 = !DILocation(line: 171, column: 30, scope: !679)
!874 = !DILocation(line: 171, column: 45, scope: !679)
!875 = !DILocation(line: 171, column: 9, scope: !679)
!876 = !DILocation(line: 172, column: 23, scope: !679)
!877 = !DILocation(line: 172, column: 15, scope: !679)
!878 = !DILocation(line: 173, column: 22, scope: !679)
!879 = !DILocation(line: 173, column: 15, scope: !679)
!880 = !DILocation(line: 174, column: 13, scope: !881)
!881 = distinct !DILexicalBlock(scope: !679, file: !3, line: 174, column: 13)
!882 = !DILocation(line: 174, column: 13, scope: !679)
!883 = !DILocation(line: 175, column: 19, scope: !884)
!884 = distinct !DILexicalBlock(scope: !881, file: !3, line: 174, column: 19)
!885 = !DILocation(line: 176, column: 17, scope: !884)
!886 = !DILocation(line: 177, column: 9, scope: !884)
!887 = !DILocation(line: 0, scope: !679)
!888 = !DILocation(line: 178, column: 19, scope: !679)
!889 = !DILocation(line: 178, column: 12, scope: !679)
!890 = !DILocation(line: 178, column: 17, scope: !679)
!891 = !{!892, !709, i64 2240}
!892 = !{!"clusterNode", !786, i64 0, !710, i64 8, !709, i64 48, !729, i64 56, !710, i64 64, !709, i64 2112, !709, i64 2116, !758, i64 2120, !758, i64 2128, !786, i64 2136, !786, i64 2144, !786, i64 2152, !786, i64 2160, !786, i64 2168, !786, i64 2176, !786, i64 2184, !710, i64 2192, !709, i64 2240, !709, i64 2244, !758, i64 2248, !758, i64 2256}
!893 = !DILocation(line: 182, column: 20, scope: !679)
!894 = !DILocation(line: 182, column: 27, scope: !679)
!895 = !DILocation(line: 182, column: 48, scope: !679)
!896 = !DILocation(line: 182, column: 12, scope: !679)
!897 = !DILocation(line: 182, column: 18, scope: !679)
!898 = !{!892, !709, i64 2244}
!899 = !DILocation(line: 185, column: 17, scope: !679)
!900 = !DILocation(line: 127, column: 19, scope: !679)
!901 = !DILocation(line: 186, column: 9, scope: !679)
!902 = !DILocation(line: 187, column: 17, scope: !903)
!903 = distinct !DILexicalBlock(scope: !679, file: !3, line: 186, column: 18)
!904 = !DILocation(line: 188, column: 17, scope: !905)
!905 = distinct !DILexicalBlock(scope: !903, file: !3, line: 188, column: 17)
!906 = !DILocation(line: 188, column: 17, scope: !903)
!907 = !DILocation(line: 188, column: 23, scope: !905)
!908 = !DILocation(line: 188, column: 20, scope: !905)
!909 = !DILocation(line: 189, column: 18, scope: !910)
!910 = distinct !DILexicalBlock(scope: !903, file: !3, line: 189, column: 17)
!911 = !DILocation(line: 189, column: 17, scope: !903)
!912 = !DILocation(line: 190, column: 17, scope: !913)
!913 = distinct !DILexicalBlock(scope: !910, file: !3, line: 189, column: 42)
!914 = !{!794, !758, i64 0}
!915 = !DILocation(line: 191, column: 49, scope: !913)
!916 = !DILocation(line: 191, column: 24, scope: !913)
!917 = !DILocation(line: 192, column: 26, scope: !913)
!918 = !{!892, !709, i64 48}
!919 = !DILocation(line: 193, column: 13, scope: !913)
!920 = !DILocation(line: 193, column: 25, scope: !921)
!921 = distinct !DILexicalBlock(scope: !910, file: !3, line: 193, column: 24)
!922 = !DILocation(line: 193, column: 24, scope: !910)
!923 = !DILocation(line: 194, column: 26, scope: !924)
!924 = distinct !DILexicalBlock(scope: !921, file: !3, line: 193, column: 49)
!925 = !DILocation(line: 195, column: 13, scope: !924)
!926 = !DILocation(line: 195, column: 25, scope: !927)
!927 = distinct !DILexicalBlock(scope: !921, file: !3, line: 195, column: 24)
!928 = !DILocation(line: 195, column: 24, scope: !921)
!929 = !DILocation(line: 196, column: 26, scope: !930)
!930 = distinct !DILexicalBlock(scope: !927, file: !3, line: 195, column: 48)
!931 = !DILocation(line: 197, column: 13, scope: !930)
!932 = !DILocation(line: 197, column: 25, scope: !933)
!933 = distinct !DILexicalBlock(scope: !927, file: !3, line: 197, column: 24)
!934 = !DILocation(line: 197, column: 24, scope: !927)
!935 = !DILocation(line: 198, column: 26, scope: !936)
!936 = distinct !DILexicalBlock(scope: !933, file: !3, line: 197, column: 48)
!937 = !DILocation(line: 199, column: 13, scope: !936)
!938 = !DILocation(line: 199, column: 25, scope: !939)
!939 = distinct !DILexicalBlock(scope: !933, file: !3, line: 199, column: 24)
!940 = !DILocation(line: 199, column: 24, scope: !933)
!941 = !DILocation(line: 200, column: 26, scope: !942)
!942 = distinct !DILexicalBlock(scope: !939, file: !3, line: 199, column: 47)
!943 = !DILocation(line: 201, column: 32, scope: !942)
!944 = !DILocation(line: 201, column: 30, scope: !942)
!945 = !{!892, !786, i64 2152}
!946 = !DILocation(line: 202, column: 13, scope: !942)
!947 = !DILocation(line: 202, column: 25, scope: !948)
!948 = distinct !DILexicalBlock(scope: !939, file: !3, line: 202, column: 24)
!949 = !DILocation(line: 202, column: 24, scope: !939)
!950 = !DILocation(line: 203, column: 26, scope: !951)
!951 = distinct !DILexicalBlock(scope: !948, file: !3, line: 202, column: 52)
!952 = !DILocation(line: 204, column: 13, scope: !951)
!953 = !DILocation(line: 204, column: 25, scope: !954)
!954 = distinct !DILexicalBlock(scope: !948, file: !3, line: 204, column: 24)
!955 = !DILocation(line: 204, column: 24, scope: !948)
!956 = !DILocation(line: 205, column: 26, scope: !957)
!957 = distinct !DILexicalBlock(scope: !954, file: !3, line: 204, column: 49)
!958 = !DILocation(line: 206, column: 13, scope: !957)
!959 = !DILocation(line: 206, column: 25, scope: !960)
!960 = distinct !DILexicalBlock(scope: !954, file: !3, line: 206, column: 24)
!961 = !DILocation(line: 206, column: 24, scope: !954)
!962 = !DILocation(line: 207, column: 26, scope: !963)
!963 = distinct !DILexicalBlock(scope: !960, file: !3, line: 206, column: 53)
!964 = !DILocation(line: 208, column: 13, scope: !963)
!965 = !DILocation(line: 208, column: 25, scope: !966)
!966 = distinct !DILexicalBlock(scope: !960, file: !3, line: 208, column: 24)
!967 = !DILocation(line: 208, column: 24, scope: !960)
!968 = !DILocation(line: 211, column: 17, scope: !969)
!969 = distinct !DILexicalBlock(scope: !966, file: !3, line: 210, column: 20)
!970 = !DILocation(line: 213, column: 25, scope: !971)
!971 = distinct !DILexicalBlock(scope: !903, file: !3, line: 213, column: 17)
!972 = !DILocation(line: 213, column: 17, scope: !903)
!973 = distinct !{!973, !901, !974}
!974 = !DILocation(line: 214, column: 9, scope: !679)
!975 = !DILocation(line: 218, column: 13, scope: !976)
!976 = distinct !DILexicalBlock(scope: !679, file: !3, line: 218, column: 13)
!977 = !DILocation(line: 218, column: 24, scope: !976)
!978 = !DILocation(line: 218, column: 13, scope: !679)
!979 = !DILocation(line: 936, column: 44, scope: !820, inlinedAt: !980)
!980 = distinct !DILocation(line: 219, column: 22, scope: !981)
!981 = distinct !DILexicalBlock(scope: !976, file: !3, line: 218, column: 32)
!982 = !DILocation(line: 937, column: 13, scope: !820, inlinedAt: !980)
!983 = !DILocation(line: 937, column: 9, scope: !820, inlinedAt: !980)
!984 = !DILocation(line: 940, column: 26, scope: !820, inlinedAt: !980)
!985 = !DILocation(line: 940, column: 35, scope: !820, inlinedAt: !980)
!986 = !DILocation(line: 940, column: 10, scope: !820, inlinedAt: !980)
!987 = !DILocation(line: 938, column: 16, scope: !820, inlinedAt: !980)
!988 = !DILocation(line: 941, column: 5, scope: !820, inlinedAt: !980)
!989 = !DILocation(line: 942, column: 12, scope: !837, inlinedAt: !980)
!990 = !DILocation(line: 942, column: 9, scope: !820, inlinedAt: !980)
!991 = !DILocation(line: 943, column: 12, scope: !820, inlinedAt: !980)
!992 = !DILocation(line: 126, column: 26, scope: !679)
!993 = !DILocation(line: 220, column: 18, scope: !994)
!994 = distinct !DILexicalBlock(scope: !981, file: !3, line: 220, column: 17)
!995 = !DILocation(line: 220, column: 17, scope: !981)
!996 = !DILocation(line: 221, column: 44, scope: !997)
!997 = distinct !DILexicalBlock(scope: !994, file: !3, line: 220, column: 26)
!998 = !DILocation(line: 221, column: 26, scope: !997)
!999 = !DILocation(line: 887, column: 33, scope: !848, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 222, column: 17, scope: !997)
!1001 = !DILocation(line: 890, column: 29, scope: !848, inlinedAt: !1000)
!1002 = !DILocation(line: 890, column: 38, scope: !848, inlinedAt: !1000)
!1003 = !DILocation(line: 891, column: 23, scope: !848, inlinedAt: !1000)
!1004 = !DILocation(line: 891, column: 13, scope: !848, inlinedAt: !1000)
!1005 = !DILocation(line: 891, column: 52, scope: !848, inlinedAt: !1000)
!1006 = !DILocation(line: 890, column: 14, scope: !848, inlinedAt: !1000)
!1007 = !DILocation(line: 888, column: 9, scope: !848, inlinedAt: !1000)
!1008 = !DILocation(line: 223, column: 13, scope: !997)
!1009 = !DILocation(line: 0, scope: !997)
!1010 = !DILocation(line: 224, column: 16, scope: !981)
!1011 = !DILocation(line: 224, column: 24, scope: !981)
!1012 = !{!892, !758, i64 2128}
!1013 = !DILocalVariable(name: "master", arg: 1, scope: !1014, file: !3, line: 839, type: !378)
!1014 = distinct !DISubprogram(name: "clusterNodeAddSlave", scope: !3, file: !3, line: 839, type: !1015, isLocal: false, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!177, !378, !378}
!1017 = !{!1013, !1018, !1019}
!1018 = !DILocalVariable(name: "slave", arg: 2, scope: !1014, file: !3, line: 839, type: !378)
!1019 = !DILocalVariable(name: "j", scope: !1014, file: !3, line: 840, type: !177)
!1020 = !DILocation(line: 839, column: 38, scope: !1014, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 225, column: 13, scope: !981)
!1022 = !DILocation(line: 839, column: 59, scope: !1014, inlinedAt: !1021)
!1023 = !DILocation(line: 840, column: 9, scope: !1014, inlinedAt: !1021)
!1024 = !DILocation(line: 843, column: 29, scope: !1025, inlinedAt: !1021)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 843, column: 5)
!1026 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 843, column: 5)
!1027 = !{!892, !709, i64 2116}
!1028 = !DILocation(line: 843, column: 19, scope: !1025, inlinedAt: !1021)
!1029 = !DILocation(line: 0, scope: !1014, inlinedAt: !1021)
!1030 = !{!892, !758, i64 2120}
!1031 = !DILocation(line: 843, column: 5, scope: !1026, inlinedAt: !1021)
!1032 = !DILocation(line: 844, column: 13, scope: !1033, inlinedAt: !1021)
!1033 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 844, column: 13)
!1034 = distinct !{!1034, !1035, !1036}
!1035 = !DILocation(line: 843, column: 5, scope: !1026)
!1036 = !DILocation(line: 844, column: 48, scope: !1026)
!1037 = !DILocation(line: 844, column: 31, scope: !1033, inlinedAt: !1021)
!1038 = !DILocation(line: 843, column: 41, scope: !1025, inlinedAt: !1021)
!1039 = !DILocation(line: 844, column: 13, scope: !1025, inlinedAt: !1021)
!1040 = !DILocation(line: 845, column: 31, scope: !1014, inlinedAt: !1021)
!1041 = !DILocation(line: 846, column: 48, scope: !1014, inlinedAt: !1021)
!1042 = !DILocation(line: 846, column: 30, scope: !1014, inlinedAt: !1021)
!1043 = !DILocation(line: 846, column: 29, scope: !1014, inlinedAt: !1021)
!1044 = !DILocation(line: 845, column: 22, scope: !1014, inlinedAt: !1021)
!1045 = !DILocation(line: 845, column: 20, scope: !1014, inlinedAt: !1021)
!1046 = !DILocation(line: 847, column: 28, scope: !1014, inlinedAt: !1021)
!1047 = !DILocation(line: 847, column: 5, scope: !1014, inlinedAt: !1021)
!1048 = !DILocation(line: 847, column: 39, scope: !1014, inlinedAt: !1021)
!1049 = !DILocation(line: 848, column: 22, scope: !1014, inlinedAt: !1021)
!1050 = !DILocation(line: 849, column: 13, scope: !1014, inlinedAt: !1021)
!1051 = !DILocation(line: 849, column: 19, scope: !1014, inlinedAt: !1021)
!1052 = !DILocation(line: 850, column: 5, scope: !1014, inlinedAt: !1021)
!1053 = !DILocation(line: 229, column: 18, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !679, file: !3, line: 229, column: 13)
!1055 = !DILocation(line: 229, column: 13, scope: !1054)
!1056 = !DILocation(line: 229, column: 13, scope: !679)
!1057 = !DILocation(line: 229, column: 43, scope: !1054)
!1058 = !DILocation(line: 229, column: 31, scope: !1054)
!1059 = !DILocation(line: 229, column: 41, scope: !1054)
!1060 = !{!892, !786, i64 2136}
!1061 = !DILocation(line: 229, column: 28, scope: !1054)
!1062 = !DILocation(line: 230, column: 18, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !679, file: !3, line: 230, column: 13)
!1064 = !DILocation(line: 230, column: 13, scope: !1063)
!1065 = !DILocation(line: 230, column: 13, scope: !679)
!1066 = !DILocation(line: 230, column: 47, scope: !1063)
!1067 = !DILocation(line: 230, column: 31, scope: !1063)
!1068 = !DILocation(line: 230, column: 45, scope: !1063)
!1069 = !{!892, !786, i64 2144}
!1070 = !DILocation(line: 230, column: 28, scope: !1063)
!1071 = !DILocation(line: 233, column: 35, scope: !679)
!1072 = !DILocation(line: 233, column: 26, scope: !679)
!1073 = !DILocation(line: 233, column: 12, scope: !679)
!1074 = !DILocation(line: 233, column: 24, scope: !679)
!1075 = !{!892, !729, i64 56}
!1076 = !DILocation(line: 236, column: 25, scope: !690)
!1077 = !DILocation(line: 236, column: 23, scope: !690)
!1078 = !DILocation(line: 236, column: 9, scope: !691)
!1079 = !DILocation(line: 239, column: 17, scope: !695)
!1080 = !DILocation(line: 239, column: 28, scope: !695)
!1081 = !DILocation(line: 0, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !695, file: !3, line: 263, column: 24)
!1083 = !DILocation(line: 239, column: 17, scope: !689)
!1084 = !DILocation(line: 246, column: 17, scope: !694)
!1085 = !DILocation(line: 247, column: 20, scope: !694)
!1086 = !DILocation(line: 248, column: 29, scope: !694)
!1087 = !DILocation(line: 242, column: 22, scope: !694)
!1088 = !DILocation(line: 249, column: 29, scope: !694)
!1089 = !DILocation(line: 249, column: 36, scope: !694)
!1090 = !DILocation(line: 249, column: 24, scope: !694)
!1091 = !DILocation(line: 241, column: 21, scope: !694)
!1092 = !DILocation(line: 250, column: 30, scope: !1093)
