; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/debug.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/debug.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/debug.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !7, !8, !9, !10, !109, !112, !123, !133, !143}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !13, line: 829, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !13, line: 826, size: 128, elements: !15)
!15 = !{!16, !84}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !14, file: !13, line: 827, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !19, line: 82, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !19, line: 76, size: 768, elements: !21)
!21 = !{!22, !52, !53, !82, !83}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !19, line: 77, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !19, line: 65, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !19, line: 58, size: 384, elements: !26)
!26 = !{!27, !38, !42, !43, !47, !51}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !25, file: !19, line: 59, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !36}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 60, baseType: !33)
!32 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !34, line: 105, baseType: !35)
!34 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !25, file: !19, line: 60, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!4, !4, !36}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !25, file: !19, line: 61, baseType: !39, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !25, file: !19, line: 62, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!9, !4, !36, !36}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !25, file: !19, line: 63, baseType: !48, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !4, !4}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !25, file: !19, line: 64, baseType: !48, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !20, file: !19, line: 78, baseType: !4, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !20, file: !19, line: 79, baseType: !54, size: 512, offset: 128)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 512, elements: !80)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !19, line: 74, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !19, line: 69, size: 256, elements: !57)
!57 = !{!58, !77, !78, !79}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !56, file: !19, line: 70, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !19, line: 56, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !19, line: 47, size: 192, elements: !63)
!63 = !{!64, !65, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !62, file: !19, line: 48, baseType: !4, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !62, file: !19, line: 54, baseType: !66, size: 64, offset: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !19, line: 49, size: 64, elements: !67)
!67 = !{!68, !69, !70, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !66, file: !19, line: 50, baseType: !4, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !66, file: !19, line: 51, baseType: !31, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !66, file: !19, line: 52, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !32, line: 56, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !34, line: 103, baseType: !73)
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !66, file: !19, line: 53, baseType: !7, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !19, line: 55, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !19, line: 71, baseType: !35, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !56, file: !19, line: 72, baseType: !35, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !56, file: !19, line: 73, baseType: !35, size: 64, offset: 192)
!80 = !{!81}
!81 = !DISubrange(count: 2)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !20, file: !19, line: 80, baseType: !73, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !20, file: !19, line: 81, baseType: !35, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !14, file: !13, line: 828, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !13, line: 824, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !13, line: 820, size: 256, elements: !88)
!88 = !{!89, !106, !107, !108}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !87, file: !13, line: 821, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !13, line: 810, size: 192, elements: !92)
!92 = !{!93, !96, !97, !98}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !91, file: !13, line: 811, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !95, line: 43, baseType: !5)
!95 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !91, file: !13, line: 812, baseType: !7, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !91, file: !13, line: 813, baseType: !90, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !91, file: !13, line: 817, baseType: !99, offset: 192)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, elements: !104)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !13, line: 814, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !100, file: !13, line: 815, baseType: !90, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !100, file: !13, line: 816, baseType: !35, size: 64, offset: 64)
!104 = !{!105}
!105 = !DISubrange(count: -1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !13, line: 821, baseType: !90, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !87, file: !13, line: 822, baseType: !35, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !87, file: !13, line: 823, baseType: !9, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !9}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !95, line: 51, size: 24, elements: !114)
!114 = !{!115, !119, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !95, line: 52, baseType: !116, size: 8)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 43, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !113, file: !95, line: 53, baseType: !116, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !95, line: 54, baseType: !118, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !113, file: !95, line: 55, baseType: !122, offset: 24)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, elements: !104)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !95, line: 57, size: 40, elements: !125)
!125 = !{!126, !130, !131, !132}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !124, file: !95, line: 58, baseType: !127, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 36, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !34, line: 57, baseType: !129)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !95, line: 59, baseType: !127, size: 16, offset: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !124, file: !95, line: 60, baseType: !118, size: 8, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !124, file: !95, line: 61, baseType: !122, offset: 40)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !95, line: 63, size: 72, elements: !135)
!135 = !{!136, !140, !141, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !95, line: 64, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 48, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 79, baseType: !139)
!139 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !134, file: !95, line: 65, baseType: !137, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !95, line: 66, baseType: !118, size: 8, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !134, file: !95, line: 67, baseType: !122, offset: 72)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !95, line: 69, size: 136, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !144, file: !95, line: 70, baseType: !31, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !144, file: !95, line: 71, baseType: !31, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !95, line: 72, baseType: !118, size: 8, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !144, file: !95, line: 73, baseType: !122, offset: 136)
!150 = !{i32 2, !"Dwarf Version", i32 4}
!151 = !{i32 2, !"Debug Info Version", i32 3}
!152 = !{i32 1, !"wchar_size", i32 4}
!153 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!154 = distinct !DISubprogram(name: "xorDigest", scope: !1, file: !1, line: 64, type: !155, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !162)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157, !4, !158}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !159, line: 40, baseType: !160)
!159 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !161, line: 129, baseType: !35)
!161 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!162 = !{!163, !164, !165, !166, !181, !185, !186}
!163 = !DILocalVariable(name: "digest", arg: 1, scope: !154, file: !1, line: 64, type: !157)
!164 = !DILocalVariable(name: "ptr", arg: 2, scope: !154, file: !1, line: 64, type: !4)
!165 = !DILocalVariable(name: "len", arg: 3, scope: !154, file: !1, line: 64, type: !158)
!166 = !DILocalVariable(name: "ctx", scope: !154, file: !1, line: 65, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA1_CTX", file: !168, line: 14, baseType: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sha1.h", directory: "/root/.unikraft/apps/redis/build")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 10, size: 736, elements: !170)
!170 = !{!171, !175, !177}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !168, line: 11, baseType: !172, size: 160)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 5)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !169, file: !168, line: 12, baseType: !176, size: 64, offset: 160)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !80)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !169, file: !168, line: 13, baseType: !178, size: 512, offset: 224)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 512, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DILocalVariable(name: "hash", scope: !154, file: !1, line: 66, type: !182)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 160, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 20)
!185 = !DILocalVariable(name: "s", scope: !154, file: !1, line: 66, type: !157)
!186 = !DILocalVariable(name: "j", scope: !154, file: !1, line: 67, type: !9)
!187 = !DILocation(line: 64, column: 31, scope: !154)
!188 = !DILocation(line: 64, column: 45, scope: !154)
!189 = !DILocation(line: 64, column: 57, scope: !154)
!190 = !DILocation(line: 65, column: 5, scope: !154)
!191 = !DILocation(line: 66, column: 5, scope: !154)
!192 = !DILocation(line: 66, column: 19, scope: !154)
!193 = !DILocation(line: 66, column: 30, scope: !154)
!194 = !DILocation(line: 65, column: 14, scope: !154)
!195 = !DILocation(line: 69, column: 5, scope: !154)
!196 = !DILocation(line: 70, column: 23, scope: !154)
!197 = !DILocation(line: 70, column: 5, scope: !154)
!198 = !DILocation(line: 71, column: 5, scope: !154)
!199 = !DILocation(line: 67, column: 9, scope: !154)
!200 = !DILocation(line: 74, column: 22, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !1, line: 73, column: 5)
!202 = distinct !DILexicalBlock(scope: !154, file: !1, line: 73, column: 5)
!203 = !{!204, !204, i64 0}
!204 = !{!"omnipotent char", !205, i64 0}
!205 = !{!"Simple C/C++ TBAA"}
!206 = !DILocation(line: 74, column: 19, scope: !201)
!207 = !DILocation(line: 74, column: 9, scope: !201)
!208 = !DILocation(line: 75, column: 1, scope: !154)
!209 = distinct !DISubprogram(name: "xorStringObjectDigest", scope: !1, file: !1, line: 77, type: !210, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !221)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !157, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !13, line: 622, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !13, line: 614, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219, !220}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !13, line: 615, baseType: !139, size: 4, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !214, file: !13, line: 616, baseType: !139, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !214, file: !13, line: 617, baseType: !139, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !214, file: !13, line: 620, baseType: !9, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !214, file: !13, line: 621, baseType: !4, size: 64, offset: 64)
!221 = !{!222, !223}
!222 = !DILocalVariable(name: "digest", arg: 1, scope: !209, file: !1, line: 77, type: !157)
!223 = !DILocalVariable(name: "o", arg: 2, scope: !209, file: !1, line: 77, type: !212)
!224 = !DILocation(line: 77, column: 43, scope: !209)
!225 = !DILocation(line: 77, column: 57, scope: !209)
!226 = !DILocation(line: 78, column: 9, scope: !209)
!227 = !DILocation(line: 79, column: 25, scope: !209)
!228 = !{!229, !231, i64 8}
!229 = !{!"redisObject", !230, i64 0, !230, i64 0, !230, i64 1, !230, i64 4, !231, i64 8}
!230 = !{!"int", !204, i64 0}
!231 = !{!"any pointer", !204, i64 0}
!232 = !DILocalVariable(name: "s", arg: 1, scope: !233, file: !95, line: 87, type: !238)
!233 = distinct !DISubprogram(name: "sdslen", scope: !95, file: !95, line: 87, type: !234, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !239)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !238}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !237, line: 58, baseType: !35)
!237 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!239 = !{!232, !240}
!240 = !DILocalVariable(name: "flags", scope: !233, file: !95, line: 88, type: !118)
!241 = !DILocation(line: 87, column: 39, scope: !233, inlinedAt: !242)
!242 = distinct !DILocation(line: 79, column: 29, scope: !209)
!243 = !DILocation(line: 88, column: 27, scope: !233, inlinedAt: !242)
!244 = !DILocation(line: 88, column: 19, scope: !233, inlinedAt: !242)
!245 = !DILocation(line: 89, column: 5, scope: !233, inlinedAt: !242)
!246 = !DILocation(line: 91, column: 20, scope: !247, inlinedAt: !242)
!247 = distinct !DILexicalBlock(scope: !233, file: !95, line: 89, column: 33)
!248 = !DILocation(line: 91, column: 13, scope: !247, inlinedAt: !242)
!249 = !DILocation(line: 93, column: 20, scope: !247, inlinedAt: !242)
!250 = !DILocation(line: 93, column: 34, scope: !247, inlinedAt: !242)
!251 = !DILocation(line: 93, column: 13, scope: !247, inlinedAt: !242)
!252 = !DILocation(line: 95, column: 20, scope: !247, inlinedAt: !242)
!253 = !DILocation(line: 95, column: 35, scope: !247, inlinedAt: !242)
!254 = !{!255, !255, i64 0}
!255 = !{!"short", !204, i64 0}
!256 = !DILocation(line: 95, column: 13, scope: !247, inlinedAt: !242)
!257 = !DILocation(line: 97, column: 20, scope: !247, inlinedAt: !242)
!258 = !DILocation(line: 97, column: 35, scope: !247, inlinedAt: !242)
!259 = !{!230, !230, i64 0}
!260 = !DILocation(line: 97, column: 13, scope: !247, inlinedAt: !242)
!261 = !DILocation(line: 99, column: 20, scope: !247, inlinedAt: !242)
!262 = !DILocation(line: 99, column: 35, scope: !247, inlinedAt: !242)
!263 = !{!264, !264, i64 0}
!264 = !{!"long", !204, i64 0}
!265 = !DILocation(line: 99, column: 13, scope: !247, inlinedAt: !242)
!266 = !DILocation(line: 0, scope: !247, inlinedAt: !242)
!267 = !DILocation(line: 79, column: 5, scope: !209)
!268 = !DILocation(line: 80, column: 5, scope: !209)
!269 = !DILocation(line: 81, column: 1, scope: !209)
!270 = distinct !DISubprogram(name: "mixDigest", scope: !1, file: !1, line: 97, type: !155, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !271)
!271 = !{!272, !273, !274, !275, !276}
!272 = !DILocalVariable(name: "digest", arg: 1, scope: !270, file: !1, line: 97, type: !157)
!273 = !DILocalVariable(name: "ptr", arg: 2, scope: !270, file: !1, line: 97, type: !4)
!274 = !DILocalVariable(name: "len", arg: 3, scope: !270, file: !1, line: 97, type: !158)
!275 = !DILocalVariable(name: "ctx", scope: !270, file: !1, line: 98, type: !167)
!276 = !DILocalVariable(name: "s", scope: !270, file: !1, line: 99, type: !5)
!277 = !DILocation(line: 97, column: 31, scope: !270)
!278 = !DILocation(line: 97, column: 45, scope: !270)
!279 = !DILocation(line: 97, column: 57, scope: !270)
!280 = !DILocation(line: 98, column: 5, scope: !270)
!281 = !DILocation(line: 99, column: 11, scope: !270)
!282 = !DILocation(line: 101, column: 5, scope: !270)
!283 = !DILocation(line: 98, column: 14, scope: !270)
!284 = !DILocation(line: 102, column: 5, scope: !270)
!285 = !DILocation(line: 103, column: 5, scope: !270)
!286 = !DILocation(line: 104, column: 5, scope: !270)
!287 = !DILocation(line: 105, column: 1, scope: !270)
!288 = distinct !DISubprogram(name: "mixStringObjectDigest", scope: !1, file: !1, line: 107, type: !210, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !289)
!289 = !{!290, !291}
!290 = !DILocalVariable(name: "digest", arg: 1, scope: !288, file: !1, line: 107, type: !157)
!291 = !DILocalVariable(name: "o", arg: 2, scope: !288, file: !1, line: 107, type: !212)
!292 = !DILocation(line: 107, column: 43, scope: !288)
!293 = !DILocation(line: 107, column: 57, scope: !288)
!294 = !DILocation(line: 108, column: 9, scope: !288)
!295 = !DILocation(line: 109, column: 25, scope: !288)
!296 = !DILocation(line: 87, column: 39, scope: !233, inlinedAt: !297)
!297 = distinct !DILocation(line: 109, column: 29, scope: !288)
!298 = !DILocation(line: 88, column: 27, scope: !233, inlinedAt: !297)
!299 = !DILocation(line: 88, column: 19, scope: !233, inlinedAt: !297)
!300 = !DILocation(line: 89, column: 5, scope: !233, inlinedAt: !297)
!301 = !DILocation(line: 91, column: 20, scope: !247, inlinedAt: !297)
!302 = !DILocation(line: 91, column: 13, scope: !247, inlinedAt: !297)
!303 = !DILocation(line: 93, column: 20, scope: !247, inlinedAt: !297)
!304 = !DILocation(line: 93, column: 34, scope: !247, inlinedAt: !297)
!305 = !DILocation(line: 93, column: 13, scope: !247, inlinedAt: !297)
!306 = !DILocation(line: 95, column: 20, scope: !247, inlinedAt: !297)
!307 = !DILocation(line: 95, column: 35, scope: !247, inlinedAt: !297)
!308 = !DILocation(line: 95, column: 13, scope: !247, inlinedAt: !297)
!309 = !DILocation(line: 97, column: 20, scope: !247, inlinedAt: !297)
!310 = !DILocation(line: 97, column: 35, scope: !247, inlinedAt: !297)
!311 = !DILocation(line: 97, column: 13, scope: !247, inlinedAt: !297)
!312 = !DILocation(line: 99, column: 20, scope: !247, inlinedAt: !297)
!313 = !DILocation(line: 99, column: 35, scope: !247, inlinedAt: !297)
!314 = !DILocation(line: 99, column: 13, scope: !247, inlinedAt: !297)
!315 = !DILocation(line: 0, scope: !247, inlinedAt: !297)
!316 = !DILocation(line: 97, column: 31, scope: !270, inlinedAt: !317)
!317 = distinct !DILocation(line: 109, column: 5, scope: !288)
!318 = !DILocation(line: 97, column: 45, scope: !270, inlinedAt: !317)
!319 = !DILocation(line: 97, column: 57, scope: !270, inlinedAt: !317)
!320 = !DILocation(line: 98, column: 5, scope: !270, inlinedAt: !317)
!321 = !DILocation(line: 99, column: 11, scope: !270, inlinedAt: !317)
!322 = !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !317)
!323 = !DILocation(line: 98, column: 14, scope: !270, inlinedAt: !317)
!324 = !DILocation(line: 102, column: 5, scope: !270, inlinedAt: !317)
!325 = !DILocation(line: 103, column: 5, scope: !270, inlinedAt: !317)
!326 = !DILocation(line: 104, column: 5, scope: !270, inlinedAt: !317)
!327 = !DILocation(line: 105, column: 1, scope: !270, inlinedAt: !317)
!328 = !DILocation(line: 110, column: 5, scope: !288)
!329 = !DILocation(line: 111, column: 1, scope: !288)
!330 = distinct !DISubprogram(name: "xorObjectDigest", scope: !1, file: !1, line: 121, type: !331, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !373)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !212, !157, !212}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !13, line: 656, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !13, line: 647, size: 512, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !335, file: !13, line: 648, baseType: !17, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !335, file: !13, line: 649, baseType: !17, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !335, file: !13, line: 650, baseType: !17, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !335, file: !13, line: 651, baseType: !17, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !335, file: !13, line: 652, baseType: !17, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !335, file: !13, line: 653, baseType: !9, size: 32, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !335, file: !13, line: 654, baseType: !8, size: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !335, file: !13, line: 655, baseType: !345, size: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !347, line: 54, baseType: !348)
!347 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !347, line: 47, size: 384, elements: !349)
!349 = !{!350, !359, !360, !364, !368, !372}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !348, file: !347, line: 48, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !347, line: 40, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !347, line: 36, size: 192, elements: !354)
!354 = !{!355, !357, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !347, line: 37, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !347, line: 38, baseType: !356, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !353, file: !347, line: 39, baseType: !4, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !348, file: !347, line: 49, baseType: !351, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !348, file: !347, line: 50, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!4, !4}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !348, file: !347, line: 51, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !4}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !348, file: !347, line: 52, baseType: !369, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!9, !4, !4}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !348, file: !347, line: 53, baseType: !35, size: 64, offset: 320)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !384, !432, !448, !450, !472, !473, !476, !479, !480, !481, !482, !483, !484, !485, !489, !490, !491, !493, !495, !508, !510, !511, !599, !600, !601, !603, !605, !606, !607, !608, !616, !948}
!374 = !DILocalVariable(name: "db", arg: 1, scope: !330, file: !1, line: 121, type: !333)
!375 = !DILocalVariable(name: "keyobj", arg: 2, scope: !330, file: !1, line: 121, type: !212)
!376 = !DILocalVariable(name: "digest", arg: 3, scope: !330, file: !1, line: 121, type: !157)
!377 = !DILocalVariable(name: "o", arg: 4, scope: !330, file: !1, line: 121, type: !212)
!378 = !DILocalVariable(name: "aux", scope: !330, file: !1, line: 122, type: !137)
!379 = !DILocalVariable(name: "expiretime", scope: !330, file: !1, line: 124, type: !8)
!380 = !DILocalVariable(name: "buf", scope: !330, file: !1, line: 125, type: !381)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 128)
!384 = !DILocalVariable(name: "li", scope: !385, file: !1, line: 131, type: !388)
!385 = distinct !DILexicalBlock(scope: !386, file: !1, line: 130, column: 37)
!386 = distinct !DILexicalBlock(scope: !387, file: !1, line: 130, column: 16)
!387 = distinct !DILexicalBlock(scope: !330, file: !1, line: 128, column: 9)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeIterator", file: !13, line: 1347, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1342, size: 192, elements: !391)
!391 = !{!392, !393, !394, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !390, file: !13, line: 1343, baseType: !212, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !390, file: !13, line: 1344, baseType: !118, size: 8, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !390, file: !13, line: 1345, baseType: !118, size: 8, offset: 72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !390, file: !13, line: 1346, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistIter", file: !398, line: 88, baseType: !399)
!398 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistIter", file: !398, line: 82, size: 320, elements: !400)
!400 = !{!401, !428, !429, !430, !431}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !399, file: !398, line: 83, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !398, line: 80, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !398, line: 73, size: 320, elements: !406)
!406 = !{!407, !423, !424, !425, !426, !427}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !405, file: !398, line: 74, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !398, line: 55, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !398, line: 44, size: 256, elements: !411)
!411 = !{!412, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !410, file: !398, line: 45, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !398, line: 46, baseType: !413, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !410, file: !398, line: 47, baseType: !157, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !410, file: !398, line: 48, baseType: !139, size: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !410, file: !398, line: 49, baseType: !139, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !410, file: !398, line: 50, baseType: !139, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !410, file: !398, line: 51, baseType: !139, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !410, file: !398, line: 52, baseType: !139, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !410, file: !398, line: 53, baseType: !139, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !410, file: !398, line: 54, baseType: !139, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !405, file: !398, line: 75, baseType: !408, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !405, file: !398, line: 76, baseType: !35, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !405, file: !398, line: 77, baseType: !35, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !405, file: !398, line: 78, baseType: !9, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !405, file: !398, line: 79, baseType: !139, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !399, file: !398, line: 84, baseType: !408, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !399, file: !398, line: 85, baseType: !157, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !399, file: !398, line: 86, baseType: !73, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !399, file: !398, line: 87, baseType: !9, size: 32, offset: 256)
!432 = !DILocalVariable(name: "entry", scope: !385, file: !1, line: 132, type: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeEntry", file: !13, line: 1353, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1350, size: 448, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "li", scope: !434, file: !13, line: 1351, baseType: !388, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !434, file: !13, line: 1352, baseType: !438, size: 384, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistEntry", file: !398, line: 98, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistEntry", file: !398, line: 90, size: 384, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !439, file: !398, line: 91, baseType: !402, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !439, file: !398, line: 92, baseType: !408, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !439, file: !398, line: 93, baseType: !157, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !439, file: !398, line: 94, baseType: !157, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "longval", scope: !439, file: !398, line: 95, baseType: !8, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !439, file: !398, line: 96, baseType: !139, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !439, file: !398, line: 97, baseType: !9, size: 32, offset: 352)
!448 = !DILocalVariable(name: "eleobj", scope: !449, file: !1, line: 134, type: !212)
!449 = distinct !DILexicalBlock(scope: !385, file: !1, line: 133, column: 40)
!450 = !DILocalVariable(name: "si", scope: !451, file: !1, line: 140, type: !453)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 139, column: 36)
!452 = distinct !DILexicalBlock(scope: !386, file: !1, line: 139, column: 16)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "setTypeIterator", file: !13, line: 1361, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1356, size: 192, elements: !456)
!456 = !{!457, !458, !459, !460}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !455, file: !13, line: 1357, baseType: !212, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !455, file: !13, line: 1358, baseType: !9, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ii", scope: !455, file: !13, line: 1359, baseType: !9, size: 32, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !455, file: !13, line: 1360, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !19, line: 95, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !19, line: 88, size: 384, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !463, file: !19, line: 89, baseType: !17, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !463, file: !19, line: 90, baseType: !73, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !463, file: !19, line: 91, baseType: !9, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !463, file: !19, line: 91, baseType: !9, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !463, file: !19, line: 92, baseType: !60, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !463, file: !19, line: 92, baseType: !60, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !463, file: !19, line: 94, baseType: !8, size: 64, offset: 320)
!472 = !DILocalVariable(name: "sdsele", scope: !451, file: !1, line: 141, type: !94)
!473 = !DILocalVariable(name: "eledigest", scope: !474, file: !1, line: 148, type: !182)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 147, column: 37)
!475 = distinct !DILexicalBlock(scope: !452, file: !1, line: 147, column: 16)
!476 = !DILocalVariable(name: "zl", scope: !477, file: !1, line: 151, type: !157)
!477 = distinct !DILexicalBlock(scope: !478, file: !1, line: 150, column: 50)
!478 = distinct !DILexicalBlock(scope: !474, file: !1, line: 150, column: 13)
!479 = !DILocalVariable(name: "eptr", scope: !477, file: !1, line: 152, type: !157)
!480 = !DILocalVariable(name: "sptr", scope: !477, file: !1, line: 152, type: !157)
!481 = !DILocalVariable(name: "vstr", scope: !477, file: !1, line: 153, type: !157)
!482 = !DILocalVariable(name: "vlen", scope: !477, file: !1, line: 154, type: !139)
!483 = !DILocalVariable(name: "vll", scope: !477, file: !1, line: 155, type: !8)
!484 = !DILocalVariable(name: "score", scope: !477, file: !1, line: 156, type: !7)
!485 = !DILocalVariable(name: "zs", scope: !486, file: !1, line: 181, type: !488)
!486 = distinct !DILexicalBlock(scope: !487, file: !1, line: 180, column: 58)
!487 = distinct !DILexicalBlock(scope: !478, file: !1, line: 180, column: 20)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!489 = !DILocalVariable(name: "di", scope: !486, file: !1, line: 182, type: !461)
!490 = !DILocalVariable(name: "de", scope: !486, file: !1, line: 183, type: !60)
!491 = !DILocalVariable(name: "sdsele", scope: !492, file: !1, line: 186, type: !94)
!492 = distinct !DILexicalBlock(scope: !486, file: !1, line: 185, column: 48)
!493 = !DILocalVariable(name: "score", scope: !492, file: !1, line: 187, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!495 = !DILocalVariable(name: "hi", scope: !496, file: !1, line: 200, type: !498)
!496 = distinct !DILexicalBlock(scope: !497, file: !1, line: 199, column: 37)
!497 = distinct !DILexicalBlock(scope: !475, file: !1, line: 199, column: 16)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashTypeIterator", file: !13, line: 1375, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1367, size: 384, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !500, file: !13, line: 1368, baseType: !212, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !500, file: !13, line: 1369, baseType: !9, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", scope: !500, file: !13, line: 1371, baseType: !157, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "vptr", scope: !500, file: !13, line: 1371, baseType: !157, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !500, file: !13, line: 1373, baseType: !461, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "de", scope: !500, file: !13, line: 1374, baseType: !60, size: 64, offset: 320)
!508 = !DILocalVariable(name: "eledigest", scope: !509, file: !1, line: 202, type: !182)
!509 = distinct !DILexicalBlock(scope: !496, file: !1, line: 201, column: 43)
!510 = !DILocalVariable(name: "sdsele", scope: !509, file: !1, line: 203, type: !94)
!511 = !DILocalVariable(name: "si", scope: !512, file: !1, line: 216, type: !514)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 215, column: 39)
!513 = distinct !DILexicalBlock(scope: !497, file: !1, line: 215, column: 16)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamIterator", file: !515, line: 48, baseType: !516)
!515 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamIterator", file: !515, line: 29, size: 5120, elements: !517)
!517 = !{!518, !550, !551, !552, !553, !554, !555, !556, !558, !559, !591, !592, !593, !594, !598}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !516, file: !515, line: 30, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !515, line: 21, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !515, line: 16, size: 320, elements: !522)
!522 = !{!523, !542, !543, !549}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !521, file: !515, line: 17, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !526, line: 137, baseType: !527)
!526 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !526, line: 133, size: 192, elements: !528)
!528 = !{!529, !540, !541}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !527, file: !526, line: 134, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !526, line: 131, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !526, line: 98, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !532, file: !526, line: 99, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !532, file: !526, line: 100, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !532, file: !526, line: 101, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !532, file: !526, line: 102, baseType: !137, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !532, file: !526, line: 130, baseType: !539, offset: 32)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, elements: !104)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !527, file: !526, line: 135, baseType: !31, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !527, file: !526, line: 136, baseType: !31, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !521, file: !515, line: 18, baseType: !31, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !521, file: !515, line: 19, baseType: !544, size: 128, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !515, line: 14, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !515, line: 11, size: 128, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !545, file: !515, line: 12, baseType: !31, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !545, file: !515, line: 13, baseType: !31, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !521, file: !515, line: 20, baseType: !524, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "master_id", scope: !516, file: !515, line: 31, baseType: !544, size: 128, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "master_fields_count", scope: !516, file: !515, line: 32, baseType: !31, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "master_fields_start", scope: !516, file: !515, line: 33, baseType: !157, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "master_fields_ptr", scope: !516, file: !515, line: 34, baseType: !157, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "entry_flags", scope: !516, file: !515, line: 35, baseType: !9, size: 32, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rev", scope: !516, file: !515, line: 36, baseType: !9, size: 32, offset: 416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "start_key", scope: !516, file: !515, line: 37, baseType: !557, size: 128, offset: 448)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !80)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "end_key", scope: !516, file: !515, line: 38, baseType: !557, size: 128, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !516, file: !515, line: 39, baseType: !560, size: 3840, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxIterator", file: !526, line: 186, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxIterator", file: !526, line: 175, size: 3840, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !571, !572, !585}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !526, line: 176, baseType: !9, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !561, file: !526, line: 177, baseType: !524, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !561, file: !526, line: 178, baseType: !157, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !561, file: !526, line: 179, baseType: !4, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !561, file: !526, line: 180, baseType: !158, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "key_max", scope: !561, file: !526, line: 181, baseType: !158, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "key_static_string", scope: !561, file: !526, line: 182, baseType: !570, size: 1024, offset: 384)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 1024, elements: !382)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !561, file: !526, line: 183, baseType: !530, size: 64, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !561, file: !526, line: 184, baseType: !573, size: 2304, offset: 1472)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxStack", file: !526, line: 150, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxStack", file: !526, line: 143, size: 2304, elements: !575)
!575 = !{!576, !578, !579, !580, !584}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !574, file: !526, line: 144, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !574, file: !526, line: 145, baseType: !158, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "maxitems", scope: !574, file: !526, line: 145, baseType: !158, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "static_items", scope: !574, file: !526, line: 148, baseType: !581, size: 2048, offset: 192)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "oom", scope: !574, file: !526, line: 149, baseType: !9, size: 32, offset: 2240)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "node_cb", scope: !561, file: !526, line: 185, baseType: !586, size: 64, offset: 3776)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNodeCallback", file: !526, line: 165, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!9, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !516, file: !515, line: 40, baseType: !157, size: 64, offset: 4544)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lp_ele", scope: !516, file: !515, line: 41, baseType: !157, size: 64, offset: 4608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lp_flags", scope: !516, file: !515, line: 42, baseType: !157, size: 64, offset: 4672)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "field_buf", scope: !516, file: !515, line: 46, baseType: !595, size: 168, offset: 4736)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 168, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 21)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "value_buf", scope: !516, file: !515, line: 47, baseType: !595, size: 168, offset: 4904)
!599 = !DILocalVariable(name: "id", scope: !512, file: !1, line: 218, type: !544)
!600 = !DILocalVariable(name: "numfields", scope: !512, file: !1, line: 219, type: !71)
!601 = !DILocalVariable(name: "itemid", scope: !602, file: !1, line: 222, type: !94)
!602 = distinct !DILexicalBlock(scope: !512, file: !1, line: 221, column: 56)
!603 = !DILocalVariable(name: "field", scope: !604, file: !1, line: 227, type: !157)
!604 = distinct !DILexicalBlock(scope: !602, file: !1, line: 226, column: 32)
!605 = !DILocalVariable(name: "value", scope: !604, file: !1, line: 227, type: !157)
!606 = !DILocalVariable(name: "field_len", scope: !604, file: !1, line: 228, type: !71)
!607 = !DILocalVariable(name: "value_len", scope: !604, file: !1, line: 228, type: !71)
!608 = !DILocalVariable(name: "md", scope: !609, file: !1, line: 237, type: !611)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 236, column: 39)
!610 = distinct !DILexicalBlock(scope: !513, file: !1, line: 236, column: 16)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "RedisModuleDigest", file: !13, line: 586, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleDigest", file: !13, line: 583, size: 320, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !612, file: !13, line: 584, baseType: !182, size: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !612, file: !13, line: 585, baseType: !182, size: 160, offset: 160)
!616 = !DILocalVariable(name: "mv", scope: !609, file: !1, line: 238, type: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleValue", file: !13, line: 550, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "moduleValue", file: !13, line: 547, size: 128, elements: !620)
!620 = !{!621, !947}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !13, line: 548, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleType", file: !13, line: 530, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleType", file: !13, line: 517, size: 768, elements: !625)
!625 = !{!626, !627, !630, !909, !914, !919, !924, !930, !932, !937, !942, !943}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !624, file: !13, line: 518, baseType: !31, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !624, file: !13, line: 519, baseType: !628, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModule", file: !13, line: 496, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !624, file: !13, line: 520, baseType: !631, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeLoadFunc", file: !13, line: 506, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!4, !635, !9}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleIO", file: !13, line: 555, size: 384, elements: !637)
!637 = !{!638, !639, !901, !902, !903, !904, !907}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !636, file: !13, line: 556, baseType: !158, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !636, file: !13, line: 557, baseType: !640, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !642, line: 87, baseType: !643)
!642 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !642, line: 39, size: 832, elements: !644)
!644 = !{!645, !650, !654, !662, !666, !670, !671, !672, !673}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !643, file: !642, line: 43, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!236, !649, !4, !236}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !643, file: !642, line: 44, baseType: !651, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!236, !649, !36, !236}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !643, file: !642, line: 45, baseType: !655, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!658, !649}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !659, line: 173, baseType: !660)
!659 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !161, line: 100, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !161, line: 44, baseType: !73)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !643, file: !642, line: 46, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!9, !649}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !643, file: !642, line: 52, baseType: !667, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !649, !36, !236}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !643, file: !642, line: 55, baseType: !31, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !643, file: !642, line: 58, baseType: !236, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !643, file: !642, line: 61, baseType: !236, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !643, file: !642, line: 84, baseType: !674, size: 320, offset: 512)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !643, file: !642, line: 64, size: 320, elements: !675)
!675 = !{!676, !681, !892}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !674, file: !642, line: 69, baseType: !677, size: 128)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !642, line: 66, size: 128, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !677, file: !642, line: 67, baseType: !94, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !677, file: !642, line: 68, baseType: !658, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !674, file: !642, line: 75, baseType: !682, size: 192)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !642, line: 71, size: 192, elements: !683)
!683 = !{!684, !890, !891}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !682, file: !642, line: 72, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !687, line: 66, baseType: !688)
!687 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !689, line: 287, baseType: !690)
!689 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !689, line: 181, size: 1408, elements: !691)
!691 = !{!692, !693, !694, !695, !697, !698, !703, !704, !705, !858, !864, !869, !873, !874, !875, !876, !878, !880, !881, !882, !883, !884, !888, !889}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !690, file: !689, line: 182, baseType: !157, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !690, file: !689, line: 183, baseType: !9, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !690, file: !689, line: 184, baseType: !9, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !690, file: !689, line: 185, baseType: !696, size: 16, offset: 128)
!696 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !690, file: !689, line: 186, baseType: !696, size: 16, offset: 144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !690, file: !689, line: 187, baseType: !699, size: 128, offset: 192)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !689, line: 117, size: 128, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !699, file: !689, line: 118, baseType: !157, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !699, file: !689, line: 119, baseType: !9, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !690, file: !689, line: 188, baseType: !9, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !690, file: !689, line: 195, baseType: !4, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !690, file: !689, line: 197, baseType: !706, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !710, !4, !5, !9}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !161, line: 145, baseType: !73)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !689, line: 569, size: 14912, elements: !712)
!712 = !{!713, !714, !716, !717, !718, !719, !723, !724, !727, !728, !732, !746, !747, !748, !750, !751, !752, !828, !846, !847, !849, !856}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !711, file: !689, line: 571, baseType: !9, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !711, file: !689, line: 576, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !711, file: !689, line: 576, baseType: !715, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !711, file: !689, line: 576, baseType: !715, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !711, file: !689, line: 578, baseType: !9, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !711, file: !689, line: 579, baseType: !720, size: 200, offset: 288)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 200, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 25)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !711, file: !689, line: 582, baseType: !9, size: 32, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !711, file: !689, line: 583, baseType: !725, size: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !689, line: 40, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !711, file: !689, line: 585, baseType: !9, size: 32, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !711, file: !689, line: 587, baseType: !729, size: 64, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !710}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !711, file: !689, line: 590, baseType: !733, size: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !689, line: 47, size: 256, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !734, file: !689, line: 49, baseType: !733, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !734, file: !689, line: 50, baseType: !9, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !734, file: !689, line: 50, baseType: !9, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !734, file: !689, line: 50, baseType: !9, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !734, file: !689, line: 50, baseType: !9, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !734, file: !689, line: 51, baseType: !742, size: 32, offset: 192)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 32, elements: !744)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !689, line: 25, baseType: !139)
!744 = !{!745}
!745 = !DISubrange(count: 1)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !711, file: !689, line: 591, baseType: !9, size: 32, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !711, file: !689, line: 592, baseType: !733, size: 64, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !711, file: !689, line: 593, baseType: !749, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !711, file: !689, line: 596, baseType: !9, size: 32, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !711, file: !689, line: 597, baseType: !5, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !711, file: !689, line: 632, baseType: !753, size: 2880, offset: 1152)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !689, line: 599, size: 2880, elements: !754)
!754 = !{!755, !819}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !753, file: !689, line: 622, baseType: !756, size: 1728)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !689, line: 601, size: 1728, elements: !757)
!757 = !{!758, !759, !760, !764, !776, !777, !779, !788, !802, !803, !804, !808, !812, !813, !814, !815, !816, !817, !818}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !756, file: !689, line: 603, baseType: !139, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !756, file: !689, line: 604, baseType: !5, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !756, file: !689, line: 605, baseType: !761, size: 208, offset: 128)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 208, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 26)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !756, file: !689, line: 606, baseType: !765, size: 288, offset: 352)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !689, line: 55, size: 288, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !765, file: !689, line: 57, baseType: !9, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !765, file: !689, line: 58, baseType: !9, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !765, file: !689, line: 59, baseType: !9, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !765, file: !689, line: 60, baseType: !9, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !765, file: !689, line: 61, baseType: !9, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !765, file: !689, line: 62, baseType: !9, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !765, file: !689, line: 63, baseType: !9, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !765, file: !689, line: 64, baseType: !9, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !765, file: !689, line: 65, baseType: !9, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !756, file: !689, line: 607, baseType: !9, size: 32, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !756, file: !689, line: 608, baseType: !778, size: 64, offset: 704)
!778 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !756, file: !689, line: 609, baseType: !780, size: 112, offset: 768)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !689, line: 319, size: 112, elements: !781)
!781 = !{!782, !786, !787}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !780, file: !689, line: 320, baseType: !783, size: 48)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 48, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 3)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !780, file: !689, line: 321, baseType: !783, size: 48, offset: 48)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !780, file: !689, line: 322, baseType: !129, size: 16, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !756, file: !689, line: 610, baseType: !789, size: 64, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !161, line: 171, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 163, size: 64, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !790, file: !161, line: 165, baseType: !9, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !790, file: !161, line: 170, baseType: !794, size: 32, offset: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !161, line: 166, size: 32, elements: !795)
!795 = !{!796, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !794, file: !161, line: 168, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !237, line: 124, baseType: !139)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !794, file: !161, line: 169, baseType: !799, size: 32)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 4)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !756, file: !689, line: 611, baseType: !789, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !756, file: !689, line: 612, baseType: !789, size: 64, offset: 1024)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !756, file: !689, line: 613, baseType: !805, size: 64, offset: 1088)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 8)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !756, file: !689, line: 614, baseType: !809, size: 192, offset: 1152)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 24)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !756, file: !689, line: 615, baseType: !9, size: 32, offset: 1344)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !756, file: !689, line: 616, baseType: !789, size: 64, offset: 1376)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !756, file: !689, line: 617, baseType: !789, size: 64, offset: 1440)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !756, file: !689, line: 618, baseType: !789, size: 64, offset: 1504)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !756, file: !689, line: 619, baseType: !789, size: 64, offset: 1568)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !756, file: !689, line: 620, baseType: !789, size: 64, offset: 1632)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !756, file: !689, line: 621, baseType: !9, size: 32, offset: 1696)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !753, file: !689, line: 631, baseType: !820, size: 2880)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !689, line: 626, size: 2880, elements: !821)
!821 = !{!822, !826}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !820, file: !689, line: 629, baseType: !823, size: 1920)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 1920, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 30)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !820, file: !689, line: 630, baseType: !827, size: 960, offset: 1920)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 960, elements: !824)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !711, file: !689, line: 636, baseType: !829, size: 64, offset: 4032)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !689, line: 93, size: 6336, elements: !831)
!831 = !{!832, !833, !834, !839}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !830, file: !689, line: 94, baseType: !829, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !830, file: !689, line: 95, baseType: !9, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !830, file: !689, line: 97, baseType: !835, size: 2048, offset: 128)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 2048, elements: !582)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !830, file: !689, line: 98, baseType: !840, size: 4160, offset: 2176)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !689, line: 74, size: 4160, elements: !841)
!841 = !{!842, !843, !844, !845}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !840, file: !689, line: 75, baseType: !581, size: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !840, file: !689, line: 76, baseType: !581, size: 2048, offset: 2048)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !840, file: !689, line: 78, baseType: !743, size: 32, offset: 4096)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !840, file: !689, line: 81, baseType: !743, size: 32, offset: 4128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !711, file: !689, line: 637, baseType: !830, size: 6336, offset: 4096)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !711, file: !689, line: 641, baseType: !848, size: 64, offset: 10432)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !711, file: !689, line: 646, baseType: !850, size: 192, offset: 10496)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !689, line: 291, size: 192, elements: !851)
!851 = !{!852, !854, !855}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !850, file: !689, line: 293, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !850, file: !689, line: 294, baseType: !9, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !850, file: !689, line: 295, baseType: !715, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !711, file: !689, line: 648, baseType: !857, size: 4224, offset: 10688)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 4224, elements: !784)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !690, file: !689, line: 199, baseType: !859, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!709, !710, !4, !862, !9}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !690, file: !689, line: 202, baseType: !865, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!868, !710, !4, !868, !9}
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !161, line: 114, baseType: !73)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !690, file: !689, line: 203, baseType: !870, size: 64, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!9, !710, !4}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !690, file: !689, line: 206, baseType: !699, size: 128, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !690, file: !689, line: 207, baseType: !157, size: 64, offset: 832)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !690, file: !689, line: 208, baseType: !9, size: 32, offset: 896)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !690, file: !689, line: 211, baseType: !877, size: 24, offset: 928)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 24, elements: !784)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !690, file: !689, line: 212, baseType: !879, size: 8, offset: 952)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8, elements: !744)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !690, file: !689, line: 215, baseType: !699, size: 128, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !690, file: !689, line: 218, baseType: !9, size: 32, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !690, file: !689, line: 219, baseType: !661, size: 64, offset: 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !690, file: !689, line: 222, baseType: !710, size: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !690, file: !689, line: 226, baseType: !885, size: 32, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !161, line: 175, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !887, line: 12, baseType: !9)
!887 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !690, file: !689, line: 228, baseType: !789, size: 64, offset: 1312)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !690, file: !689, line: 229, baseType: !9, size: 32, offset: 1376)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !682, file: !642, line: 73, baseType: !658, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "autosync", scope: !682, file: !642, line: 74, baseType: !658, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fdset", scope: !674, file: !642, line: 83, baseType: !893, size: 320)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !642, line: 77, size: 320, elements: !894)
!894 = !{!895, !897, !898, !899, !900}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !893, file: !642, line: 78, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !893, file: !642, line: 79, baseType: !896, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "numfds", scope: !893, file: !642, line: 80, baseType: !9, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !893, file: !642, line: 81, baseType: !658, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !893, file: !642, line: 82, baseType: !94, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !636, file: !13, line: 558, baseType: !622, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !636, file: !13, line: 559, baseType: !9, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !636, file: !13, line: 560, baseType: !9, size: 32, offset: 224)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !636, file: !13, line: 562, baseType: !905, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleCtx", file: !13, line: 499, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !636, file: !13, line: 563, baseType: !908, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save", scope: !624, file: !13, line: 521, baseType: !910, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeSaveFunc", file: !13, line: 507, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !635, !4}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite", scope: !624, file: !13, line: 522, baseType: !915, size: 64, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeRewriteFunc", file: !13, line: 510, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !635, !908, !4}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mem_usage", scope: !624, file: !13, line: 523, baseType: !920, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeMemUsageFunc", file: !13, line: 512, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!158, !36}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !624, file: !13, line: 524, baseType: !925, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeDigestFunc", file: !13, line: 511, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !929, !4}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !624, file: !13, line: 525, baseType: !931, size: 64, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeFreeFunc", file: !13, line: 513, baseType: !365)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "aux_load", scope: !624, file: !13, line: 526, baseType: !933, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeAuxLoadFunc", file: !13, line: 508, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!9, !635, !9, !9}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save", scope: !624, file: !13, line: 527, baseType: !938, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeAuxSaveFunc", file: !13, line: 509, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !635, !9}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "aux_save_triggers", scope: !624, file: !13, line: 528, baseType: !9, size: 32, offset: 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !624, file: !13, line: 529, baseType: !944, size: 80, offset: 672)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 80, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 10)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !619, file: !13, line: 549, baseType: !4, size: 64, offset: 64)
!948 = !DILocalVariable(name: "mt", scope: !609, file: !1, line: 239, type: !622)
!949 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !950)
!950 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !951)
!951 = distinct !DILocation(line: 210, column: 13, scope: !509)
!952 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !953)
!953 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !954)
!954 = distinct !DILocation(line: 207, column: 13, scope: !509)
!955 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !956)
!956 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !957)
!957 = distinct !DILocation(line: 192, column: 17, scope: !492)
!958 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !959)
!959 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !960)
!960 = distinct !DILocation(line: 191, column: 17, scope: !492)
!961 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !962)
!962 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !963)
!963 = distinct !DILocation(line: 176, column: 17, scope: !964)
!964 = distinct !DILexicalBlock(scope: !477, file: !1, line: 163, column: 34)
!965 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !966)
!966 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !967)
!967 = distinct !DILocation(line: 172, column: 21, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !1, line: 170, column: 24)
!969 = distinct !DILexicalBlock(scope: !964, file: !1, line: 168, column: 21)
!970 = !DILocation(line: 66, column: 19, scope: !154, inlinedAt: !971)
!971 = distinct !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !972)
!972 = distinct !DILocation(line: 169, column: 21, scope: !973)
!973 = distinct !DILexicalBlock(scope: !969, file: !1, line: 168, column: 35)
!974 = !DILocation(line: 121, column: 31, scope: !330)
!975 = !DILocation(line: 121, column: 41, scope: !330)
!976 = !DILocation(line: 121, column: 64, scope: !330)
!977 = !DILocation(line: 121, column: 78, scope: !330)
!978 = !DILocation(line: 122, column: 5, scope: !330)
!979 = !DILocation(line: 122, column: 20, scope: !330)
!980 = !DILocation(line: 122, column: 14, scope: !330)
!981 = !DILocation(line: 97, column: 31, scope: !270, inlinedAt: !982)
!982 = distinct !DILocation(line: 123, column: 5, scope: !330)
!983 = !DILocation(line: 97, column: 45, scope: !270, inlinedAt: !982)
!984 = !DILocation(line: 97, column: 57, scope: !270, inlinedAt: !982)
!985 = !DILocation(line: 98, column: 5, scope: !270, inlinedAt: !982)
!986 = !DILocation(line: 99, column: 11, scope: !270, inlinedAt: !982)
!987 = !DILocation(line: 101, column: 5, scope: !270, inlinedAt: !982)
!988 = !DILocation(line: 98, column: 14, scope: !270, inlinedAt: !982)
!989 = !DILocation(line: 102, column: 5, scope: !270, inlinedAt: !982)
!990 = !DILocation(line: 103, column: 5, scope: !270, inlinedAt: !982)
!991 = !DILocation(line: 104, column: 5, scope: !270, inlinedAt: !982)
!992 = !DILocation(line: 105, column: 1, scope: !270, inlinedAt: !982)
!993 = !DILocation(line: 124, column: 28, scope: !330)
!994 = !DILocation(line: 124, column: 15, scope: !330)
!995 = !DILocation(line: 125, column: 5, scope: !330)
!996 = !DILocation(line: 125, column: 10, scope: !330)
!997 = !DILocation(line: 128, column: 12, scope: !387)
!998 = !DILocation(line: 128, column: 9, scope: !330)
!999 = !DILocation(line: 129, column: 9, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !387, file: !1, line: 128, column: 32)
!1001 = !DILocation(line: 130, column: 5, scope: !1000)
!1002 = !DILocation(line: 131, column: 32, scope: !385)
!1003 = !DILocation(line: 131, column: 27, scope: !385)
!1004 = !DILocation(line: 132, column: 9, scope: !385)
!1005 = !DILocation(line: 132, column: 23, scope: !385)
!1006 = !DILocation(line: 133, column: 15, scope: !385)
!1007 = !DILocation(line: 133, column: 9, scope: !385)
!1008 = !DILocation(line: 134, column: 28, scope: !449)
!1009 = !DILocation(line: 134, column: 19, scope: !449)
!1010 = !DILocation(line: 135, column: 13, scope: !449)
!1011 = !DILocation(line: 136, column: 13, scope: !449)
!1012 = distinct !{!1012, !1007, !1013}
!1013 = !DILocation(line: 137, column: 9, scope: !385)
!1014 = !DILocation(line: 138, column: 9, scope: !385)
!1015 = !DILocation(line: 139, column: 5, scope: !386)
!1016 = !DILocation(line: 139, column: 5, scope: !385)
!1017 = !DILocation(line: 140, column: 31, scope: !451)
!1018 = !DILocation(line: 140, column: 26, scope: !451)
!1019 = !DILocation(line: 142, column: 25, scope: !451)
!1020 = !DILocation(line: 141, column: 13, scope: !451)
!1021 = !DILocation(line: 142, column: 48, scope: !451)
!1022 = !DILocation(line: 142, column: 9, scope: !451)
!1023 = !DILocation(line: 87, column: 39, scope: !233, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 143, column: 37, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !451, file: !1, line: 142, column: 57)
!1026 = !DILocation(line: 88, column: 27, scope: !233, inlinedAt: !1024)
!1027 = !DILocation(line: 88, column: 19, scope: !233, inlinedAt: !1024)
!1028 = !DILocation(line: 89, column: 5, scope: !233, inlinedAt: !1024)
!1029 = !DILocation(line: 91, column: 20, scope: !247, inlinedAt: !1024)
!1030 = !DILocation(line: 91, column: 13, scope: !247, inlinedAt: !1024)
!1031 = !DILocation(line: 93, column: 20, scope: !247, inlinedAt: !1024)
!1032 = !DILocation(line: 93, column: 34, scope: !247, inlinedAt: !1024)
!1033 = !DILocation(line: 93, column: 13, scope: !247, inlinedAt: !1024)
!1034 = !DILocation(line: 95, column: 20, scope: !247, inlinedAt: !1024)
!1035 = !DILocation(line: 95, column: 35, scope: !247, inlinedAt: !1024)
!1036 = !DILocation(line: 95, column: 13, scope: !247, inlinedAt: !1024)
!1037 = !DILocation(line: 97, column: 20, scope: !247, inlinedAt: !1024)
!1038 = !DILocation(line: 97, column: 35, scope: !247, inlinedAt: !1024)
!1039 = !DILocation(line: 97, column: 13, scope: !247, inlinedAt: !1024)
!1040 = !DILocation(line: 99, column: 20, scope: !247, inlinedAt: !1024)
!1041 = !DILocation(line: 99, column: 35, scope: !247, inlinedAt: !1024)
!1042 = !DILocation(line: 99, column: 13, scope: !247, inlinedAt: !1024)
!1043 = !DILocation(line: 0, scope: !247, inlinedAt: !1024)
!1044 = !DILocation(line: 143, column: 13, scope: !1025)
!1045 = !DILocation(line: 144, column: 13, scope: !1025)
!1046 = distinct !{!1046, !1022, !1047}
!1047 = !DILocation(line: 145, column: 9, scope: !451)
!1048 = !DILocation(line: 146, column: 9, scope: !451)
!1049 = !DILocation(line: 147, column: 5, scope: !451)
!1050 = !DILocation(line: 148, column: 9, scope: !474)
!1051 = !DILocation(line: 148, column: 23, scope: !474)
!1052 = !DILocation(line: 150, column: 16, scope: !478)
!1053 = !DILocation(line: 150, column: 13, scope: !474)
!1054 = !DILocation(line: 151, column: 36, scope: !477)
!1055 = !DILocation(line: 151, column: 28, scope: !477)
!1056 = !DILocation(line: 152, column: 13, scope: !477)
!1057 = !DILocation(line: 153, column: 13, scope: !477)
!1058 = !DILocation(line: 154, column: 13, scope: !477)
!1059 = !DILocation(line: 155, column: 13, scope: !477)
!1060 = !DILocation(line: 158, column: 20, scope: !477)
!1061 = !DILocation(line: 152, column: 28, scope: !477)
!1062 = !DILocation(line: 158, column: 18, scope: !477)
!1063 = !{!231, !231, i64 0}
!1064 = !DILocation(line: 159, column: 13, scope: !477)
!1065 = !DILocation(line: 160, column: 20, scope: !477)
!1066 = !DILocation(line: 152, column: 35, scope: !477)
!1067 = !DILocation(line: 160, column: 18, scope: !477)
!1068 = !DILocation(line: 161, column: 13, scope: !477)
!1069 = !DILocation(line: 163, column: 13, scope: !477)
!1070 = !DILocation(line: 153, column: 28, scope: !477)
!1071 = !DILocation(line: 154, column: 26, scope: !477)
!1072 = !DILocation(line: 155, column: 23, scope: !477)
!1073 = !DILocation(line: 164, column: 17, scope: !964)
!1074 = !DILocation(line: 165, column: 37, scope: !964)
!1075 = !DILocation(line: 165, column: 25, scope: !964)
!1076 = !DILocation(line: 156, column: 20, scope: !477)
!1077 = !DILocation(line: 167, column: 17, scope: !964)
!1078 = !DILocation(line: 168, column: 21, scope: !969)
!1079 = !DILocation(line: 168, column: 26, scope: !969)
!1080 = !DILocation(line: 168, column: 21, scope: !964)
!1081 = !DILocation(line: 169, column: 46, scope: !973)
!1082 = !DILocation(line: 97, column: 31, scope: !270, inlinedAt: !972)
!1083 = !DILocation(line: 97, column: 45, scope: !270, inlinedAt: !972)
!1084 = !DILocation(line: 98, column: 5, scope: !270, inlinedAt: !972)
!1085 = !DILocation(line: 99, column: 11, scope: !270, inlinedAt: !972)
!1086 = !DILocation(line: 64, column: 31, scope: !154, inlinedAt: !971)
!1087 = !DILocation(line: 64, column: 45, scope: !154, inlinedAt: !971)
!1088 = !DILocation(line: 65, column: 5, scope: !154, inlinedAt: !971)
!1089 = !DILocation(line: 66, column: 5, scope: !154, inlinedAt: !971)
!1090 = !DILocation(line: 66, column: 30, scope: !154, inlinedAt: !971)
!1091 = !DILocation(line: 65, column: 14, scope: !154, inlinedAt: !971)
!1092 = !DILocation(line: 69, column: 5, scope: !154, inlinedAt: !971)
!1093 = !DILocation(line: 70, column: 5, scope: !154, inlinedAt: !971)
!1094 = !DILocation(line: 71, column: 5, scope: !154, inlinedAt: !971)
!1095 = !DILocation(line: 67, column: 9, scope: !154, inlinedAt: !971)
!1096 = !DILocation(line: 74, column: 22, scope: !201, inlinedAt: !971)
!1097 = !DILocation(line: 74, column: 19, scope: !201, inlinedAt: !971)
!1098 = !DILocation(line: 75, column: 1, scope: !154, inlinedAt: !971)
!1099 = !DILocation(line: 98, column: 14, scope: !270, inlinedAt: !972)
!1100 = !DILocation(line: 102, column: 5, scope: !270, inlinedAt: !972)
!1101 = !DILocation(line: 103, column: 5, scope: !270, inlinedAt: !972)
!1102 = !DILocation(line: 104, column: 5, scope: !270, inlinedAt: !972)
!1103 = !DILocation(line: 105, column: 1, scope: !270, inlinedAt: !972)
!1104 = !DILocation(line: 170, column: 17, scope: !973)
!1105 = !DILocation(line: 171, column: 47, scope: !968)
!1106 = !{!1107, !1107, i64 0}
!1107 = !{!"long long", !204, i64 0}
!1108 = !DILocation(line: 171, column: 21, scope: !968)
!1109 = !DILocation(line: 172, column: 45, scope: !968)
!1110 = !DILocation(line: 97, column: 31, scope: !270, inlinedAt: !967)
!1111 = !DILocation(line: 97, column: 45, scope: !270, inlinedAt: !967)
!1112 = !DILocation(line: 97, column: 57, scope: !270, inlinedAt: !967)
!1113 = !DILocation(line: 98, column: 5, scope: !270, inlinedAt: !967)
!1114 = !DILocation(line: 99, column: 11, scope: !270, inlinedAt: !967)
!1115 = !DILocation(line: 64, column: 31, scope: !154, inlinedAt: !966)
!1116 = !DILocation(line: 64, column: 45, scope: !154, inlinedAt: !966)
