; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/dns.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/dns.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.dns_table_entry = type { i32, %struct.ip_addr, i16, i8, i8, i8, i8, i8, i8, [256 x i8], i8 }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_swrand = type opaque
%struct.udp_pcb = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8, %struct.udp_pcb*, i8, i16, i16, %struct.ip4_addr, i8, i8, void (i8*, %struct.udp_pcb*, %struct.pbuf*, %struct.ip_addr*, i16)*, i8* }
%struct.ip4_addr = type { i32 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.dns_req_entry = type { void (i8*, %struct.ip_addr*, i8*)*, i8*, i8, i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dns_hdr = type { i16, i8, i8, i16, i16, i16, i16 }
%struct.dns_query = type { i16, i16 }
%struct.dns_answer = type { i16, i16, i32, i16 }

@dns_mquery_v4group = dso_local local_unnamed_addr constant %struct.ip_addr { %union.anon { %struct.ip6_addr { [4 x i32] [i32 -83885856, i32 0, i32 0, i32 0], i8 0 } }, i8 0 }, align 4, !dbg !0

!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !27, line: 54, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !34, line: 68, baseType: !28, size: 32, elements: !35)
!34 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 212, baseType: !28, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45}
!42 = !DIEnumerator(name: "DNS_STATE_UNUSED", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "DNS_STATE_NEW", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "DNS_STATE_ASKING", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "DNS_STATE_DONE", value: 3, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 89, baseType: !28, size: 32, elements: !48)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !{!49, !50, !51, !52, !53}
!49 = !DIEnumerator(name: "PBUF_TRANSPORT", value: 74, isUnsigned: true)
!50 = !DIEnumerator(name: "PBUF_IP", value: 54, isUnsigned: true)
!51 = !DIEnumerator(name: "PBUF_LINK", value: 14, isUnsigned: true)
!52 = !DIEnumerator(name: "PBUF_RAW_TX", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PBUF_RAW", value: 0, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 145, baseType: !28, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "PBUF_RAM", value: 640, isUnsigned: true)
!57 = !DIEnumerator(name: "PBUF_ROM", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PBUF_REF", value: 65, isUnsigned: true)
!59 = !DIEnumerator(name: "PBUF_POOL", value: 386, isUnsigned: true)
!60 = !{!61, !62, !68, !72, !73, !74, !7, !77}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !63, line: 129, baseType: !64)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !65, line: 48, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !67, line: 79, baseType: !28)
!67 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !63, line: 127, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !65, line: 36, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !67, line: 57, baseType: !71)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !63, line: 125, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !65, line: 24, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !67, line: 43, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!0, !79, !105, !110, !132, !158, !163, !201, !215, !217}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "dns_mquery_v6group", scope: !2, file: !3, line: 307, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !27, line: 76, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !27, line: 69, size: 192, elements: !84)
!84 = !{!85, !104}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !83, file: !27, line: 73, baseType: !86, size: 160)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !27, line: 70, size: 160, elements: !87)
!87 = !{!88, !98}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !86, file: !27, line: 71, baseType: !89, size: 160)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !90, line: 67, baseType: !91)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !90, line: 59, size: 160, elements: !92)
!92 = !{!93, !97}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !91, file: !90, line: 60, baseType: !94, size: 128)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 4)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !91, file: !90, line: 62, baseType: !74, size: 8, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !86, file: !27, line: 72, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !100, line: 57, baseType: !101)
!100 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !100, line: 51, size: 32, elements: !102)
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !101, file: !100, line: 52, baseType: !62, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !27, line: 75, baseType: !74, size: 8, offset: 160)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "dns_servers", scope: !2, file: !3, line: 301, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 384, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 2)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dns_table", scope: !2, file: !3, line: 299, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 75776, elements: !130)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_table_entry", file: !3, line: 220, size: 2368, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !129}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !113, file: !3, line: 221, baseType: !62, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr", scope: !113, file: !3, line: 222, baseType: !82, size: 192, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "txid", scope: !113, file: !3, line: 223, baseType: !68, size: 16, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !113, file: !3, line: 224, baseType: !74, size: 8, offset: 240)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "server_idx", scope: !113, file: !3, line: 225, baseType: !74, size: 8, offset: 248)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !113, file: !3, line: 226, baseType: !74, size: 8, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !113, file: !3, line: 227, baseType: !74, size: 8, offset: 264)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !113, file: !3, line: 228, baseType: !74, size: 8, offset: 272)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pcb_idx", scope: !113, file: !3, line: 230, baseType: !74, size: 8, offset: 280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !3, line: 232, baseType: !125, size: 2048, offset: 288)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !127)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !{!128}
!128 = !DISubrange(count: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reqaddrtype", scope: !113, file: !3, line: 234, baseType: !74, size: 8, offset: 2336)
!130 = !{!131}
!131 = !DISubrange(count: 32)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "__str", scope: !134, file: !135, line: 198, type: !155, isLocal: true, isDefinition: true)
!134 = distinct !DISubprogram(name: "uk_pr_crit", scope: !135, file: !135, line: 194, type: !136, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !140)
!135 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, null}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!140 = !{!141, !142}
!141 = !DILocalVariable(name: "fmt", arg: 1, scope: !134, file: !135, line: 194, type: !138)
!142 = !DILocalVariable(name: "argp", scope: !134, file: !135, line: 196, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !144, line: 32, baseType: !145)
!144 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 192, elements: !153)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !147, file: !3, line: 196, baseType: !28, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !147, file: !3, line: 196, baseType: !28, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !147, file: !3, line: 196, baseType: !61, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !147, file: !3, line: 196, baseType: !61, size: 64, offset: 128)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 8)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "__str", scope: !134, file: !135, line: 198, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 48, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 6)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "dns_pcbs", scope: !2, file: !3, line: 294, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 2048, elements: !130)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_pcb", file: !168, line: 81, size: 768, elements: !169)
!168 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/udp.h", directory: "/root/.unikraft/apps/redis/build")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !200}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !167, file: !168, line: 83, baseType: !82, size: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !167, file: !168, line: 83, baseType: !82, size: 192, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 392)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 400)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !167, file: !168, line: 83, baseType: !74, size: 8, offset: 408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 87, baseType: !166, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !168, line: 89, baseType: !74, size: 8, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !167, file: !168, line: 91, baseType: !68, size: 16, offset: 528)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !167, file: !168, line: 91, baseType: !68, size: 16, offset: 544)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ip4", scope: !167, file: !168, line: 96, baseType: !99, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ifindex", scope: !167, file: !168, line: 99, baseType: !74, size: 8, offset: 608)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !167, file: !168, line: 101, baseType: !74, size: 8, offset: 616)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !167, file: !168, line: 110, baseType: !184, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "udp_recv_fn", file: !168, line: 77, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !61, !166, !188, !199, !68}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !47, line: 186, size: 192, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !47, line: 188, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !189, file: !47, line: 191, baseType: !61, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !189, file: !47, line: 200, baseType: !68, size: 16, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !189, file: !47, line: 203, baseType: !68, size: 16, offset: 144)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !189, file: !47, line: 208, baseType: !74, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !47, line: 211, baseType: !74, size: 8, offset: 168)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !189, file: !47, line: 218, baseType: !74, size: 8, offset: 176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !189, file: !47, line: 221, baseType: !74, size: 8, offset: 184)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "recv_arg", scope: !167, file: !168, line: 112, baseType: !61, size: 64, offset: 704)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "dns_requests", scope: !2, file: !3, line: 300, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 6144, elements: !130)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_req_entry", file: !3, line: 243, size: 192, elements: !205)
!205 = !{!206, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "found", scope: !204, file: !3, line: 245, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_found_callback", file: !208, line: 103, baseType: !209)
!208 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/dns.h", directory: "/root/.unikraft/apps/redis/build")
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !138, !199, !61}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !204, file: !3, line: 247, baseType: !61, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dns_table_idx", scope: !204, file: !3, line: 249, baseType: !74, size: 8, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reqaddrtype", scope: !204, file: !3, line: 252, baseType: !74, size: 8, offset: 136)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "dns_seqno", scope: !2, file: !3, line: 298, type: !74, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "dns_last_pcb_idx", scope: !2, file: !3, line: 296, type: !74, isLocal: true, isDefinition: true)
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!223 = distinct !DISubprogram(name: "dns_init", scope: !3, file: !3, line: 315, type: !224, isLocal: false, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{null}
!226 = !{}
!227 = !DILocation(line: 351, column: 1, scope: !223)
!228 = distinct !DISubprogram(name: "dns_setserver", scope: !3, file: !3, line: 361, type: !229, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !74, !199}
!231 = !{!232, !233}
!232 = !DILocalVariable(name: "numdns", arg: 1, scope: !228, file: !3, line: 361, type: !74)
!233 = !DILocalVariable(name: "dnsserver", arg: 2, scope: !228, file: !3, line: 361, type: !199)
!234 = !DILocation(line: 361, column: 20, scope: !228)
!235 = !DILocation(line: 361, column: 45, scope: !228)
!236 = !DILocation(line: 363, column: 14, scope: !237)
!237 = distinct !DILexicalBlock(scope: !228, file: !3, line: 363, column: 7)
!238 = !DILocation(line: 363, column: 7, scope: !228)
!239 = !DILocation(line: 364, column: 19, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 364, column: 9)
!241 = distinct !DILexicalBlock(scope: !237, file: !3, line: 363, column: 33)
!242 = !DILocation(line: 0, scope: !243)
!243 = distinct !DILexicalBlock(scope: !240, file: !3, line: 366, column: 12)
!244 = !DILocation(line: 0, scope: !245)
!245 = distinct !DILexicalBlock(scope: !240, file: !3, line: 364, column: 28)
!246 = !DILocation(line: 364, column: 9, scope: !241)
!247 = !DILocation(line: 365, column: 30, scope: !245)
!248 = !{i64 0, i64 16, !249, i64 16, i64 1, !249, i64 0, i64 4, !252, i64 20, i64 1, !249}
!249 = !{!250, !250, i64 0}
!250 = !{!"omnipotent char", !251, i64 0}
!251 = !{!"Simple C/C++ TBAA"}
!252 = !{!253, !253, i64 0}
!253 = !{!"int", !250, i64 0}
!254 = !DILocation(line: 366, column: 5, scope: !245)
!255 = !DILocation(line: 367, column: 29, scope: !243)
!256 = !DILocation(line: 370, column: 1, scope: !228)
!257 = distinct !DISubprogram(name: "dns_getserver", scope: !3, file: !3, line: 381, type: !258, isLocal: false, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!199, !74}
!260 = !{!261}
!261 = !DILocalVariable(name: "numdns", arg: 1, scope: !257, file: !3, line: 381, type: !74)
!262 = !DILocation(line: 381, column: 20, scope: !257)
!263 = !DILocation(line: 383, column: 14, scope: !264)
!264 = distinct !DILexicalBlock(scope: !257, file: !3, line: 383, column: 7)
!265 = !DILocation(line: 384, column: 13, scope: !266)
!266 = distinct !DILexicalBlock(scope: !264, file: !3, line: 383, column: 33)
!267 = !DILocation(line: 383, column: 7, scope: !257)
!268 = !DILocation(line: 388, column: 1, scope: !257)
!269 = distinct !DISubprogram(name: "dns_tmr", scope: !3, file: !3, line: 395, type: !224, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !226)
!270 = !DILocalVariable(name: "i", scope: !271, file: !3, line: 1126, type: !74)
!271 = distinct !DISubprogram(name: "dns_check_entries", scope: !3, file: !3, line: 1124, type: !224, isLocal: true, isDefinition: true, scopeLine: 1125, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !272)
!272 = !{!270}
!273 = !DILocation(line: 1126, column: 8, scope: !271, inlinedAt: !274)
!274 = distinct !DILocation(line: 398, column: 3, scope: !269)
!275 = !DILocation(line: 1129, column: 5, scope: !276, inlinedAt: !274)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 1128, column: 40)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 1128, column: 3)
!278 = distinct !DILexicalBlock(scope: !271, file: !3, line: 1128, column: 3)
!279 = !DILocation(line: 399, column: 1, scope: !269)
!280 = distinct !DISubprogram(name: "dns_gethostbyname", scope: !3, file: !3, line: 1526, type: !281, isLocal: false, isDefinition: true, scopeLine: 1528, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !289)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !138, !288, !207, !61}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !6, line: 96, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !63, line: 126, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !65, line: 20, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !67, line: 41, baseType: !287)
!287 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!289 = !{!290, !291, !292, !293}
!290 = !DILocalVariable(name: "hostname", arg: 1, scope: !280, file: !3, line: 1526, type: !138)
!291 = !DILocalVariable(name: "addr", arg: 2, scope: !280, file: !3, line: 1526, type: !288)
!292 = !DILocalVariable(name: "found", arg: 3, scope: !280, file: !3, line: 1526, type: !207)
!293 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !280, file: !3, line: 1527, type: !61)
!294 = !DILocation(line: 1526, column: 31, scope: !280)
!295 = !DILocation(line: 1526, column: 52, scope: !280)
!296 = !DILocation(line: 1526, column: 77, scope: !280)
!297 = !DILocation(line: 1527, column: 25, scope: !280)
!298 = !DILocation(line: 1529, column: 10, scope: !280)
!299 = !DILocation(line: 1529, column: 3, scope: !280)
!300 = distinct !DISubprogram(name: "dns_gethostbyname_addrtype", scope: !3, file: !3, line: 1547, type: !301, isLocal: false, isDefinition: true, scopeLine: 1549, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{!283, !138, !288, !207, !61, !74}
!303 = !{!304, !305, !306, !307, !308, !309, !314}
!304 = !DILocalVariable(name: "hostname", arg: 1, scope: !300, file: !3, line: 1547, type: !138)
!305 = !DILocalVariable(name: "addr", arg: 2, scope: !300, file: !3, line: 1547, type: !288)
!306 = !DILocalVariable(name: "found", arg: 3, scope: !300, file: !3, line: 1547, type: !207)
!307 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !300, file: !3, line: 1548, type: !61)
!308 = !DILocalVariable(name: "dns_addrtype", arg: 5, scope: !300, file: !3, line: 1548, type: !74)
!309 = !DILocalVariable(name: "hostnamelen", scope: !300, file: !3, line: 1550, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !311, line: 40, baseType: !312)
!311 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !313, line: 129, baseType: !72)
!313 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!314 = !DILocalVariable(name: "fallback", scope: !315, file: !3, line: 1596, type: !74)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 1594, column: 103)
!316 = distinct !DILexicalBlock(scope: !300, file: !3, line: 1594, column: 7)
!317 = !DILocation(line: 1547, column: 40, scope: !300)
!318 = !DILocation(line: 1547, column: 61, scope: !300)
!319 = !DILocation(line: 1547, column: 86, scope: !300)
!320 = !DILocation(line: 1548, column: 34, scope: !300)
!321 = !DILocation(line: 1548, column: 53, scope: !300)
!322 = !DILocation(line: 1556, column: 13, scope: !323)
!323 = distinct !DILexicalBlock(scope: !300, file: !3, line: 1556, column: 7)
!324 = !DILocation(line: 1557, column: 9, scope: !323)
!325 = !DILocation(line: 1556, column: 22, scope: !323)
!326 = !DILocation(line: 1557, column: 24, scope: !323)
!327 = !DILocation(line: 1556, column: 7, scope: !300)
!328 = !DILocation(line: 1565, column: 17, scope: !300)
!329 = !DILocation(line: 1550, column: 10, scope: !300)
!330 = !DILocation(line: 1566, column: 19, scope: !331)
!331 = distinct !DILexicalBlock(scope: !300, file: !3, line: 1566, column: 7)
!332 = !DILocation(line: 1566, column: 7, scope: !300)
!333 = !DILocation(line: 1580, column: 7, scope: !334)
!334 = distinct !DILexicalBlock(scope: !300, file: !3, line: 1580, column: 7)
!335 = !DILocation(line: 1580, column: 7, scope: !300)
!336 = !DILocation(line: 1582, column: 10, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !3, line: 1582, column: 9)
!338 = distinct !DILexicalBlock(scope: !334, file: !3, line: 1580, column: 36)
!339 = !{!340, !250, i64 20}
!340 = !{!"ip_addr", !250, i64 0, !250, i64 20}
!341 = !DILocation(line: 1582, column: 42, scope: !337)
!342 = !DILocation(line: 1582, column: 25, scope: !337)
!343 = !DILocation(line: 1583, column: 10, scope: !337)
!344 = !DILocation(line: 1583, column: 42, scope: !337)
!345 = !DILocation(line: 1583, column: 25, scope: !337)
!346 = !DILocation(line: 1590, column: 7, scope: !347)
!347 = distinct !DILexicalBlock(scope: !300, file: !3, line: 1590, column: 7)
!348 = !DILocation(line: 1590, column: 70, scope: !347)
!349 = !DILocation(line: 1590, column: 7, scope: !300)
!350 = !DILocation(line: 1594, column: 53, scope: !316)
!351 = !DILocation(line: 1594, column: 21, scope: !316)
!352 = !DILocation(line: 1599, column: 5, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !3, line: 1597, column: 54)
!354 = distinct !DILexicalBlock(scope: !315, file: !3, line: 1597, column: 9)
!355 = !DILocation(line: 1596, column: 10, scope: !315)
!356 = !DILocation(line: 1602, column: 9, scope: !357)
!357 = distinct !DILexicalBlock(scope: !315, file: !3, line: 1602, column: 9)
!358 = !DILocation(line: 1602, column: 68, scope: !357)
!359 = !DILocation(line: 1621, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 1621, column: 9)
!361 = distinct !DILexicalBlock(scope: !300, file: !3, line: 1619, column: 3)
!362 = !DILocation(line: 1621, column: 9, scope: !361)
!363 = !DILocation(line: 1388, column: 23, scope: !364, inlinedAt: !392)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 1388, column: 9)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 1387, column: 40)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 1387, column: 3)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1387, column: 3)
!368 = distinct !DISubprogram(name: "dns_enqueue", scope: !3, file: !3, line: 1375, type: !369, isLocal: true, isDefinition: true, scopeLine: 1377, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!283, !138, !310, !207, !61, !74}
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !382, !383, !385, !386}
!372 = !DILocalVariable(name: "name", arg: 1, scope: !368, file: !3, line: 1375, type: !138)
!373 = !DILocalVariable(name: "hostnamelen", arg: 2, scope: !368, file: !3, line: 1375, type: !310)
!374 = !DILocalVariable(name: "found", arg: 3, scope: !368, file: !3, line: 1375, type: !207)
!375 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !368, file: !3, line: 1376, type: !61)
!376 = !DILocalVariable(name: "dns_addrtype", arg: 5, scope: !368, file: !3, line: 1376, type: !74)
!377 = !DILocalVariable(name: "i", scope: !368, file: !3, line: 1378, type: !74)
!378 = !DILocalVariable(name: "lseq", scope: !368, file: !3, line: 1379, type: !74)
!379 = !DILocalVariable(name: "lseqi", scope: !368, file: !3, line: 1379, type: !74)
!380 = !DILocalVariable(name: "entry", scope: !368, file: !3, line: 1380, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!382 = !DILocalVariable(name: "namelen", scope: !368, file: !3, line: 1381, type: !310)
!383 = !DILocalVariable(name: "req", scope: !368, file: !3, line: 1382, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!385 = !DILocalVariable(name: "r", scope: !368, file: !3, line: 1385, type: !74)
!386 = !DILocalVariable(name: "age", scope: !387, file: !3, line: 1425, type: !74)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 1424, column: 41)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 1424, column: 9)
!389 = distinct !DILexicalBlock(scope: !390, file: !3, line: 1417, column: 40)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 1417, column: 3)
!391 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1417, column: 3)
!392 = distinct !DILocation(line: 1627, column: 10, scope: !300)
!393 = !DILocation(line: 1378, column: 8, scope: !368, inlinedAt: !392)
!394 = !DILocation(line: 1380, column: 27, scope: !368, inlinedAt: !392)
!395 = !DILocation(line: 1379, column: 14, scope: !368, inlinedAt: !392)
!396 = !DILocation(line: 1379, column: 8, scope: !368, inlinedAt: !392)
!397 = !DILocation(line: 1417, column: 3, scope: !391, inlinedAt: !392)
!398 = !{!399, !250, i64 30}
!399 = !{!"dns_table_entry", !253, i64 0, !340, i64 4, !400, i64 28, !250, i64 30, !250, i64 31, !250, i64 32, !250, i64 33, !250, i64 34, !250, i64 35, !250, i64 36, !250, i64 292}
!400 = !{!"short", !250, i64 0}
!401 = !DILocation(line: 1388, column: 29, scope: !364, inlinedAt: !392)
!402 = !DILocation(line: 1388, column: 50, scope: !364, inlinedAt: !392)
!403 = !DILocation(line: 1389, column: 30, scope: !364, inlinedAt: !392)
!404 = !DILocation(line: 1389, column: 10, scope: !364, inlinedAt: !392)
!405 = !DILocation(line: 1389, column: 76, scope: !364, inlinedAt: !392)
!406 = !DILocation(line: 1388, column: 9, scope: !365, inlinedAt: !392)
!407 = !DILocation(line: 1391, column: 24, scope: !408, inlinedAt: !392)
!408 = distinct !DILexicalBlock(scope: !409, file: !3, line: 1391, column: 11)
!409 = distinct !DILexicalBlock(scope: !364, file: !3, line: 1389, column: 83)
!410 = !{!399, !250, i64 292}
!411 = !DILocation(line: 1391, column: 36, scope: !408, inlinedAt: !392)
!412 = !DILocation(line: 1391, column: 11, scope: !409, inlinedAt: !392)
!413 = !DILocation(line: 1385, column: 8, scope: !368, inlinedAt: !392)
!414 = !DILocation(line: 1400, column: 29, scope: !415, inlinedAt: !392)
!415 = distinct !DILexicalBlock(scope: !416, file: !3, line: 1400, column: 13)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 1399, column: 46)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 1399, column: 7)
!418 = distinct !DILexicalBlock(scope: !409, file: !3, line: 1399, column: 7)
!419 = !{!420, !421, i64 0}
!420 = !{!"dns_req_entry", !421, i64 0, !421, i64 8, !250, i64 16, !250, i64 17}
!421 = !{!"any pointer", !250, i64 0}
!422 = !DILocation(line: 1400, column: 35, scope: !415, inlinedAt: !392)
!423 = !DILocation(line: 1399, column: 42, scope: !417, inlinedAt: !392)
!424 = !DILocation(line: 1400, column: 13, scope: !416, inlinedAt: !392)
!425 = !DILocation(line: 1401, column: 33, scope: !426, inlinedAt: !392)
!426 = distinct !DILexicalBlock(scope: !415, file: !3, line: 1400, column: 41)
!427 = !DILocation(line: 1402, column: 27, scope: !426, inlinedAt: !392)
!428 = !DILocation(line: 1402, column: 31, scope: !426, inlinedAt: !392)
!429 = !{!420, !421, i64 8}
!430 = !DILocation(line: 1403, column: 27, scope: !426, inlinedAt: !392)
!431 = !DILocation(line: 1403, column: 41, scope: !426, inlinedAt: !392)
!432 = !{!420, !250, i64 16}
!433 = !DILocation(line: 1404, column: 11, scope: !434, inlinedAt: !392)
!434 = distinct !DILexicalBlock(scope: !426, file: !3, line: 1404, column: 11)
!435 = !{!420, !250, i64 17}
!436 = !DILocation(line: 1406, column: 11, scope: !426, inlinedAt: !392)
!437 = !DILocation(line: 1387, column: 36, scope: !366, inlinedAt: !392)
!438 = !DILocation(line: 1387, column: 17, scope: !366, inlinedAt: !392)
!439 = !DILocation(line: 1387, column: 3, scope: !367, inlinedAt: !392)
!440 = distinct !{!440, !441, !442}
!441 = !DILocation(line: 1387, column: 3, scope: !367)
!442 = !DILocation(line: 1410, column: 3, scope: !367)
!443 = !DILocation(line: 1420, column: 16, scope: !444, inlinedAt: !392)
!444 = distinct !DILexicalBlock(scope: !389, file: !3, line: 1420, column: 9)
!445 = !DILocation(line: 1420, column: 9, scope: !389, inlinedAt: !392)
!446 = !DILocation(line: 1425, column: 44, scope: !387, inlinedAt: !392)
!447 = !{!399, !250, i64 34}
!448 = !DILocation(line: 1425, column: 35, scope: !387, inlinedAt: !392)
!449 = !DILocation(line: 1425, column: 12, scope: !387, inlinedAt: !392)
!450 = !DILocation(line: 1426, column: 15, scope: !451, inlinedAt: !392)
!451 = distinct !DILexicalBlock(scope: !387, file: !3, line: 1426, column: 11)
!452 = !DILocation(line: 1426, column: 11, scope: !387, inlinedAt: !392)
!453 = !DILocation(line: 1430, column: 5, scope: !387, inlinedAt: !392)
!454 = !DILocation(line: 0, scope: !368, inlinedAt: !392)
!455 = !DILocation(line: 1417, column: 35, scope: !390, inlinedAt: !392)
!456 = !DILocation(line: 1418, column: 14, scope: !389, inlinedAt: !392)
!457 = !DILocation(line: 1434, column: 9, scope: !458, inlinedAt: !392)
!458 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1434, column: 7)
!459 = !DILocation(line: 1434, column: 7, scope: !368, inlinedAt: !392)
!460 = !DILocation(line: 1435, column: 16, scope: !461, inlinedAt: !392)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 1435, column: 9)
!462 = distinct !DILexicalBlock(scope: !458, file: !3, line: 1434, column: 28)
!463 = !DILocation(line: 1435, column: 35, scope: !461, inlinedAt: !392)
!464 = !DILocation(line: 1435, column: 39, scope: !461, inlinedAt: !392)
!465 = !DILocation(line: 1435, column: 56, scope: !461, inlinedAt: !392)
!466 = !DILocation(line: 1435, column: 62, scope: !461, inlinedAt: !392)
!467 = !DILocation(line: 1435, column: 9, scope: !462, inlinedAt: !392)
!468 = !DILocation(line: 1444, column: 3, scope: !462, inlinedAt: !392)
!469 = !DILocation(line: 1449, column: 8, scope: !470, inlinedAt: !392)
!470 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1449, column: 3)
!471 = !DILocation(line: 0, scope: !389, inlinedAt: !392)
!472 = !DILocation(line: 0, scope: !391, inlinedAt: !392)
!473 = !DILocation(line: 1382, column: 25, scope: !368, inlinedAt: !392)
!474 = !DILocation(line: 1449, column: 3, scope: !470, inlinedAt: !392)
!475 = !DILocation(line: 1450, column: 25, scope: !476, inlinedAt: !392)
!476 = distinct !DILexicalBlock(scope: !477, file: !3, line: 1450, column: 9)
!477 = distinct !DILexicalBlock(scope: !478, file: !3, line: 1449, column: 42)
!478 = distinct !DILexicalBlock(scope: !470, file: !3, line: 1449, column: 3)
!479 = !DILocation(line: 1450, column: 31, scope: !476, inlinedAt: !392)
!480 = !DILocation(line: 1449, column: 38, scope: !478, inlinedAt: !392)
!481 = !DILocation(line: 1450, column: 9, scope: !477, inlinedAt: !392)
!482 = !DILocation(line: 1460, column: 8, scope: !368, inlinedAt: !392)
!483 = !DILocation(line: 1460, column: 22, scope: !368, inlinedAt: !392)
!484 = !DILocation(line: 1470, column: 10, scope: !368, inlinedAt: !392)
!485 = !DILocation(line: 1470, column: 16, scope: !368, inlinedAt: !392)
!486 = !DILocation(line: 1471, column: 10, scope: !368, inlinedAt: !392)
!487 = !DILocation(line: 1471, column: 16, scope: !368, inlinedAt: !392)
!488 = !DILocation(line: 1472, column: 3, scope: !489, inlinedAt: !392)
!489 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1472, column: 3)
!490 = !DILocation(line: 1473, column: 3, scope: !491, inlinedAt: !392)
!491 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1473, column: 3)
!492 = !DILocation(line: 1474, column: 14, scope: !368, inlinedAt: !392)
!493 = !DILocation(line: 1475, column: 8, scope: !368, inlinedAt: !392)
!494 = !DILocation(line: 1475, column: 14, scope: !368, inlinedAt: !392)
!495 = !DILocation(line: 1476, column: 13, scope: !368, inlinedAt: !392)
!496 = !DILocation(line: 1381, column: 10, scope: !368, inlinedAt: !392)
!497 = !DILocation(line: 1477, column: 3, scope: !368, inlinedAt: !392)
!498 = !DILocation(line: 1478, column: 3, scope: !368, inlinedAt: !392)
!499 = !DILocation(line: 1478, column: 24, scope: !368, inlinedAt: !392)
!500 = !DILocalVariable(name: "i", scope: !501, file: !3, line: 902, type: !74)
!501 = distinct !DISubprogram(name: "dns_alloc_pcb", scope: !3, file: !3, line: 900, type: !502, isLocal: true, isDefinition: true, scopeLine: 901, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{!74}
!504 = !{!500, !505}
!505 = !DILocalVariable(name: "idx", scope: !501, file: !3, line: 903, type: !74)
!506 = !DILocation(line: 902, column: 8, scope: !501, inlinedAt: !507)
!507 = distinct !DILocation(line: 1481, column: 20, scope: !368, inlinedAt: !392)
!508 = !DILocation(line: 906, column: 9, scope: !509, inlinedAt: !507)
!509 = distinct !DILexicalBlock(scope: !510, file: !3, line: 906, column: 9)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 905, column: 46)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 905, column: 3)
!512 = distinct !DILexicalBlock(scope: !501, file: !3, line: 905, column: 3)
!513 = !{!421, !421, i64 0}
!514 = !DILocation(line: 906, column: 21, scope: !509, inlinedAt: !507)
!515 = !DILocation(line: 906, column: 9, scope: !510, inlinedAt: !507)
!516 = !DILocation(line: 871, column: 9, scope: !517, inlinedAt: !525)
!517 = distinct !DISubprogram(name: "dns_alloc_random_port", scope: !3, file: !3, line: 866, type: !518, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!166}
!520 = !{!521, !522, !523}
!521 = !DILocalVariable(name: "err", scope: !517, file: !3, line: 868, type: !283)
!522 = !DILocalVariable(name: "pcb", scope: !517, file: !3, line: 869, type: !166)
!523 = !DILocalVariable(name: "port", scope: !524, file: !3, line: 877, type: !68)
!524 = distinct !DILexicalBlock(scope: !517, file: !3, line: 876, column: 6)
!525 = distinct !DILocation(line: 911, column: 19, scope: !526, inlinedAt: !507)
!526 = distinct !DILexicalBlock(scope: !527, file: !3, line: 910, column: 33)
!527 = distinct !DILexicalBlock(scope: !501, file: !3, line: 910, column: 7)
!528 = !DILocation(line: 869, column: 19, scope: !517, inlinedAt: !525)
!529 = !DILocation(line: 872, column: 11, scope: !530, inlinedAt: !525)
!530 = distinct !DILexicalBlock(scope: !517, file: !3, line: 872, column: 7)
!531 = !DILocation(line: 872, column: 7, scope: !517, inlinedAt: !525)
!532 = !DILocation(line: 65, column: 2, scope: !533, inlinedAt: !550)
!533 = distinct !DISubprogram(name: "isolated_rand", scope: !534, file: !534, line: 63, type: !535, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !539)
!534 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/cc.h", directory: "/root/.unikraft/apps/redis/build")
!535 = !DISubroutineType(types: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !538, line: 88, baseType: !28)
!538 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!539 = !{!540, !541, !547}
!540 = !DILocalVariable(name: "randn", scope: !533, file: !534, line: 65, type: !537)
!541 = !DILocalVariable(name: "tid", scope: !542, file: !534, line: 66, type: !64)
!542 = distinct !DILexicalBlock(scope: !543, file: !534, line: 66, column: 2)
!543 = distinct !DILexicalBlock(scope: !544, file: !534, line: 66, column: 2)
!544 = distinct !DILexicalBlock(scope: !545, file: !534, line: 66, column: 2)
!545 = distinct !DILexicalBlock(scope: !546, file: !534, line: 66, column: 2)
!546 = distinct !DILexicalBlock(scope: !533, file: !534, line: 66, column: 2)
!547 = !DILocalVariable(name: "_ret", scope: !542, file: !534, line: 66, type: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !65, line: 60, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !67, line: 105, baseType: !72)
!550 = distinct !DILocation(line: 877, column: 25, scope: !524, inlinedAt: !525)
!551 = !DILocation(line: 120, column: 2, scope: !552, inlinedAt: !558)
!552 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !553, file: !553, line: 116, type: !554, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !556)
!553 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!554 = !DISubroutineType(types: !555)
!555 = !{!72}
!556 = !{!557}
!557 = !DILocalVariable(name: "sp", scope: !552, file: !553, line: 118, type: !72)
!558 = distinct !DILocation(line: 66, column: 2, scope: !545, inlinedAt: !550)
!559 = !{i32 567325}
!560 = !DILocation(line: 118, column: 16, scope: !552, inlinedAt: !558)
!561 = !DILocation(line: 66, column: 2, scope: !545, inlinedAt: !550)
!562 = !DILocation(line: 120, column: 2, scope: !552, inlinedAt: !563)
!563 = distinct !DILocation(line: 66, column: 2, scope: !545, inlinedAt: !550)
!564 = !DILocation(line: 118, column: 16, scope: !552, inlinedAt: !563)
!565 = !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !550)
!566 = !DILocation(line: 65, column: 11, scope: !567, inlinedAt: !572)
!567 = distinct !DISubprogram(name: "uk_swrand_randr", scope: !568, file: !568, line: 60, type: !535, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !569)
!568 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukswrand/include/uk/swrand.h", directory: "/root/.unikraft/apps/redis/build")
!569 = !{!570, !571}
!570 = !DILocalVariable(name: "iflags", scope: !567, file: !568, line: 62, type: !72)
!571 = !DILocalVariable(name: "ret", scope: !567, file: !568, line: 63, type: !537)
!572 = distinct !DILocation(line: 66, column: 2, scope: !573, inlinedAt: !550)
!573 = distinct !DILexicalBlock(scope: !545, file: !534, line: 66, column: 2)
!574 = !DILocation(line: 62, column: 16, scope: !567, inlinedAt: !572)
!575 = !DILocation(line: 66, column: 8, scope: !567, inlinedAt: !572)
!576 = !DILocation(line: 63, column: 8, scope: !567, inlinedAt: !572)
!577 = !DILocation(line: 67, column: 2, scope: !567, inlinedAt: !572)
!578 = !DILocation(line: 65, column: 8, scope: !533, inlinedAt: !550)
!579 = !DILocation(line: 66, column: 2, scope: !573, inlinedAt: !550)
!580 = !DILocation(line: 120, column: 2, scope: !552, inlinedAt: !581)
!581 = distinct !DILocation(line: 49, column: 21, scope: !582, inlinedAt: !588)
!582 = distinct !DISubprogram(name: "uk_thread_get_tid", scope: !583, file: !583, line: 47, type: !584, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !586)
!583 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku-impl.h", directory: "/root/.unikraft/apps/redis/build")
!584 = !DISubroutineType(types: !585)
!585 = !{!7}
!586 = !{!587}
!587 = !DILocalVariable(name: "sp", scope: !582, file: !583, line: 49, type: !72)
!588 = distinct !DILocation(line: 66, column: 2, scope: !542, inlinedAt: !550)
!589 = !DILocation(line: 118, column: 16, scope: !552, inlinedAt: !581)
!590 = !DILocation(line: 49, column: 16, scope: !582, inlinedAt: !588)
!591 = !DILocation(line: 50, column: 19, scope: !582, inlinedAt: !588)
!592 = !DILocation(line: 50, column: 11, scope: !582, inlinedAt: !588)
!593 = !DILocation(line: 50, column: 9, scope: !582, inlinedAt: !588)
!594 = !DILocation(line: 66, column: 2, scope: !542, inlinedAt: !550)
!595 = !{i32 -2146788957, i32 -2146788944, i32 -2146788919, i32 -2146788895, i32 -2146788870, i32 -2146788795, i32 -2146788770, i32 -2146788626, i32 -2146785533, i32 -2146785444, i32 -2146785323, i32 -2146785228, i32 -2146785127, i32 -2146785100, i32 -2146785017, i32 -2146784928, i32 -2146784807, i32 -2146784707, i32 -2146784601, i32 -2146784493, i32 -2146788343, i32 -2146788290, i32 -2146788259, i32 -2146788228, i32 -2146788207, i32 -2146788185, i32 -2146788136, i32 -2146788115, i32 -2146784410, i32 -2146784321, i32 -2146784200, i32 -2146784101, i32 -2146783995, i32 -2146783893, i32 -2146783860, i32 -2146783787, i32 -2146783719, i32 -2146787813, i32 -2146787754, i32 -2146787701, i32 -2146787670, i32 -2146787639, i32 -2146787618, i32 -2146787596, i32 -2146787547, i32 -2146787526, i32 -2146783668, i32 -2146783579, i32 -2146783458, i32 -2146783359, i32 -2146783253, i32 -2146783151, i32 -2146783118, i32 -2146783035, i32 -2146782946, i32 -2146782825, i32 -2146782725, i32 -2146782699, i32 -2146782596, i32 -2146782570, i32 -2146787268, i32 -2146787201, i32 -2146787176, i32 -2146787112, i32 -2146787030, i32 -2146787007, i32 -2146786982, i32 -2146786957}
!596 = !DILocation(line: 66, column: 2, scope: !597, inlinedAt: !550)
!597 = distinct !DILexicalBlock(scope: !598, file: !534, line: 66, column: 2)
!598 = distinct !DILexicalBlock(scope: !542, file: !534, line: 66, column: 2)
!599 = !{i32 -2146786010, i32 -2146785993}
!600 = !DILocation(line: 67, column: 9, scope: !533, inlinedAt: !550)
!601 = !DILocation(line: 68, column: 1, scope: !533, inlinedAt: !550)
!602 = !DILocation(line: 878, column: 9, scope: !603, inlinedAt: !525)
!603 = distinct !DILexicalBlock(scope: !524, file: !3, line: 878, column: 9)
!604 = !DILocation(line: 878, column: 9, scope: !524, inlinedAt: !525)
!605 = !DILocation(line: 877, column: 18, scope: !524, inlinedAt: !525)
!606 = !DILocation(line: 877, column: 11, scope: !524, inlinedAt: !525)
!607 = !DILocation(line: 879, column: 13, scope: !608, inlinedAt: !525)
!608 = distinct !DILexicalBlock(scope: !603, file: !3, line: 878, column: 33)
!609 = !DILocation(line: 868, column: 9, scope: !517, inlinedAt: !525)
!610 = !DILocation(line: 880, column: 5, scope: !608, inlinedAt: !525)
!611 = !DILocation(line: 0, scope: !612, inlinedAt: !525)
!612 = distinct !DILexicalBlock(scope: !603, file: !3, line: 880, column: 12)
!613 = !DILocation(line: 884, column: 3, scope: !524, inlinedAt: !525)
!614 = !DILocation(line: 886, column: 5, scope: !615, inlinedAt: !525)
!615 = distinct !DILexicalBlock(scope: !616, file: !3, line: 885, column: 22)
!616 = distinct !DILexicalBlock(scope: !517, file: !3, line: 885, column: 7)
!617 = !DILocation(line: 887, column: 5, scope: !615, inlinedAt: !525)
!618 = !DILocation(line: 911, column: 17, scope: !526, inlinedAt: !507)
!619 = !DILocation(line: 912, column: 9, scope: !526, inlinedAt: !507)
!620 = !DILocation(line: 920, column: 28, scope: !621, inlinedAt: !507)
!621 = distinct !DILexicalBlock(scope: !501, file: !3, line: 920, column: 3)
!622 = !DILocation(line: 903, column: 8, scope: !501, inlinedAt: !507)
!623 = !DILocation(line: 920, column: 3, scope: !621, inlinedAt: !507)
!624 = !DILocation(line: 0, scope: !625, inlinedAt: !507)
!625 = distinct !DILexicalBlock(scope: !621, file: !3, line: 920, column: 3)
!626 = !DILocation(line: 921, column: 13, scope: !627, inlinedAt: !507)
!627 = distinct !DILexicalBlock(scope: !628, file: !3, line: 921, column: 9)
!628 = distinct !DILexicalBlock(scope: !625, file: !3, line: 920, column: 89)
!629 = !DILocation(line: 921, column: 9, scope: !628, inlinedAt: !507)
!630 = !DILocation(line: 924, column: 9, scope: !631, inlinedAt: !507)
!631 = distinct !DILexicalBlock(scope: !628, file: !3, line: 924, column: 9)
!632 = !DILocation(line: 924, column: 23, scope: !631, inlinedAt: !507)
!633 = !DILocation(line: 920, column: 78, scope: !625, inlinedAt: !507)
!634 = !DILocation(line: 924, column: 9, scope: !628, inlinedAt: !507)
!635 = !DILocation(line: 889, column: 3, scope: !517, inlinedAt: !525)
!636 = !DILocation(line: 1482, column: 7, scope: !368, inlinedAt: !392)
!637 = !DILocation(line: 1481, column: 10, scope: !368, inlinedAt: !392)
!638 = !DILocation(line: 1481, column: 18, scope: !368, inlinedAt: !392)
!639 = !{!399, !250, i64 35}
!640 = !DILocation(line: 1485, column: 18, scope: !641, inlinedAt: !392)
!641 = distinct !DILexicalBlock(scope: !642, file: !3, line: 1482, column: 47)
!642 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1482, column: 7)
!643 = !DILocation(line: 1486, column: 16, scope: !641, inlinedAt: !392)
!644 = !DILocation(line: 1487, column: 5, scope: !641, inlinedAt: !392)
!645 = !DILocation(line: 1496, column: 12, scope: !368, inlinedAt: !392)
!646 = !DILocation(line: 1499, column: 3, scope: !368, inlinedAt: !392)
!647 = !DILocation(line: 1502, column: 3, scope: !368, inlinedAt: !392)
!648 = !DILocation(line: 0, scope: !649)
!649 = distinct !DILexicalBlock(scope: !323, file: !3, line: 1557, column: 38)
!650 = !DILocation(line: 1629, column: 1, scope: !300)
!651 = !DILocation(line: 920, column: 53, scope: !625, inlinedAt: !507)
!652 = distinct !{!652, !653, !654}
!653 = !DILocation(line: 920, column: 3, scope: !621)
!654 = !DILocation(line: 928, column: 3, scope: !621)
!655 = !DILocation(line: 1449, column: 17, scope: !478, inlinedAt: !392)
!656 = distinct !{!656, !657, !658}
!657 = !DILocation(line: 1449, column: 3, scope: !470)
!658 = !DILocation(line: 1454, column: 3, scope: !470)
!659 = !DILocation(line: 1417, column: 17, scope: !390, inlinedAt: !392)
!660 = distinct !{!660, !661, !662}
!661 = !DILocation(line: 1417, column: 3, scope: !391)
!662 = !DILocation(line: 1431, column: 3, scope: !391)
!663 = !DILocation(line: 1399, column: 21, scope: !417, inlinedAt: !392)
!664 = !DILocation(line: 1399, column: 7, scope: !418, inlinedAt: !392)
!665 = distinct !{!665, !666, !667}
!666 = !DILocation(line: 1399, column: 7, scope: !418)
!667 = !DILocation(line: 1408, column: 7, scope: !418)
!668 = distinct !DISubprogram(name: "dns_lookup", scope: !3, file: !3, line: 602, type: !669, isLocal: true, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!283, !138, !288, !74}
!671 = !{!672, !673, !674, !675}
!672 = !DILocalVariable(name: "name", arg: 1, scope: !668, file: !3, line: 602, type: !138)
!673 = !DILocalVariable(name: "addr", arg: 2, scope: !668, file: !3, line: 602, type: !288)
!674 = !DILocalVariable(name: "dns_addrtype", arg: 3, scope: !668, file: !3, line: 602, type: !74)
!675 = !DILocalVariable(name: "i", scope: !668, file: !3, line: 604, type: !74)
!676 = !DILocation(line: 602, column: 24, scope: !668)
!677 = !DILocation(line: 602, column: 41, scope: !668)
!678 = !DILocation(line: 602, column: 46, scope: !668)
!679 = !DILocation(line: 604, column: 8, scope: !668)
!680 = !DILocation(line: 617, column: 3, scope: !681)
!681 = distinct !DILexicalBlock(scope: !668, file: !3, line: 617, column: 3)
!682 = !DILocation(line: 618, column: 23, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !3, line: 618, column: 9)
!684 = distinct !DILexicalBlock(scope: !685, file: !3, line: 617, column: 40)
!685 = distinct !DILexicalBlock(scope: !681, file: !3, line: 617, column: 3)
!686 = !DILocation(line: 618, column: 29, scope: !683)
!687 = !DILocation(line: 618, column: 48, scope: !683)
!688 = !DILocation(line: 619, column: 30, scope: !683)
!689 = !DILocation(line: 619, column: 10, scope: !683)
!690 = !DILocation(line: 619, column: 76, scope: !683)
!691 = !DILocation(line: 619, column: 82, scope: !683)
!692 = !DILocation(line: 620, column: 9, scope: !683)
!693 = !{!399, !250, i64 24}
!694 = !DILocation(line: 618, column: 9, scope: !684)
!695 = !DILocation(line: 624, column: 11, scope: !696)
!696 = distinct !DILexicalBlock(scope: !697, file: !3, line: 624, column: 11)
!697 = distinct !DILexicalBlock(scope: !683, file: !3, line: 620, column: 72)
!698 = !DILocation(line: 624, column: 11, scope: !697)
!699 = !DILocation(line: 625, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 625, column: 9)
!701 = distinct !DILexicalBlock(scope: !702, file: !3, line: 625, column: 9)
!702 = distinct !DILexicalBlock(scope: !696, file: !3, line: 624, column: 17)
!703 = !DILocation(line: 625, column: 9, scope: !704)
!704 = distinct !DILexicalBlock(scope: !701, file: !3, line: 625, column: 9)
!705 = !DILocation(line: 625, column: 9, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !3, line: 625, column: 9)
!707 = distinct !DILexicalBlock(scope: !704, file: !3, line: 625, column: 9)
!708 = !DILocation(line: 625, column: 9, scope: !701)
!709 = !DILocation(line: 625, column: 9, scope: !707)
!710 = !DILocation(line: 625, column: 9, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !3, line: 625, column: 9)
!712 = distinct !DILexicalBlock(scope: !704, file: !3, line: 625, column: 9)
!713 = !DILocation(line: 617, column: 35, scope: !685)
!714 = !DILocation(line: 617, column: 17, scope: !685)
!715 = distinct !{!715, !680, !716}
!716 = !DILocation(line: 629, column: 3, scope: !681)
!717 = !DILocation(line: 0, scope: !668)
!718 = !DILocation(line: 632, column: 1, scope: !668)
!719 = distinct !DISubprogram(name: "dns_check_entry", scope: !3, file: !3, line: 1047, type: !720, isLocal: true, isDefinition: true, scopeLine: 1048, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !74}
!722 = !{!723, !724, !725}
!723 = !DILocalVariable(name: "i", arg: 1, scope: !719, file: !3, line: 1047, type: !74)
!724 = !DILocalVariable(name: "err", scope: !719, file: !3, line: 1049, type: !283)
!725 = !DILocalVariable(name: "entry", scope: !719, file: !3, line: 1050, type: !381)
!726 = !DILocation(line: 1047, column: 22, scope: !719)
!727 = !DILocation(line: 1050, column: 36, scope: !719)
!728 = !DILocation(line: 1052, column: 3, scope: !729)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 1052, column: 3)
!730 = distinct !DILexicalBlock(scope: !719, file: !3, line: 1052, column: 3)
!731 = !DILocation(line: 1052, column: 3, scope: !730)
!732 = !DILocation(line: 1052, column: 3, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !3, line: 1052, column: 3)
!734 = distinct !DILexicalBlock(scope: !729, file: !3, line: 1052, column: 3)
!735 = !DILocation(line: 1052, column: 3, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 1052, column: 3)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1052, column: 3)
!738 = distinct !DILexicalBlock(scope: !733, file: !3, line: 1052, column: 3)
!739 = !DILocation(line: 1054, column: 18, scope: !719)
!740 = !DILocation(line: 1054, column: 3, scope: !719)
!741 = !DILocation(line: 1003, column: 3, scope: !742, inlinedAt: !748)
!742 = distinct !DISubprogram(name: "dns_create_txid", scope: !3, file: !3, line: 1000, type: !743, isLocal: true, isDefinition: true, scopeLine: 1001, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{!68}
!745 = !{!746, !747}
!746 = !DILocalVariable(name: "txid", scope: !742, file: !3, line: 1002, type: !68)
!747 = !DILocalVariable(name: "i", scope: !742, file: !3, line: 1003, type: !74)
!748 = distinct !DILocation(line: 1057, column: 21, scope: !749)
!749 = distinct !DILexicalBlock(scope: !719, file: !3, line: 1054, column: 25)
!750 = !DILocation(line: 65, column: 2, scope: !533, inlinedAt: !751)
!751 = distinct !DILocation(line: 1006, column: 17, scope: !742, inlinedAt: !748)
!752 = !DILocation(line: 120, column: 2, scope: !552, inlinedAt: !753)
!753 = distinct !DILocation(line: 66, column: 2, scope: !545, inlinedAt: !751)
!754 = !DILocation(line: 118, column: 16, scope: !552, inlinedAt: !753)
!755 = !DILocation(line: 66, column: 2, scope: !545, inlinedAt: !751)
!756 = !DILocation(line: 120, column: 2, scope: !552, inlinedAt: !757)
!757 = distinct !DILocation(line: 66, column: 2, scope: !545, inlinedAt: !751)
!758 = !DILocation(line: 118, column: 16, scope: !552, inlinedAt: !757)
!759 = !DILocation(line: 66, column: 2, scope: !546, inlinedAt: !751)
!760 = !DILocation(line: 65, column: 11, scope: !567, inlinedAt: !761)
!761 = distinct !DILocation(line: 66, column: 2, scope: !573, inlinedAt: !751)
!762 = !DILocation(line: 62, column: 16, scope: !567, inlinedAt: !761)
!763 = !DILocation(line: 66, column: 8, scope: !567, inlinedAt: !761)
!764 = !DILocation(line: 63, column: 8, scope: !567, inlinedAt: !761)
!765 = !DILocation(line: 67, column: 2, scope: !567, inlinedAt: !761)
!766 = !DILocation(line: 65, column: 8, scope: !533, inlinedAt: !751)
!767 = !DILocation(line: 66, column: 2, scope: !573, inlinedAt: !751)
!768 = !DILocation(line: 120, column: 2, scope: !552, inlinedAt: !769)
!769 = distinct !DILocation(line: 49, column: 21, scope: !582, inlinedAt: !770)
!770 = distinct !DILocation(line: 66, column: 2, scope: !542, inlinedAt: !751)
!771 = !DILocation(line: 118, column: 16, scope: !552, inlinedAt: !769)
!772 = !DILocation(line: 49, column: 16, scope: !582, inlinedAt: !770)
!773 = !DILocation(line: 50, column: 19, scope: !582, inlinedAt: !770)
!774 = !DILocation(line: 50, column: 11, scope: !582, inlinedAt: !770)
!775 = !DILocation(line: 50, column: 9, scope: !582, inlinedAt: !770)
!776 = !DILocation(line: 66, column: 2, scope: !542, inlinedAt: !751)
!777 = !DILocation(line: 66, column: 2, scope: !597, inlinedAt: !751)
!778 = !DILocation(line: 67, column: 9, scope: !533, inlinedAt: !751)
!779 = !DILocation(line: 68, column: 1, scope: !533, inlinedAt: !751)
!780 = !DILocation(line: 1006, column: 10, scope: !742, inlinedAt: !748)
!781 = !DILocation(line: 1002, column: 9, scope: !742, inlinedAt: !748)
!782 = !DILocation(line: 1003, column: 8, scope: !742, inlinedAt: !748)
!783 = !DILocation(line: 1009, column: 3, scope: !784, inlinedAt: !748)
!784 = distinct !DILexicalBlock(scope: !742, file: !3, line: 1009, column: 3)
!785 = !DILocation(line: 1010, column: 23, scope: !786, inlinedAt: !748)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 1010, column: 9)
!787 = distinct !DILexicalBlock(scope: !788, file: !3, line: 1009, column: 40)
!788 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1009, column: 3)
!789 = !DILocation(line: 1010, column: 29, scope: !786, inlinedAt: !748)
!790 = !DILocation(line: 1010, column: 50, scope: !786, inlinedAt: !748)
!791 = !DILocation(line: 1011, column: 23, scope: !786, inlinedAt: !748)
!792 = !{!399, !400, i64 28}
!793 = !DILocation(line: 1011, column: 28, scope: !786, inlinedAt: !748)
!794 = !DILocation(line: 1010, column: 9, scope: !787, inlinedAt: !748)
!795 = !DILocation(line: 1009, column: 36, scope: !788, inlinedAt: !748)
!796 = !DILocation(line: 1057, column: 14, scope: !749)
!797 = !DILocation(line: 1057, column: 19, scope: !749)
!798 = !DILocation(line: 1058, column: 20, scope: !749)
!799 = !DILocation(line: 1059, column: 14, scope: !749)
!800 = !DILocation(line: 1059, column: 25, scope: !749)
!801 = !{!399, !250, i64 31}
!802 = !DILocation(line: 1060, column: 14, scope: !749)
!803 = !DILocation(line: 1060, column: 18, scope: !749)
!804 = !{!399, !250, i64 32}
!805 = !DILocation(line: 1061, column: 14, scope: !749)
!806 = !DILocation(line: 1061, column: 22, scope: !749)
!807 = !{!399, !250, i64 33}
!808 = !DILocation(line: 1064, column: 13, scope: !749)
!809 = !DILocation(line: 1049, column: 9, scope: !719)
!810 = !DILocation(line: 1069, column: 7, scope: !749)
!811 = !DILocation(line: 1071, column: 20, scope: !812)
!812 = distinct !DILexicalBlock(scope: !749, file: !3, line: 1071, column: 11)
!813 = !DILocation(line: 1071, column: 11, scope: !812)
!814 = !DILocation(line: 1071, column: 24, scope: !812)
!815 = !DILocation(line: 1071, column: 11, scope: !749)
!816 = !DILocation(line: 1072, column: 22, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 1072, column: 13)
!818 = distinct !DILexicalBlock(scope: !812, file: !3, line: 1071, column: 30)
!819 = !DILocation(line: 1072, column: 13, scope: !817)
!820 = !DILocation(line: 1072, column: 30, scope: !817)
!821 = !DILocation(line: 1072, column: 13, scope: !818)
!822 = !DILocalVariable(name: "ret", scope: !823, file: !3, line: 1026, type: !74)
!823 = distinct !DISubprogram(name: "dns_backupserver_available", scope: !3, file: !3, line: 1024, type: !824, isLocal: true, isDefinition: true, scopeLine: 1025, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!74, !381}
!826 = !{!827, !822}
!827 = !DILocalVariable(name: "pentry", arg: 1, scope: !823, file: !3, line: 1024, type: !381)
!828 = !DILocation(line: 1026, column: 8, scope: !823, inlinedAt: !829)
!829 = distinct !DILocation(line: 1073, column: 15, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 1073, column: 15)
!831 = distinct !DILexicalBlock(scope: !817, file: !3, line: 1072, column: 50)
!832 = !DILocation(line: 1029, column: 18, scope: !833, inlinedAt: !829)
!833 = distinct !DILexicalBlock(scope: !834, file: !3, line: 1029, column: 9)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1028, column: 15)
!835 = distinct !DILexicalBlock(scope: !823, file: !3, line: 1028, column: 7)
!836 = !DILocation(line: 1029, column: 10, scope: !833, inlinedAt: !829)
!837 = !DILocation(line: 1029, column: 29, scope: !833, inlinedAt: !829)
!838 = !DILocation(line: 1029, column: 33, scope: !833, inlinedAt: !829)
!839 = !DILocation(line: 1029, column: 52, scope: !833, inlinedAt: !829)
!840 = !DILocation(line: 1029, column: 56, scope: !833, inlinedAt: !829)
!841 = !DILocation(line: 1029, column: 9, scope: !834, inlinedAt: !829)
!842 = !DILocation(line: 1079, column: 30, scope: !843)
!843 = distinct !DILexicalBlock(scope: !830, file: !3, line: 1077, column: 16)
!844 = !DILocation(line: 1080, column: 24, scope: !843)
!845 = !DILocation(line: 1081, column: 28, scope: !843)
!846 = !DILocation(line: 1090, column: 9, scope: !831)
!847 = !DILocalVariable(name: "idx", arg: 1, scope: !848, file: !3, line: 942, type: !74)
!848 = distinct !DISubprogram(name: "dns_call_found", scope: !3, file: !3, line: 942, type: !849, isLocal: true, isDefinition: true, scopeLine: 943, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !74, !288}
!851 = !{!847, !852, !853}
!852 = !DILocalVariable(name: "addr", arg: 2, scope: !848, file: !3, line: 942, type: !288)
!853 = !DILocalVariable(name: "i", scope: !848, file: !3, line: 945, type: !74)
!854 = !DILocation(line: 942, column: 21, scope: !848, inlinedAt: !855)
!855 = distinct !DILocation(line: 1085, column: 13, scope: !856)
!856 = distinct !DILexicalBlock(scope: !830, file: !3, line: 1082, column: 18)
!857 = !DILocation(line: 942, column: 37, scope: !848, inlinedAt: !855)
!858 = !DILocation(line: 945, column: 8, scope: !848, inlinedAt: !855)
!859 = !DILocation(line: 962, column: 3, scope: !860, inlinedAt: !855)
!860 = distinct !DILexicalBlock(scope: !848, file: !3, line: 962, column: 3)
!861 = !DILocation(line: 977, column: 3, scope: !862, inlinedAt: !855)
!862 = distinct !DILexicalBlock(scope: !848, file: !3, line: 977, column: 3)
!863 = !DILocation(line: 963, column: 25, scope: !864, inlinedAt: !855)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 963, column: 9)
!865 = distinct !DILexicalBlock(scope: !866, file: !3, line: 962, column: 42)
!866 = distinct !DILexicalBlock(scope: !860, file: !3, line: 962, column: 3)
!867 = !DILocation(line: 963, column: 9, scope: !864, inlinedAt: !855)
!868 = !DILocation(line: 963, column: 31, scope: !864, inlinedAt: !855)
!869 = !DILocation(line: 963, column: 51, scope: !864, inlinedAt: !855)
!870 = !DILocation(line: 963, column: 65, scope: !864, inlinedAt: !855)
!871 = !DILocation(line: 963, column: 9, scope: !865, inlinedAt: !855)
!872 = !DILocation(line: 964, column: 75, scope: !873, inlinedAt: !855)
!873 = distinct !DILexicalBlock(scope: !864, file: !3, line: 963, column: 74)
!874 = !DILocation(line: 964, column: 7, scope: !873, inlinedAt: !855)
!875 = !DILocation(line: 966, column: 29, scope: !873, inlinedAt: !855)
!876 = !DILocation(line: 967, column: 5, scope: !873, inlinedAt: !855)
!877 = !DILocation(line: 962, column: 38, scope: !866, inlinedAt: !855)
!878 = !DILocation(line: 962, column: 17, scope: !866, inlinedAt: !855)
!879 = distinct !{!879, !880, !881}
!880 = !DILocation(line: 962, column: 3, scope: !860)
!881 = !DILocation(line: 968, column: 3, scope: !860)
!882 = !DILocation(line: 978, column: 11, scope: !883, inlinedAt: !855)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 978, column: 9)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 977, column: 42)
!885 = distinct !DILexicalBlock(scope: !862, file: !3, line: 977, column: 3)
!886 = !DILocation(line: 978, column: 9, scope: !884, inlinedAt: !855)
!887 = !DILocation(line: 981, column: 22, scope: !888, inlinedAt: !855)
!888 = distinct !DILexicalBlock(scope: !884, file: !3, line: 981, column: 9)
!889 = !DILocation(line: 981, column: 28, scope: !888, inlinedAt: !855)
!890 = !DILocation(line: 981, column: 9, scope: !884, inlinedAt: !855)
!891 = !DILocation(line: 982, column: 24, scope: !892, inlinedAt: !855)
!892 = distinct !DILexicalBlock(scope: !893, file: !3, line: 982, column: 11)
!893 = distinct !DILexicalBlock(scope: !888, file: !3, line: 981, column: 49)
!894 = !DILocation(line: 982, column: 50, scope: !892, inlinedAt: !855)
!895 = !DILocation(line: 982, column: 32, scope: !892, inlinedAt: !855)
!896 = !DILocation(line: 982, column: 11, scope: !893, inlinedAt: !855)
!897 = !DILocation(line: 977, column: 38, scope: !885, inlinedAt: !855)
!898 = !DILocation(line: 989, column: 22, scope: !899, inlinedAt: !855)
!899 = distinct !DILexicalBlock(scope: !848, file: !3, line: 989, column: 7)
!900 = !DILocation(line: 989, column: 30, scope: !899, inlinedAt: !855)
!901 = !DILocation(line: 989, column: 7, scope: !848, inlinedAt: !855)
!902 = !DILocation(line: 991, column: 16, scope: !903, inlinedAt: !855)
!903 = distinct !DILexicalBlock(scope: !899, file: !3, line: 989, column: 54)
!904 = !DILocation(line: 991, column: 5, scope: !903, inlinedAt: !855)
!905 = !DILocation(line: 992, column: 29, scope: !903, inlinedAt: !855)
!906 = !DILocation(line: 992, column: 5, scope: !903, inlinedAt: !855)
!907 = !DILocation(line: 992, column: 38, scope: !903, inlinedAt: !855)
!908 = !DILocation(line: 994, column: 3, scope: !903, inlinedAt: !855)
!909 = !DILocation(line: 0, scope: !856)
!910 = !DILocation(line: 1087, column: 26, scope: !856)
!911 = !DILocation(line: 1088, column: 13, scope: !856)
!912 = !DILocation(line: 1092, column: 22, scope: !913)
!913 = distinct !DILexicalBlock(scope: !817, file: !3, line: 1090, column: 16)
!914 = !DILocation(line: 1096, column: 15, scope: !818)
!915 = !DILocation(line: 1101, column: 7, scope: !818)
!916 = !DILocation(line: 1105, column: 19, scope: !917)
!917 = distinct !DILexicalBlock(scope: !749, file: !3, line: 1105, column: 11)
!918 = !{!399, !253, i64 0}
!919 = !DILocation(line: 1105, column: 23, scope: !917)
!920 = !DILocation(line: 1105, column: 29, scope: !917)
!921 = !DILocation(line: 1105, column: 33, scope: !917)
!922 = !DILocation(line: 1105, column: 46, scope: !917)
!923 = !DILocation(line: 1105, column: 11, scope: !749)
!924 = !DILocation(line: 1108, column: 22, scope: !925)
!925 = distinct !DILexicalBlock(scope: !917, file: !3, line: 1105, column: 53)
!926 = !DILocation(line: 1109, column: 7, scope: !925)
!927 = !DILocation(line: 1115, column: 7, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 1115, column: 7)
!929 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1115, column: 7)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 1115, column: 7)
!931 = distinct !DILexicalBlock(scope: !749, file: !3, line: 1115, column: 7)
!932 = !DILocation(line: 1115, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !3, line: 1115, column: 7)
!934 = distinct !DILexicalBlock(scope: !935, file: !3, line: 1115, column: 7)
!935 = distinct !DILexicalBlock(scope: !928, file: !3, line: 1115, column: 7)
!936 = !DILocation(line: 1118, column: 1, scope: !719)
!937 = !DILocation(line: 1009, column: 17, scope: !788, inlinedAt: !748)
!938 = distinct !{!938, !939, !940}
!939 = !DILocation(line: 1009, column: 3, scope: !784)
!940 = !DILocation(line: 1015, column: 3, scope: !784)
!941 = !DILocation(line: 977, column: 17, scope: !885, inlinedAt: !855)
!942 = distinct !{!942, !943, !944}
!943 = !DILocation(line: 977, column: 3, scope: !862)
!944 = !DILocation(line: 988, column: 3, scope: !862)
!945 = !DILocation(line: 194, column: 43, scope: !134)
!946 = !DILocation(line: 196, column: 2, scope: !134)
!947 = !DILocation(line: 196, column: 10, scope: !134)
!948 = !DILocation(line: 197, column: 2, scope: !134)
!949 = !DILocation(line: 198, column: 2, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !135, line: 198, column: 2)
!951 = distinct !DILexicalBlock(scope: !134, file: !135, line: 198, column: 2)
!952 = !DILocation(line: 199, column: 2, scope: !134)
!953 = !DILocation(line: 200, column: 1, scope: !134)
!954 = distinct !DISubprogram(name: "dns_send", scope: !3, file: !3, line: 748, type: !955, isLocal: true, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !957)
!955 = !DISubroutineType(types: !956)
!956 = !{!283, !74}
!957 = !{!958, !959, !960, !971, !976, !977, !978, !979, !980, !981, !982, !983, !984, !987}
!958 = !DILocalVariable(name: "idx", arg: 1, scope: !954, file: !3, line: 748, type: !74)
!959 = !DILocalVariable(name: "err", scope: !954, file: !3, line: 750, type: !283)
!960 = !DILocalVariable(name: "hdr", scope: !954, file: !3, line: 751, type: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_hdr", file: !962, line: 103, size: 96, elements: !963)
!962 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/dns.h", directory: "/root/.unikraft/apps/redis/build")
!963 = !{!964, !965, !966, !967, !968, !969, !970}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !961, file: !962, line: 104, baseType: !68, size: 16)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flags1", scope: !961, file: !962, line: 105, baseType: !74, size: 8, offset: 16)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !961, file: !962, line: 106, baseType: !74, size: 8, offset: 24)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "numquestions", scope: !961, file: !962, line: 107, baseType: !68, size: 16, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "numanswers", scope: !961, file: !962, line: 108, baseType: !68, size: 16, offset: 48)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "numauthrr", scope: !961, file: !962, line: 109, baseType: !68, size: 16, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "numextrarr", scope: !961, file: !962, line: 110, baseType: !68, size: 16, offset: 80)
!971 = !DILocalVariable(name: "qry", scope: !954, file: !3, line: 752, type: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_query", file: !3, line: 189, size: 32, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !3, line: 192, baseType: !68, size: 16)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cls", scope: !972, file: !3, line: 193, baseType: !68, size: 16, offset: 16)
!976 = !DILocalVariable(name: "p", scope: !954, file: !3, line: 753, type: !188)
!977 = !DILocalVariable(name: "query_idx", scope: !954, file: !3, line: 754, type: !68)
!978 = !DILocalVariable(name: "copy_len", scope: !954, file: !3, line: 754, type: !68)
!979 = !DILocalVariable(name: "hostname", scope: !954, file: !3, line: 755, type: !138)
!980 = !DILocalVariable(name: "hostname_part", scope: !954, file: !3, line: 755, type: !138)
!981 = !DILocalVariable(name: "n", scope: !954, file: !3, line: 756, type: !74)
!982 = !DILocalVariable(name: "pcb_idx", scope: !954, file: !3, line: 757, type: !74)
!983 = !DILocalVariable(name: "entry", scope: !954, file: !3, line: 758, type: !381)
!984 = !DILocalVariable(name: "dst", scope: !985, file: !3, line: 780, type: !199)
!985 = distinct !DILexicalBlock(scope: !986, file: !3, line: 779, column: 18)
!986 = distinct !DILexicalBlock(scope: !954, file: !3, line: 779, column: 7)
!987 = !DILocalVariable(name: "dst_port", scope: !985, file: !3, line: 781, type: !68)
!988 = !DILocation(line: 748, column: 15, scope: !954)
!989 = !DILocation(line: 751, column: 3, scope: !954)
!990 = !DILocation(line: 752, column: 3, scope: !954)
!991 = !DILocation(line: 758, column: 36, scope: !954)
!992 = !DILocation(line: 762, column: 3, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 762, column: 3)
!994 = distinct !DILexicalBlock(scope: !954, file: !3, line: 762, column: 3)
!995 = !DILocation(line: 762, column: 3, scope: !994)
!996 = !DILocation(line: 762, column: 3, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 762, column: 3)
!998 = distinct !DILexicalBlock(scope: !993, file: !3, line: 762, column: 3)
!999 = !DILocation(line: 762, column: 3, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 762, column: 3)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 762, column: 3)
!1002 = distinct !DILexicalBlock(scope: !997, file: !3, line: 762, column: 3)
!1003 = !DILocation(line: 763, column: 7, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !954, file: !3, line: 763, column: 7)
!1005 = !DILocation(line: 763, column: 7, scope: !954)
!1006 = !DILocation(line: 942, column: 21, scope: !848, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 770, column: 5, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 767, column: 8)
!1009 = !DILocation(line: 942, column: 37, scope: !848, inlinedAt: !1007)
!1010 = !DILocation(line: 945, column: 8, scope: !848, inlinedAt: !1007)
!1011 = !DILocation(line: 962, column: 3, scope: !860, inlinedAt: !1007)
!1012 = !DILocation(line: 977, column: 3, scope: !862, inlinedAt: !1007)
!1013 = !DILocation(line: 963, column: 25, scope: !864, inlinedAt: !1007)
!1014 = !DILocation(line: 963, column: 9, scope: !864, inlinedAt: !1007)
!1015 = !DILocation(line: 963, column: 31, scope: !864, inlinedAt: !1007)
!1016 = !DILocation(line: 963, column: 51, scope: !864, inlinedAt: !1007)
!1017 = !DILocation(line: 963, column: 65, scope: !864, inlinedAt: !1007)
!1018 = !DILocation(line: 963, column: 9, scope: !865, inlinedAt: !1007)
!1019 = !DILocation(line: 964, column: 75, scope: !873, inlinedAt: !1007)
!1020 = !DILocation(line: 964, column: 7, scope: !873, inlinedAt: !1007)
!1021 = !DILocation(line: 966, column: 29, scope: !873, inlinedAt: !1007)
!1022 = !DILocation(line: 967, column: 5, scope: !873, inlinedAt: !1007)
!1023 = !DILocation(line: 962, column: 38, scope: !866, inlinedAt: !1007)
!1024 = !DILocation(line: 962, column: 17, scope: !866, inlinedAt: !1007)
!1025 = !DILocation(line: 978, column: 11, scope: !883, inlinedAt: !1007)
!1026 = !DILocation(line: 978, column: 9, scope: !884, inlinedAt: !1007)
!1027 = !DILocation(line: 981, column: 22, scope: !888, inlinedAt: !1007)
!1028 = !DILocation(line: 981, column: 28, scope: !888, inlinedAt: !1007)
!1029 = !DILocation(line: 981, column: 9, scope: !884, inlinedAt: !1007)
!1030 = !DILocation(line: 982, column: 24, scope: !892, inlinedAt: !1007)
!1031 = !DILocation(line: 982, column: 50, scope: !892, inlinedAt: !1007)
!1032 = !DILocation(line: 982, column: 32, scope: !892, inlinedAt: !1007)
!1033 = !DILocation(line: 982, column: 11, scope: !893, inlinedAt: !1007)
!1034 = !DILocation(line: 977, column: 38, scope: !885, inlinedAt: !1007)
!1035 = !DILocation(line: 989, column: 22, scope: !899, inlinedAt: !1007)
!1036 = !DILocation(line: 989, column: 30, scope: !899, inlinedAt: !1007)
!1037 = !DILocation(line: 989, column: 7, scope: !848, inlinedAt: !1007)
!1038 = !DILocation(line: 991, column: 16, scope: !903, inlinedAt: !1007)
!1039 = !DILocation(line: 991, column: 5, scope: !903, inlinedAt: !1007)
!1040 = !DILocation(line: 992, column: 29, scope: !903, inlinedAt: !1007)
!1041 = !DILocation(line: 992, column: 5, scope: !903, inlinedAt: !1007)
!1042 = !DILocation(line: 992, column: 38, scope: !903, inlinedAt: !1007)
!1043 = !DILocation(line: 994, column: 3, scope: !903, inlinedAt: !1007)
!1044 = !DILocation(line: 0, scope: !1008)
!1045 = !DILocation(line: 772, column: 12, scope: !1008)
!1046 = !DILocation(line: 772, column: 18, scope: !1008)
!1047 = !DILocation(line: 773, column: 5, scope: !1008)
!1048 = !DILocation(line: 777, column: 66, scope: !954)
!1049 = !DILocation(line: 777, column: 59, scope: !954)
!1050 = !DILocation(line: 777, column: 34, scope: !954)
!1051 = !DILocation(line: 777, column: 7, scope: !954)
!1052 = !DILocation(line: 753, column: 16, scope: !954)
!1053 = !DILocation(line: 779, column: 9, scope: !986)
!1054 = !DILocation(line: 779, column: 7, scope: !954)
!1055 = !DILocation(line: 783, column: 5, scope: !985)
!1056 = !DILocation(line: 784, column: 32, scope: !985)
!1057 = !DILocation(line: 784, column: 14, scope: !985)
!1058 = !DILocation(line: 784, column: 9, scope: !985)
!1059 = !DILocation(line: 784, column: 12, scope: !985)
!1060 = !{!1061, !400, i64 0}
!1061 = !{!"dns_hdr", !400, i64 0, !250, i64 2, !250, i64 3, !400, i64 4, !400, i64 6, !400, i64 8, !400, i64 10}
!1062 = !DILocation(line: 785, column: 9, scope: !985)
!1063 = !DILocation(line: 785, column: 16, scope: !985)
!1064 = !{!1061, !250, i64 2}
!1065 = !DILocation(line: 786, column: 9, scope: !985)
!1066 = !DILocation(line: 786, column: 22, scope: !985)
!1067 = !{!1061, !400, i64 4}
!1068 = !DILocation(line: 787, column: 5, scope: !985)
!1069 = !DILocation(line: 755, column: 15, scope: !954)
!1070 = !DILocation(line: 789, column: 5, scope: !985)
!1071 = !DILocation(line: 754, column: 9, scope: !954)
!1072 = !DILocation(line: 793, column: 5, scope: !985)
!1073 = !DILocation(line: 0, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !985, file: !3, line: 793, column: 8)
!1075 = !DILocation(line: 794, column: 7, scope: !1074)
!1076 = !DILocation(line: 755, column: 26, scope: !954)
!1077 = !DILocation(line: 756, column: 8, scope: !954)
!1078 = !DILocation(line: 796, column: 12, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 796, column: 7)
!1080 = !DILocation(line: 0, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 796, column: 67)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 796, column: 7)
!1083 = !DILocation(line: 0, scope: !1082)
!1084 = !DILocation(line: 796, column: 19, scope: !1082)
!1085 = !DILocation(line: 796, column: 36, scope: !1082)
!1086 = !DILocation(line: 797, column: 9, scope: !1081)
!1087 = !DILocation(line: 796, column: 55, scope: !1082)
!1088 = !DILocation(line: 796, column: 7, scope: !1082)
!1089 = distinct !{!1089, !1090, !1091}
!1090 = !DILocation(line: 796, column: 7, scope: !1079)
!1091 = !DILocation(line: 798, column: 7, scope: !1079)
!1092 = !DILocation(line: 800, column: 11, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 800, column: 11)
!1094 = !DILocation(line: 800, column: 23, scope: !1093)
!1095 = !DILocation(line: 800, column: 21, scope: !1093)
!1096 = !DILocation(line: 800, column: 29, scope: !1093)
!1097 = !DILocation(line: 800, column: 11, scope: !1074)
!1098 = !DILocation(line: 799, column: 35, scope: !1074)
!1099 = !DILocation(line: 799, column: 18, scope: !1074)
!1100 = !DILocation(line: 754, column: 20, scope: !954)
!1101 = !DILocation(line: 804, column: 7, scope: !1074)
!1102 = !DILocation(line: 805, column: 66, scope: !1074)
!1103 = !DILocation(line: 805, column: 7, scope: !1074)
!1104 = !DILocation(line: 806, column: 19, scope: !1074)
!1105 = !DILocation(line: 807, column: 14, scope: !985)
!1106 = !DILocation(line: 807, column: 24, scope: !985)
!1107 = !DILocation(line: 807, column: 5, scope: !1074)
!1108 = distinct !{!1108, !1072, !1109}
!1109 = !DILocation(line: 807, column: 28, scope: !985)
!1110 = !DILocation(line: 808, column: 5, scope: !985)
!1111 = !DILocation(line: 809, column: 14, scope: !985)
!1112 = !DILocation(line: 812, column: 9, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !985, file: !3, line: 812, column: 9)
!1114 = !DILocation(line: 0, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 814, column: 12)
!1116 = !{!1117, !400, i64 0}
!1117 = !{!"dns_query", !400, i64 0, !400, i64 2}
!1118 = !DILocation(line: 817, column: 9, scope: !985)
!1119 = !DILocation(line: 817, column: 13, scope: !985)
!1120 = !{!1117, !400, i64 2}
!1121 = !DILocation(line: 818, column: 5, scope: !985)
!1122 = !DILocation(line: 821, column: 22, scope: !985)
!1123 = !DILocation(line: 757, column: 8, scope: !954)
!1124 = !DILocation(line: 781, column: 11, scope: !985)
!1125 = !DILocation(line: 848, column: 33, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !985, file: !3, line: 846, column: 5)
!1127 = !DILocation(line: 848, column: 14, scope: !1126)
!1128 = !DILocation(line: 780, column: 22, scope: !985)
!1129 = !DILocation(line: 850, column: 22, scope: !985)
!1130 = !DILocation(line: 850, column: 11, scope: !985)
!1131 = !DILocation(line: 750, column: 9, scope: !954)
!1132 = !DILocation(line: 853, column: 5, scope: !985)
!1133 = !DILocation(line: 860, column: 3, scope: !954)
!1134 = !DILocation(line: 861, column: 3, scope: !954)
!1135 = !DILocation(line: 862, column: 1, scope: !954)
!1136 = !DILocation(line: 977, column: 17, scope: !885, inlinedAt: !1007)
!1137 = !DILocation(line: 942, column: 21, scope: !848)
!1138 = !DILocation(line: 942, column: 37, scope: !848)
!1139 = !DILocation(line: 949, column: 12, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !848, file: !3, line: 949, column: 7)
!1141 = !DILocation(line: 949, column: 7, scope: !848)
!1142 = !DILocation(line: 951, column: 9, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 951, column: 9)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 949, column: 21)
!1145 = !DILocation(line: 0, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 955, column: 7)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 955, column: 7)
!1148 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 954, column: 12)
!1149 = !DILocation(line: 951, column: 9, scope: !1144)
!1150 = !DILocation(line: 952, column: 7, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 952, column: 7)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 952, column: 7)
!1153 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 951, column: 30)
!1154 = !DILocation(line: 952, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 952, column: 7)
!1156 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 952, column: 7)
!1157 = !DILocation(line: 952, column: 7, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 952, column: 7)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 952, column: 7)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 952, column: 7)
!1161 = !DILocation(line: 953, column: 34, scope: !1153)
!1162 = !DILocation(line: 954, column: 5, scope: !1153)
!1163 = !DILocation(line: 955, column: 7, scope: !1146)
!1164 = !DILocation(line: 955, column: 7, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 955, column: 7)
!1166 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 955, column: 7)
!1167 = !DILocation(line: 955, column: 7, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 955, column: 7)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 955, column: 7)
!1170 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 955, column: 7)
!1171 = !DILocation(line: 956, column: 34, scope: !1148)
!1172 = !DILocation(line: 945, column: 8, scope: !848)
!1173 = !DILocation(line: 963, column: 25, scope: !864)
!1174 = !DILocation(line: 963, column: 9, scope: !864)
!1175 = !DILocation(line: 963, column: 31, scope: !864)
!1176 = !DILocation(line: 963, column: 51, scope: !864)
!1177 = !DILocation(line: 963, column: 65, scope: !864)
!1178 = !DILocation(line: 963, column: 9, scope: !865)
!1179 = !DILocation(line: 964, column: 75, scope: !873)
!1180 = !DILocation(line: 964, column: 7, scope: !873)
!1181 = !DILocation(line: 966, column: 29, scope: !873)
!1182 = !DILocation(line: 967, column: 5, scope: !873)
!1183 = !DILocation(line: 962, column: 38, scope: !866)
!1184 = !DILocation(line: 962, column: 17, scope: !866)
!1185 = !DILocation(line: 978, column: 11, scope: !883)
!1186 = !DILocation(line: 978, column: 9, scope: !884)
!1187 = !DILocation(line: 981, column: 22, scope: !888)
!1188 = !DILocation(line: 981, column: 28, scope: !888)
!1189 = !DILocation(line: 981, column: 9, scope: !884)
!1190 = !DILocation(line: 982, column: 24, scope: !892)
!1191 = !DILocation(line: 982, column: 50, scope: !892)
!1192 = !DILocation(line: 982, column: 32, scope: !892)
!1193 = !DILocation(line: 982, column: 11, scope: !893)
!1194 = !DILocation(line: 977, column: 38, scope: !885)
!1195 = !DILocation(line: 989, column: 22, scope: !899)
!1196 = !DILocation(line: 989, column: 30, scope: !899)
!1197 = !DILocation(line: 989, column: 7, scope: !848)
!1198 = !DILocation(line: 991, column: 16, scope: !903)
!1199 = !DILocation(line: 991, column: 5, scope: !903)
!1200 = !DILocation(line: 992, column: 29, scope: !903)
!1201 = !DILocation(line: 992, column: 5, scope: !903)
!1202 = !DILocation(line: 992, column: 38, scope: !903)
!1203 = !DILocation(line: 994, column: 3, scope: !903)
!1204 = !DILocation(line: 0, scope: !903)
!1205 = !DILocation(line: 996, column: 1, scope: !848)
!1206 = !DILocation(line: 977, column: 17, scope: !885)
!1207 = !DILocation(line: 65, column: 11, scope: !567)
!1208 = !DILocation(line: 62, column: 16, scope: !567)
!1209 = !DILocation(line: 66, column: 8, scope: !567)
!1210 = !DILocation(line: 63, column: 8, scope: !567)
!1211 = !DILocation(line: 67, column: 2, scope: !567)
!1212 = !DILocation(line: 69, column: 2, scope: !567)
!1213 = distinct !DISubprogram(name: "dns_recv", scope: !3, file: !3, line: 1170, type: !186, isLocal: true, isDefinition: true, scopeLine: 1171, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1231, !1232, !1233, !1234, !1240, !1252}
!1215 = !DILocalVariable(name: "arg", arg: 1, scope: !1213, file: !3, line: 1170, type: !61)
!1216 = !DILocalVariable(name: "pcb", arg: 2, scope: !1213, file: !3, line: 1170, type: !166)
!1217 = !DILocalVariable(name: "p", arg: 3, scope: !1213, file: !3, line: 1170, type: !188)
!1218 = !DILocalVariable(name: "addr", arg: 4, scope: !1213, file: !3, line: 1170, type: !199)
!1219 = !DILocalVariable(name: "port", arg: 5, scope: !1213, file: !3, line: 1170, type: !68)
!1220 = !DILocalVariable(name: "i", scope: !1213, file: !3, line: 1172, type: !74)
!1221 = !DILocalVariable(name: "txid", scope: !1213, file: !3, line: 1173, type: !68)
!1222 = !DILocalVariable(name: "res_idx", scope: !1213, file: !3, line: 1174, type: !68)
!1223 = !DILocalVariable(name: "hdr", scope: !1213, file: !3, line: 1175, type: !961)
!1224 = !DILocalVariable(name: "ans", scope: !1213, file: !3, line: 1176, type: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_answer", file: !3, line: 199, size: 96, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !3, line: 202, baseType: !68, size: 16)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "cls", scope: !1225, file: !3, line: 203, baseType: !68, size: 16, offset: 16)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !1225, file: !3, line: 204, baseType: !62, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1225, file: !3, line: 205, baseType: !68, size: 16, offset: 64)
!1231 = !DILocalVariable(name: "qry", scope: !1213, file: !3, line: 1177, type: !972)
!1232 = !DILocalVariable(name: "nquestions", scope: !1213, file: !3, line: 1178, type: !68)
!1233 = !DILocalVariable(name: "nanswers", scope: !1213, file: !3, line: 1178, type: !68)
!1234 = !DILocalVariable(name: "entry", scope: !1235, file: !3, line: 1196, type: !381)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !3, line: 1195, column: 42)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 1195, column: 5)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 1195, column: 5)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !3, line: 1192, column: 72)
!1239 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 1192, column: 7)
!1240 = !DILocalVariable(name: "ip4addr", scope: !1241, file: !3, line: 1291, type: !99)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 1290, column: 17)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 1288, column: 21)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !3, line: 1286, column: 102)
!1244 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 1286, column: 19)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 1284, column: 54)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 1284, column: 17)
!1247 = distinct !DILexicalBlock(scope: !1248, file: !3, line: 1268, column: 60)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !3, line: 1267, column: 16)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !3, line: 1251, column: 13)
!1250 = distinct !DILexicalBlock(scope: !1251, file: !3, line: 1198, column: 34)
!1251 = distinct !DILexicalBlock(scope: !1235, file: !3, line: 1197, column: 11)
!1252 = !DILocalVariable(name: "ip6addr", scope: !1253, file: !3, line: 1310, type: !1257)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !3, line: 1309, column: 17)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 1307, column: 21)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 1305, column: 107)
!1256 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 1305, column: 19)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_p_t", file: !1258, line: 60, baseType: !1259)
!1258 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/ip6.h", directory: "/root/.unikraft/apps/redis/build")
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr_packed", file: !1258, line: 53, size: 128, elements: !1260)
!1260 = !{!1261}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !1259, file: !1258, line: 54, baseType: !94, size: 128)
!1262 = !DILocation(line: 1170, column: 16, scope: !1213)
!1263 = !DILocation(line: 1170, column: 37, scope: !1213)
!1264 = !DILocation(line: 1170, column: 55, scope: !1213)
!1265 = !DILocation(line: 1170, column: 75, scope: !1213)
!1266 = !DILocation(line: 1170, column: 87, scope: !1213)
!1267 = !DILocation(line: 1175, column: 3, scope: !1213)
!1268 = !DILocation(line: 1176, column: 3, scope: !1213)
!1269 = !DILocation(line: 1177, column: 3, scope: !1213)
!1270 = !DILocation(line: 1185, column: 10, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 1185, column: 7)
!1272 = !{!1273, !400, i64 16}
!1273 = !{!"pbuf", !421, i64 0, !421, i64 8, !400, i64 16, !400, i64 18, !250, i64 20, !250, i64 21, !250, i64 22, !250, i64 23}
!1274 = !DILocation(line: 1185, column: 18, scope: !1271)
!1275 = !DILocation(line: 1185, column: 7, scope: !1213)
!1276 = !DILocation(line: 1192, column: 7, scope: !1239)
!1277 = !DILocation(line: 1192, column: 53, scope: !1239)
!1278 = !DILocation(line: 1192, column: 7, scope: !1213)
!1279 = !DILocation(line: 1194, column: 27, scope: !1238)
!1280 = !DILocation(line: 1194, column: 12, scope: !1238)
