; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EvictionPoolLRU", scope: !2, file: !3, line: 61, type: !196, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !59)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/evict.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !8, !9, !10, !11, !28, !38, !48, !58}
!6 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !13, line: 51, size: 24, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !21, !22, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !13, line: 52, baseType: !16, size: 8)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 43, baseType: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !12, file: !13, line: 53, baseType: !16, size: 8, offset: 8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !13, line: 54, baseType: !20, size: 8, offset: 16)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !12, file: !13, line: 55, baseType: !24, offset: 24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: -1)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !13, line: 57, size: 40, elements: !30)
!30 = !{!31, !35, !36, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !29, file: !13, line: 58, baseType: !32, size: 16)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 36, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 57, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !29, file: !13, line: 59, baseType: !32, size: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !13, line: 60, baseType: !20, size: 8, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !29, file: !13, line: 61, baseType: !24, offset: 40)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !13, line: 63, size: 72, elements: !40)
!40 = !{!41, !45, !46, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !13, line: 64, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 48, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 79, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !39, file: !13, line: 65, baseType: !42, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !39, file: !13, line: 66, baseType: !20, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !13, line: 67, baseType: !24, offset: 72)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !13, line: 69, size: 136, elements: !50)
!50 = !{!51, !55, !56, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !13, line: 70, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 60, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 105, baseType: !54)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !49, file: !13, line: 71, baseType: !52, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !13, line: 72, baseType: !20, size: 8, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !49, file: !13, line: 73, baseType: !24, offset: 136)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!59 = !{!60, !0}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "next_db", scope: !62, file: !3, line: 471, type: !44, isLocal: true, isDefinition: true)
!62 = distinct !DISubprogram(name: "freeMemoryIfNeeded", scope: !3, file: !3, line: 446, type: !63, isLocal: false, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !66)
!63 = !DISubroutineType(types: !64)
!64 = !{!65}
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !{!67, !72, !73, !74, !77, !78, !79, !80, !82, !83, !84, !85, !88, !89, !191, !192, !193, !204, !206, !207}
!67 = !DILocalVariable(name: "mem_reported", scope: !62, file: !3, line: 451, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 40, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !71, line: 129, baseType: !54)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DILocalVariable(name: "mem_tofree", scope: !62, file: !3, line: 451, type: !68)
!73 = !DILocalVariable(name: "mem_freed", scope: !62, file: !3, line: 451, type: !68)
!74 = !DILocalVariable(name: "latency", scope: !62, file: !3, line: 452, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !76, line: 52, baseType: !10)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DILocalVariable(name: "eviction_latency", scope: !62, file: !3, line: 452, type: !75)
!78 = !DILocalVariable(name: "delta", scope: !62, file: !3, line: 453, type: !10)
!79 = !DILocalVariable(name: "slaves", scope: !62, file: !3, line: 454, type: !65)
!80 = !DILocalVariable(name: "j", scope: !81, file: !3, line: 470, type: !65)
!81 = distinct !DILexicalBlock(scope: !62, file: !3, line: 469, column: 36)
!82 = !DILocalVariable(name: "k", scope: !81, file: !3, line: 470, type: !65)
!83 = !DILocalVariable(name: "i", scope: !81, file: !3, line: 470, type: !65)
!84 = !DILocalVariable(name: "keys_freed", scope: !81, file: !3, line: 470, type: !65)
!85 = !DILocalVariable(name: "bestkey", scope: !81, file: !3, line: 472, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !13, line: 43, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!88 = !DILocalVariable(name: "bestdbid", scope: !81, file: !3, line: 473, type: !65)
!89 = !DILocalVariable(name: "db", scope: !81, file: !3, line: 474, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !76, line: 656, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !76, line: 647, size: 512, elements: !93)
!93 = !{!94, !156, !157, !158, !159, !160, !161, !162}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !92, file: !76, line: 648, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !97, line: 82, baseType: !98)
!97 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !97, line: 76, size: 768, elements: !99)
!99 = !{!100, !125, !126, !154, !155}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !97, line: 77, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !97, line: 65, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !97, line: 58, size: 384, elements: !104)
!104 = !{!105, !111, !115, !116, !120, !124}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !103, file: !97, line: 59, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!52, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !103, file: !97, line: 60, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!7, !7, !109}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !103, file: !97, line: 61, baseType: !112, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !103, file: !97, line: 62, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!65, !7, !109, !109}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !103, file: !97, line: 63, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !7, !7}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !103, file: !97, line: 64, baseType: !121, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !98, file: !97, line: 78, baseType: !7, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !98, file: !97, line: 79, baseType: !127, size: 512, offset: 128)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !152)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !97, line: 74, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !97, line: 69, size: 256, elements: !130)
!130 = !{!131, !149, !150, !151}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !129, file: !97, line: 70, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !97, line: 56, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !97, line: 47, size: 192, elements: !136)
!136 = !{!137, !138, !147}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !135, file: !97, line: 48, baseType: !7, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !135, file: !97, line: 54, baseType: !139, size: 64, offset: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !97, line: 49, size: 64, elements: !140)
!140 = !{!141, !142, !143, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !139, file: !97, line: 50, baseType: !7, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !139, file: !97, line: 51, baseType: !52, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !139, file: !97, line: 52, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !17, line: 56, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !19, line: 103, baseType: !6)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !139, file: !97, line: 53, baseType: !8, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !97, line: 55, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !97, line: 71, baseType: !54, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !129, file: !97, line: 72, baseType: !54, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !129, file: !97, line: 73, baseType: !54, size: 64, offset: 192)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !98, file: !97, line: 80, baseType: !6, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !98, file: !97, line: 81, baseType: !54, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !92, file: !76, line: 649, baseType: !95, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !92, file: !76, line: 650, baseType: !95, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !92, file: !76, line: 651, baseType: !95, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !92, file: !76, line: 652, baseType: !95, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !76, line: 653, baseType: !65, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !92, file: !76, line: 654, baseType: !10, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !92, file: !76, line: 655, baseType: !163, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !165, line: 54, baseType: !166)
!165 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !165, line: 47, size: 384, elements: !167)
!167 = !{!168, !177, !178, !182, !186, !190}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !166, file: !165, line: 48, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !165, line: 40, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !165, line: 36, size: 192, elements: !172)
!172 = !{!173, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !165, line: 37, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !165, line: 38, baseType: !174, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !165, line: 39, baseType: !7, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !166, file: !165, line: 49, baseType: !169, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !166, file: !165, line: 50, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!7, !7}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !166, file: !165, line: 51, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !7}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !166, file: !165, line: 52, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!65, !7, !7}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !165, line: 53, baseType: !54, size: 64, offset: 320)
!191 = !DILocalVariable(name: "dict", scope: !81, file: !3, line: 475, type: !95)
!192 = !DILocalVariable(name: "de", scope: !81, file: !3, line: 476, type: !133)
!193 = !DILocalVariable(name: "pool", scope: !194, file: !3, line: 481, type: !196)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 480, column: 9)
!195 = distinct !DILexicalBlock(scope: !81, file: !3, line: 478, column: 13)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evictionPoolEntry", file: !3, line: 54, size: 256, elements: !198)
!198 = !{!199, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !197, file: !3, line: 55, baseType: !200, size: 64)
!200 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !3, line: 56, baseType: !86, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !197, file: !3, line: 57, baseType: !86, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dbid", scope: !197, file: !3, line: 58, baseType: !65, size: 32, offset: 192)
!204 = !DILocalVariable(name: "total_keys", scope: !205, file: !3, line: 484, type: !54)
!205 = distinct !DILexicalBlock(scope: !194, file: !3, line: 483, column: 36)
!206 = !DILocalVariable(name: "keys", scope: !205, file: !3, line: 484, type: !54)
!207 = !DILocalVariable(name: "keyobj", scope: !208, file: !3, line: 555, type: !210)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 553, column: 22)
!209 = distinct !DILexicalBlock(scope: !81, file: !3, line: 553, column: 13)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !76, line: 622, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !76, line: 614, size: 128, elements: !213)
!213 = !{!214, !215, !216, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !76, line: 615, baseType: !44, size: 4, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !212, file: !76, line: 616, baseType: !44, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !212, file: !76, line: 617, baseType: !44, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !212, file: !76, line: 620, baseType: !65, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !212, file: !76, line: 621, baseType: !7, size: 64, offset: 64)
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!223 = distinct !DISubprogram(name: "getLRUClock", scope: !3, file: !3, line: 70, type: !224, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{!44}
!226 = !DILocation(line: 71, column: 13, scope: !223)
!227 = !DILocation(line: 71, column: 21, scope: !223)
!228 = !DILocation(line: 71, column: 12, scope: !223)
!229 = !DILocation(line: 71, column: 5, scope: !223)
!230 = distinct !DISubprogram(name: "LRU_CLOCK", scope: !3, file: !3, line: 78, type: !224, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !231)
!231 = !{!232}
!232 = !DILocalVariable(name: "lruclock", scope: !230, file: !3, line: 79, type: !44)
!233 = !DILocation(line: 81, column: 9, scope: !234)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 81, column: 9)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 80, column: 49)
!236 = distinct !DILexicalBlock(scope: !230, file: !3, line: 80, column: 9)
!237 = !DILocation(line: 79, column: 18, scope: !230)
!238 = !DILocation(line: 85, column: 5, scope: !230)
!239 = distinct !DISubprogram(name: "estimateObjectIdleTime", scope: !3, file: !3, line: 90, type: !240, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{!200, !210}
!242 = !{!243, !244}
!243 = !DILocalVariable(name: "o", arg: 1, scope: !239, file: !3, line: 90, type: !210)
!244 = !DILocalVariable(name: "lruclock", scope: !239, file: !3, line: 91, type: !200)
!245 = !DILocation(line: 90, column: 49, scope: !239)
!246 = !DILocation(line: 81, column: 9, scope: !234, inlinedAt: !247)
!247 = distinct !DILocation(line: 91, column: 35, scope: !239)
!248 = !DILocation(line: 79, column: 18, scope: !230, inlinedAt: !247)
!249 = !DILocation(line: 91, column: 35, scope: !239)
!250 = !DILocation(line: 91, column: 24, scope: !239)
!251 = !DILocation(line: 92, column: 24, scope: !252)
!252 = distinct !DILexicalBlock(scope: !239, file: !3, line: 92, column: 9)
!253 = !DILocation(line: 92, column: 18, scope: !252)
!254 = !DILocation(line: 92, column: 21, scope: !252)
!255 = !DILocation(line: 95, column: 43, scope: !256)
!256 = distinct !DILexicalBlock(scope: !252, file: !3, line: 94, column: 12)
!257 = !DILocation(line: 95, column: 28, scope: !256)
!258 = !DILocation(line: 92, column: 9, scope: !239)
!259 = !DILocation(line: 0, scope: !256)
!260 = !DILocation(line: 98, column: 1, scope: !239)
!261 = distinct !DISubprogram(name: "evictionPoolAlloc", scope: !3, file: !3, line: 139, type: !262, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{null}
!264 = !{!265, !266}
!265 = !DILocalVariable(name: "ep", scope: !261, file: !3, line: 140, type: !196)
!266 = !DILocalVariable(name: "j", scope: !261, file: !3, line: 141, type: !65)
!267 = !DILocation(line: 143, column: 10, scope: !261)
!268 = !DILocation(line: 140, column: 31, scope: !261)
!269 = !DILocation(line: 141, column: 9, scope: !261)
!270 = !DILocation(line: 144, column: 5, scope: !271)
!271 = distinct !DILexicalBlock(scope: !261, file: !3, line: 144, column: 5)
!272 = !DILocation(line: 145, column: 15, scope: !273)
!273 = distinct !DILexicalBlock(scope: !274, file: !3, line: 144, column: 39)
!274 = distinct !DILexicalBlock(scope: !271, file: !3, line: 144, column: 5)
!275 = !DILocation(line: 145, column: 20, scope: !273)
!276 = !{!277, !278, i64 0}
!277 = !{!"evictionPoolEntry", !278, i64 0, !281, i64 8, !281, i64 16, !282, i64 24}
!278 = !{!"long long", !279, i64 0}
!279 = !{!"omnipotent char", !280, i64 0}
!280 = !{!"Simple C/C++ TBAA"}
!281 = !{!"any pointer", !279, i64 0}
!282 = !{!"int", !279, i64 0}
!283 = !DILocation(line: 146, column: 15, scope: !273)
!284 = !DILocation(line: 146, column: 19, scope: !273)
!285 = !{!277, !281, i64 8}
!286 = !DILocation(line: 147, column: 24, scope: !273)
!287 = !DILocation(line: 147, column: 15, scope: !273)
!288 = !DILocation(line: 147, column: 22, scope: !273)
!289 = !{!277, !281, i64 16}
!290 = !DILocation(line: 148, column: 15, scope: !273)
!291 = !DILocation(line: 148, column: 20, scope: !273)
!292 = !{!277, !282, i64 24}
!293 = !DILocation(line: 144, column: 35, scope: !274)
!294 = !DILocation(line: 144, column: 19, scope: !274)
!295 = distinct !{!295, !270, !296}
!296 = !DILocation(line: 149, column: 5, scope: !271)
!297 = !DILocation(line: 150, column: 21, scope: !261)
!298 = !{!281, !281, i64 0}
!299 = !DILocation(line: 151, column: 1, scope: !261)
!300 = distinct !DISubprogram(name: "evictionPoolPopulate", scope: !3, file: !3, line: 162, type: !301, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !65, !95, !95, !196}
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !320, !321, !322, !323, !329, !331}
!304 = !DILocalVariable(name: "dbid", arg: 1, scope: !300, file: !3, line: 162, type: !65)
!305 = !DILocalVariable(name: "sampledict", arg: 2, scope: !300, file: !3, line: 162, type: !95)
!306 = !DILocalVariable(name: "keydict", arg: 3, scope: !300, file: !3, line: 162, type: !95)
!307 = !DILocalVariable(name: "pool", arg: 4, scope: !300, file: !3, line: 162, type: !196)
!308 = !DILocalVariable(name: "j", scope: !300, file: !3, line: 163, type: !65)
!309 = !DILocalVariable(name: "k", scope: !300, file: !3, line: 163, type: !65)
!310 = !DILocalVariable(name: "count", scope: !300, file: !3, line: 163, type: !65)
!311 = !DILocalVariable(scope: !300, type: !54, flags: DIFlagArtificial)
!312 = !DILocalVariable(name: "samples", scope: !300, file: !3, line: 164, type: !313)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: !311)
!316 = !DILocalVariable(name: "idle", scope: !317, file: !3, line: 168, type: !200)
!317 = distinct !DILexicalBlock(scope: !318, file: !3, line: 167, column: 33)
!318 = distinct !DILexicalBlock(scope: !319, file: !3, line: 167, column: 5)
!319 = distinct !DILexicalBlock(scope: !300, file: !3, line: 167, column: 5)
!320 = !DILocalVariable(name: "key", scope: !317, file: !3, line: 169, type: !86)
!321 = !DILocalVariable(name: "o", scope: !317, file: !3, line: 170, type: !210)
!322 = !DILocalVariable(name: "de", scope: !317, file: !3, line: 171, type: !133)
!323 = !DILocalVariable(name: "cached", scope: !324, file: !3, line: 226, type: !86)
!324 = distinct !DILexicalBlock(scope: !325, file: !3, line: 221, column: 50)
!325 = distinct !DILexicalBlock(scope: !326, file: !3, line: 221, column: 17)
!326 = distinct !DILexicalBlock(scope: !327, file: !3, line: 218, column: 16)
!327 = distinct !DILexicalBlock(scope: !328, file: !3, line: 216, column: 20)
!328 = distinct !DILexicalBlock(scope: !317, file: !3, line: 212, column: 13)
!329 = !DILocalVariable(name: "cached", scope: !330, file: !3, line: 235, type: !86)
!330 = distinct !DILexicalBlock(scope: !325, file: !3, line: 230, column: 20)
!331 = !DILocalVariable(name: "klen", scope: !317, file: !3, line: 246, type: !65)
!332 = !DILocation(line: 162, column: 31, scope: !300)
!333 = !DILocation(line: 162, column: 43, scope: !300)
!334 = !DILocation(line: 162, column: 61, scope: !300)
!335 = !DILocation(line: 162, column: 96, scope: !300)
!336 = !DILocation(line: 164, column: 31, scope: !300)
!337 = !{!338, !282, i64 2716}
!338 = !{!"redisServer", !282, i64 0, !281, i64 8, !281, i64 16, !281, i64 24, !282, i64 32, !282, i64 36, !282, i64 40, !281, i64 48, !281, i64 56, !281, i64 64, !281, i64 72, !282, i64 80, !282, i64 84, !282, i64 88, !282, i64 92, !281, i64 96, !281, i64 104, !282, i64 112, !282, i64 116, !279, i64 120, !282, i64 164, !339, i64 168, !282, i64 176, !281, i64 184, !281, i64 192, !281, i64 200, !279, i64 208, !282, i64 216, !282, i64 220, !279, i64 224, !282, i64 352, !281, i64 360, !282, i64 368, !279, i64 372, !282, i64 436, !282, i64 440, !279, i64 444, !282, i64 508, !281, i64 512, !281, i64 520, !281, i64 528, !281, i64 536, !281, i64 544, !281, i64 552, !281, i64 560, !282, i64 568, !278, i64 576, !279, i64 584, !281, i64 840, !339, i64 848, !282, i64 856, !282, i64 860, !339, i64 864, !339, i64 872, !339, i64 880, !339, i64 888, !281, i64 896, !281, i64 904, !281, i64 912, !281, i64 920, !281, i64 928, !281, i64 936, !281, i64 944, !281, i64 952, !281, i64 960, !281, i64 968, !281, i64 976, !281, i64 984, !281, i64 992, !339, i64 1000, !278, i64 1008, !278, i64 1016, !278, i64 1024, !340, i64 1032, !278, i64 1040, !278, i64 1048, !278, i64 1056, !278, i64 1064, !278, i64 1072, !278, i64 1080, !278, i64 1088, !278, i64 1096, !278, i64 1104, !339, i64 1112, !278, i64 1120, !340, i64 1128, !278, i64 1136, !278, i64 1144, !278, i64 1152, !278, i64 1160, !281, i64 1168, !278, i64 1176, !278, i64 1184, !339, i64 1192, !341, i64 1200, !278, i64 1240, !278, i64 1248, !339, i64 1256, !339, i64 1264, !279, i64 1272, !282, i64 1728, !282, i64 1732, !282, i64 1736, !282, i64 1740, !282, i64 1744, !339, i64 1752, !282, i64 1760, !282, i64 1764, !282, i64 1768, !282, i64 1772, !339, i64 1776, !339, i64 1784, !282, i64 1792, !282, i64 1796, !282, i64 1800, !282, i64 1804, !279, i64 1808, !282, i64 1880, !282, i64 1884, !281, i64 1888, !282, i64 1896, !282, i64 1900, !339, i64 1904, !339, i64 1912, !339, i64 1920, !339, i64 1928, !282, i64 1936, !282, i64 1940, !281, i64 1944, !281, i64 1952, !282, i64 1960, !282, i64 1964, !339, i64 1968, !339, i64 1976, !339, i64 1984, !339, i64 1992, !282, i64 2000, !339, i64 2008, !282, i64 2016, !282, i64 2020, !282, i64 2024, !282, i64 2028, !282, i64 2032, !282, i64 2036, !282, i64 2040, !282, i64 2044, !282, i64 2048, !282, i64 2052, !282, i64 2056, !282, i64 2060, !282, i64 2064, !281, i64 2072, !278, i64 2080, !278, i64 2088, !282, i64 2096, !281, i64 2104, !282, i64 2112, !281, i64 2120, !282, i64 2128, !282, i64 2132, !339, i64 2136, !339, i64 2144, !339, i64 2152, !339, i64 2160, !282, i64 2168, !282, i64 2172, !282, i64 2176, !282, i64 2180, !282, i64 2184, !282, i64 2188, !279, i64 2192, !342, i64 2200, !343, i64 2224, !281, i64 2240, !282, i64 2248, !281, i64 2256, !282, i64 2264, !279, i64 2268, !279, i64 2309, !278, i64 2352, !278, i64 2360, !282, i64 2368, !282, i64 2372, !281, i64 2376, !278, i64 2384, !278, i64 2392, !278, i64 2400, !278, i64 2408, !339, i64 2416, !339, i64 2424, !282, i64 2432, !282, i64 2436, !282, i64 2440, !282, i64 2444, !282, i64 2448, !281, i64 2456, !281, i64 2464, !282, i64 2472, !282, i64 2476, !281, i64 2480, !281, i64 2488, !282, i64 2496, !282, i64 2500, !339, i64 2504, !339, i64 2512, !339, i64 2520, !282, i64 2528, !282, i64 2532, !281, i64 2536, !339, i64 2544, !282, i64 2552, !282, i64 2556, !282, i64 2560, !339, i64 2568, !282, i64 2576, !282, i64 2580, !282, i64 2584, !281, i64 2592, !279, i64 2600, !278, i64 2648, !282, i64 2656, !281, i64 2664, !281, i64 2672, !282, i64 2680, !281, i64 2688, !282, i64 2696, !282, i64 2700, !278, i64 2704, !282, i64 2712, !282, i64 2716, !282, i64 2720, !282, i64 2724, !278, i64 2728, !282, i64 2736, !279, i64 2740, !281, i64 2768, !281, i64 2776, !282, i64 2784, !282, i64 2788, !282, i64 2792, !282, i64 2796, !339, i64 2800, !339, i64 2808, !339, i64 2816, !339, i64 2824, !339, i64 2832, !339, i64 2840, !339, i64 2848, !339, i64 2856, !282, i64 2864, !282, i64 2868, !339, i64 2872, !339, i64 2880, !282, i64 2888, !278, i64 2896, !281, i64 2904, !281, i64 2912, !282, i64 2920, !282, i64 2924, !278, i64 2928, !281, i64 2936, !281, i64 2944, !282, i64 2952, !282, i64 2956, !282, i64 2960, !282, i64 2964, !281, i64 2968, !282, i64 2976, !282, i64 2980, !282, i64 2984, !281, i64 2992, !281, i64 3000, !281, i64 3008, !281, i64 3016, !278, i64 3024, !278, i64 3032, !278, i64 3040, !282, i64 3048, !282, i64 3052, !282, i64 3056, !282, i64 3060, !282, i64 3064, !282, i64 3068, !282, i64 3072, !282, i64 3076, !282, i64 3080, !282, i64 3084, !282, i64 3088, !278, i64 3096, !281, i64 3104, !281, i64 3112, !281, i64 3120, !282, i64 3128, !282, i64 3132, !282, i64 3136, !339, i64 3144, !281, i64 3152, !281, i64 3160, !281, i64 3168}
!339 = !{!"long", !279, i64 0}
!340 = !{!"double", !279, i64 0}
!341 = !{!"malloc_stats", !339, i64 0, !339, i64 8, !339, i64 16, !339, i64 24, !339, i64 32}
!342 = !{!"", !282, i64 0, !339, i64 8, !278, i64 16}
!343 = !{!"redisOpArray", !281, i64 0, !282, i64 8}
!344 = !DILocation(line: 164, column: 5, scope: !300)
!345 = !DILocation(line: 0, scope: !300)
!346 = !DILocation(line: 164, column: 16, scope: !300)
!347 = !DILocation(line: 166, column: 13, scope: !300)
!348 = !DILocation(line: 163, column: 15, scope: !300)
!349 = !DILocation(line: 163, column: 9, scope: !300)
!350 = !DILocation(line: 170, column: 15, scope: !317)
!351 = !DILocation(line: 167, column: 19, scope: !318)
!352 = !DILocation(line: 167, column: 5, scope: !319)
!353 = !DILocation(line: 173, column: 14, scope: !317)
!354 = !DILocation(line: 171, column: 20, scope: !317)
!355 = !DILocation(line: 174, column: 15, scope: !317)
!356 = !{!357, !281, i64 0}
!357 = !{!"dictEntry", !281, i64 0, !279, i64 8, !281, i64 16}
!358 = !DILocation(line: 169, column: 13, scope: !317)
!359 = !DILocation(line: 179, column: 20, scope: !360)
!360 = distinct !DILexicalBlock(scope: !317, file: !3, line: 179, column: 13)
!361 = !{!338, !282, i64 2712}
!362 = !DILocation(line: 179, column: 37, scope: !360)
!363 = !DILocation(line: 179, column: 13, scope: !317)
!364 = !DILocation(line: 200, column: 39, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 198, column: 71)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 198, column: 20)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 189, column: 20)
!368 = distinct !DILexicalBlock(scope: !317, file: !3, line: 187, column: 13)
!369 = !DILocation(line: 180, column: 17, scope: !370)
!370 = distinct !DILexicalBlock(scope: !360, file: !3, line: 179, column: 64)
!371 = !DILocation(line: 180, column: 45, scope: !372)
!372 = distinct !DILexicalBlock(scope: !370, file: !3, line: 180, column: 17)
!373 = !DILocation(line: 187, column: 20, scope: !368)
!374 = !DILocation(line: 180, column: 40, scope: !372)
!375 = !DILocation(line: 0, scope: !317)
!376 = !DILocation(line: 181, column: 17, scope: !370)
!377 = !{!279, !279, i64 0}
!378 = !DILocation(line: 187, column: 37, scope: !368)
!379 = !DILocation(line: 187, column: 13, scope: !317)
!380 = !DILocation(line: 90, column: 49, scope: !239, inlinedAt: !381)
!381 = distinct !DILocation(line: 188, column: 20, scope: !382)
!382 = distinct !DILexicalBlock(scope: !368, file: !3, line: 187, column: 59)
!383 = !DILocation(line: 81, column: 9, scope: !234, inlinedAt: !384)
!384 = distinct !DILocation(line: 91, column: 35, scope: !239, inlinedAt: !381)
!385 = !DILocation(line: 79, column: 18, scope: !230, inlinedAt: !384)
!386 = !DILocation(line: 91, column: 35, scope: !239, inlinedAt: !381)
!387 = !DILocation(line: 91, column: 24, scope: !239, inlinedAt: !381)
!388 = !DILocation(line: 92, column: 24, scope: !252, inlinedAt: !381)
!389 = !DILocation(line: 92, column: 18, scope: !252, inlinedAt: !381)
!390 = !DILocation(line: 92, column: 21, scope: !252, inlinedAt: !381)
!391 = !DILocation(line: 95, column: 43, scope: !256, inlinedAt: !381)
!392 = !DILocation(line: 95, column: 28, scope: !256, inlinedAt: !381)
!393 = !DILocation(line: 92, column: 9, scope: !239, inlinedAt: !381)
!394 = !DILocation(line: 0, scope: !256, inlinedAt: !381)
!395 = !DILocation(line: 168, column: 28, scope: !317)
!396 = !DILocation(line: 189, column: 9, scope: !382)
!397 = !DILocation(line: 189, column: 44, scope: !367)
!398 = !DILocation(line: 189, column: 20, scope: !368)
!399 = !DILocalVariable(name: "o", arg: 1, scope: !400, file: !3, line: 335, type: !210)
!400 = distinct !DISubprogram(name: "LFUDecrAndReturn", scope: !3, file: !3, line: 335, type: !401, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!54, !210}
!403 = !{!399, !404, !405, !406}
!404 = !DILocalVariable(name: "ldt", scope: !400, file: !3, line: 336, type: !54)
!405 = !DILocalVariable(name: "counter", scope: !400, file: !3, line: 337, type: !54)
!406 = !DILocalVariable(name: "num_periods", scope: !400, file: !3, line: 338, type: !54)
!407 = !DILocation(line: 335, column: 38, scope: !400, inlinedAt: !408)
!408 = distinct !DILocation(line: 197, column: 24, scope: !409)
!409 = distinct !DILexicalBlock(scope: !367, file: !3, line: 189, column: 66)
!410 = !DILocation(line: 336, column: 28, scope: !400, inlinedAt: !408)
!411 = !DILocation(line: 337, column: 36, scope: !400, inlinedAt: !408)
!412 = !DILocation(line: 337, column: 29, scope: !400, inlinedAt: !408)
!413 = !DILocation(line: 337, column: 19, scope: !400, inlinedAt: !408)
!414 = !DILocation(line: 338, column: 40, scope: !400, inlinedAt: !408)
!415 = !{!338, !282, i64 2724}
!416 = !DILocation(line: 338, column: 33, scope: !400, inlinedAt: !408)
!417 = !DILocation(line: 336, column: 32, scope: !400, inlinedAt: !408)
!418 = !DILocation(line: 336, column: 25, scope: !400, inlinedAt: !408)
!419 = !DILocation(line: 336, column: 19, scope: !400, inlinedAt: !408)
!420 = !DILocalVariable(name: "ldt", arg: 1, scope: !421, file: !3, line: 307, type: !54)
!421 = distinct !DISubprogram(name: "LFUTimeElapsed", scope: !3, file: !3, line: 307, type: !422, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !424)
!422 = !DISubroutineType(types: !423)
!423 = !{!54, !54}
!424 = !{!420, !425}
!425 = !DILocalVariable(name: "now", scope: !421, file: !3, line: 308, type: !54)
!426 = !DILocation(line: 307, column: 44, scope: !421, inlinedAt: !427)
!427 = distinct !DILocation(line: 338, column: 57, scope: !400, inlinedAt: !408)
!428 = !DILocation(line: 300, column: 20, scope: !429, inlinedAt: !432)
!429 = distinct !DISubprogram(name: "LFUGetTimeInMinutes", scope: !3, file: !3, line: 299, type: !430, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!430 = !DISubroutineType(types: !431)
!431 = !{!54}
!432 = distinct !DILocation(line: 308, column: 25, scope: !421, inlinedAt: !427)
!433 = !{!338, !339, i64 2872}
!434 = !DILocation(line: 300, column: 28, scope: !429, inlinedAt: !432)
!435 = !DILocation(line: 300, column: 33, scope: !429, inlinedAt: !432)
!436 = !DILocation(line: 308, column: 19, scope: !421, inlinedAt: !427)
!437 = !DILocation(line: 309, column: 13, scope: !438, inlinedAt: !427)
!438 = distinct !DILexicalBlock(scope: !421, file: !3, line: 309, column: 9)
!439 = !DILocation(line: 309, column: 9, scope: !421, inlinedAt: !427)
!440 = !DILocation(line: 338, column: 79, scope: !400, inlinedAt: !408)
!441 = !DILocation(line: 338, column: 77, scope: !400, inlinedAt: !408)
!442 = !DILocation(line: 338, column: 19, scope: !400, inlinedAt: !408)
!443 = !DILocation(line: 339, column: 9, scope: !444, inlinedAt: !408)
!444 = distinct !DILexicalBlock(scope: !400, file: !3, line: 339, column: 9)
!445 = !DILocation(line: 339, column: 9, scope: !400, inlinedAt: !408)
!446 = !DILocation(line: 340, column: 19, scope: !444, inlinedAt: !408)
!447 = !DILocation(line: 340, column: 9, scope: !444, inlinedAt: !408)
!448 = !DILocation(line: 0, scope: !400, inlinedAt: !408)
!449 = !DILocation(line: 197, column: 23, scope: !409)
!450 = !DILocation(line: 198, column: 9, scope: !409)
!451 = !DILocation(line: 198, column: 44, scope: !366)
!452 = !DILocation(line: 198, column: 20, scope: !367)
!453 = !DILocation(line: 200, column: 31, scope: !365)
!454 = !DILocation(line: 202, column: 13, scope: !455)
!455 = distinct !DILexicalBlock(scope: !366, file: !3, line: 201, column: 16)
!456 = !DILocation(line: 0, scope: !365)
!457 = !DILocation(line: 163, column: 12, scope: !300)
!458 = !DILocation(line: 210, column: 24, scope: !317)
!459 = !DILocation(line: 210, column: 16, scope: !317)
!460 = !DILocation(line: 210, column: 28, scope: !317)
!461 = !DILocation(line: 211, column: 24, scope: !317)
!462 = !DILocation(line: 211, column: 29, scope: !317)
!463 = !DILocation(line: 209, column: 9, scope: !317)
!464 = !DILocation(line: 212, column: 43, scope: !328)
!465 = !DILocation(line: 212, column: 47, scope: !328)
!466 = !DILocation(line: 212, column: 13, scope: !317)
!467 = !DILocation(line: 216, column: 51, scope: !327)
!468 = !DILocation(line: 216, column: 20, scope: !328)
!469 = !DILocation(line: 221, column: 37, scope: !325)
!470 = !DILocation(line: 221, column: 41, scope: !325)
!471 = !DILocation(line: 221, column: 17, scope: !326)
!472 = !DILocation(line: 226, column: 50, scope: !324)
!473 = !DILocation(line: 226, column: 21, scope: !324)
!474 = !DILocation(line: 227, column: 29, scope: !324)
!475 = !DILocation(line: 227, column: 31, scope: !324)
!476 = !DILocation(line: 227, column: 25, scope: !324)
!477 = !DILocation(line: 227, column: 34, scope: !324)
!478 = !DILocation(line: 228, column: 36, scope: !324)
!479 = !DILocation(line: 227, column: 17, scope: !324)
!480 = !DILocation(line: 229, column: 25, scope: !324)
!481 = !DILocation(line: 229, column: 32, scope: !324)
!482 = !DILocation(line: 230, column: 13, scope: !324)
!483 = !DILocation(line: 232, column: 18, scope: !330)
!484 = !DILocation(line: 235, column: 38, scope: !330)
!485 = !DILocation(line: 235, column: 21, scope: !330)
!486 = !DILocation(line: 236, column: 33, scope: !487)
!487 = distinct !DILexicalBlock(scope: !330, file: !3, line: 236, column: 21)
!488 = !DILocation(line: 236, column: 21, scope: !330)
!489 = !DILocation(line: 236, column: 52, scope: !487)
!490 = !DILocation(line: 237, column: 53, scope: !330)
!491 = !DILocation(line: 237, column: 52, scope: !330)
!492 = !DILocation(line: 237, column: 17, scope: !330)
!493 = !DILocation(line: 238, column: 25, scope: !330)
!494 = !DILocation(line: 238, column: 32, scope: !330)
!495 = !DILocation(line: 0, scope: !330)
!496 = !DILocalVariable(name: "s", arg: 1, scope: !497, file: !13, line: 87, type: !502)
!497 = distinct !DISubprogram(name: "sdslen", scope: !13, file: !13, line: 87, type: !498, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !503)
!498 = !DISubroutineType(types: !499)
!499 = !{!500, !502}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !501, line: 58, baseType: !54)
!501 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!503 = !{!496, !504}
!504 = !DILocalVariable(name: "flags", scope: !497, file: !13, line: 88, type: !20)
!505 = !DILocation(line: 87, column: 39, scope: !497, inlinedAt: !506)
!506 = distinct !DILocation(line: 246, column: 20, scope: !317)
!507 = !DILocation(line: 88, column: 27, scope: !497, inlinedAt: !506)
!508 = !DILocation(line: 88, column: 19, scope: !497, inlinedAt: !506)
!509 = !DILocation(line: 89, column: 5, scope: !497, inlinedAt: !506)
!510 = !DILocation(line: 91, column: 20, scope: !511, inlinedAt: !506)
!511 = distinct !DILexicalBlock(scope: !497, file: !13, line: 89, column: 33)
!512 = !DILocation(line: 91, column: 13, scope: !511, inlinedAt: !506)
!513 = !DILocation(line: 93, column: 20, scope: !511, inlinedAt: !506)
!514 = !DILocation(line: 93, column: 34, scope: !511, inlinedAt: !506)
!515 = !DILocation(line: 93, column: 13, scope: !511, inlinedAt: !506)
!516 = !DILocation(line: 95, column: 20, scope: !511, inlinedAt: !506)
!517 = !DILocation(line: 95, column: 35, scope: !511, inlinedAt: !506)
!518 = !{!519, !519, i64 0}
!519 = !{!"short", !279, i64 0}
!520 = !DILocation(line: 95, column: 13, scope: !511, inlinedAt: !506)
!521 = !DILocation(line: 97, column: 20, scope: !511, inlinedAt: !506)
!522 = !DILocation(line: 97, column: 35, scope: !511, inlinedAt: !506)
!523 = !{!282, !282, i64 0}
!524 = !DILocation(line: 97, column: 13, scope: !511, inlinedAt: !506)
!525 = !DILocation(line: 99, column: 20, scope: !511, inlinedAt: !506)
!526 = !DILocation(line: 99, column: 35, scope: !511, inlinedAt: !506)
!527 = !{!339, !339, i64 0}
!528 = !DILocation(line: 99, column: 13, scope: !511, inlinedAt: !506)
!529 = !DILocation(line: 0, scope: !511, inlinedAt: !506)
!530 = !DILocation(line: 246, column: 20, scope: !317)
!531 = !DILocation(line: 246, column: 13, scope: !317)
!532 = !DILocation(line: 247, column: 18, scope: !533)
!533 = distinct !DILexicalBlock(scope: !317, file: !3, line: 247, column: 13)
!534 = !DILocation(line: 247, column: 13, scope: !317)
!535 = !DILocation(line: 248, column: 27, scope: !536)
!536 = distinct !DILexicalBlock(scope: !533, file: !3, line: 247, column: 44)
!537 = !DILocation(line: 248, column: 13, scope: !536)
!538 = !DILocation(line: 248, column: 21, scope: !536)
!539 = !DILocation(line: 248, column: 25, scope: !536)
!540 = !DILocation(line: 249, column: 9, scope: !536)
!541 = !DILocation(line: 250, column: 20, scope: !542)
!542 = distinct !DILexicalBlock(scope: !533, file: !3, line: 249, column: 16)
!543 = !DILocation(line: 250, column: 28, scope: !542)
!544 = !DILocation(line: 250, column: 39, scope: !542)
!545 = !DILocation(line: 250, column: 13, scope: !542)
!546 = !DILocation(line: 251, column: 31, scope: !542)
!547 = !DILocation(line: 251, column: 38, scope: !542)
!548 = !DILocalVariable(name: "s", arg: 1, scope: !549, file: !13, line: 130, type: !86)
!549 = distinct !DISubprogram(name: "sdssetlen", scope: !13, file: !13, line: 130, type: !550, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !86, !500}
!552 = !{!548, !553, !554, !555}
!553 = !DILocalVariable(name: "newlen", arg: 2, scope: !549, file: !13, line: 130, type: !500)
!554 = !DILocalVariable(name: "flags", scope: !549, file: !13, line: 131, type: !20)
!555 = !DILocalVariable(name: "fp", scope: !556, file: !13, line: 135, type: !58)
!556 = distinct !DILexicalBlock(scope: !557, file: !13, line: 134, column: 13)
!557 = distinct !DILexicalBlock(scope: !549, file: !13, line: 132, column: 33)
!558 = !DILocation(line: 130, column: 34, scope: !549, inlinedAt: !559)
!559 = distinct !DILocation(line: 251, column: 13, scope: !542)
!560 = !DILocation(line: 130, column: 44, scope: !549, inlinedAt: !559)
!561 = !DILocation(line: 131, column: 27, scope: !549, inlinedAt: !559)
!562 = !DILocation(line: 131, column: 19, scope: !549, inlinedAt: !559)
!563 = !DILocation(line: 132, column: 5, scope: !549, inlinedAt: !559)
!564 = !DILocation(line: 135, column: 32, scope: !556, inlinedAt: !559)
!565 = !DILocation(line: 136, column: 23, scope: !556, inlinedAt: !559)
!566 = !DILocation(line: 136, column: 21, scope: !556, inlinedAt: !559)
!567 = !DILocation(line: 138, column: 13, scope: !557, inlinedAt: !559)
!568 = !DILocation(line: 140, column: 33, scope: !557, inlinedAt: !559)
!569 = !DILocation(line: 140, column: 13, scope: !557, inlinedAt: !559)
!570 = !DILocation(line: 140, column: 31, scope: !557, inlinedAt: !559)
!571 = !DILocation(line: 141, column: 13, scope: !557, inlinedAt: !559)
!572 = !DILocation(line: 143, column: 34, scope: !557, inlinedAt: !559)
!573 = !DILocation(line: 143, column: 13, scope: !557, inlinedAt: !559)
!574 = !DILocation(line: 143, column: 28, scope: !557, inlinedAt: !559)
!575 = !DILocation(line: 143, column: 32, scope: !557, inlinedAt: !559)
!576 = !DILocation(line: 144, column: 13, scope: !557, inlinedAt: !559)
!577 = !DILocation(line: 146, column: 34, scope: !557, inlinedAt: !559)
!578 = !DILocation(line: 146, column: 13, scope: !557, inlinedAt: !559)
!579 = !DILocation(line: 146, column: 28, scope: !557, inlinedAt: !559)
!580 = !DILocation(line: 146, column: 32, scope: !557, inlinedAt: !559)
!581 = !DILocation(line: 147, column: 13, scope: !557, inlinedAt: !559)
!582 = !DILocation(line: 149, column: 13, scope: !557, inlinedAt: !559)
!583 = !DILocation(line: 149, column: 28, scope: !557, inlinedAt: !559)
!584 = !DILocation(line: 149, column: 32, scope: !557, inlinedAt: !559)
!585 = !DILocation(line: 150, column: 13, scope: !557, inlinedAt: !559)
!586 = !DILocation(line: 252, column: 35, scope: !542)
!587 = !DILocation(line: 252, column: 21, scope: !542)
!588 = !DILocation(line: 252, column: 25, scope: !542)
!589 = !DILocation(line: 254, column: 9, scope: !317)
!590 = !DILocation(line: 254, column: 17, scope: !317)
!591 = !DILocation(line: 254, column: 22, scope: !317)
!592 = !DILocation(line: 255, column: 17, scope: !317)
!593 = !DILocation(line: 255, column: 22, scope: !317)
!594 = !DILocation(line: 256, column: 5, scope: !318)
!595 = !DILocation(line: 167, column: 29, scope: !318)
!596 = distinct !{!596, !352, !597}
!597 = !DILocation(line: 256, column: 5, scope: !319)
!598 = !DILocation(line: 257, column: 1, scope: !300)
!599 = !DILocation(line: 335, column: 38, scope: !400)
!600 = !DILocation(line: 336, column: 28, scope: !400)
!601 = !DILocation(line: 337, column: 36, scope: !400)
!602 = !DILocation(line: 337, column: 29, scope: !400)
!603 = !DILocation(line: 337, column: 19, scope: !400)
!604 = !DILocation(line: 338, column: 40, scope: !400)
!605 = !DILocation(line: 338, column: 33, scope: !400)
!606 = !DILocation(line: 336, column: 32, scope: !400)
!607 = !DILocation(line: 336, column: 25, scope: !400)
!608 = !DILocation(line: 336, column: 19, scope: !400)
!609 = !DILocation(line: 307, column: 44, scope: !421, inlinedAt: !610)
!610 = distinct !DILocation(line: 338, column: 57, scope: !400)
!611 = !DILocation(line: 300, column: 20, scope: !429, inlinedAt: !612)
!612 = distinct !DILocation(line: 308, column: 25, scope: !421, inlinedAt: !610)
!613 = !DILocation(line: 300, column: 28, scope: !429, inlinedAt: !612)
!614 = !DILocation(line: 300, column: 33, scope: !429, inlinedAt: !612)
!615 = !DILocation(line: 308, column: 19, scope: !421, inlinedAt: !610)
!616 = !DILocation(line: 309, column: 13, scope: !438, inlinedAt: !610)
!617 = !DILocation(line: 309, column: 9, scope: !421, inlinedAt: !610)
!618 = !DILocation(line: 338, column: 79, scope: !400)
!619 = !DILocation(line: 338, column: 77, scope: !400)
!620 = !DILocation(line: 338, column: 19, scope: !400)
!621 = !DILocation(line: 339, column: 9, scope: !444)
!622 = !DILocation(line: 339, column: 9, scope: !400)
!623 = !DILocation(line: 340, column: 19, scope: !444)
!624 = !DILocation(line: 340, column: 9, scope: !444)
!625 = !DILocation(line: 0, scope: !400)
!626 = !DILocation(line: 341, column: 5, scope: !400)
!627 = !DILocation(line: 300, column: 20, scope: !429)
!628 = !DILocation(line: 300, column: 28, scope: !429)
!629 = !DILocation(line: 300, column: 33, scope: !429)
!630 = !DILocation(line: 300, column: 5, scope: !429)
!631 = !DILocation(line: 307, column: 44, scope: !421)
!632 = !DILocation(line: 300, column: 20, scope: !429, inlinedAt: !633)
!633 = distinct !DILocation(line: 308, column: 25, scope: !421)
!634 = !DILocation(line: 300, column: 28, scope: !429, inlinedAt: !633)
!635 = !DILocation(line: 300, column: 33, scope: !429, inlinedAt: !633)
!636 = !DILocation(line: 308, column: 19, scope: !421)
!637 = !DILocation(line: 309, column: 13, scope: !438)
!638 = !DILocation(line: 309, column: 9, scope: !421)
!639 = !DILocation(line: 311, column: 1, scope: !421)
!640 = distinct !DISubprogram(name: "LFULogIncr", scope: !3, file: !3, line: 315, type: !641, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{!16, !16}
!643 = !{!644, !645, !646, !647}
!644 = !DILocalVariable(name: "counter", arg: 1, scope: !640, file: !3, line: 315, type: !16)
!645 = !DILocalVariable(name: "r", scope: !640, file: !3, line: 317, type: !8)
!646 = !DILocalVariable(name: "baseval", scope: !640, file: !3, line: 318, type: !8)
!647 = !DILocalVariable(name: "p", scope: !640, file: !3, line: 320, type: !8)
!648 = !DILocation(line: 315, column: 28, scope: !640)
!649 = !DILocation(line: 316, column: 17, scope: !650)
!650 = distinct !DILexicalBlock(scope: !640, file: !3, line: 316, column: 9)
!651 = !DILocation(line: 316, column: 9, scope: !640)
!652 = !DILocation(line: 316, column: 9, scope: !650)
!653 = !DILocation(line: 317, column: 24, scope: !640)
!654 = !DILocation(line: 317, column: 16, scope: !640)
!655 = !DILocation(line: 317, column: 12, scope: !640)
!656 = !DILocation(line: 318, column: 30, scope: !640)
!657 = !DILocation(line: 318, column: 22, scope: !640)
!658 = !DILocation(line: 318, column: 12, scope: !640)
!659 = !DILocation(line: 319, column: 17, scope: !660)
!660 = distinct !DILexicalBlock(scope: !640, file: !3, line: 319, column: 9)
!661 = !DILocation(line: 319, column: 9, scope: !640)
!662 = !DILocation(line: 320, column: 36, scope: !640)
!663 = !{!338, !282, i64 2720}
!664 = !DILocation(line: 320, column: 29, scope: !640)
!665 = !DILocation(line: 320, column: 28, scope: !640)
!666 = !DILocation(line: 320, column: 50, scope: !640)
!667 = !DILocation(line: 317, column: 30, scope: !640)
!668 = !DILocation(line: 320, column: 12, scope: !640)
!669 = !DILocation(line: 321, column: 11, scope: !670)
!670 = distinct !DILexicalBlock(scope: !640, file: !3, line: 321, column: 9)
!671 = !DILocation(line: 321, column: 9, scope: !640)
!672 = !DILocation(line: 0, scope: !640)
!673 = !DILocation(line: 323, column: 1, scope: !640)
!674 = distinct !DISubprogram(name: "freeMemoryGetNotCountedMemory", scope: !3, file: !3, line: 352, type: !675, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !677)
!675 = !DISubroutineType(types: !676)
!676 = !{!68}
!677 = !{!678, !679, !680, !688, !689}
!678 = !DILocalVariable(name: "overhead", scope: !674, file: !3, line: 353, type: !68)
!679 = !DILocalVariable(name: "slaves", scope: !674, file: !3, line: 354, type: !65)
!680 = !DILocalVariable(name: "li", scope: !681, file: !3, line: 357, type: !683)
!681 = distinct !DILexicalBlock(scope: !682, file: !3, line: 356, column: 17)
!682 = distinct !DILexicalBlock(scope: !674, file: !3, line: 356, column: 9)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !165, line: 45, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !165, line: 42, size: 128, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !165, line: 43, baseType: !169, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !684, file: !165, line: 44, baseType: !65, size: 32, offset: 64)
!688 = !DILocalVariable(name: "ln", scope: !681, file: !3, line: 358, type: !169)
!689 = !DILocalVariable(name: "slave", scope: !690, file: !3, line: 362, type: !691)
!690 = distinct !DILexicalBlock(scope: !681, file: !3, line: 361, column: 37)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !76, line: 780, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !76, line: 723, size: 135360, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !706, !730, !731, !732, !733, !734, !735, !736, !737, !740, !741, !742, !743, !744, !745, !746, !747, !752, !753, !754, !755, !756, !757, !758, !759, !763, !764, !768, !769, !785, !786, !802, !803, !804, !805, !806, !807, !808, !809}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !693, file: !76, line: 724, baseType: !52, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !693, file: !76, line: 725, baseType: !65, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !693, file: !76, line: 726, baseType: !90, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !693, file: !76, line: 727, baseType: !210, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !693, file: !76, line: 728, baseType: !86, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !693, file: !76, line: 729, baseType: !68, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !693, file: !76, line: 730, baseType: !86, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !693, file: !76, line: 734, baseType: !68, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !693, file: !76, line: 735, baseType: !65, size: 32, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !693, file: !76, line: 736, baseType: !705, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !693, file: !76, line: 737, baseType: !707, size: 64, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !76, line: 1307, size: 640, elements: !709)
!709 = !{!710, !711, !716, !717, !718, !719, !725, !726, !727, !728, !729}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !76, line: 1308, baseType: !87, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !708, file: !76, line: 1309, baseType: !712, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !76, line: 1305, baseType: !714)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !691}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !708, file: !76, line: 1310, baseType: !65, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !708, file: !76, line: 1311, baseType: !87, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !708, file: !76, line: 1312, baseType: !65, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !708, file: !76, line: 1315, baseType: !720, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !76, line: 1306, baseType: !722)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !707, !705, !65, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !708, file: !76, line: 1317, baseType: !65, size: 32, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !708, file: !76, line: 1318, baseType: !65, size: 32, offset: 416)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !708, file: !76, line: 1319, baseType: !65, size: 32, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !708, file: !76, line: 1320, baseType: !10, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !708, file: !76, line: 1320, baseType: !10, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !693, file: !76, line: 737, baseType: !707, size: 64, offset: 704)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !693, file: !76, line: 738, baseType: !65, size: 32, offset: 768)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !693, file: !76, line: 739, baseType: !65, size: 32, offset: 800)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !693, file: !76, line: 740, baseType: !6, size: 64, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !693, file: !76, line: 741, baseType: !163, size: 64, offset: 896)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !693, file: !76, line: 742, baseType: !200, size: 64, offset: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !693, file: !76, line: 743, baseType: !68, size: 64, offset: 1024)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !693, file: !76, line: 745, baseType: !738, size: 64, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !739, line: 34, baseType: !6)
!739 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !693, file: !76, line: 746, baseType: !738, size: 64, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !693, file: !76, line: 747, baseType: !738, size: 64, offset: 1216)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !76, line: 748, baseType: !65, size: 32, offset: 1280)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !693, file: !76, line: 749, baseType: !65, size: 32, offset: 1312)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !693, file: !76, line: 750, baseType: !65, size: 32, offset: 1344)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !693, file: !76, line: 751, baseType: !65, size: 32, offset: 1376)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !693, file: !76, line: 752, baseType: !65, size: 32, offset: 1408)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !693, file: !76, line: 753, baseType: !748, size: 64, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !749, line: 173, baseType: !750)
!749 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 100, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !71, line: 44, baseType: !6)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !693, file: !76, line: 754, baseType: !748, size: 64, offset: 1536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !693, file: !76, line: 755, baseType: !86, size: 64, offset: 1600)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !693, file: !76, line: 756, baseType: !10, size: 64, offset: 1664)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !693, file: !76, line: 757, baseType: !10, size: 64, offset: 1728)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !693, file: !76, line: 758, baseType: !10, size: 64, offset: 1792)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !693, file: !76, line: 759, baseType: !10, size: 64, offset: 1856)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !693, file: !76, line: 760, baseType: !10, size: 64, offset: 1920)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !693, file: !76, line: 763, baseType: !760, size: 328, offset: 1984)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 328, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 41)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !693, file: !76, line: 764, baseType: !65, size: 32, offset: 2336)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !693, file: !76, line: 765, baseType: !765, size: 368, offset: 2368)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 368, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 46)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !693, file: !76, line: 766, baseType: !65, size: 32, offset: 2752)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !693, file: !76, line: 767, baseType: !770, size: 256, offset: 2816)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !76, line: 673, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !76, line: 665, size: 256, elements: !772)
!772 = !{!773, !781, !782, !783, !784}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !771, file: !76, line: 666, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !76, line: 663, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !76, line: 659, size: 192, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !776, file: !76, line: 660, baseType: !705, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !776, file: !76, line: 661, baseType: !65, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !776, file: !76, line: 662, baseType: !707, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !771, file: !76, line: 667, baseType: !65, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !771, file: !76, line: 668, baseType: !65, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !771, file: !76, line: 671, baseType: !65, size: 32, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !771, file: !76, line: 672, baseType: !738, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !693, file: !76, line: 768, baseType: !65, size: 32, offset: 3072)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !693, file: !76, line: 769, baseType: !787, size: 704, offset: 3136)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !76, line: 703, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !76, line: 677, size: 704, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !788, file: !76, line: 679, baseType: !75, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !788, file: !76, line: 683, baseType: !95, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !788, file: !76, line: 685, baseType: !210, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !788, file: !76, line: 689, baseType: !68, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !788, file: !76, line: 690, baseType: !210, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !788, file: !76, line: 691, baseType: !210, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !788, file: !76, line: 692, baseType: !75, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !788, file: !76, line: 692, baseType: !75, size: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !788, file: !76, line: 693, baseType: !65, size: 32, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !788, file: !76, line: 696, baseType: !65, size: 32, offset: 544)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !788, file: !76, line: 697, baseType: !10, size: 64, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !788, file: !76, line: 700, baseType: !7, size: 64, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !693, file: !76, line: 770, baseType: !10, size: 64, offset: 3840)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !693, file: !76, line: 771, baseType: !163, size: 64, offset: 3904)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !693, file: !76, line: 772, baseType: !95, size: 64, offset: 3968)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !693, file: !76, line: 773, baseType: !163, size: 64, offset: 4032)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !693, file: !76, line: 774, baseType: !86, size: 64, offset: 4096)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !693, file: !76, line: 775, baseType: !169, size: 64, offset: 4160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !693, file: !76, line: 778, baseType: !65, size: 32, offset: 4224)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !693, file: !76, line: 779, baseType: !810, size: 131072, offset: 4256)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 131072, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 16384)
!813 = !DILocation(line: 353, column: 12, scope: !674)
!814 = !DILocation(line: 354, column: 18, scope: !674)
!815 = !{!338, !281, i64 536}
!816 = !{!817, !339, i64 40}
!817 = !{!"list", !281, i64 0, !281, i64 8, !281, i64 16, !281, i64 24, !281, i64 32, !339, i64 40}
!818 = !DILocation(line: 354, column: 9, scope: !674)
!819 = !DILocation(line: 356, column: 9, scope: !682)
!820 = !DILocation(line: 356, column: 9, scope: !674)
!821 = !DILocation(line: 357, column: 9, scope: !681)
!822 = !DILocation(line: 357, column: 18, scope: !681)
!823 = !DILocation(line: 360, column: 9, scope: !681)
!824 = !DILocation(line: 361, column: 21, scope: !681)
!825 = !DILocation(line: 358, column: 19, scope: !681)
!826 = !DILocation(line: 361, column: 9, scope: !681)
!827 = !DILocation(line: 362, column: 29, scope: !690)
!828 = !{!829, !281, i64 16}
!829 = !{!"listNode", !281, i64 0, !281, i64 8, !281, i64 16}
!830 = !DILocation(line: 362, column: 21, scope: !690)
!831 = !DILocation(line: 363, column: 25, scope: !690)
!832 = !DILocation(line: 363, column: 22, scope: !690)
!833 = distinct !{!833, !826, !834}
!834 = !DILocation(line: 364, column: 9, scope: !681)
!835 = !DILocation(line: 0, scope: !690)
!836 = !DILocation(line: 365, column: 5, scope: !682)
!837 = !DILocation(line: 365, column: 5, scope: !681)
!838 = !DILocation(line: 366, column: 16, scope: !839)
!839 = distinct !DILexicalBlock(scope: !674, file: !3, line: 366, column: 9)
!840 = !{!338, !282, i64 1880}
!841 = !DILocation(line: 366, column: 26, scope: !839)
!842 = !DILocation(line: 366, column: 9, scope: !674)
!843 = !DILocation(line: 367, column: 37, scope: !844)
!844 = distinct !DILexicalBlock(scope: !839, file: !3, line: 366, column: 38)
!845 = !{!338, !281, i64 1952}
!846 = !DILocalVariable(name: "s", arg: 1, scope: !847, file: !13, line: 180, type: !502)
!847 = distinct !DISubprogram(name: "sdsalloc", scope: !13, file: !13, line: 180, type: !498, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !848)
!848 = !{!846, !849}
!849 = !DILocalVariable(name: "flags", scope: !847, file: !13, line: 181, type: !20)
!850 = !DILocation(line: 180, column: 41, scope: !847, inlinedAt: !851)
!851 = distinct !DILocation(line: 367, column: 21, scope: !844)
!852 = !DILocation(line: 181, column: 27, scope: !847, inlinedAt: !851)
!853 = !DILocation(line: 181, column: 19, scope: !847, inlinedAt: !851)
!854 = !DILocation(line: 182, column: 5, scope: !847, inlinedAt: !851)
!855 = !DILocation(line: 184, column: 20, scope: !856, inlinedAt: !851)
!856 = distinct !DILexicalBlock(scope: !847, file: !13, line: 182, column: 33)
!857 = !DILocation(line: 184, column: 13, scope: !856, inlinedAt: !851)
!858 = !DILocation(line: 186, column: 34, scope: !856, inlinedAt: !851)
!859 = !DILocation(line: 186, column: 20, scope: !856, inlinedAt: !851)
!860 = !DILocation(line: 186, column: 13, scope: !856, inlinedAt: !851)
!861 = !DILocation(line: 188, column: 35, scope: !856, inlinedAt: !851)
!862 = !DILocation(line: 188, column: 20, scope: !856, inlinedAt: !851)
!863 = !DILocation(line: 188, column: 13, scope: !856, inlinedAt: !851)
!864 = !DILocation(line: 190, column: 35, scope: !856, inlinedAt: !851)
!865 = !DILocation(line: 190, column: 20, scope: !856, inlinedAt: !851)
!866 = !DILocation(line: 190, column: 13, scope: !856, inlinedAt: !851)
!867 = !DILocation(line: 192, column: 35, scope: !856, inlinedAt: !851)
!868 = !DILocation(line: 192, column: 13, scope: !856, inlinedAt: !851)
!869 = !DILocation(line: 0, scope: !856, inlinedAt: !851)
!870 = !DILocation(line: 367, column: 46, scope: !844)
!871 = !DILocation(line: 367, column: 45, scope: !844)
!872 = !DILocation(line: 367, column: 18, scope: !844)
