; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/gdtoa-gethex.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/gdtoa-gethex.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__hexdig", scope: !2, file: !3, line: 41, type: !41, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !40)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/gdtoa-gethex.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 36, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/gdtoa.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22}
!9 = !DIEnumerator(name: "STRTOG_Zero", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "STRTOG_Normal", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "STRTOG_Denormal", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "STRTOG_Infinite", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "STRTOG_NaN", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "STRTOG_NaNbits", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "STRTOG_NoNumber", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "STRTOG_Retmask", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "STRTOG_Neg", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "STRTOG_Inexlo", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "STRTOG_Inexhi", value: 32, isUnsigned: true)
!20 = !DIEnumerator(name: "STRTOG_Inexact", value: 48, isUnsigned: true)
!21 = !DIEnumerator(name: "STRTOG_Underflow", value: 64, isUnsigned: true)
!22 = !DIEnumerator(name: "STRTOG_Overflow", value: 128, isUnsigned: true)
!23 = !{!24, !26, !29, !32, !37, !38}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", file: !33, line: 84, baseType: !34)
!33 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/mprec.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !35, line: 77, baseType: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !39, line: 25, baseType: !7)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !{!0}
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2048, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 256)
!44 = !{i32 2, !"Dwarf Version", i32 4}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{i32 1, !"wchar_size", i32 4}
!47 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!48 = distinct !DISubprogram(name: "__gethex", scope: !3, file: !3, line: 148, type: !49, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !338)
!49 = !DISubroutineType(types: !50)
!50 = !{!36, !51, !321, !322, !332, !333, !36, !336}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !39, line: 569, size: 14912, elements: !53)
!53 = !{!54, !55, !130, !131, !132, !133, !137, !138, !203, !204, !208, !219, !220, !221, !223, !224, !225, !287, !306, !307, !312, !319}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !52, file: !39, line: 571, baseType: !36, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !52, file: !39, line: 576, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !39, line: 287, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !39, line: 181, size: 1408, elements: !59)
!59 = !{!60, !61, !62, !63, !65, !66, !71, !72, !74, !81, !85, !90, !94, !95, !96, !97, !101, !105, !106, !107, !109, !110, !114, !129}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !58, file: !39, line: 182, baseType: !24, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !58, file: !39, line: 183, baseType: !36, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !58, file: !39, line: 184, baseType: !36, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !39, line: 185, baseType: !64, size: 16, offset: 128)
!64 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !58, file: !39, line: 186, baseType: !64, size: 16, offset: 144)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !58, file: !39, line: 187, baseType: !67, size: 128, offset: 192)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !39, line: 117, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !67, file: !39, line: 118, baseType: !24, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !67, file: !39, line: 119, baseType: !36, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !58, file: !39, line: 188, baseType: !36, size: 32, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !58, file: !39, line: 195, baseType: !73, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !58, file: !39, line: 197, baseType: !75, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !51, !73, !37, !36}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !79, line: 145, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !58, file: !39, line: 199, baseType: !82, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!78, !51, !73, !26, !36}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !58, file: !39, line: 202, baseType: !86, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !51, !73, !89, !36}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !79, line: 114, baseType: !80)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !58, file: !39, line: 203, baseType: !91, size: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!36, !51, !73}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !58, file: !39, line: 206, baseType: !67, size: 128, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !58, file: !39, line: 207, baseType: !24, size: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !58, file: !39, line: 208, baseType: !36, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !58, file: !39, line: 211, baseType: !98, size: 24, offset: 928)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 24, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 3)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !58, file: !39, line: 212, baseType: !102, size: 8, offset: 952)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !58, file: !39, line: 215, baseType: !67, size: 128, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !58, file: !39, line: 218, baseType: !36, size: 32, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !39, line: 219, baseType: !108, size: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !79, line: 44, baseType: !80)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !58, file: !39, line: 222, baseType: !51, size: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !39, line: 226, baseType: !111, size: 32, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !79, line: 175, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !113, line: 12, baseType: !36)
!113 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !58, file: !39, line: 228, baseType: !115, size: 64, offset: 1312)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !79, line: 171, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 163, size: 64, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !116, file: !79, line: 165, baseType: !36, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !116, file: !79, line: 170, baseType: !120, size: 32, offset: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !79, line: 166, size: 32, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !120, file: !79, line: 168, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !124, line: 124, baseType: !7)
!124 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !120, file: !79, line: 169, baseType: !126, size: 32)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 4)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !39, line: 229, baseType: !36, size: 32, offset: 1376)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !52, file: !39, line: 576, baseType: !56, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !52, file: !39, line: 576, baseType: !56, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !52, file: !39, line: 578, baseType: !36, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !52, file: !39, line: 579, baseType: !134, size: 200, offset: 288)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 200, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 25)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !52, file: !39, line: 582, baseType: !36, size: 32, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !52, file: !39, line: 583, baseType: !139, size: 64, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !141, line: 178, size: 3392, elements: !142)
!141 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!142 = !{!143, !148, !156, !165, !166, !167, !195, !199, !202}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !140, file: !141, line: 180, baseType: !144, size: 1792)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1792, elements: !145)
!145 = !{!146, !147}
!146 = !DISubrange(count: 7)
!147 = !DISubrange(count: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !140, file: !141, line: 181, baseType: !149, size: 64, offset: 1792)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!36, !51, !37, !152, !153}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !124, line: 83, baseType: !36)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !155, line: 86, baseType: !115)
!155 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !140, file: !141, line: 183, baseType: !157, size: 64, offset: 1856)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!36, !51, !160, !26, !161, !153}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 40, baseType: !163)
!162 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !79, line: 129, baseType: !164)
!164 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !140, file: !141, line: 185, baseType: !36, size: 32, offset: 1920)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !140, file: !141, line: 186, baseType: !37, size: 64, offset: 1984)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !140, file: !141, line: 187, baseType: !168, size: 768, offset: 2048)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !169, line: 42, size: 768, elements: !170)
!169 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !168, file: !169, line: 44, baseType: !37, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !168, file: !169, line: 45, baseType: !37, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !168, file: !169, line: 46, baseType: !37, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !168, file: !169, line: 47, baseType: !37, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !168, file: !169, line: 48, baseType: !37, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !168, file: !169, line: 49, baseType: !37, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !168, file: !169, line: 50, baseType: !37, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !168, file: !169, line: 51, baseType: !37, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !168, file: !169, line: 52, baseType: !37, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !168, file: !169, line: 53, baseType: !37, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !168, file: !169, line: 54, baseType: !28, size: 8, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !168, file: !169, line: 55, baseType: !28, size: 8, offset: 648)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !168, file: !169, line: 56, baseType: !28, size: 8, offset: 656)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !168, file: !169, line: 57, baseType: !28, size: 8, offset: 664)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !168, file: !169, line: 58, baseType: !28, size: 8, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !168, file: !169, line: 59, baseType: !28, size: 8, offset: 680)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !168, file: !169, line: 60, baseType: !28, size: 8, offset: 688)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !168, file: !169, line: 61, baseType: !28, size: 8, offset: 696)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !168, file: !169, line: 62, baseType: !28, size: 8, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !168, file: !169, line: 63, baseType: !28, size: 8, offset: 712)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !168, file: !169, line: 64, baseType: !28, size: 8, offset: 720)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !168, file: !169, line: 65, baseType: !28, size: 8, offset: 728)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !168, file: !169, line: 66, baseType: !28, size: 8, offset: 736)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !168, file: !169, line: 67, baseType: !28, size: 8, offset: 744)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !140, file: !141, line: 189, baseType: !196, size: 16, offset: 2816)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 16, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 2)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !140, file: !141, line: 190, baseType: !200, size: 256, offset: 2832)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !201)
!201 = !{!147}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !140, file: !141, line: 191, baseType: !200, size: 256, offset: 3088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !52, file: !39, line: 585, baseType: !36, size: 32, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !52, file: !39, line: 587, baseType: !205, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !51}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !52, file: !39, line: 590, baseType: !209, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !39, line: 47, size: 256, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !210, file: !39, line: 49, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !210, file: !39, line: 50, baseType: !36, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !210, file: !39, line: 50, baseType: !36, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !210, file: !39, line: 50, baseType: !36, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !210, file: !39, line: 50, baseType: !36, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !210, file: !39, line: 51, baseType: !218, size: 32, offset: 192)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !103)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !52, file: !39, line: 591, baseType: !36, size: 32, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !52, file: !39, line: 592, baseType: !209, size: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !52, file: !39, line: 593, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !52, file: !39, line: 596, baseType: !36, size: 32, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !52, file: !39, line: 597, baseType: !37, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !52, file: !39, line: 632, baseType: !226, size: 2880, offset: 1152)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !39, line: 599, size: 2880, elements: !227)
!227 = !{!228, !278}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !226, file: !39, line: 622, baseType: !229, size: 1728)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !226, file: !39, line: 601, size: 1728, elements: !230)
!230 = !{!231, !232, !233, !237, !249, !250, !252, !260, !261, !262, !263, !267, !271, !272, !273, !274, !275, !276, !277}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !229, file: !39, line: 603, baseType: !7, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !229, file: !39, line: 604, baseType: !37, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !229, file: !39, line: 605, baseType: !234, size: 208, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 208, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 26)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !229, file: !39, line: 606, baseType: !238, size: 288, offset: 352)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !39, line: 55, size: 288, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !238, file: !39, line: 57, baseType: !36, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !238, file: !39, line: 58, baseType: !36, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !238, file: !39, line: 59, baseType: !36, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !238, file: !39, line: 60, baseType: !36, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !238, file: !39, line: 61, baseType: !36, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !238, file: !39, line: 62, baseType: !36, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !238, file: !39, line: 63, baseType: !36, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !238, file: !39, line: 64, baseType: !36, size: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !238, file: !39, line: 65, baseType: !36, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !229, file: !39, line: 607, baseType: !36, size: 32, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !229, file: !39, line: 608, baseType: !251, size: 64, offset: 704)
!251 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !229, file: !39, line: 609, baseType: !253, size: 112, offset: 768)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !39, line: 319, size: 112, elements: !254)
!254 = !{!255, !258, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !253, file: !39, line: 320, baseType: !256, size: 48)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 48, elements: !99)
!257 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !253, file: !39, line: 321, baseType: !256, size: 48, offset: 48)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !253, file: !39, line: 322, baseType: !257, size: 16, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !229, file: !39, line: 610, baseType: !115, size: 64, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !229, file: !39, line: 611, baseType: !115, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !229, file: !39, line: 612, baseType: !115, size: 64, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !229, file: !39, line: 613, baseType: !264, size: 64, offset: 1088)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !229, file: !39, line: 614, baseType: !268, size: 192, offset: 1152)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !229, file: !39, line: 615, baseType: !36, size: 32, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !229, file: !39, line: 616, baseType: !115, size: 64, offset: 1376)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !229, file: !39, line: 617, baseType: !115, size: 64, offset: 1440)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !229, file: !39, line: 618, baseType: !115, size: 64, offset: 1504)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !229, file: !39, line: 619, baseType: !115, size: 64, offset: 1568)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !229, file: !39, line: 620, baseType: !115, size: 64, offset: 1632)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !229, file: !39, line: 621, baseType: !36, size: 32, offset: 1696)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !226, file: !39, line: 631, baseType: !279, size: 2880)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !226, file: !39, line: 626, size: 2880, elements: !280)
!280 = !{!281, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !279, file: !39, line: 629, baseType: !282, size: 1920)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1920, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 30)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !279, file: !39, line: 630, baseType: !286, size: 960, offset: 1920)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !283)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !52, file: !39, line: 636, baseType: !288, size: 64, offset: 4032)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !39, line: 93, size: 6336, elements: !290)
!290 = !{!291, !292, !293, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !289, file: !39, line: 94, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !289, file: !39, line: 95, baseType: !36, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !289, file: !39, line: 97, baseType: !294, size: 2048, offset: 128)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 2048, elements: !201)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !289, file: !39, line: 98, baseType: !299, size: 4160, offset: 2176)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !39, line: 74, size: 4160, elements: !300)
!300 = !{!301, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !299, file: !39, line: 75, baseType: !302, size: 2048)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 2048, elements: !201)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !299, file: !39, line: 76, baseType: !302, size: 2048, offset: 2048)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !299, file: !39, line: 78, baseType: !38, size: 32, offset: 4096)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !299, file: !39, line: 81, baseType: !38, size: 32, offset: 4128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !52, file: !39, line: 637, baseType: !289, size: 6336, offset: 4096)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !52, file: !39, line: 641, baseType: !308, size: 64, offset: 10432)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !36}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !52, file: !39, line: 646, baseType: !313, size: 192, offset: 10496)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !39, line: 291, size: 192, elements: !314)
!314 = !{!315, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !313, file: !39, line: 293, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !313, file: !39, line: 294, baseType: !36, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !313, file: !39, line: 295, baseType: !56, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !52, file: !39, line: 648, baseType: !320, size: 4224, offset: 10688)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 4224, elements: !99)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPI", file: !6, line: 63, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPI", file: !6, line: 57, size: 160, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !325, file: !6, line: 58, baseType: !36, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !325, file: !6, line: 59, baseType: !36, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !325, file: !6, line: 60, baseType: !36, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rounding", scope: !325, file: !6, line: 61, baseType: !36, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sudden_underflow", scope: !325, file: !6, line: 62, baseType: !36, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Bigint", file: !33, line: 352, baseType: !210)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !337, line: 10, baseType: !139)
!337 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !363, !364, !365, !366, !367}
!339 = !DILocalVariable(name: "ptr", arg: 1, scope: !48, file: !3, line: 148, type: !51)
!340 = !DILocalVariable(name: "sp", arg: 2, scope: !48, file: !3, line: 148, type: !321)
!341 = !DILocalVariable(name: "fpi", arg: 3, scope: !48, file: !3, line: 148, type: !322)
!342 = !DILocalVariable(name: "exp", arg: 4, scope: !48, file: !3, line: 149, type: !332)
!343 = !DILocalVariable(name: "bp", arg: 5, scope: !48, file: !3, line: 149, type: !333)
!344 = !DILocalVariable(name: "sign", arg: 6, scope: !48, file: !3, line: 149, type: !36)
!345 = !DILocalVariable(name: "loc", arg: 7, scope: !48, file: !3, line: 149, type: !336)
!346 = !DILocalVariable(name: "b", scope: !48, file: !3, line: 151, type: !334)
!347 = !DILocalVariable(name: "decpt", scope: !48, file: !3, line: 152, type: !30)
!348 = !DILocalVariable(name: "s0", scope: !48, file: !3, line: 152, type: !30)
!349 = !DILocalVariable(name: "s", scope: !48, file: !3, line: 152, type: !30)
!350 = !DILocalVariable(name: "s1", scope: !48, file: !3, line: 152, type: !30)
!351 = !DILocalVariable(name: "esign", scope: !48, file: !3, line: 153, type: !36)
!352 = !DILocalVariable(name: "havedig", scope: !48, file: !3, line: 153, type: !36)
!353 = !DILocalVariable(name: "irv", scope: !48, file: !3, line: 153, type: !36)
!354 = !DILocalVariable(name: "k", scope: !48, file: !3, line: 153, type: !36)
!355 = !DILocalVariable(name: "n", scope: !48, file: !3, line: 153, type: !36)
!356 = !DILocalVariable(name: "nbits", scope: !48, file: !3, line: 153, type: !36)
!357 = !DILocalVariable(name: "up", scope: !48, file: !3, line: 153, type: !36)
!358 = !DILocalVariable(name: "zret", scope: !48, file: !3, line: 153, type: !36)
!359 = !DILocalVariable(name: "L", scope: !48, file: !3, line: 154, type: !38)
!360 = !DILocalVariable(name: "lostbits", scope: !48, file: !3, line: 154, type: !38)
!361 = !DILocalVariable(name: "x", scope: !48, file: !3, line: 154, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!363 = !DILocalVariable(name: "e", scope: !48, file: !3, line: 155, type: !32)
!364 = !DILocalVariable(name: "e1", scope: !48, file: !3, line: 155, type: !32)
!365 = !DILocalVariable(name: "decimalpoint", scope: !48, file: !3, line: 156, type: !24)
!366 = !DILocalVariable(name: "decp_len", scope: !48, file: !3, line: 158, type: !161)
!367 = !DILocalVariable(name: "decp_end", scope: !48, file: !3, line: 159, type: !25)
!368 = !DILocation(line: 148, column: 24, scope: !48)
!369 = !DILocation(line: 148, column: 42, scope: !48)
!370 = !DILocation(line: 148, column: 57, scope: !48)
!371 = !DILocation(line: 149, column: 8, scope: !48)
!372 = !DILocation(line: 149, column: 23, scope: !48)
!373 = !DILocation(line: 149, column: 31, scope: !48)
!374 = !DILocation(line: 149, column: 46, scope: !48)
!375 = !DILocation(line: 157, column: 11, scope: !48)
!376 = !DILocation(line: 157, column: 33, scope: !48)
!377 = !{!378, !379, i64 0}
