; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sharedObjectsStruct = type { %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, %struct.redisObject*, [10 x %struct.redisObject*], [10000 x %struct.redisObject*], [32 x %struct.redisObject*], [32 x %struct.redisObject*], i8*, i8* }
%struct.redisObject = type { i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !9, !10, !25, !35, !45}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !5, line: 60, baseType: !6)
!5 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !7, line: 105, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !12, line: 51, size: 24, elements: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !{!14, !18, !19, !20}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !12, line: 52, baseType: !15, size: 8)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5, line: 24, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !7, line: 43, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !11, file: !12, line: 53, baseType: !15, size: 8, offset: 8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !11, file: !12, line: 54, baseType: !17, size: 8, offset: 16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !11, file: !12, line: 55, baseType: !21, offset: 24)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !23)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: -1)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !12, line: 57, size: 40, elements: !27)
!27 = !{!28, !32, !33, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !12, line: 58, baseType: !29, size: 16)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !5, line: 36, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 57, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !26, file: !12, line: 59, baseType: !29, size: 16, offset: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !12, line: 60, baseType: !17, size: 8, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !26, file: !12, line: 61, baseType: !21, offset: 40)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !12, line: 63, size: 72, elements: !37)
!37 = !{!38, !42, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !12, line: 64, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5, line: 48, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !7, line: 79, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !36, file: !12, line: 65, baseType: !39, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !12, line: 66, baseType: !17, size: 8, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !36, file: !12, line: 67, baseType: !21, offset: 72)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !12, line: 69, size: 136, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !12, line: 70, baseType: !4, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !12, line: 71, baseType: !4, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !12, line: 72, baseType: !17, size: 8, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !12, line: 73, baseType: !21, offset: 136)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!56 = distinct !DISubprogram(name: "geoArrayCreate", scope: !1, file: !1, line: 53, type: !57, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !81)
!57 = !DISubroutineType(types: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "geoArray", file: !61, line: 20, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geo.h", directory: "/root/.unikraft/apps/redis/build")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "geoArray", file: !61, line: 16, size: 192, elements: !63)
!63 = !{!64, !75, !80}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !62, file: !61, line: 17, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "geoPoint", file: !61, line: 8, size: 320, elements: !67)
!67 = !{!68, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !66, file: !61, line: 9, baseType: !69, size: 64)
!69 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !66, file: !61, line: 10, baseType: !69, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !66, file: !61, line: 11, baseType: !69, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !66, file: !61, line: 12, baseType: !69, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "member", scope: !66, file: !61, line: 13, baseType: !74, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !62, file: !61, line: 18, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 40, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !79, line: 129, baseType: !8)
!79 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !62, file: !61, line: 19, baseType: !76, size: 64, offset: 128)
!81 = !{!82}
!82 = !DILocalVariable(name: "ga", scope: !56, file: !1, line: 54, type: !59)
!83 = !DILocation(line: 54, column: 20, scope: !56)
!84 = !DILocation(line: 54, column: 15, scope: !56)
!85 = !DILocation(line: 56, column: 9, scope: !56)
!86 = !DILocation(line: 56, column: 15, scope: !56)
!87 = !{!88, !89, i64 0}
!88 = !{!"geoArray", !89, i64 0, !92, i64 8, !92, i64 16}
!89 = !{!"any pointer", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !{!"long", !90, i64 0}
!93 = !DILocation(line: 57, column: 9, scope: !56)
!94 = !DILocation(line: 57, column: 17, scope: !56)
!95 = !{!92, !92, i64 0}
!96 = !DILocation(line: 59, column: 5, scope: !56)
!97 = distinct !DISubprogram(name: "geoArrayAppend", scope: !1, file: !1, line: 64, type: !98, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !102)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !59}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "geoPoint", file: !61, line: 14, baseType: !66)
!102 = !{!103, !104}
!103 = !DILocalVariable(name: "ga", arg: 1, scope: !97, file: !1, line: 64, type: !59)
!104 = !DILocalVariable(name: "gp", scope: !97, file: !1, line: 69, type: !100)
!105 = !DILocation(line: 64, column: 36, scope: !97)
!106 = !DILocation(line: 65, column: 13, scope: !107)
!107 = distinct !DILexicalBlock(scope: !97, file: !1, line: 65, column: 9)
!108 = !{!88, !92, i64 16}
!109 = !DILocation(line: 65, column: 25, scope: !107)
!110 = !{!88, !92, i64 8}
!111 = !DILocation(line: 65, column: 18, scope: !107)
!112 = !DILocation(line: 65, column: 9, scope: !97)
!113 = !DILocation(line: 69, column: 24, scope: !97)
!114 = !DILocation(line: 66, column: 36, scope: !115)
!115 = distinct !DILexicalBlock(scope: !107, file: !1, line: 65, column: 34)
!116 = !DILocation(line: 66, column: 59, scope: !115)
!117 = !DILocation(line: 66, column: 23, scope: !115)
!118 = !DILocation(line: 66, column: 21, scope: !115)
!119 = !DILocation(line: 67, column: 34, scope: !115)
!120 = !DILocation(line: 67, column: 56, scope: !115)
!121 = !DILocation(line: 67, column: 21, scope: !115)
!122 = !DILocation(line: 67, column: 19, scope: !115)
!123 = !DILocation(line: 68, column: 5, scope: !115)
!124 = !DILocation(line: 69, column: 34, scope: !97)
!125 = !DILocation(line: 69, column: 29, scope: !97)
!126 = !DILocation(line: 69, column: 15, scope: !97)
!127 = !DILocation(line: 70, column: 13, scope: !97)
!128 = !DILocation(line: 71, column: 5, scope: !97)
!129 = distinct !DISubprogram(name: "geoArrayFree", scope: !1, file: !1, line: 75, type: !130, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !59}
!132 = !{!133, !134}
!133 = !DILocalVariable(name: "ga", arg: 1, scope: !129, file: !1, line: 75, type: !59)
!134 = !DILocalVariable(name: "i", scope: !129, file: !1, line: 76, type: !76)
!135 = !DILocation(line: 75, column: 29, scope: !129)
!136 = !DILocation(line: 76, column: 12, scope: !129)
!137 = !DILocation(line: 77, column: 25, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 77, column: 5)
!139 = distinct !DILexicalBlock(scope: !129, file: !1, line: 77, column: 5)
!140 = !DILocation(line: 77, column: 19, scope: !138)
!141 = !DILocation(line: 0, scope: !129)
!142 = !DILocation(line: 77, column: 5, scope: !139)
!143 = !DILocation(line: 77, column: 57, scope: !138)
!144 = !{!145, !89, i64 32}
!145 = !{!"geoPoint", !146, i64 0, !146, i64 8, !146, i64 16, !146, i64 24, !89, i64 32}
!146 = !{!"double", !90, i64 0}
!147 = !DILocation(line: 77, column: 36, scope: !138)
!148 = !DILocation(line: 77, column: 32, scope: !138)
!149 = distinct !{!149, !142, !150}
!150 = !DILocation(line: 77, column: 63, scope: !139)
!151 = !DILocation(line: 78, column: 11, scope: !129)
!152 = !DILocation(line: 78, column: 5, scope: !129)
!153 = !DILocation(line: 79, column: 11, scope: !129)
!154 = !DILocation(line: 79, column: 5, scope: !129)
!155 = !DILocation(line: 80, column: 1, scope: !129)
!156 = distinct !DISubprogram(name: "decodeGeohash", scope: !1, file: !1, line: 85, type: !157, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !161)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !69, !160}
!159 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!161 = !{!162, !163, !164}
!162 = !DILocalVariable(name: "bits", arg: 1, scope: !156, file: !1, line: 85, type: !69)
!163 = !DILocalVariable(name: "xy", arg: 2, scope: !156, file: !1, line: 85, type: !160)
!164 = !DILocalVariable(name: "hash", scope: !156, file: !1, line: 86, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashBits", file: !166, line: 69, baseType: !167)
!166 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash.h", directory: "/root/.unikraft/apps/redis/build")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 66, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !167, file: !166, line: 67, baseType: !4, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !167, file: !166, line: 68, baseType: !15, size: 8, offset: 64)
!171 = !DILocation(line: 85, column: 26, scope: !156)
!172 = !DILocation(line: 85, column: 40, scope: !156)
!173 = !DILocation(line: 86, column: 34, scope: !156)
!174 = !DILocation(line: 86, column: 17, scope: !156)
!175 = !DILocation(line: 87, column: 12, scope: !156)
!176 = !DILocation(line: 87, column: 5, scope: !156)
!177 = distinct !DISubprogram(name: "extractLongLatOrReply", scope: !1, file: !1, line: 93, type: !178, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !418)
!178 = !DISubroutineType(types: !179)
!179 = !{!159, !180, !308, !160}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !182, line: 780, baseType: !183)
!182 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !182, line: 723, size: 135360, elements: !184)
!184 = !{!185, !186, !187, !291, !301, !303, !304, !305, !306, !307, !309, !333, !334, !335, !336, !337, !338, !340, !341, !344, !345, !346, !347, !348, !349, !350, !351, !356, !357, !358, !359, !360, !361, !362, !363, !367, !368, !372, !373, !389, !390, !407, !408, !409, !410, !411, !412, !413, !414}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !183, file: !182, line: 724, baseType: !4, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !183, file: !182, line: 725, baseType: !159, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !183, file: !182, line: 726, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !182, line: 656, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !182, line: 647, size: 512, elements: !191)
!191 = !{!192, !255, !256, !257, !258, !259, !260, !262}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !190, file: !182, line: 648, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !195, line: 82, baseType: !196)
!195 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !195, line: 76, size: 768, elements: !197)
!197 = !{!198, !223, !224, !253, !254}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !195, line: 77, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !195, line: 65, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !195, line: 58, size: 384, elements: !202)
!202 = !{!203, !209, !213, !214, !218, !222}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !201, file: !195, line: 59, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!4, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !201, file: !195, line: 60, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!9, !9, !207}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !201, file: !195, line: 61, baseType: !210, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !201, file: !195, line: 62, baseType: !215, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!159, !9, !207, !207}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !201, file: !195, line: 63, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !9, !9}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !201, file: !195, line: 64, baseType: !219, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !196, file: !195, line: 78, baseType: !9, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !196, file: !195, line: 79, baseType: !225, size: 512, offset: 128)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 512, elements: !251)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !195, line: 74, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !195, line: 69, size: 256, elements: !228)
!228 = !{!229, !248, !249, !250}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !227, file: !195, line: 70, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !195, line: 56, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !195, line: 47, size: 192, elements: !234)
!234 = !{!235, !236, !246}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !233, file: !195, line: 48, baseType: !9, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !233, file: !195, line: 54, baseType: !237, size: 64, offset: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !195, line: 49, size: 64, elements: !238)
!238 = !{!239, !240, !241, !245}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !237, file: !195, line: 50, baseType: !9, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !237, file: !195, line: 51, baseType: !4, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !237, file: !195, line: 52, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !5, line: 56, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !7, line: 103, baseType: !244)
!244 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !237, file: !195, line: 53, baseType: !69, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !195, line: 55, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !227, file: !195, line: 71, baseType: !8, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !227, file: !195, line: 72, baseType: !8, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !227, file: !195, line: 73, baseType: !8, size: 64, offset: 192)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !196, file: !195, line: 80, baseType: !244, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !196, file: !195, line: 81, baseType: !8, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !190, file: !182, line: 649, baseType: !193, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !190, file: !182, line: 650, baseType: !193, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !190, file: !182, line: 651, baseType: !193, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !190, file: !182, line: 652, baseType: !193, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !182, line: 653, baseType: !159, size: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !190, file: !182, line: 654, baseType: !261, size: 64, offset: 384)
!261 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !190, file: !182, line: 655, baseType: !263, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !265, line: 54, baseType: !266)
!265 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !265, line: 47, size: 384, elements: !267)
!267 = !{!268, !277, !278, !282, !286, !290}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !266, file: !265, line: 48, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !265, line: 40, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !265, line: 36, size: 192, elements: !272)
!272 = !{!273, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !265, line: 37, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !265, line: 38, baseType: !274, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !271, file: !265, line: 39, baseType: !9, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !266, file: !265, line: 49, baseType: !269, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !266, file: !265, line: 50, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!9, !9}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !266, file: !265, line: 51, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !9}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !266, file: !265, line: 52, baseType: !287, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!159, !9, !9}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !266, file: !265, line: 53, baseType: !8, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !182, line: 727, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !182, line: 622, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !182, line: 614, size: 128, elements: !295)
!295 = !{!296, !297, !298, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !182, line: 615, baseType: !41, size: 4, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !294, file: !182, line: 616, baseType: !41, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !294, file: !182, line: 617, baseType: !41, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !294, file: !182, line: 620, baseType: !159, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !294, file: !182, line: 621, baseType: !9, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !183, file: !182, line: 728, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !12, line: 43, baseType: !74)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !183, file: !182, line: 729, baseType: !76, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !183, file: !182, line: 730, baseType: !302, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !183, file: !182, line: 734, baseType: !76, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !183, file: !182, line: 735, baseType: !159, size: 32, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !183, file: !182, line: 736, baseType: !308, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !183, file: !182, line: 737, baseType: !310, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !182, line: 1307, size: 640, elements: !312)
!312 = !{!313, !314, !319, !320, !321, !322, !328, !329, !330, !331, !332}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !182, line: 1308, baseType: !74, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !311, file: !182, line: 1309, baseType: !315, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !182, line: 1305, baseType: !317)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !180}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !311, file: !182, line: 1310, baseType: !159, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !311, file: !182, line: 1311, baseType: !74, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !182, line: 1312, baseType: !159, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !311, file: !182, line: 1315, baseType: !323, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !182, line: 1306, baseType: !325)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !310, !308, !159, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !311, file: !182, line: 1317, baseType: !159, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !311, file: !182, line: 1318, baseType: !159, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !311, file: !182, line: 1319, baseType: !159, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !311, file: !182, line: 1320, baseType: !261, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !311, file: !182, line: 1320, baseType: !261, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !183, file: !182, line: 737, baseType: !310, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !183, file: !182, line: 738, baseType: !159, size: 32, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !183, file: !182, line: 739, baseType: !159, size: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !183, file: !182, line: 740, baseType: !244, size: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !183, file: !182, line: 741, baseType: !263, size: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !183, file: !182, line: 742, baseType: !339, size: 64, offset: 960)
!339 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !183, file: !182, line: 743, baseType: !76, size: 64, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !183, file: !182, line: 745, baseType: !342, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !343, line: 34, baseType: !244)
!343 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !183, file: !182, line: 746, baseType: !342, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !183, file: !182, line: 747, baseType: !342, size: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !183, file: !182, line: 748, baseType: !159, size: 32, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !183, file: !182, line: 749, baseType: !159, size: 32, offset: 1312)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !183, file: !182, line: 750, baseType: !159, size: 32, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !183, file: !182, line: 751, baseType: !159, size: 32, offset: 1376)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !183, file: !182, line: 752, baseType: !159, size: 32, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !183, file: !182, line: 753, baseType: !352, size: 64, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !353, line: 173, baseType: !354)
!353 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 100, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !79, line: 44, baseType: !244)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !183, file: !182, line: 754, baseType: !352, size: 64, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !183, file: !182, line: 755, baseType: !302, size: 64, offset: 1600)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !183, file: !182, line: 756, baseType: !261, size: 64, offset: 1664)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !183, file: !182, line: 757, baseType: !261, size: 64, offset: 1728)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !183, file: !182, line: 758, baseType: !261, size: 64, offset: 1792)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !183, file: !182, line: 759, baseType: !261, size: 64, offset: 1856)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !183, file: !182, line: 760, baseType: !261, size: 64, offset: 1920)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !183, file: !182, line: 763, baseType: !364, size: 328, offset: 1984)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 328, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 41)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !183, file: !182, line: 764, baseType: !159, size: 32, offset: 2336)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !183, file: !182, line: 765, baseType: !369, size: 368, offset: 2368)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 368, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 46)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !183, file: !182, line: 766, baseType: !159, size: 32, offset: 2752)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !183, file: !182, line: 767, baseType: !374, size: 256, offset: 2816)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !182, line: 673, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !182, line: 665, size: 256, elements: !376)
!376 = !{!377, !385, !386, !387, !388}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !375, file: !182, line: 666, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !182, line: 663, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !182, line: 659, size: 192, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !380, file: !182, line: 660, baseType: !308, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !380, file: !182, line: 661, baseType: !159, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !380, file: !182, line: 662, baseType: !310, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !375, file: !182, line: 667, baseType: !159, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !375, file: !182, line: 668, baseType: !159, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !375, file: !182, line: 671, baseType: !159, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !375, file: !182, line: 672, baseType: !342, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !183, file: !182, line: 768, baseType: !159, size: 32, offset: 3072)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !183, file: !182, line: 769, baseType: !391, size: 704, offset: 3136)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !182, line: 703, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !182, line: 677, size: 704, elements: !393)
!393 = !{!394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !392, file: !182, line: 679, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !182, line: 52, baseType: !261)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !392, file: !182, line: 683, baseType: !193, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !392, file: !182, line: 685, baseType: !292, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !392, file: !182, line: 689, baseType: !76, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !392, file: !182, line: 690, baseType: !292, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !392, file: !182, line: 691, baseType: !292, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !392, file: !182, line: 692, baseType: !395, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !392, file: !182, line: 692, baseType: !395, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !392, file: !182, line: 693, baseType: !159, size: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !392, file: !182, line: 696, baseType: !159, size: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !392, file: !182, line: 697, baseType: !261, size: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !392, file: !182, line: 700, baseType: !9, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !183, file: !182, line: 770, baseType: !261, size: 64, offset: 3840)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !183, file: !182, line: 771, baseType: !263, size: 64, offset: 3904)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !183, file: !182, line: 772, baseType: !193, size: 64, offset: 3968)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !183, file: !182, line: 773, baseType: !263, size: 64, offset: 4032)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !183, file: !182, line: 774, baseType: !302, size: 64, offset: 4096)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !183, file: !182, line: 775, baseType: !269, size: 64, offset: 4160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !183, file: !182, line: 778, baseType: !159, size: 32, offset: 4224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !183, file: !182, line: 779, baseType: !415, size: 131072, offset: 4256)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 131072, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 16384)
!418 = !{!419, !420, !421, !422}
!419 = !DILocalVariable(name: "c", arg: 1, scope: !177, file: !1, line: 93, type: !180)
!420 = !DILocalVariable(name: "argv", arg: 2, scope: !177, file: !1, line: 93, type: !308)
!421 = !DILocalVariable(name: "xy", arg: 3, scope: !177, file: !1, line: 93, type: !160)
!422 = !DILocalVariable(name: "i", scope: !177, file: !1, line: 94, type: !159)
!423 = !DILocation(line: 93, column: 35, scope: !177)
!424 = !DILocation(line: 93, column: 45, scope: !177)
!425 = !DILocation(line: 93, column: 59, scope: !177)
!426 = !DILocation(line: 94, column: 9, scope: !177)
!427 = !DILocation(line: 96, column: 43, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 96, column: 13)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 95, column: 29)
!430 = distinct !DILexicalBlock(scope: !431, file: !1, line: 95, column: 5)
!431 = distinct !DILexicalBlock(scope: !177, file: !1, line: 95, column: 5)
!432 = !{!89, !89, i64 0}
!433 = !DILocation(line: 96, column: 13, scope: !428)
!434 = !DILocation(line: 96, column: 66, scope: !428)
!435 = !DILocation(line: 96, column: 13, scope: !429)
!436 = !DILocation(line: 96, column: 55, scope: !428)
!437 = !DILocation(line: 102, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !177, file: !1, line: 101, column: 9)
!439 = !{!146, !146, i64 0}
!440 = !DILocation(line: 102, column: 15, scope: !438)
!441 = !DILocation(line: 102, column: 39, scope: !438)
!442 = !DILocation(line: 102, column: 30, scope: !438)
!443 = !DILocation(line: 103, column: 37, scope: !444)
!444 = distinct !DILexicalBlock(scope: !438, file: !1, line: 102, column: 54)
!445 = !DILocation(line: 104, column: 62, scope: !444)
!446 = !DILocation(line: 104, column: 68, scope: !444)
!447 = !DILocation(line: 103, column: 24, scope: !444)
!448 = !DILocation(line: 103, column: 9, scope: !444)
!449 = !DILocation(line: 105, column: 9, scope: !444)
!450 = !DILocation(line: 0, scope: !177)
!451 = !DILocation(line: 108, column: 1, scope: !177)
!452 = !DILocation(line: 101, column: 9, scope: !438)
!453 = !DILocation(line: 101, column: 15, scope: !438)
!454 = !DILocation(line: 101, column: 39, scope: !438)
!455 = !DILocation(line: 101, column: 30, scope: !438)
!456 = distinct !DISubprogram(name: "longLatFromMember", scope: !1, file: !1, line: 113, type: !457, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{!159, !292, !292, !160}
!459 = !{!460, !461, !462, !463}
!460 = !DILocalVariable(name: "zobj", arg: 1, scope: !456, file: !1, line: 113, type: !292)
!461 = !DILocalVariable(name: "member", arg: 2, scope: !456, file: !1, line: 113, type: !292)
!462 = !DILocalVariable(name: "xy", arg: 3, scope: !456, file: !1, line: 113, type: !160)
!463 = !DILocalVariable(name: "score", scope: !456, file: !1, line: 114, type: !69)
!464 = !DILocation(line: 113, column: 29, scope: !456)
!465 = !DILocation(line: 113, column: 41, scope: !456)
!466 = !DILocation(line: 113, column: 57, scope: !456)
!467 = !DILocation(line: 114, column: 5, scope: !456)
!468 = !DILocation(line: 114, column: 12, scope: !456)
!469 = !DILocation(line: 116, column: 33, scope: !470)
!470 = distinct !DILexicalBlock(scope: !456, file: !1, line: 116, column: 9)
!471 = !{!472, !89, i64 8}
!472 = !{!"redisObject", !473, i64 0, !473, i64 0, !473, i64 1, !473, i64 4, !89, i64 8}
!473 = !{!"int", !90, i64 0}
!474 = !DILocation(line: 116, column: 9, scope: !470)
!475 = !DILocation(line: 116, column: 46, scope: !470)
!476 = !DILocation(line: 116, column: 9, scope: !456)
!477 = !DILocation(line: 117, column: 24, scope: !478)
!478 = distinct !DILexicalBlock(scope: !456, file: !1, line: 117, column: 9)
!479 = !DILocation(line: 85, column: 26, scope: !156, inlinedAt: !480)
!480 = distinct !DILocation(line: 117, column: 10, scope: !478)
!481 = !DILocation(line: 85, column: 40, scope: !156, inlinedAt: !480)
!482 = !DILocation(line: 86, column: 34, scope: !156, inlinedAt: !480)
!483 = !DILocation(line: 86, column: 17, scope: !156, inlinedAt: !480)
!484 = !DILocation(line: 87, column: 12, scope: !156, inlinedAt: !480)
!485 = !DILocation(line: 117, column: 10, scope: !478)
!486 = !DILocation(line: 117, column: 36, scope: !478)
!487 = !DILocation(line: 0, scope: !478)
!488 = !DILocation(line: 119, column: 1, scope: !456)
!489 = distinct !DISubprogram(name: "extractUnitOrReply", scope: !1, file: !1, line: 127, type: !490, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{!69, !180, !292}
!492 = !{!493, !494, !495}
!493 = !DILocalVariable(name: "c", arg: 1, scope: !489, file: !1, line: 127, type: !180)
!494 = !DILocalVariable(name: "unit", arg: 2, scope: !489, file: !1, line: 127, type: !292)
!495 = !DILocalVariable(name: "u", scope: !489, file: !1, line: 128, type: !74)
!496 = !DILocation(line: 127, column: 35, scope: !489)
!497 = !DILocation(line: 127, column: 44, scope: !489)
!498 = !DILocation(line: 128, column: 21, scope: !489)
!499 = !DILocation(line: 128, column: 11, scope: !489)
!500 = !DILocation(line: 130, column: 10, scope: !501)
!501 = distinct !DILexicalBlock(scope: !489, file: !1, line: 130, column: 9)
!502 = !DILocation(line: 130, column: 9, scope: !489)
!503 = !DILocation(line: 132, column: 17, scope: !504)
!504 = distinct !DILexicalBlock(scope: !501, file: !1, line: 132, column: 16)
!505 = !DILocation(line: 132, column: 16, scope: !501)
!506 = !DILocation(line: 134, column: 17, scope: !507)
!507 = distinct !DILexicalBlock(scope: !504, file: !1, line: 134, column: 16)
!508 = !DILocation(line: 134, column: 16, scope: !504)
!509 = !DILocation(line: 136, column: 17, scope: !510)
!510 = distinct !DILexicalBlock(scope: !507, file: !1, line: 136, column: 16)
!511 = !DILocation(line: 136, column: 16, scope: !507)
!512 = !DILocation(line: 139, column: 9, scope: !513)
!513 = distinct !DILexicalBlock(scope: !510, file: !1, line: 138, column: 12)
!514 = !DILocation(line: 141, column: 9, scope: !513)
!515 = !DILocation(line: 0, scope: !516)
!516 = distinct !DILexicalBlock(scope: !501, file: !1, line: 130, column: 26)
!517 = !DILocation(line: 143, column: 1, scope: !489)
!518 = distinct !DISubprogram(name: "extractDistanceOrReply", scope: !1, file: !1, line: 152, type: !519, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!69, !180, !308, !160}
!521 = !{!522, !523, !524, !525, !526}
!522 = !DILocalVariable(name: "c", arg: 1, scope: !518, file: !1, line: 152, type: !180)
!523 = !DILocalVariable(name: "argv", arg: 2, scope: !518, file: !1, line: 152, type: !308)
!524 = !DILocalVariable(name: "conversion", arg: 3, scope: !518, file: !1, line: 153, type: !160)
!525 = !DILocalVariable(name: "distance", scope: !518, file: !1, line: 154, type: !69)
!526 = !DILocalVariable(name: "to_meters", scope: !518, file: !1, line: 165, type: !69)
!527 = !DILocation(line: 152, column: 39, scope: !518)
!528 = !DILocation(line: 152, column: 49, scope: !518)
!529 = !DILocation(line: 153, column: 46, scope: !518)
!530 = !DILocation(line: 154, column: 5, scope: !518)
!531 = !DILocation(line: 155, column: 39, scope: !532)
!532 = distinct !DILexicalBlock(scope: !518, file: !1, line: 155, column: 9)
!533 = !DILocation(line: 154, column: 12, scope: !518)
!534 = !DILocation(line: 155, column: 9, scope: !532)
!535 = !DILocation(line: 156, column: 59, scope: !532)
!536 = !DILocation(line: 155, column: 9, scope: !518)
!537 = !DILocation(line: 160, column: 9, scope: !538)
!538 = distinct !DILexicalBlock(scope: !518, file: !1, line: 160, column: 9)
!539 = !DILocation(line: 160, column: 18, scope: !538)
!540 = !DILocation(line: 160, column: 9, scope: !518)
!541 = !DILocation(line: 161, column: 9, scope: !542)
!542 = distinct !DILexicalBlock(scope: !538, file: !1, line: 160, column: 23)
!543 = !DILocation(line: 162, column: 9, scope: !542)
!544 = !DILocation(line: 165, column: 45, scope: !518)
!545 = !DILocation(line: 127, column: 35, scope: !489, inlinedAt: !546)
!546 = distinct !DILocation(line: 165, column: 24, scope: !518)
!547 = !DILocation(line: 127, column: 44, scope: !489, inlinedAt: !546)
!548 = !DILocation(line: 128, column: 21, scope: !489, inlinedAt: !546)
!549 = !DILocation(line: 128, column: 11, scope: !489, inlinedAt: !546)
!550 = !DILocation(line: 130, column: 10, scope: !501, inlinedAt: !546)
!551 = !DILocation(line: 130, column: 9, scope: !489, inlinedAt: !546)
!552 = !DILocation(line: 132, column: 17, scope: !504, inlinedAt: !546)
!553 = !DILocation(line: 132, column: 16, scope: !501, inlinedAt: !546)
!554 = !DILocation(line: 134, column: 17, scope: !507, inlinedAt: !546)
!555 = !DILocation(line: 134, column: 16, scope: !504, inlinedAt: !546)
!556 = !DILocation(line: 136, column: 17, scope: !510, inlinedAt: !546)
!557 = !DILocation(line: 136, column: 16, scope: !507, inlinedAt: !546)
!558 = !DILocation(line: 139, column: 9, scope: !513, inlinedAt: !546)
!559 = !DILocation(line: 165, column: 12, scope: !518)
!560 = !DILocation(line: 166, column: 9, scope: !518)
!561 = !DILocation(line: 170, column: 9, scope: !562)
!562 = distinct !DILexicalBlock(scope: !518, file: !1, line: 170, column: 9)
!563 = !DILocation(line: 170, column: 9, scope: !518)
!564 = !DILocation(line: 170, column: 33, scope: !562)
!565 = !DILocation(line: 170, column: 21, scope: !562)
!566 = !DILocation(line: 171, column: 12, scope: !518)
!567 = !DILocation(line: 171, column: 21, scope: !518)
!568 = !DILocation(line: 171, column: 5, scope: !518)
!569 = !DILocation(line: 0, scope: !570)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 166, column: 24)
!571 = distinct !DILexicalBlock(scope: !518, file: !1, line: 166, column: 9)
!572 = !DILocation(line: 172, column: 1, scope: !518)
!573 = distinct !DISubprogram(name: "addReplyDoubleDistance", scope: !1, file: !1, line: 179, type: !574, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !180, !69}
!576 = !{!577, !578, !579, !583}
!577 = !DILocalVariable(name: "c", arg: 1, scope: !573, file: !1, line: 179, type: !180)
!578 = !DILocalVariable(name: "d", arg: 2, scope: !573, file: !1, line: 179, type: !69)
!579 = !DILocalVariable(name: "dbuf", scope: !573, file: !1, line: 180, type: !580)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 128)
!583 = !DILocalVariable(name: "dlen", scope: !573, file: !1, line: 181, type: !159)
!584 = !DILocation(line: 179, column: 37, scope: !573)
!585 = !DILocation(line: 179, column: 47, scope: !573)
!586 = !DILocation(line: 180, column: 5, scope: !573)
!587 = !DILocation(line: 180, column: 10, scope: !573)
!588 = !DILocation(line: 181, column: 16, scope: !573)
!589 = !DILocation(line: 181, column: 9, scope: !573)
!590 = !DILocation(line: 182, column: 34, scope: !573)
!591 = !DILocation(line: 182, column: 5, scope: !573)
!592 = !DILocation(line: 183, column: 1, scope: !573)
!593 = distinct !DISubprogram(name: "geoAppendIfWithinRadius", scope: !1, file: !1, line: 191, type: !594, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!159, !59, !69, !69, !69, !69, !302}
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !606}
!597 = !DILocalVariable(name: "ga", arg: 1, scope: !593, file: !1, line: 191, type: !59)
!598 = !DILocalVariable(name: "lon", arg: 2, scope: !593, file: !1, line: 191, type: !69)
!599 = !DILocalVariable(name: "lat", arg: 3, scope: !593, file: !1, line: 191, type: !69)
!600 = !DILocalVariable(name: "radius", arg: 4, scope: !593, file: !1, line: 191, type: !69)
!601 = !DILocalVariable(name: "score", arg: 5, scope: !593, file: !1, line: 191, type: !69)
!602 = !DILocalVariable(name: "member", arg: 6, scope: !593, file: !1, line: 191, type: !302)
!603 = !DILocalVariable(name: "distance", scope: !593, file: !1, line: 192, type: !69)
!604 = !DILocalVariable(name: "xy", scope: !593, file: !1, line: 192, type: !605)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !251)
!606 = !DILocalVariable(name: "gp", scope: !593, file: !1, line: 204, type: !100)
!607 = !DILocation(line: 191, column: 39, scope: !593)
!608 = !DILocation(line: 191, column: 50, scope: !593)
!609 = !DILocation(line: 191, column: 62, scope: !593)
!610 = !DILocation(line: 191, column: 74, scope: !593)
!611 = !DILocation(line: 191, column: 89, scope: !593)
!612 = !DILocation(line: 191, column: 100, scope: !593)
!613 = !DILocation(line: 192, column: 5, scope: !593)
!614 = !DILocation(line: 192, column: 22, scope: !593)
!615 = !DILocation(line: 194, column: 30, scope: !616)
!616 = distinct !DILexicalBlock(scope: !593, file: !1, line: 194, column: 9)
!617 = !DILocation(line: 85, column: 26, scope: !156, inlinedAt: !618)
!618 = distinct !DILocation(line: 194, column: 10, scope: !616)
!619 = !DILocation(line: 85, column: 40, scope: !156, inlinedAt: !618)
!620 = !DILocation(line: 86, column: 34, scope: !156, inlinedAt: !618)
!621 = !DILocation(line: 86, column: 17, scope: !156, inlinedAt: !618)
!622 = !DILocation(line: 87, column: 12, scope: !156, inlinedAt: !618)
!623 = !DILocation(line: 194, column: 10, scope: !616)
!624 = !DILocation(line: 194, column: 9, scope: !593)
!625 = !DILocation(line: 197, column: 53, scope: !626)
!626 = distinct !DILexicalBlock(scope: !593, file: !1, line: 197, column: 9)
!627 = !DILocation(line: 197, column: 60, scope: !626)
!628 = !DILocation(line: 192, column: 12, scope: !593)
!629 = !DILocation(line: 197, column: 10, scope: !626)
!630 = !DILocation(line: 197, column: 9, scope: !593)
!631 = !DILocation(line: 64, column: 36, scope: !97, inlinedAt: !632)
!632 = distinct !DILocation(line: 204, column: 20, scope: !593)
!633 = !DILocation(line: 65, column: 13, scope: !107, inlinedAt: !632)
!634 = !DILocation(line: 65, column: 25, scope: !107, inlinedAt: !632)
!635 = !DILocation(line: 65, column: 18, scope: !107, inlinedAt: !632)
!636 = !DILocation(line: 65, column: 9, scope: !97, inlinedAt: !632)
!637 = !DILocation(line: 69, column: 24, scope: !97, inlinedAt: !632)
!638 = !DILocation(line: 66, column: 36, scope: !115, inlinedAt: !632)
!639 = !DILocation(line: 66, column: 59, scope: !115, inlinedAt: !632)
!640 = !DILocation(line: 66, column: 23, scope: !115, inlinedAt: !632)
!641 = !DILocation(line: 66, column: 21, scope: !115, inlinedAt: !632)
!642 = !DILocation(line: 67, column: 34, scope: !115, inlinedAt: !632)
!643 = !DILocation(line: 67, column: 56, scope: !115, inlinedAt: !632)
!644 = !DILocation(line: 67, column: 21, scope: !115, inlinedAt: !632)
!645 = !DILocation(line: 67, column: 19, scope: !115, inlinedAt: !632)
!646 = !DILocation(line: 68, column: 5, scope: !115, inlinedAt: !632)
!647 = !DILocation(line: 69, column: 34, scope: !97, inlinedAt: !632)
!648 = !DILocation(line: 69, column: 29, scope: !97, inlinedAt: !632)
!649 = !DILocation(line: 69, column: 15, scope: !97, inlinedAt: !632)
!650 = !DILocation(line: 70, column: 13, scope: !97, inlinedAt: !632)
!651 = !DILocation(line: 204, column: 15, scope: !593)
!652 = !DILocation(line: 205, column: 21, scope: !593)
!653 = !DILocation(line: 205, column: 19, scope: !593)
!654 = !{!145, !146, i64 0}
!655 = !DILocation(line: 206, column: 20, scope: !593)
!656 = !DILocation(line: 206, column: 9, scope: !593)
!657 = !DILocation(line: 206, column: 18, scope: !593)
!658 = !{!145, !146, i64 8}
!659 = !DILocation(line: 207, column: 16, scope: !593)
!660 = !DILocation(line: 207, column: 9, scope: !593)
!661 = !DILocation(line: 207, column: 14, scope: !593)
!662 = !{!145, !146, i64 16}
!663 = !DILocation(line: 208, column: 9, scope: !593)
!664 = !DILocation(line: 208, column: 16, scope: !593)
!665 = !DILocation(line: 209, column: 9, scope: !593)
!666 = !DILocation(line: 209, column: 15, scope: !593)
!667 = !{!145, !146, i64 24}
!668 = !DILocation(line: 0, scope: !616)
!669 = !DILocation(line: 211, column: 1, scope: !593)
!670 = distinct !DISubprogram(name: "geoGetPointsInRange", scope: !1, file: !1, line: 225, type: !671, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!159, !292, !69, !69, !69, !69, !69, !59}
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !689, !690, !691, !695, !696, !697, !698, !699, !700, !701, !730, !731, !734}
!674 = !DILocalVariable(name: "zobj", arg: 1, scope: !670, file: !1, line: 225, type: !292)
!675 = !DILocalVariable(name: "min", arg: 2, scope: !670, file: !1, line: 225, type: !69)
!676 = !DILocalVariable(name: "max", arg: 3, scope: !670, file: !1, line: 225, type: !69)
!677 = !DILocalVariable(name: "lon", arg: 4, scope: !670, file: !1, line: 225, type: !69)
!678 = !DILocalVariable(name: "lat", arg: 5, scope: !670, file: !1, line: 225, type: !69)
!679 = !DILocalVariable(name: "radius", arg: 6, scope: !670, file: !1, line: 225, type: !69)
!680 = !DILocalVariable(name: "ga", arg: 7, scope: !670, file: !1, line: 225, type: !59)
!681 = !DILocalVariable(name: "range", scope: !670, file: !1, line: 228, type: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "zrangespec", file: !182, line: 1675, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !182, line: 1672, size: 192, elements: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !683, file: !182, line: 1673, baseType: !69, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !683, file: !182, line: 1673, baseType: !69, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "minex", scope: !683, file: !182, line: 1674, baseType: !159, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "maxex", scope: !683, file: !182, line: 1674, baseType: !159, size: 32, offset: 160)
!689 = !DILocalVariable(name: "origincount", scope: !670, file: !1, line: 229, type: !76)
!690 = !DILocalVariable(name: "member", scope: !670, file: !1, line: 230, type: !302)
!691 = !DILocalVariable(name: "zl", scope: !692, file: !1, line: 233, type: !694)
!692 = distinct !DILexicalBlock(scope: !693, file: !1, line: 232, column: 49)
!693 = distinct !DILexicalBlock(scope: !670, file: !1, line: 232, column: 9)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!695 = !DILocalVariable(name: "eptr", scope: !692, file: !1, line: 234, type: !694)
!696 = !DILocalVariable(name: "sptr", scope: !692, file: !1, line: 234, type: !694)
!697 = !DILocalVariable(name: "vstr", scope: !692, file: !1, line: 235, type: !694)
!698 = !DILocalVariable(name: "vlen", scope: !692, file: !1, line: 236, type: !41)
!699 = !DILocalVariable(name: "vlong", scope: !692, file: !1, line: 237, type: !261)
!700 = !DILocalVariable(name: "score", scope: !692, file: !1, line: 238, type: !69)
!701 = !DILocalVariable(name: "zs", scope: !702, file: !1, line: 262, type: !704)
!702 = distinct !DILexicalBlock(scope: !703, file: !1, line: 261, column: 57)
!703 = distinct !DILexicalBlock(scope: !693, file: !1, line: 261, column: 16)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !182, line: 829, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !182, line: 826, size: 128, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !706, file: !182, line: 827, baseType: !193, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !706, file: !182, line: 828, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !182, line: 824, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !182, line: 820, size: 256, elements: !713)
!713 = !{!714, !727, !728, !729}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !712, file: !182, line: 821, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !182, line: 810, size: 192, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !716, file: !182, line: 811, baseType: !302, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !716, file: !182, line: 812, baseType: !69, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !716, file: !182, line: 813, baseType: !715, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !716, file: !182, line: 817, baseType: !722, offset: 192)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, elements: !23)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !182, line: 814, size: 128, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !723, file: !182, line: 815, baseType: !715, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !723, file: !182, line: 816, baseType: !8, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !712, file: !182, line: 821, baseType: !715, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !712, file: !182, line: 822, baseType: !8, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !712, file: !182, line: 823, baseType: !159, size: 32, offset: 192)
!730 = !DILocalVariable(name: "zsl", scope: !702, file: !1, line: 263, type: !710)
!731 = !DILocalVariable(name: "ln", scope: !702, file: !1, line: 264, type: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplistNode", file: !182, line: 818, baseType: !716)
!734 = !DILocalVariable(name: "ele", scope: !735, file: !1, line: 272, type: !302)
!735 = distinct !DILexicalBlock(scope: !702, file: !1, line: 271, column: 20)
!736 = !DILocation(line: 225, column: 31, scope: !670)
!737 = !DILocation(line: 225, column: 44, scope: !670)
!738 = !DILocation(line: 225, column: 56, scope: !670)
!739 = !DILocation(line: 225, column: 68, scope: !670)
!740 = !DILocation(line: 225, column: 80, scope: !670)
!741 = !DILocation(line: 225, column: 92, scope: !670)
!742 = !DILocation(line: 225, column: 110, scope: !670)
!743 = !DILocation(line: 228, column: 5, scope: !670)
!744 = !DILocation(line: 228, column: 24, scope: !670)
!745 = !{!746, !146, i64 0}
!746 = !{!"", !146, i64 0, !146, i64 8, !473, i64 16, !473, i64 20}
!747 = !{!746, !146, i64 8}
!748 = !{!746, !473, i64 16}
!749 = !{!746, !473, i64 20}
!750 = !DILocation(line: 229, column: 30, scope: !670)
!751 = !DILocation(line: 229, column: 12, scope: !670)
!752 = !DILocation(line: 232, column: 15, scope: !693)
!753 = !DILocation(line: 232, column: 9, scope: !670)
!754 = !DILocation(line: 233, column: 35, scope: !692)
!755 = !DILocation(line: 233, column: 24, scope: !692)
!756 = !DILocation(line: 234, column: 9, scope: !692)
!757 = !DILocation(line: 235, column: 9, scope: !692)
!758 = !DILocation(line: 235, column: 24, scope: !692)
!759 = !DILocation(line: 236, column: 9, scope: !692)
!760 = !DILocation(line: 236, column: 22, scope: !692)
!761 = !{!473, !473, i64 0}
!762 = !DILocation(line: 237, column: 9, scope: !692)
!763 = !DILocation(line: 237, column: 19, scope: !692)
!764 = !{!765, !765, i64 0}
!765 = !{!"long long", !90, i64 0}
!766 = !DILocation(line: 238, column: 16, scope: !692)
!767 = !DILocation(line: 228, column: 16, scope: !670)
!768 = !DILocation(line: 240, column: 21, scope: !769)
!769 = distinct !DILexicalBlock(scope: !692, file: !1, line: 240, column: 13)
!770 = !DILocation(line: 234, column: 24, scope: !692)
!771 = !DILocation(line: 240, column: 19, scope: !769)
!772 = !DILocation(line: 240, column: 50, scope: !769)
!773 = !DILocation(line: 240, column: 13, scope: !692)
!774 = !DILocation(line: 245, column: 16, scope: !692)
!775 = !DILocation(line: 234, column: 31, scope: !692)
!776 = !DILocation(line: 245, column: 14, scope: !692)
!777 = !DILocation(line: 247, column: 21, scope: !778)
!778 = distinct !DILexicalBlock(scope: !692, file: !1, line: 246, column: 22)
!779 = !DILocation(line: 250, column: 18, scope: !780)
!780 = distinct !DILexicalBlock(scope: !778, file: !1, line: 250, column: 17)
!781 = !DILocation(line: 250, column: 17, scope: !778)
!782 = !DILocation(line: 254, column: 24, scope: !778)
!783 = !DILocation(line: 254, column: 13, scope: !778)
!784 = !DILocation(line: 255, column: 23, scope: !778)
!785 = !DILocation(line: 255, column: 28, scope: !778)
!786 = !DILocation(line: 255, column: 22, scope: !778)
!787 = !DILocation(line: 255, column: 55, scope: !778)
!788 = !DILocation(line: 255, column: 39, scope: !778)
!789 = !DILocation(line: 256, column: 54, scope: !778)
!790 = !DILocation(line: 256, column: 39, scope: !778)
!791 = !DILocation(line: 230, column: 9, scope: !670)
!792 = !DILocation(line: 257, column: 17, scope: !793)
!793 = distinct !DILexicalBlock(scope: !778, file: !1, line: 257, column: 17)
!794 = !DILocation(line: 258, column: 17, scope: !793)
!795 = !DILocation(line: 257, column: 17, scope: !778)
!796 = !DILocation(line: 258, column: 27, scope: !793)
!797 = !DILocation(line: 259, column: 13, scope: !778)
!798 = !DILocation(line: 246, column: 16, scope: !692)
!799 = !DILocation(line: 246, column: 9, scope: !692)
!800 = distinct !{!800, !799, !801}
!801 = !DILocation(line: 260, column: 9, scope: !692)
!802 = !DILocation(line: 247, column: 33, scope: !778)
!803 = !DILocation(line: 261, column: 5, scope: !693)
!804 = !DILocation(line: 262, column: 26, scope: !702)
!805 = !DILocation(line: 262, column: 15, scope: !702)
!806 = !DILocation(line: 263, column: 30, scope: !702)
!807 = !{!808, !89, i64 8}
!808 = !{!"zset", !89, i64 0, !89, i64 8}
!809 = !DILocation(line: 263, column: 20, scope: !702)
!810 = !DILocation(line: 266, column: 19, scope: !811)
!811 = distinct !DILexicalBlock(scope: !702, file: !1, line: 266, column: 13)
!812 = !DILocation(line: 264, column: 24, scope: !702)
!813 = !DILocation(line: 266, column: 49, scope: !811)
!814 = !DILocation(line: 266, column: 13, scope: !702)
!815 = !DILocation(line: 0, scope: !735)
!816 = !DILocation(line: 272, column: 27, scope: !735)
!817 = !DILocation(line: 272, column: 17, scope: !735)
!818 = !DILocation(line: 274, column: 37, scope: !819)
!819 = distinct !DILexicalBlock(scope: !735, file: !1, line: 274, column: 17)
!820 = !DILocation(line: 274, column: 18, scope: !819)
!821 = !DILocation(line: 274, column: 17, scope: !735)
!822 = !DILocation(line: 277, column: 19, scope: !735)
!823 = !DILocation(line: 278, column: 63, scope: !824)
!824 = distinct !DILexicalBlock(scope: !735, file: !1, line: 278, column: 17)
!825 = !DILocation(line: 278, column: 17, scope: !824)
!826 = !DILocation(line: 279, column: 17, scope: !824)
!827 = !DILocation(line: 278, column: 17, scope: !735)
!828 = !DILocation(line: 279, column: 27, scope: !824)
!829 = !DILocation(line: 280, column: 31, scope: !735)
!830 = !{!831, !89, i64 0}
!831 = !{!"zskiplistLevel", !89, i64 0, !92, i64 8}
!832 = !DILocation(line: 271, column: 9, scope: !702)
!833 = distinct !{!833, !832, !834}
!834 = !DILocation(line: 281, column: 9, scope: !702)
!835 = !DILocation(line: 283, column: 16, scope: !670)
!836 = !DILocation(line: 283, column: 21, scope: !670)
!837 = !DILocation(line: 283, column: 12, scope: !670)
!838 = !DILocation(line: 283, column: 5, scope: !670)
!839 = !DILocation(line: 0, scope: !840)
!840 = distinct !DILexicalBlock(scope: !811, file: !1, line: 266, column: 58)
!841 = !DILocation(line: 284, column: 1, scope: !670)
!842 = distinct !DISubprogram(name: "scoresOfGeoHashBox", scope: !1, file: !1, line: 289, type: !843, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !848)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !165, !845, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashFix52Bits", file: !847, line: 41, baseType: !4)
!847 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.h", directory: "/root/.unikraft/apps/redis/build")
!848 = !{!849, !850, !851}
!849 = !DILocalVariable(name: "hash", arg: 1, scope: !842, file: !1, line: 289, type: !165)
!850 = !DILocalVariable(name: "min", arg: 2, scope: !842, file: !1, line: 289, type: !845)
!851 = !DILocalVariable(name: "max", arg: 3, scope: !842, file: !1, line: 289, type: !845)
!852 = !DILocation(line: 289, column: 37, scope: !842)
!853 = !DILocation(line: 289, column: 61, scope: !842)
!854 = !DILocation(line: 289, column: 84, scope: !842)
!855 = !DILocation(line: 310, column: 12, scope: !842)
!856 = !DILocation(line: 310, column: 10, scope: !842)
!857 = !DILocation(line: 311, column: 14, scope: !842)
!858 = !DILocation(line: 312, column: 12, scope: !842)
!859 = !DILocation(line: 312, column: 10, scope: !842)
!860 = !DILocation(line: 313, column: 1, scope: !842)
!861 = distinct !DISubprogram(name: "membersOfGeoHashBox", scope: !1, file: !1, line: 318, type: !862, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !864)
!862 = !DISubroutineType(types: !863)
!863 = !{!159, !292, !165, !59, !69, !69, !69}
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872}
!865 = !DILocalVariable(name: "zobj", arg: 1, scope: !861, file: !1, line: 318, type: !292)
!866 = !DILocalVariable(name: "hash", arg: 2, scope: !861, file: !1, line: 318, type: !165)
!867 = !DILocalVariable(name: "ga", arg: 3, scope: !861, file: !1, line: 318, type: !59)
!868 = !DILocalVariable(name: "lon", arg: 4, scope: !861, file: !1, line: 318, type: !69)
!869 = !DILocalVariable(name: "lat", arg: 5, scope: !861, file: !1, line: 318, type: !69)
!870 = !DILocalVariable(name: "radius", arg: 6, scope: !861, file: !1, line: 318, type: !69)
!871 = !DILocalVariable(name: "min", scope: !861, file: !1, line: 319, type: !846)
!872 = !DILocalVariable(name: "max", scope: !861, file: !1, line: 319, type: !846)
!873 = !DILocation(line: 318, column: 49, scope: !861)
!874 = !DILocation(line: 318, column: 31, scope: !861)
!875 = !DILocation(line: 318, column: 65, scope: !861)
!876 = !DILocation(line: 318, column: 76, scope: !861)
!877 = !DILocation(line: 318, column: 88, scope: !861)
!878 = !DILocation(line: 318, column: 100, scope: !861)
!879 = !DILocation(line: 289, column: 37, scope: !842, inlinedAt: !880)
!880 = distinct !DILocation(line: 321, column: 5, scope: !861)
!881 = !DILocation(line: 310, column: 12, scope: !842, inlinedAt: !880)
!882 = !DILocation(line: 311, column: 14, scope: !842, inlinedAt: !880)
!883 = !DILocation(line: 312, column: 12, scope: !842, inlinedAt: !880)
!884 = !DILocation(line: 319, column: 22, scope: !861)
!885 = !DILocation(line: 322, column: 38, scope: !861)
!886 = !DILocation(line: 319, column: 27, scope: !861)
!887 = !DILocation(line: 322, column: 43, scope: !861)
!888 = !DILocation(line: 322, column: 12, scope: !861)
!889 = !DILocation(line: 322, column: 5, scope: !861)
!890 = distinct !DISubprogram(name: "membersOfAllNeighbors", scope: !1, file: !1, line: 326, type: !891, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !921)
!891 = !DISubroutineType(types: !892)
!892 = !{!159, !292, !893, !69, !69, !69, !59}
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRadius", file: !847, line: 48, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !847, line: 44, size: 1536, elements: !895)
!895 = !{!896, !897, !909}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !894, file: !847, line: 45, baseType: !165, size: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !894, file: !847, line: 46, baseType: !898, size: 384, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashArea", file: !166, line: 80, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 76, size: 384, elements: !900)
!900 = !{!901, !902, !908}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !899, file: !166, line: 77, baseType: !165, size: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !899, file: !166, line: 78, baseType: !903, size: 128, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRange", file: !166, line: 74, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 71, size: 128, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !904, file: !166, line: 72, baseType: !69, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !904, file: !166, line: 73, baseType: !69, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !899, file: !166, line: 79, baseType: !903, size: 128, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !894, file: !847, line: 47, baseType: !910, size: 1024, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashNeighbors", file: !166, line: 91, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 82, size: 1024, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "north", scope: !911, file: !166, line: 83, baseType: !165, size: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "east", scope: !911, file: !166, line: 84, baseType: !165, size: 128, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "west", scope: !911, file: !166, line: 85, baseType: !165, size: 128, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "south", scope: !911, file: !166, line: 86, baseType: !165, size: 128, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "north_east", scope: !911, file: !166, line: 87, baseType: !165, size: 128, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "south_east", scope: !911, file: !166, line: 88, baseType: !165, size: 128, offset: 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "north_west", scope: !911, file: !166, line: 89, baseType: !165, size: 128, offset: 768)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "south_west", scope: !911, file: !166, line: 90, baseType: !165, size: 128, offset: 896)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !932, !933, !934, !935, !936, !1155, !1158, !1159, !1160, !1162, !1164, !1166, !1168, !1170, !1172}
!922 = !DILocalVariable(name: "zobj", arg: 1, scope: !890, file: !1, line: 326, type: !292)
!923 = !DILocalVariable(name: "n", arg: 2, scope: !890, file: !1, line: 326, type: !893)
!924 = !DILocalVariable(name: "lon", arg: 3, scope: !890, file: !1, line: 326, type: !69)
!925 = !DILocalVariable(name: "lat", arg: 4, scope: !890, file: !1, line: 326, type: !69)
!926 = !DILocalVariable(name: "radius", arg: 5, scope: !890, file: !1, line: 326, type: !69)
!927 = !DILocalVariable(name: "ga", arg: 6, scope: !890, file: !1, line: 326, type: !59)
!928 = !DILocalVariable(name: "neighbors", scope: !890, file: !1, line: 327, type: !929)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 1152, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 9)
!932 = !DILocalVariable(name: "i", scope: !890, file: !1, line: 328, type: !41)
!933 = !DILocalVariable(name: "count", scope: !890, file: !1, line: 328, type: !41)
!934 = !DILocalVariable(name: "last_processed", scope: !890, file: !1, line: 328, type: !41)
!935 = !DILocalVariable(name: "debugmsg", scope: !890, file: !1, line: 329, type: !159)
!936 = !DILocalVariable(name: "fp", scope: !937, file: !1, line: 345, type: !944)
!937 = distinct !DILexicalBlock(scope: !938, file: !1, line: 345, column: 27)
!938 = distinct !DILexicalBlock(scope: !939, file: !1, line: 345, column: 17)
!939 = distinct !DILexicalBlock(scope: !940, file: !1, line: 344, column: 39)
!940 = distinct !DILexicalBlock(scope: !941, file: !1, line: 344, column: 13)
!941 = distinct !DILexicalBlock(scope: !942, file: !1, line: 343, column: 66)
!942 = distinct !DILexicalBlock(scope: !943, file: !1, line: 343, column: 5)
!943 = distinct !DILexicalBlock(scope: !890, file: !1, line: 343, column: 5)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !946, line: 66, baseType: !947)
!946 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !948, line: 287, baseType: !949)
!948 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !948, line: 181, size: 1408, elements: !950)
!950 = !{!951, !952, !953, !954, !956, !957, !962, !963, !964, !1123, !1129, !1134, !1138, !1139, !1140, !1141, !1143, !1145, !1146, !1147, !1148, !1149, !1153, !1154}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !949, file: !948, line: 182, baseType: !694, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !949, file: !948, line: 183, baseType: !159, size: 32, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !949, file: !948, line: 184, baseType: !159, size: 32, offset: 96)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !949, file: !948, line: 185, baseType: !955, size: 16, offset: 128)
!955 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !949, file: !948, line: 186, baseType: !955, size: 16, offset: 144)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !949, file: !948, line: 187, baseType: !958, size: 128, offset: 192)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !948, line: 117, size: 128, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !958, file: !948, line: 118, baseType: !694, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !958, file: !948, line: 119, baseType: !159, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !949, file: !948, line: 188, baseType: !159, size: 32, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !949, file: !948, line: 195, baseType: !9, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !949, file: !948, line: 197, baseType: !965, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!968, !969, !9, !74, !159}
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !79, line: 145, baseType: !244)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !948, line: 569, size: 14912, elements: !971)
!971 = !{!972, !973, !975, !976, !977, !978, !982, !983, !986, !987, !991, !1005, !1006, !1007, !1009, !1010, !1011, !1087, !1108, !1109, !1114, !1121}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !970, file: !948, line: 571, baseType: !159, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !970, file: !948, line: 576, baseType: !974, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !970, file: !948, line: 576, baseType: !974, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !970, file: !948, line: 576, baseType: !974, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !970, file: !948, line: 578, baseType: !159, size: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !970, file: !948, line: 579, baseType: !979, size: 200, offset: 288)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 200, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 25)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !970, file: !948, line: 582, baseType: !159, size: 32, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !970, file: !948, line: 583, baseType: !984, size: 64, offset: 576)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !948, line: 40, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !970, file: !948, line: 585, baseType: !159, size: 32, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !970, file: !948, line: 587, baseType: !988, size: 64, offset: 704)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !969}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !970, file: !948, line: 590, baseType: !992, size: 64, offset: 768)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !948, line: 47, size: 256, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !993, file: !948, line: 49, baseType: !992, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !993, file: !948, line: 50, baseType: !159, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !993, file: !948, line: 50, baseType: !159, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !993, file: !948, line: 50, baseType: !159, size: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !993, file: !948, line: 50, baseType: !159, size: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !993, file: !948, line: 51, baseType: !1001, size: 32, offset: 192)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 32, elements: !1003)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !948, line: 25, baseType: !41)
!1003 = !{!1004}
!1004 = !DISubrange(count: 1)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !970, file: !948, line: 591, baseType: !159, size: 32, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !970, file: !948, line: 592, baseType: !992, size: 64, offset: 896)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !970, file: !948, line: 593, baseType: !1008, size: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !970, file: !948, line: 596, baseType: !159, size: 32, offset: 1024)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !970, file: !948, line: 597, baseType: !74, size: 64, offset: 1088)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !970, file: !948, line: 632, baseType: !1012, size: 2880, offset: 1152)
!1012 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !948, line: 599, size: 2880, elements: !1013)
!1013 = !{!1014, !1078}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !1012, file: !948, line: 622, baseType: !1015, size: 1728)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1012, file: !948, line: 601, size: 1728, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1023, !1035, !1036, !1037, !1046, !1061, !1062, !1063, !1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !1015, file: !948, line: 603, baseType: !41, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1015, file: !948, line: 604, baseType: !74, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !1015, file: !948, line: 605, baseType: !1020, size: 208, offset: 128)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 208, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 26)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !1015, file: !948, line: 606, baseType: !1024, size: 288, offset: 352)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !948, line: 55, size: 288, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1024, file: !948, line: 57, baseType: !159, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1024, file: !948, line: 58, baseType: !159, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1024, file: !948, line: 59, baseType: !159, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1024, file: !948, line: 60, baseType: !159, size: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1024, file: !948, line: 61, baseType: !159, size: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1024, file: !948, line: 62, baseType: !159, size: 32, offset: 160)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1024, file: !948, line: 63, baseType: !159, size: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1024, file: !948, line: 64, baseType: !159, size: 32, offset: 224)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1024, file: !948, line: 65, baseType: !159, size: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !1015, file: !948, line: 607, baseType: !159, size: 32, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1015, file: !948, line: 608, baseType: !339, size: 64, offset: 704)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !1015, file: !948, line: 609, baseType: !1038, size: 112, offset: 768)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !948, line: 319, size: 112, elements: !1039)
!1039 = !{!1040, !1044, !1045}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1038, file: !948, line: 320, baseType: !1041, size: 48)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 3)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1038, file: !948, line: 321, baseType: !1041, size: 48, offset: 48)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1038, file: !948, line: 322, baseType: !31, size: 16, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1015, file: !948, line: 610, baseType: !1047, size: 64, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !79, line: 171, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 163, size: 64, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1048, file: !79, line: 165, baseType: !159, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1048, file: !79, line: 170, baseType: !1052, size: 32, offset: 32)
!1052 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1048, file: !79, line: 166, size: 32, elements: !1053)
!1053 = !{!1054, !1057}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1052, file: !79, line: 168, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1056, line: 124, baseType: !41)
!1056 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1052, file: !79, line: 169, baseType: !1058, size: 32)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 4)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1015, file: !948, line: 611, baseType: !1047, size: 64, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1015, file: !948, line: 612, baseType: !1047, size: 64, offset: 1024)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1015, file: !948, line: 613, baseType: !1064, size: 64, offset: 1088)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 8)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !1015, file: !948, line: 614, baseType: !1068, size: 192, offset: 1152)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 24)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1015, file: !948, line: 615, baseType: !159, size: 32, offset: 1344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1015, file: !948, line: 616, baseType: !1047, size: 64, offset: 1376)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1015, file: !948, line: 617, baseType: !1047, size: 64, offset: 1440)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1015, file: !948, line: 618, baseType: !1047, size: 64, offset: 1504)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1015, file: !948, line: 619, baseType: !1047, size: 64, offset: 1568)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1015, file: !948, line: 620, baseType: !1047, size: 64, offset: 1632)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !1015, file: !948, line: 621, baseType: !159, size: 32, offset: 1696)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !1012, file: !948, line: 631, baseType: !1079, size: 2880)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1012, file: !948, line: 626, size: 2880, elements: !1080)
!1080 = !{!1081, !1085}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !1079, file: !948, line: 629, baseType: !1082, size: 1920)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 1920, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 30)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !1079, file: !948, line: 630, baseType: !1086, size: 960, offset: 1920)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 960, elements: !1083)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !970, file: !948, line: 636, baseType: !1088, size: 64, offset: 4032)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !948, line: 93, size: 6336, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1100}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1089, file: !948, line: 94, baseType: !1088, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1089, file: !948, line: 95, baseType: !159, size: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1089, file: !948, line: 97, baseType: !1094, size: 2048, offset: 128)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 2048, elements: !1098)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null}
!1098 = !{!1099}
!1099 = !DISubrange(count: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !1089, file: !948, line: 98, baseType: !1101, size: 4160, offset: 2176)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !948, line: 74, size: 4160, elements: !1102)
!1102 = !{!1103, !1105, !1106, !1107}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1101, file: !948, line: 75, baseType: !1104, size: 2048)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !1098)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1101, file: !948, line: 76, baseType: !1104, size: 2048, offset: 2048)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1101, file: !948, line: 78, baseType: !1002, size: 32, offset: 4096)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1101, file: !948, line: 81, baseType: !1002, size: 32, offset: 4128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !970, file: !948, line: 637, baseType: !1089, size: 6336, offset: 4096)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !970, file: !948, line: 641, baseType: !1110, size: 64, offset: 10432)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !159}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !970, file: !948, line: 646, baseType: !1115, size: 192, offset: 10496)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !948, line: 291, size: 192, elements: !1116)
!1116 = !{!1117, !1119, !1120}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1115, file: !948, line: 293, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !1115, file: !948, line: 294, baseType: !159, size: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !1115, file: !948, line: 295, baseType: !974, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !970, file: !948, line: 648, baseType: !1122, size: 4224, offset: 10688)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 4224, elements: !1042)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !949, file: !948, line: 199, baseType: !1124, size: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!968, !969, !9, !1127, !159}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !949, file: !948, line: 202, baseType: !1130, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1133, !969, !9, !1133, !159}
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !79, line: 114, baseType: !244)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !949, file: !948, line: 203, baseType: !1135, size: 64, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!159, !969, !9}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !949, file: !948, line: 206, baseType: !958, size: 128, offset: 704)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !949, file: !948, line: 207, baseType: !694, size: 64, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !949, file: !948, line: 208, baseType: !159, size: 32, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !949, file: !948, line: 211, baseType: !1142, size: 24, offset: 928)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !1042)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !949, file: !948, line: 212, baseType: !1144, size: 8, offset: 952)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !1003)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !949, file: !948, line: 215, baseType: !958, size: 128, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !949, file: !948, line: 218, baseType: !159, size: 32, offset: 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !949, file: !948, line: 219, baseType: !355, size: 64, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !949, file: !948, line: 222, baseType: !969, size: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !949, file: !948, line: 226, baseType: !1150, size: 32, offset: 1280)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !79, line: 175, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !1152, line: 12, baseType: !159)
!1152 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !949, file: !948, line: 228, baseType: !1047, size: 64, offset: 1312)
