; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GeoHashRadius = type { %struct.GeoHashBits, %struct.GeoHashArea, %struct.GeoHashNeighbors }
%struct.GeoHashBits = type { i64, i8 }
%struct.GeoHashArea = type { %struct.GeoHashBits, %struct.GeoHashRange, %struct.GeoHashRange }
%struct.GeoHashRange = type { double, double }
%struct.GeoHashNeighbors = type { %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits, %struct.GeoHashBits }

@DEG_TO_RAD = dso_local local_unnamed_addr constant double 0x3F91DF46A2529D39, align 8, !dbg !0
@EARTH_RADIUS_IN_METERS = dso_local local_unnamed_addr constant double 0x41584F6F63E51090, align 8, !dbg !6
@MERCATOR_MAX = dso_local local_unnamed_addr constant double 0x41731C05E5EB851F, align 8, !dbg !10
@MERCATOR_MIN = dso_local local_unnamed_addr constant double 0xC1731C05E5EB851F, align 8, !dbg !12

; Function Attrs: noredzone nounwind readnone
define dso_local zeroext i8 @geohashEstimateStepsByRadius(double, double) local_unnamed_addr #0 !dbg !18 {
  %3 = fcmp oeq double %0, 0.000000e+00, !dbg !33
  br i1 %3, label %31, label %4, !dbg !35

; <label>:4:                                      ; preds = %2

!49 = !DILocation(line: 74, column: 18, scope: !47)
!50 = !DILocation(line: 76, column: 17, scope: !51)
!51 = distinct !DILexicalBlock(scope: !52, file: !3, line: 76, column: 13)
!52 = distinct !DILexicalBlock(scope: !47, file: !3, line: 74, column: 32)
!53 = !DILocation(line: 76, column: 29, scope: !51)
!54 = !DILocation(line: 76, column: 22, scope: !51)
!55 = !DILocation(line: 0, scope: !18)
!56 = !DILocation(line: 80, column: 9, scope: !18)
!57 = !DILocation(line: 81, column: 9, scope: !18)
!58 = !DILocation(line: 82, column: 12, scope: !18)
!59 = !DILocation(line: 83, column: 1, scope: !18)
!60 = distinct !DISubprogram(name: "geohashBoundingBox", scope: !3, file: !3, line: 103, type: !61, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !64)
!61 = !DISubroutineType(types: !62)
!62 = !{!30, !9, !9, !9, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!64 = !{!65, !66, !67, !68}
!65 = !DILocalVariable(name: "longitude", arg: 1, scope: !60, file: !3, line: 103, type: !9)
!66 = !DILocalVariable(name: "latitude", arg: 2, scope: !60, file: !3, line: 103, type: !9)
!67 = !DILocalVariable(name: "radius_meters", arg: 3, scope: !60, file: !3, line: 103, type: !9)
!68 = !DILocalVariable(name: "bounds", arg: 4, scope: !60, file: !3, line: 104, type: !63)
!69 = !DILocation(line: 103, column: 31, scope: !60)
!70 = !DILocation(line: 103, column: 49, scope: !60)
!71 = !DILocation(line: 103, column: 66, scope: !60)
!72 = !DILocation(line: 104, column: 32, scope: !60)
!73 = !DILocation(line: 105, column: 10, scope: !74)
!74 = distinct !DILexicalBlock(scope: !60, file: !3, line: 105, column: 9)
!75 = !DILocation(line: 105, column: 9, scope: !60)
!76 = !DILocation(line: 107, column: 50, scope: !60)
!77 = !DILocalVariable(name: "ang", arg: 1, scope: !78, file: !3, line: 57, type: !9)
!78 = distinct !DISubprogram(name: "deg_rad", scope: !3, file: !3, line: 57, type: !79, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{!9, !9}
!81 = !{!77}
!82 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !83)
!83 = distinct !DILocation(line: 107, column: 78, scope: !60)
!84 = !DILocation(line: 57, column: 55, scope: !78, inlinedAt: !83)
!85 = !DILocation(line: 107, column: 74, scope: !60)
!86 = !DILocation(line: 107, column: 73, scope: !60)
!87 = !DILocalVariable(name: "ang", arg: 1, scope: !88, file: !3, line: 58, type: !9)
!88 = distinct !DISubprogram(name: "rad_deg", scope: !3, file: !3, line: 58, type: !79, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !89)
!89 = !{!87}
!90 = !DILocation(line: 58, column: 37, scope: !88, inlinedAt: !91)
!91 = distinct !DILocation(line: 107, column: 29, scope: !60)
!92 = !DILocation(line: 58, column: 55, scope: !88, inlinedAt: !91)
!93 = !DILocation(line: 107, column: 27, scope: !60)
!94 = !DILocation(line: 107, column: 15, scope: !60)
!95 = !{!96, !96, i64 0}
!96 = !{!"double", !97, i64 0}
!97 = !{!"omnipotent char", !98, i64 0}
!98 = !{!"Simple C/C++ TBAA"}
!99 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !100)
!100 = distinct !DILocation(line: 108, column: 78, scope: !60)
!101 = !DILocation(line: 108, column: 74, scope: !60)
!102 = !DILocation(line: 108, column: 73, scope: !60)
!103 = !DILocation(line: 58, column: 37, scope: !88, inlinedAt: !104)
!104 = distinct !DILocation(line: 108, column: 29, scope: !60)
!105 = !DILocation(line: 108, column: 5, scope: !60)
!106 = !DILocation(line: 58, column: 37, scope: !88, inlinedAt: !107)
!107 = distinct !DILocation(line: 109, column: 28, scope: !60)
!108 = !DILocation(line: 58, column: 55, scope: !88, inlinedAt: !104)
!109 = !DILocation(line: 109, column: 26, scope: !60)
!110 = !DILocation(line: 109, column: 5, scope: !60)
!111 = !DILocation(line: 109, column: 15, scope: !60)
!112 = !DILocation(line: 58, column: 37, scope: !88, inlinedAt: !113)
!113 = distinct !DILocation(line: 110, column: 28, scope: !60)
!114 = !DILocation(line: 108, column: 27, scope: !60)
!115 = !DILocation(line: 108, column: 15, scope: !60)
!116 = !DILocation(line: 111, column: 5, scope: !60)
!117 = !DILocation(line: 0, scope: !74)
!118 = !DILocation(line: 112, column: 1, scope: !60)
!119 = distinct !DISubprogram(name: "geohashGetAreasByRadius", scope: !3, file: !3, line: 116, type: !120, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !160)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !9, !9, !9}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRadius", file: !123, line: 48, baseType: !124)
!123 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash_helper.h", directory: "/root/.unikraft/apps/redis/build")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 44, size: 1536, elements: !125)
!125 = !{!126, !136, !148}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !124, file: !123, line: 45, baseType: !127, size: 128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashBits", file: !128, line: 69, baseType: !129)
!128 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/geohash.h", directory: "/root/.unikraft/apps/redis/build")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 66, size: 128, elements: !130)
!130 = !{!131, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !129, file: !128, line: 67, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 60, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 105, baseType: !134)
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !129, file: !128, line: 68, baseType: !21, size: 8, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !124, file: !123, line: 46, baseType: !137, size: 384, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashArea", file: !128, line: 80, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 76, size: 384, elements: !139)
!139 = !{!140, !141, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !138, file: !128, line: 77, baseType: !127, size: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !138, file: !128, line: 78, baseType: !142, size: 128, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashRange", file: !128, line: 74, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 71, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !143, file: !128, line: 72, baseType: !9, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !143, file: !128, line: 73, baseType: !9, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !138, file: !128, line: 79, baseType: !142, size: 128, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !124, file: !123, line: 47, baseType: !149, size: 1024, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeoHashNeighbors", file: !128, line: 91, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 82, size: 1024, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "north", scope: !150, file: !128, line: 83, baseType: !127, size: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "east", scope: !150, file: !128, line: 84, baseType: !127, size: 128, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "west", scope: !150, file: !128, line: 85, baseType: !127, size: 128, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "south", scope: !150, file: !128, line: 86, baseType: !127, size: 128, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "north_east", scope: !150, file: !128, line: 87, baseType: !127, size: 128, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "south_east", scope: !150, file: !128, line: 88, baseType: !127, size: 128, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "north_west", scope: !150, file: !128, line: 89, baseType: !127, size: 128, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "south_west", scope: !150, file: !128, line: 90, baseType: !127, size: 128, offset: 896)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !178, !179, !180, !182, !183, !184}
!161 = !DILocalVariable(name: "longitude", arg: 1, scope: !119, file: !3, line: 116, type: !9)
!162 = !DILocalVariable(name: "latitude", arg: 2, scope: !119, file: !3, line: 116, type: !9)
!163 = !DILocalVariable(name: "radius_meters", arg: 3, scope: !119, file: !3, line: 116, type: !9)
!164 = !DILocalVariable(name: "long_range", scope: !119, file: !3, line: 117, type: !142)
!165 = !DILocalVariable(name: "lat_range", scope: !119, file: !3, line: 117, type: !142)
!166 = !DILocalVariable(name: "radius", scope: !119, file: !3, line: 118, type: !122)
!167 = !DILocalVariable(name: "hash", scope: !119, file: !3, line: 119, type: !127)
!168 = !DILocalVariable(name: "neighbors", scope: !119, file: !3, line: 120, type: !149)
!169 = !DILocalVariable(name: "area", scope: !119, file: !3, line: 121, type: !137)
!170 = !DILocalVariable(name: "min_lon", scope: !119, file: !3, line: 122, type: !9)
!171 = !DILocalVariable(name: "max_lon", scope: !119, file: !3, line: 122, type: !9)
!172 = !DILocalVariable(name: "min_lat", scope: !119, file: !3, line: 122, type: !9)
!173 = !DILocalVariable(name: "max_lat", scope: !119, file: !3, line: 122, type: !9)
!174 = !DILocalVariable(name: "bounds", scope: !119, file: !3, line: 123, type: !175)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 4)
!178 = !DILocalVariable(name: "steps", scope: !119, file: !3, line: 124, type: !30)
!179 = !DILocalVariable(name: "decrease_step", scope: !119, file: !3, line: 144, type: !30)
!180 = !DILocalVariable(name: "north", scope: !181, file: !3, line: 146, type: !137)
!181 = distinct !DILexicalBlock(scope: !119, file: !3, line: 145, column: 5)
!182 = !DILocalVariable(name: "south", scope: !181, file: !3, line: 146, type: !137)
!183 = !DILocalVariable(name: "east", scope: !181, file: !3, line: 146, type: !137)
!184 = !DILocalVariable(name: "west", scope: !181, file: !3, line: 146, type: !137)
!185 = !DILocation(line: 116, column: 46, scope: !119)
!186 = !DILocation(line: 116, column: 64, scope: !119)
!187 = !DILocation(line: 116, column: 81, scope: !119)
!188 = !DILocation(line: 117, column: 5, scope: !119)
!189 = !DILocation(line: 118, column: 19, scope: !119)
!190 = !DILocation(line: 119, column: 5, scope: !119)
!191 = !DILocation(line: 120, column: 5, scope: !119)
!192 = !DILocation(line: 121, column: 5, scope: !119)
!193 = !DILocation(line: 103, column: 31, scope: !60, inlinedAt: !194)
!194 = distinct !DILocation(line: 126, column: 5, scope: !119)
!195 = !DILocation(line: 103, column: 49, scope: !60, inlinedAt: !194)
!196 = !DILocation(line: 103, column: 66, scope: !60, inlinedAt: !194)
!197 = !DILocation(line: 104, column: 32, scope: !60, inlinedAt: !194)
!198 = !DILocation(line: 107, column: 50, scope: !60, inlinedAt: !194)
!199 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !200)
!200 = distinct !DILocation(line: 107, column: 78, scope: !60, inlinedAt: !194)
!201 = !DILocation(line: 57, column: 55, scope: !78, inlinedAt: !200)
!202 = !DILocation(line: 107, column: 74, scope: !60, inlinedAt: !194)
!203 = !DILocation(line: 107, column: 73, scope: !60, inlinedAt: !194)
!204 = !DILocation(line: 58, column: 37, scope: !88, inlinedAt: !205)
!205 = distinct !DILocation(line: 107, column: 29, scope: !60, inlinedAt: !194)
!206 = !DILocation(line: 58, column: 55, scope: !88, inlinedAt: !205)
!207 = !DILocation(line: 107, column: 27, scope: !60, inlinedAt: !194)
!208 = !DILocation(line: 123, column: 12, scope: !119)
!209 = !DILocation(line: 57, column: 37, scope: !78, inlinedAt: !210)
!210 = distinct !DILocation(line: 108, column: 78, scope: !60, inlinedAt: !194)
!211 = !DILocation(line: 108, column: 74, scope: !60, inlinedAt: !194)
