; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_buf.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_buf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.htab = type { %struct.hashhdr, i32, i32, i32 (i8*, i64)*, i32, i32, i8*, i8*, %struct._bufhead*, i32, i32, i32, i32, i32, [32 x i32*], i32, i32, %struct._bufhead, %struct._bufhead*** }
%struct.hashhdr = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [32 x i32], [32 x i16] }
%struct._bufhead = type { %struct._bufhead*, %struct._bufhead*, %struct._bufhead*, i32, i8*, i8 }

; Function Attrs: noredzone nounwind
define dso_local %struct._bufhead* @__get_buf(%struct.htab*, i32, %struct._bufhead*, i32) local_unnamed_addr #0 !dbg !32 {
  %5 = icmp ne %struct._bufhead* %2, null, !dbg !114
  br i1 %5, label %6, label %19, !dbg !116

; <label>:6:                                      ; preds = %4
  %7 = getelementptr inbounds %struct._bufhead, %struct._bufhead* %2, i64 0, i32 2, !dbg !117
  %8 = load %struct._bufhead*, %struct._bufhead** %7, align 8, !dbg !117, !tbaa !119
  %9 = icmp eq %struct._bufhead* %8, null, !dbg !126
  br i1 %9, label %14, label %10, !dbg !128

; <label>:10:                                     ; preds = %6

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash_buf.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !20, !13, !23, !17, !24, !27}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUFHEAD", file: !6, line: 64, baseType: !7)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/search/hash.h", directory: "/root/.unikraft/apps/redis/build")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bufhead", file: !6, line: 66, size: 384, elements: !8)
!8 = !{!9, !10, !11, !12, !16, !19}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !6, line: 67, baseType: !4, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !6, line: 68, baseType: !4, size: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl", scope: !7, file: !6, line: 69, baseType: !4, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !7, file: !6, line: 70, baseType: !13, size: 32, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !14, line: 79, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !7, file: !6, line: 71, baseType: !17, size: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !6, line: 72, baseType: !18, size: 8, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !21, line: 49, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !14, line: 57, baseType: !26)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !{i32 2, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{i32 1, !"wchar_size", i32 4}
!31 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!32 = distinct !DISubprogram(name: "__get_buf", scope: !1, file: !1, line: 114, type: !33, isLocal: false, isDefinition: true, scopeLine: 119, isOptimized: true, unit: !0, retainedNodes: !96)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35, !13, !4, !27}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTAB", file: !6, line: 138, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !6, line: 111, size: 5248, elements: !38)
!38 = !{!39, !66, !67, !68, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !89, !90, !91, !92}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !37, file: !6, line: 112, baseType: !40, size: 2080)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASHHDR", file: !6, line: 109, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashhdr", file: !6, line: 84, size: 2080, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !64}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !41, file: !6, line: 85, baseType: !27, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !41, file: !6, line: 86, baseType: !27, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lorder", scope: !41, file: !6, line: 87, baseType: !13, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !41, file: !6, line: 88, baseType: !27, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !41, file: !6, line: 89, baseType: !27, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !41, file: !6, line: 90, baseType: !27, size: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ssize", scope: !41, file: !6, line: 91, baseType: !27, size: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sshift", scope: !41, file: !6, line: 92, baseType: !27, size: 32, offset: 224)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ovfl_point", scope: !41, file: !6, line: 93, baseType: !27, size: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "last_freed", scope: !41, file: !6, line: 95, baseType: !27, size: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "max_bucket", scope: !41, file: !6, line: 96, baseType: !27, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "high_mask", scope: !41, file: !6, line: 97, baseType: !27, size: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "low_mask", scope: !41, file: !6, line: 98, baseType: !27, size: 32, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ffactor", scope: !41, file: !6, line: 100, baseType: !27, size: 32, offset: 416)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !41, file: !6, line: 101, baseType: !27, size: 32, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "hdrpages", scope: !41, file: !6, line: 102, baseType: !27, size: 32, offset: 480)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "h_charkey", scope: !41, file: !6, line: 103, baseType: !27, size: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "spares", scope: !41, file: !6, line: 106, baseType: !61, size: 1024, offset: 544)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bitmaps", scope: !41, file: !6, line: 107, baseType: !65, size: 512, offset: 1568)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, elements: !62)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nsegs", scope: !37, file: !6, line: 113, baseType: !27, size: 32, offset: 2080)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "exsegs", scope: !37, file: !6, line: 114, baseType: !27, size: 32, offset: 2112)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !37, file: !6, line: 117, baseType: !69, size: 64, offset: 2176)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!13, !72, !74}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 58, baseType: !75)
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !6, line: 118, baseType: !27, size: 32, offset: 2240)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !37, file: !6, line: 119, baseType: !27, size: 32, offset: 2272)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !37, file: !6, line: 120, baseType: !17, size: 64, offset: 2304)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_key", scope: !37, file: !6, line: 121, baseType: !17, size: 64, offset: 2368)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cpage", scope: !37, file: !6, line: 122, baseType: !4, size: 64, offset: 2432)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cbucket", scope: !37, file: !6, line: 123, baseType: !27, size: 32, offset: 2496)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cndx", scope: !37, file: !6, line: 124, baseType: !27, size: 32, offset: 2528)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !37, file: !6, line: 125, baseType: !27, size: 32, offset: 2560)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "new_file", scope: !37, file: !6, line: 127, baseType: !27, size: 32, offset: 2592)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "save_file", scope: !37, file: !6, line: 129, baseType: !27, size: 32, offset: 2624)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !37, file: !6, line: 132, baseType: !87, size: 2048, offset: 2688)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !62)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nmaps", scope: !37, file: !6, line: 133, baseType: !27, size: 32, offset: 4736)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !37, file: !6, line: 134, baseType: !27, size: 32, offset: 4768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bufhead", scope: !37, file: !6, line: 136, baseType: !5, size: 384, offset: 4800)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !37, file: !6, line: 137, baseType: !93, size: 64, offset: 5184)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEGMENT", file: !6, line: 81, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DILocalVariable(name: "hashp", arg: 1, scope: !32, file: !1, line: 115, type: !35)
!98 = !DILocalVariable(name: "addr", arg: 2, scope: !32, file: !1, line: 116, type: !13)
!99 = !DILocalVariable(name: "prev_bp", arg: 3, scope: !32, file: !1, line: 117, type: !4)
!100 = !DILocalVariable(name: "newpage", arg: 4, scope: !32, file: !1, line: 118, type: !27)
!101 = !DILocalVariable(name: "bp", scope: !32, file: !1, line: 120, type: !4)
!102 = !DILocalVariable(name: "is_disk_mask", scope: !32, file: !1, line: 121, type: !13)
!103 = !DILocalVariable(name: "is_disk", scope: !32, file: !1, line: 122, type: !27)
!104 = !DILocalVariable(name: "segment_ndx", scope: !32, file: !1, line: 122, type: !27)
!105 = !DILocalVariable(name: "segp", scope: !32, file: !1, line: 123, type: !94)
!106 = !DILocation(line: 115, column: 8, scope: !32)
!107 = !DILocation(line: 116, column: 13, scope: !32)
!108 = !DILocation(line: 117, column: 11, scope: !32)
!109 = !DILocation(line: 118, column: 6, scope: !32)
!110 = !DILocation(line: 122, column: 15, scope: !32)
!111 = !DILocation(line: 123, column: 10, scope: !32)
!112 = !DILocation(line: 122, column: 6, scope: !32)
!113 = !DILocation(line: 121, column: 13, scope: !32)
!114 = !DILocation(line: 127, column: 6, scope: !115)
!115 = distinct !DILexicalBlock(scope: !32, file: !1, line: 127, column: 6)
!116 = !DILocation(line: 127, column: 6, scope: !32)
!117 = !DILocation(line: 128, column: 17, scope: !118)
!118 = distinct !DILexicalBlock(scope: !115, file: !1, line: 127, column: 15)
!119 = !{!120, !121, i64 16}
!120 = !{!"_bufhead", !121, i64 0, !121, i64 8, !121, i64 16, !124, i64 24, !121, i64 32, !122, i64 40}
!121 = !{!"any pointer", !122, i64 0}
!122 = !{!"omnipotent char", !123, i64 0}
!123 = !{!"Simple C/C++ TBAA"}
!124 = !{!"int", !122, i64 0}
!125 = !DILocation(line: 120, column: 11, scope: !32)
!126 = !DILocation(line: 129, column: 8, scope: !127)
!127 = distinct !DILexicalBlock(scope: !118, file: !1, line: 129, column: 7)
!128 = !DILocation(line: 129, column: 11, scope: !127)
!129 = !DILocation(line: 129, column: 19, scope: !127)
!130 = !{!120, !124, i64 24}
!131 = !DILocation(line: 129, column: 24, scope: !127)
!132 = !DILocation(line: 129, column: 7, scope: !118)
!133 = !DILocation(line: 130, column: 4, scope: !127)
!134 = !DILocation(line: 0, scope: !118)
!135 = !DILocation(line: 131, column: 8, scope: !136)
!136 = distinct !DILexicalBlock(scope: !118, file: !1, line: 131, column: 7)
!137 = !DILocation(line: 131, column: 7, scope: !118)
!138 = !DILocation(line: 135, column: 32, scope: !139)
!139 = distinct !DILexicalBlock(scope: !115, file: !1, line: 133, column: 9)
!140 = !{!141, !124, i64 24}
!141 = !{!"htab", !142, i64 0, !124, i64 260, !124, i64 264, !121, i64 272, !124, i64 280, !124, i64 284, !121, i64 288, !121, i64 296, !121, i64 304, !124, i64 312, !124, i64 316, !124, i64 320, !124, i64 324, !124, i64 328, !122, i64 336, !124, i64 592, !124, i64 596, !120, i64 600, !121, i64 648}
!142 = !{!"hashhdr", !124, i64 0, !124, i64 4, !124, i64 8, !124, i64 12, !124, i64 16, !124, i64 20, !124, i64 24, !124, i64 28, !124, i64 32, !124, i64 36, !124, i64 40, !124, i64 44, !124, i64 48, !124, i64 52, !124, i64 56, !124, i64 60, !124, i64 64, !122, i64 68, !122, i64 196}
!143 = !DILocation(line: 135, column: 39, scope: !139)
!144 = !DILocation(line: 135, column: 22, scope: !139)
!145 = !DILocation(line: 138, column: 17, scope: !139)
!146 = !{!141, !121, i64 648}
!147 = !DILocation(line: 138, column: 36, scope: !139)
!148 = !{!141, !124, i64 28}
!149 = !DILocation(line: 138, column: 26, scope: !139)
