; ModuleID = '/root/.unikraft/libs/lwip/init.c'
source_filename = "/root/.unikraft/libs/lwip/init.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, i8* (%struct.uk_alloc*, i64, i64)*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 228, type: !496, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_liblwip_init", scope: !3, file: !3, line: 209, type: !4, isLocal: false, isDefinition: true, scopeLine: 209, isOptimized: true, unit: !7, retainedNodes: !889)
!3 = !DIFile(filename: "/root/.unikraft/libs/lwip/init.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !47, globals: !493)
!8 = !{!9, !17, !23, !35, !40}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_netdev_state", file: !10, line: 181, baseType: !11, size: 32, elements: !12)
!10 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uknetdev/include/uk/netdev_core.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !14, !15, !16}
!13 = !DIEnumerator(name: "UK_NETDEV_INVALID", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "UK_NETDEV_UNCONFIGURED", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "UK_NETDEV_CONFIGURED", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "UK_NETDEV_RUNNING", value: 3, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !18, line: 92, baseType: !11, size: 32, elements: !19)
!18 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_netdev_einfo_type", file: !10, line: 205, baseType: !11, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!25 = !DIEnumerator(name: "UK_NETDEV_IPV4_ADDR_NINT16", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "UK_NETDEV_IPV4_ADDR_STR", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "UK_NETDEV_IPV4_MASK_NINT16", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "UK_NETDEV_IPV4_MASK_STR", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "UK_NETDEV_IPV4_GW_NINT16", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "UK_NETDEV_IPV4_GW_STR", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS0_NINT16", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS0_STR", value: 7, isUnsigned: true)
!33 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS1_NINT16", value: 8, isUnsigned: true)
!34 = !DIEnumerator(name: "UK_NETDEV_IPV4_DNS1_STR", value: 9, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !36, line: 156, baseType: !11, size: 32, elements: !37)
!36 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!37 = !{!38, !39}
!38 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !41, line: 68, baseType: !11, size: 32, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!47 = !{!48, !49, !53, !54, !55, !280, !491}
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !50, line: 60, baseType: !51)
!50 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !52, line: 105, baseType: !48)
!52 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !58, line: 59, size: 1024, elements: !59)
!58 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !{!60, !64, !65, !66, !67, !72, !75, !81, !83, !99, !246, !247, !248, !461}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 60, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !57, file: !58, line: 61, baseType: !53, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !57, file: !58, line: 62, baseType: !53, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !57, file: !58, line: 63, baseType: !53, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !57, file: !58, line: 64, baseType: !68, size: 128, offset: 256)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !58, line: 64, size: 128, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !68, file: !58, line: 64, baseType: !56, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !68, file: !58, line: 64, baseType: !55, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !57, file: !58, line: 65, baseType: !73, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !50, line: 48, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 79, baseType: !11)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !57, file: !58, line: 66, baseType: !76, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !77, line: 49, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !79, line: 128, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !57, file: !58, line: 67, baseType: !82, size: 8, offset: 512)
!82 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !57, file: !58, line: 68, baseType: !84, size: 128, offset: 576)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !85, line: 42, size: 128, elements: !86)
!85 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!86 = !{!87, !97}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !84, file: !85, line: 42, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !85, line: 35, size: 192, elements: !90)
!90 = !{!91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !89, file: !85, line: 36, baseType: !6, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !89, file: !85, line: 37, baseType: !56, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !89, file: !85, line: 38, baseType: !94, size: 64, offset: 128)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !85, line: 38, size: 64, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !94, file: !85, line: 38, baseType: !88, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !84, file: !85, line: 42, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !57, file: !58, line: 69, baseType: !100, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !102, line: 90, size: 2176, elements: !103)
!102 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!103 = !{!104, !109, !126, !131, !133, !135, !140, !148, !153, !158, !159, !160, !165, !243, !244, !245}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !101, file: !102, line: 91, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !102, line: 68, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !100}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !101, file: !102, line: 93, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !102, line: 71, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!6, !100, !56, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !117, line: 62, baseType: !118)
!117 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !117, line: 55, size: 128, elements: !119)
!119 = !{!120, !121, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !118, file: !117, line: 57, baseType: !82, size: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !118, file: !117, line: 59, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !117, line: 53, baseType: !6)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !118, file: !117, line: 61, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !77, line: 48, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !79, line: 129, baseType: !48)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !101, file: !102, line: 94, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !102, line: 74, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !100, !56}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !101, file: !102, line: 95, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !102, line: 76, baseType: !128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !101, file: !102, line: 96, baseType: !134, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !102, line: 78, baseType: !128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !101, file: !102, line: 98, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !102, line: 81, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!6, !100, !56, !122}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !101, file: !102, line: 99, baseType: !141, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !102, line: 83, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!6, !100, !145, !147}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !101, file: !102, line: 100, baseType: !149, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !102, line: 85, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!6, !100, !56, !6}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !101, file: !102, line: 101, baseType: !154, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !102, line: 87, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!6, !100, !145, !54}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !101, file: !102, line: 104, baseType: !82, size: 8, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !101, file: !102, line: 105, baseType: !57, size: 1024, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !101, file: !102, line: 106, baseType: !161, size: 128, offset: 1664)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !58, line: 93, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !161, file: !58, line: 93, baseType: !56, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !161, file: !58, line: 93, baseType: !55, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !101, file: !102, line: 107, baseType: !166, size: 192, offset: 1792)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !167, line: 59, size: 192, elements: !168)
!167 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!168 = !{!169, !234, !238}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !166, file: !167, line: 61, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !167, line: 51, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!53, !174, !48, !48}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !176, line: 77, size: 832, elements: !177)
!176 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!177 = !{!178, !185, !190, !195, !201, !203, !208, !209, !210, !215, !220, !225, !226, !227}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !175, file: !176, line: 79, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !176, line: 54, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!53, !174, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 58, baseType: !48)
!184 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !175, file: !176, line: 80, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !176, line: 56, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!53, !174, !183, !183}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !175, file: !176, line: 81, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !176, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!53, !174, !53, !183}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !175, file: !176, line: 82, baseType: !196, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !176, line: 58, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!6, !174, !200, !183, !183}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !175, file: !176, line: 83, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !176, line: 60, baseType: !187)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !175, file: !176, line: 84, baseType: !204, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !176, line: 64, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !174, !53}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !175, file: !176, line: 87, baseType: !204, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !175, file: !176, line: 88, baseType: !179, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !175, file: !176, line: 92, baseType: !211, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !176, line: 66, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!53, !174, !48}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !175, file: !176, line: 93, baseType: !216, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !176, line: 68, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !174, !53, !48}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !175, file: !176, line: 99, baseType: !221, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !176, line: 70, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!6, !174, !53, !183}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !176, line: 100, baseType: !183, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 103, baseType: !174, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !176, line: 104, baseType: !228, offset: 832)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, elements: !232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !50, line: 20, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !52, line: 41, baseType: !231)
!231 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!232 = !{!233}
!233 = !DISubrange(count: -1)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !166, file: !167, line: 63, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !53}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !166, file: !167, line: 65, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !167, line: 56, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !53, !53}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !101, file: !102, line: 108, baseType: !174, size: 64, offset: 1984)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !102, line: 109, baseType: !100, size: 64, offset: 2048)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !101, file: !102, line: 110, baseType: !53, size: 64, offset: 2112)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !57, file: !58, line: 70, baseType: !53, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !57, file: !58, line: 72, baseType: !6, size: 32, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !57, file: !58, line: 82, baseType: !249, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !251, line: 569, size: 14912, elements: !252)
!251 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!252 = !{!253, !254, !329, !330, !331, !332, !336, !337, !340, !341, !345, !357, !358, !359, !361, !362, !363, !425, !446, !447, !452, !459}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !250, file: !251, line: 571, baseType: !6, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !250, file: !251, line: 576, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !251, line: 287, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !251, line: 181, size: 1408, elements: !258)
!258 = !{!259, !262, !263, !264, !266, !267, !272, !273, !274, !281, !285, !290, !294, !295, !296, !297, !301, !305, !306, !307, !309, !310, !314, !328}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !257, file: !251, line: 182, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !257, file: !251, line: 183, baseType: !6, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !257, file: !251, line: 184, baseType: !6, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !257, file: !251, line: 185, baseType: !265, size: 16, offset: 128)
!265 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !257, file: !251, line: 186, baseType: !265, size: 16, offset: 144)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !257, file: !251, line: 187, baseType: !268, size: 128, offset: 192)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !251, line: 117, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !268, file: !251, line: 118, baseType: !260, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !268, file: !251, line: 119, baseType: !6, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !257, file: !251, line: 188, baseType: !6, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !257, file: !251, line: 195, baseType: !53, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !257, file: !251, line: 197, baseType: !275, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !249, !53, !280, !6}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !279, line: 145, baseType: !80)
!279 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !257, file: !251, line: 199, baseType: !282, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!278, !249, !53, !61, !6}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !257, file: !251, line: 202, baseType: !286, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !249, !53, !289, !6}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !279, line: 114, baseType: !80)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !257, file: !251, line: 203, baseType: !291, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!6, !249, !53}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !257, file: !251, line: 206, baseType: !268, size: 128, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !257, file: !251, line: 207, baseType: !260, size: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !257, file: !251, line: 208, baseType: !6, size: 32, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !257, file: !251, line: 211, baseType: !298, size: 24, offset: 928)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 24, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 3)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !257, file: !251, line: 212, baseType: !302, size: 8, offset: 952)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 8, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !257, file: !251, line: 215, baseType: !268, size: 128, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !257, file: !251, line: 218, baseType: !6, size: 32, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !257, file: !251, line: 219, baseType: !308, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !279, line: 44, baseType: !80)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !257, file: !251, line: 222, baseType: !249, size: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !257, file: !251, line: 226, baseType: !311, size: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !279, line: 175, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !313, line: 12, baseType: !6)
!313 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !257, file: !251, line: 228, baseType: !315, size: 64, offset: 1312)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !279, line: 171, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 163, size: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !316, file: !279, line: 165, baseType: !6, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !316, file: !279, line: 170, baseType: !320, size: 32, offset: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !279, line: 166, size: 32, elements: !321)
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !320, file: !279, line: 168, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !184, line: 124, baseType: !11)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !320, file: !279, line: 169, baseType: !325, size: 32)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 32, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 4)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !257, file: !251, line: 229, baseType: !6, size: 32, offset: 1376)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !250, file: !251, line: 576, baseType: !255, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !250, file: !251, line: 576, baseType: !255, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !250, file: !251, line: 578, baseType: !6, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !250, file: !251, line: 579, baseType: !333, size: 200, offset: 288)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 200, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 25)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !250, file: !251, line: 582, baseType: !6, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !250, file: !251, line: 583, baseType: !338, size: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !251, line: 40, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !250, file: !251, line: 585, baseType: !6, size: 32, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !250, file: !251, line: 587, baseType: !342, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !249}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !250, file: !251, line: 590, baseType: !346, size: 64, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !251, line: 47, size: 256, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !347, file: !251, line: 49, baseType: !346, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !347, file: !251, line: 50, baseType: !6, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !347, file: !251, line: 50, baseType: !6, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !347, file: !251, line: 50, baseType: !6, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !347, file: !251, line: 50, baseType: !6, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !347, file: !251, line: 51, baseType: !355, size: 32, offset: 192)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 32, elements: !303)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !251, line: 25, baseType: !11)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !250, file: !251, line: 591, baseType: !6, size: 32, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !250, file: !251, line: 592, baseType: !346, size: 64, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !250, file: !251, line: 593, baseType: !360, size: 64, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !250, file: !251, line: 596, baseType: !6, size: 32, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !250, file: !251, line: 597, baseType: !280, size: 64, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !250, file: !251, line: 632, baseType: !364, size: 2880, offset: 1152)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !251, line: 599, size: 2880, elements: !365)
!365 = !{!366, !416}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !364, file: !251, line: 622, baseType: !367, size: 1728)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !251, line: 601, size: 1728, elements: !368)
!368 = !{!369, !370, !371, !375, !387, !388, !390, !398, !399, !400, !401, !405, !409, !410, !411, !412, !413, !414, !415}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !367, file: !251, line: 603, baseType: !11, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !367, file: !251, line: 604, baseType: !280, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !367, file: !251, line: 605, baseType: !372, size: 208, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 208, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 26)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !367, file: !251, line: 606, baseType: !376, size: 288, offset: 352)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !251, line: 55, size: 288, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !376, file: !251, line: 57, baseType: !6, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !376, file: !251, line: 58, baseType: !6, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !376, file: !251, line: 59, baseType: !6, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !376, file: !251, line: 60, baseType: !6, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !376, file: !251, line: 61, baseType: !6, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !376, file: !251, line: 62, baseType: !6, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !376, file: !251, line: 63, baseType: !6, size: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !376, file: !251, line: 64, baseType: !6, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !376, file: !251, line: 65, baseType: !6, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !367, file: !251, line: 607, baseType: !6, size: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !367, file: !251, line: 608, baseType: !389, size: 64, offset: 704)
!389 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !367, file: !251, line: 609, baseType: !391, size: 112, offset: 768)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !251, line: 319, size: 112, elements: !392)
!392 = !{!393, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !391, file: !251, line: 320, baseType: !394, size: 48)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 48, elements: !299)
!395 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !391, file: !251, line: 321, baseType: !394, size: 48, offset: 48)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !391, file: !251, line: 322, baseType: !395, size: 16, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !367, file: !251, line: 610, baseType: !315, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !367, file: !251, line: 611, baseType: !315, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !367, file: !251, line: 612, baseType: !315, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !367, file: !251, line: 613, baseType: !402, size: 64, offset: 1088)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !367, file: !251, line: 614, baseType: !406, size: 192, offset: 1152)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 24)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !367, file: !251, line: 615, baseType: !6, size: 32, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !367, file: !251, line: 616, baseType: !315, size: 64, offset: 1376)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !367, file: !251, line: 617, baseType: !315, size: 64, offset: 1440)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !367, file: !251, line: 618, baseType: !315, size: 64, offset: 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !367, file: !251, line: 619, baseType: !315, size: 64, offset: 1568)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !367, file: !251, line: 620, baseType: !315, size: 64, offset: 1632)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !367, file: !251, line: 621, baseType: !6, size: 32, offset: 1696)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !364, file: !251, line: 631, baseType: !417, size: 2880)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !251, line: 626, size: 2880, elements: !418)
!418 = !{!419, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !417, file: !251, line: 629, baseType: !420, size: 1920)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 1920, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 30)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !417, file: !251, line: 630, baseType: !424, size: 960, offset: 1920)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 960, elements: !421)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !250, file: !251, line: 636, baseType: !426, size: 64, offset: 4032)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !251, line: 93, size: 6336, elements: !428)
!428 = !{!429, !430, !431, !438}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !427, file: !251, line: 94, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !427, file: !251, line: 95, baseType: !6, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !427, file: !251, line: 97, baseType: !432, size: 2048, offset: 128)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 2048, elements: !436)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null}
!436 = !{!437}
!437 = !DISubrange(count: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !427, file: !251, line: 98, baseType: !439, size: 4160, offset: 2176)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !251, line: 74, size: 4160, elements: !440)
!440 = !{!441, !443, !444, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !439, file: !251, line: 75, baseType: !442, size: 2048)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !436)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !439, file: !251, line: 76, baseType: !442, size: 2048, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !439, file: !251, line: 78, baseType: !356, size: 32, offset: 4096)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !439, file: !251, line: 81, baseType: !356, size: 32, offset: 4128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !250, file: !251, line: 637, baseType: !427, size: 6336, offset: 4096)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !250, file: !251, line: 641, baseType: !448, size: 64, offset: 10432)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !6}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !250, file: !251, line: 646, baseType: !453, size: 192, offset: 10496)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !251, line: 291, size: 192, elements: !454)
!454 = !{!455, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !453, file: !251, line: 293, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !453, file: !251, line: 294, baseType: !6, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !453, file: !251, line: 295, baseType: !255, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !250, file: !251, line: 648, baseType: !460, size: 4224, offset: 10688)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 4224, elements: !299)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !57, file: !58, line: 85, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !18, line: 114, size: 640, elements: !464)
!464 = !{!465, !469, !470, !477, !490}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !463, file: !18, line: 116, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !467, line: 64, baseType: !468)
!467 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !467, line: 63, baseType: !48)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !463, file: !18, line: 118, baseType: !466, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !463, file: !18, line: 120, baseType: !471, size: 128, offset: 128)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !472, line: 51, size: 128, elements: !473)
!472 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !472, line: 52, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !472, line: 53, baseType: !475, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !463, file: !18, line: 122, baseType: !478, size: 256, offset: 256)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !18, line: 98, size: 256, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !478, file: !18, line: 107, baseType: !17, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !478, file: !18, line: 109, baseType: !466, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !478, file: !18, line: 111, baseType: !483, size: 96, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !467, line: 72, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 68, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !484, file: !467, line: 69, baseType: !6, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !484, file: !467, line: 70, baseType: !6, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !484, file: !467, line: 71, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !467, line: 61, baseType: !6)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !463, file: !18, line: 124, baseType: !471, size: 128, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !50, line: 82, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !52, line: 232, baseType: !48)
!493 = !{!494, !0, !499, !504, !506, !511, !513, !518, !520, !525, !527, !530, !532, !537, !539, !544, !546, !552, !710, !717, !736, !741, !840, !842, !844, !846, !849, !854, !859, !861, !863, !865, !867, !869, !871, !873, !875, !877, !879, !881, !887}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 228, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 152, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 19)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 264, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 560, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 70)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 264, type: !501, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 270, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 296, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 37)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 270, type: !508, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 285, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 264, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 33)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 285, type: !515, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 300, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 248, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 31)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 300, type: !522, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 316, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 240, elements: !421)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 316, type: !529, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 334, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 352, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 44)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 334, type: !534, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 342, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 272, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 34)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "__str", scope: !2, file: !3, line: 342, type: !541, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "__uk_inittab39_liblwip_init", scope: !7, file: !3, line: 371, type: !548, isLocal: true, isDefinition: true)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_init_func_t", file: !550, line: 43, baseType: !551)
!550 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/init.h", directory: "/root/.unikraft/apps/redis/build")
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "netif_status_print", scope: !7, file: !3, line: 158, type: !554, isLocal: true, isDefinition: true)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_ext_callback_t", file: !36, line: 652, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif_ext_callback", file: !36, line: 648, size: 128, elements: !556)
!556 = !{!557, !708}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "callback_fn", scope: !555, file: !36, line: 650, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_ext_callback_fn", file: !36, line: 644, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !562, !675, !676}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netif", file: !36, line: 260, size: 2240, elements: !564)
!564 = !{!565, !566, !594, !595, !596, !598, !600, !602, !603, !626, !633, !638, !645, !650, !651, !652, !654, !655, !656, !657, !661, !662, !663, !667, !668, !669, !670}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !563, file: !36, line: 263, baseType: !562, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ip_addr", scope: !563, file: !36, line: 268, baseType: !567, size: 192, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !568, line: 76, baseType: !569)
!568 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !568, line: 69, size: 192, elements: !570)
!570 = !{!571, !593}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !569, file: !568, line: 73, baseType: !572, size: 160)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !569, file: !568, line: 70, size: 160, elements: !573)
!573 = !{!574, !587}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !572, file: !568, line: 71, baseType: !575, size: 160)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !576, line: 67, baseType: !577)
!576 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !576, line: 59, size: 160, elements: !578)
!578 = !{!579, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !577, file: !576, line: 60, baseType: !580, size: 128)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 128, elements: !326)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !582, line: 129, baseType: !73)
!582 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!583 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !577, file: !576, line: 62, baseType: !584, size: 8, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !582, line: 125, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 43, baseType: !261)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !572, file: !568, line: 72, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !589, line: 57, baseType: !590)
!589 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !589, line: 51, size: 32, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !590, file: !589, line: 52, baseType: !581, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !568, line: 75, baseType: !584, size: 8, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "netmask", scope: !563, file: !36, line: 269, baseType: !567, size: 192, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !563, file: !36, line: 270, baseType: !567, size: 192, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr", scope: !563, file: !36, line: 274, baseType: !597, size: 576, offset: 640)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 576, elements: !299)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_state", scope: !563, file: !36, line: 277, baseType: !599, size: 24, offset: 1216)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 24, elements: !299)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_valid_life", scope: !563, file: !36, line: 282, baseType: !601, size: 96, offset: 1248)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 96, elements: !299)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_addr_pref_life", scope: !563, file: !36, line: 283, baseType: !601, size: 96, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !563, file: !36, line: 288, baseType: !604, size: 64, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_input_fn", file: !36, line: 178, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !611, !562}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !609, line: 96, baseType: !610)
!609 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !582, line: 126, baseType: !229)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !613, line: 186, size: 192, elements: !614)
!613 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!614 = !{!615, !616, !617, !621, !622, !623, !624, !625}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !613, line: 188, baseType: !611, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !612, file: !613, line: 191, baseType: !53, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !612, file: !613, line: 200, baseType: !618, size: 16, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !582, line: 127, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 36, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 57, baseType: !395)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !612, file: !613, line: 203, baseType: !618, size: 16, offset: 144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !612, file: !613, line: 208, baseType: !584, size: 8, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !612, file: !613, line: 211, baseType: !584, size: 8, offset: 168)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !612, file: !613, line: 218, baseType: !584, size: 8, offset: 176)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !612, file: !613, line: 221, baseType: !584, size: 8, offset: 184)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !563, file: !36, line: 294, baseType: !627, size: 64, offset: 1536)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_fn", file: !36, line: 189, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!608, !562, !611, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "linkoutput", scope: !563, file: !36, line: 299, baseType: !634, size: 64, offset: 1600)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_linkoutput_fn", file: !36, line: 212, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!608, !562, !611}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "output_ip6", scope: !563, file: !36, line: 305, baseType: !639, size: 64, offset: 1664)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_output_ip6_fn", file: !36, line: 202, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!608, !562, !611, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !563, file: !36, line: 310, baseType: !646, size: 64, offset: 1728)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_status_callback_fn", file: !36, line: 214, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !562}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "remove_callback", scope: !563, file: !36, line: 319, baseType: !646, size: 64, offset: 1792)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !563, file: !36, line: 323, baseType: !53, size: 64, offset: 1856)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !563, file: !36, line: 325, baseType: !653, size: 64, offset: 1920)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 64, elements: !303)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "chksum_flags", scope: !563, file: !36, line: 332, baseType: !618, size: 16, offset: 1984)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !563, file: !36, line: 335, baseType: !618, size: 16, offset: 2000)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mtu6", scope: !563, file: !36, line: 338, baseType: !618, size: 16, offset: 2016)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr", scope: !563, file: !36, line: 341, baseType: !658, size: 48, offset: 2032)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 48, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 6)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_len", scope: !563, file: !36, line: 343, baseType: !584, size: 8, offset: 2080)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !36, line: 345, baseType: !584, size: 8, offset: 2088)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !36, line: 347, baseType: !664, size: 16, offset: 2096)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 16, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 2)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !563, file: !36, line: 350, baseType: !584, size: 8, offset: 2112)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_autoconfig_enabled", scope: !563, file: !36, line: 353, baseType: !584, size: 8, offset: 2120)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rs_count", scope: !563, file: !36, line: 357, baseType: !584, size: 8, offset: 2128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mld_mac_filter", scope: !563, file: !36, line: 377, baseType: !671, size: 64, offset: 2176)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_mld_mac_filter_fn", file: !36, line: 222, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!608, !562, !643, !35}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_nsc_reason_t", file: !36, line: 564, baseType: !618)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "netif_ext_callback_args_t", file: !36, line: 634, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !36, line: 594, size: 192, elements: !680)
!680 = !{!681, !685, !689, !697, !702}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "link_changed", scope: !679, file: !36, line: 601, baseType: !682, size: 8)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_changed_s", file: !36, line: 597, size: 8, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !682, file: !36, line: 600, baseType: !584, size: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "status_changed", scope: !679, file: !36, line: 607, baseType: !686, size: 8)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "status_changed_s", file: !36, line: 603, size: 8, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !686, file: !36, line: 606, baseType: !584, size: 8)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_changed", scope: !679, file: !36, line: 615, baseType: !690, size: 192)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv4_changed_s", file: !36, line: 609, size: 192, elements: !691)
!691 = !{!692, !695, !696}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "old_address", scope: !690, file: !36, line: 612, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "old_netmask", scope: !690, file: !36, line: 613, baseType: !693, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "old_gw", scope: !690, file: !36, line: 614, baseType: !693, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_set", scope: !679, file: !36, line: 623, baseType: !698, size: 128)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_set_s", file: !36, line: 617, size: 128, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "addr_index", scope: !698, file: !36, line: 620, baseType: !610, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "old_address", scope: !698, file: !36, line: 622, baseType: !693, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_addr_state_changed", scope: !679, file: !36, line: 633, baseType: !703, size: 128)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_addr_state_changed_s", file: !36, line: 625, size: 128, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "addr_index", scope: !703, file: !36, line: 628, baseType: !610, size: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "old_state", scope: !703, file: !36, line: 630, baseType: !584, size: 8, offset: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !703, file: !36, line: 632, baseType: !693, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !555, file: !36, line: 651, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "_lwip_init_sem", scope: !7, file: !3, line: 173, type: !712, isLocal: true, isDefinition: true)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !713, line: 51, size: 192, elements: !714)
!713 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !712, file: !713, line: 52, baseType: !80, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !712, file: !713, line: 53, baseType: !84, size: 128, offset: 64)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__str", scope: !719, file: !720, line: 198, type: !402, isLocal: true, isDefinition: true)
!719 = distinct !DISubprogram(name: "uk_pr_crit", scope: !720, file: !720, line: 194, type: !721, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !723)
!720 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!721 = !DISubroutineType(types: !722)
!722 = !{null, !61, null}
!723 = !{!724, !725}
!724 = !DILocalVariable(name: "fmt", arg: 1, scope: !719, file: !720, line: 194, type: !61)
!725 = !DILocalVariable(name: "argp", scope: !719, file: !720, line: 196, type: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !727, line: 32, baseType: !728)
!727 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !729)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 192, elements: !303)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !731)
!731 = !{!732, !733, !734, !735}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !730, file: !3, line: 196, baseType: !11, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !730, file: !3, line: 196, baseType: !11, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !730, file: !3, line: 196, baseType: !53, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !730, file: !3, line: 196, baseType: !53, size: 64, offset: 128)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "__str", scope: !719, file: !720, line: 198, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 56, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 7)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 72, type: !837, isLocal: true, isDefinition: true)
!743 = distinct !DISubprogram(name: "_netif_status_print", scope: !3, file: !3, line: 61, type: !560, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !744)
!744 = !{!745, !746, !747, !748, !752, !753, !754, !755, !756, !757, !765, !766, !767, !775, !776, !777, !780, !786, !787, !788, !789, !792, !798, !799, !800, !801, !809, !810, !811, !812, !813, !821, !822, !823, !824, !825, !833, !834, !835, !836}
!745 = !DILocalVariable(name: "nf", arg: 1, scope: !743, file: !3, line: 61, type: !562)
!746 = !DILocalVariable(name: "reason", arg: 2, scope: !743, file: !3, line: 61, type: !675)
!747 = !DILocalVariable(name: "args", arg: 3, scope: !743, file: !3, line: 62, type: !676)
!748 = !DILocalVariable(name: "str_ip4_addr", scope: !743, file: !3, line: 64, type: !749)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 136, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 17)
!752 = !DILocalVariable(name: "_dss_str_ip4_addr", scope: !743, file: !3, line: 65, type: !280)
!753 = !DILocalVariable(name: "str_ip4_mask", scope: !743, file: !3, line: 66, type: !749)
!754 = !DILocalVariable(name: "_dss_str_ip4_mask", scope: !743, file: !3, line: 67, type: !280)
!755 = !DILocalVariable(name: "str_ip4_gw", scope: !743, file: !3, line: 68, type: !749)
!756 = !DILocalVariable(name: "_dss_str_ip4_gw", scope: !743, file: !3, line: 69, type: !280)
!757 = !DILocalVariable(name: "tid", scope: !758, file: !3, line: 72, type: !73)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 72, column: 3)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 72, column: 3)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 72, column: 3)
!761 = distinct !DILexicalBlock(scope: !762, file: !3, line: 72, column: 3)
!762 = distinct !DILexicalBlock(scope: !763, file: !3, line: 72, column: 3)
!763 = distinct !DILexicalBlock(scope: !764, file: !3, line: 71, column: 37)
!764 = distinct !DILexicalBlock(scope: !743, file: !3, line: 71, column: 6)
!765 = !DILocalVariable(name: "_arg3", scope: !758, file: !3, line: 72, type: !49)
!766 = !DILocalVariable(name: "_arg4", scope: !758, file: !3, line: 72, type: !49)
!767 = !DILocalVariable(name: "tid", scope: !768, file: !3, line: 77, type: !73)
!768 = distinct !DILexicalBlock(scope: !769, file: !3, line: 77, column: 3)
!769 = distinct !DILexicalBlock(scope: !770, file: !3, line: 77, column: 3)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 77, column: 3)
!771 = distinct !DILexicalBlock(scope: !772, file: !3, line: 77, column: 3)
!772 = distinct !DILexicalBlock(scope: !773, file: !3, line: 77, column: 3)
!773 = distinct !DILexicalBlock(scope: !774, file: !3, line: 76, column: 39)
!774 = distinct !DILexicalBlock(scope: !743, file: !3, line: 76, column: 6)
!775 = !DILocalVariable(name: "_arg3", scope: !768, file: !3, line: 77, type: !49)
!776 = !DILocalVariable(name: "_arg4", scope: !768, file: !3, line: 77, type: !49)
!777 = !DILocalVariable(name: "state", scope: !778, file: !3, line: 82, type: !280)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 81, column: 38)
!779 = distinct !DILexicalBlock(scope: !743, file: !3, line: 81, column: 6)
!780 = !DILocalVariable(name: "tid", scope: !781, file: !3, line: 83, type: !73)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 83, column: 3)
!782 = distinct !DILexicalBlock(scope: !783, file: !3, line: 83, column: 3)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 83, column: 3)
!784 = distinct !DILexicalBlock(scope: !785, file: !3, line: 83, column: 3)
!785 = distinct !DILexicalBlock(scope: !778, file: !3, line: 83, column: 3)
!786 = !DILocalVariable(name: "_arg3", scope: !781, file: !3, line: 83, type: !49)
!787 = !DILocalVariable(name: "_arg4", scope: !781, file: !3, line: 83, type: !49)
!788 = !DILocalVariable(name: "_arg5", scope: !781, file: !3, line: 83, type: !49)
!789 = !DILocalVariable(name: "state", scope: !790, file: !3, line: 88, type: !280)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 87, column: 40)
!791 = distinct !DILexicalBlock(scope: !743, file: !3, line: 87, column: 6)
!792 = !DILocalVariable(name: "tid", scope: !793, file: !3, line: 89, type: !73)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 89, column: 3)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 89, column: 3)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 89, column: 3)
!796 = distinct !DILexicalBlock(scope: !797, file: !3, line: 89, column: 3)
!797 = distinct !DILexicalBlock(scope: !790, file: !3, line: 89, column: 3)
!798 = !DILocalVariable(name: "_arg3", scope: !793, file: !3, line: 89, type: !49)
!799 = !DILocalVariable(name: "_arg4", scope: !793, file: !3, line: 89, type: !49)
!800 = !DILocalVariable(name: "_arg5", scope: !793, file: !3, line: 89, type: !49)
!801 = !DILocalVariable(name: "tid", scope: !802, file: !3, line: 112, type: !73)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 112, column: 3)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 112, column: 3)
!804 = distinct !DILexicalBlock(scope: !805, file: !3, line: 112, column: 3)
!805 = distinct !DILexicalBlock(scope: !806, file: !3, line: 112, column: 3)
!806 = distinct !DILexicalBlock(scope: !807, file: !3, line: 112, column: 3)
!807 = distinct !DILexicalBlock(scope: !808, file: !3, line: 98, column: 51)
!808 = distinct !DILexicalBlock(scope: !743, file: !3, line: 95, column: 6)
!809 = !DILocalVariable(name: "_arg3", scope: !802, file: !3, line: 112, type: !49)
!810 = !DILocalVariable(name: "_arg4", scope: !802, file: !3, line: 112, type: !49)
!811 = !DILocalVariable(name: "_arg5", scope: !802, file: !3, line: 112, type: !49)
!812 = !DILocalVariable(name: "_arg6", scope: !802, file: !3, line: 112, type: !49)
!813 = !DILocalVariable(name: "tid", scope: !814, file: !3, line: 129, type: !73)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 129, column: 3)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 129, column: 3)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 129, column: 3)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 129, column: 3)
!818 = distinct !DILexicalBlock(scope: !819, file: !3, line: 129, column: 3)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 120, column: 34)
!820 = distinct !DILexicalBlock(scope: !743, file: !3, line: 120, column: 6)
!821 = !DILocalVariable(name: "_arg3", scope: !814, file: !3, line: 129, type: !49)
!822 = !DILocalVariable(name: "_arg4", scope: !814, file: !3, line: 129, type: !49)
!823 = !DILocalVariable(name: "_arg5", scope: !814, file: !3, line: 129, type: !49)
!824 = !DILocalVariable(name: "_arg6", scope: !814, file: !3, line: 129, type: !49)
!825 = !DILocalVariable(name: "tid", scope: !826, file: !3, line: 146, type: !73)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 146, column: 3)
!827 = distinct !DILexicalBlock(scope: !828, file: !3, line: 146, column: 3)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 146, column: 3)
!829 = distinct !DILexicalBlock(scope: !830, file: !3, line: 146, column: 3)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 146, column: 3)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 135, column: 49)
!832 = distinct !DILexicalBlock(scope: !743, file: !3, line: 135, column: 6)
!833 = !DILocalVariable(name: "_arg3", scope: !826, file: !3, line: 146, type: !49)
!834 = !DILocalVariable(name: "_arg4", scope: !826, file: !3, line: 146, type: !49)
!835 = !DILocalVariable(name: "_arg5", scope: !826, file: !3, line: 146, type: !49)
!836 = !DILocalVariable(name: "_arg6", scope: !826, file: !3, line: 146, type: !49)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 120, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 15)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 72, type: !837, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 77, type: !749, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 77, type: !749, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 82, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 24, elements: !299)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 82, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 40, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 5)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 83, type: !856, isLocal: true, isDefinition: true)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 160, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 20)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 83, type: !856, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 88, type: !848, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 88, type: !851, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 89, type: !333, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 89, type: !333, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 112, type: !508, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 112, type: !508, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 129, type: !515, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 129, type: !515, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 146, type: !515, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "__str", scope: !743, file: !3, line: 146, type: !515, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "__str", scope: !883, file: !720, line: 190, type: !402, isLocal: true, isDefinition: true)
!883 = distinct !DISubprogram(name: "uk_pr_err", scope: !720, file: !720, line: 186, type: !721, isLocal: true, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, unit: !7, retainedNodes: !884)
!884 = !{!885, !886}
!885 = !DILocalVariable(name: "fmt", arg: 1, scope: !883, file: !720, line: 186, type: !61)
!886 = !DILocalVariable(name: "argp", scope: !883, file: !720, line: 188, type: !726)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__str", scope: !883, file: !720, line: 190, type: !738, isLocal: true, isDefinition: true)
!889 = !{!890, !891, !1107, !1108, !1110, !1111, !1112, !1113, !1115, !1116, !1117, !1118, !1119, !1125, !1131, !1137, !1138, !1144, !1145, !1149, !1155, !1156, !1162, !1163, !1171, !1177, !1183, !1184, !1194, !1200, !1201, !1211, !1217, !1218, !1228, !1236, !1244, !1245}
!890 = !DILocalVariable(name: "devid", scope: !2, file: !3, line: 211, type: !11)
!891 = !DILocalVariable(name: "dev", scope: !2, file: !3, line: 212, type: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev", file: !10, line: 450, size: 640, elements: !894)
!894 = !{!895, !929, !937, !961, !1089, !1091, !1093, !1099, !1106}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "tx_one", scope: !893, file: !10, line: 452, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_tx_one_t", file: !10, line: 367, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!6, !892, !900, !902}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_tx_queue", file: !10, line: 175, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netbuf", file: !904, line: 104, size: 640, elements: !905)
!904 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uknetdev/include/uk/netbuf.h", directory: "/root/.unikraft/apps/redis/build")
!905 = !{!906, !907, !908, !909, !910, !916, !917, !918, !922, !927, !928}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !904, line: 105, baseType: !902, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !903, file: !904, line: 106, baseType: !902, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !903, file: !904, line: 108, baseType: !53, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !903, file: !904, line: 109, baseType: !619, size: 16, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !903, file: !904, line: 110, baseType: !911, size: 32, offset: 224)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic", file: !79, line: 253, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 251, size: 32, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !912, file: !79, line: 252, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !79, line: 88, baseType: !11)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !903, file: !904, line: 112, baseType: !53, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !903, file: !904, line: 114, baseType: !53, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !903, file: !904, line: 115, baseType: !919, size: 64, offset: 384)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !920, line: 40, baseType: !921)
!920 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !279, line: 129, baseType: !48)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !903, file: !904, line: 117, baseType: !923, size: 64, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netbuf_dtor_t", file: !904, line: 51, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !902}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_a", scope: !903, file: !904, line: 118, baseType: !174, size: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_b", scope: !903, file: !904, line: 119, baseType: !53, size: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "rx_one", scope: !893, file: !10, line: 455, baseType: !930, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rx_one_t", file: !10, line: 362, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!6, !892, !934, !936}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_rx_queue", file: !10, line: 176, flags: DIFlagFwdDecl)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !893, file: !10, line: 458, baseType: !938, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_data", file: !10, line: 426, size: 256, elements: !940)
!940 = !{!941, !942, !958, !960}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !939, file: !10, line: 427, baseType: !9, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_handler", scope: !939, file: !10, line: 429, baseType: !943, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_event_handler", file: !10, line: 408, size: 640, elements: !945)
!945 = !{!946, !951, !952, !953, !954, !955, !956, !957}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !944, file: !10, line: 409, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_queue_event_t", file: !10, line: 235, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !892, !619, !53}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !944, file: !10, line: 410, baseType: !53, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !944, file: !10, line: 413, baseType: !712, size: 192, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !944, file: !10, line: 414, baseType: !892, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "queue_id", scope: !944, file: !10, line: 415, baseType: !619, size: 16, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher", scope: !944, file: !10, line: 416, baseType: !56, size: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher_name", scope: !944, file: !10, line: 417, baseType: !280, size: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher_s", scope: !944, file: !10, line: 418, baseType: !100, size: 64, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !939, file: !10, line: 431, baseType: !959, size: 16, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "drv_name", scope: !939, file: !10, line: 432, baseType: !61, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !893, file: !10, line: 461, baseType: !962, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_ops", file: !10, line: 374, size: 1024, elements: !965)
!965 = !{!966, !971, !973, !984, !989, !994, !999, !1004, !1009, !1025, !1037, !1039, !1046, !1057, !1066, !1084}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_intr_enable", scope: !964, file: !10, line: 376, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_intr_enable_t", file: !10, line: 341, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!6, !892, !934}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_intr_disable", scope: !964, file: !10, line: 377, baseType: !972, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_intr_disable_t", file: !10, line: 345, baseType: !968)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_get", scope: !964, file: !10, line: 380, baseType: !974, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_hwaddr_get_t", file: !10, line: 320, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!978, !892}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_hwaddr", file: !10, line: 122, size: 48, elements: !981)
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "addr_bytes", scope: !980, file: !10, line: 123, baseType: !983, size: 48)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 48, elements: !659)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "hwaddr_set", scope: !964, file: !10, line: 381, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_hwaddr_set_t", file: !10, line: 324, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!6, !892, !978}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_get", scope: !964, file: !10, line: 384, baseType: !990, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_mtu_get_t", file: !10, line: 335, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!619, !892}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_set", scope: !964, file: !10, line: 385, baseType: !995, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_mtu_set_t", file: !10, line: 338, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!6, !892, !619}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "promiscuous_set", scope: !964, file: !10, line: 388, baseType: !1000, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_promiscuous_set_t", file: !10, line: 331, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!6, !892, !11}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "promiscuous_get", scope: !964, file: !10, line: 389, baseType: !1005, size: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_promiscuous_get_t", file: !10, line: 328, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!11, !892}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "info_get", scope: !964, file: !10, line: 392, baseType: !1010, size: 64, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_info_get_t", file: !10, line: 283, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !892, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_info", file: !10, line: 141, size: 160, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "max_rx_queues", scope: !1015, file: !10, line: 142, baseType: !619, size: 16)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_queues", scope: !1015, file: !10, line: 143, baseType: !619, size: 16, offset: 16)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "in_queue_pairs", scope: !1015, file: !10, line: 144, baseType: !6, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max_mtu", scope: !1015, file: !10, line: 145, baseType: !619, size: 16, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nb_encap_tx", scope: !1015, file: !10, line: 146, baseType: !619, size: 16, offset: 80)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nb_encap_rx", scope: !1015, file: !10, line: 147, baseType: !619, size: 16, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ioalign", scope: !1015, file: !10, line: 148, baseType: !619, size: 16, offset: 112)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !1015, file: !10, line: 149, baseType: !73, size: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "txq_info_get", scope: !964, file: !10, line: 393, baseType: !1026, size: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_txq_info_get_t", file: !10, line: 303, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!6, !892, !619, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_netdev_queue_info", file: !10, line: 155, size: 96, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nb_max", scope: !1031, file: !10, line: 156, baseType: !619, size: 16)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "nb_min", scope: !1031, file: !10, line: 157, baseType: !619, size: 16, offset: 16)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nb_align", scope: !1031, file: !10, line: 158, baseType: !619, size: 16, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nb_is_power_of_two", scope: !1031, file: !10, line: 159, baseType: !6, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rxq_info_get", scope: !964, file: !10, line: 394, baseType: !1038, size: 64, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_rxq_info_get_t", file: !10, line: 297, baseType: !1027)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "einfo_get", scope: !964, file: !10, line: 395, baseType: !1040, size: 64, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_netdev_einfo_get_t", file: !10, line: 287, baseType: !1041)
