; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lapi.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lapi.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_TValue = type { %union.Value, i32 }
%union.Value = type { %union.GCObject* }
%union.GCObject = type { %struct.lua_State }
%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "lua_ident", scope: !2, file: !3, line: 34, type: !352, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !351)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lapi.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !8, !9, !35, !340, !257, !85, !180, !74, !341, !346}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !11, line: 36, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !13, line: 136, size: 1472, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !25, !53, !112, !336, !337, !338, !339}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !12, file: !13, line: 137, baseType: !16, size: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !11, line: 51, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !11, line: 49, size: 128, elements: !18)
!18 = !{!19, !20, !24}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !11, line: 50, baseType: !9, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !17, file: !11, line: 50, baseType: !21, size: 8, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !17, file: !11, line: 50, baseType: !21, size: 8, offset: 72)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !12, file: !13, line: 138, baseType: !26, size: 192)
!26 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !11, line: 199, size: 192, elements: !27)
!27 = !{!28, !38}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !26, file: !11, line: 200, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !22, line: 47, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 47, size: 64, elements: !31)
!31 = !{!32, !34, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !30, file: !22, line: 47, baseType: !33, size: 64)
!33 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !30, file: !22, line: 47, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !30, file: !22, line: 47, baseType: !37, size: 64)
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !26, file: !11, line: 206, baseType: !39, size: 192)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !11, line: 201, size: 192, elements: !40)
!40 = !{!41, !42, !43, !44, !45, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !11, line: 202, baseType: !9, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !39, file: !11, line: 202, baseType: !21, size: 8, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !39, file: !11, line: 202, baseType: !21, size: 8, offset: 72)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !39, file: !11, line: 203, baseType: !21, size: 8, offset: 80)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !39, file: !11, line: 204, baseType: !46, size: 32, offset: 96)
!46 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !11, line: 205, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 40, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !51, line: 129, baseType: !52)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !12, file: !13, line: 139, baseType: !54, size: 320)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !11, line: 215, size: 320, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !54, file: !11, line: 216, baseType: !29, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !54, file: !11, line: 222, baseType: !58, size: 320)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !54, file: !11, line: 217, size: 320, elements: !59)
!59 = !{!60, !61, !62, !63, !110, !111}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !11, line: 218, baseType: !9, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !58, file: !11, line: 218, baseType: !21, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !58, file: !11, line: 218, baseType: !21, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !58, file: !11, line: 219, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !11, line: 338, size: 512, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !89, !107, !108, !109}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !11, line: 339, baseType: !9, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !65, file: !11, line: 339, baseType: !21, size: 8, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !65, file: !11, line: 339, baseType: !21, size: 8, offset: 72)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !11, line: 340, baseType: !21, size: 8, offset: 80)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !65, file: !11, line: 341, baseType: !21, size: 8, offset: 88)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !65, file: !11, line: 342, baseType: !64, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !65, file: !11, line: 343, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !11, line: 75, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !11, line: 73, size: 128, elements: !77)
!77 = !{!78, !88}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !11, line: 74, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !11, line: 64, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !11, line: 59, size: 64, elements: !81)
!81 = !{!82, !83, !84, !87}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !80, file: !11, line: 60, baseType: !9, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !80, file: !11, line: 61, baseType: !35, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !80, file: !11, line: 62, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !86, line: 99, baseType: !33)
!86 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !80, file: !11, line: 63, baseType: !8, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !76, file: !11, line: 74, baseType: !8, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !65, file: !11, line: 344, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !11, line: 335, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !11, line: 332, size: 320, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !92, file: !11, line: 333, baseType: !75, size: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !92, file: !11, line: 334, baseType: !96, size: 192, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !11, line: 329, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !11, line: 323, size: 192, elements: !98)
!98 = !{!99, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !97, file: !11, line: 327, baseType: !100, size: 192)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !97, file: !11, line: 324, size: 192, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !11, line: 325, baseType: !79, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !100, file: !11, line: 325, baseType: !8, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !11, line: 326, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !97, file: !11, line: 328, baseType: !75, size: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !65, file: !11, line: 345, baseType: !90, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !65, file: !11, line: 346, baseType: !9, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !65, file: !11, line: 347, baseType: !8, size: 32, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !58, file: !11, line: 220, baseType: !64, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, file: !11, line: 221, baseType: !48, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !12, file: !13, line: 140, baseType: !113, size: 448)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !11, line: 309, size: 448, elements: !114)
!114 = !{!115, !285}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !113, file: !11, line: 310, baseType: !116, size: 448)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !11, line: 299, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !11, line: 295, size: 448, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !281}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !11, line: 296, baseType: !9, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !117, file: !11, line: 296, baseType: !21, size: 8, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !117, file: !11, line: 296, baseType: !21, size: 8, offset: 72)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !117, file: !11, line: 296, baseType: !21, size: 8, offset: 80)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !117, file: !11, line: 296, baseType: !21, size: 8, offset: 88)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !117, file: !11, line: 296, baseType: !9, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !117, file: !11, line: 296, baseType: !64, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !117, file: !11, line: 297, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !86, line: 52, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!8, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !86, line: 50, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !13, line: 100, size: 1472, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !141, !142, !218, !232, !233, !234, !235, !236, !237, !238, !239, !241, !242, !243, !244, !245, !246, !271, !272, !273, !274, !275, !278}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !13, line: 101, baseType: !9, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !133, file: !13, line: 101, baseType: !21, size: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !133, file: !13, line: 101, baseType: !21, size: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !133, file: !13, line: 102, baseType: !21, size: 8, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !133, file: !13, line: 103, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !11, line: 193, baseType: !74)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !133, file: !13, line: 104, baseType: !140, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !133, file: !13, line: 105, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !13, line: 94, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !13, line: 68, size: 3456, elements: !146)
!146 = !{!147, !156, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !179, !181, !182, !183, !184, !185, !186, !187, !188, !190, !208, !212}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !145, file: !13, line: 69, baseType: !148, size: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !13, line: 42, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !13, line: 38, size: 128, elements: !150)
!150 = !{!151, !153, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !149, file: !13, line: 39, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !149, file: !13, line: 40, baseType: !154, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !22, line: 18, baseType: !46)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !149, file: !13, line: 41, baseType: !8, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !145, file: !13, line: 70, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !86, line: 66, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!35, !35, !35, !48, !48}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !145, file: !13, line: 71, baseType: !35, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !145, file: !13, line: 72, baseType: !21, size: 8, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !145, file: !13, line: 73, baseType: !21, size: 8, offset: 264)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !145, file: !13, line: 74, baseType: !8, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !145, file: !13, line: 75, baseType: !9, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !145, file: !13, line: 76, baseType: !152, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !145, file: !13, line: 77, baseType: !9, size: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !145, file: !13, line: 78, baseType: !9, size: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !145, file: !13, line: 79, baseType: !9, size: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !145, file: !13, line: 80, baseType: !9, size: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !145, file: !13, line: 81, baseType: !172, size: 192, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !173, line: 28, baseType: !174)
!173 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !173, line: 24, size: 192, elements: !175)
!175 = !{!176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !174, file: !173, line: 25, baseType: !6, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !174, file: !173, line: 26, baseType: !48, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !174, file: !173, line: 27, baseType: !48, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !145, file: !13, line: 82, baseType: !180, size: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !22, line: 20, baseType: !48)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !145, file: !13, line: 83, baseType: !180, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !145, file: !13, line: 84, baseType: !180, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !145, file: !13, line: 85, baseType: !180, size: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !145, file: !13, line: 86, baseType: !8, size: 32, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !145, file: !13, line: 87, baseType: !8, size: 32, offset: 1184)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !145, file: !13, line: 88, baseType: !127, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !145, file: !13, line: 89, baseType: !75, size: 128, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !145, file: !13, line: 90, baseType: !189, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !145, file: !13, line: 91, baseType: !191, size: 320, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !11, line: 284, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !11, line: 274, size: 320, elements: !193)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !11, line: 275, baseType: !9, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !192, file: !11, line: 275, baseType: !21, size: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !192, file: !11, line: 275, baseType: !21, size: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !192, file: !11, line: 276, baseType: !74, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !192, file: !11, line: 283, baseType: !199, size: 128, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !11, line: 277, size: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !11, line: 278, baseType: !75, size: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !199, file: !11, line: 282, baseType: !203, size: 128)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !11, line: 279, size: 128, elements: !204)
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !11, line: 280, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !11, line: 281, baseType: !206, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !145, file: !13, line: 92, baseType: !209, size: 576, offset: 1792)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 576, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 9)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !145, file: !13, line: 93, baseType: !213, size: 1088, offset: 2368)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1088, elements: !216)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !11, line: 207, baseType: !26)
!216 = !{!217}
!217 = !DISubrange(count: 17)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !133, file: !13, line: 106, baseType: !219, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !13, line: 55, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !13, line: 48, size: 320, elements: !222)
!222 = !{!223, !224, !225, !226, !230, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !221, file: !13, line: 49, baseType: !140, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !221, file: !13, line: 50, baseType: !140, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !221, file: !13, line: 51, baseType: !140, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !221, file: !13, line: 52, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !22, line: 88, baseType: !154)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !221, file: !13, line: 53, baseType: !8, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !221, file: !13, line: 54, baseType: !8, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !133, file: !13, line: 107, baseType: !227, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !133, file: !13, line: 108, baseType: !140, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !133, file: !13, line: 109, baseType: !140, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !133, file: !13, line: 110, baseType: !219, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !133, file: !13, line: 111, baseType: !219, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !133, file: !13, line: 112, baseType: !8, size: 32, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !133, file: !13, line: 113, baseType: !8, size: 32, offset: 736)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !133, file: !13, line: 114, baseType: !240, size: 16, offset: 768)
!240 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !133, file: !13, line: 115, baseType: !240, size: 16, offset: 784)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !133, file: !13, line: 116, baseType: !21, size: 8, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !133, file: !13, line: 117, baseType: !21, size: 8, offset: 808)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !133, file: !13, line: 118, baseType: !8, size: 32, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !133, file: !13, line: 119, baseType: !8, size: 32, offset: 864)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !133, file: !13, line: 120, baseType: !247, size: 64, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !86, line: 330, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !131, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !86, line: 326, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !86, line: 346, size: 960, elements: !254)
!254 = !{!255, !256, !259, !260, !261, !262, !263, !264, !265, !266, !270}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !253, file: !86, line: 347, baseType: !8, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !86, line: 348, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !253, file: !86, line: 349, baseType: !257, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !253, file: !86, line: 350, baseType: !257, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !253, file: !86, line: 351, baseType: !257, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !253, file: !86, line: 352, baseType: !8, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !253, file: !86, line: 353, baseType: !8, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !253, file: !86, line: 354, baseType: !8, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !253, file: !86, line: 355, baseType: !8, size: 32, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !253, file: !86, line: 356, baseType: !267, size: 480, offset: 448)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 480, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 60)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !253, file: !86, line: 358, baseType: !8, size: 32, offset: 928)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !133, file: !13, line: 121, baseType: !75, size: 128, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !133, file: !13, line: 122, baseType: !75, size: 128, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !133, file: !13, line: 123, baseType: !9, size: 64, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !133, file: !13, line: 124, baseType: !9, size: 64, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !133, file: !13, line: 125, baseType: !276, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !13, line: 18, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !133, file: !13, line: 126, baseType: !279, size: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !280, line: 49, baseType: !37)
!280 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !117, file: !11, line: 298, baseType: !282, size: 128, offset: 320)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 1)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !113, file: !11, line: 311, baseType: !286, size: 384)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !11, line: 306, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !11, line: 302, size: 384, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !333}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !11, line: 303, baseType: !9, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !287, file: !11, line: 303, baseType: !21, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !287, file: !11, line: 303, baseType: !21, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !287, file: !11, line: 303, baseType: !21, size: 8, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !287, file: !11, line: 303, baseType: !21, size: 8, offset: 88)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !287, file: !11, line: 303, baseType: !9, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !287, file: !11, line: 303, baseType: !64, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !287, file: !11, line: 304, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !11, line: 231, size: 960, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !306, !308, !310, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !11, line: 232, baseType: !9, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !298, file: !11, line: 232, baseType: !21, size: 8, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !298, file: !11, line: 232, baseType: !21, size: 8, offset: 72)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !298, file: !11, line: 233, baseType: !74, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !298, file: !11, line: 234, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !298, file: !11, line: 235, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !298, file: !11, line: 236, baseType: !309, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !298, file: !11, line: 237, baseType: !311, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !11, line: 262, size: 128, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !312, file: !11, line: 263, baseType: !214, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !312, file: !11, line: 264, baseType: !8, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !312, file: !11, line: 265, baseType: !8, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !298, file: !11, line: 238, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !298, file: !11, line: 239, baseType: !214, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !298, file: !11, line: 240, baseType: !8, size: 32, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !298, file: !11, line: 241, baseType: !8, size: 32, offset: 608)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !298, file: !11, line: 242, baseType: !8, size: 32, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !298, file: !11, line: 243, baseType: !8, size: 32, offset: 672)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !298, file: !11, line: 244, baseType: !8, size: 32, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !298, file: !11, line: 245, baseType: !8, size: 32, offset: 736)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !298, file: !11, line: 246, baseType: !8, size: 32, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !298, file: !11, line: 247, baseType: !8, size: 32, offset: 800)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !298, file: !11, line: 248, baseType: !9, size: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !298, file: !11, line: 249, baseType: !21, size: 8, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !298, file: !11, line: 250, baseType: !21, size: 8, offset: 904)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !298, file: !11, line: 251, baseType: !21, size: 8, offset: 912)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !298, file: !11, line: 252, baseType: !21, size: 8, offset: 920)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !287, file: !11, line: 305, baseType: !334, size: 64, offset: 320)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !283)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !12, file: !13, line: 141, baseType: !65, size: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !12, file: !13, line: 142, baseType: !298, size: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !12, file: !13, line: 143, baseType: !192, size: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !12, file: !13, line: 144, baseType: !133, size: 1472)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Integer", file: !86, line: 103, baseType: !279)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallS", file: !3, line: 792, size: 128, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !342, file: !3, line: 793, baseType: !140, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !342, file: !3, line: 794, baseType: !8, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CCallS", file: !3, line: 831, size: 128, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !347, file: !3, line: 832, baseType: !127, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !347, file: !3, line: 833, baseType: !35, size: 64, offset: 64)
!351 = !{!0}
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 1128, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 141)
!355 = !{i32 2, !"Dwarf Version", i32 4}
!356 = !{i32 2, !"Debug Info Version", i32 3}
!357 = !{i32 1, !"wchar_size", i32 4}
!358 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!359 = distinct !DISubprogram(name: "luaA_pushobject", scope: !3, file: !3, line: 89, type: !360, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !364)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !131, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!364 = !{!365, !366, !367, !369}
!365 = !DILocalVariable(name: "L", arg: 1, scope: !359, file: !3, line: 89, type: !131)
!366 = !DILocalVariable(name: "o", arg: 2, scope: !359, file: !3, line: 89, type: !362)
!367 = !DILocalVariable(name: "o2", scope: !368, file: !3, line: 90, type: !362)
!368 = distinct !DILexicalBlock(scope: !359, file: !3, line: 90, column: 3)
!369 = !DILocalVariable(name: "o1", scope: !368, file: !3, line: 90, type: !74)
!370 = !DILocation(line: 89, column: 34, scope: !359)
!371 = !DILocation(line: 89, column: 51, scope: !359)
!372 = !DILocation(line: 90, column: 3, scope: !368)
!373 = !{!374, !375, i64 16}
!374 = !{!"lua_State", !375, i64 0, !376, i64 8, !376, i64 9, !376, i64 10, !375, i64 16, !375, i64 24, !375, i64 32, !375, i64 40, !375, i64 48, !375, i64 56, !375, i64 64, !375, i64 72, !375, i64 80, !378, i64 88, !378, i64 92, !379, i64 96, !379, i64 98, !376, i64 100, !376, i64 101, !378, i64 104, !378, i64 108, !375, i64 112, !380, i64 120, !380, i64 136, !375, i64 152, !375, i64 160, !375, i64 168, !381, i64 176}
!375 = !{!"any pointer", !376, i64 0}
!376 = !{!"omnipotent char", !377, i64 0}
!377 = !{!"Simple C/C++ TBAA"}
!378 = !{!"int", !376, i64 0}
!379 = !{!"short", !376, i64 0}
!380 = !{!"lua_TValue", !376, i64 0, !378, i64 8}
!381 = !{!"long", !376, i64 0}
!382 = !{!380, !378, i64 8}
!383 = !DILocation(line: 91, column: 3, scope: !384)
!384 = distinct !DILexicalBlock(scope: !359, file: !3, line: 91, column: 3)
!385 = !DILocation(line: 92, column: 1, scope: !359)
!386 = distinct !DISubprogram(name: "lua_checkstack", scope: !3, file: !3, line: 95, type: !387, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!8, !131, !8}
!389 = !{!390, !391, !392}
!390 = !DILocalVariable(name: "L", arg: 1, scope: !386, file: !3, line: 95, type: !131)
!391 = !DILocalVariable(name: "size", arg: 2, scope: !386, file: !3, line: 95, type: !8)
!392 = !DILocalVariable(name: "res", scope: !386, file: !3, line: 96, type: !8)
!393 = !DILocation(line: 95, column: 40, scope: !386)
!394 = !DILocation(line: 95, column: 47, scope: !386)
!395 = !DILocation(line: 96, column: 7, scope: !386)
!396 = !DILocation(line: 98, column: 12, scope: !397)
!397 = distinct !DILexicalBlock(scope: !386, file: !3, line: 98, column: 7)
!398 = !DILocation(line: 98, column: 29, scope: !397)
!399 = !DILocation(line: 98, column: 36, scope: !397)
!400 = !DILocation(line: 98, column: 45, scope: !397)
!401 = !{!374, !375, i64 24}
!402 = !DILocation(line: 98, column: 40, scope: !397)
!403 = !DILocation(line: 98, column: 52, scope: !397)
!404 = !DILocation(line: 98, column: 50, scope: !397)
!405 = !DILocation(line: 98, column: 58, scope: !397)
!406 = !DILocation(line: 98, column: 7, scope: !386)
!407 = !DILocation(line: 100, column: 17, scope: !408)
!408 = distinct !DILexicalBlock(scope: !397, file: !3, line: 100, column: 12)
!409 = !DILocation(line: 100, column: 12, scope: !397)
!410 = !DILocation(line: 101, column: 5, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 101, column: 5)
!412 = distinct !DILexicalBlock(scope: !408, file: !3, line: 100, column: 22)
!413 = !{!374, !375, i64 56}
!414 = !DILocation(line: 101, column: 5, scope: !412)
!415 = !DILocation(line: 102, column: 25, scope: !416)
!416 = distinct !DILexicalBlock(scope: !412, file: !3, line: 102, column: 9)
!417 = !DILocation(line: 102, column: 12, scope: !416)
!418 = !{!374, !375, i64 40}
!419 = !DILocation(line: 102, column: 16, scope: !416)
!420 = !{!421, !375, i64 16}
!421 = !{!"CallInfo", !375, i64 0, !375, i64 8, !375, i64 16, !375, i64 24, !378, i64 32, !378, i64 36}
!422 = !DILocation(line: 102, column: 29, scope: !416)
!423 = !DILocation(line: 102, column: 20, scope: !416)
!424 = !DILocation(line: 102, column: 9, scope: !412)
!425 = !DILocation(line: 103, column: 18, scope: !416)
!426 = !DILocation(line: 103, column: 7, scope: !416)
!427 = !DILocation(line: 0, scope: !386)
!428 = !DILocation(line: 106, column: 3, scope: !386)
!429 = distinct !DISubprogram(name: "lua_xmove", scope: !3, file: !3, line: 110, type: !430, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !131, !131, !8}
!432 = !{!433, !434, !435, !436, !437, !442}
!433 = !DILocalVariable(name: "from", arg: 1, scope: !429, file: !3, line: 110, type: !131)
!434 = !DILocalVariable(name: "to", arg: 2, scope: !429, file: !3, line: 110, type: !131)
!435 = !DILocalVariable(name: "n", arg: 3, scope: !429, file: !3, line: 110, type: !8)
!436 = !DILocalVariable(name: "i", scope: !429, file: !3, line: 111, type: !8)
!437 = !DILocalVariable(name: "o2", scope: !438, file: !3, line: 119, type: !362)
!438 = distinct !DILexicalBlock(scope: !439, file: !3, line: 119, column: 5)
!439 = distinct !DILexicalBlock(scope: !440, file: !3, line: 118, column: 27)
!440 = distinct !DILexicalBlock(scope: !441, file: !3, line: 118, column: 3)
!441 = distinct !DILexicalBlock(scope: !429, file: !3, line: 118, column: 3)
!442 = !DILocalVariable(name: "o1", scope: !438, file: !3, line: 119, type: !74)
!443 = !DILocation(line: 110, column: 36, scope: !429)
!444 = !DILocation(line: 110, column: 53, scope: !429)
!445 = !DILocation(line: 110, column: 61, scope: !429)
!446 = !DILocation(line: 112, column: 12, scope: !447)
!447 = distinct !DILexicalBlock(scope: !429, file: !3, line: 112, column: 7)
!448 = !DILocation(line: 112, column: 7, scope: !429)
!449 = !DILocation(line: 117, column: 9, scope: !429)
!450 = !DILocation(line: 117, column: 13, scope: !429)
!451 = !DILocation(line: 111, column: 7, scope: !429)
!452 = !DILocation(line: 118, column: 17, scope: !440)
!453 = !DILocation(line: 118, column: 3, scope: !441)
!454 = !DILocation(line: 119, column: 5, scope: !438)
!455 = distinct !{!455, !453, !456}
!456 = !DILocation(line: 120, column: 3, scope: !441)
!457 = !DILocation(line: 118, column: 23, scope: !440)
!458 = !DILocation(line: 122, column: 1, scope: !429)
!459 = distinct !DISubprogram(name: "lua_setlevel", scope: !3, file: !3, line: 125, type: !460, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !131, !131}
!462 = !{!463, !464}
!463 = !DILocalVariable(name: "from", arg: 1, scope: !459, file: !3, line: 125, type: !131)
!464 = !DILocalVariable(name: "to", arg: 2, scope: !459, file: !3, line: 125, type: !131)
!465 = !DILocation(line: 125, column: 39, scope: !459)
!466 = !DILocation(line: 125, column: 56, scope: !459)
!467 = !DILocation(line: 126, column: 23, scope: !459)
!468 = !{!374, !379, i64 96}
!469 = !DILocation(line: 126, column: 7, scope: !459)
!470 = !DILocation(line: 126, column: 15, scope: !459)
!471 = !DILocation(line: 127, column: 1, scope: !459)
!472 = distinct !DISubprogram(name: "lua_atpanic", scope: !3, file: !3, line: 130, type: !473, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!127, !131, !127}
!475 = !{!476, !477, !478}
!476 = !DILocalVariable(name: "L", arg: 1, scope: !472, file: !3, line: 130, type: !131)
!477 = !DILocalVariable(name: "panicf", arg: 2, scope: !472, file: !3, line: 130, type: !127)
!478 = !DILocalVariable(name: "old", scope: !472, file: !3, line: 131, type: !127)
!479 = !DILocation(line: 130, column: 47, scope: !472)
!480 = !DILocation(line: 130, column: 64, scope: !472)
!481 = !DILocation(line: 133, column: 9, scope: !472)
!482 = !{!374, !375, i64 32}
!483 = !DILocation(line: 133, column: 15, scope: !472)
!484 = !{!485, !375, i64 152}
!485 = !{!"global_State", !486, i64 0, !375, i64 16, !375, i64 24, !376, i64 32, !376, i64 33, !378, i64 36, !375, i64 40, !375, i64 48, !375, i64 56, !375, i64 64, !375, i64 72, !375, i64 80, !487, i64 88, !381, i64 112, !381, i64 120, !381, i64 128, !381, i64 136, !378, i64 144, !378, i64 148, !375, i64 152, !380, i64 160, !375, i64 176, !488, i64 184, !376, i64 224, !376, i64 296}
!486 = !{!"stringtable", !375, i64 0, !378, i64 8, !378, i64 12}
!487 = !{!"Mbuffer", !375, i64 0, !381, i64 8, !381, i64 16}
!488 = !{!"UpVal", !375, i64 0, !376, i64 8, !376, i64 9, !375, i64 16, !376, i64 24}
!489 = !DILocation(line: 131, column: 17, scope: !472)
!490 = !DILocation(line: 134, column: 15, scope: !472)
!491 = !DILocation(line: 136, column: 3, scope: !472)
!492 = distinct !DISubprogram(name: "lua_newthread", scope: !3, file: !3, line: 140, type: !493, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{!131, !131}
!495 = !{!496, !497, !498}
!496 = !DILocalVariable(name: "L", arg: 1, scope: !492, file: !3, line: 140, type: !131)
!497 = !DILocalVariable(name: "L1", scope: !492, file: !3, line: 141, type: !131)
!498 = !DILocalVariable(name: "i_o", scope: !499, file: !3, line: 145, type: !74)
!499 = distinct !DILexicalBlock(scope: !492, file: !3, line: 145, column: 3)
!500 = !DILocation(line: 140, column: 46, scope: !492)
!501 = !DILocation(line: 143, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !3, line: 143, column: 3)
!503 = distinct !DILexicalBlock(scope: !492, file: !3, line: 143, column: 3)
!504 = !{!485, !381, i64 120}
!505 = !{!485, !381, i64 112}
!506 = !DILocation(line: 143, column: 3, scope: !503)
!507 = !DILocation(line: 144, column: 8, scope: !492)
!508 = !DILocation(line: 141, column: 14, scope: !492)
!509 = !DILocation(line: 145, column: 3, scope: !499)
!510 = !{!376, !376, i64 0}
!511 = !DILocation(line: 146, column: 3, scope: !512)
!512 = distinct !DILexicalBlock(scope: !492, file: !3, line: 146, column: 3)
!513 = !DILocation(line: 149, column: 3, scope: !492)
!514 = distinct !DISubprogram(name: "lua_gettop", scope: !3, file: !3, line: 159, type: !129, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !515)
!515 = !{!516}
!516 = !DILocalVariable(name: "L", arg: 1, scope: !514, file: !3, line: 159, type: !131)
!517 = !DILocation(line: 159, column: 36, scope: !514)
!518 = !DILocation(line: 160, column: 10, scope: !514)
!519 = !DILocation(line: 160, column: 3, scope: !514)
!520 = distinct !DISubprogram(name: "lua_settop", scope: !3, file: !3, line: 164, type: !521, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !523)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !131, !8}
!523 = !{!524, !525}
!524 = !DILocalVariable(name: "L", arg: 1, scope: !520, file: !3, line: 164, type: !131)
!525 = !DILocalVariable(name: "idx", arg: 2, scope: !520, file: !3, line: 164, type: !8)
!526 = !DILocation(line: 164, column: 37, scope: !520)
!527 = !DILocation(line: 164, column: 44, scope: !520)
!528 = !DILocation(line: 166, column: 11, scope: !529)
!529 = distinct !DILexicalBlock(scope: !520, file: !3, line: 166, column: 7)
!530 = !DILocation(line: 166, column: 7, scope: !520)
!531 = !DILocation(line: 168, column: 15, scope: !532)
!532 = distinct !DILexicalBlock(scope: !529, file: !3, line: 166, column: 17)
!533 = !DILocation(line: 168, column: 24, scope: !532)
!534 = !DILocation(line: 168, column: 29, scope: !532)
!535 = !DILocation(line: 168, column: 19, scope: !532)
!536 = !DILocation(line: 168, column: 5, scope: !532)
!537 = !DILocation(line: 169, column: 7, scope: !532)
!538 = distinct !{!538, !539}
!539 = !{!"llvm.loop.unroll.disable"}
!540 = distinct !{!540, !536, !537}
!541 = !DILocation(line: 170, column: 12, scope: !532)
!542 = !DILocation(line: 171, column: 3, scope: !532)
!543 = !DILocation(line: 174, column: 18, scope: !544)
!544 = distinct !DILexicalBlock(scope: !529, file: !3, line: 172, column: 8)
!545 = !DILocation(line: 174, column: 8, scope: !544)
!546 = !DILocation(line: 174, column: 12, scope: !544)
!547 = !DILocation(line: 177, column: 1, scope: !520)
!548 = distinct !DISubprogram(name: "lua_remove", scope: !3, file: !3, line: 180, type: !521, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !549)
!549 = !{!550, !551, !552, !553, !555}
!550 = !DILocalVariable(name: "L", arg: 1, scope: !548, file: !3, line: 180, type: !131)
!551 = !DILocalVariable(name: "idx", arg: 2, scope: !548, file: !3, line: 180, type: !8)
!552 = !DILocalVariable(name: "p", scope: !548, file: !3, line: 181, type: !140)
!553 = !DILocalVariable(name: "o2", scope: !554, file: !3, line: 185, type: !362)
!554 = distinct !DILexicalBlock(scope: !548, file: !3, line: 185, column: 24)
!555 = !DILocalVariable(name: "o1", scope: !554, file: !3, line: 185, type: !74)
!556 = !DILocation(line: 180, column: 37, scope: !548)
!557 = !DILocation(line: 180, column: 44, scope: !548)
!558 = !DILocalVariable(name: "L", arg: 1, scope: !559, file: !3, line: 49, type: !131)
!559 = distinct !DISubprogram(name: "index2adr", scope: !3, file: !3, line: 49, type: !560, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{!74, !131, !8}
!562 = !{!558, !563, !564, !567, !573, !575}
!563 = !DILocalVariable(name: "idx", arg: 2, scope: !559, file: !3, line: 49, type: !8)
!564 = !DILocalVariable(name: "o", scope: !565, file: !3, line: 51, type: !74)
!565 = distinct !DILexicalBlock(scope: !566, file: !3, line: 50, column: 16)
!566 = distinct !DILexicalBlock(scope: !559, file: !3, line: 50, column: 7)
!567 = !DILocalVariable(name: "func", scope: !568, file: !3, line: 63, type: !571)
!568 = distinct !DILexicalBlock(scope: !569, file: !3, line: 62, column: 28)
!569 = distinct !DILexicalBlock(scope: !570, file: !3, line: 60, column: 21)
!570 = distinct !DILexicalBlock(scope: !566, file: !3, line: 56, column: 12)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Closure", file: !11, line: 312, baseType: !113)
!573 = !DILocalVariable(name: "i_o", scope: !574, file: !3, line: 64, type: !74)
!574 = distinct !DILexicalBlock(scope: !568, file: !3, line: 64, column: 7)
!575 = !DILocalVariable(name: "func", scope: !576, file: !3, line: 69, type: !571)
!576 = distinct !DILexicalBlock(scope: !569, file: !3, line: 68, column: 14)
!577 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !578)
!578 = distinct !DILocation(line: 183, column: 7, scope: !548)
!579 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !578)
!580 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !578)
!581 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !578)
!582 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !578)
!583 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !578)
!584 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !578)
!585 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !578)
!586 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !578)
!587 = distinct !DILexicalBlock(scope: !565, file: !3, line: 53, column: 9)
!588 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !578)
!589 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !578)
!590 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !578)
!591 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !578)
!592 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !578)
!593 = distinct !DILexicalBlock(scope: !570, file: !3, line: 56, column: 37)
!594 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !578)
!595 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !578)
!596 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !578)
!597 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !578)
!598 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !578)
!599 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !578)
!600 = !{!421, !375, i64 8}
!601 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !578)
!602 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !578)
!603 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !578)
!604 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !578)
!605 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !578)
!606 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !578)
!607 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !578)
!608 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !578)
!609 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !578)
!610 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !578)
!611 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !578)
!612 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !578)
!613 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !578)
!614 = !DILocation(line: 0, scope: !569, inlinedAt: !578)
!615 = !DILocation(line: 181, column: 9, scope: !548)
!616 = !DILocation(line: 185, column: 10, scope: !548)
!617 = !DILocation(line: 185, column: 19, scope: !548)
!618 = !DILocation(line: 185, column: 14, scope: !548)
!619 = !DILocation(line: 185, column: 3, scope: !548)
!620 = !DILocation(line: 185, column: 24, scope: !554)
!621 = distinct !{!621, !619, !622}
!622 = !DILocation(line: 185, column: 24, scope: !548)
!623 = !DILocation(line: 186, column: 9, scope: !548)
!624 = !DILocation(line: 188, column: 1, scope: !548)
!625 = distinct !DISubprogram(name: "lua_insert", scope: !3, file: !3, line: 191, type: !521, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !626)
!626 = !{!627, !628, !629, !630, !631, !635, !636, !638}
!627 = !DILocalVariable(name: "L", arg: 1, scope: !625, file: !3, line: 191, type: !131)
!628 = !DILocalVariable(name: "idx", arg: 2, scope: !625, file: !3, line: 191, type: !8)
!629 = !DILocalVariable(name: "p", scope: !625, file: !3, line: 192, type: !140)
!630 = !DILocalVariable(name: "q", scope: !625, file: !3, line: 193, type: !140)
!631 = !DILocalVariable(name: "o2", scope: !632, file: !3, line: 197, type: !362)
!632 = distinct !DILexicalBlock(scope: !633, file: !3, line: 197, column: 30)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 197, column: 3)
!634 = distinct !DILexicalBlock(scope: !625, file: !3, line: 197, column: 3)
!635 = !DILocalVariable(name: "o1", scope: !632, file: !3, line: 197, type: !74)
!636 = !DILocalVariable(name: "o2", scope: !637, file: !3, line: 198, type: !362)
!637 = distinct !DILexicalBlock(scope: !625, file: !3, line: 198, column: 3)
!638 = !DILocalVariable(name: "o1", scope: !637, file: !3, line: 198, type: !74)
!639 = !DILocation(line: 191, column: 37, scope: !625)
!640 = !DILocation(line: 191, column: 44, scope: !625)
!641 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !642)
!642 = distinct !DILocation(line: 195, column: 7, scope: !625)
!643 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !642)
!644 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !642)
!645 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !642)
!646 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !642)
!647 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !642)
!648 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !642)
!649 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !642)
!650 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !642)
!651 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !642)
!652 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !642)
!653 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !642)
!654 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !642)
!655 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !642)
!656 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !642)
!657 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !642)
!658 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !642)
!659 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !642)
!660 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !642)
!661 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !642)
!662 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !642)
!663 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !642)
!664 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !642)
!665 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !642)
!666 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !642)
!667 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !642)
!668 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !642)
!669 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !642)
!670 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !642)
!671 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !642)
!672 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !642)
!673 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !642)
!674 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !642)
!675 = !DILocation(line: 0, scope: !569, inlinedAt: !642)
!676 = !DILocation(line: 192, column: 9, scope: !625)
!677 = !DILocation(line: 197, column: 15, scope: !634)
!678 = !DILocation(line: 193, column: 9, scope: !625)
!679 = !DILocation(line: 197, column: 21, scope: !633)
!680 = !DILocation(line: 197, column: 3, scope: !634)
!681 = !DILocation(line: 197, column: 30, scope: !632)
!682 = distinct !{!682, !680, !683}
!683 = !DILocation(line: 197, column: 30, scope: !634)
!684 = !DILocation(line: 198, column: 3, scope: !637)
!685 = !DILocation(line: 200, column: 1, scope: !625)
!686 = distinct !DISubprogram(name: "lua_replace", scope: !3, file: !3, line: 203, type: !521, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !687)
!687 = !{!688, !689, !690, !691, !694, !697}
!688 = !DILocalVariable(name: "L", arg: 1, scope: !686, file: !3, line: 203, type: !131)
!689 = !DILocalVariable(name: "idx", arg: 2, scope: !686, file: !3, line: 203, type: !8)
!690 = !DILocalVariable(name: "o", scope: !686, file: !3, line: 204, type: !140)
!691 = !DILocalVariable(name: "func", scope: !692, file: !3, line: 213, type: !571)
!692 = distinct !DILexicalBlock(scope: !693, file: !3, line: 212, column: 32)
!693 = distinct !DILexicalBlock(scope: !686, file: !3, line: 212, column: 7)
!694 = !DILocalVariable(name: "o2", scope: !695, file: !3, line: 219, type: !362)
!695 = distinct !DILexicalBlock(scope: !696, file: !3, line: 219, column: 5)
!696 = distinct !DILexicalBlock(scope: !693, file: !3, line: 218, column: 8)
!697 = !DILocalVariable(name: "o1", scope: !695, file: !3, line: 219, type: !74)
!698 = !DILocation(line: 203, column: 38, scope: !686)
!699 = !DILocation(line: 203, column: 45, scope: !686)
!700 = !DILocation(line: 207, column: 11, scope: !701)
!701 = distinct !DILexicalBlock(scope: !686, file: !3, line: 207, column: 7)
!702 = !DILocation(line: 207, column: 31, scope: !701)
!703 = !DILocation(line: 207, column: 37, scope: !701)
!704 = !DILocation(line: 207, column: 46, scope: !701)
!705 = !{!374, !375, i64 80}
!706 = !DILocation(line: 207, column: 40, scope: !701)
!707 = !DILocation(line: 207, column: 7, scope: !686)
!708 = !DILocation(line: 208, column: 5, scope: !701)
!709 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !710)
!710 = distinct !DILocation(line: 210, column: 7, scope: !686)
!711 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !710)
!712 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !710)
!713 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !710)
!714 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !710)
!715 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !710)
!716 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !710)
!717 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !710)
!718 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !710)
!719 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !710)
!720 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !710)
!721 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !710)
!722 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !710)
!723 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !710)
!724 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !710)
!725 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !710)
!726 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !710)
!727 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !710)
!728 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !710)
!729 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !710)
!730 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !710)
!731 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !710)
!732 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !710)
!733 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !710)
!734 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !710)
!735 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !710)
!736 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !710)
!737 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !710)
!738 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !710)
!739 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !710)
!740 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !710)
!741 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !710)
!742 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !710)
!743 = !DILocation(line: 204, column: 9, scope: !686)
!744 = !DILocation(line: 213, column: 21, scope: !692)
!745 = !DILocation(line: 213, column: 14, scope: !692)
!746 = !DILocation(line: 215, column: 19, scope: !692)
!747 = !DILocation(line: 215, column: 13, scope: !692)
!748 = !DILocation(line: 215, column: 17, scope: !692)
!749 = !DILocation(line: 216, column: 5, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 216, column: 5)
!751 = distinct !DILexicalBlock(scope: !692, file: !3, line: 216, column: 5)
!752 = !DILocation(line: 216, column: 5, scope: !751)
!753 = !DILocation(line: 219, column: 5, scope: !695)
!754 = !DILocation(line: 220, column: 13, scope: !755)
!755 = distinct !DILexicalBlock(scope: !696, file: !3, line: 220, column: 9)
!756 = !DILocation(line: 220, column: 9, scope: !696)
!757 = !DILocation(line: 221, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 221, column: 7)
!759 = distinct !DILexicalBlock(scope: !755, file: !3, line: 221, column: 7)
!760 = !DILocation(line: 221, column: 7, scope: !759)
!761 = !DILocation(line: 223, column: 6, scope: !686)
!762 = !DILocation(line: 223, column: 9, scope: !686)
!763 = !DILocation(line: 225, column: 1, scope: !686)
!764 = distinct !DISubprogram(name: "lua_pushvalue", scope: !3, file: !3, line: 228, type: !521, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !765)
!765 = !{!766, !767, !768, !770}
!766 = !DILocalVariable(name: "L", arg: 1, scope: !764, file: !3, line: 228, type: !131)
!767 = !DILocalVariable(name: "idx", arg: 2, scope: !764, file: !3, line: 228, type: !8)
!768 = !DILocalVariable(name: "o2", scope: !769, file: !3, line: 230, type: !362)
!769 = distinct !DILexicalBlock(scope: !764, file: !3, line: 230, column: 3)
!770 = !DILocalVariable(name: "o1", scope: !769, file: !3, line: 230, type: !74)
!771 = !DILocation(line: 228, column: 40, scope: !764)
!772 = !DILocation(line: 228, column: 47, scope: !764)
!773 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !774)
!774 = distinct !DILocation(line: 230, column: 3, scope: !769)
!775 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !774)
!776 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !774)
!777 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !774)
!778 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !774)
!779 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !774)
!780 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !774)
!781 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !774)
!782 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !774)
!783 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !774)
!784 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !774)
!785 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !774)
!786 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !774)
!787 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !774)
!788 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !774)
!789 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !774)
!790 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !774)
!791 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !774)
!792 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !774)
!793 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !774)
!794 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !774)
!795 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !774)
!796 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !774)
!797 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !774)
!798 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !774)
!799 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !774)
!800 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !774)
!801 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !774)
!802 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !774)
!803 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !774)
!804 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !774)
!805 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !774)
!806 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !774)
!807 = !DILocation(line: 0, scope: !569, inlinedAt: !774)
!808 = !DILocation(line: 230, column: 3, scope: !769)
!809 = !DILocation(line: 231, column: 3, scope: !810)
!810 = distinct !DILexicalBlock(scope: !764, file: !3, line: 231, column: 3)
!811 = !DILocation(line: 233, column: 1, scope: !764)
!812 = distinct !DISubprogram(name: "lua_type", scope: !3, file: !3, line: 242, type: !387, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !813)
!813 = !{!814, !815, !816}
!814 = !DILocalVariable(name: "L", arg: 1, scope: !812, file: !3, line: 242, type: !131)
!815 = !DILocalVariable(name: "idx", arg: 2, scope: !812, file: !3, line: 242, type: !8)
!816 = !DILocalVariable(name: "o", scope: !812, file: !3, line: 243, type: !140)
!817 = !DILocation(line: 242, column: 34, scope: !812)
!818 = !DILocation(line: 242, column: 41, scope: !812)
!819 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !820)
!820 = distinct !DILocation(line: 243, column: 13, scope: !812)
!821 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !820)
!822 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !820)
!823 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !820)
!824 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !820)
!825 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !820)
!826 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !820)
!827 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !820)
!828 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !820)
!829 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !820)
!830 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !820)
!831 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !820)
!832 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !820)
!833 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !820)
!834 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !820)
!835 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !820)
!836 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !820)
!837 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !820)
!838 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !820)
!839 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !820)
!840 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !820)
!841 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !820)
!842 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !820)
!843 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !820)
!844 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !820)
!845 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !820)
!846 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !820)
!847 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !820)
!848 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !820)
!849 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !820)
!850 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !820)
!851 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !820)
!852 = !DILocation(line: 0, scope: !569, inlinedAt: !820)
!853 = !DILocation(line: 243, column: 9, scope: !812)
!854 = !DILocation(line: 244, column: 13, scope: !812)
!855 = !DILocation(line: 244, column: 10, scope: !812)
!856 = !DILocation(line: 244, column: 46, scope: !812)
!857 = !DILocation(line: 244, column: 3, scope: !812)
!858 = distinct !DISubprogram(name: "lua_typename", scope: !3, file: !3, line: 248, type: !859, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!257, !131, !8}
!861 = !{!862, !863}
!862 = !DILocalVariable(name: "L", arg: 1, scope: !858, file: !3, line: 248, type: !131)
!863 = !DILocalVariable(name: "t", arg: 2, scope: !858, file: !3, line: 248, type: !8)
!864 = !DILocation(line: 248, column: 46, scope: !858)
!865 = !DILocation(line: 248, column: 53, scope: !858)
!866 = !DILocation(line: 250, column: 13, scope: !858)
!867 = !DILocation(line: 250, column: 10, scope: !858)
!868 = !DILocation(line: 250, column: 42, scope: !858)
!869 = !{!375, !375, i64 0}
!870 = !DILocation(line: 250, column: 3, scope: !858)
!871 = distinct !DISubprogram(name: "lua_iscfunction", scope: !3, file: !3, line: 254, type: !387, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !872)
!872 = !{!873, !874, !875}
!873 = !DILocalVariable(name: "L", arg: 1, scope: !871, file: !3, line: 254, type: !131)
!874 = !DILocalVariable(name: "idx", arg: 2, scope: !871, file: !3, line: 254, type: !8)
!875 = !DILocalVariable(name: "o", scope: !871, file: !3, line: 255, type: !140)
!876 = !DILocation(line: 254, column: 41, scope: !871)
!877 = !DILocation(line: 254, column: 48, scope: !871)
!878 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !879)
!879 = distinct !DILocation(line: 255, column: 13, scope: !871)
!880 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !879)
!881 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !879)
!882 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !879)
!883 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !879)
!884 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !879)
!885 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !879)
!886 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !879)
!887 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !879)
!888 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !879)
!889 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !879)
!890 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !879)
!891 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !879)
!892 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !879)
!893 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !879)
!894 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !879)
!895 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !879)
!896 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !879)
!897 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !879)
!898 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !879)
!899 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !879)
!900 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !879)
!901 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !879)
!902 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !879)
!903 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !879)
!904 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !879)
!905 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !879)
!906 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !879)
!907 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !879)
!908 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !879)
!909 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !879)
!910 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !879)
!911 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !879)
!912 = !DILocation(line: 0, scope: !569, inlinedAt: !879)
!913 = !DILocation(line: 255, column: 9, scope: !871)
!914 = !DILocation(line: 256, column: 10, scope: !871)
!915 = !DILocation(line: 256, column: 3, scope: !871)
!916 = distinct !DISubprogram(name: "lua_isnumber", scope: !3, file: !3, line: 260, type: !387, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DILocalVariable(name: "L", arg: 1, scope: !916, file: !3, line: 260, type: !131)
!919 = !DILocalVariable(name: "idx", arg: 2, scope: !916, file: !3, line: 260, type: !8)
!920 = !DILocalVariable(name: "n", scope: !916, file: !3, line: 261, type: !75)
!921 = !DILocalVariable(name: "o", scope: !916, file: !3, line: 262, type: !362)
!922 = !DILocation(line: 260, column: 38, scope: !916)
!923 = !DILocation(line: 260, column: 45, scope: !916)
!924 = !DILocation(line: 261, column: 3, scope: !916)
!925 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !926)
!926 = distinct !DILocation(line: 262, column: 21, scope: !916)
!927 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !926)
!928 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !926)
!929 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !926)
!930 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !926)
!931 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !926)
!932 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !926)
!933 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !926)
!934 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !926)
!935 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !926)
!936 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !926)
!937 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !926)
!938 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !926)
!939 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !926)
!940 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !926)
!941 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !926)
!942 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !926)
!943 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !926)
!944 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !926)
!945 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !926)
!946 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !926)
!947 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !926)
!948 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !926)
!949 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !926)
!950 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !926)
!951 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !926)
!952 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !926)
!953 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !926)
!954 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !926)
!955 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !926)
!956 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !926)
!957 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !926)
!958 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !926)
!959 = !DILocation(line: 0, scope: !569, inlinedAt: !926)
!960 = !DILocation(line: 262, column: 17, scope: !916)
!961 = !DILocation(line: 263, column: 10, scope: !916)
!962 = !DILocation(line: 261, column: 10, scope: !916)
!963 = !DILocation(line: 264, column: 1, scope: !916)
!964 = !DILocation(line: 263, column: 3, scope: !916)
!965 = distinct !DISubprogram(name: "lua_isstring", scope: !3, file: !3, line: 267, type: !387, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !966)
!966 = !{!967, !968, !969}
!967 = !DILocalVariable(name: "L", arg: 1, scope: !965, file: !3, line: 267, type: !131)
!968 = !DILocalVariable(name: "idx", arg: 2, scope: !965, file: !3, line: 267, type: !8)
!969 = !DILocalVariable(name: "t", scope: !965, file: !3, line: 268, type: !8)
!970 = !DILocation(line: 267, column: 38, scope: !965)
!971 = !DILocation(line: 267, column: 45, scope: !965)
!972 = !DILocation(line: 242, column: 34, scope: !812, inlinedAt: !973)
!973 = distinct !DILocation(line: 268, column: 11, scope: !965)
!974 = !DILocation(line: 242, column: 41, scope: !812, inlinedAt: !973)
!975 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !976)
!976 = distinct !DILocation(line: 243, column: 13, scope: !812, inlinedAt: !973)
!977 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !976)
!978 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !976)
!979 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !976)
!980 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !976)
!981 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !976)
!982 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !976)
!983 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !976)
!984 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !976)
!985 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !976)
!986 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !976)
!987 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !976)
!988 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !976)
!989 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !976)
!990 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !976)
!991 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !976)
!992 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !976)
!993 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !976)
!994 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !976)
!995 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !976)
!996 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !976)
!997 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !976)
!998 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !976)
!999 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !976)
!1000 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !976)
!1001 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !976)
!1002 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !976)
!1003 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !976)
!1004 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !976)
!1005 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !976)
!1006 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !976)
!1007 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !976)
!1008 = !DILocation(line: 0, scope: !569, inlinedAt: !976)
!1009 = !DILocation(line: 243, column: 9, scope: !812, inlinedAt: !973)
!1010 = !DILocation(line: 244, column: 13, scope: !812, inlinedAt: !973)
!1011 = !DILocation(line: 244, column: 10, scope: !812, inlinedAt: !973)
!1012 = !DILocation(line: 244, column: 46, scope: !812, inlinedAt: !973)
!1013 = !DILocation(line: 269, column: 3, scope: !965)
!1014 = distinct !DISubprogram(name: "lua_isuserdata", scope: !3, file: !3, line: 273, type: !387, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1015)
!1015 = !{!1016, !1017, !1018}
!1016 = !DILocalVariable(name: "L", arg: 1, scope: !1014, file: !3, line: 273, type: !131)
!1017 = !DILocalVariable(name: "idx", arg: 2, scope: !1014, file: !3, line: 273, type: !8)
!1018 = !DILocalVariable(name: "o", scope: !1014, file: !3, line: 274, type: !362)
!1019 = !DILocation(line: 273, column: 40, scope: !1014)
!1020 = !DILocation(line: 273, column: 47, scope: !1014)
!1021 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !1022)
!1022 = distinct !DILocation(line: 274, column: 21, scope: !1014)
!1023 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !1022)
!1024 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !1022)
!1025 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !1022)
!1026 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !1022)
!1027 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !1022)
!1028 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !1022)
!1029 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !1022)
!1030 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !1022)
!1031 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !1022)
!1032 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !1022)
!1033 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !1022)
!1034 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !1022)
!1035 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !1022)
!1036 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !1022)
!1037 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !1022)
!1038 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !1022)
!1039 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !1022)
!1040 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !1022)
!1041 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !1022)
!1042 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !1022)
!1043 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !1022)
!1044 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !1022)
!1045 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !1022)
!1046 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !1022)
!1047 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !1022)
!1048 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !1022)
!1049 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !1022)
!1050 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !1022)
!1051 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !1022)
!1052 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !1022)
!1053 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !1022)
!1054 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !1022)
!1055 = !DILocation(line: 0, scope: !569, inlinedAt: !1022)
!1056 = !DILocation(line: 274, column: 17, scope: !1014)
!1057 = !DILocation(line: 275, column: 11, scope: !1014)
!1058 = !DILocation(line: 275, column: 30, scope: !1014)
!1059 = !DILocation(line: 275, column: 27, scope: !1014)
!1060 = !DILocation(line: 275, column: 3, scope: !1014)
!1061 = distinct !DISubprogram(name: "lua_rawequal", scope: !3, file: !3, line: 279, type: !1062, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1064)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!8, !131, !8, !8}
!1064 = !{!1065, !1066, !1067, !1068, !1069}
!1065 = !DILocalVariable(name: "L", arg: 1, scope: !1061, file: !3, line: 279, type: !131)
!1066 = !DILocalVariable(name: "index1", arg: 2, scope: !1061, file: !3, line: 279, type: !8)
!1067 = !DILocalVariable(name: "index2", arg: 3, scope: !1061, file: !3, line: 279, type: !8)
!1068 = !DILocalVariable(name: "o1", scope: !1061, file: !3, line: 280, type: !140)
!1069 = !DILocalVariable(name: "o2", scope: !1061, file: !3, line: 281, type: !140)
!1070 = !DILocation(line: 279, column: 38, scope: !1061)
!1071 = !DILocation(line: 279, column: 45, scope: !1061)
!1072 = !DILocation(line: 279, column: 57, scope: !1061)
!1073 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 280, column: 14, scope: !1061)
!1075 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !1074)
!1076 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !1074)
!1077 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !1074)
!1078 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !1074)
!1079 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !1074)
!1080 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !1074)
!1081 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !1074)
!1082 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !1074)
!1083 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !1074)
!1084 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !1074)
!1085 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !1074)
!1086 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !1074)
!1087 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !1074)
!1088 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !1074)
!1089 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !1074)
!1090 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !1074)
!1091 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !1074)
!1092 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !1074)
!1093 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !1074)
!1094 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !1074)
!1095 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !1074)
!1096 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !1074)
!1097 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !1074)
!1098 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !1074)
!1099 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !1074)
!1100 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !1074)
!1101 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !1074)
!1102 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !1074)
!1103 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !1074)
!1104 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !1074)
!1105 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !1074)
!1106 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !1074)
!1107 = !DILocation(line: 0, scope: !569, inlinedAt: !1074)
!1108 = !DILocation(line: 280, column: 9, scope: !1061)
!1109 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 281, column: 14, scope: !1061)
!1111 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !1110)
!1112 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !1110)
!1113 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !1110)
!1114 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !1110)
!1115 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !1110)
!1116 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !1110)
!1117 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !1110)
!1118 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !1110)
!1119 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !1110)
!1120 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !1110)
!1121 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !1110)
!1122 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !1110)
!1123 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !1110)
!1124 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !1110)
!1125 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !1110)
!1126 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !1110)
!1127 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !1110)
!1128 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !1110)
!1129 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !1110)
!1130 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !1110)
!1131 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !1110)
!1132 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !1110)
!1133 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !1110)
!1134 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !1110)
!1135 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !1110)
!1136 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !1110)
!1137 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !1110)
!1138 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !1110)
!1139 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !1110)
!1140 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !1110)
!1141 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !1110)
!1142 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !1110)
!1143 = !DILocation(line: 0, scope: !569, inlinedAt: !1110)
!1144 = !DILocation(line: 281, column: 9, scope: !1061)
!1145 = !DILocation(line: 282, column: 14, scope: !1061)
!1146 = !DILocation(line: 282, column: 38, scope: !1061)
!1147 = !DILocation(line: 282, column: 32, scope: !1061)
!1148 = !DILocation(line: 283, column: 12, scope: !1061)
!1149 = !DILocation(line: 282, column: 10, scope: !1061)
!1150 = !DILocation(line: 282, column: 3, scope: !1061)
!1151 = distinct !DISubprogram(name: "lua_equal", scope: !3, file: !3, line: 287, type: !1062, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158}
!1153 = !DILocalVariable(name: "L", arg: 1, scope: !1151, file: !3, line: 287, type: !131)
!1154 = !DILocalVariable(name: "index1", arg: 2, scope: !1151, file: !3, line: 287, type: !8)
!1155 = !DILocalVariable(name: "index2", arg: 3, scope: !1151, file: !3, line: 287, type: !8)
!1156 = !DILocalVariable(name: "o1", scope: !1151, file: !3, line: 288, type: !140)
!1157 = !DILocalVariable(name: "o2", scope: !1151, file: !3, line: 288, type: !140)
!1158 = !DILocalVariable(name: "i", scope: !1151, file: !3, line: 289, type: !8)
!1159 = !DILocation(line: 287, column: 35, scope: !1151)
!1160 = !DILocation(line: 287, column: 42, scope: !1151)
!1161 = !DILocation(line: 287, column: 54, scope: !1151)
!1162 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 291, column: 8, scope: !1151)
!1164 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !1163)
!1165 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !1163)
!1166 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !1163)
!1167 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !1163)
!1168 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !1163)
!1169 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !1163)
!1170 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !1163)
!1171 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !1163)
!1172 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !1163)
!1173 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !1163)
!1174 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !1163)
!1175 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !1163)
!1176 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !1163)
!1177 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !1163)
!1178 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !1163)
!1179 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !1163)
!1180 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !1163)
!1181 = !DILocation(line: 61, column: 29, scope: !569, inlinedAt: !1163)
!1182 = !DILocation(line: 63, column: 23, scope: !568, inlinedAt: !1163)
!1183 = !DILocation(line: 63, column: 16, scope: !568, inlinedAt: !1163)
!1184 = !DILocation(line: 64, column: 7, scope: !574, inlinedAt: !1163)
!1185 = !DILocation(line: 67, column: 35, scope: !569, inlinedAt: !1163)
!1186 = !DILocation(line: 67, column: 28, scope: !569, inlinedAt: !1163)
!1187 = !DILocation(line: 69, column: 23, scope: !576, inlinedAt: !1163)
!1188 = !DILocation(line: 69, column: 16, scope: !576, inlinedAt: !1163)
!1189 = !DILocation(line: 70, column: 30, scope: !576, inlinedAt: !1163)
!1190 = !DILocation(line: 71, column: 30, scope: !576, inlinedAt: !1163)
!1191 = !DILocation(line: 71, column: 22, scope: !576, inlinedAt: !1163)
!1192 = !DILocation(line: 71, column: 19, scope: !576, inlinedAt: !1163)
!1193 = !DILocation(line: 71, column: 14, scope: !576, inlinedAt: !1163)
!1194 = !DILocation(line: 72, column: 39, scope: !576, inlinedAt: !1163)
!1195 = !DILocation(line: 72, column: 20, scope: !576, inlinedAt: !1163)
!1196 = !DILocation(line: 0, scope: !569, inlinedAt: !1163)
!1197 = !DILocation(line: 288, column: 9, scope: !1151)
!1198 = !DILocation(line: 49, column: 38, scope: !559, inlinedAt: !1199)
!1199 = distinct !DILocation(line: 292, column: 8, scope: !1151)
!1200 = !DILocation(line: 49, column: 45, scope: !559, inlinedAt: !1199)
!1201 = !DILocation(line: 50, column: 11, scope: !566, inlinedAt: !1199)
!1202 = !DILocation(line: 50, column: 7, scope: !559, inlinedAt: !1199)
!1203 = !DILocation(line: 51, column: 20, scope: !565, inlinedAt: !1199)
!1204 = !DILocation(line: 51, column: 32, scope: !565, inlinedAt: !1199)
!1205 = !DILocation(line: 51, column: 25, scope: !565, inlinedAt: !1199)
!1206 = !DILocation(line: 51, column: 13, scope: !565, inlinedAt: !1199)
!1207 = !DILocation(line: 53, column: 17, scope: !587, inlinedAt: !1199)
!1208 = !DILocation(line: 53, column: 11, scope: !587, inlinedAt: !1199)
!1209 = !DILocation(line: 54, column: 10, scope: !587, inlinedAt: !1199)
!1210 = !DILocation(line: 56, column: 16, scope: !570, inlinedAt: !1199)
!1211 = !DILocation(line: 56, column: 12, scope: !566, inlinedAt: !1199)
!1212 = !DILocation(line: 58, column: 15, scope: !593, inlinedAt: !1199)
!1213 = !DILocation(line: 58, column: 19, scope: !593, inlinedAt: !1199)
!1214 = !DILocation(line: 58, column: 5, scope: !593, inlinedAt: !1199)
!1215 = !DILocation(line: 60, column: 8, scope: !570, inlinedAt: !1199)
!1216 = !DILocation(line: 61, column: 36, scope: !569, inlinedAt: !1199)
