; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.dictType = type { i64 (i8*)*, i8* (i8*, i8*)*, i8* (i8*, i8*)*, i32 (i8*, i8*, i8*)*, void (i8*, i8*)*, void (i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "latencyTimeSeriesDictType", scope: !2, file: !3, line: 50, type: !61, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !60)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !7, !12, !13, !14, !15, !17, !31, !41, !51}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 56, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 103, baseType: !11)
!10 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!14 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !19, line: 51, size: 24, elements: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !{!21, !25, !26, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !18, file: !19, line: 52, baseType: !22, size: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 43, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !18, file: !19, line: 53, baseType: !22, size: 8, offset: 8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 54, baseType: !24, size: 8, offset: 16)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !18, file: !19, line: 55, baseType: !28, offset: 24)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: -1)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !19, line: 57, size: 40, elements: !33)
!33 = !{!34, !38, !39, !40}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, file: !19, line: 58, baseType: !35, size: 16)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 36, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 57, baseType: !37)
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !32, file: !19, line: 59, baseType: !35, size: 16, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !19, line: 60, baseType: !24, size: 8, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !32, file: !19, line: 61, baseType: !28, offset: 40)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !19, line: 63, size: 72, elements: !43)
!43 = !{!44, !48, !49, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, file: !19, line: 64, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 48, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 79, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !42, file: !19, line: 65, baseType: !45, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !19, line: 66, baseType: !24, size: 8, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !42, file: !19, line: 67, baseType: !28, offset: 72)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !19, line: 69, size: 136, elements: !53)
!53 = !{!54, !57, !58, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, file: !19, line: 70, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 60, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 105, baseType: !12)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !52, file: !19, line: 71, baseType: !55, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !19, line: 72, baseType: !24, size: 8, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !52, file: !19, line: 73, baseType: !28, offset: 136)
!60 = !{!0}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !62, line: 65, baseType: !63)
!62 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !62, line: 58, size: 384, elements: !64)
!64 = !{!65, !71, !75, !76, !81, !85}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !63, file: !62, line: 59, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!55, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !63, file: !62, line: 60, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!6, !6, !69}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !63, file: !62, line: 61, baseType: !72, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !63, file: !62, line: 62, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !6, !69, !69}
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !63, file: !62, line: 63, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !6, !6}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !63, file: !62, line: 64, baseType: !82, size: 64, offset: 320)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!90 = distinct !DISubprogram(name: "dictStringKeyCompare", scope: !3, file: !3, line: 39, type: !78, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !91)
!91 = !{!92, !93, !94}
!92 = !DILocalVariable(name: "privdata", arg: 1, scope: !90, file: !3, line: 39, type: !6)
!93 = !DILocalVariable(name: "key1", arg: 2, scope: !90, file: !3, line: 39, type: !69)
!94 = !DILocalVariable(name: "key2", arg: 3, scope: !90, file: !3, line: 39, type: !69)
!95 = !DILocation(line: 39, column: 32, scope: !90)
!96 = !DILocation(line: 39, column: 54, scope: !90)
!97 = !DILocation(line: 39, column: 72, scope: !90)
!98 = !DILocation(line: 41, column: 12, scope: !90)
!99 = !DILocation(line: 41, column: 30, scope: !90)
!100 = !DILocation(line: 41, column: 5, scope: !90)
!101 = distinct !DISubprogram(name: "dictStringHash", scope: !3, file: !3, line: 44, type: !67, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !102)
!102 = !{!103}
!103 = !DILocalVariable(name: "key", arg: 1, scope: !101, file: !3, line: 44, type: !69)
!104 = !DILocation(line: 44, column: 37, scope: !101)
!105 = !DILocation(line: 45, column: 37, scope: !101)
!106 = !DILocation(line: 45, column: 12, scope: !101)
!107 = !DILocation(line: 45, column: 5, scope: !101)
!108 = distinct !DISubprogram(name: "THPGetAnonHugePagesSize", scope: !3, file: !3, line: 81, type: !109, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!109 = !DISubroutineType(types: !110)
!110 = !{!80}
!111 = !DILocation(line: 82, column: 12, scope: !108)
!112 = !DILocation(line: 82, column: 5, scope: !108)
!113 = distinct !DISubprogram(name: "latencyMonitorInit", scope: !3, file: !3, line: 90, type: !114, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!114 = !DISubroutineType(types: !115)
!115 = !{null}
!116 = !DILocation(line: 91, column: 29, scope: !113)
!117 = !DILocation(line: 91, column: 27, scope: !113)
!118 = !{!119, !123, i64 3104}
!119 = !{!"redisServer", !120, i64 0, !123, i64 8, !123, i64 16, !123, i64 24, !120, i64 32, !120, i64 36, !120, i64 40, !123, i64 48, !123, i64 56, !123, i64 64, !123, i64 72, !120, i64 80, !120, i64 84, !120, i64 88, !120, i64 92, !123, i64 96, !123, i64 104, !120, i64 112, !120, i64 116, !121, i64 120, !120, i64 164, !124, i64 168, !120, i64 176, !123, i64 184, !123, i64 192, !123, i64 200, !121, i64 208, !120, i64 216, !120, i64 220, !121, i64 224, !120, i64 352, !123, i64 360, !120, i64 368, !121, i64 372, !120, i64 436, !120, i64 440, !121, i64 444, !120, i64 508, !123, i64 512, !123, i64 520, !123, i64 528, !123, i64 536, !123, i64 544, !123, i64 552, !123, i64 560, !120, i64 568, !125, i64 576, !121, i64 584, !123, i64 840, !124, i64 848, !120, i64 856, !120, i64 860, !124, i64 864, !124, i64 872, !124, i64 880, !124, i64 888, !123, i64 896, !123, i64 904, !123, i64 912, !123, i64 920, !123, i64 928, !123, i64 936, !123, i64 944, !123, i64 952, !123, i64 960, !123, i64 968, !123, i64 976, !123, i64 984, !123, i64 992, !124, i64 1000, !125, i64 1008, !125, i64 1016, !125, i64 1024, !126, i64 1032, !125, i64 1040, !125, i64 1048, !125, i64 1056, !125, i64 1064, !125, i64 1072, !125, i64 1080, !125, i64 1088, !125, i64 1096, !125, i64 1104, !124, i64 1112, !125, i64 1120, !126, i64 1128, !125, i64 1136, !125, i64 1144, !125, i64 1152, !125, i64 1160, !123, i64 1168, !125, i64 1176, !125, i64 1184, !124, i64 1192, !127, i64 1200, !125, i64 1240, !125, i64 1248, !124, i64 1256, !124, i64 1264, !121, i64 1272, !120, i64 1728, !120, i64 1732, !120, i64 1736, !120, i64 1740, !120, i64 1744, !124, i64 1752, !120, i64 1760, !120, i64 1764, !120, i64 1768, !120, i64 1772, !124, i64 1776, !124, i64 1784, !120, i64 1792, !120, i64 1796, !120, i64 1800, !120, i64 1804, !121, i64 1808, !120, i64 1880, !120, i64 1884, !123, i64 1888, !120, i64 1896, !120, i64 1900, !124, i64 1904, !124, i64 1912, !124, i64 1920, !124, i64 1928, !120, i64 1936, !120, i64 1940, !123, i64 1944, !123, i64 1952, !120, i64 1960, !120, i64 1964, !124, i64 1968, !124, i64 1976, !124, i64 1984, !124, i64 1992, !120, i64 2000, !124, i64 2008, !120, i64 2016, !120, i64 2020, !120, i64 2024, !120, i64 2028, !120, i64 2032, !120, i64 2036, !120, i64 2040, !120, i64 2044, !120, i64 2048, !120, i64 2052, !120, i64 2056, !120, i64 2060, !120, i64 2064, !123, i64 2072, !125, i64 2080, !125, i64 2088, !120, i64 2096, !123, i64 2104, !120, i64 2112, !123, i64 2120, !120, i64 2128, !120, i64 2132, !124, i64 2136, !124, i64 2144, !124, i64 2152, !124, i64 2160, !120, i64 2168, !120, i64 2172, !120, i64 2176, !120, i64 2180, !120, i64 2184, !120, i64 2188, !121, i64 2192, !128, i64 2200, !129, i64 2224, !123, i64 2240, !120, i64 2248, !123, i64 2256, !120, i64 2264, !121, i64 2268, !121, i64 2309, !125, i64 2352, !125, i64 2360, !120, i64 2368, !120, i64 2372, !123, i64 2376, !125, i64 2384, !125, i64 2392, !125, i64 2400, !125, i64 2408, !124, i64 2416, !124, i64 2424, !120, i64 2432, !120, i64 2436, !120, i64 2440, !120, i64 2444, !120, i64 2448, !123, i64 2456, !123, i64 2464, !120, i64 2472, !120, i64 2476, !123, i64 2480, !123, i64 2488, !120, i64 2496, !120, i64 2500, !124, i64 2504, !124, i64 2512, !124, i64 2520, !120, i64 2528, !120, i64 2532, !123, i64 2536, !124, i64 2544, !120, i64 2552, !120, i64 2556, !120, i64 2560, !124, i64 2568, !120, i64 2576, !120, i64 2580, !120, i64 2584, !123, i64 2592, !121, i64 2600, !125, i64 2648, !120, i64 2656, !123, i64 2664, !123, i64 2672, !120, i64 2680, !123, i64 2688, !120, i64 2696, !120, i64 2700, !125, i64 2704, !120, i64 2712, !120, i64 2716, !120, i64 2720, !120, i64 2724, !125, i64 2728, !120, i64 2736, !121, i64 2740, !123, i64 2768, !123, i64 2776, !120, i64 2784, !120, i64 2788, !120, i64 2792, !120, i64 2796, !124, i64 2800, !124, i64 2808, !124, i64 2816, !124, i64 2824, !124, i64 2832, !124, i64 2840, !124, i64 2848, !124, i64 2856, !120, i64 2864, !120, i64 2868, !124, i64 2872, !124, i64 2880, !120, i64 2888, !125, i64 2896, !123, i64 2904, !123, i64 2912, !120, i64 2920, !120, i64 2924, !125, i64 2928, !123, i64 2936, !123, i64 2944, !120, i64 2952, !120, i64 2956, !120, i64 2960, !120, i64 2964, !123, i64 2968, !120, i64 2976, !120, i64 2980, !120, i64 2984, !123, i64 2992, !123, i64 3000, !123, i64 3008, !123, i64 3016, !125, i64 3024, !125, i64 3032, !125, i64 3040, !120, i64 3048, !120, i64 3052, !120, i64 3056, !120, i64 3060, !120, i64 3064, !120, i64 3068, !120, i64 3072, !120, i64 3076, !120, i64 3080, !120, i64 3084, !120, i64 3088, !125, i64 3096, !123, i64 3104, !123, i64 3112, !123, i64 3120, !120, i64 3128, !120, i64 3132, !120, i64 3136, !124, i64 3144, !123, i64 3152, !123, i64 3160, !123, i64 3168}
!120 = !{!"int", !121, i64 0}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C/C++ TBAA"}
!123 = !{!"any pointer", !121, i64 0}
!124 = !{!"long", !121, i64 0}
!125 = !{!"long long", !121, i64 0}
!126 = !{!"double", !121, i64 0}
!127 = !{!"malloc_stats", !124, i64 0, !124, i64 8, !124, i64 16, !124, i64 24, !124, i64 32}
!128 = !{!"", !120, i64 0, !124, i64 8, !125, i64 16}
!129 = !{!"redisOpArray", !123, i64 0, !120, i64 8}
!130 = !DILocation(line: 92, column: 1, scope: !113)
!131 = distinct !DISubprogram(name: "latencyAddSample", scope: !3, file: !3, line: 98, type: !132, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !137)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !15, !134}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !135, line: 52, baseType: !136)
!135 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!136 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!137 = !{!138, !139, !140, !157, !160}
!138 = !DILocalVariable(name: "event", arg: 1, scope: !131, file: !3, line: 98, type: !15)
!139 = !DILocalVariable(name: "latency", arg: 2, scope: !131, file: !3, line: 98, type: !134)
!140 = !DILocalVariable(name: "ts", scope: !131, file: !3, line: 99, type: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latencyTimeSeries", file: !143, line: 47, size: 10304, elements: !144)
!143 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/latency.h", directory: "/root/.unikraft/apps/redis/build")
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !142, file: !143, line: 48, baseType: !80, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !142, file: !143, line: 49, baseType: !45, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !142, file: !143, line: 50, baseType: !148, size: 10240, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 10240, elements: !155)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latencySample", file: !143, line: 41, size: 64, elements: !150)
!150 = !{!151, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !149, file: !143, line: 42, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 44, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !10, line: 77, baseType: !80)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !149, file: !143, line: 43, baseType: !45, size: 32, offset: 32)
!155 = !{!156}
!156 = !DISubrange(count: 160)
!157 = !DILocalVariable(name: "now", scope: !131, file: !3, line: 100, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !159, line: 34, baseType: !11)
!159 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!160 = !DILocalVariable(name: "prev", scope: !131, file: !3, line: 101, type: !80)
!161 = !DILocation(line: 98, column: 29, scope: !131)
!162 = !DILocation(line: 98, column: 45, scope: !131)
!163 = !DILocation(line: 99, column: 58, scope: !131)
!164 = !DILocation(line: 99, column: 36, scope: !131)
!165 = !DILocation(line: 99, column: 31, scope: !131)
!166 = !DILocation(line: 100, column: 18, scope: !131)
!167 = !DILocation(line: 100, column: 12, scope: !131)
!168 = !DILocation(line: 104, column: 12, scope: !169)
!169 = distinct !DILexicalBlock(scope: !131, file: !3, line: 104, column: 9)
!170 = !DILocation(line: 104, column: 9, scope: !131)
!171 = !DILocation(line: 112, column: 23, scope: !172)
!172 = distinct !DILexicalBlock(scope: !131, file: !3, line: 112, column: 9)
!173 = !DILocation(line: 105, column: 14, scope: !174)
!174 = distinct !DILexicalBlock(scope: !169, file: !3, line: 104, column: 21)
!175 = !DILocation(line: 106, column: 13, scope: !174)
!176 = !DILocation(line: 106, column: 17, scope: !174)
!177 = !{!178, !120, i64 0}
!178 = !{!"latencyTimeSeries", !120, i64 0, !120, i64 4, !121, i64 8}
!179 = !DILocation(line: 107, column: 13, scope: !174)
!180 = !DILocation(line: 107, column: 17, scope: !174)
!181 = !{!178, !120, i64 4}
!182 = !DILocation(line: 108, column: 20, scope: !174)
!183 = !DILocation(line: 108, column: 9, scope: !174)
!184 = !DILocation(line: 109, column: 24, scope: !174)
!185 = !DILocation(line: 109, column: 39, scope: !174)
!186 = !DILocation(line: 109, column: 9, scope: !174)
!187 = !DILocation(line: 110, column: 5, scope: !174)
!188 = !DILocation(line: 0, scope: !131)
!189 = !DILocation(line: 112, column: 19, scope: !172)
!190 = !DILocation(line: 112, column: 17, scope: !172)
!191 = !DILocation(line: 112, column: 9, scope: !131)
!192 = !DILocation(line: 112, column: 38, scope: !172)
!193 = !DILocation(line: 112, column: 36, scope: !172)
!194 = !DILocation(line: 112, column: 28, scope: !172)
!195 = !DILocation(line: 116, column: 17, scope: !131)
!196 = !DILocation(line: 116, column: 38, scope: !131)
!197 = !DILocation(line: 116, column: 43, scope: !131)
!198 = !DILocation(line: 101, column: 9, scope: !131)
!199 = !DILocation(line: 117, column: 9, scope: !200)
!200 = distinct !DILexicalBlock(scope: !131, file: !3, line: 117, column: 9)
!201 = !DILocation(line: 117, column: 27, scope: !200)
!202 = !{!203, !120, i64 0}
!203 = !{!"latencySample", !120, i64 0, !120, i64 4}
!204 = !DILocation(line: 117, column: 32, scope: !200)
!205 = !DILocation(line: 117, column: 9, scope: !131)
!206 = !DILocation(line: 118, column: 41, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 118, column: 13)
!208 = distinct !DILexicalBlock(scope: !200, file: !3, line: 117, column: 40)
!209 = !{!203, !120, i64 4}
!210 = !DILocation(line: 118, column: 23, scope: !207)
!211 = !DILocation(line: 118, column: 21, scope: !207)
!212 = !DILocation(line: 118, column: 13, scope: !208)
!213 = !DILocation(line: 119, column: 41, scope: !207)
!214 = !DILocation(line: 119, column: 39, scope: !207)
!215 = !DILocation(line: 119, column: 13, scope: !207)
!216 = !DILocation(line: 123, column: 33, scope: !131)
!217 = !DILocation(line: 123, column: 21, scope: !131)
!218 = !DILocation(line: 123, column: 5, scope: !131)
!219 = !DILocation(line: 123, column: 26, scope: !131)
!220 = !DILocation(line: 123, column: 31, scope: !131)
!221 = !DILocation(line: 124, column: 36, scope: !131)
!222 = !DILocation(line: 124, column: 26, scope: !131)
!223 = !DILocation(line: 124, column: 34, scope: !131)
!224 = !DILocation(line: 126, column: 12, scope: !131)
!225 = !DILocation(line: 127, column: 17, scope: !226)
!226 = distinct !DILexicalBlock(scope: !131, file: !3, line: 127, column: 9)
!227 = !DILocation(line: 127, column: 9, scope: !131)
!228 = !DILocation(line: 128, column: 1, scope: !131)
!229 = distinct !DISubprogram(name: "latencyResetEvent", scope: !3, file: !3, line: 135, type: !230, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!80, !15}
!232 = !{!233, !234, !281, !282, !283}
!233 = !DILocalVariable(name: "event_to_reset", arg: 1, scope: !229, file: !3, line: 135, type: !15)
!234 = !DILocalVariable(name: "di", scope: !229, file: !3, line: 136, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictIterator", file: !62, line: 95, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictIterator", file: !62, line: 88, size: 384, elements: !238)
!238 = !{!239, !275, !276, !277, !278, !279, !280}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !237, file: !62, line: 89, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !62, line: 82, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !62, line: 76, size: 768, elements: !243)
!243 = !{!244, !246, !247, !273, !274}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !62, line: 77, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !242, file: !62, line: 78, baseType: !6, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !242, file: !62, line: 79, baseType: !248, size: 512, offset: 128)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 512, elements: !271)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !62, line: 74, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !62, line: 69, size: 256, elements: !251)
!251 = !{!252, !268, !269, !270}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !250, file: !62, line: 70, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !62, line: 56, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !62, line: 47, size: 192, elements: !257)
!257 = !{!258, !259, !266}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !256, file: !62, line: 48, baseType: !6, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !256, file: !62, line: 54, baseType: !260, size: 64, offset: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !62, line: 49, size: 64, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !260, file: !62, line: 50, baseType: !6, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !260, file: !62, line: 51, baseType: !55, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !260, file: !62, line: 52, baseType: !7, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !260, file: !62, line: 53, baseType: !13, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !62, line: 55, baseType: !267, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !62, line: 71, baseType: !12, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !250, file: !62, line: 72, baseType: !12, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !250, file: !62, line: 73, baseType: !12, size: 64, offset: 192)
!271 = !{!272}
!272 = !DISubrange(count: 2)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !242, file: !62, line: 80, baseType: !11, size: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !242, file: !62, line: 81, baseType: !12, size: 64, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !237, file: !62, line: 90, baseType: !11, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !237, file: !62, line: 91, baseType: !80, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "safe", scope: !237, file: !62, line: 91, baseType: !80, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !237, file: !62, line: 92, baseType: !254, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nextEntry", scope: !237, file: !62, line: 92, baseType: !254, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !237, file: !62, line: 94, baseType: !136, size: 64, offset: 320)
!281 = !DILocalVariable(name: "de", scope: !229, file: !3, line: 137, type: !254)
!282 = !DILocalVariable(name: "resets", scope: !229, file: !3, line: 138, type: !80)
!283 = !DILocalVariable(name: "event", scope: !284, file: !3, line: 142, type: !15)
!284 = distinct !DILexicalBlock(scope: !229, file: !3, line: 141, column: 40)
!285 = !DILocation(line: 135, column: 29, scope: !229)
!286 = !DILocation(line: 138, column: 9, scope: !229)
!287 = !DILocation(line: 140, column: 37, scope: !229)
!288 = !DILocation(line: 140, column: 10, scope: !229)
!289 = !DILocation(line: 136, column: 19, scope: !229)
!290 = !DILocation(line: 141, column: 17, scope: !229)
!291 = !DILocation(line: 137, column: 16, scope: !229)
!292 = !DILocation(line: 141, column: 31, scope: !229)
!293 = !DILocation(line: 141, column: 5, scope: !229)
!294 = !DILocation(line: 142, column: 23, scope: !284)
!295 = !{!296, !123, i64 0}
!296 = !{!"dictEntry", !123, i64 0, !121, i64 8, !123, i64 16}
!297 = !DILocation(line: 142, column: 15, scope: !284)
!298 = !DILocation(line: 144, column: 36, scope: !299)
!299 = distinct !DILexicalBlock(scope: !284, file: !3, line: 144, column: 13)
!300 = !DILocation(line: 144, column: 39, scope: !299)
!301 = !DILocation(line: 144, column: 72, scope: !299)
!302 = !DILocation(line: 144, column: 13, scope: !284)
!303 = !DILocation(line: 145, column: 31, scope: !304)
!304 = distinct !DILexicalBlock(scope: !299, file: !3, line: 144, column: 78)
!305 = !DILocation(line: 145, column: 13, scope: !304)
!306 = !DILocation(line: 146, column: 19, scope: !304)
!307 = !DILocation(line: 147, column: 9, scope: !304)
!308 = !DILocation(line: 0, scope: !229)
!309 = distinct !{!309, !293, !310}
!310 = !DILocation(line: 148, column: 5, scope: !229)
!311 = !DILocation(line: 0, scope: !304)
!312 = !DILocation(line: 149, column: 5, scope: !229)
!313 = !DILocation(line: 150, column: 5, scope: !229)
!314 = distinct !DISubprogram(name: "analyzeLatencyForEvent", scope: !3, file: !3, line: 160, type: !315, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !327)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !15, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latencyStats", file: !143, line: 54, size: 256, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "all_time_high", scope: !318, file: !143, line: 55, baseType: !45, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !318, file: !143, line: 56, baseType: !45, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !318, file: !143, line: 57, baseType: !45, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !318, file: !143, line: 58, baseType: !45, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mad", scope: !318, file: !143, line: 59, baseType: !45, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !318, file: !143, line: 60, baseType: !45, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !318, file: !143, line: 61, baseType: !158, size: 64, offset: 192)
!327 = !{!328, !329, !330, !331, !332, !333}
!328 = !DILocalVariable(name: "event", arg: 1, scope: !314, file: !3, line: 160, type: !15)
!329 = !DILocalVariable(name: "ls", arg: 2, scope: !314, file: !3, line: 160, type: !317)
!330 = !DILocalVariable(name: "ts", scope: !314, file: !3, line: 161, type: !141)
!331 = !DILocalVariable(name: "j", scope: !314, file: !3, line: 162, type: !80)
!332 = !DILocalVariable(name: "sum", scope: !314, file: !3, line: 163, type: !55)
!333 = !DILocalVariable(name: "delta", scope: !334, file: !3, line: 206, type: !7)
!334 = distinct !DILexicalBlock(scope: !335, file: !3, line: 205, column: 42)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 205, column: 5)
!336 = distinct !DILexicalBlock(scope: !314, file: !3, line: 205, column: 5)
!337 = !DILocation(line: 160, column: 35, scope: !314)
!338 = !DILocation(line: 160, column: 63, scope: !314)
!339 = !DILocation(line: 161, column: 58, scope: !314)
!340 = !DILocation(line: 161, column: 36, scope: !314)
!341 = !DILocation(line: 165, column: 25, scope: !314)
!342 = !DILocation(line: 161, column: 31, scope: !314)
!343 = !DILocation(line: 165, column: 34, scope: !314)
!344 = !DILocation(line: 165, column: 9, scope: !314)
!345 = !DILocation(line: 165, column: 23, scope: !314)
!346 = !{!347, !120, i64 0}
!347 = !{!"latencyStats", !120, i64 0, !120, i64 4, !120, i64 8, !120, i64 12, !120, i64 16, !120, i64 20, !124, i64 24}
!348 = !DILocation(line: 166, column: 9, scope: !314)
!349 = !DILocation(line: 167, column: 9, scope: !314)
!350 = !DILocation(line: 168, column: 9, scope: !314)
!351 = !DILocation(line: 169, column: 9, scope: !314)
!352 = !DILocation(line: 166, column: 13, scope: !314)
!353 = !{!120, !120, i64 0}
!354 = !DILocation(line: 170, column: 9, scope: !314)
!355 = !DILocation(line: 170, column: 17, scope: !314)
!356 = !{!347, !120, i64 20}
!357 = !DILocation(line: 171, column: 9, scope: !314)
!358 = !DILocation(line: 171, column: 16, scope: !314)
!359 = !{!347, !124, i64 24}
!360 = !DILocation(line: 172, column: 9, scope: !314)
!361 = !DILocation(line: 163, column: 14, scope: !314)
!362 = !DILocation(line: 162, column: 9, scope: !314)
!363 = !DILocation(line: 176, column: 5, scope: !364)
!364 = distinct !DILexicalBlock(scope: !314, file: !3, line: 176, column: 5)
!365 = !DILocation(line: 177, column: 28, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 177, column: 13)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 176, column: 42)
!368 = distinct !DILexicalBlock(scope: !364, file: !3, line: 176, column: 5)
!369 = !DILocation(line: 177, column: 33, scope: !366)
!370 = !DILocation(line: 177, column: 13, scope: !367)
!371 = !DILocation(line: 178, column: 20, scope: !367)
!372 = !DILocation(line: 179, column: 25, scope: !373)
!373 = distinct !DILexicalBlock(scope: !367, file: !3, line: 179, column: 13)
!374 = !DILocation(line: 0, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 182, column: 17)
!376 = distinct !DILexicalBlock(scope: !373, file: !3, line: 181, column: 16)
!377 = !DILocation(line: 179, column: 13, scope: !367)
!378 = !DILocation(line: 180, column: 31, scope: !379)
!379 = distinct !DILexicalBlock(scope: !373, file: !3, line: 179, column: 31)
!380 = !{!347, !120, i64 12}
!381 = !DILocation(line: 180, column: 21, scope: !379)
!382 = !{!347, !120, i64 8}
!383 = !DILocation(line: 181, column: 9, scope: !379)
!384 = !DILocation(line: 182, column: 25, scope: !375)
!385 = !DILocation(line: 182, column: 17, scope: !376)
!386 = !DILocation(line: 183, column: 25, scope: !375)
!387 = !DILocation(line: 183, column: 17, scope: !375)
!388 = !DILocation(line: 184, column: 25, scope: !389)
!389 = distinct !DILexicalBlock(scope: !376, file: !3, line: 184, column: 17)
!390 = !DILocation(line: 184, column: 17, scope: !376)
!391 = !DILocation(line: 185, column: 25, scope: !389)
!392 = !DILocation(line: 185, column: 17, scope: !389)
!393 = !DILocation(line: 187, column: 16, scope: !367)
!394 = !DILocation(line: 187, column: 13, scope: !367)
!395 = !DILocation(line: 190, column: 24, scope: !396)
!396 = distinct !DILexicalBlock(scope: !367, file: !3, line: 190, column: 13)
!397 = !DILocation(line: 190, column: 32, scope: !396)
!398 = !DILocation(line: 190, column: 52, scope: !396)
!399 = !DILocation(line: 190, column: 29, scope: !396)
!400 = !DILocation(line: 191, column: 24, scope: !396)
!401 = !DILocation(line: 191, column: 13, scope: !396)
!402 = !DILocation(line: 0, scope: !367)
!403 = !DILocation(line: 176, column: 38, scope: !368)
!404 = !DILocation(line: 176, column: 19, scope: !368)
!405 = distinct !{!405, !363, !406}
!406 = !DILocation(line: 192, column: 5, scope: !364)
!407 = !DILocation(line: 197, column: 9, scope: !408)
!408 = distinct !DILexicalBlock(scope: !314, file: !3, line: 197, column: 9)
!409 = !DILocation(line: 197, column: 9, scope: !314)
!410 = !DILocation(line: 198, column: 25, scope: !411)
!411 = distinct !DILexicalBlock(scope: !408, file: !3, line: 197, column: 22)
!412 = !DILocation(line: 198, column: 23, scope: !411)
!413 = !DILocation(line: 198, column: 19, scope: !411)
!414 = !DILocation(line: 198, column: 17, scope: !411)
!415 = !{!347, !120, i64 4}
!416 = !DILocation(line: 199, column: 22, scope: !411)
!417 = !DILocation(line: 199, column: 39, scope: !411)
!418 = !DILocation(line: 199, column: 33, scope: !411)
!419 = !DILocation(line: 200, column: 24, scope: !420)
!420 = distinct !DILexicalBlock(scope: !411, file: !3, line: 200, column: 13)
!421 = !DILocation(line: 200, column: 13, scope: !411)
!422 = !DILocation(line: 0, scope: !420)
!423 = !DILocation(line: 208, column: 28, scope: !424)
!424 = distinct !DILexicalBlock(scope: !334, file: !3, line: 208, column: 13)
!425 = !DILocation(line: 208, column: 33, scope: !424)
!426 = !DILocation(line: 208, column: 13, scope: !334)
!427 = !DILocation(line: 209, column: 30, scope: !334)
!428 = !DILocation(line: 209, column: 17, scope: !334)
!429 = !DILocation(line: 209, column: 51, scope: !334)
!430 = !DILocation(line: 209, column: 36, scope: !334)
!431 = !DILocation(line: 209, column: 34, scope: !334)
!432 = !DILocation(line: 206, column: 17, scope: !334)
!433 = !DILocation(line: 210, column: 19, scope: !434)
!434 = distinct !DILexicalBlock(scope: !334, file: !3, line: 210, column: 13)
!435 = !DILocation(line: 210, column: 32, scope: !434)
!436 = !DILocation(line: 210, column: 13, scope: !334)
!437 = !DILocation(line: 211, column: 13, scope: !334)
!438 = !DILocation(line: 212, column: 5, scope: !335)
!439 = !DILocation(line: 0, scope: !334)
!440 = !DILocation(line: 205, column: 38, scope: !335)
!441 = !DILocation(line: 213, column: 13, scope: !442)
!442 = distinct !DILexicalBlock(scope: !314, file: !3, line: 213, column: 9)
!443 = !DILocation(line: 213, column: 9, scope: !442)
!444 = !DILocation(line: 213, column: 9, scope: !314)
!445 = !DILocation(line: 213, column: 38, scope: !442)
!446 = !DILocation(line: 213, column: 36, scope: !442)
!447 = !DILocation(line: 213, column: 32, scope: !442)
!448 = !DILocation(line: 213, column: 30, scope: !442)
!449 = !{!347, !120, i64 16}
!450 = !DILocation(line: 213, column: 22, scope: !442)
!451 = !DILocation(line: 214, column: 1, scope: !314)
!452 = !DILocation(line: 205, column: 19, scope: !335)
!453 = !DILocation(line: 205, column: 5, scope: !336)
!454 = distinct !{!454, !453, !455}
!455 = !DILocation(line: 212, column: 5, scope: !336)
!456 = distinct !DISubprogram(name: "createLatencyReport", scope: !3, file: !3, line: 217, type: !457, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !460)
!457 = !DISubroutineType(types: !458)
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !19, line: 43, baseType: !15)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !485, !486}
!461 = !DILocalVariable(name: "report", scope: !456, file: !3, line: 218, type: !459)
!462 = !DILocalVariable(name: "advise_better_vm", scope: !456, file: !3, line: 219, type: !80)
!463 = !DILocalVariable(name: "advise_slowlog_enabled", scope: !456, file: !3, line: 220, type: !80)
!464 = !DILocalVariable(name: "advise_slowlog_tuning", scope: !456, file: !3, line: 221, type: !80)
!465 = !DILocalVariable(name: "advise_slowlog_inspect", scope: !456, file: !3, line: 222, type: !80)
!466 = !DILocalVariable(name: "advise_disk_contention", scope: !456, file: !3, line: 223, type: !80)
!467 = !DILocalVariable(name: "advise_scheduler", scope: !456, file: !3, line: 224, type: !80)
!468 = !DILocalVariable(name: "advise_data_writeback", scope: !456, file: !3, line: 225, type: !80)
!469 = !DILocalVariable(name: "advise_no_appendfsync", scope: !456, file: !3, line: 226, type: !80)
!470 = !DILocalVariable(name: "advise_local_disk", scope: !456, file: !3, line: 227, type: !80)
!471 = !DILocalVariable(name: "advise_ssd", scope: !456, file: !3, line: 228, type: !80)
!472 = !DILocalVariable(name: "advise_write_load_info", scope: !456, file: !3, line: 229, type: !80)
!473 = !DILocalVariable(name: "advise_hz", scope: !456, file: !3, line: 230, type: !80)
!474 = !DILocalVariable(name: "advise_large_objects", scope: !456, file: !3, line: 231, type: !80)
!475 = !DILocalVariable(name: "advise_mass_eviction", scope: !456, file: !3, line: 232, type: !80)
!476 = !DILocalVariable(name: "advise_relax_fsync_policy", scope: !456, file: !3, line: 233, type: !80)
!477 = !DILocalVariable(name: "advise_disable_thp", scope: !456, file: !3, line: 234, type: !80)
!478 = !DILocalVariable(name: "advices", scope: !456, file: !3, line: 235, type: !80)
!479 = !DILocalVariable(name: "di", scope: !456, file: !3, line: 248, type: !235)
!480 = !DILocalVariable(name: "de", scope: !456, file: !3, line: 249, type: !254)
!481 = !DILocalVariable(name: "eventnum", scope: !456, file: !3, line: 250, type: !80)
!482 = !DILocalVariable(name: "event", scope: !483, file: !3, line: 254, type: !15)
!483 = distinct !DILexicalBlock(scope: !456, file: !3, line: 253, column: 40)
!484 = !DILocalVariable(name: "ts", scope: !483, file: !3, line: 255, type: !141)
!485 = !DILocalVariable(name: "ls", scope: !483, file: !3, line: 256, type: !318)
!486 = !DILocalVariable(name: "fork_quality", scope: !487, file: !3, line: 276, type: !15)
!487 = distinct !DILexicalBlock(scope: !488, file: !3, line: 275, column: 40)
!488 = distinct !DILexicalBlock(scope: !483, file: !3, line: 275, column: 13)
!489 = !DILocation(line: 218, column: 18, scope: !456)
!490 = !DILocation(line: 218, column: 9, scope: !456)
!491 = !DILocation(line: 219, column: 9, scope: !456)
!492 = !DILocation(line: 220, column: 9, scope: !456)
!493 = !DILocation(line: 221, column: 9, scope: !456)
!494 = !DILocation(line: 222, column: 9, scope: !456)
!495 = !DILocation(line: 223, column: 9, scope: !456)
!496 = !DILocation(line: 224, column: 9, scope: !456)
!497 = !DILocation(line: 225, column: 9, scope: !456)
!498 = !DILocation(line: 226, column: 9, scope: !456)
!499 = !DILocation(line: 227, column: 9, scope: !456)
!500 = !DILocation(line: 228, column: 9, scope: !456)
!501 = !DILocation(line: 229, column: 9, scope: !456)
!502 = !DILocation(line: 230, column: 9, scope: !456)
!503 = !DILocation(line: 231, column: 9, scope: !456)
!504 = !DILocation(line: 232, column: 9, scope: !456)
!505 = !DILocation(line: 233, column: 9, scope: !456)
!506 = !DILocation(line: 234, column: 9, scope: !456)
!507 = !DILocation(line: 235, column: 9, scope: !456)
!508 = !DILocation(line: 239, column: 9, scope: !509)
!509 = distinct !DILexicalBlock(scope: !456, file: !3, line: 239, column: 9)
!510 = !{!511, !124, i64 24}
!511 = !{!"dictht", !123, i64 0, !124, i64 8, !124, i64 16, !124, i64 24}
!512 = !DILocation(line: 239, column: 41, scope: !509)
!513 = !DILocation(line: 240, column: 16, scope: !509)
!514 = !DILocation(line: 240, column: 42, scope: !509)
!515 = !DILocation(line: 239, column: 46, scope: !509)
!516 = !DILocation(line: 242, column: 18, scope: !517)
!517 = distinct !DILexicalBlock(scope: !509, file: !3, line: 241, column: 5)
!518 = !DILocation(line: 243, column: 9, scope: !517)
!519 = !DILocation(line: 250, column: 9, scope: !456)
!520 = !DILocation(line: 252, column: 10, scope: !456)
!521 = !DILocation(line: 248, column: 19, scope: !456)
!522 = !DILocation(line: 253, column: 17, scope: !456)
!523 = !DILocation(line: 249, column: 16, scope: !456)
!524 = !DILocation(line: 253, column: 31, scope: !456)
!525 = !DILocation(line: 253, column: 5, scope: !456)
!526 = !DILocation(line: 254, column: 23, scope: !483)
!527 = !DILocation(line: 254, column: 15, scope: !483)
!528 = !DILocation(line: 255, column: 40, scope: !483)
!529 = !{!121, !121, i64 0}
!530 = !DILocation(line: 255, column: 35, scope: !483)
!531 = !DILocation(line: 256, column: 9, scope: !483)
!532 = !DILocation(line: 258, column: 16, scope: !533)
!533 = distinct !DILexicalBlock(scope: !483, file: !3, line: 258, column: 13)
!534 = !DILocation(line: 258, column: 13, scope: !483)
!535 = distinct !{!535, !525, !536}
!536 = !DILocation(line: 380, column: 5, scope: !456)
!537 = !DILocation(line: 259, column: 17, scope: !483)
!538 = !DILocation(line: 260, column: 22, scope: !539)
!539 = distinct !DILexicalBlock(scope: !483, file: !3, line: 260, column: 13)
!540 = !DILocation(line: 260, column: 13, scope: !483)
!541 = !DILocation(line: 261, column: 22, scope: !542)
!542 = distinct !DILexicalBlock(scope: !539, file: !3, line: 260, column: 28)
!543 = !DILocation(line: 262, column: 9, scope: !542)
!544 = !DILocation(line: 0, scope: !456)
!545 = !DILocation(line: 256, column: 29, scope: !483)
!546 = !DILocation(line: 263, column: 9, scope: !483)
!547 = !DILocation(line: 268, column: 16, scope: !483)
!548 = !DILocation(line: 269, column: 32, scope: !483)
!549 = !DILocation(line: 269, column: 13, scope: !483)
!550 = !DILocation(line: 270, column: 32, scope: !483)
!551 = !DILocation(line: 270, column: 13, scope: !483)
!552 = !DILocation(line: 271, column: 25, scope: !483)
!553 = !DILocation(line: 271, column: 13, scope: !483)
!554 = !DILocation(line: 271, column: 32, scope: !483)
!555 = !DILocation(line: 271, column: 31, scope: !483)
!556 = !DILocation(line: 272, column: 33, scope: !483)
!557 = !DILocation(line: 272, column: 13, scope: !483)
!558 = !DILocation(line: 265, column: 18, scope: !483)
!559 = !DILocation(line: 275, column: 14, scope: !488)
!560 = !DILocation(line: 275, column: 13, scope: !483)
!561 = !DILocation(line: 277, column: 24, scope: !562)
!562 = distinct !DILexicalBlock(scope: !487, file: !3, line: 277, column: 17)
!563 = !{!119, !126, i64 1128}
!564 = !DILocation(line: 277, column: 39, scope: !562)
!565 = !DILocation(line: 277, column: 17, scope: !487)
!566 = !DILocation(line: 280, column: 24, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !3, line: 277, column: 45)
!568 = !DILocation(line: 281, column: 13, scope: !567)
!569 = !DILocation(line: 281, column: 46, scope: !570)
!570 = distinct !DILexicalBlock(scope: !562, file: !3, line: 281, column: 24)
!571 = !DILocation(line: 281, column: 24, scope: !562)
!572 = !DILocation(line: 284, column: 24, scope: !573)
!573 = distinct !DILexicalBlock(scope: !570, file: !3, line: 281, column: 52)
!574 = !DILocation(line: 285, column: 13, scope: !573)
!575 = !DILocation(line: 285, column: 46, scope: !576)
!576 = distinct !DILexicalBlock(scope: !570, file: !3, line: 285, column: 24)
!577 = !DILocation(line: 287, column: 13, scope: !578)
!578 = distinct !DILexicalBlock(scope: !576, file: !3, line: 285, column: 53)
!579 = !DILocation(line: 0, scope: !580)
!580 = distinct !DILexicalBlock(scope: !576, file: !3, line: 287, column: 20)
!581 = !DILocation(line: 276, column: 19, scope: !487)
!582 = !DILocation(line: 290, column: 22, scope: !487)
!583 = !DILocation(line: 293, column: 9, scope: !487)
!584 = !DILocation(line: 0, scope: !567)
!585 = !DILocation(line: 0, scope: !487)
!586 = !DILocation(line: 296, column: 14, scope: !587)
!587 = distinct !DILexicalBlock(scope: !483, file: !3, line: 296, column: 13)
!588 = !DILocation(line: 296, column: 13, scope: !483)
!589 = !DILocation(line: 297, column: 24, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !3, line: 297, column: 17)
!591 = distinct !DILexicalBlock(scope: !587, file: !3, line: 296, column: 43)
!592 = !{!119, !125, i64 1184}
!593 = !DILocation(line: 297, column: 48, scope: !590)
!594 = !DILocation(line: 297, column: 17, scope: !591)
!595 = !DILocation(line: 301, column: 31, scope: !596)
!596 = distinct !DILexicalBlock(scope: !590, file: !3, line: 300, column: 24)
!597 = !{!119, !125, i64 3096}
!598 = !DILocation(line: 300, column: 60, scope: !596)
!599 = !DILocation(line: 300, column: 24, scope: !590)
!600 = !DILocation(line: 0, scope: !601)
!601 = distinct !DILexicalBlock(scope: !590, file: !3, line: 297, column: 53)
!602 = !DILocation(line: 308, column: 21, scope: !591)
!603 = !DILocation(line: 309, column: 9, scope: !591)
!604 = !DILocation(line: 0, scope: !591)
!605 = !DILocation(line: 312, column: 14, scope: !606)
!606 = distinct !DILexicalBlock(scope: !483, file: !3, line: 312, column: 13)
!607 = !DILocation(line: 312, column: 13, scope: !483)
!608 = !DILocation(line: 318, column: 14, scope: !609)
!609 = distinct !DILexicalBlock(scope: !483, file: !3, line: 318, column: 13)
!610 = !DILocation(line: 323, column: 21, scope: !611)
!611 = distinct !DILexicalBlock(scope: !609, file: !3, line: 318, column: 59)
!612 = !DILocation(line: 318, column: 13, scope: !483)
!613 = !DILocation(line: 326, column: 14, scope: !614)
!614 = distinct !DILexicalBlock(scope: !483, file: !3, line: 326, column: 13)
!615 = !DILocation(line: 330, column: 21, scope: !616)
!616 = distinct !DILexicalBlock(scope: !614, file: !3, line: 326, column: 58)
!617 = !DILocation(line: 326, column: 13, scope: !483)
!618 = !DILocation(line: 333, column: 14, scope: !619)
!619 = distinct !DILexicalBlock(scope: !483, file: !3, line: 333, column: 13)
!620 = !DILocation(line: 337, column: 21, scope: !621)
!621 = distinct !DILexicalBlock(scope: !619, file: !3, line: 333, column: 51)
!622 = !DILocation(line: 333, column: 13, scope: !483)
!623 = !DILocation(line: 340, column: 14, scope: !624)
!624 = distinct !DILexicalBlock(scope: !483, file: !3, line: 340, column: 13)
!625 = !DILocation(line: 340, column: 13, scope: !483)
!626 = !DILocation(line: 345, column: 14, scope: !627)
!627 = distinct !DILexicalBlock(scope: !483, file: !3, line: 345, column: 13)
!628 = !DILocation(line: 345, column: 44, scope: !627)
!629 = !DILocation(line: 346, column: 14, scope: !627)
!630 = !DILocation(line: 345, column: 13, scope: !483)
!631 = !DILocation(line: 349, column: 21, scope: !632)
!632 = distinct !DILexicalBlock(scope: !627, file: !3, line: 346, column: 55)
!633 = !DILocation(line: 350, column: 9, scope: !632)
!634 = !DILocation(line: 0, scope: !632)
!635 = !DILocation(line: 352, column: 14, scope: !636)
!636 = distinct !DILexicalBlock(scope: !483, file: !3, line: 352, column: 13)
!637 = !DILocation(line: 352, column: 57, scope: !636)
!638 = !DILocation(line: 353, column: 14, scope: !636)
!639 = !DILocation(line: 352, column: 13, scope: !483)
!640 = !DILocation(line: 358, column: 21, scope: !641)
!641 = distinct !DILexicalBlock(scope: !636, file: !3, line: 353, column: 46)
!642 = !DILocation(line: 359, column: 9, scope: !641)
!643 = !DILocation(line: 0, scope: !641)
!644 = !DILocation(line: 362, column: 14, scope: !645)
!645 = distinct !DILexicalBlock(scope: !483, file: !3, line: 362, column: 13)
!646 = !DILocation(line: 365, column: 21, scope: !647)
!647 = distinct !DILexicalBlock(scope: !645, file: !3, line: 362, column: 48)
!648 = !DILocation(line: 362, column: 13, scope: !483)
!649 = !DILocation(line: 369, column: 14, scope: !650)
!650 = distinct !DILexicalBlock(scope: !483, file: !3, line: 369, column: 13)
!651 = !DILocation(line: 369, column: 13, scope: !483)
!652 = !DILocation(line: 374, column: 14, scope: !653)
!653 = distinct !DILexicalBlock(scope: !483, file: !3, line: 374, column: 13)
!654 = !DILocation(line: 374, column: 13, scope: !483)
!655 = !DILocation(line: 379, column: 18, scope: !483)
!656 = !DILocation(line: 0, scope: !483)
!657 = !DILocation(line: 381, column: 5, scope: !456)
!658 = !DILocation(line: 82, column: 12, scope: !108, inlinedAt: !659)
!659 = distinct !DILocation(line: 384, column: 9, scope: !660)
!660 = distinct !DILexicalBlock(scope: !456, file: !3, line: 384, column: 9)
!661 = !DILocation(line: 384, column: 35, scope: !660)
!662 = !DILocation(line: 384, column: 9, scope: !456)
!663 = !DILocation(line: 389, column: 23, scope: !664)
!664 = distinct !DILexicalBlock(scope: !456, file: !3, line: 389, column: 9)
!665 = !DILocation(line: 390, column: 18, scope: !666)
!666 = distinct !DILexicalBlock(scope: !664, file: !3, line: 389, column: 40)
!667 = !DILocation(line: 391, column: 5, scope: !666)
!668 = !DILocation(line: 389, column: 34, scope: !664)
!669 = !DILocation(line: 391, column: 25, scope: !670)
!670 = distinct !DILexicalBlock(scope: !664, file: !3, line: 391, column: 16)
!671 = !DILocation(line: 391, column: 29, scope: !670)
!672 = !DILocation(line: 392, column: 18, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !3, line: 391, column: 46)
!674 = !DILocation(line: 393, column: 5, scope: !673)
!675 = !DILocation(line: 397, column: 18, scope: !676)
!676 = distinct !DILexicalBlock(scope: !670, file: !3, line: 393, column: 12)
!677 = !DILocation(line: 398, column: 13, scope: !678)
!678 = distinct !DILexicalBlock(scope: !676, file: !3, line: 398, column: 13)
!679 = !DILocation(line: 398, column: 13, scope: !676)
!680 = !DILocation(line: 399, column: 22, scope: !681)
!681 = distinct !DILexicalBlock(scope: !678, file: !3, line: 398, column: 31)
!682 = !DILocation(line: 400, column: 9, scope: !681)
!683 = !DILocation(line: 0, scope: !676)
!684 = !DILocation(line: 403, column: 13, scope: !685)
!685 = distinct !DILexicalBlock(scope: !676, file: !3, line: 403, column: 13)
!686 = !DILocation(line: 403, column: 13, scope: !676)
!687 = !DILocation(line: 404, column: 335, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !3, line: 403, column: 37)
!689 = !DILocation(line: 404, column: 360, scope: !688)
!690 = !DILocation(line: 404, column: 22, scope: !688)
!691 = !DILocation(line: 405, column: 9, scope: !688)
!692 = !DILocation(line: 0, scope: !681)
!693 = !DILocation(line: 407, column: 13, scope: !694)
!694 = distinct !DILexicalBlock(scope: !676, file: !3, line: 407, column: 13)
!695 = !DILocation(line: 407, column: 13, scope: !676)
!696 = !DILocation(line: 408, column: 247, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !3, line: 407, column: 36)
!698 = !DILocation(line: 408, column: 272, scope: !697)
!699 = !DILocation(line: 408, column: 22, scope: !697)
!700 = !DILocation(line: 409, column: 9, scope: !697)
!701 = !DILocation(line: 0, scope: !688)
!702 = !DILocation(line: 411, column: 13, scope: !703)
!703 = distinct !DILexicalBlock(scope: !676, file: !3, line: 411, column: 13)
!704 = !DILocation(line: 411, column: 13, scope: !676)
!705 = !DILocation(line: 412, column: 22, scope: !706)
!706 = distinct !DILexicalBlock(scope: !703, file: !3, line: 411, column: 37)
!707 = !DILocation(line: 413, column: 9, scope: !706)
!708 = !DILocation(line: 0, scope: !697)
!709 = !DILocation(line: 416, column: 13, scope: !710)
!710 = distinct !DILexicalBlock(scope: !676, file: !3, line: 416, column: 13)
!711 = !DILocation(line: 416, column: 13, scope: !676)
!712 = !DILocation(line: 417, column: 22, scope: !713)
!713 = distinct !DILexicalBlock(scope: !710, file: !3, line: 416, column: 31)
!714 = !DILocation(line: 423, column: 9, scope: !713)
!715 = !DILocation(line: 0, scope: !706)
!716 = !DILocation(line: 426, column: 13, scope: !717)
!717 = distinct !DILexicalBlock(scope: !676, file: !3, line: 426, column: 13)
!718 = !DILocation(line: 426, column: 13, scope: !676)
!719 = !DILocation(line: 427, column: 22, scope: !720)
!720 = distinct !DILexicalBlock(scope: !717, file: !3, line: 426, column: 32)
!721 = !DILocation(line: 428, column: 9, scope: !720)
!722 = !DILocation(line: 0, scope: !713)
!723 = !DILocation(line: 430, column: 13, scope: !724)
!724 = distinct !DILexicalBlock(scope: !676, file: !3, line: 430, column: 13)
!725 = !DILocation(line: 430, column: 13, scope: !676)
!726 = !DILocation(line: 431, column: 22, scope: !727)
!727 = distinct !DILexicalBlock(scope: !724, file: !3, line: 430, column: 25)
!728 = !DILocation(line: 432, column: 9, scope: !727)
!729 = !DILocation(line: 0, scope: !720)
!730 = !DILocation(line: 434, column: 13, scope: !731)
!731 = distinct !DILexicalBlock(scope: !676, file: !3, line: 434, column: 13)
!732 = !DILocation(line: 434, column: 13, scope: !676)
!733 = !DILocation(line: 435, column: 22, scope: !734)
!734 = distinct !DILexicalBlock(scope: !731, file: !3, line: 434, column: 36)
!735 = !DILocation(line: 436, column: 9, scope: !734)
!736 = !DILocation(line: 0, scope: !727)
!737 = !DILocation(line: 438, column: 13, scope: !738)
!738 = distinct !DILexicalBlock(scope: !676, file: !3, line: 438, column: 13)
!739 = !DILocation(line: 438, column: 13, scope: !676)
!740 = !DILocation(line: 439, column: 22, scope: !741)
!741 = distinct !DILexicalBlock(scope: !738, file: !3, line: 438, column: 37)
!742 = !DILocation(line: 440, column: 9, scope: !741)
!743 = !DILocation(line: 0, scope: !734)
!744 = !DILocation(line: 442, column: 13, scope: !745)
!745 = distinct !DILexicalBlock(scope: !676, file: !3, line: 442, column: 13)
!746 = !DILocation(line: 442, column: 13, scope: !676)
!747 = !DILocation(line: 443, column: 22, scope: !748)
!748 = distinct !DILexicalBlock(scope: !745, file: !3, line: 442, column: 36)
!749 = !DILocation(line: 444, column: 9, scope: !748)
!750 = !DILocation(line: 0, scope: !741)
!751 = !DILocation(line: 446, column: 13, scope: !752)
!752 = distinct !DILexicalBlock(scope: !676, file: !3, line: 446, column: 13)
!753 = !DILocation(line: 446, column: 49, scope: !752)
!754 = !DILocation(line: 446, column: 59, scope: !752)
!755 = !DILocation(line: 446, column: 39, scope: !752)
!756 = !DILocation(line: 447, column: 22, scope: !757)
!757 = distinct !DILexicalBlock(scope: !752, file: !3, line: 446, column: 80)
!758 = !DILocation(line: 448, column: 9, scope: !757)
!759 = !DILocation(line: 0, scope: !748)
!760 = !DILocation(line: 450, column: 13, scope: !761)
!761 = distinct !DILexicalBlock(scope: !676, file: !3, line: 450, column: 13)
!762 = !DILocation(line: 450, column: 13, scope: !676)
!763 = !DILocation(line: 451, column: 22, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !3, line: 450, column: 37)
!765 = !DILocation(line: 452, column: 9, scope: !764)
!766 = !DILocation(line: 0, scope: !757)
!767 = !DILocation(line: 454, column: 13, scope: !768)
!768 = distinct !DILexicalBlock(scope: !676, file: !3, line: 454, column: 13)
!769 = !DILocation(line: 454, column: 33, scope: !768)
!770 = !DILocation(line: 454, column: 36, scope: !768)
!771 = !DILocation(line: 454, column: 23, scope: !768)
!772 = !DILocation(line: 455, column: 22, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !3, line: 454, column: 43)
!774 = !DILocation(line: 456, column: 9, scope: !773)
!775 = !DILocation(line: 0, scope: !764)
!776 = !DILocation(line: 458, column: 13, scope: !777)
!777 = distinct !DILexicalBlock(scope: !676, file: !3, line: 458, column: 13)
!778 = !DILocation(line: 458, column: 13, scope: !676)
!779 = !DILocation(line: 459, column: 22, scope: !780)
!780 = distinct !DILexicalBlock(scope: !777, file: !3, line: 458, column: 35)
!781 = !DILocation(line: 460, column: 9, scope: !780)
!782 = !DILocation(line: 0, scope: !773)
!783 = !DILocation(line: 462, column: 13, scope: !784)
!784 = distinct !DILexicalBlock(scope: !676, file: !3, line: 462, column: 13)
!785 = !DILocation(line: 462, column: 13, scope: !676)
!786 = !DILocation(line: 463, column: 22, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !3, line: 462, column: 35)
!788 = !DILocation(line: 464, column: 9, scope: !787)
!789 = !DILocation(line: 0, scope: !780)
!790 = !DILocation(line: 466, column: 13, scope: !676)
!791 = !DILocation(line: 467, column: 22, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 466, column: 33)
!793 = distinct !DILexicalBlock(scope: !676, file: !3, line: 466, column: 13)
!794 = !DILocation(line: 468, column: 9, scope: !792)
!795 = !DILocation(line: 472, column: 1, scope: !456)
!796 = distinct !DISubprogram(name: "latencyCommandReplyWithSamples", scope: !3, file: !3, line: 478, type: !797, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !972)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !799, !141}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !135, line: 780, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !135, line: 723, size: 135360, elements: !802)
!802 = !{!803, !804, !805, !846, !856, !857, !862, !863, !864, !865, !867, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !911, !912, !913, !914, !915, !916, !917, !918, !922, !923, !927, !928, !944, !945, !961, !962, !963, !964, !965, !966, !967, !968}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !801, file: !135, line: 724, baseType: !55, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !801, file: !135, line: 725, baseType: !80, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !801, file: !135, line: 726, baseType: !806, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !135, line: 656, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !135, line: 647, size: 512, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !808, file: !135, line: 648, baseType: !240, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !808, file: !135, line: 649, baseType: !240, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !808, file: !135, line: 650, baseType: !240, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !808, file: !135, line: 651, baseType: !240, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !808, file: !135, line: 652, baseType: !240, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !808, file: !135, line: 653, baseType: !80, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !808, file: !135, line: 654, baseType: !136, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !808, file: !135, line: 655, baseType: !818, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !820, line: 54, baseType: !821)
!820 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !820, line: 47, size: 384, elements: !822)
!822 = !{!823, !832, !833, !837, !841, !845}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !821, file: !820, line: 48, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !820, line: 40, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !820, line: 36, size: 192, elements: !827)
!827 = !{!828, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !820, line: 37, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !820, line: 38, baseType: !829, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !826, file: !820, line: 39, baseType: !6, size: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !821, file: !820, line: 49, baseType: !824, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !821, file: !820, line: 50, baseType: !834, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!6, !6}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !821, file: !820, line: 51, baseType: !838, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !6}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !821, file: !820, line: 52, baseType: !842, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!80, !6, !6}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !821, file: !820, line: 53, baseType: !12, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !135, line: 727, baseType: !847, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !135, line: 622, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !135, line: 614, size: 128, elements: !850)
!850 = !{!851, !852, !853, !854, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !849, file: !135, line: 615, baseType: !47, size: 4, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !849, file: !135, line: 616, baseType: !47, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !849, file: !135, line: 617, baseType: !47, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !849, file: !135, line: 620, baseType: !80, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !849, file: !135, line: 621, baseType: !6, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !801, file: !135, line: 728, baseType: !459, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !801, file: !135, line: 729, baseType: !858, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !859, line: 40, baseType: !860)
!859 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !861, line: 129, baseType: !12)
!861 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !801, file: !135, line: 730, baseType: !459, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !801, file: !135, line: 734, baseType: !858, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !801, file: !135, line: 735, baseType: !80, size: 32, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !801, file: !135, line: 736, baseType: !866, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !801, file: !135, line: 737, baseType: !868, size: 64, offset: 640)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !135, line: 1307, size: 640, elements: !870)
!870 = !{!871, !872, !877, !878, !879, !880, !886, !887, !888, !889, !890}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !135, line: 1308, baseType: !15, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !869, file: !135, line: 1309, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !135, line: 1305, baseType: !875)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !799}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !869, file: !135, line: 1310, baseType: !80, size: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !869, file: !135, line: 1311, baseType: !15, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !869, file: !135, line: 1312, baseType: !80, size: 32, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !869, file: !135, line: 1315, baseType: !881, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !135, line: 1306, baseType: !883)
!883 = !DISubroutineType(types: !884)
!884 = !{!885, !868, !866, !80, !885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !869, file: !135, line: 1317, baseType: !80, size: 32, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !869, file: !135, line: 1318, baseType: !80, size: 32, offset: 416)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !869, file: !135, line: 1319, baseType: !80, size: 32, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !869, file: !135, line: 1320, baseType: !136, size: 64, offset: 512)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !869, file: !135, line: 1320, baseType: !136, size: 64, offset: 576)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !801, file: !135, line: 737, baseType: !868, size: 64, offset: 704)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !801, file: !135, line: 738, baseType: !80, size: 32, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !801, file: !135, line: 739, baseType: !80, size: 32, offset: 800)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !801, file: !135, line: 740, baseType: !11, size: 64, offset: 832)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !801, file: !135, line: 741, baseType: !818, size: 64, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !801, file: !135, line: 742, baseType: !14, size: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !801, file: !135, line: 743, baseType: !858, size: 64, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !801, file: !135, line: 745, baseType: !158, size: 64, offset: 1088)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !801, file: !135, line: 746, baseType: !158, size: 64, offset: 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !801, file: !135, line: 747, baseType: !158, size: 64, offset: 1216)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !801, file: !135, line: 748, baseType: !80, size: 32, offset: 1280)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !801, file: !135, line: 749, baseType: !80, size: 32, offset: 1312)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !801, file: !135, line: 750, baseType: !80, size: 32, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !801, file: !135, line: 751, baseType: !80, size: 32, offset: 1376)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !801, file: !135, line: 752, baseType: !80, size: 32, offset: 1408)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !801, file: !135, line: 753, baseType: !907, size: 64, offset: 1472)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !908, line: 173, baseType: !909)
!908 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !861, line: 100, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !861, line: 44, baseType: !11)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !801, file: !135, line: 754, baseType: !907, size: 64, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !801, file: !135, line: 755, baseType: !459, size: 64, offset: 1600)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !801, file: !135, line: 756, baseType: !136, size: 64, offset: 1664)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !801, file: !135, line: 757, baseType: !136, size: 64, offset: 1728)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !801, file: !135, line: 758, baseType: !136, size: 64, offset: 1792)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !801, file: !135, line: 759, baseType: !136, size: 64, offset: 1856)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !801, file: !135, line: 760, baseType: !136, size: 64, offset: 1920)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !801, file: !135, line: 763, baseType: !919, size: 328, offset: 1984)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 328, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 41)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !801, file: !135, line: 764, baseType: !80, size: 32, offset: 2336)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !801, file: !135, line: 765, baseType: !924, size: 368, offset: 2368)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 368, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 46)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !801, file: !135, line: 766, baseType: !80, size: 32, offset: 2752)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !801, file: !135, line: 767, baseType: !929, size: 256, offset: 2816)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !135, line: 673, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !135, line: 665, size: 256, elements: !931)
!931 = !{!932, !940, !941, !942, !943}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !930, file: !135, line: 666, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !135, line: 663, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !135, line: 659, size: 192, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !935, file: !135, line: 660, baseType: !866, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !935, file: !135, line: 661, baseType: !80, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !935, file: !135, line: 662, baseType: !868, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !930, file: !135, line: 667, baseType: !80, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !930, file: !135, line: 668, baseType: !80, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !930, file: !135, line: 671, baseType: !80, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !930, file: !135, line: 672, baseType: !158, size: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !801, file: !135, line: 768, baseType: !80, size: 32, offset: 3072)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !801, file: !135, line: 769, baseType: !946, size: 704, offset: 3136)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !135, line: 703, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !135, line: 677, size: 704, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !947, file: !135, line: 679, baseType: !134, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !947, file: !135, line: 683, baseType: !240, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !947, file: !135, line: 685, baseType: !847, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !947, file: !135, line: 689, baseType: !858, size: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !947, file: !135, line: 690, baseType: !847, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !947, file: !135, line: 691, baseType: !847, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !947, file: !135, line: 692, baseType: !134, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !947, file: !135, line: 692, baseType: !134, size: 64, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !947, file: !135, line: 693, baseType: !80, size: 32, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !947, file: !135, line: 696, baseType: !80, size: 32, offset: 544)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !947, file: !135, line: 697, baseType: !136, size: 64, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !947, file: !135, line: 700, baseType: !6, size: 64, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !801, file: !135, line: 770, baseType: !136, size: 64, offset: 3840)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !801, file: !135, line: 771, baseType: !818, size: 64, offset: 3904)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !801, file: !135, line: 772, baseType: !240, size: 64, offset: 3968)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !801, file: !135, line: 773, baseType: !818, size: 64, offset: 4032)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !801, file: !135, line: 774, baseType: !459, size: 64, offset: 4096)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !801, file: !135, line: 775, baseType: !824, size: 64, offset: 4160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !801, file: !135, line: 778, baseType: !80, size: 32, offset: 4224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !801, file: !135, line: 779, baseType: !969, size: 131072, offset: 4256)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 131072, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 16384)
!972 = !{!973, !974, !975, !976, !977, !978}
!973 = !DILocalVariable(name: "c", arg: 1, scope: !796, file: !3, line: 478, type: !799)
!974 = !DILocalVariable(name: "ts", arg: 2, scope: !796, file: !3, line: 478, type: !141)
!975 = !DILocalVariable(name: "replylen", scope: !796, file: !3, line: 479, type: !6)
!976 = !DILocalVariable(name: "samples", scope: !796, file: !3, line: 480, type: !80)
!977 = !DILocalVariable(name: "j", scope: !796, file: !3, line: 480, type: !80)
!978 = !DILocalVariable(name: "i", scope: !979, file: !3, line: 483, type: !80)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 482, column: 42)
!980 = distinct !DILexicalBlock(scope: !981, file: !3, line: 482, column: 5)
!981 = distinct !DILexicalBlock(scope: !796, file: !3, line: 482, column: 5)
!982 = !DILocation(line: 478, column: 45, scope: !796)
!983 = !DILocation(line: 478, column: 74, scope: !796)
!984 = !DILocation(line: 479, column: 22, scope: !796)
!985 = !DILocation(line: 479, column: 11, scope: !796)
!986 = !DILocation(line: 480, column: 9, scope: !796)
!987 = !DILocation(line: 480, column: 22, scope: !796)
!988 = !DILocation(line: 482, column: 5, scope: !981)
!989 = !DILocation(line: 483, column: 22, scope: !979)
!990 = !DILocation(line: 483, column: 26, scope: !979)
!991 = !DILocation(line: 483, column: 31, scope: !979)
!992 = !DILocation(line: 483, column: 13, scope: !979)
!993 = !DILocation(line: 485, column: 13, scope: !994)
!994 = distinct !DILexicalBlock(scope: !979, file: !3, line: 485, column: 13)
!995 = !DILocation(line: 485, column: 28, scope: !994)
!996 = !DILocation(line: 485, column: 33, scope: !994)
!997 = !DILocation(line: 485, column: 13, scope: !979)
!998 = !DILocation(line: 486, column: 9, scope: !979)
!999 = !DILocation(line: 487, column: 43, scope: !979)
!1000 = !DILocation(line: 487, column: 28, scope: !979)
!1001 = !DILocation(line: 487, column: 9, scope: !979)
!1002 = !DILocation(line: 488, column: 43, scope: !979)
!1003 = !DILocation(line: 488, column: 28, scope: !979)
!1004 = !DILocation(line: 488, column: 9, scope: !979)
!1005 = !DILocation(line: 489, column: 16, scope: !979)
!1006 = !DILocation(line: 490, column: 5, scope: !980)
!1007 = !DILocation(line: 0, scope: !979)
!1008 = !DILocation(line: 482, column: 38, scope: !980)
!1009 = !DILocation(line: 482, column: 19, scope: !980)
!1010 = distinct !{!1010, !988, !1011}
!1011 = !DILocation(line: 490, column: 5, scope: !981)
!1012 = !DILocation(line: 491, column: 43, scope: !796)
!1013 = !DILocation(line: 491, column: 5, scope: !796)
!1014 = !DILocation(line: 492, column: 1, scope: !796)
!1015 = distinct !DISubprogram(name: "latencyCommandReplyWithLatestEvents", scope: !3, file: !3, line: 496, type: !875, isLocal: false, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1022, !1023}
!1017 = !DILocalVariable(name: "c", arg: 1, scope: !1015, file: !3, line: 496, type: !799)
!1018 = !DILocalVariable(name: "di", scope: !1015, file: !3, line: 497, type: !235)
!1019 = !DILocalVariable(name: "de", scope: !1015, file: !3, line: 498, type: !254)
!1020 = !DILocalVariable(name: "event", scope: !1021, file: !3, line: 503, type: !15)
!1021 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 502, column: 40)
!1022 = !DILocalVariable(name: "ts", scope: !1021, file: !3, line: 504, type: !141)
!1023 = !DILocalVariable(name: "last", scope: !1021, file: !3, line: 505, type: !80)
!1024 = !DILocation(line: 496, column: 50, scope: !1015)
!1025 = !DILocation(line: 500, column: 28, scope: !1015)
!1026 = !DILocation(line: 500, column: 5, scope: !1015)
!1027 = !DILocation(line: 501, column: 33, scope: !1015)
!1028 = !DILocation(line: 501, column: 10, scope: !1015)
!1029 = !DILocation(line: 497, column: 19, scope: !1015)
!1030 = !DILocation(line: 502, column: 17, scope: !1015)
!1031 = !DILocation(line: 498, column: 16, scope: !1015)
!1032 = !DILocation(line: 502, column: 31, scope: !1015)
!1033 = !DILocation(line: 502, column: 5, scope: !1015)
!1034 = !DILocation(line: 503, column: 23, scope: !1021)
!1035 = !DILocation(line: 503, column: 15, scope: !1021)
!1036 = !DILocation(line: 504, column: 40, scope: !1021)
!1037 = !DILocation(line: 504, column: 35, scope: !1021)
!1038 = !DILocation(line: 505, column: 25, scope: !1021)
!1039 = !DILocation(line: 505, column: 46, scope: !1021)
!1040 = !DILocation(line: 505, column: 51, scope: !1021)
!1041 = !DILocation(line: 505, column: 13, scope: !1021)
!1042 = !DILocation(line: 507, column: 9, scope: !1021)
!1043 = !DILocation(line: 508, column: 9, scope: !1021)
!1044 = !DILocation(line: 509, column: 28, scope: !1021)
!1045 = !DILocation(line: 509, column: 46, scope: !1021)
!1046 = !DILocation(line: 509, column: 9, scope: !1021)
!1047 = !DILocation(line: 510, column: 46, scope: !1021)
!1048 = !DILocation(line: 510, column: 28, scope: !1021)
!1049 = !DILocation(line: 510, column: 9, scope: !1021)
!1050 = !DILocation(line: 511, column: 32, scope: !1021)
!1051 = !DILocation(line: 511, column: 28, scope: !1021)
!1052 = !DILocation(line: 511, column: 9, scope: !1021)
!1053 = distinct !{!1053, !1033, !1054}
!1054 = !DILocation(line: 512, column: 5, scope: !1015)
!1055 = !DILocation(line: 513, column: 5, scope: !1015)
!1056 = !DILocation(line: 514, column: 1, scope: !1015)
!1057 = distinct !DISubprogram(name: "latencyCommandGenSparkeline", scope: !3, file: !3, line: 517, type: !1058, isLocal: false, isDefinition: true, scopeLine: 517, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!459, !15, !141}
!1060 = !{!1061, !1062, !1063, !1064, !1079, !1080, !1081, !1082, !1086, !1087}
!1061 = !DILocalVariable(name: "event", arg: 1, scope: !1057, file: !3, line: 517, type: !15)
!1062 = !DILocalVariable(name: "ts", arg: 2, scope: !1057, file: !3, line: 517, type: !141)
!1063 = !DILocalVariable(name: "j", scope: !1057, file: !3, line: 518, type: !80)
!1064 = !DILocalVariable(name: "seq", scope: !1057, file: !3, line: 519, type: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sequence", file: !1067, line: 39, size: 256, elements: !1068)
!1067 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sparkline.h", directory: "/root/.unikraft/apps/redis/build")
!1068 = !{!1069, !1070, !1071, !1077, !1078}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1066, file: !1067, line: 40, baseType: !80, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !1066, file: !1067, line: 41, baseType: !80, size: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1066, file: !1067, line: 42, baseType: !1072, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sample", file: !1067, line: 34, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1073, file: !1067, line: 35, baseType: !13, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1073, file: !1067, line: 36, baseType: !15, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1066, file: !1067, line: 43, baseType: !13, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1066, file: !1067, line: 43, baseType: !13, size: 64, offset: 192)
!1079 = !DILocalVariable(name: "graph", scope: !1057, file: !3, line: 520, type: !459)
!1080 = !DILocalVariable(name: "min", scope: !1057, file: !3, line: 521, type: !45)
!1081 = !DILocalVariable(name: "max", scope: !1057, file: !3, line: 521, type: !45)
!1082 = !DILocalVariable(name: "i", scope: !1083, file: !3, line: 524, type: !80)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 523, column: 42)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 523, column: 5)
!1085 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 523, column: 5)
!1086 = !DILocalVariable(name: "elapsed", scope: !1083, file: !3, line: 525, type: !80)
!1087 = !DILocalVariable(name: "buf", scope: !1083, file: !3, line: 526, type: !1088)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 64)
!1091 = !DILocation(line: 517, column: 39, scope: !1057)
!1092 = !DILocation(line: 517, column: 72, scope: !1057)
!1093 = !DILocation(line: 519, column: 28, scope: !1057)
!1094 = !DILocation(line: 519, column: 22, scope: !1057)
!1095 = !DILocation(line: 520, column: 17, scope: !1057)
!1096 = !DILocation(line: 520, column: 9, scope: !1057)
!1097 = !DILocation(line: 521, column: 14, scope: !1057)
!1098 = !DILocation(line: 521, column: 23, scope: !1057)
!1099 = !DILocation(line: 518, column: 9, scope: !1057)
!1100 = !DILocation(line: 523, column: 5, scope: !1085)
!1101 = !DILocation(line: 524, column: 22, scope: !1083)
!1102 = !DILocation(line: 524, column: 26, scope: !1083)
!1103 = !DILocation(line: 524, column: 31, scope: !1083)
!1104 = !DILocation(line: 524, column: 13, scope: !1083)
!1105 = !DILocation(line: 526, column: 9, scope: !1083)
!1106 = !DILocation(line: 526, column: 14, scope: !1083)
!1107 = !DILocation(line: 528, column: 13, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 528, column: 13)
!1109 = !DILocation(line: 528, column: 28, scope: !1108)
!1110 = !DILocation(line: 528, column: 33, scope: !1108)
!1111 = !DILocation(line: 528, column: 13, scope: !1083)
!1112 = !DILocation(line: 530, column: 18, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 530, column: 13)
!1114 = !{!1115, !120, i64 0}
!1115 = !{!"sequence", !120, i64 0, !120, i64 4, !123, i64 8, !126, i64 16, !126, i64 24}
!1116 = !DILocation(line: 530, column: 25, scope: !1113)
!1117 = !DILocation(line: 0, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 533, column: 17)
!1119 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 532, column: 16)
!1120 = !DILocation(line: 530, column: 13, scope: !1083)
!1121 = !DILocation(line: 533, column: 40, scope: !1118)
!1122 = !DILocation(line: 533, column: 17, scope: !1119)
!1123 = !DILocation(line: 534, column: 40, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 534, column: 17)
!1125 = !DILocation(line: 534, column: 17, scope: !1119)
!1126 = !DILocation(line: 0, scope: !1057)
!1127 = !DILocation(line: 538, column: 19, scope: !1083)
!1128 = !DILocation(line: 538, column: 47, scope: !1083)
!1129 = !DILocation(line: 525, column: 13, scope: !1083)
!1130 = !DILocation(line: 539, column: 21, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 539, column: 13)
!1132 = !DILocation(line: 539, column: 13, scope: !1083)
!1133 = !DILocation(line: 540, column: 13, scope: !1131)
!1134 = !DILocation(line: 541, column: 26, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 541, column: 18)
!1136 = !DILocation(line: 541, column: 18, scope: !1131)
!1137 = !DILocation(line: 542, column: 13, scope: !1135)
!1138 = !DILocation(line: 543, column: 26, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 543, column: 18)
!1140 = !DILocation(line: 543, column: 18, scope: !1135)
