; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type opaque
%struct.lua_Debug = type { i32, i8*, i8*, i8*, i8*, i32, i32, i32, i32, [60 x i8], i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.luaL_Reg = type { i8*, i32 (%struct.lua_State*)* }
%struct.luaL_Buffer = type { i8*, i32, %struct.lua_State*, [1024 x i8] }
%struct.LoadF = type { i32, %struct.__sFILE*, [1024 x i8] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !11, !12, !242}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !9, line: 129, baseType: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadF", file: !1, line: 526, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoadF", file: !1, line: 522, size: 8320, elements: !15)
!15 = !{!16, !17, !238}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "extraline", scope: !14, file: !1, line: 523, baseType: !11, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !1, line: 524, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 66, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !22, line: 287, baseType: !23)
!22 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 181, size: 1408, elements: !24)
!24 = !{!25, !28, !29, !30, !32, !33, !38, !39, !40, !205, !211, !216, !220, !221, !222, !223, !225, !227, !228, !229, !231, !232, !236, !237}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !23, file: !22, line: 182, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !23, file: !22, line: 183, baseType: !11, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !23, file: !22, line: 184, baseType: !11, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !23, file: !22, line: 185, baseType: !31, size: 16, offset: 128)
!31 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !23, file: !22, line: 186, baseType: !31, size: 16, offset: 144)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !23, file: !22, line: 187, baseType: !34, size: 128, offset: 192)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 117, size: 128, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !34, file: !22, line: 118, baseType: !26, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !34, file: !22, line: 119, baseType: !11, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !23, file: !22, line: 188, baseType: !11, size: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !23, file: !22, line: 195, baseType: !4, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !23, file: !22, line: 197, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !46, !4, !90, !11}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !9, line: 145, baseType: !45)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !22, line: 569, size: 14912, elements: !48)
!48 = !{!49, !50, !52, !53, !54, !55, !59, !60, !64, !65, !69, !84, !85, !86, !88, !89, !91, !169, !190, !191, !196, !203}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !47, file: !22, line: 571, baseType: !11, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !47, file: !22, line: 576, baseType: !51, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !47, file: !22, line: 578, baseType: !11, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !47, file: !22, line: 579, baseType: !56, size: 200, offset: 288)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 200, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 25)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !47, file: !22, line: 582, baseType: !11, size: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !47, file: !22, line: 583, baseType: !61, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !63, line: 9, flags: DIFlagFwdDecl)
!63 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/xlocale.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !47, file: !22, line: 585, baseType: !11, size: 32, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !47, file: !22, line: 587, baseType: !66, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !46}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !47, file: !22, line: 590, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !22, line: 47, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !22, line: 49, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !71, file: !22, line: 50, baseType: !11, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !71, file: !22, line: 51, baseType: !79, size: 32, offset: 192)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !82)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !22, line: 25, baseType: !81)
!81 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !47, file: !22, line: 591, baseType: !11, size: 32, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !47, file: !22, line: 592, baseType: !70, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !47, file: !22, line: 593, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !47, file: !22, line: 596, baseType: !11, size: 32, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !47, file: !22, line: 597, baseType: !90, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !47, file: !22, line: 632, baseType: !92, size: 2880, offset: 1152)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !47, file: !22, line: 599, size: 2880, elements: !93)
!93 = !{!94, !160}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !92, file: !22, line: 622, baseType: !95, size: 1728)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !22, line: 601, size: 1728, elements: !96)
!96 = !{!97, !98, !99, !103, !115, !116, !118, !128, !143, !144, !145, !149, !153, !154, !155, !156, !157, !158, !159}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !95, file: !22, line: 603, baseType: !81, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !95, file: !22, line: 604, baseType: !90, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !95, file: !22, line: 605, baseType: !100, size: 208, offset: 128)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 208, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 26)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !95, file: !22, line: 606, baseType: !104, size: 288, offset: 352)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !22, line: 55, size: 288, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !104, file: !22, line: 57, baseType: !11, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !104, file: !22, line: 58, baseType: !11, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !104, file: !22, line: 59, baseType: !11, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !104, file: !22, line: 60, baseType: !11, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !104, file: !22, line: 61, baseType: !11, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !104, file: !22, line: 62, baseType: !11, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !104, file: !22, line: 63, baseType: !11, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !104, file: !22, line: 64, baseType: !11, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !104, file: !22, line: 65, baseType: !11, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !95, file: !22, line: 607, baseType: !11, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !95, file: !22, line: 608, baseType: !117, size: 64, offset: 704)
!117 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !95, file: !22, line: 609, baseType: !119, size: 112, offset: 768)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !22, line: 319, size: 112, elements: !120)
!120 = !{!121, !126, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !119, file: !22, line: 320, baseType: !122, size: 48)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !124)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !119, file: !22, line: 321, baseType: !122, size: 48, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !119, file: !22, line: 322, baseType: !123, size: 16, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !95, file: !22, line: 610, baseType: !129, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !9, line: 171, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 163, size: 64, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !130, file: !9, line: 165, baseType: !11, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !130, file: !9, line: 170, baseType: !134, size: 32, offset: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !9, line: 166, size: 32, elements: !135)
!135 = !{!136, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !134, file: !9, line: 168, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !138, line: 124, baseType: !81)
!138 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !134, file: !9, line: 169, baseType: !140, size: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 4)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !95, file: !22, line: 611, baseType: !129, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !95, file: !22, line: 612, baseType: !129, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !95, file: !22, line: 613, baseType: !146, size: 64, offset: 1088)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !95, file: !22, line: 614, baseType: !150, size: 192, offset: 1152)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 24)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !95, file: !22, line: 615, baseType: !11, size: 32, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !95, file: !22, line: 616, baseType: !129, size: 64, offset: 1376)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !95, file: !22, line: 617, baseType: !129, size: 64, offset: 1440)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !95, file: !22, line: 618, baseType: !129, size: 64, offset: 1504)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !95, file: !22, line: 619, baseType: !129, size: 64, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !95, file: !22, line: 620, baseType: !129, size: 64, offset: 1632)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !95, file: !22, line: 621, baseType: !11, size: 32, offset: 1696)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !92, file: !22, line: 631, baseType: !161, size: 2880)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !22, line: 626, size: 2880, elements: !162)
!162 = !{!163, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !161, file: !22, line: 629, baseType: !164, size: 1920)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1920, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 30)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !161, file: !22, line: 630, baseType: !168, size: 960, offset: 1920)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 960, elements: !165)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !47, file: !22, line: 636, baseType: !170, size: 64, offset: 4032)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !22, line: 93, size: 6336, elements: !172)
!172 = !{!173, !174, !175, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !171, file: !22, line: 94, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !171, file: !22, line: 95, baseType: !11, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !171, file: !22, line: 97, baseType: !176, size: 2048, offset: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 2048, elements: !180)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null}
!180 = !{!181}
!181 = !DISubrange(count: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !171, file: !22, line: 98, baseType: !183, size: 4160, offset: 2176)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !22, line: 74, size: 4160, elements: !184)
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !183, file: !22, line: 75, baseType: !186, size: 2048)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !180)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !183, file: !22, line: 76, baseType: !186, size: 2048, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !183, file: !22, line: 78, baseType: !80, size: 32, offset: 4096)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !183, file: !22, line: 81, baseType: !80, size: 32, offset: 4128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !47, file: !22, line: 637, baseType: !171, size: 6336, offset: 4096)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !47, file: !22, line: 641, baseType: !192, size: 64, offset: 10432)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !11}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !47, file: !22, line: 646, baseType: !197, size: 192, offset: 10496)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !22, line: 291, size: 192, elements: !198)
!198 = !{!199, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !197, file: !22, line: 293, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !197, file: !22, line: 294, baseType: !11, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !197, file: !22, line: 295, baseType: !51, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !47, file: !22, line: 648, baseType: !204, size: 4224, offset: 10688)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 4224, elements: !124)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !23, file: !22, line: 199, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!44, !46, !4, !209, !11}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !23, file: !22, line: 202, baseType: !212, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !46, !4, !215, !11}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !9, line: 114, baseType: !45)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !23, file: !22, line: 203, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!11, !46, !4}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !23, file: !22, line: 206, baseType: !34, size: 128, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !23, file: !22, line: 207, baseType: !26, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !23, file: !22, line: 208, baseType: !11, size: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !23, file: !22, line: 211, baseType: !224, size: 24, offset: 928)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !124)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !23, file: !22, line: 212, baseType: !226, size: 8, offset: 952)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !82)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !23, file: !22, line: 215, baseType: !34, size: 128, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !23, file: !22, line: 218, baseType: !11, size: 32, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !23, file: !22, line: 219, baseType: !230, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !9, line: 44, baseType: !45)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !23, file: !22, line: 222, baseType: !46, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !23, file: !22, line: 226, baseType: !233, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !9, line: 175, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !235, line: 12, baseType: !11)
!235 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !23, file: !22, line: 228, baseType: !129, size: 64, offset: 1312)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !23, file: !22, line: 229, baseType: !11, size: 32, offset: 1376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !14, file: !1, line: 525, baseType: !239, size: 8192, offset: 128)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1024)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoadS", file: !1, line: 596, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoadS", file: !1, line: 593, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !244, file: !1, line: 594, baseType: !209, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !244, file: !1, line: 595, baseType: !6, size: 64, offset: 64)
!248 = !{i32 2, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!252 = distinct !DISubprogram(name: "luaL_argerror", scope: !1, file: !1, line: 43, type: !253, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !259)
!253 = !DISubroutineType(types: !254)
!254 = !{!11, !255, !11, !209}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !257, line: 50, baseType: !258)
!257 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !257, line: 50, flags: DIFlagFwdDecl)
!259 = !{!260, !261, !262, !263}
!260 = !DILocalVariable(name: "L", arg: 1, scope: !252, file: !1, line: 43, type: !255)
!261 = !DILocalVariable(name: "narg", arg: 2, scope: !252, file: !1, line: 43, type: !11)
!262 = !DILocalVariable(name: "extramsg", arg: 3, scope: !252, file: !1, line: 43, type: !209)
!263 = !DILocalVariable(name: "ar", scope: !252, file: !1, line: 44, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !257, line: 326, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !257, line: 346, size: 960, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !280}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !265, file: !257, line: 347, baseType: !11, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !257, line: 348, baseType: !209, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !265, file: !257, line: 349, baseType: !209, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !265, file: !257, line: 350, baseType: !209, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !265, file: !257, line: 351, baseType: !209, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !265, file: !257, line: 352, baseType: !11, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !265, file: !257, line: 353, baseType: !11, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !265, file: !257, line: 354, baseType: !11, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !265, file: !257, line: 355, baseType: !11, size: 32, offset: 416)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !265, file: !257, line: 356, baseType: !277, size: 480, offset: 448)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 480, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 60)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !265, file: !257, line: 358, baseType: !11, size: 32, offset: 928)
!281 = !DILocation(line: 43, column: 42, scope: !252)
!282 = !DILocation(line: 43, column: 49, scope: !252)
!283 = !DILocation(line: 43, column: 67, scope: !252)
!284 = !DILocation(line: 44, column: 3, scope: !252)
!285 = !DILocation(line: 44, column: 13, scope: !252)
!286 = !DILocation(line: 45, column: 8, scope: !287)
!287 = distinct !DILexicalBlock(scope: !252, file: !1, line: 45, column: 7)
!288 = !DILocation(line: 45, column: 7, scope: !252)
!289 = !DILocation(line: 46, column: 12, scope: !287)
!290 = !DILocation(line: 46, column: 5, scope: !287)
!291 = !DILocation(line: 47, column: 3, scope: !252)
!292 = !DILocation(line: 48, column: 17, scope: !293)
!293 = distinct !DILexicalBlock(scope: !252, file: !1, line: 48, column: 7)
!294 = !{!295, !299, i64 16}
!295 = !{!"lua_Debug", !296, i64 0, !299, i64 8, !299, i64 16, !299, i64 24, !299, i64 32, !296, i64 40, !296, i64 44, !296, i64 48, !296, i64 52, !297, i64 56, !296, i64 116}
!296 = !{!"int", !297, i64 0}
!297 = !{!"omnipotent char", !298, i64 0}
!298 = !{!"Simple C/C++ TBAA"}
!299 = !{!"any pointer", !297, i64 0}
!300 = !DILocation(line: 48, column: 7, scope: !293)
!301 = !DILocation(line: 48, column: 37, scope: !293)
!302 = !DILocation(line: 48, column: 7, scope: !252)
!303 = !DILocation(line: 49, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !293, file: !1, line: 48, column: 43)
!305 = !DILocation(line: 50, column: 14, scope: !306)
!306 = distinct !DILexicalBlock(scope: !304, file: !1, line: 50, column: 9)
!307 = !DILocation(line: 50, column: 9, scope: !304)
!308 = !DILocation(line: 52, column: 31, scope: !306)
!309 = !{!295, !299, i64 8}
!310 = !DILocation(line: 51, column: 14, scope: !306)
!311 = !DILocation(line: 51, column: 7, scope: !306)
!312 = !DILocation(line: 54, column: 10, scope: !313)
!313 = distinct !DILexicalBlock(scope: !252, file: !1, line: 54, column: 7)
!314 = !DILocation(line: 54, column: 15, scope: !313)
!315 = !DILocation(line: 54, column: 7, scope: !252)
!316 = !DILocation(line: 55, column: 13, scope: !313)
!317 = !DILocation(line: 55, column: 5, scope: !313)
!318 = !DILocation(line: 57, column: 34, scope: !252)
!319 = !DILocation(line: 56, column: 10, scope: !252)
!320 = !DILocation(line: 56, column: 3, scope: !252)
!321 = !DILocation(line: 0, scope: !287)
!322 = !DILocation(line: 58, column: 1, scope: !252)
!323 = distinct !DISubprogram(name: "luaL_error", scope: !1, file: !1, line: 86, type: !324, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!11, !255, !209, null}
!326 = !{!327, !328, !329}
!327 = !DILocalVariable(name: "L", arg: 1, scope: !323, file: !1, line: 86, type: !255)
!328 = !DILocalVariable(name: "fmt", arg: 2, scope: !323, file: !1, line: 86, type: !209)
!329 = !DILocalVariable(name: "argp", scope: !323, file: !1, line: 87, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !20, line: 46, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !332, line: 51, baseType: !333)
!332 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 87, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 192, elements: !82)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 87, size: 192, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !335, file: !1, line: 87, baseType: !81, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !335, file: !1, line: 87, baseType: !81, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !335, file: !1, line: 87, baseType: !4, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !335, file: !1, line: 87, baseType: !4, size: 64, offset: 128)
!341 = !DILocation(line: 86, column: 39, scope: !323)
!342 = !DILocation(line: 86, column: 54, scope: !323)
!343 = !DILocation(line: 87, column: 3, scope: !323)
!344 = !DILocation(line: 87, column: 11, scope: !323)
!345 = !DILocation(line: 88, column: 3, scope: !323)
!346 = !DILocalVariable(name: "L", arg: 1, scope: !347, file: !1, line: 73, type: !255)
!347 = distinct !DISubprogram(name: "luaL_where", scope: !1, file: !1, line: 73, type: !348, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !255, !11}
!350 = !{!346, !351, !352}
!351 = !DILocalVariable(name: "level", arg: 2, scope: !347, file: !1, line: 73, type: !11)
!352 = !DILocalVariable(name: "ar", scope: !347, file: !1, line: 74, type: !264)
!353 = !DILocation(line: 73, column: 40, scope: !347, inlinedAt: !354)
!354 = distinct !DILocation(line: 89, column: 3, scope: !323)
!355 = !DILocation(line: 73, column: 47, scope: !347, inlinedAt: !354)
!356 = !DILocation(line: 74, column: 3, scope: !347, inlinedAt: !354)
!357 = !DILocation(line: 74, column: 13, scope: !347, inlinedAt: !354)
!358 = !DILocation(line: 75, column: 7, scope: !359, inlinedAt: !354)
!359 = distinct !DILexicalBlock(scope: !347, file: !1, line: 75, column: 7)
!360 = !DILocation(line: 75, column: 7, scope: !347, inlinedAt: !354)
!361 = !DILocation(line: 76, column: 5, scope: !362, inlinedAt: !354)
!362 = distinct !DILexicalBlock(scope: !359, file: !1, line: 75, column: 36)
!363 = !DILocation(line: 77, column: 12, scope: !364, inlinedAt: !354)
!364 = distinct !DILexicalBlock(scope: !362, file: !1, line: 77, column: 9)
!365 = !{!295, !296, i64 40}
!366 = !DILocation(line: 77, column: 24, scope: !364, inlinedAt: !354)
!367 = !DILocation(line: 77, column: 9, scope: !362, inlinedAt: !354)
!368 = !DILocation(line: 78, column: 37, scope: !369, inlinedAt: !354)
!369 = distinct !DILexicalBlock(scope: !364, file: !1, line: 77, column: 29)
!370 = !DILocation(line: 78, column: 7, scope: !369, inlinedAt: !354)
!371 = !DILocation(line: 79, column: 7, scope: !369, inlinedAt: !354)
!372 = !DILocation(line: 82, column: 3, scope: !347, inlinedAt: !354)
!373 = !DILocation(line: 83, column: 1, scope: !347, inlinedAt: !354)
!374 = !DILocation(line: 90, column: 3, scope: !323)
!375 = !DILocation(line: 91, column: 3, scope: !323)
!376 = !DILocation(line: 92, column: 3, scope: !323)
!377 = !DILocation(line: 93, column: 10, scope: !323)
!378 = !DILocation(line: 94, column: 1, scope: !323)
!379 = !DILocation(line: 93, column: 3, scope: !323)
!380 = distinct !DISubprogram(name: "luaL_typerror", scope: !1, file: !1, line: 61, type: !253, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !381)
!381 = !{!382, !383, !384, !385}
!382 = !DILocalVariable(name: "L", arg: 1, scope: !380, file: !1, line: 61, type: !255)
!383 = !DILocalVariable(name: "narg", arg: 2, scope: !380, file: !1, line: 61, type: !11)
!384 = !DILocalVariable(name: "tname", arg: 3, scope: !380, file: !1, line: 61, type: !209)
!385 = !DILocalVariable(name: "msg", scope: !380, file: !1, line: 62, type: !209)
!386 = !DILocation(line: 61, column: 42, scope: !380)
!387 = !DILocation(line: 61, column: 49, scope: !380)
!388 = !DILocation(line: 61, column: 67, scope: !380)
!389 = !DILocation(line: 63, column: 44, scope: !380)
!390 = !DILocation(line: 62, column: 21, scope: !380)
!391 = !DILocation(line: 62, column: 15, scope: !380)
!392 = !DILocation(line: 64, column: 10, scope: !380)
!393 = !DILocation(line: 64, column: 3, scope: !380)
!394 = !DILocation(line: 73, column: 40, scope: !347)
!395 = !DILocation(line: 73, column: 47, scope: !347)
!396 = !DILocation(line: 74, column: 3, scope: !347)
!397 = !DILocation(line: 74, column: 13, scope: !347)
!398 = !DILocation(line: 75, column: 7, scope: !359)
!399 = !DILocation(line: 75, column: 7, scope: !347)
!400 = !DILocation(line: 76, column: 5, scope: !362)
!401 = !DILocation(line: 77, column: 12, scope: !364)
!402 = !DILocation(line: 77, column: 24, scope: !364)
!403 = !DILocation(line: 77, column: 9, scope: !362)
!404 = !DILocation(line: 78, column: 37, scope: !369)
!405 = !DILocation(line: 78, column: 7, scope: !369)
!406 = !DILocation(line: 79, column: 7, scope: !369)
!407 = !DILocation(line: 82, column: 3, scope: !347)
!408 = !DILocation(line: 83, column: 1, scope: !347)
!409 = distinct !DISubprogram(name: "luaL_checkoption", scope: !1, file: !1, line: 99, type: !410, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !414)
!410 = !DISubroutineType(types: !411)
!411 = !{!11, !255, !11, !209, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DILocalVariable(name: "L", arg: 1, scope: !409, file: !1, line: 99, type: !255)
!416 = !DILocalVariable(name: "narg", arg: 2, scope: !409, file: !1, line: 99, type: !11)
!417 = !DILocalVariable(name: "def", arg: 3, scope: !409, file: !1, line: 99, type: !209)
!418 = !DILocalVariable(name: "lst", arg: 4, scope: !409, file: !1, line: 100, type: !412)
!419 = !DILocalVariable(name: "name", scope: !409, file: !1, line: 101, type: !209)
!420 = !DILocalVariable(name: "i", scope: !409, file: !1, line: 103, type: !11)
!421 = !DILocation(line: 99, column: 45, scope: !409)
!422 = !DILocation(line: 99, column: 52, scope: !409)
!423 = !DILocation(line: 99, column: 70, scope: !409)
!424 = !DILocation(line: 100, column: 52, scope: !409)
!425 = !DILocation(line: 101, column: 22, scope: !409)
!426 = !DILocalVariable(name: "L", arg: 1, scope: !427, file: !1, line: 165, type: !255)
!427 = distinct !DISubprogram(name: "luaL_optlstring", scope: !1, file: !1, line: 165, type: !428, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !431)
!428 = !DISubroutineType(types: !429)
!429 = !{!209, !255, !11, !209, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!431 = !{!426, !432, !433, !434}
!432 = !DILocalVariable(name: "narg", arg: 2, scope: !427, file: !1, line: 165, type: !11)
!433 = !DILocalVariable(name: "def", arg: 3, scope: !427, file: !1, line: 166, type: !209)
!434 = !DILocalVariable(name: "len", arg: 4, scope: !427, file: !1, line: 166, type: !430)
!435 = !DILocation(line: 165, column: 52, scope: !427, inlinedAt: !436)
!436 = distinct !DILocation(line: 101, column: 30, scope: !409)
!437 = !DILocation(line: 165, column: 59, scope: !427, inlinedAt: !436)
!438 = !DILocation(line: 166, column: 53, scope: !427, inlinedAt: !436)
!439 = !DILocation(line: 166, column: 66, scope: !427, inlinedAt: !436)
!440 = !DILocation(line: 167, column: 7, scope: !441, inlinedAt: !436)
!441 = distinct !DILexicalBlock(scope: !427, file: !1, line: 167, column: 7)
!442 = !DILocation(line: 167, column: 7, scope: !427, inlinedAt: !436)
!443 = !DILocation(line: 172, column: 15, scope: !441, inlinedAt: !436)
!444 = !DILocation(line: 172, column: 8, scope: !441, inlinedAt: !436)
!445 = !DILocation(line: 102, column: 30, scope: !409)
!446 = !DILocation(line: 101, column: 15, scope: !409)
!447 = !DILocation(line: 103, column: 7, scope: !409)
!448 = !DILocation(line: 104, column: 13, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !1, line: 104, column: 3)
!450 = distinct !DILexicalBlock(scope: !409, file: !1, line: 104, column: 3)
!451 = !{!299, !299, i64 0}
!452 = !DILocation(line: 104, column: 3, scope: !450)
!453 = !DILocation(line: 105, column: 9, scope: !454)
!454 = distinct !DILexicalBlock(scope: !449, file: !1, line: 105, column: 9)
!455 = !DILocation(line: 105, column: 30, scope: !454)
!456 = !DILocation(line: 105, column: 9, scope: !449)
!457 = !DILocation(line: 104, column: 22, scope: !449)
!458 = distinct !{!458, !452, !459}
!459 = !DILocation(line: 106, column: 14, scope: !450)
!460 = !DILocation(line: 108, column: 24, scope: !409)
!461 = !DILocation(line: 107, column: 10, scope: !409)
!462 = !DILocation(line: 107, column: 3, scope: !409)
!463 = !DILocation(line: 109, column: 1, scope: !409)
!464 = !DILocation(line: 0, scope: !409)
!465 = !DILocation(line: 165, column: 52, scope: !427)
!466 = !DILocation(line: 165, column: 59, scope: !427)
!467 = !DILocation(line: 166, column: 53, scope: !427)
!468 = !DILocation(line: 166, column: 66, scope: !427)
!469 = !DILocation(line: 167, column: 7, scope: !441)
!470 = !DILocation(line: 167, column: 7, scope: !427)
!471 = !DILocation(line: 168, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 168, column: 9)
!473 = distinct !DILexicalBlock(scope: !441, file: !1, line: 167, column: 33)
!474 = !DILocation(line: 168, column: 9, scope: !473)
!475 = !DILocation(line: 169, column: 15, scope: !472)
!476 = !DILocation(line: 169, column: 21, scope: !472)
!477 = !DILocation(line: 169, column: 12, scope: !472)
!478 = !{!479, !479, i64 0}
!479 = !{!"long", !297, i64 0}
!480 = !DILocation(line: 169, column: 7, scope: !472)
!481 = !DILocation(line: 172, column: 15, scope: !441)
!482 = !DILocation(line: 172, column: 8, scope: !441)
!483 = !DILocation(line: 0, scope: !441)
!484 = !DILocation(line: 173, column: 1, scope: !427)
!485 = distinct !DISubprogram(name: "luaL_checklstring", scope: !1, file: !1, line: 158, type: !486, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!209, !255, !11, !430}
!488 = !{!489, !490, !491, !492}
!489 = !DILocalVariable(name: "L", arg: 1, scope: !485, file: !1, line: 158, type: !255)
!490 = !DILocalVariable(name: "narg", arg: 2, scope: !485, file: !1, line: 158, type: !11)
!491 = !DILocalVariable(name: "len", arg: 3, scope: !485, file: !1, line: 158, type: !430)
!492 = !DILocalVariable(name: "s", scope: !485, file: !1, line: 159, type: !209)
!493 = !DILocation(line: 158, column: 54, scope: !485)
!494 = !DILocation(line: 158, column: 61, scope: !485)
!495 = !DILocation(line: 158, column: 75, scope: !485)
!496 = !DILocation(line: 159, column: 19, scope: !485)
!497 = !DILocation(line: 159, column: 15, scope: !485)
!498 = !DILocation(line: 160, column: 8, scope: !499)
!499 = distinct !DILexicalBlock(scope: !485, file: !1, line: 160, column: 7)
!500 = !DILocation(line: 160, column: 7, scope: !485)
!501 = !DILocalVariable(name: "L", arg: 1, scope: !502, file: !1, line: 68, type: !255)
!502 = distinct !DISubprogram(name: "tag_error", scope: !1, file: !1, line: 68, type: !503, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !255, !11, !11}
!505 = !{!501, !506, !507}
!506 = !DILocalVariable(name: "narg", arg: 2, scope: !502, file: !1, line: 68, type: !11)
!507 = !DILocalVariable(name: "tag", arg: 3, scope: !502, file: !1, line: 68, type: !11)
!508 = !DILocation(line: 68, column: 35, scope: !502, inlinedAt: !509)
!509 = distinct !DILocation(line: 160, column: 11, scope: !499)
!510 = !DILocation(line: 68, column: 42, scope: !502, inlinedAt: !509)
!511 = !DILocation(line: 68, column: 52, scope: !502, inlinedAt: !509)
!512 = !DILocation(line: 69, column: 26, scope: !502, inlinedAt: !509)
!513 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !514)
!514 = distinct !DILocation(line: 69, column: 3, scope: !502, inlinedAt: !509)
!515 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !514)
!516 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !514)
!517 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !514)
!518 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !514)
!519 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !514)
!520 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !514)
!521 = !DILocation(line: 160, column: 11, scope: !499)
!522 = !DILocation(line: 161, column: 3, scope: !485)
!523 = distinct !DISubprogram(name: "luaL_newmetatable", scope: !1, file: !1, line: 112, type: !524, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!11, !255, !209}
!526 = !{!527, !528}
!527 = !DILocalVariable(name: "L", arg: 1, scope: !523, file: !1, line: 112, type: !255)
!528 = !DILocalVariable(name: "tname", arg: 2, scope: !523, file: !1, line: 112, type: !209)
!529 = !DILocation(line: 112, column: 46, scope: !523)
!530 = !DILocation(line: 112, column: 61, scope: !523)
!531 = !DILocation(line: 113, column: 3, scope: !523)
!532 = !DILocation(line: 114, column: 8, scope: !533)
!533 = distinct !DILexicalBlock(scope: !523, file: !1, line: 114, column: 7)
!534 = !DILocation(line: 114, column: 7, scope: !523)
!535 = !DILocation(line: 116, column: 3, scope: !523)
!536 = !DILocation(line: 117, column: 3, scope: !523)
!537 = !DILocation(line: 118, column: 3, scope: !523)
!538 = !DILocation(line: 119, column: 3, scope: !523)
!539 = !DILocation(line: 120, column: 3, scope: !523)
!540 = !DILocation(line: 0, scope: !533)
!541 = !DILocation(line: 121, column: 1, scope: !523)
!542 = distinct !DISubprogram(name: "luaL_checkudata", scope: !1, file: !1, line: 124, type: !543, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{!4, !255, !11, !209}
!545 = !{!546, !547, !548, !549}
!546 = !DILocalVariable(name: "L", arg: 1, scope: !542, file: !1, line: 124, type: !255)
!547 = !DILocalVariable(name: "ud", arg: 2, scope: !542, file: !1, line: 124, type: !11)
!548 = !DILocalVariable(name: "tname", arg: 3, scope: !542, file: !1, line: 124, type: !209)
!549 = !DILocalVariable(name: "p", scope: !542, file: !1, line: 125, type: !4)
!550 = !DILocation(line: 124, column: 46, scope: !542)
!551 = !DILocation(line: 124, column: 53, scope: !542)
!552 = !DILocation(line: 124, column: 69, scope: !542)
!553 = !DILocation(line: 125, column: 13, scope: !542)
!554 = !DILocation(line: 125, column: 9, scope: !542)
!555 = !DILocation(line: 126, column: 9, scope: !556)
!556 = distinct !DILexicalBlock(scope: !542, file: !1, line: 126, column: 7)
!557 = !DILocation(line: 126, column: 7, scope: !542)
!558 = !DILocation(line: 127, column: 9, scope: !559)
!559 = distinct !DILexicalBlock(scope: !560, file: !1, line: 127, column: 9)
!560 = distinct !DILexicalBlock(scope: !556, file: !1, line: 126, column: 18)
!561 = !DILocation(line: 127, column: 9, scope: !560)
!562 = !DILocation(line: 128, column: 7, scope: !563)
!563 = distinct !DILexicalBlock(scope: !559, file: !1, line: 127, column: 34)
!564 = !DILocation(line: 129, column: 11, scope: !565)
!565 = distinct !DILexicalBlock(scope: !563, file: !1, line: 129, column: 11)
!566 = !DILocation(line: 129, column: 11, scope: !563)
!567 = !DILocation(line: 130, column: 9, scope: !568)
!568 = distinct !DILexicalBlock(scope: !565, file: !1, line: 129, column: 36)
!569 = !DILocation(line: 131, column: 9, scope: !568)
!570 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !571)
!571 = distinct !DILocation(line: 135, column: 3, scope: !542)
!572 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !571)
!573 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !571)
!574 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !571)
!575 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !571)
!576 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !571)
!577 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !571)
!578 = !DILocation(line: 136, column: 3, scope: !542)
!579 = !DILocation(line: 0, scope: !542)
!580 = !DILocation(line: 137, column: 1, scope: !542)
!581 = distinct !DISubprogram(name: "luaL_checkstack", scope: !1, file: !1, line: 140, type: !582, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !255, !11, !209}
!584 = !{!585, !586, !587}
!585 = !DILocalVariable(name: "L", arg: 1, scope: !581, file: !1, line: 140, type: !255)
!586 = !DILocalVariable(name: "space", arg: 2, scope: !581, file: !1, line: 140, type: !11)
!587 = !DILocalVariable(name: "mes", arg: 3, scope: !581, file: !1, line: 140, type: !209)
!588 = !DILocation(line: 140, column: 45, scope: !581)
!589 = !DILocation(line: 140, column: 52, scope: !581)
!590 = !DILocation(line: 140, column: 71, scope: !581)
!591 = !DILocation(line: 141, column: 8, scope: !592)
!592 = distinct !DILexicalBlock(scope: !581, file: !1, line: 141, column: 7)
!593 = !DILocation(line: 141, column: 7, scope: !581)
!594 = !DILocation(line: 142, column: 5, scope: !592)
!595 = !DILocation(line: 143, column: 1, scope: !581)
!596 = distinct !DISubprogram(name: "luaL_checktype", scope: !1, file: !1, line: 146, type: !503, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !597)
!597 = !{!598, !599, !600}
!598 = !DILocalVariable(name: "L", arg: 1, scope: !596, file: !1, line: 146, type: !255)
!599 = !DILocalVariable(name: "narg", arg: 2, scope: !596, file: !1, line: 146, type: !11)
!600 = !DILocalVariable(name: "t", arg: 3, scope: !596, file: !1, line: 146, type: !11)
!601 = !DILocation(line: 146, column: 44, scope: !596)
!602 = !DILocation(line: 146, column: 51, scope: !596)
!603 = !DILocation(line: 146, column: 61, scope: !596)
!604 = !DILocation(line: 147, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !596, file: !1, line: 147, column: 7)
!606 = !DILocation(line: 147, column: 25, scope: !605)
!607 = !DILocation(line: 147, column: 7, scope: !596)
!608 = !DILocation(line: 68, column: 35, scope: !502, inlinedAt: !609)
!609 = distinct !DILocation(line: 148, column: 5, scope: !605)
!610 = !DILocation(line: 68, column: 42, scope: !502, inlinedAt: !609)
!611 = !DILocation(line: 68, column: 52, scope: !502, inlinedAt: !609)
!612 = !DILocation(line: 69, column: 26, scope: !502, inlinedAt: !609)
!613 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !614)
!614 = distinct !DILocation(line: 69, column: 3, scope: !502, inlinedAt: !609)
!615 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !614)
!616 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !614)
!617 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !614)
!618 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !614)
!619 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !614)
!620 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !614)
!621 = !DILocation(line: 148, column: 5, scope: !605)
!622 = !DILocation(line: 149, column: 1, scope: !596)
!623 = distinct !DISubprogram(name: "luaL_checkany", scope: !1, file: !1, line: 152, type: !348, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !624)
!624 = !{!625, !626}
!625 = !DILocalVariable(name: "L", arg: 1, scope: !623, file: !1, line: 152, type: !255)
!626 = !DILocalVariable(name: "narg", arg: 2, scope: !623, file: !1, line: 152, type: !11)
!627 = !DILocation(line: 152, column: 43, scope: !623)
!628 = !DILocation(line: 152, column: 50, scope: !623)
!629 = !DILocation(line: 153, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !623, file: !1, line: 153, column: 7)
!631 = !DILocation(line: 153, column: 25, scope: !630)
!632 = !DILocation(line: 153, column: 7, scope: !623)
!633 = !DILocation(line: 154, column: 5, scope: !630)
!634 = !DILocation(line: 155, column: 1, scope: !623)
!635 = distinct !DISubprogram(name: "luaL_checknumber", scope: !1, file: !1, line: 176, type: !636, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !640)
!636 = !DISubroutineType(types: !637)
!637 = !{!638, !255, !11}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !257, line: 99, baseType: !639)
!639 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!640 = !{!641, !642, !643}
!641 = !DILocalVariable(name: "L", arg: 1, scope: !635, file: !1, line: 176, type: !255)
!642 = !DILocalVariable(name: "narg", arg: 2, scope: !635, file: !1, line: 176, type: !11)
!643 = !DILocalVariable(name: "d", scope: !635, file: !1, line: 177, type: !638)
!644 = !DILocation(line: 176, column: 52, scope: !635)
!645 = !DILocation(line: 176, column: 59, scope: !635)
!646 = !DILocation(line: 177, column: 18, scope: !635)
!647 = !DILocation(line: 177, column: 14, scope: !635)
!648 = !DILocation(line: 178, column: 9, scope: !649)
!649 = distinct !DILexicalBlock(scope: !635, file: !1, line: 178, column: 7)
!650 = !DILocation(line: 178, column: 14, scope: !649)
!651 = !DILocation(line: 178, column: 18, scope: !649)
!652 = !DILocation(line: 178, column: 7, scope: !635)
!653 = !DILocation(line: 68, column: 35, scope: !502, inlinedAt: !654)
!654 = distinct !DILocation(line: 179, column: 5, scope: !649)
!655 = !DILocation(line: 68, column: 42, scope: !502, inlinedAt: !654)
!656 = !DILocation(line: 68, column: 52, scope: !502, inlinedAt: !654)
!657 = !DILocation(line: 69, column: 26, scope: !502, inlinedAt: !654)
!658 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !659)
!659 = distinct !DILocation(line: 69, column: 3, scope: !502, inlinedAt: !654)
!660 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !659)
!661 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !659)
!662 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !659)
!663 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !659)
!664 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !659)
!665 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !659)
!666 = !DILocation(line: 179, column: 5, scope: !649)
!667 = !DILocation(line: 180, column: 3, scope: !635)
!668 = distinct !DISubprogram(name: "luaL_optnumber", scope: !1, file: !1, line: 184, type: !669, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!638, !255, !11, !638}
!671 = !{!672, !673, !674}
!672 = !DILocalVariable(name: "L", arg: 1, scope: !668, file: !1, line: 184, type: !255)
!673 = !DILocalVariable(name: "narg", arg: 2, scope: !668, file: !1, line: 184, type: !11)
!674 = !DILocalVariable(name: "def", arg: 3, scope: !668, file: !1, line: 184, type: !638)
!675 = !DILocation(line: 184, column: 50, scope: !668)
!676 = !DILocation(line: 184, column: 57, scope: !668)
!677 = !DILocation(line: 184, column: 74, scope: !668)
!678 = !DILocation(line: 185, column: 10, scope: !668)
!679 = !DILocation(line: 185, column: 3, scope: !668)
!680 = distinct !DISubprogram(name: "luaL_checkinteger", scope: !1, file: !1, line: 189, type: !681, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !685)
!681 = !DISubroutineType(types: !682)
!682 = !{!683, !255, !11}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Integer", file: !257, line: 103, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !138, line: 49, baseType: !45)
!685 = !{!686, !687, !688}
!686 = !DILocalVariable(name: "L", arg: 1, scope: !680, file: !1, line: 189, type: !255)
!687 = !DILocalVariable(name: "narg", arg: 2, scope: !680, file: !1, line: 189, type: !11)
!688 = !DILocalVariable(name: "d", scope: !680, file: !1, line: 190, type: !683)
!689 = !DILocation(line: 189, column: 54, scope: !680)
!690 = !DILocation(line: 189, column: 61, scope: !680)
!691 = !DILocation(line: 190, column: 19, scope: !680)
!692 = !DILocation(line: 190, column: 15, scope: !680)
!693 = !DILocation(line: 191, column: 9, scope: !694)
!694 = distinct !DILexicalBlock(scope: !680, file: !1, line: 191, column: 7)
!695 = !DILocation(line: 191, column: 14, scope: !694)
!696 = !DILocation(line: 191, column: 18, scope: !694)
!697 = !DILocation(line: 191, column: 7, scope: !680)
!698 = !DILocation(line: 68, column: 35, scope: !502, inlinedAt: !699)
!699 = distinct !DILocation(line: 192, column: 5, scope: !694)
!700 = !DILocation(line: 68, column: 42, scope: !502, inlinedAt: !699)
!701 = !DILocation(line: 68, column: 52, scope: !502, inlinedAt: !699)
!702 = !DILocation(line: 69, column: 26, scope: !502, inlinedAt: !699)
!703 = !DILocation(line: 61, column: 42, scope: !380, inlinedAt: !704)
!704 = distinct !DILocation(line: 69, column: 3, scope: !502, inlinedAt: !699)
!705 = !DILocation(line: 61, column: 49, scope: !380, inlinedAt: !704)
!706 = !DILocation(line: 61, column: 67, scope: !380, inlinedAt: !704)
!707 = !DILocation(line: 63, column: 44, scope: !380, inlinedAt: !704)
!708 = !DILocation(line: 62, column: 21, scope: !380, inlinedAt: !704)
!709 = !DILocation(line: 62, column: 15, scope: !380, inlinedAt: !704)
!710 = !DILocation(line: 64, column: 10, scope: !380, inlinedAt: !704)
!711 = !DILocation(line: 192, column: 5, scope: !694)
!712 = !DILocation(line: 193, column: 3, scope: !680)
!713 = distinct !DISubprogram(name: "luaL_optinteger", scope: !1, file: !1, line: 197, type: !714, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !716)
!714 = !DISubroutineType(types: !715)
!715 = !{!683, !255, !11, !683}
!716 = !{!717, !718, !719}
!717 = !DILocalVariable(name: "L", arg: 1, scope: !713, file: !1, line: 197, type: !255)
!718 = !DILocalVariable(name: "narg", arg: 2, scope: !713, file: !1, line: 197, type: !11)
!719 = !DILocalVariable(name: "def", arg: 3, scope: !713, file: !1, line: 198, type: !683)
!720 = !DILocation(line: 197, column: 52, scope: !713)
!721 = !DILocation(line: 197, column: 59, scope: !713)
!722 = !DILocation(line: 198, column: 67, scope: !713)
!723 = !DILocation(line: 199, column: 10, scope: !713)
!724 = !DILocation(line: 199, column: 3, scope: !713)
!725 = distinct !DISubprogram(name: "luaL_getmetafield", scope: !1, file: !1, line: 203, type: !253, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !726)
!726 = !{!727, !728, !729}
!727 = !DILocalVariable(name: "L", arg: 1, scope: !725, file: !1, line: 203, type: !255)
!728 = !DILocalVariable(name: "obj", arg: 2, scope: !725, file: !1, line: 203, type: !11)
!729 = !DILocalVariable(name: "event", arg: 3, scope: !725, file: !1, line: 203, type: !209)
!730 = !DILocation(line: 203, column: 46, scope: !725)
!731 = !DILocation(line: 203, column: 53, scope: !725)
!732 = !DILocation(line: 203, column: 70, scope: !725)
!733 = !DILocation(line: 204, column: 8, scope: !734)
!734 = distinct !DILexicalBlock(scope: !725, file: !1, line: 204, column: 7)
!735 = !DILocation(line: 204, column: 7, scope: !725)
!736 = !DILocation(line: 206, column: 3, scope: !725)
!737 = !DILocation(line: 207, column: 3, scope: !725)
!738 = !DILocation(line: 208, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !725, file: !1, line: 208, column: 7)
!740 = !DILocation(line: 208, column: 7, scope: !725)
!741 = !DILocation(line: 209, column: 5, scope: !742)
!742 = distinct !DILexicalBlock(scope: !739, file: !1, line: 208, column: 25)
!743 = !DILocation(line: 210, column: 5, scope: !742)
!744 = !DILocation(line: 213, column: 5, scope: !745)
!745 = distinct !DILexicalBlock(scope: !739, file: !1, line: 212, column: 8)
!746 = !DILocation(line: 214, column: 5, scope: !745)
!747 = !DILocation(line: 0, scope: !734)
!748 = !DILocation(line: 216, column: 1, scope: !725)
!749 = distinct !DISubprogram(name: "luaL_callmeta", scope: !1, file: !1, line: 219, type: !253, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !750)
!750 = !{!751, !752, !753}
!751 = !DILocalVariable(name: "L", arg: 1, scope: !749, file: !1, line: 219, type: !255)
!752 = !DILocalVariable(name: "obj", arg: 2, scope: !749, file: !1, line: 219, type: !11)
!753 = !DILocalVariable(name: "event", arg: 3, scope: !749, file: !1, line: 219, type: !209)
!754 = !DILocation(line: 219, column: 42, scope: !749)
!755 = !DILocation(line: 219, column: 49, scope: !749)
!756 = !DILocation(line: 219, column: 66, scope: !749)
!757 = !DILocation(line: 220, column: 9, scope: !749)
!758 = !DILocation(line: 203, column: 46, scope: !725, inlinedAt: !759)
!759 = distinct !DILocation(line: 221, column: 8, scope: !760)
!760 = distinct !DILexicalBlock(scope: !749, file: !1, line: 221, column: 7)
!761 = !DILocation(line: 203, column: 53, scope: !725, inlinedAt: !759)
!762 = !DILocation(line: 203, column: 70, scope: !725, inlinedAt: !759)
!763 = !DILocation(line: 204, column: 8, scope: !734, inlinedAt: !759)
!764 = !DILocation(line: 204, column: 7, scope: !725, inlinedAt: !759)
!765 = !DILocation(line: 206, column: 3, scope: !725, inlinedAt: !759)
!766 = !DILocation(line: 207, column: 3, scope: !725, inlinedAt: !759)
!767 = !DILocation(line: 208, column: 7, scope: !739, inlinedAt: !759)
!768 = !DILocation(line: 208, column: 7, scope: !725, inlinedAt: !759)
!769 = !DILocation(line: 209, column: 5, scope: !742, inlinedAt: !759)
!770 = !DILocation(line: 210, column: 5, scope: !742, inlinedAt: !759)
!771 = !DILocation(line: 213, column: 5, scope: !745, inlinedAt: !759)
!772 = !DILocation(line: 223, column: 3, scope: !749)
!773 = !DILocation(line: 224, column: 3, scope: !749)
!774 = !DILocation(line: 225, column: 3, scope: !749)
!775 = !DILocation(line: 0, scope: !760)
!776 = !DILocation(line: 226, column: 1, scope: !749)
!777 = distinct !DISubprogram(name: "luaL_register", scope: !1, file: !1, line: 229, type: !778, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !792)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !255, !209, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Reg", file: !783, line: 38, baseType: !784)
!783 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lauxlib.h", directory: "/root/.unikraft/apps/redis/build")
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Reg", file: !783, line: 35, size: 128, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !784, file: !783, line: 36, baseType: !209, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !784, file: !783, line: 37, baseType: !788, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !257, line: 52, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!11, !255}
!792 = !{!793, !794, !795}
!793 = !DILocalVariable(name: "L", arg: 1, scope: !777, file: !1, line: 229, type: !255)
!794 = !DILocalVariable(name: "libname", arg: 2, scope: !777, file: !1, line: 229, type: !209)
!795 = !DILocalVariable(name: "l", arg: 3, scope: !777, file: !1, line: 230, type: !780)
!796 = !DILocation(line: 229, column: 45, scope: !777)
!797 = !DILocation(line: 229, column: 60, scope: !777)
!798 = !DILocation(line: 230, column: 49, scope: !777)
!799 = !DILocation(line: 231, column: 3, scope: !777)
!800 = !DILocation(line: 232, column: 1, scope: !777)
!801 = distinct !DISubprogram(name: "luaL_openlib", scope: !1, file: !1, line: 242, type: !802, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !804)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !255, !209, !780, !11}
!804 = !{!805, !806, !807, !808, !809, !812}
!805 = !DILocalVariable(name: "L", arg: 1, scope: !801, file: !1, line: 242, type: !255)
!806 = !DILocalVariable(name: "libname", arg: 2, scope: !801, file: !1, line: 242, type: !209)
!807 = !DILocalVariable(name: "l", arg: 3, scope: !801, file: !1, line: 243, type: !780)
!808 = !DILocalVariable(name: "nup", arg: 4, scope: !801, file: !1, line: 243, type: !11)
!809 = !DILocalVariable(name: "size", scope: !810, file: !1, line: 245, type: !11)
!810 = distinct !DILexicalBlock(scope: !811, file: !1, line: 244, column: 16)
!811 = distinct !DILexicalBlock(scope: !801, file: !1, line: 244, column: 7)
!812 = !DILocalVariable(name: "i", scope: !813, file: !1, line: 261, type: !11)
!813 = distinct !DILexicalBlock(scope: !814, file: !1, line: 260, column: 24)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 260, column: 3)
!815 = distinct !DILexicalBlock(scope: !801, file: !1, line: 260, column: 3)
!816 = !DILocation(line: 242, column: 42, scope: !801)
!817 = !DILocation(line: 242, column: 57, scope: !801)
!818 = !DILocation(line: 243, column: 47, scope: !801)
!819 = !DILocation(line: 243, column: 54, scope: !801)
!820 = !DILocation(line: 244, column: 7, scope: !811)
!821 = !DILocation(line: 0, scope: !810)
!822 = !DILocation(line: 244, column: 7, scope: !801)
!823 = !DILocalVariable(name: "l", arg: 1, scope: !824, file: !1, line: 235, type: !780)
!824 = distinct !DISubprogram(name: "libsize", scope: !1, file: !1, line: 235, type: !825, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{!11, !780}
!827 = !{!823, !828}
!828 = !DILocalVariable(name: "size", scope: !824, file: !1, line: 236, type: !11)
!829 = !DILocation(line: 235, column: 37, scope: !824, inlinedAt: !830)
!830 = distinct !DILocation(line: 245, column: 16, scope: !810)
!831 = !DILocation(line: 236, column: 7, scope: !824, inlinedAt: !830)
!832 = !DILocation(line: 237, column: 13, scope: !833, inlinedAt: !830)
!833 = distinct !DILexicalBlock(scope: !834, file: !1, line: 237, column: 3)
!834 = distinct !DILexicalBlock(scope: !824, file: !1, line: 237, column: 3)
!835 = !{!836, !299, i64 0}
!836 = !{!"luaL_Reg", !299, i64 0, !299, i64 8}
!837 = !DILocation(line: 237, column: 3, scope: !834, inlinedAt: !830)
!838 = !DILocation(line: 237, column: 28, scope: !833, inlinedAt: !830)
!839 = !DILocation(line: 237, column: 20, scope: !833, inlinedAt: !830)
!840 = distinct !{!840, !841, !842}
!841 = !DILocation(line: 237, column: 3, scope: !834)
!842 = !DILocation(line: 237, column: 28, scope: !834)
!843 = !DILocation(line: 0, scope: !833, inlinedAt: !830)
!844 = !DILocation(line: 245, column: 9, scope: !810)
!845 = !DILocation(line: 247, column: 5, scope: !810)
!846 = !DILocation(line: 248, column: 5, scope: !810)
!847 = !DILocation(line: 249, column: 10, scope: !848)
!848 = distinct !DILexicalBlock(scope: !810, file: !1, line: 249, column: 9)
!849 = !DILocation(line: 249, column: 9, scope: !810)
!850 = !DILocation(line: 250, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !848, file: !1, line: 249, column: 30)
!852 = !DILocation(line: 252, column: 11, scope: !853)
!853 = distinct !DILexicalBlock(scope: !851, file: !1, line: 252, column: 11)
!854 = !DILocation(line: 252, column: 62, scope: !853)
!855 = !DILocation(line: 252, column: 11, scope: !851)
!856 = !DILocation(line: 253, column: 9, scope: !853)
!857 = !DILocation(line: 254, column: 7, scope: !851)
!858 = !DILocation(line: 255, column: 7, scope: !851)
!859 = !DILocation(line: 256, column: 5, scope: !851)
!860 = !DILocation(line: 257, column: 5, scope: !810)
!861 = !DILocation(line: 258, column: 19, scope: !810)
!862 = !DILocation(line: 258, column: 5, scope: !810)
!863 = !DILocation(line: 259, column: 3, scope: !810)
!864 = !DILocation(line: 260, column: 13, scope: !814)
!865 = !DILocation(line: 260, column: 3, scope: !815)
!866 = !DILocation(line: 261, column: 9, scope: !813)
!867 = !DILocation(line: 262, column: 5, scope: !868)
!868 = distinct !DILexicalBlock(scope: !813, file: !1, line: 262, column: 5)
!869 = !DILocation(line: 263, column: 7, scope: !870)
!870 = distinct !DILexicalBlock(scope: !868, file: !1, line: 262, column: 5)
!871 = !DILocation(line: 262, column: 23, scope: !870)
!872 = !DILocation(line: 262, column: 16, scope: !870)
!873 = distinct !{!873, !867, !874}
!874 = !DILocation(line: 263, column: 28, scope: !868)
!875 = !DILocation(line: 264, column: 28, scope: !813)
!876 = !{!836, !299, i64 8}
!877 = !DILocation(line: 264, column: 5, scope: !813)
!878 = !DILocation(line: 265, column: 34, scope: !813)
!879 = !DILocation(line: 265, column: 5, scope: !813)
!880 = !DILocation(line: 260, column: 20, scope: !814)
!881 = distinct !{!881, !865, !882}
!882 = !DILocation(line: 266, column: 3, scope: !815)
!883 = !DILocation(line: 267, column: 3, scope: !801)
!884 = !DILocation(line: 268, column: 1, scope: !801)
!885 = distinct !DISubprogram(name: "luaL_findtable", scope: !1, file: !1, line: 357, type: !886, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !888)
!886 = !DISubroutineType(types: !887)
!887 = !{!209, !255, !11, !209, !11}
!888 = !{!889, !890, !891, !892, !893}
!889 = !DILocalVariable(name: "L", arg: 1, scope: !885, file: !1, line: 357, type: !255)
!890 = !DILocalVariable(name: "idx", arg: 2, scope: !885, file: !1, line: 357, type: !11)
!891 = !DILocalVariable(name: "fname", arg: 3, scope: !885, file: !1, line: 358, type: !209)
!892 = !DILocalVariable(name: "szhint", arg: 4, scope: !885, file: !1, line: 358, type: !11)
!893 = !DILocalVariable(name: "e", scope: !885, file: !1, line: 359, type: !209)
!894 = !DILocation(line: 357, column: 51, scope: !885)
!895 = !DILocation(line: 357, column: 58, scope: !885)
!896 = !DILocation(line: 358, column: 52, scope: !885)
!897 = !DILocation(line: 358, column: 63, scope: !885)
!898 = !DILocation(line: 360, column: 3, scope: !885)
!899 = !DILocation(line: 361, column: 3, scope: !885)
!900 = !DILocation(line: 362, column: 9, scope: !901)
!901 = distinct !DILexicalBlock(scope: !885, file: !1, line: 361, column: 6)
!902 = !DILocation(line: 359, column: 15, scope: !885)
!903 = !DILocation(line: 363, column: 11, scope: !904)
!904 = distinct !DILexicalBlock(scope: !901, file: !1, line: 363, column: 9)
!905 = !DILocation(line: 363, column: 9, scope: !901)
!906 = !DILocation(line: 363, column: 32, scope: !904)
!907 = !DILocation(line: 363, column: 30, scope: !904)
!908 = !DILocation(line: 363, column: 20, scope: !904)
!909 = !DILocation(line: 0, scope: !901)
!910 = !DILocation(line: 364, column: 33, scope: !901)
!911 = !DILocation(line: 364, column: 5, scope: !901)
!912 = !DILocation(line: 365, column: 5, scope: !901)
!913 = !DILocation(line: 366, column: 9, scope: !914)
!914 = distinct !DILexicalBlock(scope: !901, file: !1, line: 366, column: 9)
!915 = !DILocation(line: 366, column: 9, scope: !901)
!916 = !DILocation(line: 367, column: 7, scope: !917)
!917 = distinct !DILexicalBlock(scope: !914, file: !1, line: 366, column: 27)
!918 = !DILocation(line: 368, column: 30, scope: !917)
!919 = !{!297, !297, i64 0}
!920 = !DILocation(line: 368, column: 33, scope: !917)
!921 = !DILocation(line: 368, column: 7, scope: !917)
!922 = !DILocation(line: 369, column: 7, scope: !917)
!923 = !DILocation(line: 370, column: 7, scope: !917)
!924 = !DILocation(line: 371, column: 7, scope: !917)
!925 = !DILocation(line: 372, column: 5, scope: !917)
!926 = !DILocation(line: 373, column: 15, scope: !927)
!927 = distinct !DILexicalBlock(scope: !914, file: !1, line: 373, column: 14)
!928 = !DILocation(line: 373, column: 14, scope: !914)
!929 = !DILocation(line: 374, column: 7, scope: !930)
!930 = distinct !DILexicalBlock(scope: !927, file: !1, line: 373, column: 35)
!931 = !DILocation(line: 375, column: 7, scope: !930)
!932 = !DILocation(line: 377, column: 5, scope: !901)
!933 = !DILocation(line: 378, column: 15, scope: !901)
!934 = !DILocation(line: 379, column: 12, scope: !885)
!935 = !DILocation(line: 379, column: 15, scope: !885)
!936 = !DILocation(line: 379, column: 3, scope: !901)
!937 = distinct !{!937, !899, !938}
!938 = !DILocation(line: 379, column: 21, scope: !885)
!939 = !DILocation(line: 0, scope: !930)
!940 = !DILocation(line: 381, column: 1, scope: !885)
!941 = distinct !DISubprogram(name: "luaL_gsub", scope: !1, file: !1, line: 340, type: !942, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{!209, !255, !209, !209, !209}
!944 = !{!945, !946, !947, !948, !949, !950, !951}
!945 = !DILocalVariable(name: "L", arg: 1, scope: !941, file: !1, line: 340, type: !255)
!946 = !DILocalVariable(name: "s", arg: 2, scope: !941, file: !1, line: 340, type: !209)
!947 = !DILocalVariable(name: "p", arg: 3, scope: !941, file: !1, line: 340, type: !209)
!948 = !DILocalVariable(name: "r", arg: 4, scope: !941, file: !1, line: 341, type: !209)
!949 = !DILocalVariable(name: "wild", scope: !941, file: !1, line: 342, type: !209)
!950 = !DILocalVariable(name: "l", scope: !941, file: !1, line: 343, type: !6)
!951 = !DILocalVariable(name: "b", scope: !941, file: !1, line: 344, type: !952)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "luaL_Buffer", file: !783, line: 134, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "luaL_Buffer", file: !783, line: 129, size: 8384, elements: !954)
!954 = !{!955, !956, !957, !958}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !953, file: !783, line: 130, baseType: !90, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !953, file: !783, line: 131, baseType: !11, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !953, file: !783, line: 132, baseType: !255, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !953, file: !783, line: 133, baseType: !239, size: 8192, offset: 192)
!959 = !DILocation(line: 340, column: 46, scope: !941)
!960 = !DILocation(line: 340, column: 61, scope: !941)
!961 = !DILocation(line: 340, column: 76, scope: !941)
!962 = !DILocation(line: 341, column: 76, scope: !941)
!963 = !DILocation(line: 343, column: 14, scope: !941)
!964 = !DILocation(line: 343, column: 10, scope: !941)
!965 = !DILocation(line: 344, column: 3, scope: !941)
!966 = !DILocation(line: 344, column: 15, scope: !941)
!967 = !DILocalVariable(name: "L", arg: 1, scope: !968, file: !1, line: 472, type: !255)
!968 = distinct !DISubprogram(name: "luaL_buffinit", scope: !1, file: !1, line: 472, type: !969, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !972)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !255, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!972 = !{!967, !973}
!973 = !DILocalVariable(name: "B", arg: 2, scope: !968, file: !1, line: 472, type: !971)
!974 = !DILocation(line: 472, column: 43, scope: !968, inlinedAt: !975)
!975 = distinct !DILocation(line: 345, column: 3, scope: !941)
!976 = !DILocation(line: 472, column: 59, scope: !968, inlinedAt: !975)
!977 = !DILocation(line: 473, column: 6, scope: !968, inlinedAt: !975)
!978 = !DILocation(line: 473, column: 8, scope: !968, inlinedAt: !975)
!979 = !{!980, !299, i64 16}
!980 = !{!"luaL_Buffer", !299, i64 0, !296, i64 8, !299, i64 16, !297, i64 24}
!981 = !DILocation(line: 474, column: 10, scope: !968, inlinedAt: !975)
!982 = !DILocation(line: 474, column: 6, scope: !968, inlinedAt: !975)
!983 = !DILocation(line: 474, column: 8, scope: !968, inlinedAt: !975)
!984 = !{!980, !299, i64 0}
!985 = !DILocation(line: 475, column: 6, scope: !968, inlinedAt: !975)
!986 = !DILocation(line: 475, column: 10, scope: !968, inlinedAt: !975)
!987 = !{!980, !296, i64 8}
!988 = !DILocation(line: 346, column: 18, scope: !941)
!989 = !DILocation(line: 342, column: 15, scope: !941)
!990 = !DILocation(line: 346, column: 32, scope: !941)
!991 = !DILocation(line: 346, column: 3, scope: !941)
!992 = !DILocation(line: 347, column: 33, scope: !993)
!993 = distinct !DILexicalBlock(scope: !941, file: !1, line: 346, column: 41)
!994 = !DILocalVariable(name: "B", arg: 1, scope: !995, file: !1, line: 436, type: !971)
!995 = distinct !DISubprogram(name: "luaL_addlstring", scope: !1, file: !1, line: 436, type: !996, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !971, !209, !6}
!998 = !{!994, !999, !1000}
!999 = !DILocalVariable(name: "s", arg: 2, scope: !995, file: !1, line: 436, type: !209)
!1000 = !DILocalVariable(name: "l", arg: 3, scope: !995, file: !1, line: 436, type: !6)
!1001 = !DILocation(line: 436, column: 47, scope: !995, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 347, column: 5, scope: !993)
!1003 = !DILocation(line: 436, column: 62, scope: !995, inlinedAt: !1002)
!1004 = !DILocation(line: 436, column: 72, scope: !995, inlinedAt: !1002)
!1005 = !DILocation(line: 437, column: 3, scope: !995, inlinedAt: !1002)
!1006 = !DILocation(line: 437, column: 11, scope: !995, inlinedAt: !1002)
!1007 = !DILocation(line: 438, column: 5, scope: !995, inlinedAt: !1002)
!1008 = distinct !{!1008, !1009, !1010}
!1009 = !DILocation(line: 437, column: 3, scope: !995)
!1010 = !DILocation(line: 438, column: 5, scope: !995)
!1011 = !DILocalVariable(name: "B", arg: 1, scope: !1012, file: !1, line: 442, type: !971)
!1012 = distinct !DISubprogram(name: "luaL_addstring", scope: !1, file: !1, line: 442, type: !1013, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1015)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !971, !209}
!1015 = !{!1011, !1016}
