; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldump.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldump.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lua_State = type { %union.GCObject*, i8, i8, i8, %struct.lua_TValue*, %struct.lua_TValue*, %struct.global_State*, %struct.CallInfo*, i32*, %struct.lua_TValue*, %struct.lua_TValue*, %struct.CallInfo*, %struct.CallInfo*, i32, i32, i16, i16, i8, i8, i32, i32, void (%struct.lua_State*, %struct.lua_Debug*)*, %struct.lua_TValue, %struct.lua_TValue, %union.GCObject*, %union.GCObject*, %struct.lua_longjmp*, i64 }
%struct.global_State = type { %struct.stringtable, i8* (i8*, i8*, i64, i64)*, i8*, i8, i8, i32, %union.GCObject*, %union.GCObject**, %union.GCObject*, %union.GCObject*, %union.GCObject*, %union.GCObject*, %struct.Mbuffer, i64, i64, i64, i64, i32, i32, i32 (%struct.lua_State*)*, %struct.lua_TValue, %struct.lua_State*, %struct.UpVal, [9 x %struct.Table*], [17 x %union.TString*] }
%struct.stringtable = type { %union.GCObject**, i32, i32 }
%struct.Mbuffer = type { i8*, i64, i64 }
%struct.UpVal = type { %union.GCObject*, i8, i8, %struct.lua_TValue*, %union.anon }
%union.anon = type { %struct.lua_TValue }
%struct.Table = type { %union.GCObject*, i8, i8, i8, i8, %struct.Table*, %struct.lua_TValue*, %struct.Node*, %struct.Node*, %union.GCObject*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/ldump.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!12 = distinct !DISubprogram(name: "luaU_dump", scope: !1, file: !1, line: 153, type: !13, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !351)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !342, !345, !4, !15}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !18, line: 50, baseType: !19)
!18 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lua.h", directory: "/root/.unikraft/apps/redis/build")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !20, line: 100, size: 1472, elements: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lstate.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !{!22, !220, !221, !222, !223, !225, !226, !283, !296, !297, !298, !299, !300, !301, !302, !303, !305, !306, !307, !308, !309, !310, !333, !334, !335, !336, !337, !340}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !20, line: 101, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCObject", file: !25, line: 36, baseType: !26)
!25 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lobject.h", directory: "/root/.unikraft/apps/redis/build")
!26 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCObject", file: !20, line: 136, size: 1472, elements: !27)
!27 = !{!28, !38, !63, !121, !216, !217, !218, !219}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !26, file: !20, line: 137, baseType: !29, size: 128)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCheader", file: !25, line: 51, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCheader", file: !25, line: 49, size: 128, elements: !31)
!31 = !{!32, !33, !37}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !25, line: 50, baseType: !23, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !30, file: !25, line: 50, baseType: !34, size: 8, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_byte", file: !35, line: 27, baseType: !36)
!35 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/llimits.h", directory: "/root/.unikraft/apps/redis/build")
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !30, file: !25, line: 50, baseType: !34, size: 8, offset: 72)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !26, file: !20, line: 138, baseType: !39, size: 192)
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TString", file: !25, line: 199, size: 192, elements: !40)
!40 = !{!41, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !39, file: !25, line: 200, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "L_Umaxalign", file: !35, line: 47, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !35, line: 47, size: 64, elements: !44)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !43, file: !35, line: 47, baseType: !46, size: 64)
!46 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !43, file: !35, line: 47, baseType: !4, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !43, file: !35, line: 47, baseType: !49, size: 64)
!49 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tsv", scope: !39, file: !25, line: 206, baseType: !51, size: 192)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !39, file: !25, line: 201, size: 192, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !59}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !25, line: 202, baseType: !23, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !51, file: !25, line: 202, baseType: !34, size: 8, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !51, file: !25, line: 202, baseType: !34, size: 8, offset: 72)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !51, file: !25, line: 203, baseType: !34, size: 8, offset: 80)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !51, file: !25, line: 204, baseType: !58, size: 32, offset: 96)
!58 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !51, file: !25, line: 205, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 58, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !26, file: !20, line: 139, baseType: !64, size: 320)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Udata", file: !25, line: 215, size: 320, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !64, file: !25, line: 216, baseType: !42, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !64, file: !25, line: 222, baseType: !68, size: 320)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !64, file: !25, line: 217, size: 320, elements: !69)
!69 = !{!70, !71, !72, !73, !119, !120}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !25, line: 218, baseType: !23, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !68, file: !25, line: 218, baseType: !34, size: 8, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !68, file: !25, line: 218, baseType: !34, size: 8, offset: 72)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !68, file: !25, line: 219, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Table", file: !25, line: 338, size: 512, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !98, !116, !117, !118}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !75, file: !25, line: 339, baseType: !23, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !75, file: !25, line: 339, baseType: !34, size: 8, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !75, file: !25, line: 339, baseType: !34, size: 8, offset: 72)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !25, line: 340, baseType: !34, size: 8, offset: 80)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lsizenode", scope: !75, file: !25, line: 341, baseType: !34, size: 8, offset: 88)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !75, file: !25, line: 342, baseType: !74, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !75, file: !25, line: 343, baseType: !84, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !25, line: 75, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_TValue", file: !25, line: 73, size: 128, elements: !87)
!87 = !{!88, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !25, line: 74, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", file: !25, line: 64, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !25, line: 59, size: 64, elements: !91)
!91 = !{!92, !93, !94, !96}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !90, file: !25, line: 60, baseType: !23, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !90, file: !25, line: 61, baseType: !4, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !90, file: !25, line: 62, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !18, line: 99, baseType: !46)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !90, file: !25, line: 63, baseType: !15, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !86, file: !25, line: 74, baseType: !15, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !75, file: !25, line: 344, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !25, line: 335, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !25, line: 332, size: 320, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_val", scope: !101, file: !25, line: 333, baseType: !85, size: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_key", scope: !101, file: !25, line: 334, baseType: !105, size: 192, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "TKey", file: !25, line: 329, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TKey", file: !25, line: 323, size: 192, elements: !107)
!107 = !{!108, !115}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !106, file: !25, line: 327, baseType: !109, size: 192)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !106, file: !25, line: 324, size: 192, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !109, file: !25, line: 325, baseType: !89, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !109, file: !25, line: 325, baseType: !15, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !25, line: 326, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tvk", scope: !106, file: !25, line: 328, baseType: !85, size: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "lastfree", scope: !75, file: !25, line: 345, baseType: !99, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !75, file: !25, line: 346, baseType: !23, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sizearray", scope: !75, file: !25, line: 347, baseType: !15, size: 32, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !68, file: !25, line: 220, baseType: !74, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !68, file: !25, line: 221, baseType: !60, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !26, file: !20, line: 140, baseType: !122, size: 448)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Closure", file: !25, line: 309, size: 448, elements: !123)
!123 = !{!124, !144}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !122, file: !25, line: 310, baseType: !125, size: 448)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "CClosure", file: !25, line: 299, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CClosure", file: !25, line: 295, size: 448, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !140}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !25, line: 296, baseType: !23, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !126, file: !25, line: 296, baseType: !34, size: 8, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !126, file: !25, line: 296, baseType: !34, size: 8, offset: 72)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !126, file: !25, line: 296, baseType: !34, size: 8, offset: 80)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !126, file: !25, line: 296, baseType: !34, size: 8, offset: 88)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !126, file: !25, line: 296, baseType: !23, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !126, file: !25, line: 296, baseType: !74, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !126, file: !25, line: 297, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !18, line: 52, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!15, !16}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !126, file: !25, line: 298, baseType: !141, size: 128, offset: 320)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 1)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !122, file: !25, line: 311, baseType: !145, size: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "LClosure", file: !25, line: 306, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LClosure", file: !25, line: 302, size: 384, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !196}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !25, line: 303, baseType: !23, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !146, file: !25, line: 303, baseType: !34, size: 8, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !146, file: !25, line: 303, baseType: !34, size: 8, offset: 72)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "isC", scope: !146, file: !25, line: 303, baseType: !34, size: 8, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !146, file: !25, line: 303, baseType: !34, size: 8, offset: 88)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !146, file: !25, line: 303, baseType: !23, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !146, file: !25, line: 303, baseType: !74, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !146, file: !25, line: 304, baseType: !156, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Proto", file: !25, line: 231, size: 960, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !167, !169, !171, !180, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !25, line: 232, baseType: !23, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !157, file: !25, line: 232, baseType: !34, size: 8, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !157, file: !25, line: 232, baseType: !34, size: 8, offset: 72)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !157, file: !25, line: 233, baseType: !84, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !157, file: !25, line: 234, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", file: !35, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_int32", file: !35, line: 18, baseType: !58)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !157, file: !25, line: 235, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !157, file: !25, line: 236, baseType: !170, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "locvars", scope: !157, file: !25, line: 237, baseType: !172, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LocVar", file: !25, line: 262, size: 128, elements: !174)
!174 = !{!175, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !173, file: !25, line: 263, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "TString", file: !25, line: 207, baseType: !39)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !173, file: !25, line: 264, baseType: !15, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "endpc", scope: !173, file: !25, line: 265, baseType: !15, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "upvalues", scope: !157, file: !25, line: 238, baseType: !181, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !157, file: !25, line: 239, baseType: !176, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sizeupvalues", scope: !157, file: !25, line: 240, baseType: !15, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sizek", scope: !157, file: !25, line: 241, baseType: !15, size: 32, offset: 608)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sizecode", scope: !157, file: !25, line: 242, baseType: !15, size: 32, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sizelineinfo", scope: !157, file: !25, line: 243, baseType: !15, size: 32, offset: 672)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sizep", scope: !157, file: !25, line: 244, baseType: !15, size: 32, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sizelocvars", scope: !157, file: !25, line: 245, baseType: !15, size: 32, offset: 736)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !157, file: !25, line: 246, baseType: !15, size: 32, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !157, file: !25, line: 247, baseType: !15, size: 32, offset: 800)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !157, file: !25, line: 248, baseType: !23, size: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !157, file: !25, line: 249, baseType: !34, size: 8, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !157, file: !25, line: 250, baseType: !34, size: 8, offset: 904)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "is_vararg", scope: !157, file: !25, line: 251, baseType: !34, size: 8, offset: 912)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "maxstacksize", scope: !157, file: !25, line: 252, baseType: !34, size: 8, offset: 920)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "upvals", scope: !146, file: !25, line: 305, baseType: !197, size: 64, offset: 320)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !142)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpVal", file: !25, line: 284, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UpVal", file: !25, line: 274, size: 320, elements: !201)
!201 = !{!202, !203, !204, !205, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !25, line: 275, baseType: !23, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !200, file: !25, line: 275, baseType: !34, size: 8, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !200, file: !25, line: 275, baseType: !34, size: 8, offset: 72)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !200, file: !25, line: 276, baseType: !84, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !200, file: !25, line: 283, baseType: !207, size: 128, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !200, file: !25, line: 277, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !207, file: !25, line: 278, baseType: !85, size: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !207, file: !25, line: 282, baseType: !211, size: 128)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !207, file: !25, line: 279, size: 128, elements: !212)
!212 = !{!213, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !211, file: !25, line: 280, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !25, line: 281, baseType: !214, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !26, file: !20, line: 141, baseType: !75, size: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !26, file: !20, line: 142, baseType: !157, size: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !26, file: !20, line: 143, baseType: !200, size: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !26, file: !20, line: 144, baseType: !19, size: 1472)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !19, file: !20, line: 101, baseType: !34, size: 8, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !19, file: !20, line: 101, baseType: !34, size: 8, offset: 72)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !19, file: !20, line: 102, baseType: !34, size: 8, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !19, file: !20, line: 103, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "StkId", file: !25, line: 193, baseType: !84)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !19, file: !20, line: 104, baseType: !224, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "l_G", scope: !19, file: !20, line: 105, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !20, line: 94, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !20, line: 68, size: 3456, elements: !230)
!230 = !{!231, !239, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !263, !265, !266, !267, !268, !269, !270, !271, !272, !274, !275, !279}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "strt", scope: !229, file: !20, line: 69, baseType: !232, size: 128)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringtable", file: !20, line: 42, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stringtable", file: !20, line: 38, size: 128, elements: !234)
!234 = !{!235, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !233, file: !20, line: 39, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !233, file: !20, line: 40, baseType: !166, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !233, file: !20, line: 41, baseType: !15, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "frealloc", scope: !229, file: !20, line: 70, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !18, line: 66, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!4, !4, !4, !60, !60}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !229, file: !20, line: 71, baseType: !4, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !229, file: !20, line: 72, baseType: !34, size: 8, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gcstate", scope: !229, file: !20, line: 73, baseType: !34, size: 8, offset: 264)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstrgc", scope: !229, file: !20, line: 74, baseType: !15, size: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rootgc", scope: !229, file: !20, line: 75, baseType: !23, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgc", scope: !229, file: !20, line: 76, baseType: !236, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !229, file: !20, line: 77, baseType: !23, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !229, file: !20, line: 78, baseType: !23, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !229, file: !20, line: 79, baseType: !23, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tmudata", scope: !229, file: !20, line: 80, baseType: !23, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !229, file: !20, line: 81, baseType: !255, size: 192, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbuffer", file: !256, line: 28, baseType: !257)
!256 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/lzio.h", directory: "/root/.unikraft/apps/redis/build")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mbuffer", file: !256, line: 24, size: 192, elements: !258)
!258 = !{!259, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !257, file: !256, line: 25, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !257, file: !256, line: 26, baseType: !60, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "buffsize", scope: !257, file: !256, line: 27, baseType: !60, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "GCthreshold", scope: !229, file: !20, line: 82, baseType: !264, size: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "lu_mem", file: !35, line: 20, baseType: !60)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "totalbytes", scope: !229, file: !20, line: 83, baseType: !264, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !229, file: !20, line: 84, baseType: !264, size: 64, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gcdept", scope: !229, file: !20, line: 85, baseType: !264, size: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "gcpause", scope: !229, file: !20, line: 86, baseType: !15, size: 32, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "gcstepmul", scope: !229, file: !20, line: 87, baseType: !15, size: 32, offset: 1184)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !229, file: !20, line: 88, baseType: !136, size: 64, offset: 1216)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "l_registry", scope: !229, file: !20, line: 89, baseType: !85, size: 128, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !229, file: !20, line: 90, baseType: !273, size: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !229, file: !20, line: 91, baseType: !199, size: 320, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mt", scope: !229, file: !20, line: 92, baseType: !276, size: 576, offset: 1792)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 576, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 9)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tmname", scope: !229, file: !20, line: 93, baseType: !280, size: 1088, offset: 2368)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 1088, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 17)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !19, file: !20, line: 106, baseType: !284, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallInfo", file: !20, line: 55, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CallInfo", file: !20, line: 48, size: 320, elements: !287)
!287 = !{!288, !289, !290, !291, !294, !295}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !286, file: !20, line: 49, baseType: !224, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !286, file: !20, line: 50, baseType: !224, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !286, file: !20, line: 51, baseType: !224, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !286, file: !20, line: 52, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nresults", scope: !286, file: !20, line: 53, baseType: !15, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalls", scope: !286, file: !20, line: 54, baseType: !15, size: 32, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "savedpc", scope: !19, file: !20, line: 107, baseType: !292, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "stack_last", scope: !19, file: !20, line: 108, baseType: !224, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !19, file: !20, line: 109, baseType: !224, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "end_ci", scope: !19, file: !20, line: 110, baseType: !284, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "base_ci", scope: !19, file: !20, line: 111, baseType: !284, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !19, file: !20, line: 112, baseType: !15, size: 32, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size_ci", scope: !19, file: !20, line: 113, baseType: !15, size: 32, offset: 736)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nCcalls", scope: !19, file: !20, line: 114, baseType: !304, size: 16, offset: 768)
!304 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "baseCcalls", scope: !19, file: !20, line: 115, baseType: !304, size: 16, offset: 784)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !19, file: !20, line: 116, baseType: !34, size: 8, offset: 800)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "allowhook", scope: !19, file: !20, line: 117, baseType: !34, size: 8, offset: 808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "basehookcount", scope: !19, file: !20, line: 118, baseType: !15, size: 32, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !19, file: !20, line: 119, baseType: !15, size: 32, offset: 864)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !19, file: !20, line: 120, baseType: !311, size: 64, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !18, line: 330, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !16, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !18, line: 326, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !18, line: 346, size: 960, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !332}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !317, file: !18, line: 347, baseType: !15, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !18, line: 348, baseType: !5, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !317, file: !18, line: 349, baseType: !5, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !317, file: !18, line: 350, baseType: !5, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !317, file: !18, line: 351, baseType: !5, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !317, file: !18, line: 352, baseType: !15, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !317, file: !18, line: 353, baseType: !15, size: 32, offset: 352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !317, file: !18, line: 354, baseType: !15, size: 32, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !317, file: !18, line: 355, baseType: !15, size: 32, offset: 416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !317, file: !18, line: 356, baseType: !329, size: 480, offset: 448)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 480, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 60)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !317, file: !18, line: 358, baseType: !15, size: 32, offset: 928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "l_gt", scope: !19, file: !20, line: 121, baseType: !85, size: 128, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !19, file: !20, line: 122, baseType: !85, size: 128, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !19, file: !20, line: 123, baseType: !23, size: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !19, file: !20, line: 124, baseType: !23, size: 64, offset: 1280)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "errorJmp", scope: !19, file: !20, line: 125, baseType: !338, size: 64, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_longjmp", file: !20, line: 18, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "errfunc", scope: !19, file: !20, line: 126, baseType: !341, size: 64, offset: 1408)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !61, line: 49, baseType: !49)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "Proto", file: !25, line: 253, baseType: !157)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Writer", file: !18, line: 60, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!15, !16, !349, !60, !4}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!351 = !{!352, !353, !354, !355, !356, !357}
!352 = !DILocalVariable(name: "L", arg: 1, scope: !12, file: !1, line: 153, type: !16)
!353 = !DILocalVariable(name: "f", arg: 2, scope: !12, file: !1, line: 153, type: !342)
!354 = !DILocalVariable(name: "w", arg: 3, scope: !12, file: !1, line: 153, type: !345)
!355 = !DILocalVariable(name: "data", arg: 4, scope: !12, file: !1, line: 153, type: !4)
!356 = !DILocalVariable(name: "strip", arg: 5, scope: !12, file: !1, line: 153, type: !15)
!357 = !DILocalVariable(name: "D", scope: !12, file: !1, line: 155, type: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "DumpState", file: !1, line: 24, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 18, size: 256, elements: !360)
!360 = !{!361, !362, !363, !364, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !359, file: !1, line: 19, baseType: !16, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !359, file: !1, line: 20, baseType: !345, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !1, line: 21, baseType: !4, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !359, file: !1, line: 22, baseType: !15, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !359, file: !1, line: 23, baseType: !15, size: 32, offset: 224)
!366 = !DILocalVariable(name: "h", scope: !367, file: !1, line: 145, type: !373)
!367 = distinct !DISubprogram(name: "DumpHeader", scope: !1, file: !1, line: 143, type: !368, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !371)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!371 = !{!372, !366}
!372 = !DILocalVariable(name: "D", arg: 1, scope: !367, file: !1, line: 143, type: !370)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 12)
!376 = !DILocation(line: 145, column: 7, scope: !367, inlinedAt: !377)
!377 = distinct !DILocation(line: 161, column: 2, scope: !12)
!378 = !DILocation(line: 153, column: 27, scope: !12)
!379 = !DILocation(line: 153, column: 43, scope: !12)
!380 = !DILocation(line: 153, column: 57, scope: !12)
!381 = !DILocation(line: 153, column: 66, scope: !12)
!382 = !DILocation(line: 153, column: 76, scope: !12)
!383 = !DILocation(line: 155, column: 2, scope: !12)
!384 = !DILocation(line: 156, column: 4, scope: !12)
!385 = !DILocation(line: 156, column: 5, scope: !12)
!386 = !{!387, !388, i64 0}
!387 = !{!"", !388, i64 0, !388, i64 8, !388, i64 16, !391, i64 24, !391, i64 28}
!388 = !{!"any pointer", !389, i64 0}
!389 = !{!"omnipotent char", !390, i64 0}
!390 = !{!"Simple C/C++ TBAA"}
!391 = !{!"int", !389, i64 0}
!392 = !DILocation(line: 157, column: 4, scope: !12)
!393 = !DILocation(line: 157, column: 10, scope: !12)
!394 = !{!387, !388, i64 8}
!395 = !DILocation(line: 158, column: 4, scope: !12)
!396 = !DILocation(line: 158, column: 8, scope: !12)
!397 = !{!387, !388, i64 16}
!398 = !DILocation(line: 159, column: 4, scope: !12)
!399 = !DILocation(line: 159, column: 9, scope: !12)
!400 = !{!387, !391, i64 24}
!401 = !DILocation(line: 160, column: 4, scope: !12)
!402 = !DILocation(line: 155, column: 12, scope: !12)
!403 = !DILocation(line: 143, column: 35, scope: !367, inlinedAt: !377)
!404 = !DILocation(line: 145, column: 2, scope: !367, inlinedAt: !377)
!405 = !DILocation(line: 146, column: 2, scope: !367, inlinedAt: !377)
!406 = !DILocalVariable(name: "b", arg: 1, scope: !407, file: !1, line: 29, type: !349)
!407 = distinct !DISubprogram(name: "DumpBlock", scope: !1, file: !1, line: 29, type: !408, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !349, !60, !370}
!410 = !{!406, !411, !412}
!411 = !DILocalVariable(name: "size", arg: 2, scope: !407, file: !1, line: 29, type: !60)
!412 = !DILocalVariable(name: "D", arg: 3, scope: !407, file: !1, line: 29, type: !370)
!413 = !DILocation(line: 29, column: 35, scope: !407, inlinedAt: !414)
!414 = distinct !DILocation(line: 147, column: 2, scope: !367, inlinedAt: !377)
!415 = !DILocation(line: 29, column: 45, scope: !407, inlinedAt: !414)
!416 = !DILocation(line: 29, column: 62, scope: !407, inlinedAt: !414)
!417 = !DILocation(line: 34, column: 13, scope: !418, inlinedAt: !414)
!418 = distinct !DILexicalBlock(scope: !419, file: !1, line: 32, column: 2)
!419 = distinct !DILexicalBlock(scope: !407, file: !1, line: 31, column: 6)
!420 = !DILocation(line: 34, column: 12, scope: !418, inlinedAt: !414)
!421 = !{!387, !391, i64 28}
!422 = !DILocation(line: 148, column: 1, scope: !367, inlinedAt: !377)
!423 = !DILocation(line: 162, column: 2, scope: !12)
!424 = !DILocation(line: 163, column: 11, scope: !12)
!425 = !DILocation(line: 164, column: 1, scope: !12)
!426 = !DILocation(line: 163, column: 2, scope: !12)
