; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lmessages.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lmessages.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lc_messages_T = type { i8*, i8*, i8*, i8* }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_C_messages_locale", scope: !2, file: !3, line: 40, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/lmessages.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lc_messages_T", file: !8, line: 156, size: 256, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !14, !15, !16}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !7, file: !8, line: 158, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !7, file: !8, line: 159, baseType: !11, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !7, file: !8, line: 160, baseType: !11, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !7, file: !8, line: 161, baseType: !11, size: 64, offset: 192)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!21 = distinct !DISubprogram(name: "__messages_load_locale", scope: !3, file: !3, line: 61, type: !22, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !300)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !25, !11, !62, !11}
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !8, line: 178, size: 3392, elements: !27)
!27 = !{!28, !33, !254, !263, !264, !265, !293, !297, !299}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !26, file: !8, line: 180, baseType: !29, size: 1792)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1792, elements: !30)
!30 = !{!31, !32}
!31 = !DISubrange(count: 7)
!32 = !DISubrange(count: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !26, file: !8, line: 181, baseType: !34, size: 64, offset: 1792)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!24, !37, !70, !250, !251}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !39, line: 569, size: 14912, elements: !40)
!39 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !{!41, !42, !121, !122, !123, !124, !128, !129, !130, !131, !135, !147, !148, !149, !151, !152, !153, !215, !235, !236, !241, !248}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !38, file: !39, line: 571, baseType: !24, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !38, file: !39, line: 576, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !39, line: 287, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !39, line: 181, size: 1408, elements: !46)
!46 = !{!47, !50, !51, !52, !54, !55, !60, !61, !63, !71, !75, !80, !84, !85, !86, !87, !91, !95, !96, !97, !99, !100, !104, !120}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !45, file: !39, line: 182, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !45, file: !39, line: 183, baseType: !24, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !45, file: !39, line: 184, baseType: !24, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !39, line: 185, baseType: !53, size: 16, offset: 128)
!53 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !45, file: !39, line: 186, baseType: !53, size: 16, offset: 144)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !45, file: !39, line: 187, baseType: !56, size: 128, offset: 192)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !39, line: 117, size: 128, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !56, file: !39, line: 118, baseType: !48, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !56, file: !39, line: 119, baseType: !24, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !45, file: !39, line: 188, baseType: !24, size: 32, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !45, file: !39, line: 195, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !45, file: !39, line: 197, baseType: !64, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !37, !62, !70, !24}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !68, line: 145, baseType: !69)
!68 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !45, file: !39, line: 199, baseType: !72, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!67, !37, !62, !11, !24}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !45, file: !39, line: 202, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !37, !62, !79, !24}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !68, line: 114, baseType: !69)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !45, file: !39, line: 203, baseType: !81, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!24, !37, !62}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !45, file: !39, line: 206, baseType: !56, size: 128, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !45, file: !39, line: 207, baseType: !48, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !45, file: !39, line: 208, baseType: !24, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !45, file: !39, line: 211, baseType: !88, size: 24, offset: 928)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 24, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !45, file: !39, line: 212, baseType: !92, size: 8, offset: 952)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !45, file: !39, line: 215, baseType: !56, size: 128, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !45, file: !39, line: 218, baseType: !24, size: 32, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !39, line: 219, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !68, line: 44, baseType: !69)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !45, file: !39, line: 222, baseType: !37, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !39, line: 226, baseType: !101, size: 32, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !68, line: 175, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !103, line: 12, baseType: !24)
!103 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !45, file: !39, line: 228, baseType: !105, size: 64, offset: 1312)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !68, line: 171, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 163, size: 64, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !106, file: !68, line: 165, baseType: !24, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !106, file: !68, line: 170, baseType: !110, size: 32, offset: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !68, line: 166, size: 32, elements: !111)
!111 = !{!112, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !110, file: !68, line: 168, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !114, line: 124, baseType: !115)
!114 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!115 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !110, file: !68, line: 169, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !39, line: 229, baseType: !24, size: 32, offset: 1376)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !38, file: !39, line: 576, baseType: !43, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !38, file: !39, line: 576, baseType: !43, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !38, file: !39, line: 578, baseType: !24, size: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !38, file: !39, line: 579, baseType: !125, size: 200, offset: 288)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 200, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 25)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !38, file: !39, line: 582, baseType: !24, size: 32, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !38, file: !39, line: 583, baseType: !25, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !38, file: !39, line: 585, baseType: !24, size: 32, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !38, file: !39, line: 587, baseType: !132, size: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !37}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !38, file: !39, line: 590, baseType: !136, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !39, line: 47, size: 256, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !137, file: !39, line: 49, baseType: !136, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !137, file: !39, line: 50, baseType: !24, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !137, file: !39, line: 50, baseType: !24, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !137, file: !39, line: 50, baseType: !24, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !137, file: !39, line: 50, baseType: !24, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !137, file: !39, line: 51, baseType: !145, size: 32, offset: 192)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 32, elements: !93)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !39, line: 25, baseType: !115)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !38, file: !39, line: 591, baseType: !24, size: 32, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !38, file: !39, line: 592, baseType: !136, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !38, file: !39, line: 593, baseType: !150, size: 64, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !38, file: !39, line: 596, baseType: !24, size: 32, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !38, file: !39, line: 597, baseType: !70, size: 64, offset: 1088)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !38, file: !39, line: 632, baseType: !154, size: 2880, offset: 1152)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !38, file: !39, line: 599, size: 2880, elements: !155)
!155 = !{!156, !206}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !154, file: !39, line: 622, baseType: !157, size: 1728)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !154, file: !39, line: 601, size: 1728, elements: !158)
!158 = !{!159, !160, !161, !165, !177, !178, !180, !188, !189, !190, !191, !195, !199, !200, !201, !202, !203, !204, !205}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !157, file: !39, line: 603, baseType: !115, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !157, file: !39, line: 604, baseType: !70, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !157, file: !39, line: 605, baseType: !162, size: 208, offset: 128)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 208, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 26)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !157, file: !39, line: 606, baseType: !166, size: 288, offset: 352)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !39, line: 55, size: 288, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !166, file: !39, line: 57, baseType: !24, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !166, file: !39, line: 58, baseType: !24, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !166, file: !39, line: 59, baseType: !24, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !166, file: !39, line: 60, baseType: !24, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !166, file: !39, line: 61, baseType: !24, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !166, file: !39, line: 62, baseType: !24, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !166, file: !39, line: 63, baseType: !24, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !166, file: !39, line: 64, baseType: !24, size: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !166, file: !39, line: 65, baseType: !24, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !157, file: !39, line: 607, baseType: !24, size: 32, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !157, file: !39, line: 608, baseType: !179, size: 64, offset: 704)
!179 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !157, file: !39, line: 609, baseType: !181, size: 112, offset: 768)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !39, line: 319, size: 112, elements: !182)
!182 = !{!183, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !181, file: !39, line: 320, baseType: !184, size: 48)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 48, elements: !89)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !181, file: !39, line: 321, baseType: !184, size: 48, offset: 48)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !181, file: !39, line: 322, baseType: !185, size: 16, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !157, file: !39, line: 610, baseType: !105, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !157, file: !39, line: 611, baseType: !105, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !157, file: !39, line: 612, baseType: !105, size: 64, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !157, file: !39, line: 613, baseType: !192, size: 64, offset: 1088)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 8)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !157, file: !39, line: 614, baseType: !196, size: 192, offset: 1152)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 24)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !157, file: !39, line: 615, baseType: !24, size: 32, offset: 1344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !157, file: !39, line: 616, baseType: !105, size: 64, offset: 1376)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !157, file: !39, line: 617, baseType: !105, size: 64, offset: 1440)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !157, file: !39, line: 618, baseType: !105, size: 64, offset: 1504)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !157, file: !39, line: 619, baseType: !105, size: 64, offset: 1568)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !157, file: !39, line: 620, baseType: !105, size: 64, offset: 1632)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !157, file: !39, line: 621, baseType: !24, size: 32, offset: 1696)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !154, file: !39, line: 631, baseType: !207, size: 2880)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !154, file: !39, line: 626, size: 2880, elements: !208)
!208 = !{!209, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !207, file: !39, line: 629, baseType: !210, size: 1920)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 1920, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 30)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !207, file: !39, line: 630, baseType: !214, size: 960, offset: 1920)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 960, elements: !211)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !38, file: !39, line: 636, baseType: !216, size: 64, offset: 4032)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !39, line: 93, size: 6336, elements: !218)
!218 = !{!219, !220, !221, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !217, file: !39, line: 94, baseType: !216, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !217, file: !39, line: 95, baseType: !24, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !217, file: !39, line: 97, baseType: !222, size: 2048, offset: 128)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 2048, elements: !226)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null}
!226 = !{!32}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !217, file: !39, line: 98, baseType: !228, size: 4160, offset: 2176)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !39, line: 74, size: 4160, elements: !229)
!229 = !{!230, !232, !233, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !228, file: !39, line: 75, baseType: !231, size: 2048)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, elements: !226)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !228, file: !39, line: 76, baseType: !231, size: 2048, offset: 2048)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !228, file: !39, line: 78, baseType: !146, size: 32, offset: 4096)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !228, file: !39, line: 81, baseType: !146, size: 32, offset: 4128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !38, file: !39, line: 637, baseType: !217, size: 6336, offset: 4096)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !38, file: !39, line: 641, baseType: !237, size: 64, offset: 10432)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !24}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !38, file: !39, line: 646, baseType: !242, size: 192, offset: 10496)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !39, line: 291, size: 192, elements: !243)
!243 = !{!244, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !242, file: !39, line: 293, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !242, file: !39, line: 294, baseType: !24, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !242, file: !39, line: 295, baseType: !43, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !38, file: !39, line: 648, baseType: !249, size: 4224, offset: 10688)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4224, elements: !89)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !114, line: 83, baseType: !24)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 86, baseType: !105)
!253 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !26, file: !8, line: 183, baseType: !255, size: 64, offset: 1856)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!24, !37, !258, !11, !259, !251}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !260, line: 40, baseType: !261)
!260 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !68, line: 129, baseType: !262)
!262 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !26, file: !8, line: 185, baseType: !24, size: 32, offset: 1920)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !26, file: !8, line: 186, baseType: !70, size: 64, offset: 1984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !26, file: !8, line: 187, baseType: !266, size: 768, offset: 2048)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !267, line: 42, size: 768, elements: !268)
!267 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !266, file: !267, line: 44, baseType: !70, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !266, file: !267, line: 45, baseType: !70, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !266, file: !267, line: 46, baseType: !70, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !266, file: !267, line: 47, baseType: !70, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !266, file: !267, line: 48, baseType: !70, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !266, file: !267, line: 49, baseType: !70, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !266, file: !267, line: 50, baseType: !70, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !266, file: !267, line: 51, baseType: !70, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !266, file: !267, line: 52, baseType: !70, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !266, file: !267, line: 53, baseType: !70, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !266, file: !267, line: 54, baseType: !13, size: 8, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !266, file: !267, line: 55, baseType: !13, size: 8, offset: 648)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !266, file: !267, line: 56, baseType: !13, size: 8, offset: 656)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !266, file: !267, line: 57, baseType: !13, size: 8, offset: 664)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !266, file: !267, line: 58, baseType: !13, size: 8, offset: 672)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !266, file: !267, line: 59, baseType: !13, size: 8, offset: 680)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !266, file: !267, line: 60, baseType: !13, size: 8, offset: 688)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !266, file: !267, line: 61, baseType: !13, size: 8, offset: 696)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !266, file: !267, line: 62, baseType: !13, size: 8, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !266, file: !267, line: 63, baseType: !13, size: 8, offset: 712)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !266, file: !267, line: 64, baseType: !13, size: 8, offset: 720)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !266, file: !267, line: 65, baseType: !13, size: 8, offset: 728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !266, file: !267, line: 66, baseType: !13, size: 8, offset: 736)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !266, file: !267, line: 67, baseType: !13, size: 8, offset: 744)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !26, file: !8, line: 189, baseType: !294, size: 16, offset: 2816)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 16, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 2)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !26, file: !8, line: 190, baseType: !298, size: 256, offset: 2832)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !226)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !26, file: !8, line: 191, baseType: !298, size: 256, offset: 3088)
!300 = !{!301, !302, !303, !304, !305, !306, !307}
!301 = !DILocalVariable(name: "locale", arg: 1, scope: !21, file: !3, line: 61, type: !25)
!302 = !DILocalVariable(name: "name", arg: 2, scope: !21, file: !3, line: 61, type: !11)
!303 = !DILocalVariable(name: "f_wctomb", arg: 3, scope: !21, file: !3, line: 62, type: !62)
!304 = !DILocalVariable(name: "charset", arg: 4, scope: !21, file: !3, line: 62, type: !11)
!305 = !DILocalVariable(name: "ret", scope: !21, file: !3, line: 64, type: !24)
!306 = !DILocalVariable(name: "me", scope: !21, file: !3, line: 65, type: !7)
!307 = !DILocalVariable(name: "bufp", scope: !21, file: !3, line: 66, type: !70)
!308 = !DILocation(line: 61, column: 44, scope: !21)
!309 = !DILocation(line: 61, column: 64, scope: !21)
!310 = !DILocation(line: 62, column: 10, scope: !21)
!311 = !DILocation(line: 62, column: 32, scope: !21)
!312 = !DILocation(line: 66, column: 9, scope: !21)
!313 = !DILocation(line: 105, column: 3, scope: !21)
