; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/networking.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/networking.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "logged_time", scope: !2, file: !3, line: 1949, type: !182, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "securityWarningCommand", scope: !3, file: !3, line: 1948, type: !4, isLocal: false, isDefinition: true, scopeLine: 1948, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !347)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/networking.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !8, line: 780, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !8, line: 723, size: 135360, elements: !10)
!10 = !{!11, !17, !19, !125, !136, !141, !146, !147, !148, !149, !151, !173, !174, !175, !176, !177, !178, !180, !181, !184, !185, !186, !187, !188, !189, !190, !191, !196, !197, !198, !199, !200, !201, !202, !203, !207, !208, !212, !213, !229, !230, !247, !248, !249, !250, !251, !252, !253, !254}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 724, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 60, baseType: !14)
!13 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !15, line: 105, baseType: !16)
!15 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!16 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !9, file: !8, line: 725, baseType: !18, size: 32, offset: 64)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !9, file: !8, line: 726, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !8, line: 656, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !8, line: 647, size: 512, elements: !23)
!23 = !{!24, !89, !90, !91, !92, !93, !94, !96}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !22, file: !8, line: 648, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !27, line: 82, baseType: !28)
!27 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !27, line: 76, size: 768, elements: !29)
!29 = !{!30, !56, !57, !87, !88}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !27, line: 77, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !27, line: 65, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !27, line: 58, size: 384, elements: !34)
!34 = !{!35, !41, !46, !47, !51, !55}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !33, file: !27, line: 59, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!12, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !33, file: !27, line: 60, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !45, !39}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !33, file: !27, line: 61, baseType: !42, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !33, file: !27, line: 62, baseType: !48, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!18, !45, !39, !39}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !33, file: !27, line: 63, baseType: !52, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !45, !45}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !33, file: !27, line: 64, baseType: !52, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !28, file: !27, line: 78, baseType: !45, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !28, file: !27, line: 79, baseType: !58, size: 512, offset: 128)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 512, elements: !85)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !27, line: 74, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !27, line: 69, size: 256, elements: !61)
!61 = !{!62, !82, !83, !84}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !60, file: !27, line: 70, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !27, line: 56, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !27, line: 47, size: 192, elements: !67)
!67 = !{!68, !69, !80}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !66, file: !27, line: 48, baseType: !45, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !66, file: !27, line: 54, baseType: !70, size: 64, offset: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !27, line: 49, size: 64, elements: !71)
!71 = !{!72, !73, !74, !78}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !70, file: !27, line: 50, baseType: !45, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !70, file: !27, line: 51, baseType: !12, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !70, file: !27, line: 52, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 56, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !15, line: 103, baseType: !77)
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !70, file: !27, line: 53, baseType: !79, size: 64)
!79 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !27, line: 55, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !27, line: 71, baseType: !16, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !60, file: !27, line: 72, baseType: !16, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !60, file: !27, line: 73, baseType: !16, size: 64, offset: 192)
!85 = !{!86}
!86 = !DISubrange(count: 2)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !28, file: !27, line: 80, baseType: !77, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !28, file: !27, line: 81, baseType: !16, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !22, file: !8, line: 649, baseType: !25, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !22, file: !8, line: 650, baseType: !25, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !22, file: !8, line: 651, baseType: !25, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !22, file: !8, line: 652, baseType: !25, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !22, file: !8, line: 653, baseType: !18, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !22, file: !8, line: 654, baseType: !95, size: 64, offset: 384)
!95 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !22, file: !8, line: 655, baseType: !97, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !99, line: 54, baseType: !100)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !99, line: 47, size: 384, elements: !101)
!101 = !{!102, !111, !112, !116, !120, !124}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !100, file: !99, line: 48, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !99, line: 40, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !99, line: 36, size: 192, elements: !106)
!106 = !{!107, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !99, line: 37, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !99, line: 38, baseType: !108, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !99, line: 39, baseType: !45, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !100, file: !99, line: 49, baseType: !103, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !100, file: !99, line: 50, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!45, !45}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !100, file: !99, line: 51, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !45}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !100, file: !99, line: 52, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!18, !45, !45}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, file: !99, line: 53, baseType: !16, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 727, baseType: !126, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !8, line: 622, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !8, line: 614, size: 128, elements: !129)
!129 = !{!130, !132, !133, !134, !135}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !8, line: 615, baseType: !131, size: 4, flags: DIFlagBitField, extraData: i64 0)
!131 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !128, file: !8, line: 616, baseType: !131, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !128, file: !8, line: 617, baseType: !131, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !128, file: !8, line: 620, baseType: !18, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !128, file: !8, line: 621, baseType: !45, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !9, file: !8, line: 728, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !138, line: 43, baseType: !139)
!138 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !9, file: !8, line: 729, baseType: !142, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !143, line: 40, baseType: !144)
!143 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !145, line: 129, baseType: !16)
!145 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !9, file: !8, line: 730, baseType: !137, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !9, file: !8, line: 734, baseType: !142, size: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !9, file: !8, line: 735, baseType: !18, size: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !9, file: !8, line: 736, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !9, file: !8, line: 737, baseType: !152, size: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !8, line: 1307, size: 640, elements: !154)
!154 = !{!155, !156, !159, !160, !161, !162, !168, !169, !170, !171, !172}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !8, line: 1308, baseType: !139, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !153, file: !8, line: 1309, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !8, line: 1305, baseType: !4)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !153, file: !8, line: 1310, baseType: !18, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !153, file: !8, line: 1311, baseType: !139, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !8, line: 1312, baseType: !18, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !153, file: !8, line: 1315, baseType: !163, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !8, line: 1306, baseType: !165)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !152, !150, !18, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !153, file: !8, line: 1317, baseType: !18, size: 32, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !153, file: !8, line: 1318, baseType: !18, size: 32, offset: 416)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !153, file: !8, line: 1319, baseType: !18, size: 32, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !153, file: !8, line: 1320, baseType: !95, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !153, file: !8, line: 1320, baseType: !95, size: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !9, file: !8, line: 737, baseType: !152, size: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !9, file: !8, line: 738, baseType: !18, size: 32, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !9, file: !8, line: 739, baseType: !18, size: 32, offset: 800)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !9, file: !8, line: 740, baseType: !77, size: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !9, file: !8, line: 741, baseType: !97, size: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !9, file: !8, line: 742, baseType: !179, size: 64, offset: 960)
!179 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !9, file: !8, line: 743, baseType: !142, size: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !9, file: !8, line: 745, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !183, line: 34, baseType: !77)
!183 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !9, file: !8, line: 746, baseType: !182, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !9, file: !8, line: 747, baseType: !182, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !9, file: !8, line: 748, baseType: !18, size: 32, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !9, file: !8, line: 749, baseType: !18, size: 32, offset: 1312)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !9, file: !8, line: 750, baseType: !18, size: 32, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !9, file: !8, line: 751, baseType: !18, size: 32, offset: 1376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !9, file: !8, line: 752, baseType: !18, size: 32, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !9, file: !8, line: 753, baseType: !192, size: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !193, line: 173, baseType: !194)
!193 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !145, line: 100, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !145, line: 44, baseType: !77)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !9, file: !8, line: 754, baseType: !192, size: 64, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !9, file: !8, line: 755, baseType: !137, size: 64, offset: 1600)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !9, file: !8, line: 756, baseType: !95, size: 64, offset: 1664)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !9, file: !8, line: 757, baseType: !95, size: 64, offset: 1728)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !9, file: !8, line: 758, baseType: !95, size: 64, offset: 1792)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !9, file: !8, line: 759, baseType: !95, size: 64, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !9, file: !8, line: 760, baseType: !95, size: 64, offset: 1920)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !9, file: !8, line: 763, baseType: !204, size: 328, offset: 1984)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 328, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 41)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !9, file: !8, line: 764, baseType: !18, size: 32, offset: 2336)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !9, file: !8, line: 765, baseType: !209, size: 368, offset: 2368)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 368, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 46)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !9, file: !8, line: 766, baseType: !18, size: 32, offset: 2752)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !9, file: !8, line: 767, baseType: !214, size: 256, offset: 2816)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !8, line: 673, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !8, line: 665, size: 256, elements: !216)
!216 = !{!217, !225, !226, !227, !228}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !215, file: !8, line: 666, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !8, line: 663, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !8, line: 659, size: 192, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !220, file: !8, line: 660, baseType: !150, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !220, file: !8, line: 661, baseType: !18, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !220, file: !8, line: 662, baseType: !152, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !215, file: !8, line: 667, baseType: !18, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !215, file: !8, line: 668, baseType: !18, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !215, file: !8, line: 671, baseType: !18, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !215, file: !8, line: 672, baseType: !182, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !9, file: !8, line: 768, baseType: !18, size: 32, offset: 3072)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !9, file: !8, line: 769, baseType: !231, size: 704, offset: 3136)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !8, line: 703, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !8, line: 677, size: 704, elements: !233)
!233 = !{!234, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !232, file: !8, line: 679, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !8, line: 52, baseType: !95)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !232, file: !8, line: 683, baseType: !25, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !232, file: !8, line: 685, baseType: !126, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !232, file: !8, line: 689, baseType: !142, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !232, file: !8, line: 690, baseType: !126, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !232, file: !8, line: 691, baseType: !126, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !232, file: !8, line: 692, baseType: !235, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !232, file: !8, line: 692, baseType: !235, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !232, file: !8, line: 693, baseType: !18, size: 32, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !232, file: !8, line: 696, baseType: !18, size: 32, offset: 544)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !232, file: !8, line: 697, baseType: !95, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !232, file: !8, line: 700, baseType: !45, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !9, file: !8, line: 770, baseType: !95, size: 64, offset: 3840)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !9, file: !8, line: 771, baseType: !97, size: 64, offset: 3904)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !9, file: !8, line: 772, baseType: !25, size: 64, offset: 3968)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !9, file: !8, line: 773, baseType: !97, size: 64, offset: 4032)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !9, file: !8, line: 774, baseType: !137, size: 64, offset: 4096)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !9, file: !8, line: 775, baseType: !103, size: 64, offset: 4160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !9, file: !8, line: 778, baseType: !18, size: 32, offset: 4224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !9, file: !8, line: 779, baseType: !255, size: 131072, offset: 4256)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 131072, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 16384)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !259, retainedTypes: !267, globals: !310)
!259 = !{!260}
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !261, line: 68, baseType: !131, size: 32, elements: !262)
!261 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!262 = !{!263, !264, !265, !266}
!263 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!264 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!265 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!266 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!267 = !{!268, !45, !77, !103, !139, !6, !18, !270, !142, !179, !95, !272, !284, !294, !303}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !193, line: 200, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !145, line: 145, baseType: !77)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !138, line: 51, size: 24, elements: !274)
!274 = !{!275, !278, !279, !280}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !273, file: !138, line: 52, baseType: !276, size: 8)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !269)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !273, file: !138, line: 53, baseType: !276, size: 8, offset: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !138, line: 54, baseType: !269, size: 8, offset: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !273, file: !138, line: 55, baseType: !281, offset: 24)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: -1)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !138, line: 57, size: 40, elements: !286)
!286 = !{!287, !291, !292, !293}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !285, file: !138, line: 58, baseType: !288, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 36, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 57, baseType: !290)
!290 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !285, file: !138, line: 59, baseType: !288, size: 16, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !285, file: !138, line: 60, baseType: !269, size: 8, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !285, file: !138, line: 61, baseType: !281, offset: 40)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !138, line: 63, size: 72, elements: !296)
!296 = !{!297, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !295, file: !138, line: 64, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 48, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 79, baseType: !131)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !295, file: !138, line: 65, baseType: !298, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !138, line: 66, baseType: !269, size: 8, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !295, file: !138, line: 67, baseType: !281, offset: 72)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !138, line: 69, size: 136, elements: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !304, file: !138, line: 70, baseType: !12, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !304, file: !138, line: 71, baseType: !12, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !138, line: 72, baseType: !269, size: 8, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !304, file: !138, line: 73, baseType: !281, offset: 136)
!310 = !{!0, !311, !337, !342}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "__str", scope: !313, file: !314, line: 198, type: !334, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "uk_pr_crit", scope: !314, file: !314, line: 194, type: !315, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !319)
!314 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!315 = !DISubroutineType(types: !316)
!316 = !{null, !317, null}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!319 = !{!320, !321}
!320 = !DILocalVariable(name: "fmt", arg: 1, scope: !313, file: !314, line: 194, type: !317)
!321 = !DILocalVariable(name: "argp", scope: !313, file: !314, line: 196, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !323, line: 32, baseType: !324)
!323 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 390, baseType: !325)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 192, elements: !332)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 390, size: 192, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !326, file: !3, line: 390, baseType: !131, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !326, file: !3, line: 390, baseType: !131, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !326, file: !3, line: 390, baseType: !45, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !326, file: !3, line: 390, baseType: !45, size: 64, offset: 128)
!332 = !{!333}
!333 = !DISubrange(count: 1)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 16)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "__str", scope: !313, file: !314, line: 198, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 104, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 13)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "err", scope: !258, file: !3, line: 668, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8816, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 1102)
!347 = !{!348, !349}
!348 = !DILocalVariable(name: "c", arg: 1, scope: !2, file: !3, line: 1948, type: !6)
!349 = !DILocalVariable(name: "now", scope: !2, file: !3, line: 1950, type: !182)
!350 = !{i32 2, !"Dwarf Version", i32 4}
!351 = !{i32 2, !"Debug Info Version", i32 3}
!352 = !{i32 1, !"wchar_size", i32 4}
!353 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!354 = distinct !DISubprogram(name: "sdsZmallocSize", scope: !3, file: !3, line: 44, type: !355, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!142, !137}
!357 = !{!358, !359}
!358 = !DILocalVariable(name: "s", arg: 1, scope: !354, file: !3, line: 44, type: !137)
!359 = !DILocalVariable(name: "sh", scope: !354, file: !3, line: 45, type: !45)
!360 = !DILocation(line: 44, column: 27, scope: !354)
!361 = !DILocation(line: 45, column: 16, scope: !354)
!362 = !DILocation(line: 45, column: 11, scope: !354)
!363 = !DILocation(line: 46, column: 12, scope: !354)
!364 = !DILocation(line: 46, column: 5, scope: !354)
!365 = distinct !DISubprogram(name: "getStringObjectSdsUsedMemory", scope: !3, file: !3, line: 51, type: !366, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!142, !126}
!368 = !{!369}
!369 = !DILocalVariable(name: "o", arg: 1, scope: !365, file: !3, line: 51, type: !126)
!370 = !DILocation(line: 51, column: 43, scope: !365)
!371 = !DILocation(line: 52, column: 5, scope: !365)
!372 = !DILocation(line: 53, column: 15, scope: !365)
!373 = !DILocation(line: 53, column: 5, scope: !365)
!374 = !DILocation(line: 54, column: 53, scope: !375)
!375 = distinct !DILexicalBlock(scope: !365, file: !3, line: 53, column: 25)
!376 = !{!377, !381, i64 8}
!377 = !{!"redisObject", !378, i64 0, !378, i64 0, !378, i64 1, !378, i64 4, !381, i64 8}
!378 = !{!"int", !379, i64 0}
!379 = !{!"omnipotent char", !380, i64 0}
!380 = !{!"Simple C/C++ TBAA"}
!381 = !{!"any pointer", !379, i64 0}
!382 = !DILocation(line: 44, column: 27, scope: !354, inlinedAt: !383)
!383 = distinct !DILocation(line: 54, column: 35, scope: !375)
!384 = !DILocation(line: 45, column: 16, scope: !354, inlinedAt: !383)
!385 = !DILocation(line: 45, column: 11, scope: !354, inlinedAt: !383)
!386 = !DILocation(line: 46, column: 12, scope: !354, inlinedAt: !383)
!387 = !DILocation(line: 54, column: 28, scope: !375)
!388 = !DILocation(line: 55, column: 51, scope: !375)
!389 = !DILocation(line: 55, column: 38, scope: !375)
!390 = !DILocation(line: 55, column: 53, scope: !375)
!391 = !DILocation(line: 55, column: 31, scope: !375)
!392 = !DILocation(line: 0, scope: !375)
!393 = !DILocation(line: 58, column: 1, scope: !365)
!394 = distinct !DISubprogram(name: "dupClientReplyValue", scope: !3, file: !3, line: 61, type: !114, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !395)
!395 = !{!396, !397, !405}
!396 = !DILocalVariable(name: "o", arg: 1, scope: !394, file: !3, line: 61, type: !45)
!397 = !DILocalVariable(name: "old", scope: !394, file: !3, line: 62, type: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "clientReplyBlock", file: !8, line: 642, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clientReplyBlock", file: !8, line: 639, size: 128, elements: !401)
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !400, file: !8, line: 640, baseType: !142, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !400, file: !8, line: 640, baseType: !142, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !400, file: !8, line: 641, baseType: !281, offset: 128)
!405 = !DILocalVariable(name: "buf", scope: !394, file: !3, line: 63, type: !398)
!406 = !DILocation(line: 61, column: 33, scope: !394)
!407 = !DILocation(line: 62, column: 23, scope: !394)
!408 = !DILocation(line: 63, column: 69, scope: !394)
!409 = !{!410, !410, i64 0}
!410 = !{!"long", !379, i64 0}
!411 = !DILocation(line: 63, column: 62, scope: !394)
!412 = !DILocation(line: 63, column: 29, scope: !394)
!413 = !DILocation(line: 63, column: 23, scope: !394)
!414 = !DILocation(line: 64, column: 52, scope: !394)
!415 = !DILocation(line: 64, column: 45, scope: !394)
!416 = !DILocation(line: 64, column: 5, scope: !394)
!417 = !DILocation(line: 65, column: 5, scope: !394)
!418 = distinct !DISubprogram(name: "freeClientReplyValue", scope: !3, file: !3, line: 68, type: !118, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !419)
!419 = !{!420}
!420 = !DILocalVariable(name: "o", arg: 1, scope: !418, file: !3, line: 68, type: !45)
!421 = !DILocation(line: 68, column: 33, scope: !418)
!422 = !DILocation(line: 69, column: 5, scope: !418)
!423 = !DILocation(line: 70, column: 1, scope: !418)
!424 = distinct !DISubprogram(name: "listMatchObjects", scope: !3, file: !3, line: 72, type: !122, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !425)
!425 = !{!426, !427}
!426 = !DILocalVariable(name: "a", arg: 1, scope: !424, file: !3, line: 72, type: !45)
!427 = !DILocalVariable(name: "b", arg: 2, scope: !424, file: !3, line: 72, type: !45)
!428 = !DILocation(line: 72, column: 28, scope: !424)
!429 = !DILocation(line: 72, column: 37, scope: !424)
!430 = !DILocation(line: 73, column: 31, scope: !424)
!431 = !DILocation(line: 73, column: 33, scope: !424)
!432 = !DILocation(line: 73, column: 12, scope: !424)
!433 = !DILocation(line: 73, column: 5, scope: !424)
!434 = distinct !DISubprogram(name: "linkClient", scope: !3, file: !3, line: 78, type: !4, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !435)
!435 = !{!436, !437}
!436 = !DILocalVariable(name: "c", arg: 1, scope: !434, file: !3, line: 78, type: !6)
!437 = !DILocalVariable(name: "id", scope: !434, file: !3, line: 84, type: !12)
!438 = !DILocation(line: 78, column: 25, scope: !434)
!439 = !DILocation(line: 79, column: 28, scope: !434)
!440 = !{!441, !381, i64 512}
!441 = !{!"redisServer", !378, i64 0, !381, i64 8, !381, i64 16, !381, i64 24, !378, i64 32, !378, i64 36, !378, i64 40, !381, i64 48, !381, i64 56, !381, i64 64, !381, i64 72, !378, i64 80, !378, i64 84, !378, i64 88, !378, i64 92, !381, i64 96, !381, i64 104, !378, i64 112, !378, i64 116, !379, i64 120, !378, i64 164, !410, i64 168, !378, i64 176, !381, i64 184, !381, i64 192, !381, i64 200, !379, i64 208, !378, i64 216, !378, i64 220, !379, i64 224, !378, i64 352, !381, i64 360, !378, i64 368, !379, i64 372, !378, i64 436, !378, i64 440, !379, i64 444, !378, i64 508, !381, i64 512, !381, i64 520, !381, i64 528, !381, i64 536, !381, i64 544, !381, i64 552, !381, i64 560, !378, i64 568, !442, i64 576, !379, i64 584, !381, i64 840, !410, i64 848, !378, i64 856, !378, i64 860, !410, i64 864, !410, i64 872, !410, i64 880, !410, i64 888, !381, i64 896, !381, i64 904, !381, i64 912, !381, i64 920, !381, i64 928, !381, i64 936, !381, i64 944, !381, i64 952, !381, i64 960, !381, i64 968, !381, i64 976, !381, i64 984, !381, i64 992, !410, i64 1000, !442, i64 1008, !442, i64 1016, !442, i64 1024, !443, i64 1032, !442, i64 1040, !442, i64 1048, !442, i64 1056, !442, i64 1064, !442, i64 1072, !442, i64 1080, !442, i64 1088, !442, i64 1096, !442, i64 1104, !410, i64 1112, !442, i64 1120, !443, i64 1128, !442, i64 1136, !442, i64 1144, !442, i64 1152, !442, i64 1160, !381, i64 1168, !442, i64 1176, !442, i64 1184, !410, i64 1192, !444, i64 1200, !442, i64 1240, !442, i64 1248, !410, i64 1256, !410, i64 1264, !379, i64 1272, !378, i64 1728, !378, i64 1732, !378, i64 1736, !378, i64 1740, !378, i64 1744, !410, i64 1752, !378, i64 1760, !378, i64 1764, !378, i64 1768, !378, i64 1772, !410, i64 1776, !410, i64 1784, !378, i64 1792, !378, i64 1796, !378, i64 1800, !378, i64 1804, !379, i64 1808, !378, i64 1880, !378, i64 1884, !381, i64 1888, !378, i64 1896, !378, i64 1900, !410, i64 1904, !410, i64 1912, !410, i64 1920, !410, i64 1928, !378, i64 1936, !378, i64 1940, !381, i64 1944, !381, i64 1952, !378, i64 1960, !378, i64 1964, !410, i64 1968, !410, i64 1976, !410, i64 1984, !410, i64 1992, !378, i64 2000, !410, i64 2008, !378, i64 2016, !378, i64 2020, !378, i64 2024, !378, i64 2028, !378, i64 2032, !378, i64 2036, !378, i64 2040, !378, i64 2044, !378, i64 2048, !378, i64 2052, !378, i64 2056, !378, i64 2060, !378, i64 2064, !381, i64 2072, !442, i64 2080, !442, i64 2088, !378, i64 2096, !381, i64 2104, !378, i64 2112, !381, i64 2120, !378, i64 2128, !378, i64 2132, !410, i64 2136, !410, i64 2144, !410, i64 2152, !410, i64 2160, !378, i64 2168, !378, i64 2172, !378, i64 2176, !378, i64 2180, !378, i64 2184, !378, i64 2188, !379, i64 2192, !445, i64 2200, !446, i64 2224, !381, i64 2240, !378, i64 2248, !381, i64 2256, !378, i64 2264, !379, i64 2268, !379, i64 2309, !442, i64 2352, !442, i64 2360, !378, i64 2368, !378, i64 2372, !381, i64 2376, !442, i64 2384, !442, i64 2392, !442, i64 2400, !442, i64 2408, !410, i64 2416, !410, i64 2424, !378, i64 2432, !378, i64 2436, !378, i64 2440, !378, i64 2444, !378, i64 2448, !381, i64 2456, !381, i64 2464, !378, i64 2472, !378, i64 2476, !381, i64 2480, !381, i64 2488, !378, i64 2496, !378, i64 2500, !410, i64 2504, !410, i64 2512, !410, i64 2520, !378, i64 2528, !378, i64 2532, !381, i64 2536, !410, i64 2544, !378, i64 2552, !378, i64 2556, !378, i64 2560, !410, i64 2568, !378, i64 2576, !378, i64 2580, !378, i64 2584, !381, i64 2592, !379, i64 2600, !442, i64 2648, !378, i64 2656, !381, i64 2664, !381, i64 2672, !378, i64 2680, !381, i64 2688, !378, i64 2696, !378, i64 2700, !442, i64 2704, !378, i64 2712, !378, i64 2716, !378, i64 2720, !378, i64 2724, !442, i64 2728, !378, i64 2736, !379, i64 2740, !381, i64 2768, !381, i64 2776, !378, i64 2784, !378, i64 2788, !378, i64 2792, !378, i64 2796, !410, i64 2800, !410, i64 2808, !410, i64 2816, !410, i64 2824, !410, i64 2832, !410, i64 2840, !410, i64 2848, !410, i64 2856, !378, i64 2864, !378, i64 2868, !410, i64 2872, !410, i64 2880, !378, i64 2888, !442, i64 2896, !381, i64 2904, !381, i64 2912, !378, i64 2920, !378, i64 2924, !442, i64 2928, !381, i64 2936, !381, i64 2944, !378, i64 2952, !378, i64 2956, !378, i64 2960, !378, i64 2964, !381, i64 2968, !378, i64 2976, !378, i64 2980, !378, i64 2984, !381, i64 2992, !381, i64 3000, !381, i64 3008, !381, i64 3016, !442, i64 3024, !442, i64 3032, !442, i64 3040, !378, i64 3048, !378, i64 3052, !378, i64 3056, !378, i64 3060, !378, i64 3064, !378, i64 3068, !378, i64 3072, !378, i64 3076, !378, i64 3080, !378, i64 3084, !378, i64 3088, !442, i64 3096, !381, i64 3104, !381, i64 3112, !381, i64 3120, !378, i64 3128, !378, i64 3132, !378, i64 3136, !410, i64 3144, !381, i64 3152, !381, i64 3160, !381, i64 3168}
!442 = !{!"long long", !379, i64 0}
!443 = !{!"double", !379, i64 0}
!444 = !{!"malloc_stats", !410, i64 0, !410, i64 8, !410, i64 16, !410, i64 24, !410, i64 32}
!445 = !{!"", !378, i64 0, !410, i64 8, !442, i64 16}
!446 = !{!"redisOpArray", !381, i64 0, !378, i64 8}
!447 = !DILocation(line: 79, column: 36, scope: !434)
!448 = !DILocation(line: 79, column: 5, scope: !434)
!449 = !DILocation(line: 83, column: 27, scope: !434)
!450 = !{!451, !381, i64 8}
!451 = !{!"list", !381, i64 0, !381, i64 8, !381, i64 16, !381, i64 24, !381, i64 32, !410, i64 40}
!452 = !DILocation(line: 83, column: 8, scope: !434)
!453 = !DILocation(line: 83, column: 25, scope: !434)
!454 = !{!455, !381, i64 520}
!455 = !{!"client", !410, i64 0, !378, i64 8, !381, i64 16, !381, i64 24, !381, i64 32, !410, i64 40, !381, i64 48, !410, i64 56, !378, i64 64, !381, i64 72, !381, i64 80, !381, i64 88, !378, i64 96, !378, i64 100, !410, i64 104, !381, i64 112, !442, i64 120, !410, i64 128, !410, i64 136, !410, i64 144, !410, i64 152, !378, i64 160, !378, i64 164, !378, i64 168, !378, i64 172, !378, i64 176, !410, i64 184, !410, i64 192, !381, i64 200, !442, i64 208, !442, i64 216, !442, i64 224, !442, i64 232, !442, i64 240, !379, i64 248, !378, i64 292, !379, i64 296, !378, i64 344, !456, i64 352, !378, i64 384, !457, i64 392, !442, i64 480, !381, i64 488, !381, i64 496, !381, i64 504, !381, i64 512, !381, i64 520, !378, i64 528, !379, i64 532}
!456 = !{!"multiState", !381, i64 0, !378, i64 8, !378, i64 12, !378, i64 16, !410, i64 24}
!457 = !{!"blockingState", !442, i64 0, !381, i64 8, !381, i64 16, !410, i64 24, !381, i64 32, !381, i64 40, !442, i64 48, !442, i64 56, !378, i64 64, !378, i64 68, !442, i64 72, !381, i64 80}
!458 = !DILocation(line: 84, column: 5, scope: !434)
!459 = !DILocation(line: 84, column: 19, scope: !434)
!460 = !{!455, !410, i64 0}
!461 = !DILocation(line: 84, column: 14, scope: !434)
!462 = !DILocation(line: 85, column: 22, scope: !434)
!463 = !{!441, !381, i64 560}
!464 = !DILocation(line: 85, column: 5, scope: !434)
!465 = !DILocation(line: 86, column: 1, scope: !434)
!466 = distinct !DISubprogram(name: "createClient", scope: !3, file: !3, line: 88, type: !467, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !469)
!467 = !DISubroutineType(types: !468)
!468 = !{!6, !18}
!469 = !{!470, !471, !472}
!470 = !DILocalVariable(name: "fd", arg: 1, scope: !466, file: !3, line: 88, type: !18)
!471 = !DILocalVariable(name: "c", scope: !466, file: !3, line: 92, type: !6)
!472 = !DILocalVariable(name: "client_id", scope: !466, file: !3, line: 113, type: !12)
!473 = !DILocation(line: 88, column: 26, scope: !466)
!474 = !DILocation(line: 92, column: 27, scope: !466)
!475 = !{!381, !381, i64 0}
!476 = !DILocalVariable(name: "a", arg: 1, scope: !477, file: !478, line: 157, type: !481)
!477 = distinct !DISubprogram(name: "uk_malloc", scope: !478, file: !478, line: 157, type: !479, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !536)
!478 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!479 = !DISubroutineType(types: !480)
!480 = !{!45, !481, !492}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !478, line: 77, size: 832, elements: !483)
!483 = !{!484, !487, !494, !499, !505, !507, !512, !513, !514, !519, !524, !529, !530, !531}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !482, file: !478, line: 79, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !478, line: 54, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !482, file: !478, line: 80, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !478, line: 56, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!45, !481, !492, !492}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !493, line: 58, baseType: !16)
!493 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!494 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !482, file: !478, line: 81, baseType: !495, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !478, line: 62, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!45, !481, !45, !492}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !482, file: !478, line: 82, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !478, line: 58, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!18, !481, !504, !492, !492}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !482, file: !478, line: 83, baseType: !506, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !478, line: 60, baseType: !489)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !482, file: !478, line: 84, baseType: !508, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !478, line: 64, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !481, !45}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !482, file: !478, line: 87, baseType: !508, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !482, file: !478, line: 88, baseType: !485, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !482, file: !478, line: 92, baseType: !515, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !478, line: 66, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!45, !481, !16}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !482, file: !478, line: 93, baseType: !520, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !478, line: 68, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !481, !45, !16}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !482, file: !478, line: 99, baseType: !525, size: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !478, line: 70, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!18, !481, !45, !492}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !482, file: !478, line: 100, baseType: !492, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !478, line: 103, baseType: !481, size: 64, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !482, file: !478, line: 104, baseType: !532, offset: 832)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, elements: !282)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !13, line: 20, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !15, line: 41, baseType: !535)
!535 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!536 = !{!476, !537}
!537 = !DILocalVariable(name: "size", arg: 2, scope: !477, file: !478, line: 157, type: !492)
!538 = !DILocation(line: 157, column: 48, scope: !477, inlinedAt: !539)
!539 = distinct !DILocation(line: 92, column: 17, scope: !466)
!540 = !DILocation(line: 157, column: 58, scope: !477, inlinedAt: !539)
!541 = !DILocation(line: 159, column: 6, scope: !542, inlinedAt: !539)
!542 = distinct !DILexicalBlock(scope: !477, file: !478, line: 159, column: 6)
!543 = !DILocation(line: 159, column: 6, scope: !477, inlinedAt: !539)
!544 = !{!"branch_weights", i32 1, i32 2000}
!545 = !DILocation(line: 160, column: 3, scope: !546, inlinedAt: !539)
!546 = distinct !DILexicalBlock(scope: !542, file: !478, line: 159, column: 20)
!547 = !DILocation(line: 160, column: 9, scope: !546, inlinedAt: !539)
!548 = !{!378, !378, i64 0}
!549 = !DILocation(line: 161, column: 3, scope: !546, inlinedAt: !539)
!550 = !DILocalVariable(name: "a", arg: 1, scope: !551, file: !478, line: 151, type: !481)
!551 = distinct !DISubprogram(name: "uk_do_malloc", scope: !478, file: !478, line: 151, type: !479, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !552)
!552 = !{!550, !553}
!553 = !DILocalVariable(name: "size", arg: 2, scope: !551, file: !478, line: 151, type: !492)
!554 = !DILocation(line: 151, column: 51, scope: !551, inlinedAt: !555)
!555 = distinct !DILocation(line: 163, column: 9, scope: !477, inlinedAt: !539)
!556 = !DILocation(line: 151, column: 61, scope: !551, inlinedAt: !555)
!557 = !DILocation(line: 154, column: 12, scope: !551, inlinedAt: !555)
!558 = !DILocation(line: 154, column: 9, scope: !551, inlinedAt: !555)
!559 = !DILocation(line: 163, column: 2, scope: !477, inlinedAt: !539)
!560 = !DILocation(line: 0, scope: !477, inlinedAt: !539)
!561 = !DILocation(line: 92, column: 17, scope: !466)
!562 = !DILocation(line: 92, column: 13, scope: !466)
!563 = !DILocation(line: 98, column: 12, scope: !564)
!564 = distinct !DILexicalBlock(scope: !466, file: !3, line: 98, column: 9)
!565 = !DILocation(line: 98, column: 9, scope: !466)
!566 = !DILocation(line: 99, column: 9, scope: !567)
!567 = distinct !DILexicalBlock(scope: !564, file: !3, line: 98, column: 19)
!568 = !DILocation(line: 100, column: 9, scope: !567)
!569 = !DILocation(line: 101, column: 20, scope: !570)
!570 = distinct !DILexicalBlock(scope: !567, file: !3, line: 101, column: 13)
!571 = !{!441, !378, i64 1736}
!572 = !DILocation(line: 101, column: 13, scope: !570)
!573 = !DILocation(line: 101, column: 13, scope: !567)
!574 = !DILocation(line: 102, column: 13, scope: !570)
!575 = !DILocation(line: 103, column: 38, scope: !576)
!576 = distinct !DILexicalBlock(scope: !567, file: !3, line: 103, column: 13)
!577 = !{!441, !381, i64 72}
!578 = !DILocation(line: 103, column: 13, scope: !576)
!579 = !DILocation(line: 104, column: 37, scope: !576)
!580 = !DILocation(line: 103, column: 13, scope: !567)
!581 = !DILocation(line: 106, column: 13, scope: !582)
!582 = distinct !DILexicalBlock(scope: !576, file: !3, line: 105, column: 9)
!583 = !DILocation(line: 107, column: 13, scope: !582)
!584 = !DILocation(line: 108, column: 13, scope: !582)
!585 = !DILocation(line: 112, column: 5, scope: !466)
!586 = !DILocation(line: 114, column: 5, scope: !587)
!587 = distinct !DILexicalBlock(scope: !466, file: !3, line: 114, column: 5)
!588 = !DILocation(line: 113, column: 14, scope: !466)
!589 = !DILocation(line: 115, column: 8, scope: !466)
!590 = !DILocation(line: 115, column: 11, scope: !466)
!591 = !DILocation(line: 116, column: 8, scope: !466)
!592 = !DILocation(line: 116, column: 11, scope: !466)
!593 = !{!455, !378, i64 8}
!594 = !DILocation(line: 117, column: 8, scope: !466)
!595 = !DILocation(line: 117, column: 13, scope: !466)
!596 = !{!455, !381, i64 24}
!597 = !DILocation(line: 118, column: 8, scope: !466)
!598 = !DILocation(line: 118, column: 15, scope: !466)
!599 = !{!455, !378, i64 528}
!600 = !DILocation(line: 119, column: 8, scope: !466)
!601 = !DILocation(line: 119, column: 15, scope: !466)
!602 = !{!455, !410, i64 40}
!603 = !DILocation(line: 120, column: 19, scope: !466)
!604 = !DILocation(line: 120, column: 8, scope: !466)
!605 = !DILocation(line: 120, column: 17, scope: !466)
!606 = !{!455, !381, i64 32}
!607 = !DILocation(line: 121, column: 27, scope: !466)
!608 = !DILocation(line: 121, column: 8, scope: !466)
!609 = !DILocation(line: 121, column: 25, scope: !466)
!610 = !{!455, !381, i64 48}
!611 = !DILocation(line: 122, column: 8, scope: !466)
!612 = !DILocation(line: 122, column: 22, scope: !466)
!613 = !{!455, !410, i64 56}
!614 = !DILocation(line: 123, column: 8, scope: !466)
!615 = !DILocation(line: 123, column: 16, scope: !466)
!616 = !{!455, !378, i64 96}
!617 = !DILocation(line: 124, column: 8, scope: !466)
!618 = !DILocation(line: 124, column: 13, scope: !466)
!619 = !{!455, !378, i64 64}
!620 = !DILocation(line: 125, column: 8, scope: !466)
!621 = !DILocation(line: 125, column: 13, scope: !466)
!622 = !{!455, !381, i64 72}
!623 = !DILocation(line: 126, column: 8, scope: !466)
!624 = !DILocation(line: 126, column: 12, scope: !466)
!625 = !DILocation(line: 127, column: 8, scope: !466)
!626 = !DILocation(line: 127, column: 21, scope: !466)
!627 = !{!455, !378, i64 100}
!628 = !DILocation(line: 128, column: 8, scope: !466)
!629 = !DILocation(line: 128, column: 16, scope: !466)
!630 = !{!455, !410, i64 104}
!631 = !DILocation(line: 129, column: 8, scope: !466)
!632 = !DILocation(line: 129, column: 16, scope: !466)
!633 = !{!455, !410, i64 128}
!634 = !DILocation(line: 130, column: 8, scope: !466)
!635 = !DILocation(line: 131, column: 44, scope: !466)
!636 = !{!441, !410, i64 2872}
!637 = !DILocation(line: 131, column: 19, scope: !466)
!638 = !DILocation(line: 131, column: 35, scope: !466)
!639 = !{!455, !410, i64 144}
!640 = !DILocation(line: 131, column: 8, scope: !466)
!641 = !DILocation(line: 131, column: 14, scope: !466)
!642 = !{!455, !410, i64 136}
!643 = !DILocation(line: 130, column: 14, scope: !466)
!644 = !DILocation(line: 136, column: 8, scope: !466)
!645 = !DILocation(line: 136, column: 21, scope: !466)
!646 = !{!442, !442, i64 0}
!647 = !DILocation(line: 137, column: 8, scope: !466)
!648 = !DILocation(line: 137, column: 21, scope: !466)
!649 = !DILocation(line: 139, column: 8, scope: !466)
!650 = !DILocation(line: 139, column: 29, scope: !466)
!651 = !{!455, !378, i64 292}
!652 = !DILocation(line: 140, column: 8, scope: !466)
!653 = !DILocation(line: 140, column: 20, scope: !466)
!654 = !{!379, !379, i64 0}
!655 = !DILocation(line: 141, column: 8, scope: !466)
!656 = !DILocation(line: 141, column: 19, scope: !466)
!657 = !{!455, !378, i64 344}
!658 = !DILocation(line: 142, column: 16, scope: !466)
!659 = !DILocation(line: 142, column: 8, scope: !466)
!660 = !DILocation(line: 142, column: 14, scope: !466)
!661 = !{!455, !381, i64 112}
!662 = !DILocation(line: 143, column: 8, scope: !466)
!663 = !DILocation(line: 143, column: 20, scope: !466)
!664 = !{!455, !442, i64 120}
!665 = !DILocation(line: 144, column: 8, scope: !466)
!666 = !DILocation(line: 144, column: 37, scope: !466)
!667 = !{!455, !410, i64 152}
!668 = !DILocation(line: 145, column: 5, scope: !466)
!669 = !{!451, !381, i64 24}
!670 = !DILocation(line: 146, column: 5, scope: !466)
!671 = !{!451, !381, i64 16}
!672 = !DILocation(line: 147, column: 8, scope: !466)
!673 = !DILocation(line: 147, column: 14, scope: !466)
!674 = !{!455, !378, i64 384}
!675 = !DILocation(line: 148, column: 8, scope: !466)
!676 = !DILocation(line: 148, column: 13, scope: !466)
!677 = !DILocation(line: 148, column: 21, scope: !466)
!678 = !{!455, !442, i64 392}
!679 = !DILocation(line: 149, column: 20, scope: !466)
!680 = !DILocation(line: 149, column: 13, scope: !466)
!681 = !DILocation(line: 149, column: 18, scope: !466)
!682 = !{!455, !381, i64 400}
!683 = !DILocation(line: 150, column: 13, scope: !466)
!684 = !DILocation(line: 150, column: 20, scope: !466)
!685 = !{!455, !381, i64 408}
!686 = !DILocation(line: 151, column: 13, scope: !466)
!687 = !DILocation(line: 151, column: 25, scope: !466)
!688 = !DILocation(line: 153, column: 13, scope: !466)
!689 = !DILocation(line: 153, column: 31, scope: !466)
!690 = !{!455, !378, i64 456}
!691 = !DILocation(line: 154, column: 13, scope: !466)
!692 = !DILocation(line: 154, column: 25, scope: !466)
!693 = !{!455, !378, i64 460}
!694 = !DILocation(line: 155, column: 13, scope: !466)
!695 = !DILocation(line: 155, column: 24, scope: !466)
!696 = !{!455, !442, i64 464}
!697 = !DILocation(line: 156, column: 8, scope: !466)
!698 = !DILocation(line: 156, column: 13, scope: !466)
!699 = !{!455, !442, i64 480}
!700 = !DILocation(line: 157, column: 23, scope: !466)
!701 = !DILocation(line: 157, column: 8, scope: !466)
!702 = !DILocation(line: 157, column: 21, scope: !466)
!703 = !{!455, !381, i64 488}
!704 = !DILocation(line: 158, column: 26, scope: !466)
!705 = !DILocation(line: 158, column: 8, scope: !466)
!706 = !DILocation(line: 158, column: 24, scope: !466)
!707 = !{!455, !381, i64 496}
!708 = !DILocation(line: 159, column: 26, scope: !466)
!709 = !DILocation(line: 159, column: 8, scope: !466)
!710 = !DILocation(line: 159, column: 24, scope: !466)
!711 = !{!455, !381, i64 504}
!712 = !DILocation(line: 160, column: 8, scope: !466)
!713 = !DILocation(line: 160, column: 15, scope: !466)
!714 = !{!455, !381, i64 512}
!715 = !DILocation(line: 161, column: 8, scope: !466)
!716 = !DILocation(line: 161, column: 25, scope: !466)
!717 = !DILocation(line: 162, column: 5, scope: !466)
!718 = !DILocation(line: 163, column: 5, scope: !466)
!719 = !{!451, !381, i64 32}
!720 = !DILocation(line: 164, column: 9, scope: !466)
!721 = !DILocation(line: 78, column: 25, scope: !434, inlinedAt: !722)
!722 = distinct !DILocation(line: 164, column: 19, scope: !723)
!723 = distinct !DILexicalBlock(scope: !466, file: !3, line: 164, column: 9)
!724 = !DILocation(line: 79, column: 28, scope: !434, inlinedAt: !722)
!725 = !DILocation(line: 79, column: 5, scope: !434, inlinedAt: !722)
!726 = !DILocation(line: 83, column: 27, scope: !434, inlinedAt: !722)
!727 = !DILocation(line: 83, column: 25, scope: !434, inlinedAt: !722)
!728 = !DILocation(line: 84, column: 5, scope: !434, inlinedAt: !722)
!729 = !DILocation(line: 84, column: 19, scope: !434, inlinedAt: !722)
!730 = !DILocation(line: 84, column: 14, scope: !434, inlinedAt: !722)
!731 = !DILocation(line: 85, column: 22, scope: !434, inlinedAt: !722)
!732 = !DILocation(line: 85, column: 5, scope: !434, inlinedAt: !722)
!733 = !DILocation(line: 86, column: 1, scope: !434, inlinedAt: !722)
!734 = !DILocation(line: 164, column: 19, scope: !723)
!735 = !DILocation(line: 165, column: 5, scope: !466)
!736 = !DILocation(line: 0, scope: !466)
!737 = !DILocation(line: 167, column: 1, scope: !466)
!738 = distinct !DISubprogram(name: "readQueryFromClient", scope: !3, file: !3, line: 1524, type: !739, isLocal: false, isDefinition: true, scopeLine: 1524, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !801)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !741, !18, !45, !18}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !743, line: 109, baseType: !744)
!743 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/ae.h", directory: "/root/.unikraft/apps/redis/build")
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !743, line: 97, size: 640, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !764, !771, !793, !794, !795, !800}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !744, file: !743, line: 98, baseType: !18, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !744, file: !743, line: 99, baseType: !18, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !744, file: !743, line: 100, baseType: !95, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !744, file: !743, line: 101, baseType: !182, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !744, file: !743, line: 102, baseType: !751, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !743, line: 76, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !743, line: 71, size: 256, elements: !754)
!754 = !{!755, !756, !762, !763}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !753, file: !743, line: 72, baseType: !18, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !753, file: !743, line: 73, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !743, line: 65, baseType: !759)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !761, !18, !45, !18}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !753, file: !743, line: 74, baseType: !757, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !753, file: !743, line: 75, baseType: !45, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !744, file: !743, line: 103, baseType: !765, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !743, line: 94, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !743, line: 91, size: 64, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !767, file: !743, line: 92, baseType: !18, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !767, file: !743, line: 93, baseType: !18, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !744, file: !743, line: 104, baseType: !772, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !743, line: 88, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !743, line: 79, size: 512, elements: !775)
!775 = !{!776, !777, !778, !779, !784, !789, !790, !792}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !774, file: !743, line: 80, baseType: !95, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !774, file: !743, line: 81, baseType: !77, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !774, file: !743, line: 82, baseType: !77, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !774, file: !743, line: 83, baseType: !780, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !743, line: 66, baseType: !782)
!782 = !DISubroutineType(types: !783)
!783 = !{!18, !761, !95, !45}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !774, file: !743, line: 84, baseType: !785, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !743, line: 67, baseType: !787)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !761, !45}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !774, file: !743, line: 85, baseType: !45, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !774, file: !743, line: 86, baseType: !791, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !774, file: !743, line: 87, baseType: !791, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !744, file: !743, line: 105, baseType: !18, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !744, file: !743, line: 106, baseType: !45, size: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !744, file: !743, line: 107, baseType: !796, size: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !743, line: 68, baseType: !798)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !761}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !744, file: !743, line: 108, baseType: !796, size: 64, offset: 576)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !813, !816}
!802 = !DILocalVariable(name: "el", arg: 1, scope: !738, file: !3, line: 1524, type: !741)
!803 = !DILocalVariable(name: "fd", arg: 2, scope: !738, file: !3, line: 1524, type: !18)
!804 = !DILocalVariable(name: "privdata", arg: 3, scope: !738, file: !3, line: 1524, type: !45)
!805 = !DILocalVariable(name: "mask", arg: 4, scope: !738, file: !3, line: 1524, type: !18)
!806 = !DILocalVariable(name: "c", scope: !738, file: !3, line: 1525, type: !6)
!807 = !DILocalVariable(name: "nread", scope: !738, file: !3, line: 1526, type: !18)
!808 = !DILocalVariable(name: "readlen", scope: !738, file: !3, line: 1526, type: !18)
!809 = !DILocalVariable(name: "qblen", scope: !738, file: !3, line: 1527, type: !142)
!810 = !DILocalVariable(name: "remaining", scope: !811, file: !3, line: 1541, type: !270)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 1540, column: 5)
!812 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1538, column: 9)
!813 = !DILocalVariable(name: "ci", scope: !814, file: !3, line: 1577, type: !137)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 1576, column: 63)
!815 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1576, column: 9)
!816 = !DILocalVariable(name: "bytes", scope: !814, file: !3, line: 1577, type: !137)
!817 = !DILocation(line: 1524, column: 39, scope: !738)
!818 = !DILocation(line: 1524, column: 47, scope: !738)
!819 = !DILocation(line: 1524, column: 57, scope: !738)
!820 = !DILocation(line: 1524, column: 71, scope: !738)
!821 = !DILocation(line: 1525, column: 17, scope: !738)
!822 = !DILocation(line: 1525, column: 13, scope: !738)
!823 = !DILocation(line: 1526, column: 16, scope: !738)
!824 = !DILocation(line: 1538, column: 12, scope: !812)
!825 = !DILocation(line: 1538, column: 20, scope: !812)
!826 = !DILocation(line: 1538, column: 43, scope: !812)
!827 = !DILocation(line: 1538, column: 49, scope: !812)
!828 = !DILocation(line: 1538, column: 46, scope: !812)
!829 = !DILocation(line: 1538, column: 62, scope: !812)
!830 = !DILocation(line: 1538, column: 68, scope: !812)
!831 = !DILocation(line: 1539, column: 23, scope: !812)
!832 = !DILocation(line: 1539, column: 9, scope: !812)
!833 = !DILocation(line: 1541, column: 48, scope: !811)
!834 = !DILocation(line: 1541, column: 62, scope: !811)
!835 = !DILocalVariable(name: "s", arg: 1, scope: !836, file: !138, line: 87, type: !839)
!836 = distinct !DISubprogram(name: "sdslen", scope: !138, file: !138, line: 87, type: !837, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !840)
!837 = !DISubroutineType(types: !838)
!838 = !{!142, !839}
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!840 = !{!835, !841}
!841 = !DILocalVariable(name: "flags", scope: !836, file: !138, line: 88, type: !269)
!842 = !DILocation(line: 87, column: 39, scope: !836, inlinedAt: !843)
!843 = distinct !DILocation(line: 1541, column: 52, scope: !811)
!844 = !DILocation(line: 88, column: 27, scope: !836, inlinedAt: !843)
!845 = !DILocation(line: 88, column: 19, scope: !836, inlinedAt: !843)
!846 = !DILocation(line: 89, column: 5, scope: !836, inlinedAt: !843)
!847 = !DILocation(line: 91, column: 20, scope: !848, inlinedAt: !843)
!848 = distinct !DILexicalBlock(scope: !836, file: !138, line: 89, column: 33)
!849 = !DILocation(line: 91, column: 13, scope: !848, inlinedAt: !843)
!850 = !DILocation(line: 93, column: 20, scope: !848, inlinedAt: !843)
!851 = !DILocation(line: 93, column: 34, scope: !848, inlinedAt: !843)
!852 = !DILocation(line: 93, column: 13, scope: !848, inlinedAt: !843)
!853 = !DILocation(line: 95, column: 20, scope: !848, inlinedAt: !843)
!854 = !DILocation(line: 95, column: 35, scope: !848, inlinedAt: !843)
!855 = !{!856, !856, i64 0}
!856 = !{!"short", !379, i64 0}
!857 = !DILocation(line: 95, column: 13, scope: !848, inlinedAt: !843)
!858 = !DILocation(line: 97, column: 20, scope: !848, inlinedAt: !843)
!859 = !DILocation(line: 97, column: 35, scope: !848, inlinedAt: !843)
!860 = !DILocation(line: 97, column: 13, scope: !848, inlinedAt: !843)
!861 = !DILocation(line: 99, column: 20, scope: !848, inlinedAt: !843)
!862 = !DILocation(line: 99, column: 35, scope: !848, inlinedAt: !843)
!863 = !DILocation(line: 99, column: 13, scope: !848, inlinedAt: !843)
!864 = !DILocation(line: 0, scope: !848, inlinedAt: !843)
!865 = !DILocation(line: 1541, column: 51, scope: !811)
!866 = !DILocation(line: 1541, column: 17, scope: !811)
!867 = !DILocation(line: 1545, column: 27, scope: !868)
!868 = distinct !DILexicalBlock(scope: !811, file: !3, line: 1545, column: 13)
!869 = !DILocation(line: 1548, column: 23, scope: !738)
!870 = !DILocation(line: 87, column: 39, scope: !836, inlinedAt: !871)
!871 = distinct !DILocation(line: 1548, column: 13, scope: !738)
!872 = !DILocation(line: 88, column: 27, scope: !836, inlinedAt: !871)
!873 = !DILocation(line: 88, column: 19, scope: !836, inlinedAt: !871)
!874 = !DILocation(line: 89, column: 5, scope: !836, inlinedAt: !871)
!875 = !DILocation(line: 91, column: 20, scope: !848, inlinedAt: !871)
!876 = !DILocation(line: 91, column: 13, scope: !848, inlinedAt: !871)
!877 = !DILocation(line: 93, column: 20, scope: !848, inlinedAt: !871)
!878 = !DILocation(line: 93, column: 34, scope: !848, inlinedAt: !871)
!879 = !DILocation(line: 93, column: 13, scope: !848, inlinedAt: !871)
!880 = !DILocation(line: 95, column: 20, scope: !848, inlinedAt: !871)
!881 = !DILocation(line: 95, column: 35, scope: !848, inlinedAt: !871)
!882 = !DILocation(line: 95, column: 13, scope: !848, inlinedAt: !871)
!883 = !DILocation(line: 97, column: 20, scope: !848, inlinedAt: !871)
!884 = !DILocation(line: 97, column: 35, scope: !848, inlinedAt: !871)
!885 = !DILocation(line: 97, column: 13, scope: !848, inlinedAt: !871)
!886 = !DILocation(line: 99, column: 20, scope: !848, inlinedAt: !871)
!887 = !DILocation(line: 99, column: 35, scope: !848, inlinedAt: !871)
!888 = !DILocation(line: 99, column: 13, scope: !848, inlinedAt: !871)
!889 = !DILocation(line: 0, scope: !848, inlinedAt: !871)
!890 = !DILocation(line: 1527, column: 12, scope: !738)
!891 = !DILocation(line: 1549, column: 12, scope: !892)
!892 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1549, column: 9)
!893 = !DILocation(line: 1549, column: 26, scope: !892)
!894 = !DILocation(line: 1549, column: 9, scope: !738)
!895 = !DILocation(line: 1549, column: 52, scope: !892)
!896 = !DILocation(line: 1549, column: 35, scope: !892)
!897 = !DILocation(line: 1550, column: 19, scope: !738)
!898 = !DILocation(line: 1550, column: 17, scope: !738)
!899 = !DILocation(line: 1551, column: 33, scope: !738)
!900 = !DILocation(line: 1551, column: 13, scope: !738)
!901 = !DILocation(line: 1526, column: 9, scope: !738)
!902 = !DILocation(line: 1552, column: 9, scope: !738)
!903 = !DILocation(line: 1553, column: 13, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 1553, column: 13)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 1552, column: 22)
!906 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1552, column: 9)
!907 = !DILocation(line: 1553, column: 19, scope: !904)
!908 = !DILocation(line: 1553, column: 13, scope: !905)
!909 = !DILocation(line: 1556, column: 70, scope: !910)
!910 = distinct !DILexicalBlock(scope: !904, file: !3, line: 1555, column: 16)
!911 = !DILocation(line: 1556, column: 61, scope: !910)
!912 = !DILocation(line: 1556, column: 13, scope: !910)
!913 = !DILocation(line: 1557, column: 13, scope: !910)
!914 = !DILocation(line: 1558, column: 13, scope: !910)
!915 = !DILocation(line: 1561, column: 9, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 1560, column: 28)
!917 = distinct !DILexicalBlock(scope: !906, file: !3, line: 1560, column: 16)
!918 = !DILocation(line: 1562, column: 9, scope: !916)
!919 = !DILocation(line: 1563, column: 9, scope: !916)
!920 = !DILocation(line: 1564, column: 19, scope: !921)
!921 = distinct !DILexicalBlock(scope: !917, file: !3, line: 1564, column: 16)
!922 = !{!455, !378, i64 160}
!923 = !DILocation(line: 1564, column: 25, scope: !921)
!924 = !DILocation(line: 1564, column: 16, scope: !917)
!925 = !DILocation(line: 1572, column: 28, scope: !738)
!926 = !DILocation(line: 1568, column: 44, scope: !927)
!927 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1564, column: 42)
!928 = !DILocation(line: 1569, column: 44, scope: !927)
!929 = !DILocation(line: 1569, column: 52, scope: !927)
!930 = !DILocation(line: 1569, column: 59, scope: !927)
!931 = !DILocation(line: 1568, column: 31, scope: !927)
!932 = !DILocation(line: 1568, column: 29, scope: !927)
!933 = !DILocation(line: 1570, column: 5, scope: !927)
!934 = !DILocation(line: 1572, column: 19, scope: !738)
!935 = !DILocation(line: 1572, column: 5, scope: !738)
!936 = !DILocation(line: 1573, column: 33, scope: !738)
!937 = !DILocation(line: 1573, column: 8, scope: !738)
!938 = !DILocation(line: 1573, column: 24, scope: !738)
!939 = !DILocation(line: 1574, column: 12, scope: !940)
!940 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1574, column: 9)
!941 = !DILocation(line: 1574, column: 18, scope: !940)
!942 = !DILocation(line: 1574, column: 9, scope: !738)
!943 = !DILocation(line: 1574, column: 38, scope: !940)
!944 = !DILocation(line: 1574, column: 51, scope: !940)
!945 = !{!455, !442, i64 208}
!946 = !DILocation(line: 1574, column: 35, scope: !940)
!947 = !DILocation(line: 1575, column: 33, scope: !738)
!948 = !{!441, !442, i64 1240}
!949 = !DILocation(line: 1576, column: 19, scope: !815)
!950 = !DILocation(line: 87, column: 39, scope: !836, inlinedAt: !951)
!951 = distinct !DILocation(line: 1576, column: 9, scope: !815)
!952 = !DILocation(line: 88, column: 27, scope: !836, inlinedAt: !951)
!953 = !DILocation(line: 88, column: 19, scope: !836, inlinedAt: !951)
!954 = !DILocation(line: 89, column: 5, scope: !836, inlinedAt: !951)
!955 = !DILocation(line: 91, column: 20, scope: !848, inlinedAt: !951)
!956 = !DILocation(line: 91, column: 13, scope: !848, inlinedAt: !951)
!957 = !DILocation(line: 93, column: 20, scope: !848, inlinedAt: !951)
!958 = !DILocation(line: 93, column: 34, scope: !848, inlinedAt: !951)
!959 = !DILocation(line: 93, column: 13, scope: !848, inlinedAt: !951)
!960 = !DILocation(line: 95, column: 20, scope: !848, inlinedAt: !951)
!961 = !DILocation(line: 95, column: 35, scope: !848, inlinedAt: !951)
!962 = !DILocation(line: 95, column: 13, scope: !848, inlinedAt: !951)
!963 = !DILocation(line: 97, column: 20, scope: !848, inlinedAt: !951)
!964 = !DILocation(line: 97, column: 35, scope: !848, inlinedAt: !951)
!965 = !DILocation(line: 97, column: 13, scope: !848, inlinedAt: !951)
!966 = !DILocation(line: 99, column: 20, scope: !848, inlinedAt: !951)
!967 = !DILocation(line: 99, column: 35, scope: !848, inlinedAt: !951)
!968 = !DILocation(line: 99, column: 13, scope: !848, inlinedAt: !951)
!969 = !DILocation(line: 0, scope: !848, inlinedAt: !951)
!970 = !DILocation(line: 1576, column: 38, scope: !815)
!971 = !{!441, !410, i64 1784}
!972 = !DILocation(line: 1576, column: 29, scope: !815)
!973 = !DILocation(line: 1576, column: 9, scope: !738)
!974 = !DILocation(line: 1577, column: 38, scope: !814)
!975 = !DILocation(line: 1577, column: 18, scope: !814)
!976 = !DILocation(line: 1577, column: 13, scope: !814)
!977 = !DILocation(line: 1577, column: 61, scope: !814)
!978 = !DILocation(line: 1577, column: 53, scope: !814)
!979 = !DILocation(line: 1579, column: 37, scope: !814)
!980 = !DILocation(line: 1579, column: 17, scope: !814)
!981 = !DILocation(line: 1580, column: 9, scope: !814)
!982 = !DILocation(line: 1581, column: 9, scope: !814)
!983 = !DILocation(line: 1582, column: 9, scope: !814)
!984 = !DILocation(line: 1583, column: 9, scope: !814)
!985 = !DILocalVariable(name: "c", arg: 1, scope: !986, file: !3, line: 1509, type: !6)
!986 = distinct !DISubprogram(name: "processInputBufferAndReplicate", scope: !3, file: !3, line: 1509, type: !4, isLocal: false, isDefinition: true, scopeLine: 1509, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !987)
!987 = !{!985, !988, !991}
!988 = !DILocalVariable(name: "prev_offset", scope: !989, file: !3, line: 1513, type: !142)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1512, column: 12)
!990 = distinct !DILexicalBlock(scope: !986, file: !3, line: 1510, column: 9)
!991 = !DILocalVariable(name: "applied", scope: !989, file: !3, line: 1515, type: !142)
!992 = !DILocation(line: 1509, column: 45, scope: !986, inlinedAt: !993)
!993 = distinct !DILocation(line: 1593, column: 5, scope: !738)
!994 = !DILocation(line: 1510, column: 9, scope: !986, inlinedAt: !993)
!995 = !DILocation(line: 1511, column: 9, scope: !996, inlinedAt: !993)
!996 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1510, column: 38)
!997 = !DILocation(line: 1512, column: 5, scope: !996, inlinedAt: !993)
!998 = !DILocation(line: 1513, column: 33, scope: !989, inlinedAt: !993)
!999 = !{!455, !442, i64 216}
!1000 = !DILocation(line: 1513, column: 16, scope: !989, inlinedAt: !993)
!1001 = !DILocation(line: 1514, column: 9, scope: !989, inlinedAt: !993)
!1002 = !DILocation(line: 1515, column: 29, scope: !989, inlinedAt: !993)
!1003 = !DILocation(line: 1515, column: 37, scope: !989, inlinedAt: !993)
!1004 = !DILocation(line: 1515, column: 16, scope: !989, inlinedAt: !993)
!1005 = !DILocation(line: 1516, column: 13, scope: !1006, inlinedAt: !993)
!1006 = distinct !DILexicalBlock(scope: !989, file: !3, line: 1516, column: 13)
!1007 = !DILocation(line: 1516, column: 13, scope: !989, inlinedAt: !993)
!1008 = !DILocation(line: 1517, column: 58, scope: !1009, inlinedAt: !993)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1516, column: 22)
!1010 = !{!441, !381, i64 536}
!1011 = !DILocation(line: 1518, column: 24, scope: !1009, inlinedAt: !993)
!1012 = !DILocation(line: 1517, column: 13, scope: !1009, inlinedAt: !993)
!1013 = !DILocation(line: 1519, column: 25, scope: !1009, inlinedAt: !993)
!1014 = !DILocation(line: 1519, column: 13, scope: !1009, inlinedAt: !993)
!1015 = !DILocation(line: 1520, column: 9, scope: !1009, inlinedAt: !993)
!1016 = !DILocation(line: 1594, column: 1, scope: !738)
!1017 = distinct !DISubprogram(name: "clientInstallWriteHandler", scope: !3, file: !3, line: 176, type: !4, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1018)
!1018 = !{!1019}
!1019 = !DILocalVariable(name: "c", arg: 1, scope: !1017, file: !3, line: 176, type: !6)
!1020 = !DILocation(line: 176, column: 40, scope: !1017)
!1021 = !DILocation(line: 180, column: 14, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 180, column: 9)
!1023 = !DILocation(line: 180, column: 20, scope: !1022)
!1024 = !DILocation(line: 180, column: 44, scope: !1022)
!1025 = !DILocation(line: 181, column: 13, scope: !1022)
!1026 = !{!455, !378, i64 168}
!1027 = !DILocation(line: 181, column: 42, scope: !1022)
!1028 = !DILocation(line: 182, column: 53, scope: !1022)
!1029 = !{!455, !378, i64 172}
!1030 = !DILocation(line: 182, column: 50, scope: !1022)
!1031 = !DILocation(line: 180, column: 9, scope: !1017)
!1032 = !DILocation(line: 190, column: 18, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 183, column: 5)
!1034 = !DILocation(line: 191, column: 32, scope: !1033)
!1035 = !{!441, !381, i64 528}
!1036 = !DILocation(line: 191, column: 54, scope: !1033)
!1037 = !DILocation(line: 191, column: 9, scope: !1033)
!1038 = !DILocation(line: 192, column: 5, scope: !1033)
!1039 = !DILocation(line: 193, column: 1, scope: !1017)
!1040 = distinct !DISubprogram(name: "prepareClientToWrite", scope: !3, file: !3, line: 217, type: !1041, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1043)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!18, !6}
!1043 = !{!1044}
!1044 = !DILocalVariable(name: "c", arg: 1, scope: !1040, file: !3, line: 217, type: !6)
!1045 = !DILocation(line: 217, column: 34, scope: !1040)
!1046 = !DILocation(line: 220, column: 12, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 220, column: 9)
!1048 = !DILocation(line: 220, column: 18, scope: !1047)
!1049 = !DILocation(line: 220, column: 9, scope: !1040)
!1050 = !DILocation(line: 223, column: 18, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 223, column: 9)
!1052 = !DILocation(line: 227, column: 36, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 227, column: 9)
!1054 = !DILocation(line: 223, column: 9, scope: !1040)
!1055 = !DILocation(line: 230, column: 12, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 230, column: 9)
!1057 = !DILocation(line: 230, column: 15, scope: !1056)
!1058 = !DILocation(line: 230, column: 9, scope: !1040)
!1059 = !DILocalVariable(name: "c", arg: 1, scope: !1060, file: !3, line: 664, type: !6)
!1060 = distinct !DISubprogram(name: "clientHasPendingReplies", scope: !3, file: !3, line: 664, type: !1041, isLocal: false, isDefinition: true, scopeLine: 664, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1061)
!1061 = !{!1059}
!1062 = !DILocation(line: 664, column: 37, scope: !1060, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 234, column: 10, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 234, column: 9)
!1065 = !DILocation(line: 665, column: 15, scope: !1060, inlinedAt: !1063)
!1066 = !DILocation(line: 665, column: 12, scope: !1060, inlinedAt: !1063)
!1067 = !DILocation(line: 665, column: 22, scope: !1060, inlinedAt: !1063)
!1068 = !DILocation(line: 665, column: 25, scope: !1060, inlinedAt: !1063)
!1069 = !{!451, !410, i64 40}
!1070 = !DILocation(line: 180, column: 20, scope: !1022, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 234, column: 38, scope: !1064)
!1072 = !DILocation(line: 234, column: 9, scope: !1040)
!1073 = !DILocation(line: 176, column: 40, scope: !1017, inlinedAt: !1071)
!1074 = !DILocation(line: 181, column: 13, scope: !1022, inlinedAt: !1071)
!1075 = !DILocation(line: 181, column: 42, scope: !1022, inlinedAt: !1071)
!1076 = !DILocation(line: 182, column: 53, scope: !1022, inlinedAt: !1071)
!1077 = !DILocation(line: 182, column: 50, scope: !1022, inlinedAt: !1071)
!1078 = !DILocation(line: 180, column: 9, scope: !1017, inlinedAt: !1071)
!1079 = !DILocation(line: 190, column: 18, scope: !1033, inlinedAt: !1071)
!1080 = !DILocation(line: 191, column: 32, scope: !1033, inlinedAt: !1071)
!1081 = !DILocation(line: 191, column: 54, scope: !1033, inlinedAt: !1071)
!1082 = !DILocation(line: 191, column: 9, scope: !1033, inlinedAt: !1071)
!1083 = !DILocation(line: 192, column: 5, scope: !1033, inlinedAt: !1071)
!1084 = !DILocation(line: 0, scope: !1053)
!1085 = !DILocation(line: 238, column: 1, scope: !1040)
!1086 = !DILocation(line: 664, column: 37, scope: !1060)
!1087 = !DILocation(line: 665, column: 15, scope: !1060)
!1088 = !DILocation(line: 665, column: 12, scope: !1060)
!1089 = !DILocation(line: 665, column: 22, scope: !1060)
!1090 = !DILocation(line: 665, column: 25, scope: !1060)
!1091 = !DILocation(line: 665, column: 5, scope: !1060)
!1092 = distinct !DISubprogram(name: "_addReplyToBuffer", scope: !3, file: !3, line: 244, type: !1093, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!18, !6, !317, !142}
!1095 = !{!1096, !1097, !1098, !1099}
!1096 = !DILocalVariable(name: "c", arg: 1, scope: !1092, file: !3, line: 244, type: !6)
!1097 = !DILocalVariable(name: "s", arg: 2, scope: !1092, file: !3, line: 244, type: !317)
!1098 = !DILocalVariable(name: "len", arg: 3, scope: !1092, file: !3, line: 244, type: !142)
!1099 = !DILocalVariable(name: "available", scope: !1092, file: !3, line: 245, type: !142)
!1100 = !DILocation(line: 244, column: 31, scope: !1092)
!1101 = !DILocation(line: 244, column: 46, scope: !1092)
!1102 = !DILocation(line: 244, column: 56, scope: !1092)
!1103 = !DILocation(line: 245, column: 42, scope: !1092)
!1104 = !DILocation(line: 245, column: 39, scope: !1092)
!1105 = !DILocation(line: 247, column: 12, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 247, column: 9)
!1107 = !DILocation(line: 247, column: 18, scope: !1106)
!1108 = !DILocation(line: 247, column: 9, scope: !1092)
!1109 = !DILocation(line: 245, column: 38, scope: !1092)
!1110 = !DILocation(line: 245, column: 12, scope: !1092)
!1111 = !DILocation(line: 251, column: 9, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 251, column: 9)
!1113 = !DILocation(line: 251, column: 30, scope: !1112)
!1114 = !DILocation(line: 254, column: 13, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 254, column: 9)
!1116 = !DILocation(line: 251, column: 9, scope: !1092)
!1117 = !DILocation(line: 256, column: 18, scope: !1092)
!1118 = !DILocation(line: 256, column: 5, scope: !1092)
!1119 = !DILocation(line: 257, column: 14, scope: !1092)
!1120 = !DILocation(line: 258, column: 5, scope: !1092)
!1121 = !DILocation(line: 0, scope: !1092)
!1122 = !DILocation(line: 259, column: 1, scope: !1092)
!1123 = distinct !DISubprogram(name: "_addReplyStringToList", scope: !3, file: !3, line: 261, type: !1124, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1126)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !6, !317, !142}
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1135, !1136}
!1127 = !DILocalVariable(name: "c", arg: 1, scope: !1123, file: !3, line: 261, type: !6)
!1128 = !DILocalVariable(name: "s", arg: 2, scope: !1123, file: !3, line: 261, type: !317)
!1129 = !DILocalVariable(name: "len", arg: 3, scope: !1123, file: !3, line: 261, type: !142)
!1130 = !DILocalVariable(name: "ln", scope: !1123, file: !3, line: 264, type: !103)
!1131 = !DILocalVariable(name: "tail", scope: !1123, file: !3, line: 265, type: !398)
!1132 = !DILocalVariable(name: "avail", scope: !1133, file: !3, line: 275, type: !142)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 272, column: 15)
!1134 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 272, column: 9)
!1135 = !DILocalVariable(name: "copy", scope: !1133, file: !3, line: 276, type: !142)
!1136 = !DILocalVariable(name: "size", scope: !1137, file: !3, line: 285, type: !142)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 282, column: 14)
!1138 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 282, column: 9)
!1139 = !DILocation(line: 261, column: 36, scope: !1123)
!1140 = !DILocation(line: 261, column: 51, scope: !1123)
!1141 = !DILocation(line: 261, column: 61, scope: !1123)
!1142 = !DILocation(line: 262, column: 12, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 262, column: 9)
!1144 = !DILocation(line: 262, column: 18, scope: !1143)
!1145 = !DILocation(line: 262, column: 9, scope: !1123)
!1146 = !DILocation(line: 264, column: 20, scope: !1123)
!1147 = !DILocation(line: 264, column: 15, scope: !1123)
!1148 = !DILocation(line: 265, column: 30, scope: !1123)
!1149 = !DILocation(line: 265, column: 34, scope: !1123)
!1150 = !{!1151, !381, i64 16}
!1151 = !{!"listNode", !381, i64 0, !381, i64 8, !381, i64 16}
!1152 = !DILocation(line: 265, column: 23, scope: !1123)
!1153 = !DILocation(line: 272, column: 9, scope: !1134)
!1154 = !DILocation(line: 272, column: 9, scope: !1123)
!1155 = !DILocation(line: 275, column: 30, scope: !1133)
!1156 = !DILocation(line: 275, column: 43, scope: !1133)
!1157 = !DILocation(line: 275, column: 35, scope: !1133)
!1158 = !DILocation(line: 275, column: 16, scope: !1133)
!1159 = !DILocation(line: 276, column: 29, scope: !1133)
!1160 = !DILocation(line: 276, column: 23, scope: !1133)
!1161 = !DILocation(line: 276, column: 16, scope: !1133)
!1162 = !DILocation(line: 277, column: 26, scope: !1133)
!1163 = !DILocation(line: 277, column: 9, scope: !1133)
!1164 = !DILocation(line: 278, column: 20, scope: !1133)
!1165 = !DILocation(line: 279, column: 11, scope: !1133)
!1166 = !DILocation(line: 280, column: 13, scope: !1133)
!1167 = !DILocation(line: 281, column: 5, scope: !1133)
!1168 = !DILocation(line: 282, column: 9, scope: !1138)
!1169 = !DILocation(line: 282, column: 9, scope: !1123)
!1170 = !DILocation(line: 285, column: 23, scope: !1137)
!1171 = !DILocation(line: 285, column: 16, scope: !1137)
!1172 = !DILocation(line: 286, column: 29, scope: !1137)
!1173 = !DILocation(line: 286, column: 16, scope: !1137)
!1174 = !DILocation(line: 288, column: 22, scope: !1137)
!1175 = !DILocation(line: 288, column: 43, scope: !1137)
!1176 = !DILocation(line: 288, column: 15, scope: !1137)
!1177 = !DILocation(line: 288, column: 20, scope: !1137)
!1178 = !DILocation(line: 289, column: 15, scope: !1137)
!1179 = !DILocation(line: 289, column: 20, scope: !1137)
!1180 = !DILocation(line: 290, column: 22, scope: !1137)
!1181 = !DILocation(line: 290, column: 9, scope: !1137)
!1182 = !DILocation(line: 291, column: 28, scope: !1137)
!1183 = !DILocation(line: 291, column: 9, scope: !1137)
!1184 = !DILocation(line: 292, column: 33, scope: !1137)
!1185 = !DILocation(line: 292, column: 12, scope: !1137)
!1186 = !DILocation(line: 292, column: 24, scope: !1137)
!1187 = !DILocation(line: 293, column: 5, scope: !1137)
!1188 = !DILocation(line: 294, column: 5, scope: !1123)
!1189 = !DILocation(line: 295, column: 1, scope: !1123)
!1190 = distinct !DISubprogram(name: "asyncCloseClientOnOutputBufferLimitReached", scope: !3, file: !3, line: 2128, type: !4, isLocal: false, isDefinition: true, scopeLine: 2128, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1191)
!1191 = !{!1192, !1193}
!1192 = !DILocalVariable(name: "c", arg: 1, scope: !1190, file: !3, line: 2128, type: !6)
!1193 = !DILocalVariable(name: "client", scope: !1194, file: !3, line: 2133, type: !137)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 2132, column: 43)
!1195 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 2132, column: 9)
!1196 = !DILocation(line: 2128, column: 57, scope: !1190)
!1197 = !DILocation(line: 2129, column: 12, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 2129, column: 9)
!1199 = !DILocation(line: 2129, column: 15, scope: !1198)
!1200 = !DILocation(line: 2129, column: 9, scope: !1190)
!1201 = !DILocation(line: 2130, column: 5, scope: !1190)
!1202 = !DILocation(line: 2131, column: 24, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 2131, column: 9)
!1204 = !DILocation(line: 2131, column: 29, scope: !1203)
!1205 = !DILocation(line: 2131, column: 35, scope: !1203)
!1206 = !DILocation(line: 2131, column: 41, scope: !1203)
!1207 = !DILocation(line: 2131, column: 9, scope: !1190)
!1208 = !DILocalVariable(name: "c", arg: 1, scope: !1209, file: !3, line: 2083, type: !6)
!1209 = distinct !DISubprogram(name: "checkClientOutputBufferLimits", scope: !3, file: !3, line: 2083, type: !1041, isLocal: false, isDefinition: true, scopeLine: 2083, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !1210)
!1210 = !{!1208, !1211, !1212, !1213, !1214, !1215}
!1211 = !DILocalVariable(name: "soft", scope: !1209, file: !3, line: 2084, type: !18)
!1212 = !DILocalVariable(name: "hard", scope: !1209, file: !3, line: 2084, type: !18)
!1213 = !DILocalVariable(name: "class", scope: !1209, file: !3, line: 2084, type: !18)
!1214 = !DILocalVariable(name: "used_mem", scope: !1209, file: !3, line: 2085, type: !16)
!1215 = !DILocalVariable(name: "elapsed", scope: !1216, file: !3, line: 2106, type: !182)
!1216 = distinct !DILexicalBlock(scope: !1217, file: !3, line: 2105, column: 16)
