; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/object.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !5, !6, !36, !74, !77, !81, !64, !82, !113, !114, !115, !125, !136, !146, !155}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !8, line: 82, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !8, line: 76, size: 768, elements: !10)
!10 = !{!11, !42, !43, !72, !73}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 77, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !8, line: 65, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !8, line: 58, size: 384, elements: !15)
!15 = !{!16, !27, !31, !32, !37, !41}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !14, file: !8, line: 59, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !25}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !21, line: 60, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !14, file: !8, line: 60, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !4, !25}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !14, file: !8, line: 61, baseType: !28, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !14, file: !8, line: 62, baseType: !33, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !4, !25, !25}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !14, file: !8, line: 63, baseType: !38, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !4, !4}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !14, file: !8, line: 64, baseType: !38, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !9, file: !8, line: 78, baseType: !4, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !9, file: !8, line: 79, baseType: !44, size: 512, offset: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !70)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !8, line: 74, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !8, line: 69, size: 256, elements: !47)
!47 = !{!48, !67, !68, !69}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !8, line: 70, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !8, line: 56, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !8, line: 47, size: 192, elements: !53)
!53 = !{!54, !55, !65}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !52, file: !8, line: 48, baseType: !4, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !52, file: !8, line: 54, baseType: !56, size: 64, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !8, line: 49, size: 64, elements: !57)
!57 = !{!58, !59, !60, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !56, file: !8, line: 50, baseType: !4, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !56, file: !8, line: 51, baseType: !20, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !56, file: !8, line: 52, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 56, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 103, baseType: !5)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !56, file: !8, line: 53, baseType: !64, size: 64)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !8, line: 55, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !8, line: 71, baseType: !24, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !46, file: !8, line: 72, baseType: !24, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !46, file: !8, line: 73, baseType: !24, size: 64, offset: 192)
!70 = !{!71}
!71 = !DISubrange(count: 2)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !9, file: !8, line: 80, baseType: !5, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !9, file: !8, line: 81, baseType: !24, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 40, baseType: !79)
!78 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !80, line: 129, baseType: !24)
!80 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !84, line: 829, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !84, line: 826, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !85, file: !84, line: 827, baseType: !6, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !85, file: !84, line: 828, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !84, line: 824, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !84, line: 820, size: 256, elements: !92)
!92 = !{!93, !110, !111, !112}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !91, file: !84, line: 821, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !84, line: 810, size: 192, elements: !96)
!96 = !{!97, !100, !101, !102}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !95, file: !84, line: 811, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !99, line: 43, baseType: !81)
!99 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !95, file: !84, line: 812, baseType: !64, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !95, file: !84, line: 813, baseType: !94, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !95, file: !84, line: 817, baseType: !103, offset: 192)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, elements: !108)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistLevel", file: !84, line: 814, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !104, file: !84, line: 815, baseType: !94, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !104, file: !84, line: 816, baseType: !24, size: 64, offset: 64)
!108 = !{!109}
!109 = !DISubrange(count: -1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !91, file: !84, line: 821, baseType: !94, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !84, line: 822, baseType: !24, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !91, file: !84, line: 823, baseType: !36, size: 32, offset: 192)
!113 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !84, line: 622, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !84, line: 614, size: 128, elements: !118)
!118 = !{!119, !121, !122, !123, !124}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !84, line: 615, baseType: !120, size: 4, flags: DIFlagBitField, extraData: i64 0)
!120 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !117, file: !84, line: 616, baseType: !120, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !117, file: !84, line: 617, baseType: !120, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !117, file: !84, line: 620, baseType: !36, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !117, file: !84, line: 621, baseType: !4, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !99, line: 51, size: 24, elements: !127)
!127 = !{!128, !132, !133, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !99, line: 52, baseType: !129, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 24, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 43, baseType: !131)
!131 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !126, file: !99, line: 53, baseType: !129, size: 8, offset: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !99, line: 54, baseType: !131, size: 8, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !126, file: !99, line: 55, baseType: !135, offset: 24)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, elements: !108)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !99, line: 57, size: 40, elements: !138)
!138 = !{!139, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !137, file: !99, line: 58, baseType: !140, size: 16)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 36, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 57, baseType: !142)
!142 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !137, file: !99, line: 59, baseType: !140, size: 16, offset: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !99, line: 60, baseType: !131, size: 8, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !137, file: !99, line: 61, baseType: !135, offset: 40)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !99, line: 63, size: 72, elements: !148)
!148 = !{!149, !152, !153, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !147, file: !99, line: 64, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 48, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 79, baseType: !120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !147, file: !99, line: 65, baseType: !150, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !99, line: 66, baseType: !131, size: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !147, file: !99, line: 67, baseType: !135, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !99, line: 69, size: 136, elements: !157)
!157 = !{!158, !159, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !99, line: 70, baseType: !20, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !156, file: !99, line: 71, baseType: !20, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !99, line: 72, baseType: !131, size: 8, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !156, file: !99, line: 73, baseType: !135, offset: 136)
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!166 = distinct !DISubprogram(name: "createObject", scope: !1, file: !1, line: 41, type: !167, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!115, !36, !4}
!169 = !{!170, !171, !172}
!170 = !DILocalVariable(name: "type", arg: 1, scope: !166, file: !1, line: 41, type: !36)
!171 = !DILocalVariable(name: "ptr", arg: 2, scope: !166, file: !1, line: 41, type: !4)
!172 = !DILocalVariable(name: "o", scope: !166, file: !1, line: 42, type: !115)
!173 = !DILocation(line: 41, column: 24, scope: !166)
!174 = !DILocation(line: 41, column: 36, scope: !166)
!175 = !DILocation(line: 42, column: 15, scope: !166)
!176 = !DILocation(line: 42, column: 11, scope: !166)
!177 = !DILocation(line: 43, column: 8, scope: !166)
!178 = !DILocation(line: 43, column: 13, scope: !166)
!179 = !DILocation(line: 44, column: 17, scope: !166)
!180 = !DILocation(line: 45, column: 8, scope: !166)
!181 = !DILocation(line: 45, column: 12, scope: !166)
!182 = !{!183, !187, i64 8}
!183 = !{!"redisObject", !184, i64 0, !184, i64 0, !184, i64 1, !184, i64 4, !187, i64 8}
!184 = !{!"int", !185, i64 0}
!185 = !{!"omnipotent char", !186, i64 0}
!186 = !{!"Simple C/C++ TBAA"}
!187 = !{!"any pointer", !185, i64 0}
!188 = !DILocation(line: 46, column: 8, scope: !166)
!189 = !DILocation(line: 46, column: 17, scope: !166)
!190 = !{!183, !184, i64 4}
!191 = !DILocation(line: 50, column: 16, scope: !192)
!192 = distinct !DILexicalBlock(scope: !166, file: !1, line: 50, column: 9)
!193 = !{!194, !184, i64 2712}
!194 = !{!"redisServer", !184, i64 0, !187, i64 8, !187, i64 16, !187, i64 24, !184, i64 32, !184, i64 36, !184, i64 40, !187, i64 48, !187, i64 56, !187, i64 64, !187, i64 72, !184, i64 80, !184, i64 84, !184, i64 88, !184, i64 92, !187, i64 96, !187, i64 104, !184, i64 112, !184, i64 116, !185, i64 120, !184, i64 164, !195, i64 168, !184, i64 176, !187, i64 184, !187, i64 192, !187, i64 200, !185, i64 208, !184, i64 216, !184, i64 220, !185, i64 224, !184, i64 352, !187, i64 360, !184, i64 368, !185, i64 372, !184, i64 436, !184, i64 440, !185, i64 444, !184, i64 508, !187, i64 512, !187, i64 520, !187, i64 528, !187, i64 536, !187, i64 544, !187, i64 552, !187, i64 560, !184, i64 568, !196, i64 576, !185, i64 584, !187, i64 840, !195, i64 848, !184, i64 856, !184, i64 860, !195, i64 864, !195, i64 872, !195, i64 880, !195, i64 888, !187, i64 896, !187, i64 904, !187, i64 912, !187, i64 920, !187, i64 928, !187, i64 936, !187, i64 944, !187, i64 952, !187, i64 960, !187, i64 968, !187, i64 976, !187, i64 984, !187, i64 992, !195, i64 1000, !196, i64 1008, !196, i64 1016, !196, i64 1024, !197, i64 1032, !196, i64 1040, !196, i64 1048, !196, i64 1056, !196, i64 1064, !196, i64 1072, !196, i64 1080, !196, i64 1088, !196, i64 1096, !196, i64 1104, !195, i64 1112, !196, i64 1120, !197, i64 1128, !196, i64 1136, !196, i64 1144, !196, i64 1152, !196, i64 1160, !187, i64 1168, !196, i64 1176, !196, i64 1184, !195, i64 1192, !198, i64 1200, !196, i64 1240, !196, i64 1248, !195, i64 1256, !195, i64 1264, !185, i64 1272, !184, i64 1728, !184, i64 1732, !184, i64 1736, !184, i64 1740, !184, i64 1744, !195, i64 1752, !184, i64 1760, !184, i64 1764, !184, i64 1768, !184, i64 1772, !195, i64 1776, !195, i64 1784, !184, i64 1792, !184, i64 1796, !184, i64 1800, !184, i64 1804, !185, i64 1808, !184, i64 1880, !184, i64 1884, !187, i64 1888, !184, i64 1896, !184, i64 1900, !195, i64 1904, !195, i64 1912, !195, i64 1920, !195, i64 1928, !184, i64 1936, !184, i64 1940, !187, i64 1944, !187, i64 1952, !184, i64 1960, !184, i64 1964, !195, i64 1968, !195, i64 1976, !195, i64 1984, !195, i64 1992, !184, i64 2000, !195, i64 2008, !184, i64 2016, !184, i64 2020, !184, i64 2024, !184, i64 2028, !184, i64 2032, !184, i64 2036, !184, i64 2040, !184, i64 2044, !184, i64 2048, !184, i64 2052, !184, i64 2056, !184, i64 2060, !184, i64 2064, !187, i64 2072, !196, i64 2080, !196, i64 2088, !184, i64 2096, !187, i64 2104, !184, i64 2112, !187, i64 2120, !184, i64 2128, !184, i64 2132, !195, i64 2136, !195, i64 2144, !195, i64 2152, !195, i64 2160, !184, i64 2168, !184, i64 2172, !184, i64 2176, !184, i64 2180, !184, i64 2184, !184, i64 2188, !185, i64 2192, !199, i64 2200, !200, i64 2224, !187, i64 2240, !184, i64 2248, !187, i64 2256, !184, i64 2264, !185, i64 2268, !185, i64 2309, !196, i64 2352, !196, i64 2360, !184, i64 2368, !184, i64 2372, !187, i64 2376, !196, i64 2384, !196, i64 2392, !196, i64 2400, !196, i64 2408, !195, i64 2416, !195, i64 2424, !184, i64 2432, !184, i64 2436, !184, i64 2440, !184, i64 2444, !184, i64 2448, !187, i64 2456, !187, i64 2464, !184, i64 2472, !184, i64 2476, !187, i64 2480, !187, i64 2488, !184, i64 2496, !184, i64 2500, !195, i64 2504, !195, i64 2512, !195, i64 2520, !184, i64 2528, !184, i64 2532, !187, i64 2536, !195, i64 2544, !184, i64 2552, !184, i64 2556, !184, i64 2560, !195, i64 2568, !184, i64 2576, !184, i64 2580, !184, i64 2584, !187, i64 2592, !185, i64 2600, !196, i64 2648, !184, i64 2656, !187, i64 2664, !187, i64 2672, !184, i64 2680, !187, i64 2688, !184, i64 2696, !184, i64 2700, !196, i64 2704, !184, i64 2712, !184, i64 2716, !184, i64 2720, !184, i64 2724, !196, i64 2728, !184, i64 2736, !185, i64 2740, !187, i64 2768, !187, i64 2776, !184, i64 2784, !184, i64 2788, !184, i64 2792, !184, i64 2796, !195, i64 2800, !195, i64 2808, !195, i64 2816, !195, i64 2824, !195, i64 2832, !195, i64 2840, !195, i64 2848, !195, i64 2856, !184, i64 2864, !184, i64 2868, !195, i64 2872, !195, i64 2880, !184, i64 2888, !196, i64 2896, !187, i64 2904, !187, i64 2912, !184, i64 2920, !184, i64 2924, !196, i64 2928, !187, i64 2936, !187, i64 2944, !184, i64 2952, !184, i64 2956, !184, i64 2960, !184, i64 2964, !187, i64 2968, !184, i64 2976, !184, i64 2980, !184, i64 2984, !187, i64 2992, !187, i64 3000, !187, i64 3008, !187, i64 3016, !196, i64 3024, !196, i64 3032, !196, i64 3040, !184, i64 3048, !184, i64 3052, !184, i64 3056, !184, i64 3060, !184, i64 3064, !184, i64 3068, !184, i64 3072, !184, i64 3076, !184, i64 3080, !184, i64 3084, !184, i64 3088, !196, i64 3096, !187, i64 3104, !187, i64 3112, !187, i64 3120, !184, i64 3128, !184, i64 3132, !184, i64 3136, !195, i64 3144, !187, i64 3152, !187, i64 3160, !187, i64 3168}
!195 = !{!"long", !185, i64 0}
!196 = !{!"long long", !185, i64 0}
!197 = !{!"double", !185, i64 0}
!198 = !{!"malloc_stats", !195, i64 0, !195, i64 8, !195, i64 16, !195, i64 24, !195, i64 32}
!199 = !{!"", !184, i64 0, !195, i64 8, !196, i64 16}
!200 = !{!"redisOpArray", !187, i64 0, !184, i64 8}
!201 = !DILocation(line: 50, column: 33, scope: !192)
!202 = !DILocation(line: 50, column: 9, scope: !166)
!203 = !DILocation(line: 51, column: 19, scope: !204)
!204 = distinct !DILexicalBlock(scope: !192, file: !1, line: 50, column: 55)
!205 = !DILocation(line: 51, column: 18, scope: !204)
!206 = !DILocation(line: 51, column: 16, scope: !204)
!207 = !DILocation(line: 52, column: 5, scope: !204)
!208 = !DILocation(line: 53, column: 18, scope: !209)
!209 = distinct !DILexicalBlock(scope: !192, file: !1, line: 52, column: 12)
!210 = !DILocation(line: 53, column: 16, scope: !209)
!211 = !DILocation(line: 0, scope: !204)
!212 = !DILocation(line: 55, column: 5, scope: !166)
!213 = distinct !DISubprogram(name: "makeObjectShared", scope: !1, file: !1, line: 69, type: !214, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{!115, !115}
!216 = !{!217}
!217 = !DILocalVariable(name: "o", arg: 1, scope: !213, file: !1, line: 69, type: !115)
!218 = !DILocation(line: 69, column: 30, scope: !213)
!219 = !DILocation(line: 70, column: 5, scope: !213)
!220 = !DILocation(line: 71, column: 17, scope: !213)
!221 = !DILocation(line: 72, column: 5, scope: !213)
!222 = distinct !DISubprogram(name: "createRawStringObject", scope: !1, file: !1, line: 77, type: !223, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!115, !74, !77}
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "ptr", arg: 1, scope: !222, file: !1, line: 77, type: !74)
!227 = !DILocalVariable(name: "len", arg: 2, scope: !222, file: !1, line: 77, type: !77)
!228 = !DILocation(line: 77, column: 41, scope: !222)
!229 = !DILocation(line: 77, column: 53, scope: !222)
!230 = !DILocation(line: 78, column: 37, scope: !222)
!231 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !232)
!232 = distinct !DILocation(line: 78, column: 12, scope: !222)
!233 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !232)
!234 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !232)
!235 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !232)
!236 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !232)
!237 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !232)
!238 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !232)
!239 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !232)
!240 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !232)
!241 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !232)
!242 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !232)
!243 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !232)
!244 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !232)
!245 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !232)
!246 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !232)
!247 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !232)
!248 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !232)
!249 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !232)
!250 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !232)
!251 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !232)
!252 = !DILocation(line: 0, scope: !204, inlinedAt: !232)
!253 = !DILocation(line: 78, column: 5, scope: !222)
!254 = distinct !DISubprogram(name: "createEmbeddedStringObject", scope: !1, file: !1, line: 84, type: !223, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DILocalVariable(name: "ptr", arg: 1, scope: !254, file: !1, line: 84, type: !74)
!257 = !DILocalVariable(name: "len", arg: 2, scope: !254, file: !1, line: 84, type: !77)
!258 = !DILocalVariable(name: "o", scope: !254, file: !1, line: 85, type: !115)
!259 = !DILocalVariable(name: "sh", scope: !254, file: !1, line: 86, type: !125)
!260 = !DILocation(line: 84, column: 46, scope: !254)
!261 = !DILocation(line: 84, column: 58, scope: !254)
!262 = !DILocation(line: 85, column: 62, scope: !254)
!263 = !DILocation(line: 85, column: 15, scope: !254)
!264 = !DILocation(line: 85, column: 11, scope: !254)
!265 = !DILocation(line: 86, column: 35, scope: !254)
!266 = !DILocation(line: 86, column: 21, scope: !254)
!267 = !DILocation(line: 88, column: 8, scope: !254)
!268 = !DILocation(line: 88, column: 13, scope: !254)
!269 = !DILocation(line: 89, column: 17, scope: !254)
!270 = !DILocation(line: 90, column: 16, scope: !254)
!271 = !DILocation(line: 90, column: 8, scope: !254)
!272 = !DILocation(line: 90, column: 12, scope: !254)
!273 = !DILocation(line: 91, column: 8, scope: !254)
!274 = !DILocation(line: 91, column: 17, scope: !254)
!275 = !DILocation(line: 92, column: 16, scope: !276)
!276 = distinct !DILexicalBlock(scope: !254, file: !1, line: 92, column: 9)
!277 = !DILocation(line: 92, column: 33, scope: !276)
!278 = !DILocation(line: 92, column: 9, scope: !254)
!279 = !DILocation(line: 93, column: 19, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !1, line: 92, column: 55)
!281 = !DILocation(line: 93, column: 18, scope: !280)
!282 = !DILocation(line: 93, column: 16, scope: !280)
!283 = !DILocation(line: 94, column: 5, scope: !280)
!284 = !DILocation(line: 95, column: 18, scope: !285)
!285 = distinct !DILexicalBlock(scope: !276, file: !1, line: 94, column: 12)
!286 = !DILocation(line: 95, column: 16, scope: !285)
!287 = !DILocation(line: 0, scope: !280)
!288 = !DILocation(line: 98, column: 15, scope: !254)
!289 = !DILocation(line: 98, column: 13, scope: !254)
!290 = !{!185, !185, i64 0}
!291 = !DILocation(line: 99, column: 9, scope: !254)
!292 = !DILocation(line: 99, column: 15, scope: !254)
!293 = !DILocation(line: 100, column: 9, scope: !254)
!294 = !DILocation(line: 100, column: 15, scope: !254)
!295 = !DILocation(line: 101, column: 16, scope: !296)
!296 = distinct !DILexicalBlock(scope: !254, file: !1, line: 101, column: 9)
!297 = !{!187, !187, i64 0}
!298 = !DILocation(line: 101, column: 13, scope: !296)
!299 = !DILocation(line: 101, column: 9, scope: !254)
!300 = !DILocation(line: 102, column: 9, scope: !296)
!301 = !DILocation(line: 102, column: 22, scope: !296)
!302 = !DILocation(line: 103, column: 14, scope: !303)
!303 = distinct !DILexicalBlock(scope: !296, file: !1, line: 103, column: 14)
!304 = !DILocation(line: 103, column: 14, scope: !296)
!305 = !DILocation(line: 104, column: 9, scope: !306)
!306 = distinct !DILexicalBlock(scope: !303, file: !1, line: 103, column: 19)
!307 = !DILocation(line: 105, column: 9, scope: !306)
!308 = !DILocation(line: 105, column: 22, scope: !306)
!309 = !DILocation(line: 106, column: 5, scope: !306)
!310 = !DILocation(line: 107, column: 29, scope: !311)
!311 = distinct !DILexicalBlock(scope: !303, file: !1, line: 106, column: 12)
!312 = !DILocation(line: 107, column: 9, scope: !311)
!313 = !DILocation(line: 109, column: 5, scope: !254)
!314 = distinct !DISubprogram(name: "createStringObject", scope: !1, file: !1, line: 119, type: !223, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !315)
!315 = !{!316, !317}
!316 = !DILocalVariable(name: "ptr", arg: 1, scope: !314, file: !1, line: 119, type: !74)
!317 = !DILocalVariable(name: "len", arg: 2, scope: !314, file: !1, line: 119, type: !77)
!318 = !DILocation(line: 119, column: 38, scope: !314)
!319 = !DILocation(line: 119, column: 50, scope: !314)
!320 = !DILocation(line: 120, column: 13, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !1, line: 120, column: 9)
!322 = !DILocation(line: 120, column: 9, scope: !314)
!323 = !DILocation(line: 121, column: 16, scope: !321)
!324 = !DILocation(line: 121, column: 9, scope: !321)
!325 = !DILocation(line: 77, column: 41, scope: !222, inlinedAt: !326)
!326 = distinct !DILocation(line: 123, column: 16, scope: !321)
!327 = !DILocation(line: 77, column: 53, scope: !222, inlinedAt: !326)
!328 = !DILocation(line: 78, column: 37, scope: !222, inlinedAt: !326)
!329 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !330)
!330 = distinct !DILocation(line: 78, column: 12, scope: !222, inlinedAt: !326)
!331 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !330)
!332 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !330)
!333 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !330)
!334 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !330)
!335 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !330)
!336 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !330)
!337 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !330)
!338 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !330)
!339 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !330)
!340 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !330)
!341 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !330)
!342 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !330)
!343 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !330)
!344 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !330)
!345 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !330)
!346 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !330)
!347 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !330)
!348 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !330)
!349 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !330)
!350 = !DILocation(line: 0, scope: !204, inlinedAt: !330)
!351 = !DILocation(line: 123, column: 9, scope: !321)
!352 = !DILocation(line: 0, scope: !321)
!353 = !DILocation(line: 124, column: 1, scope: !314)
!354 = distinct !DISubprogram(name: "createStringObjectFromLongLongWithOptions", scope: !1, file: !1, line: 133, type: !355, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !358)
!355 = !DISubroutineType(types: !356)
!356 = !{!115, !357, !36}
!357 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!358 = !{!359, !360, !361}
!359 = !DILocalVariable(name: "value", arg: 1, scope: !354, file: !1, line: 133, type: !357)
!360 = !DILocalVariable(name: "valueobj", arg: 2, scope: !354, file: !1, line: 133, type: !36)
!361 = !DILocalVariable(name: "o", scope: !354, file: !1, line: 134, type: !115)
!362 = !DILocation(line: 133, column: 59, scope: !354)
!363 = !DILocation(line: 133, column: 70, scope: !354)
!364 = !DILocation(line: 136, column: 16, scope: !365)
!365 = distinct !DILexicalBlock(scope: !354, file: !1, line: 136, column: 9)
!366 = !{!194, !196, i64 2704}
!367 = !DILocation(line: 136, column: 26, scope: !365)
!368 = !DILocation(line: 136, column: 31, scope: !365)
!369 = !DILocation(line: 137, column: 18, scope: !365)
!370 = !DILocation(line: 137, column: 35, scope: !365)
!371 = !DILocation(line: 136, column: 9, scope: !354)
!372 = !DILocation(line: 142, column: 5, scope: !373)
!373 = distinct !DILexicalBlock(scope: !365, file: !1, line: 138, column: 5)
!374 = !DILocation(line: 144, column: 20, scope: !375)
!375 = distinct !DILexicalBlock(scope: !354, file: !1, line: 144, column: 9)
!376 = !DILocation(line: 144, column: 63, scope: !375)
!377 = !DILocation(line: 145, column: 22, scope: !378)
!378 = distinct !DILexicalBlock(scope: !375, file: !1, line: 144, column: 69)
!379 = !DILocalVariable(name: "o", arg: 1, scope: !380, file: !1, line: 349, type: !115)
!380 = distinct !DISubprogram(name: "incrRefCount", scope: !1, file: !1, line: 349, type: !381, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !115}
!383 = !{!379}
!384 = !DILocation(line: 349, column: 25, scope: !380, inlinedAt: !385)
!385 = distinct !DILocation(line: 145, column: 9, scope: !378)
!386 = !DILocation(line: 350, column: 12, scope: !387, inlinedAt: !385)
!387 = distinct !DILexicalBlock(scope: !380, file: !1, line: 350, column: 9)
!388 = !DILocation(line: 350, column: 21, scope: !387, inlinedAt: !385)
!389 = !DILocation(line: 350, column: 9, scope: !380, inlinedAt: !385)
!390 = !DILocation(line: 350, column: 56, scope: !387, inlinedAt: !385)
!391 = !DILocation(line: 350, column: 45, scope: !387, inlinedAt: !385)
!392 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !393)
!393 = distinct !DILocation(line: 149, column: 17, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !1, line: 148, column: 53)
!395 = distinct !DILexicalBlock(scope: !396, file: !1, line: 148, column: 13)
!396 = distinct !DILexicalBlock(scope: !375, file: !1, line: 147, column: 12)
!397 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !393)
!398 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !393)
!399 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !393)
!400 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !393)
!401 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !393)
!402 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !393)
!403 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !393)
!404 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !393)
!405 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !393)
!406 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !393)
!407 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !393)
!408 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !393)
!409 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !393)
!410 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !393)
!411 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !393)
!412 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !393)
!413 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !393)
!414 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !393)
!415 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !393)
!416 = !DILocation(line: 134, column: 11, scope: !354)
!417 = !DILocation(line: 150, column: 25, scope: !394)
!418 = !DILocation(line: 151, column: 22, scope: !394)
!419 = !DILocation(line: 151, column: 20, scope: !394)
!420 = !DILocation(line: 152, column: 9, scope: !394)
!421 = !DILocation(line: 0, scope: !422)
!422 = distinct !DILexicalBlock(scope: !395, file: !1, line: 152, column: 16)
!423 = !DILocation(line: 156, column: 5, scope: !354)
!424 = !DILocation(line: 349, column: 25, scope: !380)
!425 = !DILocation(line: 350, column: 12, scope: !387)
!426 = !DILocation(line: 350, column: 21, scope: !387)
!427 = !DILocation(line: 350, column: 9, scope: !380)
!428 = !DILocation(line: 350, column: 56, scope: !387)
!429 = !DILocation(line: 350, column: 45, scope: !387)
!430 = !DILocation(line: 351, column: 1, scope: !380)
!431 = distinct !DISubprogram(name: "createStringObjectFromLongLong", scope: !1, file: !1, line: 161, type: !432, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !434)
!432 = !DISubroutineType(types: !433)
!433 = !{!115, !357}
!434 = !{!435}
!435 = !DILocalVariable(name: "value", arg: 1, scope: !431, file: !1, line: 161, type: !357)
!436 = !DILocation(line: 161, column: 48, scope: !431)
!437 = !DILocation(line: 162, column: 12, scope: !431)
!438 = !DILocation(line: 162, column: 5, scope: !431)
!439 = distinct !DISubprogram(name: "createStringObjectFromLongLongForValue", scope: !1, file: !1, line: 169, type: !432, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !440)
!440 = !{!441}
!441 = !DILocalVariable(name: "value", arg: 1, scope: !439, file: !1, line: 169, type: !357)
!442 = !DILocation(line: 169, column: 56, scope: !439)
!443 = !DILocation(line: 170, column: 12, scope: !439)
!444 = !DILocation(line: 170, column: 5, scope: !439)
!445 = distinct !DISubprogram(name: "createStringObjectFromLongDouble", scope: !1, file: !1, line: 179, type: !446, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !449)
!446 = !DISubroutineType(types: !447)
!447 = !{!115, !448, !36}
!448 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!449 = !{!450, !451, !452, !456}
!450 = !DILocalVariable(name: "value", arg: 1, scope: !445, file: !1, line: 179, type: !448)
!451 = !DILocalVariable(name: "humanfriendly", arg: 2, scope: !445, file: !1, line: 179, type: !36)
!452 = !DILocalVariable(name: "buf", scope: !445, file: !1, line: 180, type: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 40960, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 5120)
!456 = !DILocalVariable(name: "len", scope: !445, file: !1, line: 181, type: !36)
!457 = !DILocation(line: 179, column: 52, scope: !445)
!458 = !DILocation(line: 179, column: 63, scope: !445)
!459 = !DILocation(line: 180, column: 5, scope: !445)
!460 = !DILocation(line: 180, column: 10, scope: !445)
!461 = !DILocation(line: 181, column: 15, scope: !445)
!462 = !DILocation(line: 181, column: 9, scope: !445)
!463 = !DILocation(line: 182, column: 35, scope: !445)
!464 = !DILocation(line: 182, column: 12, scope: !445)
!465 = !DILocation(line: 183, column: 1, scope: !445)
!466 = !DILocation(line: 182, column: 5, scope: !445)
!467 = distinct !DISubprogram(name: "dupStringObject", scope: !1, file: !1, line: 193, type: !468, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !472)
!468 = !DISubroutineType(types: !469)
!469 = !{!115, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!472 = !{!473, !474}
!473 = !DILocalVariable(name: "o", arg: 1, scope: !467, file: !1, line: 193, type: !470)
!474 = !DILocalVariable(name: "d", scope: !467, file: !1, line: 194, type: !115)
!475 = !DILocation(line: 193, column: 35, scope: !467)
!476 = !DILocation(line: 196, column: 5, scope: !467)
!477 = !DILocation(line: 198, column: 15, scope: !467)
!478 = !DILocation(line: 198, column: 5, scope: !467)
!479 = !DILocation(line: 200, column: 41, scope: !480)
!480 = distinct !DILexicalBlock(scope: !467, file: !1, line: 198, column: 25)
!481 = !DILocalVariable(name: "s", arg: 1, scope: !482, file: !99, line: 87, type: !487)
!482 = distinct !DISubprogram(name: "sdslen", scope: !99, file: !99, line: 87, type: !483, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !488)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !487}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !486, line: 58, baseType: !24)
!486 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!488 = !{!481, !489}
!489 = !DILocalVariable(name: "flags", scope: !482, file: !99, line: 88, type: !131)
!490 = !DILocation(line: 87, column: 39, scope: !482, inlinedAt: !491)
!491 = distinct !DILocation(line: 200, column: 45, scope: !480)
!492 = !DILocation(line: 88, column: 27, scope: !482, inlinedAt: !491)
!493 = !DILocation(line: 88, column: 19, scope: !482, inlinedAt: !491)
!494 = !DILocation(line: 89, column: 5, scope: !482, inlinedAt: !491)
!495 = !DILocation(line: 91, column: 20, scope: !496, inlinedAt: !491)
!496 = distinct !DILexicalBlock(scope: !482, file: !99, line: 89, column: 33)
!497 = !DILocation(line: 91, column: 13, scope: !496, inlinedAt: !491)
!498 = !DILocation(line: 93, column: 20, scope: !496, inlinedAt: !491)
!499 = !DILocation(line: 93, column: 34, scope: !496, inlinedAt: !491)
!500 = !DILocation(line: 93, column: 13, scope: !496, inlinedAt: !491)
!501 = !DILocation(line: 95, column: 20, scope: !496, inlinedAt: !491)
!502 = !DILocation(line: 95, column: 35, scope: !496, inlinedAt: !491)
!503 = !{!504, !504, i64 0}
!504 = !{!"short", !185, i64 0}
!505 = !DILocation(line: 95, column: 13, scope: !496, inlinedAt: !491)
!506 = !DILocation(line: 97, column: 20, scope: !496, inlinedAt: !491)
!507 = !DILocation(line: 97, column: 35, scope: !496, inlinedAt: !491)
!508 = !{!184, !184, i64 0}
!509 = !DILocation(line: 97, column: 13, scope: !496, inlinedAt: !491)
!510 = !DILocation(line: 99, column: 20, scope: !496, inlinedAt: !491)
!511 = !DILocation(line: 99, column: 35, scope: !496, inlinedAt: !491)
!512 = !{!195, !195, i64 0}
!513 = !DILocation(line: 99, column: 13, scope: !496, inlinedAt: !491)
!514 = !DILocation(line: 0, scope: !496, inlinedAt: !491)
!515 = !DILocation(line: 77, column: 41, scope: !222, inlinedAt: !516)
!516 = distinct !DILocation(line: 200, column: 16, scope: !480)
!517 = !DILocation(line: 77, column: 53, scope: !222, inlinedAt: !516)
!518 = !DILocation(line: 78, column: 37, scope: !222, inlinedAt: !516)
!519 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !520)
!520 = distinct !DILocation(line: 78, column: 12, scope: !222, inlinedAt: !516)
!521 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !520)
!522 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !520)
!523 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !520)
!524 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !520)
!525 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !520)
!526 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !520)
!527 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !520)
!528 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !520)
!529 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !520)
!530 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !520)
!531 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !520)
!532 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !520)
!533 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !520)
!534 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !520)
!535 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !520)
!536 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !520)
!537 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !520)
!538 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !520)
!539 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !520)
!540 = !DILocation(line: 0, scope: !204, inlinedAt: !520)
!541 = !DILocation(line: 200, column: 9, scope: !480)
!542 = !DILocation(line: 202, column: 46, scope: !480)
!543 = !DILocation(line: 87, column: 39, scope: !482, inlinedAt: !544)
!544 = distinct !DILocation(line: 202, column: 50, scope: !480)
!545 = !DILocation(line: 88, column: 27, scope: !482, inlinedAt: !544)
!546 = !DILocation(line: 88, column: 19, scope: !482, inlinedAt: !544)
!547 = !DILocation(line: 89, column: 5, scope: !482, inlinedAt: !544)
!548 = !DILocation(line: 91, column: 20, scope: !496, inlinedAt: !544)
!549 = !DILocation(line: 91, column: 13, scope: !496, inlinedAt: !544)
!550 = !DILocation(line: 93, column: 20, scope: !496, inlinedAt: !544)
!551 = !DILocation(line: 93, column: 34, scope: !496, inlinedAt: !544)
!552 = !DILocation(line: 93, column: 13, scope: !496, inlinedAt: !544)
!553 = !DILocation(line: 95, column: 20, scope: !496, inlinedAt: !544)
!554 = !DILocation(line: 95, column: 35, scope: !496, inlinedAt: !544)
!555 = !DILocation(line: 95, column: 13, scope: !496, inlinedAt: !544)
!556 = !DILocation(line: 97, column: 20, scope: !496, inlinedAt: !544)
!557 = !DILocation(line: 97, column: 35, scope: !496, inlinedAt: !544)
!558 = !DILocation(line: 97, column: 13, scope: !496, inlinedAt: !544)
!559 = !DILocation(line: 99, column: 20, scope: !496, inlinedAt: !544)
!560 = !DILocation(line: 99, column: 35, scope: !496, inlinedAt: !544)
!561 = !DILocation(line: 99, column: 13, scope: !496, inlinedAt: !544)
!562 = !DILocation(line: 0, scope: !496, inlinedAt: !544)
!563 = !DILocation(line: 202, column: 16, scope: !480)
!564 = !DILocation(line: 202, column: 9, scope: !480)
!565 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !566)
!566 = distinct !DILocation(line: 204, column: 13, scope: !480)
!567 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !566)
!568 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !566)
!569 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !566)
!570 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !566)
!571 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !566)
!572 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !566)
!573 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !566)
!574 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !566)
!575 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !566)
!576 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !566)
!577 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !566)
!578 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !566)
!579 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !566)
!580 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !566)
!581 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !566)
!582 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !566)
!583 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !566)
!584 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !566)
!585 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !566)
!586 = !DILocation(line: 194, column: 11, scope: !467)
!587 = !DILocation(line: 205, column: 21, scope: !480)
!588 = !DILocation(line: 206, column: 21, scope: !480)
!589 = !DILocation(line: 206, column: 16, scope: !480)
!590 = !DILocation(line: 207, column: 9, scope: !480)
!591 = !DILocation(line: 209, column: 9, scope: !480)
!592 = !DILocation(line: 0, scope: !480)
!593 = !DILocation(line: 212, column: 1, scope: !467)
!594 = distinct !DISubprogram(name: "createQuicklistObject", scope: !1, file: !1, line: 214, type: !595, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!115}
!597 = !{!598, !626}
!598 = !DILocalVariable(name: "l", scope: !594, file: !1, line: 215, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !601, line: 80, baseType: !602)
!601 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !601, line: 73, size: 320, elements: !603)
!603 = !{!604, !621, !622, !623, !624, !625}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !602, file: !601, line: 74, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !601, line: 55, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !601, line: 44, size: 256, elements: !608)
!608 = !{!609, !611, !612, !614, !615, !616, !617, !618, !619, !620}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !607, file: !601, line: 45, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !607, file: !601, line: 46, baseType: !610, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !607, file: !601, line: 47, baseType: !613, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !607, file: !601, line: 48, baseType: !120, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !607, file: !601, line: 49, baseType: !120, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !607, file: !601, line: 50, baseType: !120, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !607, file: !601, line: 51, baseType: !120, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !607, file: !601, line: 52, baseType: !120, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !607, file: !601, line: 53, baseType: !120, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !607, file: !601, line: 54, baseType: !120, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !602, file: !601, line: 75, baseType: !605, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !602, file: !601, line: 76, baseType: !24, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !602, file: !601, line: 77, baseType: !24, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !602, file: !601, line: 78, baseType: !36, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !602, file: !601, line: 79, baseType: !120, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!626 = !DILocalVariable(name: "o", scope: !594, file: !1, line: 216, type: !115)
!627 = !DILocation(line: 215, column: 20, scope: !594)
!628 = !DILocation(line: 215, column: 16, scope: !594)
!629 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !630)
!630 = distinct !DILocation(line: 216, column: 15, scope: !594)
!631 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !630)
!632 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !630)
!633 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !630)
!634 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !630)
!635 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !630)
!636 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !630)
!637 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !630)
!638 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !630)
!639 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !630)
!640 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !630)
!641 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !630)
!642 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !630)
!643 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !630)
!644 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !630)
!645 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !630)
!646 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !630)
!647 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !630)
!648 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !630)
!649 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !630)
!650 = !DILocation(line: 216, column: 11, scope: !594)
!651 = !DILocation(line: 217, column: 17, scope: !594)
!652 = !DILocation(line: 218, column: 5, scope: !594)
!653 = distinct !DISubprogram(name: "createZiplistObject", scope: !1, file: !1, line: 221, type: !595, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !654)
!654 = !{!655, !656}
!655 = !DILocalVariable(name: "zl", scope: !653, file: !1, line: 222, type: !613)
!656 = !DILocalVariable(name: "o", scope: !653, file: !1, line: 223, type: !115)
!657 = !DILocation(line: 222, column: 25, scope: !653)
!658 = !DILocation(line: 222, column: 20, scope: !653)
!659 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !660)
!660 = distinct !DILocation(line: 223, column: 15, scope: !653)
!661 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !660)
!662 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !660)
!663 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !660)
!664 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !660)
!665 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !660)
!666 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !660)
!667 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !660)
!668 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !660)
!669 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !660)
!670 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !660)
!671 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !660)
!672 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !660)
!673 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !660)
!674 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !660)
!675 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !660)
!676 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !660)
!677 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !660)
!678 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !660)
!679 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !660)
!680 = !DILocation(line: 223, column: 11, scope: !653)
!681 = !DILocation(line: 224, column: 17, scope: !653)
!682 = !DILocation(line: 225, column: 5, scope: !653)
!683 = distinct !DISubprogram(name: "createSetObject", scope: !1, file: !1, line: 228, type: !595, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !684)
!684 = !{!685, !686}
!685 = !DILocalVariable(name: "d", scope: !683, file: !1, line: 229, type: !6)
!686 = !DILocalVariable(name: "o", scope: !683, file: !1, line: 230, type: !115)
!687 = !DILocation(line: 229, column: 15, scope: !683)
!688 = !DILocation(line: 229, column: 11, scope: !683)
!689 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !690)
!690 = distinct !DILocation(line: 230, column: 15, scope: !683)
!691 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !690)
!692 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !690)
!693 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !690)
!694 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !690)
!695 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !690)
!696 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !690)
!697 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !690)
!698 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !690)
!699 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !690)
!700 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !690)
!701 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !690)
!702 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !690)
!703 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !690)
!704 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !690)
!705 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !690)
!706 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !690)
!707 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !690)
!708 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !690)
!709 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !690)
!710 = !DILocation(line: 230, column: 11, scope: !683)
!711 = !DILocation(line: 231, column: 17, scope: !683)
!712 = !DILocation(line: 232, column: 5, scope: !683)
!713 = distinct !DISubprogram(name: "createIntsetObject", scope: !1, file: !1, line: 235, type: !595, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !714)
!714 = !{!715, !728}
!715 = !DILocalVariable(name: "is", scope: !713, file: !1, line: 236, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "intset", file: !718, line: 39, baseType: !719)
!718 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/intset.h", directory: "/root/.unikraft/apps/redis/build")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "intset", file: !718, line: 35, size: 64, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !719, file: !718, line: 36, baseType: !150, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !719, file: !718, line: 37, baseType: !150, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !719, file: !718, line: 38, baseType: !724, offset: 64)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, elements: !108)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 20, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 41, baseType: !727)
!727 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!728 = !DILocalVariable(name: "o", scope: !713, file: !1, line: 237, type: !115)
!729 = !DILocation(line: 236, column: 18, scope: !713)
!730 = !DILocation(line: 236, column: 13, scope: !713)
!731 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !732)
!732 = distinct !DILocation(line: 237, column: 15, scope: !713)
!733 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !732)
!734 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !732)
!735 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !732)
!736 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !732)
!737 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !732)
!738 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !732)
!739 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !732)
!740 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !732)
!741 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !732)
!742 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !732)
!743 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !732)
!744 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !732)
!745 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !732)
!746 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !732)
!747 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !732)
!748 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !732)
!749 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !732)
!750 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !732)
!751 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !732)
!752 = !DILocation(line: 237, column: 11, scope: !713)
!753 = !DILocation(line: 238, column: 17, scope: !713)
!754 = !DILocation(line: 239, column: 5, scope: !713)
!755 = distinct !DISubprogram(name: "createHashObject", scope: !1, file: !1, line: 242, type: !595, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !756)
!756 = !{!757, !758}
!757 = !DILocalVariable(name: "zl", scope: !755, file: !1, line: 243, type: !613)
!758 = !DILocalVariable(name: "o", scope: !755, file: !1, line: 244, type: !115)
!759 = !DILocation(line: 243, column: 25, scope: !755)
!760 = !DILocation(line: 243, column: 20, scope: !755)
!761 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !762)
!762 = distinct !DILocation(line: 244, column: 15, scope: !755)
!763 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !762)
!764 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !762)
!765 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !762)
!766 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !762)
!767 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !762)
!768 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !762)
!769 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !762)
!770 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !762)
!771 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !762)
!772 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !762)
!773 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !762)
!774 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !762)
!775 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !762)
!776 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !762)
!777 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !762)
!778 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !762)
!779 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !762)
!780 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !762)
!781 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !762)
!782 = !DILocation(line: 244, column: 11, scope: !755)
!783 = !DILocation(line: 245, column: 17, scope: !755)
!784 = !DILocation(line: 246, column: 5, scope: !755)
!785 = distinct !DISubprogram(name: "createZsetObject", scope: !1, file: !1, line: 249, type: !595, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !786)
!786 = !{!787, !788}
!787 = !DILocalVariable(name: "zs", scope: !785, file: !1, line: 250, type: !82)
!788 = !DILocalVariable(name: "o", scope: !785, file: !1, line: 251, type: !115)
!789 = !DILocation(line: 250, column: 16, scope: !785)
!790 = !DILocation(line: 250, column: 11, scope: !785)
!791 = !DILocation(line: 253, column: 16, scope: !785)
!792 = !DILocation(line: 253, column: 9, scope: !785)
!793 = !DILocation(line: 253, column: 14, scope: !785)
!794 = !{!795, !187, i64 0}
!795 = !{!"zset", !187, i64 0, !187, i64 8}
!796 = !DILocation(line: 254, column: 15, scope: !785)
!797 = !DILocation(line: 254, column: 9, scope: !785)
!798 = !DILocation(line: 254, column: 13, scope: !785)
!799 = !{!795, !187, i64 8}
!800 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !801)
!801 = distinct !DILocation(line: 255, column: 9, scope: !785)
!802 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !801)
!803 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !801)
!804 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !801)
!805 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !801)
!806 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !801)
!807 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !801)
!808 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !801)
!809 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !801)
!810 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !801)
!811 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !801)
!812 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !801)
!813 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !801)
!814 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !801)
!815 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !801)
!816 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !801)
!817 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !801)
!818 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !801)
!819 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !801)
!820 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !801)
!821 = !DILocation(line: 251, column: 11, scope: !785)
!822 = !DILocation(line: 256, column: 17, scope: !785)
!823 = !DILocation(line: 257, column: 5, scope: !785)
!824 = distinct !DISubprogram(name: "createZsetZiplistObject", scope: !1, file: !1, line: 260, type: !595, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !825)
!825 = !{!826, !827}
!826 = !DILocalVariable(name: "zl", scope: !824, file: !1, line: 261, type: !613)
!827 = !DILocalVariable(name: "o", scope: !824, file: !1, line: 262, type: !115)
!828 = !DILocation(line: 261, column: 25, scope: !824)
!829 = !DILocation(line: 261, column: 20, scope: !824)
!830 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !831)
!831 = distinct !DILocation(line: 262, column: 15, scope: !824)
!832 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !831)
!833 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !831)
!834 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !831)
!835 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !831)
!836 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !831)
!837 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !831)
!838 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !831)
!839 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !831)
!840 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !831)
!841 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !831)
!842 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !831)
!843 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !831)
!844 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !831)
!845 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !831)
!846 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !831)
!847 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !831)
!848 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !831)
!849 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !831)
!850 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !831)
!851 = !DILocation(line: 262, column: 11, scope: !824)
!852 = !DILocation(line: 263, column: 17, scope: !824)
!853 = !DILocation(line: 264, column: 5, scope: !824)
!854 = distinct !DISubprogram(name: "createStreamObject", scope: !1, file: !1, line: 267, type: !595, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !855)
!855 = !{!856, !889}
!856 = !DILocalVariable(name: "s", scope: !854, file: !1, line: 268, type: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream", file: !859, line: 21, baseType: !860)
!859 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/stream.h", directory: "/root/.unikraft/apps/redis/build")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !859, line: 16, size: 320, elements: !861)
!861 = !{!862, !881, !882, !888}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rax", scope: !860, file: !859, line: 17, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "rax", file: !865, line: 137, baseType: !866)
!865 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rax.h", directory: "/root/.unikraft/apps/redis/build")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rax", file: !865, line: 133, size: 192, elements: !867)
!867 = !{!868, !879, !880}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !866, file: !865, line: 134, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "raxNode", file: !865, line: 131, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raxNode", file: !865, line: 98, size: 32, elements: !872)
!872 = !{!873, !874, !875, !876, !877}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "iskey", scope: !871, file: !865, line: 99, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "isnull", scope: !871, file: !865, line: 100, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "iscompr", scope: !871, file: !865, line: 101, baseType: !150, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !871, file: !865, line: 102, baseType: !150, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !871, file: !865, line: 130, baseType: !878, offset: 32)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, elements: !108)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "numele", scope: !866, file: !865, line: 135, baseType: !20, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "numnodes", scope: !866, file: !865, line: 136, baseType: !20, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !860, file: !859, line: 18, baseType: !20, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !860, file: !859, line: 19, baseType: !883, size: 128, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamID", file: !859, line: 14, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamID", file: !859, line: 11, size: 128, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !884, file: !859, line: 12, baseType: !20, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !884, file: !859, line: 13, baseType: !20, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "cgroups", scope: !860, file: !859, line: 20, baseType: !863, size: 64, offset: 256)
!889 = !DILocalVariable(name: "o", scope: !854, file: !1, line: 269, type: !115)
!890 = !DILocation(line: 268, column: 17, scope: !854)
!891 = !DILocation(line: 268, column: 13, scope: !854)
!892 = !DILocation(line: 41, column: 24, scope: !166, inlinedAt: !893)
!893 = distinct !DILocation(line: 269, column: 15, scope: !854)
!894 = !DILocation(line: 41, column: 36, scope: !166, inlinedAt: !893)
!895 = !DILocation(line: 42, column: 15, scope: !166, inlinedAt: !893)
!896 = !DILocation(line: 42, column: 11, scope: !166, inlinedAt: !893)
!897 = !DILocation(line: 43, column: 8, scope: !166, inlinedAt: !893)
!898 = !DILocation(line: 43, column: 13, scope: !166, inlinedAt: !893)
!899 = !DILocation(line: 44, column: 17, scope: !166, inlinedAt: !893)
!900 = !DILocation(line: 45, column: 8, scope: !166, inlinedAt: !893)
!901 = !DILocation(line: 45, column: 12, scope: !166, inlinedAt: !893)
!902 = !DILocation(line: 46, column: 8, scope: !166, inlinedAt: !893)
!903 = !DILocation(line: 46, column: 17, scope: !166, inlinedAt: !893)
!904 = !DILocation(line: 50, column: 16, scope: !192, inlinedAt: !893)
!905 = !DILocation(line: 50, column: 33, scope: !192, inlinedAt: !893)
!906 = !DILocation(line: 50, column: 9, scope: !166, inlinedAt: !893)
!907 = !DILocation(line: 51, column: 19, scope: !204, inlinedAt: !893)
!908 = !DILocation(line: 51, column: 18, scope: !204, inlinedAt: !893)
!909 = !DILocation(line: 51, column: 16, scope: !204, inlinedAt: !893)
!910 = !DILocation(line: 52, column: 5, scope: !204, inlinedAt: !893)
!911 = !DILocation(line: 53, column: 18, scope: !209, inlinedAt: !893)
!912 = !DILocation(line: 53, column: 16, scope: !209, inlinedAt: !893)
!913 = !DILocation(line: 269, column: 11, scope: !854)
!914 = !DILocation(line: 270, column: 17, scope: !854)
!915 = !DILocation(line: 271, column: 5, scope: !854)
!916 = distinct !DISubprogram(name: "createModuleObject", scope: !1, file: !1, line: 274, type: !917, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1258)
!917 = !DISubroutineType(types: !918)
!918 = !{!115, !919, !4}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleType", file: !84, line: 530, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleType", file: !84, line: 517, size: 768, elements: !922)
!922 = !{!923, !924, !927, !1210, !1215, !1220, !1225, !1238, !1243, !1248, !1253, !1254}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !921, file: !84, line: 518, baseType: !20, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !921, file: !84, line: 519, baseType: !925, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModule", file: !84, line: 496, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_load", scope: !921, file: !84, line: 520, baseType: !928, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "moduleTypeLoadFunc", file: !84, line: 506, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!4, !932, !36}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisModuleIO", file: !84, line: 555, size: 384, elements: !934)
!934 = !{!935, !936, !1202, !1203, !1204, !1205, !1208}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !933, file: !84, line: 556, baseType: !77, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rio", scope: !933, file: !84, line: 557, baseType: !937, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !939, line: 87, baseType: !940)
!939 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !939, line: 39, size: 832, elements: !941)
!941 = !{!942, !947, !951, !959, !963, !967, !968, !969, !970}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !940, file: !939, line: 43, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!485, !946, !4, !485}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !940, file: !939, line: 44, baseType: !948, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!485, !946, !25, !485}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !940, file: !939, line: 45, baseType: !952, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!955, !946}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !956, line: 173, baseType: !957)
!956 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 100, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !80, line: 44, baseType: !5)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !940, file: !939, line: 46, baseType: !960, size: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!36, !946}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !940, file: !939, line: 52, baseType: !964, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !946, !25, !485}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !940, file: !939, line: 55, baseType: !20, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !940, file: !939, line: 58, baseType: !485, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !940, file: !939, line: 61, baseType: !485, size: 64, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !940, file: !939, line: 84, baseType: !971, size: 320, offset: 512)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !940, file: !939, line: 64, size: 320, elements: !972)
!972 = !{!973, !978, !1193}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !971, file: !939, line: 69, baseType: !974, size: 128)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !971, file: !939, line: 66, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !974, file: !939, line: 67, baseType: !98, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !974, file: !939, line: 68, baseType: !955, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !971, file: !939, line: 75, baseType: !979, size: 192)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !971, file: !939, line: 71, size: 192, elements: !980)
!980 = !{!981, !1191, !1192}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !979, file: !939, line: 72, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !984, line: 66, baseType: !985)
!984 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !986, line: 287, baseType: !987)
!986 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !986, line: 181, size: 1408, elements: !988)
!988 = !{!989, !990, !991, !992, !994, !995, !1000, !1001, !1002, !1161, !1165, !1170, !1174, !1175, !1176, !1177, !1179, !1181, !1182, !1183, !1184, !1185, !1189, !1190}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !987, file: !986, line: 182, baseType: !613, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !987, file: !986, line: 183, baseType: !36, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !987, file: !986, line: 184, baseType: !36, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !987, file: !986, line: 185, baseType: !993, size: 16, offset: 128)
!993 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !987, file: !986, line: 186, baseType: !993, size: 16, offset: 144)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !987, file: !986, line: 187, baseType: !996, size: 128, offset: 192)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !986, line: 117, size: 128, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !996, file: !986, line: 118, baseType: !613, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !996, file: !986, line: 119, baseType: !36, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !987, file: !986, line: 188, baseType: !36, size: 32, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !987, file: !986, line: 195, baseType: !4, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !987, file: !986, line: 197, baseType: !1003, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !1007, !4, !81, !36}
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !80, line: 145, baseType: !5)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !986, line: 569, size: 14912, elements: !1009)
!1009 = !{!1010, !1011, !1013, !1014, !1015, !1016, !1020, !1021, !1024, !1025, !1029, !1043, !1044, !1045, !1047, !1048, !1049, !1125, !1146, !1147, !1152, !1159}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !1008, file: !986, line: 571, baseType: !36, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !1008, file: !986, line: 576, baseType: !1012, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !1008, file: !986, line: 576, baseType: !1012, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !1008, file: !986, line: 576, baseType: !1012, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !1008, file: !986, line: 578, baseType: !36, size: 32, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !1008, file: !986, line: 579, baseType: !1017, size: 200, offset: 288)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 200, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 25)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !1008, file: !986, line: 582, baseType: !36, size: 32, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !1008, file: !986, line: 583, baseType: !1022, size: 64, offset: 576)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !986, line: 40, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !1008, file: !986, line: 585, baseType: !36, size: 32, offset: 640)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !1008, file: !986, line: 587, baseType: !1026, size: 64, offset: 704)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !1007}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !1008, file: !986, line: 590, baseType: !1030, size: 64, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !986, line: 47, size: 256, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1031, file: !986, line: 49, baseType: !1030, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !1031, file: !986, line: 50, baseType: !36, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !1031, file: !986, line: 50, baseType: !36, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !1031, file: !986, line: 50, baseType: !36, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !1031, file: !986, line: 50, baseType: !36, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !1031, file: !986, line: 51, baseType: !1039, size: 32, offset: 192)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 32, elements: !1041)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !986, line: 25, baseType: !120)
!1041 = !{!1042}
!1042 = !DISubrange(count: 1)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !1008, file: !986, line: 591, baseType: !36, size: 32, offset: 832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !1008, file: !986, line: 592, baseType: !1030, size: 64, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !1008, file: !986, line: 593, baseType: !1046, size: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !1008, file: !986, line: 596, baseType: !36, size: 32, offset: 1024)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !1008, file: !986, line: 597, baseType: !81, size: 64, offset: 1088)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !1008, file: !986, line: 632, baseType: !1050, size: 2880, offset: 1152)
!1050 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1008, file: !986, line: 599, size: 2880, elements: !1051)
!1051 = !{!1052, !1116}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !1050, file: !986, line: 622, baseType: !1053, size: 1728)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1050, file: !986, line: 601, size: 1728, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1061, !1073, !1074, !1076, !1085, !1099, !1100, !1101, !1105, !1109, !1110, !1111, !1112, !1113, !1114, !1115}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !1053, file: !986, line: 603, baseType: !120, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1053, file: !986, line: 604, baseType: !81, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !1053, file: !986, line: 605, baseType: !1058, size: 208, offset: 128)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 208, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 26)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !1053, file: !986, line: 606, baseType: !1062, size: 288, offset: 352)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !986, line: 55, size: 288, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1062, file: !986, line: 57, baseType: !36, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1062, file: !986, line: 58, baseType: !36, size: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1062, file: !986, line: 59, baseType: !36, size: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1062, file: !986, line: 60, baseType: !36, size: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1062, file: !986, line: 61, baseType: !36, size: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1062, file: !986, line: 62, baseType: !36, size: 32, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1062, file: !986, line: 63, baseType: !36, size: 32, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1062, file: !986, line: 64, baseType: !36, size: 32, offset: 224)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1062, file: !986, line: 65, baseType: !36, size: 32, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !1053, file: !986, line: 607, baseType: !36, size: 32, offset: 640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1053, file: !986, line: 608, baseType: !1075, size: 64, offset: 704)
!1075 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !1053, file: !986, line: 609, baseType: !1077, size: 112, offset: 768)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !986, line: 319, size: 112, elements: !1078)
!1078 = !{!1079, !1083, !1084}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1077, file: !986, line: 320, baseType: !1080, size: 48)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 48, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 3)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1077, file: !986, line: 321, baseType: !1080, size: 48, offset: 48)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1077, file: !986, line: 322, baseType: !142, size: 16, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1053, file: !986, line: 610, baseType: !1086, size: 64, offset: 896)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !80, line: 171, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 163, size: 64, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1087, file: !80, line: 165, baseType: !36, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1087, file: !80, line: 170, baseType: !1091, size: 32, offset: 32)
!1091 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1087, file: !80, line: 166, size: 32, elements: !1092)
!1092 = !{!1093, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1091, file: !80, line: 168, baseType: !1094, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !486, line: 124, baseType: !120)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1091, file: !80, line: 169, baseType: !1096, size: 32)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 4)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1053, file: !986, line: 611, baseType: !1086, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1053, file: !986, line: 612, baseType: !1086, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1053, file: !986, line: 613, baseType: !1102, size: 64, offset: 1088)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 8)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !1053, file: !986, line: 614, baseType: !1106, size: 192, offset: 1152)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 24)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1053, file: !986, line: 615, baseType: !36, size: 32, offset: 1344)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1053, file: !986, line: 616, baseType: !1086, size: 64, offset: 1376)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1053, file: !986, line: 617, baseType: !1086, size: 64, offset: 1440)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1053, file: !986, line: 618, baseType: !1086, size: 64, offset: 1504)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1053, file: !986, line: 619, baseType: !1086, size: 64, offset: 1568)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1053, file: !986, line: 620, baseType: !1086, size: 64, offset: 1632)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !1053, file: !986, line: 621, baseType: !36, size: 32, offset: 1696)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !1050, file: !986, line: 631, baseType: !1117, size: 2880)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1050, file: !986, line: 626, size: 2880, elements: !1118)
!1118 = !{!1119, !1123}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !1117, file: !986, line: 629, baseType: !1120, size: 1920)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1920, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 30)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !1117, file: !986, line: 630, baseType: !1124, size: 960, offset: 1920)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 960, elements: !1121)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !1008, file: !986, line: 636, baseType: !1126, size: 64, offset: 4032)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !986, line: 93, size: 6336, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1138}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1127, file: !986, line: 94, baseType: !1126, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1127, file: !986, line: 95, baseType: !36, size: 32, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1127, file: !986, line: 97, baseType: !1132, size: 2048, offset: 128)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 2048, elements: !1136)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null}
!1136 = !{!1137}
!1137 = !DISubrange(count: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !1127, file: !986, line: 98, baseType: !1139, size: 4160, offset: 2176)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !986, line: 74, size: 4160, elements: !1140)
!1140 = !{!1141, !1143, !1144, !1145}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1139, file: !986, line: 75, baseType: !1142, size: 2048)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1136)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1139, file: !986, line: 76, baseType: !1142, size: 2048, offset: 2048)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1139, file: !986, line: 78, baseType: !1040, size: 32, offset: 4096)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1139, file: !986, line: 81, baseType: !1040, size: 32, offset: 4128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !1008, file: !986, line: 637, baseType: !1127, size: 6336, offset: 4096)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !1008, file: !986, line: 641, baseType: !1148, size: 64, offset: 10432)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null, !36}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !1008, file: !986, line: 646, baseType: !1153, size: 192, offset: 10496)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !986, line: 291, size: 192, elements: !1154)
!1154 = !{!1155, !1157, !1158}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1153, file: !986, line: 293, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !1153, file: !986, line: 294, baseType: !36, size: 32, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !1153, file: !986, line: 295, baseType: !1012, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !1008, file: !986, line: 648, baseType: !1160, size: 4224, offset: 10688)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 4224, elements: !1081)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !987, file: !986, line: 199, baseType: !1162, size: 64, offset: 512)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!1006, !1007, !4, !74, !36}
