; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_mutex_check_need_init.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_mutex_check_need_init.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_mutex = type { i32, %struct.uk_thread*, %struct.uk_waitq }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }
%struct.uk_thread_list = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pte_recursive_mutexattr", scope: !2, file: !3, line: 56, type: !489, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !480)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_mutex_check_need_init.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !6, line: 92, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!12 = !{!13, !48}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !14, line: 417, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !17, line: 146, size: 320, elements: !18)
!17 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!18 = !{!19, !470, !471, !472, !473}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !16, file: !17, line: 148, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !21, line: 12, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !24, line: 51, size: 192, elements: !25)
!24 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !23, file: !24, line: 52, baseType: !27, size: 64)
!27 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !23, file: !24, line: 53, baseType: !29, size: 128, offset: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !30, line: 42, size: 128, elements: !31)
!30 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !{!32, !468}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !29, file: !30, line: 42, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !30, line: 35, size: 192, elements: !35)
!35 = !{!36, !38, !464}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !34, file: !30, line: 36, baseType: !37, size: 32)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !34, file: !30, line: 37, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !41, line: 59, size: 1024, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !47, !49, !50, !51, !57, !62, !67, !69, !70, !219, !220, !221, !434}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 60, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !40, file: !41, line: 61, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !40, file: !41, line: 62, baseType: !48, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !40, file: !41, line: 63, baseType: !48, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !40, file: !41, line: 64, baseType: !52, size: 128, offset: 256)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 64, size: 128, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !52, file: !41, line: 64, baseType: !39, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !52, file: !41, line: 64, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !41, line: 65, baseType: !58, size: 32, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 48, baseType: !60)
!59 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !61, line: 79, baseType: !7)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !40, file: !41, line: 66, baseType: !63, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !64, line: 49, baseType: !65)
!64 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !66, line: 128, baseType: !27)
!66 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !40, file: !41, line: 67, baseType: !68, size: 8, offset: 512)
!68 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !40, file: !41, line: 68, baseType: !29, size: 128, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !40, file: !41, line: 69, baseType: !71, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !73, line: 90, size: 2176, elements: !74)
!73 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !{!75, !80, !98, !103, !105, !107, !112, !120, !125, !131, !132, !133, !138, !216, !217, !218}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !72, file: !73, line: 91, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !73, line: 68, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !71}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !72, file: !73, line: 93, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !73, line: 71, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!37, !71, !39, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !88, line: 62, baseType: !89)
!88 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !88, line: 55, size: 128, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !89, file: !88, line: 57, baseType: !68, size: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !89, file: !88, line: 59, baseType: !93, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !88, line: 53, baseType: !37)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !89, file: !88, line: 61, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !64, line: 48, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !66, line: 129, baseType: !97)
!97 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !72, file: !73, line: 94, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !73, line: 74, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !71, !39}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !72, file: !73, line: 95, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !73, line: 76, baseType: !100)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !72, file: !73, line: 96, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !73, line: 78, baseType: !100)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !72, file: !73, line: 98, baseType: !108, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !73, line: 81, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!37, !71, !39, !93}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !72, file: !73, line: 99, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !73, line: 83, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!37, !71, !117, !119}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !72, file: !73, line: 100, baseType: !121, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !73, line: 85, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!37, !71, !39, !37}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !72, file: !73, line: 101, baseType: !126, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !73, line: 87, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!37, !71, !117, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !72, file: !73, line: 104, baseType: !68, size: 8, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !72, file: !73, line: 105, baseType: !40, size: 1024, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !72, file: !73, line: 106, baseType: !134, size: 128, offset: 1664)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !41, line: 93, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !134, file: !41, line: 93, baseType: !39, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !134, file: !41, line: 93, baseType: !56, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !72, file: !73, line: 107, baseType: !139, size: 192, offset: 1792)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !140, line: 59, size: 192, elements: !141)
!140 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!141 = !{!142, !207, !211}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !139, file: !140, line: 61, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !140, line: 51, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!48, !147, !97, !97}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !149, line: 77, size: 832, elements: !150)
!149 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!150 = !{!151, !158, !163, !168, !174, !176, !181, !182, !183, !188, !193, !198, !199, !200}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !148, file: !149, line: 79, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !149, line: 54, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!48, !147, !156}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 58, baseType: !97)
!157 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !148, file: !149, line: 80, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !149, line: 56, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!48, !147, !156, !156}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !148, file: !149, line: 81, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !149, line: 62, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!48, !147, !48, !156}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !148, file: !149, line: 82, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !149, line: 58, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!37, !147, !173, !156, !156}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !148, file: !149, line: 83, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !149, line: 60, baseType: !160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !148, file: !149, line: 84, baseType: !177, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !149, line: 64, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !147, !48}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !148, file: !149, line: 87, baseType: !177, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !148, file: !149, line: 88, baseType: !152, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !148, file: !149, line: 92, baseType: !184, size: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !149, line: 66, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!48, !147, !97}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !148, file: !149, line: 93, baseType: !189, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !149, line: 68, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !147, !48, !97}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !148, file: !149, line: 99, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !149, line: 70, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!37, !147, !48, !156}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !149, line: 100, baseType: !156, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !149, line: 103, baseType: !147, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !148, file: !149, line: 104, baseType: !201, offset: 832)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, elements: !205)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !59, line: 20, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !61, line: 41, baseType: !204)
!204 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!205 = !{!206}
!206 = !DISubrange(count: -1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !139, file: !140, line: 63, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !48}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !139, file: !140, line: 65, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !140, line: 56, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !48, !48}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !72, file: !73, line: 108, baseType: !147, size: 64, offset: 1984)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !73, line: 109, baseType: !71, size: 64, offset: 2048)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !72, file: !73, line: 110, baseType: !48, size: 64, offset: 2112)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !40, file: !41, line: 70, baseType: !48, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !40, file: !41, line: 72, baseType: !37, size: 32, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !40, file: !41, line: 82, baseType: !222, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !224, line: 569, size: 14912, elements: !225)
!224 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!225 = !{!226, !227, !302, !303, !304, !305, !309, !310, !313, !314, !318, !330, !331, !332, !334, !335, !336, !398, !419, !420, !425, !432}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !223, file: !224, line: 571, baseType: !37, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !223, file: !224, line: 576, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !224, line: 287, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !224, line: 181, size: 1408, elements: !231)
!231 = !{!232, !235, !236, !237, !239, !240, !245, !246, !247, !254, !258, !263, !267, !268, !269, !270, !274, !278, !279, !280, !282, !283, !287, !301}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !230, file: !224, line: 182, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !230, file: !224, line: 183, baseType: !37, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !230, file: !224, line: 184, baseType: !37, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !230, file: !224, line: 185, baseType: !238, size: 16, offset: 128)
!238 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !230, file: !224, line: 186, baseType: !238, size: 16, offset: 144)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !230, file: !224, line: 187, baseType: !241, size: 128, offset: 192)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !224, line: 117, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !241, file: !224, line: 118, baseType: !233, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !241, file: !224, line: 119, baseType: !37, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !230, file: !224, line: 188, baseType: !37, size: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !230, file: !224, line: 195, baseType: !48, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !230, file: !224, line: 197, baseType: !248, size: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !222, !48, !253, !37}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !252, line: 145, baseType: !27)
!252 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !230, file: !224, line: 199, baseType: !255, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!251, !222, !48, !44, !37}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !230, file: !224, line: 202, baseType: !259, size: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !222, !48, !262, !37}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !252, line: 114, baseType: !27)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !230, file: !224, line: 203, baseType: !264, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!37, !222, !48}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !230, file: !224, line: 206, baseType: !241, size: 128, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !230, file: !224, line: 207, baseType: !233, size: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !230, file: !224, line: 208, baseType: !37, size: 32, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !230, file: !224, line: 211, baseType: !271, size: 24, offset: 928)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 24, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !230, file: !224, line: 212, baseType: !275, size: 8, offset: 952)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 8, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !230, file: !224, line: 215, baseType: !241, size: 128, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !230, file: !224, line: 218, baseType: !37, size: 32, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !230, file: !224, line: 219, baseType: !281, size: 64, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !252, line: 44, baseType: !27)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !230, file: !224, line: 222, baseType: !222, size: 64, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !230, file: !224, line: 226, baseType: !284, size: 32, offset: 1280)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !252, line: 175, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !286, line: 12, baseType: !37)
!286 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !230, file: !224, line: 228, baseType: !288, size: 64, offset: 1312)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !252, line: 171, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 163, size: 64, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !289, file: !252, line: 165, baseType: !37, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !289, file: !252, line: 170, baseType: !293, size: 32, offset: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !289, file: !252, line: 166, size: 32, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !293, file: !252, line: 168, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !157, line: 124, baseType: !7)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !293, file: !252, line: 169, baseType: !298, size: 32)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 32, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 4)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !230, file: !224, line: 229, baseType: !37, size: 32, offset: 1376)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !223, file: !224, line: 576, baseType: !228, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !223, file: !224, line: 576, baseType: !228, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !223, file: !224, line: 578, baseType: !37, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !223, file: !224, line: 579, baseType: !306, size: 200, offset: 288)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 200, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 25)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !223, file: !224, line: 582, baseType: !37, size: 32, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !223, file: !224, line: 583, baseType: !311, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !224, line: 40, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !223, file: !224, line: 585, baseType: !37, size: 32, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !223, file: !224, line: 587, baseType: !315, size: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !222}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !223, file: !224, line: 590, baseType: !319, size: 64, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !224, line: 47, size: 256, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !320, file: !224, line: 49, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !320, file: !224, line: 50, baseType: !37, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !320, file: !224, line: 50, baseType: !37, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !320, file: !224, line: 50, baseType: !37, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !320, file: !224, line: 50, baseType: !37, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !320, file: !224, line: 51, baseType: !328, size: 32, offset: 192)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 32, elements: !276)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !224, line: 25, baseType: !7)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !223, file: !224, line: 591, baseType: !37, size: 32, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !223, file: !224, line: 592, baseType: !319, size: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !223, file: !224, line: 593, baseType: !333, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !223, file: !224, line: 596, baseType: !37, size: 32, offset: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !223, file: !224, line: 597, baseType: !253, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !223, file: !224, line: 632, baseType: !337, size: 2880, offset: 1152)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !224, line: 599, size: 2880, elements: !338)
!338 = !{!339, !389}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !337, file: !224, line: 622, baseType: !340, size: 1728)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !224, line: 601, size: 1728, elements: !341)
!341 = !{!342, !343, !344, !348, !360, !361, !363, !371, !372, !373, !374, !378, !382, !383, !384, !385, !386, !387, !388}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !340, file: !224, line: 603, baseType: !7, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !340, file: !224, line: 604, baseType: !253, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !340, file: !224, line: 605, baseType: !345, size: 208, offset: 128)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 208, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 26)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !340, file: !224, line: 606, baseType: !349, size: 288, offset: 352)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !224, line: 55, size: 288, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !349, file: !224, line: 57, baseType: !37, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !349, file: !224, line: 58, baseType: !37, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !349, file: !224, line: 59, baseType: !37, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !349, file: !224, line: 60, baseType: !37, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !349, file: !224, line: 61, baseType: !37, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !349, file: !224, line: 62, baseType: !37, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !349, file: !224, line: 63, baseType: !37, size: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !349, file: !224, line: 64, baseType: !37, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !349, file: !224, line: 65, baseType: !37, size: 32, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !340, file: !224, line: 607, baseType: !37, size: 32, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !340, file: !224, line: 608, baseType: !362, size: 64, offset: 704)
!362 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !340, file: !224, line: 609, baseType: !364, size: 112, offset: 768)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !224, line: 319, size: 112, elements: !365)
!365 = !{!366, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !364, file: !224, line: 320, baseType: !367, size: 48)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 48, elements: !272)
!368 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !364, file: !224, line: 321, baseType: !367, size: 48, offset: 48)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !364, file: !224, line: 322, baseType: !368, size: 16, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !340, file: !224, line: 610, baseType: !288, size: 64, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !340, file: !224, line: 611, baseType: !288, size: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !340, file: !224, line: 612, baseType: !288, size: 64, offset: 1024)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !340, file: !224, line: 613, baseType: !375, size: 64, offset: 1088)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !340, file: !224, line: 614, baseType: !379, size: 192, offset: 1152)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 24)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !340, file: !224, line: 615, baseType: !37, size: 32, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !340, file: !224, line: 616, baseType: !288, size: 64, offset: 1376)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !340, file: !224, line: 617, baseType: !288, size: 64, offset: 1440)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !340, file: !224, line: 618, baseType: !288, size: 64, offset: 1504)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !340, file: !224, line: 619, baseType: !288, size: 64, offset: 1568)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !340, file: !224, line: 620, baseType: !288, size: 64, offset: 1632)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !340, file: !224, line: 621, baseType: !37, size: 32, offset: 1696)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !337, file: !224, line: 631, baseType: !390, size: 2880)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !224, line: 626, size: 2880, elements: !391)
!391 = !{!392, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !390, file: !224, line: 629, baseType: !393, size: 1920)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 1920, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 30)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !390, file: !224, line: 630, baseType: !397, size: 960, offset: 1920)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !394)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !223, file: !224, line: 636, baseType: !399, size: 64, offset: 4032)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !224, line: 93, size: 6336, elements: !401)
!401 = !{!402, !403, !404, !411}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !400, file: !224, line: 94, baseType: !399, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !400, file: !224, line: 95, baseType: !37, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !400, file: !224, line: 97, baseType: !405, size: 2048, offset: 128)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 2048, elements: !409)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null}
!409 = !{!410}
!410 = !DISubrange(count: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !400, file: !224, line: 98, baseType: !412, size: 4160, offset: 2176)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !224, line: 74, size: 4160, elements: !413)
!413 = !{!414, !416, !417, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !412, file: !224, line: 75, baseType: !415, size: 2048)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !409)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !412, file: !224, line: 76, baseType: !415, size: 2048, offset: 2048)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !412, file: !224, line: 78, baseType: !329, size: 32, offset: 4096)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !412, file: !224, line: 81, baseType: !329, size: 32, offset: 4128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !223, file: !224, line: 637, baseType: !400, size: 6336, offset: 4096)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !223, file: !224, line: 641, baseType: !421, size: 64, offset: 10432)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !37}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !223, file: !224, line: 646, baseType: !426, size: 192, offset: 10496)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !224, line: 291, size: 192, elements: !427)
!427 = !{!428, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !426, file: !224, line: 293, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !426, file: !224, line: 294, baseType: !37, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !426, file: !224, line: 295, baseType: !228, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !223, file: !224, line: 648, baseType: !433, size: 4224, offset: 10688)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 4224, elements: !272)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !40, file: !41, line: 85, baseType: !435, size: 64, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !6, line: 114, size: 640, elements: !437)
!437 = !{!438, !442, !443, !450, !463}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !436, file: !6, line: 116, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !440, line: 64, baseType: !441)
!440 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !440, line: 63, baseType: !97)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !436, file: !6, line: 118, baseType: !439, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !436, file: !6, line: 120, baseType: !444, size: 128, offset: 128)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !445, line: 51, size: 128, elements: !446)
!445 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!446 = !{!447, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !445, line: 52, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !444, file: !445, line: 53, baseType: !448, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !436, file: !6, line: 122, baseType: !451, size: 256, offset: 256)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !6, line: 98, size: 256, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !451, file: !6, line: 107, baseType: !5, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !451, file: !6, line: 109, baseType: !439, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !451, file: !6, line: 111, baseType: !456, size: 96, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !440, line: 72, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 68, size: 96, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !457, file: !440, line: 69, baseType: !37, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !457, file: !440, line: 70, baseType: !37, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !457, file: !440, line: 71, baseType: !462, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !440, line: 61, baseType: !37)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !436, file: !6, line: 124, baseType: !444, size: 128, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !34, file: !30, line: 38, baseType: !465, size: 64, offset: 128)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !34, file: !30, line: 38, size: 64, elements: !466)
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !465, file: !30, line: 38, baseType: !33, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !29, file: !30, line: 42, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !16, file: !17, line: 149, baseType: !37, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !16, file: !17, line: 156, baseType: !37, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !16, file: !17, line: 159, baseType: !37, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !16, file: !17, line: 160, baseType: !474, size: 128, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !14, line: 413, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !14, line: 411, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 395, size: 128, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !476, file: !14, line: 398, baseType: !48, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !476, file: !14, line: 399, baseType: !7, size: 32, offset: 64)
!480 = !{!0, !481, !487, !491}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "pte_recursive_mutexattr_s", scope: !2, file: !3, line: 48, type: !483, isLocal: true, isDefinition: true)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutexattr_t_", file: !17, line: 163, size: 64, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pshared", scope: !483, file: !17, line: 165, baseType: !37, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !483, file: !17, line: 166, baseType: !37, size: 32, offset: 32)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "pte_errorcheck_mutexattr", scope: !2, file: !3, line: 57, type: !489, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutexattr_t", file: !14, line: 418, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "pte_errorcheck_mutexattr_s", scope: !2, file: !3, line: 52, type: !483, isLocal: true, isDefinition: true)
!493 = !{i32 2, !"Dwarf Version", i32 4}
!494 = !{i32 2, !"Debug Info Version", i32 3}
!495 = !{i32 1, !"wchar_size", i32 4}
!496 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!497 = distinct !DISubprogram(name: "pte_mutex_check_need_init", scope: !3, file: !3, line: 61, type: !498, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !501)
!498 = !DISubroutineType(types: !499)
!499 = !{!37, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!501 = !{!502, !503, !504}
!502 = !DILocalVariable(name: "mutex", arg: 1, scope: !497, file: !3, line: 61, type: !500)
!503 = !DILocalVariable(name: "result", scope: !497, file: !3, line: 63, type: !37)
!504 = !DILocalVariable(name: "mtx", scope: !497, file: !3, line: 64, type: !13)
!505 = !DILocation(line: 61, column: 46, scope: !497)
!506 = !DILocation(line: 63, column: 16, scope: !497)
!507 = !DILocation(line: 89, column: 20, scope: !497)
!508 = !{!509, !509, i64 0}
!509 = !{!"any pointer", !510, i64 0}
!510 = !{!"omnipotent char", !511, i64 0}
!511 = !{!"Simple C/C++ TBAA"}
!512 = !DILocation(line: 89, column: 3, scope: !497)
!513 = !DILocation(line: 99, column: 9, scope: !497)
!514 = !DILocation(line: 64, column: 28, scope: !497)
!515 = !DILocation(line: 101, column: 7, scope: !497)
!516 = !DILocation(line: 103, column: 16, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 102, column: 5)
!518 = distinct !DILexicalBlock(scope: !497, file: !3, line: 101, column: 7)
!519 = !DILocation(line: 104, column: 5, scope: !517)
!520 = !DILocation(line: 107, column: 16, scope: !521)
!521 = distinct !DILexicalBlock(scope: !522, file: !3, line: 106, column: 5)
!522 = distinct !DILexicalBlock(scope: !518, file: !3, line: 105, column: 12)
!523 = !DILocation(line: 108, column: 5, scope: !521)
!524 = !DILocation(line: 111, column: 16, scope: !525)
!525 = distinct !DILexicalBlock(scope: !526, file: !3, line: 110, column: 5)
!526 = distinct !DILexicalBlock(scope: !522, file: !3, line: 109, column: 12)
!527 = !DILocation(line: 112, column: 5, scope: !525)
!528 = !DILocation(line: 121, column: 5, scope: !529)
!529 = distinct !DILexicalBlock(scope: !530, file: !3, line: 114, column: 5)
!530 = distinct !DILexicalBlock(scope: !526, file: !3, line: 113, column: 12)
!531 = !DILocation(line: 0, scope: !497)
!532 = !DILocation(line: 123, column: 21, scope: !497)
!533 = !DILocation(line: 123, column: 3, scope: !497)
!534 = !DILocation(line: 125, column: 3, scope: !497)
