; ModuleID = '/root/.unikraft/libs/pthread-embedded/pte_osal.c'
source_filename = "/root/.unikraft/libs/pthread-embedded/pte_osal.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_alloc = type { i8* (%struct.uk_alloc*, i64)*, {}*, i8* (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8**, i64, i64)*, {}*, void (%struct.uk_alloc*, i8*)*, void (%struct.uk_alloc*, i8*)*, i8* (%struct.uk_alloc*, i64)*, i8* (%struct.uk_alloc*, i64)*, void (%struct.uk_alloc*, i8*, i64)*, i32 (%struct.uk_alloc*, i8*, i64)*, i64, %struct.uk_alloc*, [0 x i8] }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon.0 }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__uk_inittab39_pthread_initcall", scope: !2, file: !3, line: 68, type: !529, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !493)
!3 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/pte_osal.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{!5, !15, !21}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pte_osResult", file: !6, line: 38, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_generic_osal.h", directory: "/root/.unikraft/apps/redis/build")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "PTE_OS_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PTE_OS_NO_RESOURCES", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PTE_OS_GENERAL_FAILURE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PTE_OS_TIMEOUT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PTE_OS_INTERRUPTED", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PTE_OS_INVALID_PARAM", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !16, line: 92, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ukplat_gstate", file: !22, line: 68, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/bootstrap.h", directory: "/root/.unikraft/apps/redis/build")
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "UKPLAT_HALT", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "UKPLAT_RESTART", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "UKPLAT_SUSPEND", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "UKPLAT_CRASH", value: 3, isUnsigned: true)
!28 = !{!29, !30, !473, !137, !104}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !33, line: 59, size: 1024, elements: !34)
!33 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!34 = !{!35, !39, !40, !41, !42, !47, !52, !58, !60, !77, !228, !229, !230, !443}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !33, line: 60, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !32, file: !33, line: 61, baseType: !29, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !32, file: !33, line: 62, baseType: !29, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !32, file: !33, line: 63, baseType: !29, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !32, file: !33, line: 64, baseType: !43, size: 128, offset: 256)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !32, file: !33, line: 64, size: 128, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !43, file: !33, line: 64, baseType: !31, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !43, file: !33, line: 64, baseType: !30, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !33, line: 65, baseType: !48, size: 32, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 48, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !51, line: 79, baseType: !7)
!51 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !32, file: !33, line: 66, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !54, line: 49, baseType: !55)
!54 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !56, line: 128, baseType: !57)
!56 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!57 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !32, file: !33, line: 67, baseType: !59, size: 8, offset: 512)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !32, file: !33, line: 68, baseType: !61, size: 128, offset: 576)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !62, line: 42, size: 128, elements: !63)
!62 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!63 = !{!64, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !61, file: !62, line: 42, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !62, line: 35, size: 192, elements: !67)
!67 = !{!68, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !66, file: !62, line: 36, baseType: !69, size: 32)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !66, file: !62, line: 37, baseType: !31, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !66, file: !62, line: 38, baseType: !72, size: 64, offset: 128)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !62, line: 38, size: 64, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !72, file: !62, line: 38, baseType: !65, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !61, file: !62, line: 42, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !32, file: !33, line: 69, baseType: !78, size: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !80, line: 90, size: 2176, elements: !81)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !{!82, !87, !105, !110, !112, !114, !119, !127, !132, !138, !139, !140, !145, !225, !226, !227}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !79, file: !80, line: 91, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !80, line: 68, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !78}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !79, file: !80, line: 93, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !80, line: 71, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!69, !78, !31, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !95, line: 55, size: 128, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !96, file: !95, line: 57, baseType: !59, size: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !96, file: !95, line: 59, baseType: !100, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !95, line: 53, baseType: !69)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !96, file: !95, line: 61, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !54, line: 48, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !56, line: 129, baseType: !104)
!104 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !79, file: !80, line: 94, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !80, line: 74, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !78, !31}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !79, file: !80, line: 95, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !80, line: 76, baseType: !107)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !79, file: !80, line: 96, baseType: !113, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !80, line: 78, baseType: !107)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !79, file: !80, line: 98, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !80, line: 81, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!69, !78, !31, !100}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !79, file: !80, line: 99, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !80, line: 83, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!69, !78, !124, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !79, file: !80, line: 100, baseType: !128, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !80, line: 85, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!69, !78, !31, !69}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !79, file: !80, line: 101, baseType: !133, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !80, line: 87, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!69, !78, !124, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !79, file: !80, line: 104, baseType: !59, size: 8, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !79, file: !80, line: 105, baseType: !32, size: 1024, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !79, file: !80, line: 106, baseType: !141, size: 128, offset: 1664)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !33, line: 93, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !141, file: !33, line: 93, baseType: !31, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !141, file: !33, line: 93, baseType: !30, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !79, file: !80, line: 107, baseType: !146, size: 192, offset: 1792)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !147, line: 59, size: 192, elements: !148)
!147 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!148 = !{!149, !216, !220}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !146, file: !147, line: 61, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !147, line: 51, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!29, !154, !104, !104}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !156, line: 77, size: 832, elements: !157)
!156 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!157 = !{!158, !167, !172, !177, !183, !185, !190, !191, !192, !197, !202, !207, !208, !209}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !155, file: !156, line: 79, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !156, line: 54, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!29, !154, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !164, line: 40, baseType: !165)
!164 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !166, line: 129, baseType: !104)
!166 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !155, file: !156, line: 80, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !156, line: 56, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!29, !154, !163, !163}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !155, file: !156, line: 81, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !156, line: 62, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!29, !154, !29, !163}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !155, file: !156, line: 82, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !156, line: 58, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!69, !154, !182, !163, !163}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !155, file: !156, line: 83, baseType: !184, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !156, line: 60, baseType: !169)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !155, file: !156, line: 84, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !156, line: 64, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !154, !29}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !155, file: !156, line: 87, baseType: !186, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !155, file: !156, line: 88, baseType: !159, size: 64, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !155, file: !156, line: 92, baseType: !193, size: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !156, line: 66, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!29, !154, !104}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !155, file: !156, line: 93, baseType: !198, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !156, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !154, !29, !104}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !155, file: !156, line: 99, baseType: !203, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !156, line: 70, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!69, !154, !29, !163}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !155, file: !156, line: 100, baseType: !163, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !156, line: 103, baseType: !154, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !155, file: !156, line: 104, baseType: !210, offset: 832)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, elements: !214)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !49, line: 20, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !51, line: 41, baseType: !213)
!213 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!214 = !{!215}
!215 = !DISubrange(count: -1)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !146, file: !147, line: 63, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !29}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !146, file: !147, line: 65, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !147, line: 56, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !29, !29}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !79, file: !80, line: 108, baseType: !154, size: 64, offset: 1984)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !80, line: 109, baseType: !78, size: 64, offset: 2048)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !79, file: !80, line: 110, baseType: !29, size: 64, offset: 2112)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !32, file: !33, line: 70, baseType: !29, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !32, file: !33, line: 72, baseType: !69, size: 32, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !32, file: !33, line: 82, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !233, line: 569, size: 14912, elements: !234)
!233 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!234 = !{!235, !236, !311, !312, !313, !314, !318, !319, !322, !323, !327, !339, !340, !341, !343, !344, !345, !407, !428, !429, !434, !441}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !232, file: !233, line: 571, baseType: !69, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !232, file: !233, line: 576, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !233, line: 287, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !233, line: 181, size: 1408, elements: !240)
!240 = !{!241, !244, !245, !246, !248, !249, !254, !255, !256, !262, !266, !271, !275, !276, !277, !278, !282, !286, !287, !288, !290, !291, !295, !310}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !239, file: !233, line: 182, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !239, file: !233, line: 183, baseType: !69, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !239, file: !233, line: 184, baseType: !69, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !233, line: 185, baseType: !247, size: 16, offset: 128)
!247 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !239, file: !233, line: 186, baseType: !247, size: 16, offset: 144)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !239, file: !233, line: 187, baseType: !250, size: 128, offset: 192)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !233, line: 117, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !250, file: !233, line: 118, baseType: !242, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !250, file: !233, line: 119, baseType: !69, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !239, file: !233, line: 188, baseType: !69, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !239, file: !233, line: 195, baseType: !29, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !239, file: !233, line: 197, baseType: !257, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !231, !29, !261, !69}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !166, line: 145, baseType: !57)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !239, file: !233, line: 199, baseType: !263, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!260, !231, !29, !36, !69}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !239, file: !233, line: 202, baseType: !267, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !231, !29, !270, !69}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !166, line: 114, baseType: !57)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !239, file: !233, line: 203, baseType: !272, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!69, !231, !29}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !239, file: !233, line: 206, baseType: !250, size: 128, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !239, file: !233, line: 207, baseType: !242, size: 64, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !239, file: !233, line: 208, baseType: !69, size: 32, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !239, file: !233, line: 211, baseType: !279, size: 24, offset: 928)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 24, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 3)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !239, file: !233, line: 212, baseType: !283, size: 8, offset: 952)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 8, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 1)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !239, file: !233, line: 215, baseType: !250, size: 128, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !239, file: !233, line: 218, baseType: !69, size: 32, offset: 1088)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !233, line: 219, baseType: !289, size: 64, offset: 1152)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !166, line: 44, baseType: !57)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !239, file: !233, line: 222, baseType: !231, size: 64, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !233, line: 226, baseType: !292, size: 32, offset: 1280)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !166, line: 175, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !294, line: 12, baseType: !69)
!294 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !239, file: !233, line: 228, baseType: !296, size: 64, offset: 1312)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !166, line: 171, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 163, size: 64, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !297, file: !166, line: 165, baseType: !69, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !297, file: !166, line: 170, baseType: !301, size: 32, offset: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !297, file: !166, line: 166, size: 32, elements: !302)
!302 = !{!303, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !301, file: !166, line: 168, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !305, line: 124, baseType: !7)
!305 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !301, file: !166, line: 169, baseType: !307, size: 32)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 32, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 4)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !233, line: 229, baseType: !69, size: 32, offset: 1376)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !232, file: !233, line: 576, baseType: !237, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !232, file: !233, line: 576, baseType: !237, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !232, file: !233, line: 578, baseType: !69, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !232, file: !233, line: 579, baseType: !315, size: 200, offset: 288)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 200, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 25)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !232, file: !233, line: 582, baseType: !69, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !232, file: !233, line: 583, baseType: !320, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !233, line: 40, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !232, file: !233, line: 585, baseType: !69, size: 32, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !232, file: !233, line: 587, baseType: !324, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !231}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !232, file: !233, line: 590, baseType: !328, size: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !233, line: 47, size: 256, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !329, file: !233, line: 49, baseType: !328, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !329, file: !233, line: 50, baseType: !69, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !329, file: !233, line: 51, baseType: !337, size: 32, offset: 192)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 32, elements: !284)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !233, line: 25, baseType: !7)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !232, file: !233, line: 591, baseType: !69, size: 32, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !232, file: !233, line: 592, baseType: !328, size: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !232, file: !233, line: 593, baseType: !342, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !232, file: !233, line: 596, baseType: !69, size: 32, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !232, file: !233, line: 597, baseType: !261, size: 64, offset: 1088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !232, file: !233, line: 632, baseType: !346, size: 2880, offset: 1152)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !233, line: 599, size: 2880, elements: !347)
!347 = !{!348, !398}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !346, file: !233, line: 622, baseType: !349, size: 1728)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !233, line: 601, size: 1728, elements: !350)
!350 = !{!351, !352, !353, !357, !369, !370, !372, !380, !381, !382, !383, !387, !391, !392, !393, !394, !395, !396, !397}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !349, file: !233, line: 603, baseType: !7, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !349, file: !233, line: 604, baseType: !261, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !349, file: !233, line: 605, baseType: !354, size: 208, offset: 128)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 208, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 26)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !349, file: !233, line: 606, baseType: !358, size: 288, offset: 352)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !233, line: 55, size: 288, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !358, file: !233, line: 57, baseType: !69, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !358, file: !233, line: 58, baseType: !69, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !358, file: !233, line: 59, baseType: !69, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !358, file: !233, line: 60, baseType: !69, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !358, file: !233, line: 61, baseType: !69, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !358, file: !233, line: 62, baseType: !69, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !358, file: !233, line: 63, baseType: !69, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !358, file: !233, line: 64, baseType: !69, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !358, file: !233, line: 65, baseType: !69, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !349, file: !233, line: 607, baseType: !69, size: 32, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !349, file: !233, line: 608, baseType: !371, size: 64, offset: 704)
!371 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !349, file: !233, line: 609, baseType: !373, size: 112, offset: 768)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !233, line: 319, size: 112, elements: !374)
!374 = !{!375, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !373, file: !233, line: 320, baseType: !376, size: 48)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 48, elements: !280)
!377 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !373, file: !233, line: 321, baseType: !376, size: 48, offset: 48)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !373, file: !233, line: 322, baseType: !377, size: 16, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !349, file: !233, line: 610, baseType: !296, size: 64, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !349, file: !233, line: 611, baseType: !296, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !349, file: !233, line: 612, baseType: !296, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !349, file: !233, line: 613, baseType: !384, size: 64, offset: 1088)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !349, file: !233, line: 614, baseType: !388, size: 192, offset: 1152)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 24)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !349, file: !233, line: 615, baseType: !69, size: 32, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !349, file: !233, line: 616, baseType: !296, size: 64, offset: 1376)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !349, file: !233, line: 617, baseType: !296, size: 64, offset: 1440)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !349, file: !233, line: 618, baseType: !296, size: 64, offset: 1504)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !349, file: !233, line: 619, baseType: !296, size: 64, offset: 1568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !349, file: !233, line: 620, baseType: !296, size: 64, offset: 1632)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !349, file: !233, line: 621, baseType: !69, size: 32, offset: 1696)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !346, file: !233, line: 631, baseType: !399, size: 2880)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !233, line: 626, size: 2880, elements: !400)
!400 = !{!401, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !399, file: !233, line: 629, baseType: !402, size: 1920)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 1920, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 30)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !399, file: !233, line: 630, baseType: !406, size: 960, offset: 1920)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !403)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !232, file: !233, line: 636, baseType: !408, size: 64, offset: 4032)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !233, line: 93, size: 6336, elements: !410)
!410 = !{!411, !412, !413, !420}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !409, file: !233, line: 94, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !409, file: !233, line: 95, baseType: !69, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !409, file: !233, line: 97, baseType: !414, size: 2048, offset: 128)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 2048, elements: !418)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null}
!418 = !{!419}
!419 = !DISubrange(count: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !409, file: !233, line: 98, baseType: !421, size: 4160, offset: 2176)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !233, line: 74, size: 4160, elements: !422)
!422 = !{!423, !425, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !421, file: !233, line: 75, baseType: !424, size: 2048)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !418)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !421, file: !233, line: 76, baseType: !424, size: 2048, offset: 2048)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !421, file: !233, line: 78, baseType: !338, size: 32, offset: 4096)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !421, file: !233, line: 81, baseType: !338, size: 32, offset: 4128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !232, file: !233, line: 637, baseType: !409, size: 6336, offset: 4096)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !232, file: !233, line: 641, baseType: !430, size: 64, offset: 10432)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !69}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !232, file: !233, line: 646, baseType: !435, size: 192, offset: 10496)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !233, line: 291, size: 192, elements: !436)
!436 = !{!437, !439, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !435, file: !233, line: 293, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !435, file: !233, line: 294, baseType: !69, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !435, file: !233, line: 295, baseType: !237, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !232, file: !233, line: 648, baseType: !442, size: 4224, offset: 10688)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 4224, elements: !280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !32, file: !33, line: 85, baseType: !444, size: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !16, line: 114, size: 640, elements: !446)
!446 = !{!447, !451, !452, !459, !472}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !445, file: !16, line: 116, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !449, line: 64, baseType: !450)
!449 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !449, line: 63, baseType: !104)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !445, file: !16, line: 118, baseType: !448, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !445, file: !16, line: 120, baseType: !453, size: 128, offset: 128)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !454, line: 51, size: 128, elements: !455)
!454 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !454, line: 52, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !454, line: 53, baseType: !457, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !445, file: !16, line: 122, baseType: !460, size: 256, offset: 256)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !16, line: 98, size: 256, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !460, file: !16, line: 107, baseType: !15, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !460, file: !16, line: 109, baseType: !448, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !460, file: !16, line: 111, baseType: !465, size: 96, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !449, line: 72, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !449, line: 68, size: 96, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !466, file: !449, line: 69, baseType: !69, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !466, file: !449, line: 70, baseType: !69, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !466, file: !449, line: 71, baseType: !471, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !449, line: 61, baseType: !69)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !445, file: !16, line: 124, baseType: !453, size: 128, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_data_t", file: !3, line: 54, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 39, size: 704, elements: !476)
!476 = !{!477, !482, !483, !484, !485, !491, !492}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "entry_point", scope: !475, file: !3, line: 41, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadEntryPoint", file: !6, line: 124, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!69, !29}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !475, file: !3, line: 43, baseType: !29, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uk_thread", scope: !475, file: !3, line: 45, baseType: !31, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !475, file: !3, line: 47, baseType: !29, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start_sem", scope: !475, file: !3, line: 49, baseType: !486, size: 192, offset: 256)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !487, line: 51, size: 192, elements: !488)
!487 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !486, file: !487, line: 52, baseType: !57, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !486, file: !487, line: 53, baseType: !61, size: 128, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_sem", scope: !475, file: !3, line: 51, baseType: !486, size: 192, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !475, file: !3, line: 53, baseType: !69, size: 32, offset: 640)
!493 = !{!0, !494, !516, !521, !527}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__str", scope: !496, file: !497, line: 190, type: !513, isLocal: true, isDefinition: true)
!496 = distinct !DISubprogram(name: "uk_pr_err", scope: !497, file: !497, line: 186, type: !498, isLocal: true, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !500)
!497 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!498 = !DISubroutineType(types: !499)
!499 = !{null, !36, null}
!500 = !{!501, !502}
!501 = !DILocalVariable(name: "fmt", arg: 1, scope: !496, file: !497, line: 186, type: !36)
!502 = !DILocalVariable(name: "argp", scope: !496, file: !497, line: 188, type: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !504, line: 32, baseType: !505)
!504 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 164, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 192, elements: !284)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 164, size: 192, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !507, file: !3, line: 164, baseType: !7, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !507, file: !3, line: 164, baseType: !7, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !507, file: !3, line: 164, baseType: !29, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !507, file: !3, line: 164, baseType: !29, size: 64, offset: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 20)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "__str", scope: !496, file: !497, line: 190, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 88, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 11)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "__str", scope: !523, file: !497, line: 198, type: !513, isLocal: true, isDefinition: true)
!523 = distinct !DISubprogram(name: "uk_pr_crit", scope: !497, file: !497, line: 194, type: !498, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !524)
!524 = !{!525, !526}
!525 = !DILocalVariable(name: "fmt", arg: 1, scope: !523, file: !497, line: 194, type: !36)
!526 = !DILocalVariable(name: "argp", scope: !523, file: !497, line: 196, type: !503)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "__str", scope: !523, file: !497, line: 198, type: !518, isLocal: true, isDefinition: true)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_init_func_t", file: !531, line: 43, baseType: !532)
!531 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/init.h", directory: "/root/.unikraft/apps/redis/build")
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!69}
!535 = !{i32 2, !"Dwarf Version", i32 4}
!536 = !{i32 2, !"Debug Info Version", i32 3}
!537 = !{i32 1, !"wchar_size", i32 4}
!538 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!539 = distinct !DISubprogram(name: "pthread_initcall", scope: !3, file: !3, line: 63, type: !533, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!540 = !{}
!541 = !DILocation(line: 66, column: 9, scope: !539)
!542 = !DILocation(line: 66, column: 2, scope: !539)
!543 = distinct !DISubprogram(name: "pte_osInit", scope: !3, file: !3, line: 70, type: !544, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !547)
!544 = !DISubroutineType(types: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osResult", file: !6, line: 60, baseType: !5)
!547 = !{!548, !549, !550}
!548 = !DILocalVariable(name: "result", scope: !543, file: !3, line: 72, type: !546)
!549 = !DILocalVariable(name: "ptd", scope: !543, file: !3, line: 73, type: !473)
!550 = !DILocalVariable(name: "crnt", scope: !543, file: !3, line: 74, type: !31)
!551 = !DILocation(line: 72, column: 15, scope: !543)
!552 = !DILocation(line: 77, column: 11, scope: !543)
!553 = !DILocation(line: 78, column: 13, scope: !554)
!554 = distinct !DILexicalBlock(scope: !543, file: !3, line: 78, column: 6)
!555 = !DILocation(line: 78, column: 6, scope: !543)
!556 = !DILocation(line: 79, column: 3, scope: !557)
!557 = distinct !DILexicalBlock(scope: !554, file: !3, line: 78, column: 27)
!558 = !DILocation(line: 80, column: 3, scope: !557)
!559 = !DILocation(line: 84, column: 8, scope: !543)
!560 = !DILocation(line: 73, column: 21, scope: !543)
!561 = !DILocation(line: 85, column: 10, scope: !562)
!562 = distinct !DILexicalBlock(scope: !543, file: !3, line: 85, column: 6)
!563 = !DILocation(line: 85, column: 6, scope: !543)
!564 = !DILocation(line: 90, column: 13, scope: !543)
!565 = !DILocation(line: 90, column: 7, scope: !543)
!566 = !DILocation(line: 90, column: 11, scope: !543)
!567 = !{!568, !569, i64 24}
!568 = !{!"", !569, i64 0, !569, i64 8, !569, i64 16, !569, i64 24, !572, i64 32, !572, i64 56, !575, i64 80}
!569 = !{!"any pointer", !570, i64 0}
!570 = !{!"omnipotent char", !571, i64 0}
!571 = !{!"Simple C/C++ TBAA"}
!572 = !{!"uk_semaphore", !573, i64 0, !574, i64 8}
!573 = !{!"long", !570, i64 0}
!574 = !{!"uk_waitq", !569, i64 0, !569, i64 8}
!575 = !{!"int", !570, i64 0}
!576 = !DILocation(line: 91, column: 15, scope: !577)
!577 = distinct !DILexicalBlock(scope: !543, file: !3, line: 91, column: 6)
!578 = !DILocation(line: 91, column: 6, scope: !543)
!579 = !DILocation(line: 92, column: 3, scope: !580)
!580 = distinct !DILexicalBlock(scope: !577, file: !3, line: 91, column: 24)
!581 = !DILocation(line: 93, column: 3, scope: !580)
!582 = !DILocation(line: 95, column: 3, scope: !580)
!583 = !DILocation(line: 120, column: 2, scope: !584, inlinedAt: !590)
!584 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !585, file: !585, line: 116, type: !586, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !588)
!585 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!586 = !DISubroutineType(types: !587)
!587 = !{!104}
!588 = !{!589}
!589 = !DILocalVariable(name: "sp", scope: !584, file: !585, line: 118, type: !104)
!590 = distinct !DILocation(line: 154, column: 21, scope: !591, inlinedAt: !597)
!591 = distinct !DISubprogram(name: "uk_thread_current", scope: !33, file: !33, line: 151, type: !592, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !594)
!592 = !DISubroutineType(types: !593)
!593 = !{!31}
!594 = !{!595, !596}
!595 = !DILocalVariable(name: "current", scope: !591, file: !33, line: 153, type: !30)
!596 = !DILocalVariable(name: "sp", scope: !591, file: !33, line: 154, type: !104)
!597 = distinct !DILocation(line: 98, column: 2, scope: !543)
!598 = !{i32 483801}
!599 = !DILocation(line: 118, column: 16, scope: !584, inlinedAt: !590)
!600 = !DILocation(line: 154, column: 16, scope: !591, inlinedAt: !597)
!601 = !DILocation(line: 156, column: 38, scope: !591, inlinedAt: !597)
!602 = !DILocation(line: 156, column: 12, scope: !591, inlinedAt: !597)
!603 = !DILocation(line: 153, column: 21, scope: !591, inlinedAt: !597)
!604 = !DILocation(line: 158, column: 9, scope: !591, inlinedAt: !597)
!605 = !{!569, !569, i64 0}
!606 = !DILocation(line: 74, column: 20, scope: !543)
!607 = !DILocalVariable(name: "thread", arg: 1, scope: !608, file: !33, line: 145, type: !31)
!608 = distinct !DISubprogram(name: "uk_thread_set_private", scope: !33, file: !33, line: 145, type: !609, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !31, !29}
!611 = !{!607, !612}
!612 = !DILocalVariable(name: "prv", arg: 2, scope: !608, file: !33, line: 145, type: !29)
!613 = !DILocation(line: 145, column: 46, scope: !608, inlinedAt: !614)
!614 = distinct !DILocation(line: 100, column: 2, scope: !543)
!615 = !DILocation(line: 145, column: 60, scope: !608, inlinedAt: !614)
!616 = !DILocation(line: 147, column: 10, scope: !608, inlinedAt: !614)
!617 = !DILocation(line: 147, column: 14, scope: !608, inlinedAt: !614)
!618 = !{!619, !569, i64 96}
!619 = !{!"uk_thread", !569, i64 0, !569, i64 8, !569, i64 16, !569, i64 24, !620, i64 32, !575, i64 48, !573, i64 56, !621, i64 64, !574, i64 72, !569, i64 88, !569, i64 96, !575, i64 104, !569, i64 112, !569, i64 120}
!620 = !{!"", !569, i64 0, !569, i64 8}
!621 = !{!"_Bool", !570, i64 0}
!622 = !DILocation(line: 101, column: 7, scope: !543)
!623 = !DILocation(line: 101, column: 17, scope: !543)
!624 = !{!568, !569, i64 16}
!625 = !DILocation(line: 101, column: 2, scope: !543)
!626 = !DILocation(line: 0, scope: !543)
!627 = !DILocation(line: 104, column: 2, scope: !543)
!628 = !DILocation(line: 186, column: 42, scope: !496)
!629 = !DILocation(line: 188, column: 2, scope: !496)
!630 = !DILocation(line: 188, column: 10, scope: !496)
!631 = !DILocation(line: 189, column: 2, scope: !496)
!632 = !DILocation(line: 190, column: 2, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !497, line: 190, column: 2)
!634 = distinct !DILexicalBlock(scope: !496, file: !497, line: 190, column: 2)
!635 = !DILocation(line: 191, column: 2, scope: !496)
!636 = !DILocation(line: 192, column: 1, scope: !496)
!637 = distinct !DISubprogram(name: "pte_kill", scope: !3, file: !3, line: 113, type: !638, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !642)
!638 = !DISubroutineType(types: !639)
!639 = !{!69, !640, !69}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !641, line: 11, baseType: !31)
!641 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!642 = !{!643, !644}
!643 = !DILocalVariable(name: "threadId", arg: 1, scope: !637, file: !3, line: 113, type: !640)
!644 = !DILocalVariable(name: "sig", arg: 2, scope: !637, file: !3, line: 113, type: !69)
!645 = !DILocation(line: 113, column: 33, scope: !637)
!646 = !DILocation(line: 113, column: 47, scope: !637)
!647 = !DILocation(line: 115, column: 9, scope: !637)
!648 = !DILocation(line: 115, column: 2, scope: !637)
!649 = distinct !DISubprogram(name: "pte_osThreadCreate", scope: !3, file: !3, line: 155, type: !650, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !653)
!650 = !DISubroutineType(types: !651)
!651 = !{!546, !478, !69, !69, !29, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!653 = !{!654, !655, !656, !657, !658, !659}
!654 = !DILocalVariable(name: "entry_point", arg: 1, scope: !649, file: !3, line: 155, type: !478)
!655 = !DILocalVariable(name: "stack_size", arg: 2, scope: !649, file: !3, line: 156, type: !69)
!656 = !DILocalVariable(name: "initial_prio", arg: 3, scope: !649, file: !3, line: 156, type: !69)
!657 = !DILocalVariable(name: "argv", arg: 4, scope: !649, file: !3, line: 156, type: !29)
!658 = !DILocalVariable(name: "ph", arg: 5, scope: !649, file: !3, line: 157, type: !652)
!659 = !DILocalVariable(name: "ptd", scope: !649, file: !3, line: 159, type: !473)
!660 = !DILocation(line: 155, column: 56, scope: !649)
!661 = !DILocation(line: 156, column: 6, scope: !649)
!662 = !DILocation(line: 156, column: 22, scope: !649)
!663 = !DILocation(line: 156, column: 42, scope: !649)
!664 = !DILocation(line: 157, column: 22, scope: !649)
!665 = !DILocation(line: 162, column: 18, scope: !649)
!666 = !DILocalVariable(name: "a", arg: 1, scope: !667, file: !156, line: 157, type: !154)
!667 = distinct !DISubprogram(name: "uk_malloc", scope: !156, file: !156, line: 157, type: !161, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !668)
!668 = !{!666, !669}
!669 = !DILocalVariable(name: "size", arg: 2, scope: !667, file: !156, line: 157, type: !163)
!670 = !DILocation(line: 157, column: 48, scope: !667, inlinedAt: !671)
!671 = distinct !DILocation(line: 162, column: 8, scope: !649)
!672 = !DILocation(line: 157, column: 58, scope: !667, inlinedAt: !671)
!673 = !DILocation(line: 159, column: 6, scope: !674, inlinedAt: !671)
!674 = distinct !DILexicalBlock(scope: !667, file: !156, line: 159, column: 6)
!675 = !DILocation(line: 159, column: 6, scope: !667, inlinedAt: !671)
!676 = !{!"branch_weights", i32 1, i32 2000}
!677 = !DILocation(line: 160, column: 3, scope: !678, inlinedAt: !671)
!678 = distinct !DILexicalBlock(scope: !674, file: !156, line: 159, column: 20)
!679 = !DILocation(line: 160, column: 9, scope: !678, inlinedAt: !671)
!680 = !{!575, !575, i64 0}
!681 = !DILocation(line: 159, column: 21, scope: !649)
!682 = !DILocation(line: 163, column: 6, scope: !649)
!683 = !DILocalVariable(name: "a", arg: 1, scope: !684, file: !156, line: 151, type: !154)
!684 = distinct !DISubprogram(name: "uk_do_malloc", scope: !156, file: !156, line: 151, type: !161, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !685)
!685 = !{!683, !686}
!686 = !DILocalVariable(name: "size", arg: 2, scope: !684, file: !156, line: 151, type: !163)
!687 = !DILocation(line: 151, column: 51, scope: !684, inlinedAt: !688)
!688 = distinct !DILocation(line: 163, column: 9, scope: !667, inlinedAt: !671)
!689 = !DILocation(line: 151, column: 61, scope: !684, inlinedAt: !688)
!690 = !DILocation(line: 154, column: 12, scope: !684, inlinedAt: !688)
!691 = !DILocation(line: 154, column: 9, scope: !684, inlinedAt: !688)
!692 = !DILocation(line: 163, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !649, file: !3, line: 163, column: 6)
!694 = !DILocation(line: 166, column: 7, scope: !649)
!695 = !DILocation(line: 166, column: 19, scope: !649)
!696 = !{!568, !569, i64 0}
!697 = !DILocation(line: 167, column: 7, scope: !649)
!698 = !DILocation(line: 167, column: 12, scope: !649)
!699 = !{!568, !569, i64 8}
!700 = !DILocation(line: 170, column: 13, scope: !649)
!701 = !DILocation(line: 170, column: 7, scope: !649)
!702 = !DILocation(line: 170, column: 11, scope: !649)
!703 = !DILocation(line: 171, column: 15, scope: !704)
!704 = distinct !DILexicalBlock(scope: !649, file: !3, line: 171, column: 6)
!705 = !DILocation(line: 171, column: 6, scope: !649)
!706 = !DILocation(line: 172, column: 3, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !3, line: 171, column: 24)
!708 = !DILocation(line: 173, column: 3, scope: !707)
!709 = !DILocation(line: 174, column: 3, scope: !707)
!710 = !DILocation(line: 177, column: 26, scope: !649)
!711 = !DILocation(line: 177, column: 2, scope: !649)
!712 = !DILocation(line: 178, column: 26, scope: !649)
!713 = !DILocation(line: 178, column: 2, scope: !649)
!714 = !DILocation(line: 179, column: 7, scope: !649)
!715 = !DILocation(line: 179, column: 12, scope: !649)
!716 = !{!568, !575, i64 80}
!717 = !DILocalVariable(name: "name", arg: 1, scope: !718, file: !33, line: 101, type: !36)
!718 = distinct !DISubprogram(name: "uk_thread_create_attr", scope: !33, file: !33, line: 101, type: !719, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!31, !36, !92, !217, !29}
!721 = !{!717, !722, !723, !724}
!722 = !DILocalVariable(name: "attr", arg: 2, scope: !718, file: !33, line: 102, type: !92)
!723 = !DILocalVariable(name: "function", arg: 3, scope: !718, file: !33, line: 102, type: !217)
!724 = !DILocalVariable(name: "arg", arg: 4, scope: !718, file: !33, line: 102, type: !29)
!725 = !DILocation(line: 101, column: 67, scope: !718, inlinedAt: !726)
!726 = distinct !DILocation(line: 181, column: 2, scope: !649)
!727 = !DILocation(line: 102, column: 26, scope: !718, inlinedAt: !726)
!728 = !DILocation(line: 102, column: 38, scope: !718, inlinedAt: !726)
!729 = !DILocation(line: 102, column: 63, scope: !718, inlinedAt: !726)
!730 = !DILocation(line: 104, column: 32, scope: !718, inlinedAt: !726)
!731 = !DILocation(line: 104, column: 9, scope: !718, inlinedAt: !726)
!732 = !DILocation(line: 181, column: 2, scope: !649)
!733 = !DILocation(line: 183, column: 21, scope: !734)
!734 = distinct !DILexicalBlock(scope: !649, file: !3, line: 183, column: 6)
!735 = !DILocation(line: 183, column: 6, scope: !649)
!736 = !DILocation(line: 184, column: 28, scope: !737)
!737 = distinct !DILexicalBlock(scope: !734, file: !3, line: 183, column: 30)
!738 = !DILocation(line: 184, column: 3, scope: !737)
!739 = !DILocation(line: 185, column: 3, scope: !737)
!740 = !DILocation(line: 186, column: 3, scope: !737)
!741 = !DILocation(line: 191, column: 2, scope: !649)
!742 = !DILocation(line: 194, column: 2, scope: !649)
!743 = !DILocation(line: 145, column: 46, scope: !608, inlinedAt: !744)
!744 = distinct !DILocation(line: 194, column: 2, scope: !649)
!745 = !DILocation(line: 145, column: 60, scope: !608, inlinedAt: !744)
!746 = !DILocation(line: 147, column: 10, scope: !608, inlinedAt: !744)
!747 = !DILocation(line: 147, column: 14, scope: !608, inlinedAt: !744)
!748 = !DILocation(line: 196, column: 13, scope: !649)
!749 = !DILocation(line: 196, column: 6, scope: !649)
!750 = !DILocation(line: 198, column: 2, scope: !649)
!751 = !DILocation(line: 0, scope: !693)
!752 = !DILocation(line: 199, column: 1, scope: !649)
!753 = distinct !DISubprogram(name: "uk_stub_thread_entry", scope: !3, file: !3, line: 142, type: !218, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !754)
!754 = !{!755, !756}
!755 = !DILocalVariable(name: "argv", arg: 1, scope: !753, file: !3, line: 142, type: !29)
!756 = !DILocalVariable(name: "ptd", scope: !753, file: !3, line: 147, type: !473)
!757 = !DILocation(line: 142, column: 40, scope: !753)
!758 = !DILocalVariable(name: "val", arg: 1, scope: !759, file: !760, line: 88, type: !48)
!759 = distinct !DISubprogram(name: "wrpkru", scope: !760, file: !760, line: 88, type: !761, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !763)
!760 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku.h", directory: "/root/.unikraft/apps/redis/build")
!761 = !DISubroutineType(types: !762)
!762 = !{null, !48}
!763 = !{!758}
!764 = !DILocation(line: 88, column: 67, scope: !759, inlinedAt: !765)
!765 = distinct !DILocation(line: 145, column: 2, scope: !753)
!766 = !DILocation(line: 91, column: 2, scope: !759, inlinedAt: !765)
!767 = !{i32 277494}
!768 = !DILocation(line: 147, column: 21, scope: !753)
!769 = !DILocation(line: 150, column: 26, scope: !753)
!770 = !DILocation(line: 150, column: 2, scope: !753)
!771 = !DILocation(line: 152, column: 7, scope: !753)
!772 = !DILocation(line: 152, column: 24, scope: !753)
!773 = !DILocation(line: 152, column: 2, scope: !753)
!774 = !DILocation(line: 153, column: 1, scope: !753)
!775 = distinct !DISubprogram(name: "pte_osThreadStart", scope: !3, file: !3, line: 201, type: !776, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{!546, !640}
!778 = !{!779, !780}
!779 = !DILocalVariable(name: "h", arg: 1, scope: !775, file: !3, line: 201, type: !640)
!780 = !DILocalVariable(name: "ptd", scope: !775, file: !3, line: 203, type: !473)
!781 = !DILocation(line: 201, column: 51, scope: !775)
!782 = !DILocalVariable(name: "h", arg: 1, scope: !783, file: !3, line: 126, type: !640)
!783 = distinct !DISubprogram(name: "handle_to_ptd", scope: !3, file: !3, line: 126, type: !784, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!473, !640}
!786 = !{!782, !787}
!787 = !DILocalVariable(name: "res", scope: !783, file: !3, line: 128, type: !473)
!788 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !789)
!789 = distinct !DILocation(line: 203, column: 27, scope: !775)
!790 = !DILocalVariable(name: "thread", arg: 1, scope: !791, file: !33, line: 139, type: !31)
!791 = distinct !DISubprogram(name: "uk_thread_get_private", scope: !33, file: !33, line: 139, type: !792, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!29, !31}
!794 = !{!790}
!795 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !796)
!796 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !789)
!797 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !796)
!798 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !789)
!799 = !DILocation(line: 203, column: 21, scope: !775)
!800 = !DILocalVariable(name: "s", arg: 1, scope: !801, file: !487, line: 194, type: !804)
!801 = distinct !DISubprogram(name: "uk_semaphore_up", scope: !487, file: !487, line: 194, type: !802, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !805)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!805 = !{!800, !806, !807}
!806 = !DILocalVariable(name: "irqf", scope: !801, file: !487, line: 196, type: !104)
!807 = !DILocalVariable(name: "wq", scope: !801, file: !487, line: 209, type: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!810 = !DILocation(line: 194, column: 57, scope: !801, inlinedAt: !811)
!811 = distinct !DILocation(line: 206, column: 2, scope: !775)
!812 = !DILocation(line: 200, column: 9, scope: !801, inlinedAt: !811)
!813 = !DILocation(line: 196, column: 16, scope: !801, inlinedAt: !811)
!814 = !DILocation(line: 201, column: 7, scope: !801, inlinedAt: !811)
!815 = !DILocation(line: 201, column: 2, scope: !801, inlinedAt: !811)
!816 = !{!572, !573, i64 0}
!817 = !DILocation(line: 209, column: 28, scope: !801, inlinedAt: !811)
!818 = !DILocalVariable(name: "wq", arg: 1, scope: !819, file: !820, line: 99, type: !823)
!819 = distinct !DISubprogram(name: "uk_waitq_wake_up", scope: !820, file: !820, line: 99, type: !821, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !824)
!820 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait.h", directory: "/root/.unikraft/apps/redis/build")
!821 = !DISubroutineType(types: !822)
!822 = !{null, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!824 = !{!818, !825, !826, !827}
!825 = !DILocalVariable(name: "flags", scope: !819, file: !820, line: 101, type: !104)
!826 = !DILocalVariable(name: "curr", scope: !819, file: !820, line: 102, type: !65)
!827 = !DILocalVariable(name: "tmp", scope: !819, file: !820, line: 102, type: !65)
!828 = !DILocation(line: 99, column: 40, scope: !819, inlinedAt: !829)
!829 = distinct !DILocation(line: 210, column: 2, scope: !801, inlinedAt: !811)
!830 = !DILocation(line: 104, column: 10, scope: !819, inlinedAt: !829)
!831 = !DILocation(line: 101, column: 16, scope: !819, inlinedAt: !829)
!832 = !DILocation(line: 105, column: 2, scope: !833, inlinedAt: !829)
!833 = distinct !DILexicalBlock(scope: !819, file: !820, line: 105, column: 2)
!834 = !{!574, !569, i64 0}
!835 = !DILocation(line: 102, column: 25, scope: !819, inlinedAt: !829)
!836 = !DILocation(line: 105, column: 2, scope: !837, inlinedAt: !829)
!837 = distinct !DILexicalBlock(scope: !833, file: !820, line: 105, column: 2)
!838 = !{!839, !569, i64 16}
!839 = !{!"uk_waitq_entry", !575, i64 0, !569, i64 8, !840, i64 16}
!840 = !{!"", !569, i64 0}
!841 = !DILocation(line: 102, column: 32, scope: !819, inlinedAt: !829)
!842 = !DILocation(line: 106, column: 24, scope: !837, inlinedAt: !829)
!843 = !{!839, !569, i64 8}
!844 = !DILocation(line: 106, column: 3, scope: !837, inlinedAt: !829)
!845 = distinct !{!845, !846, !847}
!846 = !DILocation(line: 105, column: 2, scope: !833)
!847 = !DILocation(line: 106, column: 30, scope: !833)
!848 = !DILocation(line: 107, column: 2, scope: !819, inlinedAt: !829)
!849 = !DILocation(line: 211, column: 2, scope: !801, inlinedAt: !811)
!850 = !DILocation(line: 208, column: 2, scope: !775)
!851 = distinct !DISubprogram(name: "pte_osThreadDelete", scope: !3, file: !3, line: 211, type: !776, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !852)
!852 = !{!853, !854}
!853 = !DILocalVariable(name: "h", arg: 1, scope: !851, file: !3, line: 211, type: !640)
!854 = !DILocalVariable(name: "ptd", scope: !851, file: !3, line: 213, type: !473)
!855 = !DILocation(line: 211, column: 52, scope: !851)
!856 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !857)
!857 = distinct !DILocation(line: 213, column: 27, scope: !851)
!858 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !859)
!859 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !857)
!860 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !859)
!861 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !857)
!862 = !DILocation(line: 213, column: 21, scope: !851)
!863 = !DILocation(line: 216, column: 27, scope: !851)
!864 = !DILocation(line: 216, column: 2, scope: !851)
!865 = !DILocation(line: 217, column: 7, scope: !851)
!866 = !DILocation(line: 217, column: 2, scope: !851)
!867 = !DILocation(line: 219, column: 2, scope: !851)
!868 = distinct !DISubprogram(name: "pte_osThreadExitAndDelete", scope: !3, file: !3, line: 222, type: !776, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !869)
!869 = !{!870}
!870 = !DILocalVariable(name: "h", arg: 1, scope: !868, file: !3, line: 222, type: !640)
!871 = !DILocation(line: 222, column: 59, scope: !868)
!872 = !DILocation(line: 224, column: 9, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !3, line: 224, column: 6)
!874 = !{!619, !569, i64 88}
!875 = !DILocation(line: 224, column: 6, scope: !873)
!876 = !DILocation(line: 224, column: 6, scope: !868)
!877 = !DILocalVariable(name: "thread", arg: 1, scope: !878, file: !33, line: 117, type: !31)
!878 = distinct !DISubprogram(name: "uk_thread_kill", scope: !33, file: !33, line: 117, type: !879, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !31}
!881 = !{!877}
!882 = !DILocation(line: 117, column: 53, scope: !878, inlinedAt: !883)
!883 = distinct !DILocation(line: 225, column: 3, scope: !873)
!884 = !DILocation(line: 119, column: 2, scope: !878, inlinedAt: !883)
!885 = !DILocation(line: 225, column: 3, scope: !873)
!886 = !DILocation(line: 211, column: 52, scope: !851, inlinedAt: !887)
!887 = distinct !DILocation(line: 226, column: 2, scope: !868)
!888 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !889)
!889 = distinct !DILocation(line: 213, column: 27, scope: !851, inlinedAt: !887)
!890 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !891)
!891 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !889)
!892 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !891)
!893 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !889)
!894 = !DILocation(line: 213, column: 21, scope: !851, inlinedAt: !887)
!895 = !DILocation(line: 216, column: 27, scope: !851, inlinedAt: !887)
!896 = !DILocation(line: 216, column: 2, scope: !851, inlinedAt: !887)
!897 = !DILocation(line: 217, column: 7, scope: !851, inlinedAt: !887)
!898 = !DILocation(line: 217, column: 2, scope: !851, inlinedAt: !887)
!899 = !DILocation(line: 228, column: 2, scope: !868)
!900 = distinct !DISubprogram(name: "pte_osThreadExit", scope: !3, file: !3, line: 231, type: !416, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !901)
!901 = !{!902}
!902 = !DILocalVariable(name: "ptd", scope: !900, file: !3, line: 233, type: !473)
!903 = !DILocation(line: 120, column: 2, scope: !584, inlinedAt: !904)
!904 = distinct !DILocation(line: 154, column: 21, scope: !591, inlinedAt: !905)
!905 = distinct !DILocation(line: 137, column: 2, scope: !906, inlinedAt: !916)
!906 = distinct !DISubprogram(name: "current_ptd", scope: !3, file: !3, line: 133, type: !907, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!473}
!909 = !{!910, !913}
!910 = !DILocalVariable(name: "thread", scope: !906, file: !3, line: 135, type: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !32)
!913 = !DILocalVariable(name: "ptd", scope: !906, file: !3, line: 136, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!916 = distinct !DILocation(line: 233, column: 27, scope: !900)
!917 = !DILocation(line: 118, column: 16, scope: !584, inlinedAt: !904)
!918 = !DILocation(line: 154, column: 16, scope: !591, inlinedAt: !905)
!919 = !DILocation(line: 156, column: 38, scope: !591, inlinedAt: !905)
!920 = !DILocation(line: 156, column: 12, scope: !591, inlinedAt: !905)
!921 = !DILocation(line: 153, column: 21, scope: !591, inlinedAt: !905)
!922 = !DILocation(line: 158, column: 9, scope: !591, inlinedAt: !905)
!923 = !DILocation(line: 135, column: 29, scope: !906, inlinedAt: !916)
!924 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !925)
!925 = distinct !DILocation(line: 138, column: 2, scope: !906, inlinedAt: !916)
!926 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !925)
!927 = !DILocation(line: 136, column: 30, scope: !906, inlinedAt: !916)
!928 = !DILocation(line: 233, column: 21, scope: !900)
!929 = !DILocation(line: 235, column: 7, scope: !900)
!930 = !DILocation(line: 235, column: 12, scope: !900)
!931 = !DILocation(line: 236, column: 2, scope: !900)
!932 = distinct !DISubprogram(name: "pte_osThreadWaitForEnd", scope: !3, file: !3, line: 239, type: !776, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !933)
!933 = !{!934, !935, !936}
!934 = !DILocalVariable(name: "h", arg: 1, scope: !932, file: !3, line: 239, type: !640)
!935 = !DILocalVariable(name: "ptd", scope: !932, file: !3, line: 241, type: !473)
!936 = !DILocalVariable(name: "self_ptd", scope: !932, file: !3, line: 242, type: !473)
!937 = !DILocation(line: 239, column: 56, scope: !932)
!938 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !939)
!939 = distinct !DILocation(line: 241, column: 27, scope: !932)
!940 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !941)
!941 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !939)
!942 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !941)
!943 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !939)
!944 = !DILocation(line: 241, column: 21, scope: !932)
!945 = !DILocation(line: 120, column: 2, scope: !584, inlinedAt: !946)
!946 = distinct !DILocation(line: 154, column: 21, scope: !591, inlinedAt: !947)
!947 = distinct !DILocation(line: 137, column: 2, scope: !906, inlinedAt: !948)
!948 = distinct !DILocation(line: 242, column: 32, scope: !932)
!949 = !DILocation(line: 118, column: 16, scope: !584, inlinedAt: !946)
!950 = !DILocation(line: 154, column: 16, scope: !591, inlinedAt: !947)
!951 = !DILocation(line: 156, column: 38, scope: !591, inlinedAt: !947)
!952 = !DILocation(line: 156, column: 12, scope: !591, inlinedAt: !947)
!953 = !DILocation(line: 153, column: 21, scope: !591, inlinedAt: !947)
!954 = !DILocation(line: 158, column: 9, scope: !591, inlinedAt: !947)
!955 = !DILocation(line: 135, column: 29, scope: !906, inlinedAt: !948)
!956 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !957)
!957 = distinct !DILocation(line: 138, column: 2, scope: !906, inlinedAt: !948)
!958 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !957)
!959 = !DILocation(line: 136, column: 30, scope: !906, inlinedAt: !948)
!960 = !DILocation(line: 242, column: 21, scope: !932)
!961 = !DILocation(line: 245, column: 12, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 245, column: 7)
!963 = distinct !DILexicalBlock(scope: !932, file: !3, line: 244, column: 12)
!964 = !DILocation(line: 245, column: 7, scope: !962)
!965 = !DILocation(line: 245, column: 7, scope: !963)
!966 = !DILocation(line: 246, column: 4, scope: !967)
!967 = distinct !DILexicalBlock(scope: !962, file: !3, line: 245, column: 18)
!968 = !DILocation(line: 247, column: 4, scope: !967)
!969 = !DILocation(line: 250, column: 16, scope: !970)
!970 = distinct !DILexicalBlock(scope: !963, file: !3, line: 250, column: 7)
!971 = !DILocation(line: 250, column: 40, scope: !970)
!972 = !{!568, !573, i64 56}
!973 = !DILocation(line: 250, column: 46, scope: !970)
!974 = !DILocation(line: 250, column: 7, scope: !963)
!975 = !DILocation(line: 120, column: 2, scope: !584, inlinedAt: !976)
!976 = distinct !DILocation(line: 154, column: 21, scope: !591, inlinedAt: !977)
!977 = distinct !DILocation(line: 117, column: 30, scope: !978, inlinedAt: !982)
!978 = distinct !DISubprogram(name: "uk_sched_yield", scope: !80, file: !80, line: 114, type: !416, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !979)
!979 = !{!980, !981}
!980 = !DILocalVariable(name: "s", scope: !978, file: !80, line: 116, type: !78)
!981 = !DILocalVariable(name: "current", scope: !978, file: !80, line: 117, type: !31)
!982 = distinct !DILocation(line: 254, column: 4, scope: !970)
!983 = !DILocation(line: 118, column: 16, scope: !584, inlinedAt: !976)
!984 = !DILocation(line: 154, column: 16, scope: !591, inlinedAt: !977)
!985 = !DILocation(line: 156, column: 38, scope: !591, inlinedAt: !977)
!986 = !DILocation(line: 156, column: 12, scope: !591, inlinedAt: !977)
!987 = !DILocation(line: 153, column: 21, scope: !591, inlinedAt: !977)
!988 = !DILocation(line: 158, column: 9, scope: !591, inlinedAt: !977)
!989 = !DILocation(line: 117, column: 20, scope: !978, inlinedAt: !982)
!990 = !DILocation(line: 119, column: 2, scope: !991, inlinedAt: !982)
!991 = distinct !DILexicalBlock(scope: !992, file: !80, line: 119, column: 2)
!992 = distinct !DILexicalBlock(scope: !978, file: !80, line: 119, column: 2)
!993 = !DILocation(line: 119, column: 2, scope: !992, inlinedAt: !982)
!994 = !DILocation(line: 119, column: 2, scope: !995, inlinedAt: !982)
!995 = distinct !DILexicalBlock(scope: !991, file: !80, line: 119, column: 2)
!996 = !DILocation(line: 121, column: 15, scope: !978, inlinedAt: !982)
!997 = !DILocation(line: 116, column: 19, scope: !978, inlinedAt: !982)
!998 = !DILocation(line: 122, column: 2, scope: !999, inlinedAt: !982)
!999 = distinct !DILexicalBlock(scope: !1000, file: !80, line: 122, column: 2)
!1000 = distinct !DILexicalBlock(scope: !978, file: !80, line: 122, column: 2)
!1001 = !DILocation(line: 122, column: 2, scope: !1000, inlinedAt: !982)
!1002 = !DILocation(line: 122, column: 2, scope: !1003, inlinedAt: !982)
!1003 = distinct !DILexicalBlock(scope: !999, file: !80, line: 122, column: 2)
!1004 = !DILocation(line: 123, column: 5, scope: !978, inlinedAt: !982)
!1005 = !{!1006, !569, i64 0}
!1006 = !{!"uk_sched", !569, i64 0, !569, i64 8, !569, i64 16, !569, i64 24, !569, i64 32, !569, i64 40, !569, i64 48, !569, i64 56, !569, i64 64, !621, i64 72, !619, i64 80, !1007, i64 208, !1008, i64 224, !569, i64 248, !569, i64 256, !569, i64 264}
!1007 = !{!"uk_thread_list", !569, i64 0, !569, i64 8}
!1008 = !{!"ukplat_ctx_callbacks", !569, i64 0, !569, i64 8, !569, i64 16}
!1009 = !DILocation(line: 123, column: 2, scope: !978, inlinedAt: !982)
!1010 = distinct !{!1010, !1011, !1012}
!1011 = !DILocation(line: 244, column: 2, scope: !932)
!1012 = !DILocation(line: 255, column: 2, scope: !932)
!1013 = !DILocation(line: 0, scope: !970)
!1014 = !DILocation(line: 256, column: 1, scope: !932)
!1015 = distinct !DISubprogram(name: "pte_osThreadCancel", scope: !3, file: !3, line: 258, type: !776, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1016)
!1016 = !{!1017, !1018}
!1017 = !DILocalVariable(name: "h", arg: 1, scope: !1015, file: !3, line: 258, type: !640)
!1018 = !DILocalVariable(name: "ptd", scope: !1015, file: !3, line: 260, type: !473)
!1019 = !DILocation(line: 258, column: 52, scope: !1015)
!1020 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 260, column: 27, scope: !1015)
!1022 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !1023)
!1023 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !1021)
!1024 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !1023)
!1025 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !1021)
!1026 = !DILocation(line: 260, column: 21, scope: !1015)
!1027 = !DILocation(line: 194, column: 57, scope: !801, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 262, column: 2, scope: !1015)
!1029 = !DILocation(line: 200, column: 9, scope: !801, inlinedAt: !1028)
!1030 = !DILocation(line: 196, column: 16, scope: !801, inlinedAt: !1028)
!1031 = !DILocation(line: 201, column: 7, scope: !801, inlinedAt: !1028)
!1032 = !DILocation(line: 201, column: 2, scope: !801, inlinedAt: !1028)
!1033 = !DILocation(line: 209, column: 28, scope: !801, inlinedAt: !1028)
!1034 = !DILocation(line: 99, column: 40, scope: !819, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 210, column: 2, scope: !801, inlinedAt: !1028)
!1036 = !DILocation(line: 104, column: 10, scope: !819, inlinedAt: !1035)
!1037 = !DILocation(line: 101, column: 16, scope: !819, inlinedAt: !1035)
!1038 = !DILocation(line: 105, column: 2, scope: !833, inlinedAt: !1035)
!1039 = !DILocation(line: 102, column: 25, scope: !819, inlinedAt: !1035)
!1040 = !DILocation(line: 105, column: 2, scope: !837, inlinedAt: !1035)
!1041 = !DILocation(line: 102, column: 32, scope: !819, inlinedAt: !1035)
!1042 = !DILocation(line: 106, column: 24, scope: !837, inlinedAt: !1035)
!1043 = !DILocation(line: 106, column: 3, scope: !837, inlinedAt: !1035)
!1044 = !DILocation(line: 107, column: 2, scope: !819, inlinedAt: !1035)
!1045 = !DILocation(line: 211, column: 2, scope: !801, inlinedAt: !1028)
!1046 = !DILocation(line: 264, column: 2, scope: !1015)
!1047 = distinct !DISubprogram(name: "pte_osThreadCheckCancel", scope: !3, file: !3, line: 267, type: !776, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1048)
!1048 = !{!1049, !1050}
!1049 = !DILocalVariable(name: "h", arg: 1, scope: !1047, file: !3, line: 267, type: !640)
!1050 = !DILocalVariable(name: "ptd", scope: !1047, file: !3, line: 269, type: !473)
!1051 = !DILocation(line: 267, column: 57, scope: !1047)
!1052 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 269, column: 27, scope: !1047)
!1054 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !1053)
!1056 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !1055)
!1057 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !1053)
!1058 = !DILocation(line: 269, column: 21, scope: !1047)
!1059 = !DILocation(line: 271, column: 6, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 271, column: 6)
!1061 = !DILocation(line: 271, column: 10, scope: !1060)
!1062 = !DILocation(line: 271, column: 29, scope: !1060)
!1063 = !DILocation(line: 271, column: 35, scope: !1060)
!1064 = !DILocation(line: 271, column: 6, scope: !1047)
!1065 = !DILocation(line: 274, column: 2, scope: !1047)
!1066 = !DILocation(line: 0, scope: !1047)
!1067 = !DILocation(line: 275, column: 1, scope: !1047)
!1068 = distinct !DISubprogram(name: "pte_osThreadGetHandle", scope: !3, file: !3, line: 277, type: !1069, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1071)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!640}
!1071 = !{!1072}
!1072 = !DILocalVariable(name: "cur", scope: !1068, file: !3, line: 279, type: !31)
!1073 = !DILocation(line: 120, column: 2, scope: !584, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 154, column: 21, scope: !591, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 280, column: 2, scope: !1068)
!1076 = !DILocation(line: 118, column: 16, scope: !584, inlinedAt: !1074)
!1077 = !DILocation(line: 154, column: 16, scope: !591, inlinedAt: !1075)
!1078 = !DILocation(line: 156, column: 38, scope: !591, inlinedAt: !1075)
!1079 = !DILocation(line: 156, column: 12, scope: !591, inlinedAt: !1075)
!1080 = !DILocation(line: 153, column: 21, scope: !591, inlinedAt: !1075)
!1081 = !DILocation(line: 158, column: 9, scope: !591, inlinedAt: !1075)
!1082 = !DILocation(line: 279, column: 20, scope: !1068)
!1083 = !DILocation(line: 281, column: 2, scope: !1068)
!1084 = distinct !DISubprogram(name: "pte_osThreadGetPriority", scope: !3, file: !3, line: 284, type: !1085, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1087)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!69, !640}
!1087 = !{!1088, !1089, !1090, !1091}
!1088 = !DILocalVariable(name: "h", arg: 1, scope: !1084, file: !3, line: 284, type: !640)
!1089 = !DILocalVariable(name: "ret", scope: !1084, file: !3, line: 286, type: !69)
!1090 = !DILocalVariable(name: "ptd", scope: !1084, file: !3, line: 287, type: !473)
!1091 = !DILocalVariable(name: "prio", scope: !1084, file: !3, line: 288, type: !100)
!1092 = !DILocation(line: 284, column: 48, scope: !1084)
!1093 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !1094)
!1094 = distinct !DILocation(line: 287, column: 27, scope: !1084)
!1095 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !1094)
!1097 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !1096)
!1098 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !1094)
!1099 = !DILocation(line: 287, column: 21, scope: !1084)
!1100 = !DILocation(line: 288, column: 2, scope: !1084)
!1101 = !DILocation(line: 290, column: 2, scope: !1084)
!1102 = !DILocation(line: 288, column: 9, scope: !1084)
!1103 = !DILocation(line: 286, column: 6, scope: !1084)
!1104 = !DILocation(line: 293, column: 9, scope: !1084)
!1105 = !DILocation(line: 294, column: 1, scope: !1084)
!1106 = !DILocation(line: 293, column: 2, scope: !1084)
!1107 = distinct !DISubprogram(name: "pte_osThreadSetPriority", scope: !3, file: !3, line: 296, type: !1108, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1110)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!546, !640, !69}
!1110 = !{!1111, !1112, !1113, !1114}
!1111 = !DILocalVariable(name: "h", arg: 1, scope: !1107, file: !3, line: 296, type: !640)
!1112 = !DILocalVariable(name: "new_prio", arg: 2, scope: !1107, file: !3, line: 296, type: !69)
!1113 = !DILocalVariable(name: "ret", scope: !1107, file: !3, line: 298, type: !69)
!1114 = !DILocalVariable(name: "ptd", scope: !1107, file: !3, line: 299, type: !473)
!1115 = !DILocation(line: 296, column: 57, scope: !1107)
!1116 = !DILocation(line: 296, column: 64, scope: !1107)
!1117 = !DILocation(line: 126, column: 60, scope: !783, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 299, column: 27, scope: !1107)
!1119 = !DILocation(line: 139, column: 47, scope: !791, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 129, column: 2, scope: !783, inlinedAt: !1118)
!1121 = !DILocation(line: 141, column: 17, scope: !791, inlinedAt: !1120)
!1122 = !DILocation(line: 128, column: 21, scope: !783, inlinedAt: !1118)
!1123 = !DILocation(line: 299, column: 21, scope: !1107)
!1124 = !DILocation(line: 301, column: 2, scope: !1107)
!1125 = !DILocation(line: 298, column: 6, scope: !1107)
!1126 = !DILocation(line: 304, column: 9, scope: !1107)
!1127 = !DILocation(line: 304, column: 2, scope: !1107)
!1128 = distinct !DISubprogram(name: "pte_osThreadSleep", scope: !3, file: !3, line: 307, type: !1129, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1131)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !7}
!1131 = !{!1132, !1133}
!1132 = !DILocalVariable(name: "msecs", arg: 1, scope: !1128, file: !3, line: 307, type: !7)
!1133 = !DILocalVariable(name: "nsec", scope: !1128, file: !3, line: 309, type: !102)
!1134 = !DILocation(line: 307, column: 37, scope: !1128)
!1135 = !DILocation(line: 309, column: 16, scope: !1128)
!1136 = !DILocation(line: 309, column: 9, scope: !1128)
!1137 = !DILocation(line: 311, column: 2, scope: !1128)
!1138 = !DILocation(line: 312, column: 1, scope: !1128)
!1139 = distinct !DISubprogram(name: "pte_osThreadGetMinPriority", scope: !3, file: !3, line: 314, type: !533, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!1140 = !DILocation(line: 316, column: 2, scope: !1139)
!1141 = distinct !DISubprogram(name: "pte_osThreadGetMaxPriority", scope: !3, file: !3, line: 319, type: !533, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!1142 = !DILocation(line: 321, column: 2, scope: !1141)
!1143 = distinct !DISubprogram(name: "pte_osThreadGetDefaultPriority", scope: !3, file: !3, line: 324, type: !533, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !540)
!1144 = !DILocation(line: 326, column: 2, scope: !1143)
!1145 = distinct !DISubprogram(name: "pte_osMutexCreate", scope: !3, file: !3, line: 335, type: !1146, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1157)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!546, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osMutexHandle", file: !641, line: 13, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_mutex", file: !1152, line: 58, size: 256, elements: !1153)
!1152 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/mutex.h", directory: "/root/.unikraft/apps/redis/build")
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !1151, file: !1152, line: 59, baseType: !69, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1151, file: !1152, line: 60, baseType: !31, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !1151, file: !1152, line: 61, baseType: !61, size: 128, offset: 128)
!1157 = !{!1158, !1159}
!1158 = !DILocalVariable(name: "ph", arg: 1, scope: !1145, file: !3, line: 335, type: !1148)
!1159 = !DILocalVariable(name: "m", scope: !1145, file: !3, line: 337, type: !1150)
!1160 = !DILocation(line: 335, column: 51, scope: !1145)
!1161 = !DILocation(line: 339, column: 7, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 339, column: 6)
!1163 = !DILocation(line: 339, column: 6, scope: !1145)
!1164 = !DILocation(line: 342, column: 16, scope: !1145)
!1165 = !DILocation(line: 157, column: 48, scope: !667, inlinedAt: !1166)
!1166 = distinct !DILocation(line: 342, column: 6, scope: !1145)
!1167 = !DILocation(line: 157, column: 58, scope: !667, inlinedAt: !1166)
!1168 = !DILocation(line: 159, column: 6, scope: !674, inlinedAt: !1166)
!1169 = !DILocation(line: 159, column: 6, scope: !667, inlinedAt: !1166)
!1170 = !DILocation(line: 160, column: 3, scope: !678, inlinedAt: !1166)
!1171 = !DILocation(line: 160, column: 9, scope: !678, inlinedAt: !1166)
!1172 = !DILocation(line: 343, column: 6, scope: !1145)
!1173 = !DILocation(line: 151, column: 51, scope: !684, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 163, column: 9, scope: !667, inlinedAt: !1166)
!1175 = !DILocation(line: 151, column: 61, scope: !684, inlinedAt: !1174)
!1176 = !DILocation(line: 154, column: 12, scope: !684, inlinedAt: !1174)
!1177 = !DILocation(line: 154, column: 9, scope: !684, inlinedAt: !1174)
!1178 = !DILocation(line: 343, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 343, column: 6)
!1180 = !DILocation(line: 342, column: 6, scope: !1145)
!1181 = !DILocation(line: 337, column: 19, scope: !1145)
!1182 = !DILocation(line: 346, column: 2, scope: !1145)
!1183 = !DILocation(line: 348, column: 6, scope: !1145)
!1184 = !DILocation(line: 350, column: 2, scope: !1145)
!1185 = !DILocation(line: 0, scope: !1162)
!1186 = !DILocation(line: 351, column: 1, scope: !1145)
