; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_getspecific.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_getspecific.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pthread_key_t_ = type { i32, void (i8*)*, %struct.pthread_mutex_t_*, i8* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_getspecific.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!16 = distinct !DISubprogram(name: "pthread_getspecific", scope: !1, file: !1, line: 50, type: !17, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !493)
!17 = !DISubroutineType(types: !18)
!18 = !{!11, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !20, line: 416, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_key_t_", file: !23, line: 214, size: 256, elements: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !{!25, !26, !30, !492}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !22, file: !23, line: 216, baseType: !5, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !22, file: !23, line: 217, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !11}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "keyLock", scope: !22, file: !23, line: 218, baseType: !31, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !20, line: 417, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !23, line: 146, size: 320, elements: !34)
!34 = !{!35, !482, !483, !484, !485}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !33, file: !23, line: 148, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !37, line: 12, baseType: !38)
!37 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !40, line: 51, size: 192, elements: !41)
!40 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !39, file: !40, line: 52, baseType: !43, size: 64)
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !39, file: !40, line: 53, baseType: !45, size: 128, offset: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !46, line: 42, size: 128, elements: !47)
!46 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!47 = !{!48, !480}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !45, file: !46, line: 42, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !46, line: 35, size: 192, elements: !51)
!51 = !{!52, !54, !476}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !50, file: !46, line: 36, baseType: !53, size: 32)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !50, file: !46, line: 37, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !57, line: 59, size: 1024, elements: !58)
!57 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !{!59, !63, !64, !65, !66, !72, !77, !82, !84, !85, !231, !232, !233, !446}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !57, line: 60, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !56, file: !57, line: 61, baseType: !11, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !56, file: !57, line: 62, baseType: !11, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !56, file: !57, line: 63, baseType: !11, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !56, file: !57, line: 64, baseType: !67, size: 128, offset: 256)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !57, line: 64, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !67, file: !57, line: 64, baseType: !55, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !67, file: !57, line: 64, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !57, line: 65, baseType: !73, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !74, line: 48, baseType: !75)
!74 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 79, baseType: !5)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !56, file: !57, line: 66, baseType: !78, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !79, line: 49, baseType: !80)
!79 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !81, line: 128, baseType: !43)
!81 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !56, file: !57, line: 67, baseType: !83, size: 8, offset: 512)
!83 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !56, file: !57, line: 68, baseType: !45, size: 128, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !56, file: !57, line: 69, baseType: !86, size: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !88, line: 90, size: 2176, elements: !89)
!88 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!89 = !{!90, !95, !113, !118, !120, !122, !127, !135, !140, !146, !147, !148, !153, !228, !229, !230}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !87, file: !88, line: 91, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !88, line: 68, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !86}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !87, file: !88, line: 93, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !88, line: 71, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!53, !86, !55, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !103, line: 55, size: 128, elements: !105)
!105 = !{!106, !107, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !104, file: !103, line: 57, baseType: !83, size: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !104, file: !103, line: 59, baseType: !108, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !103, line: 53, baseType: !53)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !104, file: !103, line: 61, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !79, line: 48, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !81, line: 129, baseType: !112)
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !87, file: !88, line: 94, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !88, line: 74, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !86, !55}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !87, file: !88, line: 95, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !88, line: 76, baseType: !115)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !87, file: !88, line: 96, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !88, line: 78, baseType: !115)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !87, file: !88, line: 98, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !88, line: 81, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!53, !86, !55, !108}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !87, file: !88, line: 99, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !88, line: 83, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!53, !86, !132, !134}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !87, file: !88, line: 100, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !88, line: 85, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!53, !86, !55, !53}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !87, file: !88, line: 101, baseType: !141, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !88, line: 87, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!53, !86, !132, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !87, file: !88, line: 104, baseType: !83, size: 8, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !87, file: !88, line: 105, baseType: !56, size: 1024, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !87, file: !88, line: 106, baseType: !149, size: 128, offset: 1664)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !57, line: 93, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !149, file: !57, line: 93, baseType: !55, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !149, file: !57, line: 93, baseType: !71, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !87, file: !88, line: 107, baseType: !154, size: 192, offset: 1792)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !155, line: 59, size: 192, elements: !156)
!155 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!156 = !{!157, !222, !223}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !154, file: !155, line: 61, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !155, line: 51, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!11, !162, !112, !112}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !164, line: 77, size: 832, elements: !165)
!164 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!165 = !{!166, !173, !178, !183, !189, !191, !196, !197, !198, !203, !208, !213, !214, !215}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !163, file: !164, line: 79, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !164, line: 54, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!11, !162, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !172, line: 58, baseType: !112)
!172 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !163, file: !164, line: 80, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !164, line: 56, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!11, !162, !171, !171}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !163, file: !164, line: 81, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !164, line: 62, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!11, !162, !11, !171}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !163, file: !164, line: 82, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !164, line: 58, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!53, !162, !188, !171, !171}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !163, file: !164, line: 83, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !164, line: 60, baseType: !175)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !163, file: !164, line: 84, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !164, line: 64, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !162, !11}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !163, file: !164, line: 87, baseType: !192, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !163, file: !164, line: 88, baseType: !167, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !163, file: !164, line: 92, baseType: !199, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !164, line: 66, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!11, !162, !112}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !163, file: !164, line: 93, baseType: !204, size: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !164, line: 68, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !162, !11, !112}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !163, file: !164, line: 99, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !164, line: 70, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!53, !162, !11, !171}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !163, file: !164, line: 100, baseType: !171, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !164, line: 103, baseType: !162, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !163, file: !164, line: 104, baseType: !216, offset: 832)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, elements: !220)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !74, line: 20, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !76, line: 41, baseType: !219)
!219 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!220 = !{!221}
!221 = !DISubrange(count: -1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !154, file: !155, line: 63, baseType: !27, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !154, file: !155, line: 65, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !155, line: 56, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !11, !11}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !87, file: !88, line: 108, baseType: !162, size: 64, offset: 1984)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !88, line: 109, baseType: !86, size: 64, offset: 2048)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !87, file: !88, line: 110, baseType: !11, size: 64, offset: 2112)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !56, file: !57, line: 70, baseType: !11, size: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !56, file: !57, line: 72, baseType: !53, size: 32, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !56, file: !57, line: 82, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !236, line: 569, size: 14912, elements: !237)
!236 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!237 = !{!238, !239, !314, !315, !316, !317, !321, !322, !325, !326, !330, !342, !343, !344, !346, !347, !348, !410, !431, !432, !437, !444}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !235, file: !236, line: 571, baseType: !53, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !235, file: !236, line: 576, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !236, line: 287, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !236, line: 181, size: 1408, elements: !243)
!243 = !{!244, !247, !248, !249, !251, !252, !257, !258, !259, !266, !270, !275, !279, !280, !281, !282, !286, !290, !291, !292, !294, !295, !299, !313}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !242, file: !236, line: 182, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !242, file: !236, line: 183, baseType: !53, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !242, file: !236, line: 184, baseType: !53, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !242, file: !236, line: 185, baseType: !250, size: 16, offset: 128)
!250 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !242, file: !236, line: 186, baseType: !250, size: 16, offset: 144)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !242, file: !236, line: 187, baseType: !253, size: 128, offset: 192)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !236, line: 117, size: 128, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !253, file: !236, line: 118, baseType: !245, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !253, file: !236, line: 119, baseType: !53, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !242, file: !236, line: 188, baseType: !53, size: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !242, file: !236, line: 195, baseType: !11, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !242, file: !236, line: 197, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !234, !11, !265, !53}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !264, line: 145, baseType: !43)
!264 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !242, file: !236, line: 199, baseType: !267, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!263, !234, !11, !60, !53}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !242, file: !236, line: 202, baseType: !271, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !234, !11, !274, !53}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !264, line: 114, baseType: !43)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !242, file: !236, line: 203, baseType: !276, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!53, !234, !11}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !242, file: !236, line: 206, baseType: !253, size: 128, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !242, file: !236, line: 207, baseType: !245, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !242, file: !236, line: 208, baseType: !53, size: 32, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !242, file: !236, line: 211, baseType: !283, size: 24, offset: 928)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 24, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 3)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !242, file: !236, line: 212, baseType: !287, size: 8, offset: 952)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 1)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !242, file: !236, line: 215, baseType: !253, size: 128, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !242, file: !236, line: 218, baseType: !53, size: 32, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !242, file: !236, line: 219, baseType: !293, size: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !264, line: 44, baseType: !43)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !242, file: !236, line: 222, baseType: !234, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !242, file: !236, line: 226, baseType: !296, size: 32, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !264, line: 175, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !298, line: 12, baseType: !53)
!298 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !242, file: !236, line: 228, baseType: !300, size: 64, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !264, line: 171, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 163, size: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !301, file: !264, line: 165, baseType: !53, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !301, file: !264, line: 170, baseType: !305, size: 32, offset: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !264, line: 166, size: 32, elements: !306)
!306 = !{!307, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !305, file: !264, line: 168, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !172, line: 124, baseType: !5)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !305, file: !264, line: 169, baseType: !310, size: 32)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 32, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 4)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !242, file: !236, line: 229, baseType: !53, size: 32, offset: 1376)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !235, file: !236, line: 576, baseType: !240, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !235, file: !236, line: 576, baseType: !240, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !235, file: !236, line: 578, baseType: !53, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !235, file: !236, line: 579, baseType: !318, size: 200, offset: 288)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 200, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 25)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !235, file: !236, line: 582, baseType: !53, size: 32, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !235, file: !236, line: 583, baseType: !323, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !236, line: 40, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !235, file: !236, line: 585, baseType: !53, size: 32, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !235, file: !236, line: 587, baseType: !327, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !234}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !235, file: !236, line: 590, baseType: !331, size: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !236, line: 47, size: 256, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !332, file: !236, line: 49, baseType: !331, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !332, file: !236, line: 50, baseType: !53, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !332, file: !236, line: 50, baseType: !53, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !332, file: !236, line: 50, baseType: !53, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !332, file: !236, line: 50, baseType: !53, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !332, file: !236, line: 51, baseType: !340, size: 32, offset: 192)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 32, elements: !288)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !236, line: 25, baseType: !5)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !235, file: !236, line: 591, baseType: !53, size: 32, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !235, file: !236, line: 592, baseType: !331, size: 64, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !235, file: !236, line: 593, baseType: !345, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !235, file: !236, line: 596, baseType: !53, size: 32, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !235, file: !236, line: 597, baseType: !265, size: 64, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !235, file: !236, line: 632, baseType: !349, size: 2880, offset: 1152)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !236, line: 599, size: 2880, elements: !350)
!350 = !{!351, !401}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !349, file: !236, line: 622, baseType: !352, size: 1728)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !236, line: 601, size: 1728, elements: !353)
!353 = !{!354, !355, !356, !360, !372, !373, !375, !383, !384, !385, !386, !390, !394, !395, !396, !397, !398, !399, !400}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !352, file: !236, line: 603, baseType: !5, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !352, file: !236, line: 604, baseType: !265, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !352, file: !236, line: 605, baseType: !357, size: 208, offset: 128)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 208, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 26)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !352, file: !236, line: 606, baseType: !361, size: 288, offset: 352)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !236, line: 55, size: 288, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !361, file: !236, line: 57, baseType: !53, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !361, file: !236, line: 58, baseType: !53, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !361, file: !236, line: 59, baseType: !53, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !361, file: !236, line: 60, baseType: !53, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !361, file: !236, line: 61, baseType: !53, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !361, file: !236, line: 62, baseType: !53, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !361, file: !236, line: 63, baseType: !53, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !361, file: !236, line: 64, baseType: !53, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !361, file: !236, line: 65, baseType: !53, size: 32, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !352, file: !236, line: 607, baseType: !53, size: 32, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !352, file: !236, line: 608, baseType: !374, size: 64, offset: 704)
!374 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !352, file: !236, line: 609, baseType: !376, size: 112, offset: 768)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !236, line: 319, size: 112, elements: !377)
!377 = !{!378, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !376, file: !236, line: 320, baseType: !379, size: 48)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 48, elements: !284)
!380 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !376, file: !236, line: 321, baseType: !379, size: 48, offset: 48)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !376, file: !236, line: 322, baseType: !380, size: 16, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !352, file: !236, line: 610, baseType: !300, size: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !352, file: !236, line: 611, baseType: !300, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !352, file: !236, line: 612, baseType: !300, size: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !352, file: !236, line: 613, baseType: !387, size: 64, offset: 1088)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 8)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !352, file: !236, line: 614, baseType: !391, size: 192, offset: 1152)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 192, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 24)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !352, file: !236, line: 615, baseType: !53, size: 32, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !352, file: !236, line: 616, baseType: !300, size: 64, offset: 1376)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !352, file: !236, line: 617, baseType: !300, size: 64, offset: 1440)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !352, file: !236, line: 618, baseType: !300, size: 64, offset: 1504)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !352, file: !236, line: 619, baseType: !300, size: 64, offset: 1568)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !352, file: !236, line: 620, baseType: !300, size: 64, offset: 1632)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !352, file: !236, line: 621, baseType: !53, size: 32, offset: 1696)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !349, file: !236, line: 631, baseType: !402, size: 2880)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !236, line: 626, size: 2880, elements: !403)
!403 = !{!404, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !402, file: !236, line: 629, baseType: !405, size: 1920)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 1920, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 30)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !402, file: !236, line: 630, baseType: !409, size: 960, offset: 1920)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !406)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !235, file: !236, line: 636, baseType: !411, size: 64, offset: 4032)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !236, line: 93, size: 6336, elements: !413)
!413 = !{!414, !415, !416, !423}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !412, file: !236, line: 94, baseType: !411, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !412, file: !236, line: 95, baseType: !53, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !412, file: !236, line: 97, baseType: !417, size: 2048, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 2048, elements: !421)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null}
!421 = !{!422}
!422 = !DISubrange(count: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !412, file: !236, line: 98, baseType: !424, size: 4160, offset: 2176)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !236, line: 74, size: 4160, elements: !425)
!425 = !{!426, !428, !429, !430}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !424, file: !236, line: 75, baseType: !427, size: 2048)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !421)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !424, file: !236, line: 76, baseType: !427, size: 2048, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !424, file: !236, line: 78, baseType: !341, size: 32, offset: 4096)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !424, file: !236, line: 81, baseType: !341, size: 32, offset: 4128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !235, file: !236, line: 637, baseType: !412, size: 6336, offset: 4096)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !235, file: !236, line: 641, baseType: !433, size: 64, offset: 10432)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !53}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !235, file: !236, line: 646, baseType: !438, size: 192, offset: 10496)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !236, line: 291, size: 192, elements: !439)
!439 = !{!440, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !438, file: !236, line: 293, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !438, file: !236, line: 294, baseType: !53, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !438, file: !236, line: 295, baseType: !240, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !235, file: !236, line: 648, baseType: !445, size: 4224, offset: 10688)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 4224, elements: !284)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !56, file: !57, line: 85, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !449)
!449 = !{!450, !454, !455, !462, !475}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !448, file: !4, line: 116, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !452, line: 64, baseType: !453)
!452 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !452, line: 63, baseType: !112)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !448, file: !4, line: 118, baseType: !451, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !448, file: !4, line: 120, baseType: !456, size: 128, offset: 128)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !457, line: 51, size: 128, elements: !458)
!457 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!458 = !{!459, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !457, line: 52, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !457, line: 53, baseType: !460, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !448, file: !4, line: 122, baseType: !463, size: 256, offset: 256)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !463, file: !4, line: 107, baseType: !3, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !463, file: !4, line: 109, baseType: !451, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !463, file: !4, line: 111, baseType: !468, size: 96, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !452, line: 72, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 68, size: 96, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !469, file: !452, line: 69, baseType: !53, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !469, file: !452, line: 70, baseType: !53, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !469, file: !452, line: 71, baseType: !474, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !452, line: 61, baseType: !53)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !448, file: !4, line: 124, baseType: !456, size: 128, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !50, file: !46, line: 38, baseType: !477, size: 64, offset: 128)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !46, line: 38, size: 64, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !477, file: !46, line: 38, baseType: !49, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !45, file: !46, line: 42, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !33, file: !23, line: 149, baseType: !53, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !33, file: !23, line: 156, baseType: !53, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !33, file: !23, line: 159, baseType: !53, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !33, file: !23, line: 160, baseType: !486, size: 128, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !20, line: 413, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !20, line: 411, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 395, size: 128, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !488, file: !20, line: 398, baseType: !11, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !488, file: !20, line: 399, baseType: !5, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !22, file: !23, line: 219, baseType: !11, size: 64, offset: 192)
!493 = !{!494, !495}
!494 = !DILocalVariable(name: "key", arg: 1, scope: !16, file: !1, line: 50, type: !19)
!495 = !DILocalVariable(name: "ptr", scope: !16, file: !1, line: 74, type: !11)
!496 = !DILocation(line: 50, column: 36, scope: !16)
!497 = !DILocation(line: 76, column: 11, scope: !498)
!498 = distinct !DILexicalBlock(scope: !16, file: !1, line: 76, column: 7)
!499 = !DILocation(line: 76, column: 7, scope: !16)
!500 = !DILocation(line: 82, column: 37, scope: !501)
!501 = distinct !DILexicalBlock(scope: !498, file: !1, line: 81, column: 5)
!502 = !{!503, !504, i64 0}
!503 = !{!"pthread_key_t_", !504, i64 0, !507, i64 8, !507, i64 16, !507, i64 24}
!504 = !{!"int", !505, i64 0}
!505 = !{!"omnipotent char", !506, i64 0}
!506 = !{!"Simple C/C++ TBAA"}
!507 = !{!"any pointer", !505, i64 0}
!508 = !DILocation(line: 82, column: 13, scope: !501)
!509 = !DILocation(line: 74, column: 10, scope: !16)
!510 = !DILocation(line: 0, scope: !501)
!511 = !DILocation(line: 85, column: 3, scope: !16)
