; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_getschedparam.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_getschedparam.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sched_param = type { i32 }

; Function Attrs: noredzone nounwind
define dso_local i32 @pthread_getschedparam(i8*, i32, i32*, %struct.sched_param*) local_unnamed_addr #0 !dbg !528 {
  %5 = tail call i32 @pthread_kill(i8* %0, i32 %1, i32 0) #3, !dbg !543
  %6 = icmp eq i32 %5, 0, !dbg !545
  br i1 %6, label %7, label %16, !dbg !547

; <label>:7:                                      ; preds = %4
  %8 = icmp ule i32* %2, inttoptr (i64 2 to i32*), !dbg !548
  %9 = icmp eq %struct.sched_param* %3, null, !dbg !550
  %10 = or i1 %8, %9, !dbg !551
  br i1 %10, label %16, label %11, !dbg !551

; <label>:11:                                     ; preds = %7
  store i32 0, i32* %2, align 4, !dbg !552, !tbaa !553
  %12 = getelementptr inbounds i8, i8* %0, i64 72, !dbg !557
  %13 = bitcast i8* %12 to i32*, !dbg !557
  %14 = load i32, i32* %13, align 8, !dbg !557, !tbaa !558
  %15 = getelementptr inbounds %struct.sched_param, %struct.sched_param* %3, i64 0, i32 0, !dbg !562
  store i32 %14, i32* %15, align 4, !dbg !563, !tbaa !564
  br label %16, !dbg !566


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !28)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_getschedparam.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !12, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 88, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sched.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "SCHED_OTHER", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "SCHED_FIFO", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "SCHED_RR", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "SCHED_MIN", value: 0, isUnsigned: true)
!11 = !DIEnumerator(name: "SCHED_MAX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !13, line: 92, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 61, baseType: !5, size: 32, elements: !20)
!19 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!20 = !{!21, !22, !23, !24, !25, !26, !27}
!21 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!28 = !{!29, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !19, line: 83, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !19, line: 85, size: 1536, elements: !35)
!35 = !{!36, !478, !486, !487, !490, !491, !492, !493, !494, !511, !512, !513, !514, !515, !516, !521, !522, !523}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !34, file: !19, line: 87, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !38, line: 11, baseType: !39)
!38 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !41, line: 59, size: 1024, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !47, !48, !49, !50, !56, !61, !67, !69, !85, !233, !234, !235, !448}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 60, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !40, file: !41, line: 61, baseType: !31, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !40, file: !41, line: 62, baseType: !31, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !40, file: !41, line: 63, baseType: !31, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !40, file: !41, line: 64, baseType: !51, size: 128, offset: 256)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 64, size: 128, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !51, file: !41, line: 64, baseType: !39, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !51, file: !41, line: 64, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !41, line: 65, baseType: !57, size: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !58, line: 48, baseType: !59)
!58 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !60, line: 79, baseType: !5)
!60 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !40, file: !41, line: 66, baseType: !62, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !63, line: 49, baseType: !64)
!63 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !65, line: 128, baseType: !66)
!65 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !40, file: !41, line: 67, baseType: !68, size: 8, offset: 512)
!68 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !40, file: !41, line: 68, baseType: !70, size: 128, offset: 576)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !71, line: 42, size: 128, elements: !72)
!71 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !{!73, !83}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !70, file: !71, line: 42, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !71, line: 35, size: 192, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !75, file: !71, line: 36, baseType: !30, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !75, file: !71, line: 37, baseType: !39, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !75, file: !71, line: 38, baseType: !80, size: 64, offset: 128)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !75, file: !71, line: 38, size: 64, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !80, file: !71, line: 38, baseType: !74, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !70, file: !71, line: 42, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !40, file: !41, line: 69, baseType: !86, size: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !88, line: 90, size: 2176, elements: !89)
!88 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!89 = !{!90, !95, !113, !118, !120, !122, !127, !135, !140, !145, !146, !147, !152, !230, !231, !232}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !87, file: !88, line: 91, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !88, line: 68, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !86}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !87, file: !88, line: 93, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !88, line: 71, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!30, !86, !39, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !103, line: 55, size: 128, elements: !105)
!105 = !{!106, !107, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !104, file: !103, line: 57, baseType: !68, size: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !104, file: !103, line: 59, baseType: !108, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !103, line: 53, baseType: !30)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !104, file: !103, line: 61, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !63, line: 48, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !65, line: 129, baseType: !112)
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !87, file: !88, line: 94, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !88, line: 74, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !86, !39}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !87, file: !88, line: 95, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !88, line: 76, baseType: !115)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !87, file: !88, line: 96, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !88, line: 78, baseType: !115)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !87, file: !88, line: 98, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !88, line: 81, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!30, !86, !39, !108}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !87, file: !88, line: 99, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !88, line: 83, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!30, !86, !132, !134}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !87, file: !88, line: 100, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !88, line: 85, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!30, !86, !39, !30}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !87, file: !88, line: 101, baseType: !141, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !88, line: 87, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!30, !86, !132, !29}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !87, file: !88, line: 104, baseType: !68, size: 8, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !87, file: !88, line: 105, baseType: !40, size: 1024, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !87, file: !88, line: 106, baseType: !148, size: 128, offset: 1664)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !41, line: 93, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !148, file: !41, line: 93, baseType: !39, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !148, file: !41, line: 93, baseType: !55, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !87, file: !88, line: 107, baseType: !153, size: 192, offset: 1792)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !154, line: 59, size: 192, elements: !155)
!154 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!155 = !{!156, !221, !225}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !153, file: !154, line: 61, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !154, line: 51, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!31, !161, !112, !112}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !163, line: 77, size: 832, elements: !164)
!163 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!164 = !{!165, !172, !177, !182, !188, !190, !195, !196, !197, !202, !207, !212, !213, !214}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !162, file: !163, line: 79, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !163, line: 54, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!31, !161, !170}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 58, baseType: !112)
!171 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !162, file: !163, line: 80, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !163, line: 56, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!31, !161, !170, !170}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !162, file: !163, line: 81, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !163, line: 62, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!31, !161, !31, !170}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !162, file: !163, line: 82, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !163, line: 58, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!30, !161, !187, !170, !170}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !162, file: !163, line: 83, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !163, line: 60, baseType: !174)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !162, file: !163, line: 84, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !163, line: 64, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !161, !31}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !162, file: !163, line: 87, baseType: !191, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !162, file: !163, line: 88, baseType: !166, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !162, file: !163, line: 92, baseType: !198, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !163, line: 66, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!31, !161, !112}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !162, file: !163, line: 93, baseType: !203, size: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !163, line: 68, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !161, !31, !112}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !162, file: !163, line: 99, baseType: !208, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !163, line: 70, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!30, !161, !31, !170}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !162, file: !163, line: 100, baseType: !170, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !163, line: 103, baseType: !161, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !162, file: !163, line: 104, baseType: !215, offset: 832)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, elements: !219)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !58, line: 20, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !60, line: 41, baseType: !218)
!218 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!219 = !{!220}
!220 = !DISubrange(count: -1)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !153, file: !154, line: 63, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !31}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !153, file: !154, line: 65, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !154, line: 56, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !31, !31}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !87, file: !88, line: 108, baseType: !161, size: 64, offset: 1984)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !88, line: 109, baseType: !86, size: 64, offset: 2048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !87, file: !88, line: 110, baseType: !31, size: 64, offset: 2112)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !40, file: !41, line: 70, baseType: !31, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !40, file: !41, line: 72, baseType: !30, size: 32, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !40, file: !41, line: 82, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !238, line: 569, size: 14912, elements: !239)
!238 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!239 = !{!240, !241, !316, !317, !318, !319, !323, !324, !327, !328, !332, !344, !345, !346, !348, !349, !350, !412, !433, !434, !439, !446}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !237, file: !238, line: 571, baseType: !30, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !237, file: !238, line: 576, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !238, line: 287, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !238, line: 181, size: 1408, elements: !245)
!245 = !{!246, !249, !250, !251, !253, !254, !259, !260, !261, !268, !272, !277, !281, !282, !283, !284, !288, !292, !293, !294, !296, !297, !301, !315}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !244, file: !238, line: 182, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !244, file: !238, line: 183, baseType: !30, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !244, file: !238, line: 184, baseType: !30, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !244, file: !238, line: 185, baseType: !252, size: 16, offset: 128)
!252 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !244, file: !238, line: 186, baseType: !252, size: 16, offset: 144)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !244, file: !238, line: 187, baseType: !255, size: 128, offset: 192)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !238, line: 117, size: 128, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !255, file: !238, line: 118, baseType: !247, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !255, file: !238, line: 119, baseType: !30, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !244, file: !238, line: 188, baseType: !30, size: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !244, file: !238, line: 195, baseType: !31, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !244, file: !238, line: 197, baseType: !262, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !236, !31, !267, !30}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !266, line: 145, baseType: !66)
!266 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !244, file: !238, line: 199, baseType: !269, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!265, !236, !31, !44, !30}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !244, file: !238, line: 202, baseType: !273, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !236, !31, !276, !30}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !266, line: 114, baseType: !66)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !244, file: !238, line: 203, baseType: !278, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!30, !236, !31}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !244, file: !238, line: 206, baseType: !255, size: 128, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !244, file: !238, line: 207, baseType: !247, size: 64, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !244, file: !238, line: 208, baseType: !30, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !244, file: !238, line: 211, baseType: !285, size: 24, offset: 928)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 24, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 3)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !244, file: !238, line: 212, baseType: !289, size: 8, offset: 952)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 1)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !244, file: !238, line: 215, baseType: !255, size: 128, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !244, file: !238, line: 218, baseType: !30, size: 32, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !244, file: !238, line: 219, baseType: !295, size: 64, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !266, line: 44, baseType: !66)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !244, file: !238, line: 222, baseType: !236, size: 64, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !244, file: !238, line: 226, baseType: !298, size: 32, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !266, line: 175, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !300, line: 12, baseType: !30)
!300 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !244, file: !238, line: 228, baseType: !302, size: 64, offset: 1312)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !266, line: 171, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 163, size: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !303, file: !266, line: 165, baseType: !30, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !303, file: !266, line: 170, baseType: !307, size: 32, offset: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !266, line: 166, size: 32, elements: !308)
!308 = !{!309, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !307, file: !266, line: 168, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !171, line: 124, baseType: !5)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !307, file: !266, line: 169, baseType: !312, size: 32)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 32, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !244, file: !238, line: 229, baseType: !30, size: 32, offset: 1376)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !237, file: !238, line: 576, baseType: !242, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !237, file: !238, line: 576, baseType: !242, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !237, file: !238, line: 578, baseType: !30, size: 32, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !237, file: !238, line: 579, baseType: !320, size: 200, offset: 288)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 200, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 25)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !237, file: !238, line: 582, baseType: !30, size: 32, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !237, file: !238, line: 583, baseType: !325, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !238, line: 40, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !237, file: !238, line: 585, baseType: !30, size: 32, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !237, file: !238, line: 587, baseType: !329, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !236}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !237, file: !238, line: 590, baseType: !333, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !238, line: 47, size: 256, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !334, file: !238, line: 49, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !334, file: !238, line: 50, baseType: !30, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !334, file: !238, line: 50, baseType: !30, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !334, file: !238, line: 50, baseType: !30, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !334, file: !238, line: 50, baseType: !30, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !334, file: !238, line: 51, baseType: !342, size: 32, offset: 192)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 32, elements: !290)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !238, line: 25, baseType: !5)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !237, file: !238, line: 591, baseType: !30, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !237, file: !238, line: 592, baseType: !333, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !237, file: !238, line: 593, baseType: !347, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !237, file: !238, line: 596, baseType: !30, size: 32, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !237, file: !238, line: 597, baseType: !267, size: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !237, file: !238, line: 632, baseType: !351, size: 2880, offset: 1152)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !238, line: 599, size: 2880, elements: !352)
!352 = !{!353, !403}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !351, file: !238, line: 622, baseType: !354, size: 1728)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !238, line: 601, size: 1728, elements: !355)
!355 = !{!356, !357, !358, !362, !374, !375, !377, !385, !386, !387, !388, !392, !396, !397, !398, !399, !400, !401, !402}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !354, file: !238, line: 603, baseType: !5, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !354, file: !238, line: 604, baseType: !267, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !354, file: !238, line: 605, baseType: !359, size: 208, offset: 128)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 208, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 26)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !354, file: !238, line: 606, baseType: !363, size: 288, offset: 352)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !238, line: 55, size: 288, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !363, file: !238, line: 57, baseType: !30, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !363, file: !238, line: 58, baseType: !30, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !363, file: !238, line: 59, baseType: !30, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !363, file: !238, line: 60, baseType: !30, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !363, file: !238, line: 61, baseType: !30, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !363, file: !238, line: 62, baseType: !30, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !363, file: !238, line: 63, baseType: !30, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !363, file: !238, line: 64, baseType: !30, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !363, file: !238, line: 65, baseType: !30, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !354, file: !238, line: 607, baseType: !30, size: 32, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !354, file: !238, line: 608, baseType: !376, size: 64, offset: 704)
!376 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !354, file: !238, line: 609, baseType: !378, size: 112, offset: 768)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !238, line: 319, size: 112, elements: !379)
!379 = !{!380, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !378, file: !238, line: 320, baseType: !381, size: 48)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 48, elements: !286)
!382 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !378, file: !238, line: 321, baseType: !381, size: 48, offset: 48)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !378, file: !238, line: 322, baseType: !382, size: 16, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !354, file: !238, line: 610, baseType: !302, size: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !354, file: !238, line: 611, baseType: !302, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !354, file: !238, line: 612, baseType: !302, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !354, file: !238, line: 613, baseType: !389, size: 64, offset: 1088)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !354, file: !238, line: 614, baseType: !393, size: 192, offset: 1152)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 24)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !354, file: !238, line: 615, baseType: !30, size: 32, offset: 1344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !354, file: !238, line: 616, baseType: !302, size: 64, offset: 1376)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !354, file: !238, line: 617, baseType: !302, size: 64, offset: 1440)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !354, file: !238, line: 618, baseType: !302, size: 64, offset: 1504)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !354, file: !238, line: 619, baseType: !302, size: 64, offset: 1568)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !354, file: !238, line: 620, baseType: !302, size: 64, offset: 1632)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !354, file: !238, line: 621, baseType: !30, size: 32, offset: 1696)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !351, file: !238, line: 631, baseType: !404, size: 2880)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !238, line: 626, size: 2880, elements: !405)
!405 = !{!406, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !404, file: !238, line: 629, baseType: !407, size: 1920)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 1920, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 30)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !404, file: !238, line: 630, baseType: !411, size: 960, offset: 1920)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !237, file: !238, line: 636, baseType: !413, size: 64, offset: 4032)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !238, line: 93, size: 6336, elements: !415)
!415 = !{!416, !417, !418, !425}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !414, file: !238, line: 94, baseType: !413, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !414, file: !238, line: 95, baseType: !30, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !414, file: !238, line: 97, baseType: !419, size: 2048, offset: 128)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 2048, elements: !423)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null}
!423 = !{!424}
!424 = !DISubrange(count: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !414, file: !238, line: 98, baseType: !426, size: 4160, offset: 2176)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !238, line: 74, size: 4160, elements: !427)
!427 = !{!428, !430, !431, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !426, file: !238, line: 75, baseType: !429, size: 2048)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2048, elements: !423)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !426, file: !238, line: 76, baseType: !429, size: 2048, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !426, file: !238, line: 78, baseType: !343, size: 32, offset: 4096)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !426, file: !238, line: 81, baseType: !343, size: 32, offset: 4128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !237, file: !238, line: 637, baseType: !414, size: 6336, offset: 4096)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !237, file: !238, line: 641, baseType: !435, size: 64, offset: 10432)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !30}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !237, file: !238, line: 646, baseType: !440, size: 192, offset: 10496)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !238, line: 291, size: 192, elements: !441)
!441 = !{!442, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !440, file: !238, line: 293, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !440, file: !238, line: 294, baseType: !30, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !440, file: !238, line: 295, baseType: !242, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !237, file: !238, line: 648, baseType: !447, size: 4224, offset: 10688)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 4224, elements: !286)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !40, file: !41, line: 85, baseType: !449, size: 64, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !13, line: 114, size: 640, elements: !451)
!451 = !{!452, !456, !457, !464, !477}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !450, file: !13, line: 116, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !454, line: 64, baseType: !455)
!454 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !454, line: 63, baseType: !112)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !450, file: !13, line: 118, baseType: !453, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !450, file: !13, line: 120, baseType: !458, size: 128, offset: 128)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !459, line: 51, size: 128, elements: !460)
!459 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!460 = !{!461, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !458, file: !459, line: 52, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !458, file: !459, line: 53, baseType: !462, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !450, file: !13, line: 122, baseType: !465, size: 256, offset: 256)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !13, line: 98, size: 256, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !465, file: !13, line: 107, baseType: !12, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !465, file: !13, line: 109, baseType: !453, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !465, file: !13, line: 111, baseType: !470, size: 96, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !454, line: 72, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 68, size: 96, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !471, file: !454, line: 69, baseType: !30, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !471, file: !454, line: 70, baseType: !30, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !471, file: !454, line: 71, baseType: !476, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !454, line: 61, baseType: !30)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !450, file: !13, line: 124, baseType: !458, size: 128, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !34, file: !19, line: 88, baseType: !479, size: 128, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !480, line: 413, baseType: !481)
!480 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !480, line: 411, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 395, size: 128, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !482, file: !480, line: 398, baseType: !31, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !482, file: !480, line: 399, baseType: !5, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !34, file: !19, line: 89, baseType: !32, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !34, file: !19, line: 90, baseType: !488, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !19, line: 80, baseType: !18)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !34, file: !19, line: 91, baseType: !31, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !34, file: !19, line: 92, baseType: !31, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !34, file: !19, line: 93, baseType: !30, size: 32, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !34, file: !19, line: 94, baseType: !30, size: 32, offset: 480)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !34, file: !19, line: 95, baseType: !495, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !480, line: 417, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !19, line: 146, size: 320, elements: !498)
!498 = !{!499, !507, !508, !509, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !497, file: !19, line: 148, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !38, line: 12, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !503, line: 51, size: 192, elements: !504)
!503 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !502, file: !503, line: 52, baseType: !66, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !502, file: !503, line: 53, baseType: !70, size: 128, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !497, file: !19, line: 149, baseType: !30, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !497, file: !19, line: 156, baseType: !30, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !497, file: !19, line: 159, baseType: !30, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !497, file: !19, line: 160, baseType: !479, size: 128, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !34, file: !19, line: 96, baseType: !30, size: 32, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !34, file: !19, line: 97, baseType: !495, size: 64, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !34, file: !19, line: 98, baseType: !30, size: 32, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !34, file: !19, line: 99, baseType: !30, size: 32, offset: 736)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !34, file: !19, line: 100, baseType: !30, size: 32, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !34, file: !19, line: 102, baseType: !517, size: 512, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !518, line: 372, baseType: !519)
!518 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 512, elements: !390)
!520 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !34, file: !19, line: 104, baseType: !30, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !34, file: !19, line: 106, baseType: !31, size: 64, offset: 1408)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !34, file: !19, line: 107, baseType: !31, size: 64, offset: 1472)
!524 = !{i32 2, !"Dwarf Version", i32 4}
!525 = !{i32 2, !"Debug Info Version", i32 3}
!526 = !{i32 1, !"wchar_size", i32 4}
!527 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!528 = distinct !DISubprogram(name: "pthread_getschedparam", scope: !1, file: !1, line: 48, type: !529, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !535)
!529 = !DISubroutineType(types: !530)
!530 = !{!30, !479, !29, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_param", file: !4, line: 97, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !532, file: !4, line: 99, baseType: !30, size: 32)
!535 = !{!536, !537, !538, !539}
!536 = !DILocalVariable(name: "thread", arg: 1, scope: !528, file: !1, line: 48, type: !479)
!537 = !DILocalVariable(name: "policy", arg: 2, scope: !528, file: !1, line: 48, type: !29)
!538 = !DILocalVariable(name: "param", arg: 3, scope: !528, file: !1, line: 49, type: !531)
!539 = !DILocalVariable(name: "result", scope: !528, file: !1, line: 51, type: !30)
!540 = !DILocation(line: 48, column: 34, scope: !528)
!541 = !DILocation(line: 48, column: 47, scope: !528)
!542 = !DILocation(line: 49, column: 44, scope: !528)
!543 = !DILocation(line: 54, column: 12, scope: !528)
!544 = !DILocation(line: 51, column: 7, scope: !528)
!545 = !DILocation(line: 55, column: 9, scope: !546)
!546 = distinct !DILexicalBlock(scope: !528, file: !1, line: 55, column: 7)
!547 = !DILocation(line: 55, column: 7, scope: !528)
!548 = !DILocation(line: 64, column: 14, scope: !549)
!549 = distinct !DILexicalBlock(scope: !528, file: !1, line: 64, column: 7)
!550 = !DILocation(line: 64, column: 44, scope: !549)
!551 = !DILocation(line: 64, column: 35, scope: !549)
!552 = !DILocation(line: 70, column: 11, scope: !528)
!553 = !{!554, !554, i64 0}
!554 = !{!"int", !555, i64 0}
!555 = !{!"omnipotent char", !556, i64 0}
!556 = !{!"Simple C/C++ TBAA"}
!557 = !DILocation(line: 78, column: 55, scope: !528)
!558 = !{!559, !554, i64 72}
!559 = !{!"pte_thread_t_", !560, i64 0, !561, i64 8, !560, i64 24, !555, i64 32, !560, i64 40, !560, i64 48, !554, i64 56, !554, i64 60, !560, i64 64, !554, i64 72, !560, i64 80, !554, i64 88, !554, i64 92, !554, i64 96, !555, i64 104, !554, i64 168, !560, i64 176, !560, i64 184}
!560 = !{!"any pointer", !555, i64 0}
!561 = !{!"", !560, i64 0, !554, i64 8}
!562 = !DILocation(line: 78, column: 10, scope: !528)
!563 = !DILocation(line: 78, column: 25, scope: !528)
!564 = !{!565, !554, i64 0}
!565 = !{!"sched_param", !554, i64 0}
!566 = !DILocation(line: 80, column: 3, scope: !528)
!567 = !DILocation(line: 0, scope: !528)
!568 = !DILocation(line: 81, column: 1, scope: !528)
