; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_detach.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_detach.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.uk_mutex = type { i32, %struct.uk_thread*, %struct.uk_waitq }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon = type { %struct.uk_thread*, %struct.uk_thread** }
%struct.uk_sched = type { void (%struct.uk_sched*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, %struct.uk_thread_attr*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, void (%struct.uk_sched*, %struct.uk_thread*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32)*, i32 (%struct.uk_sched*, %struct.uk_thread*, i32*)*, i8, %struct.uk_thread, %struct.uk_thread_list, %struct.ukplat_ctx_callbacks, %struct.uk_alloc*, %struct.uk_sched*, i8* }
%struct.uk_thread_attr = type { i8, i32, i64 }
%struct.uk_thread_list = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread_detach.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !9, !15, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PTE_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PTE_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !10, line: 92, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 61, baseType: !5, size: 32, elements: !17)
!16 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!17 = !{!18, !19, !20, !21, !22, !23, !24}
!18 = !DIEnumerator(name: "PThreadStateInitial", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PThreadStateRunning", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PThreadStateSuspended", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PThreadStateCancelPending", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PThreadStateCanceling", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PThreadStateException", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "PThreadStateLast", value: 6, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 435, baseType: !26, size: 32, elements: !27)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!28 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!29 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!30 = !DIEnumerator(name: "PTHREAD_INHERIT_SCHED", value: 0)
!31 = !DIEnumerator(name: "PTHREAD_EXPLICIT_SCHED", value: 1)
!32 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS", value: 0)
!33 = !DIEnumerator(name: "PTHREAD_SCOPE_SYSTEM", value: 1)
!34 = !DIEnumerator(name: "PTHREAD_SCOPE_PROCESS_VFPU", value: 2)
!35 = !DIEnumerator(name: "PTHREAD_CANCEL_ENABLE", value: 0)
!36 = !DIEnumerator(name: "PTHREAD_CANCEL_DISABLE", value: 1)
!37 = !DIEnumerator(name: "PTHREAD_CANCEL_ASYNCHRONOUS", value: 0)
!38 = !DIEnumerator(name: "PTHREAD_CANCEL_DEFERRED", value: 1)
!39 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!40 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!41 = !DIEnumerator(name: "PTHREAD_BARRIER_SERIAL_THREAD", value: -1)
!42 = !{!43, !59}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_thread_t", file: !16, line: 83, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pte_thread_t_", file: !16, line: 85, size: 1536, elements: !46)
!46 = !{!47, !491, !498, !499, !502, !503, !504, !505, !506, !523, !524, !525, !526, !527, !528, !533, !534, !535}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !45, file: !16, line: 87, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osThreadHandle", file: !49, line: 11, baseType: !50)
!49 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !52, line: 59, size: 1024, elements: !53)
!52 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!53 = !{!54, !58, !60, !61, !62, !68, !73, !79, !81, !97, !246, !247, !248, !461}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !52, line: 60, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !51, file: !52, line: 61, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !51, file: !52, line: 62, baseType: !59, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !51, file: !52, line: 63, baseType: !59, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !51, file: !52, line: 64, baseType: !63, size: 128, offset: 256)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !52, line: 64, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !63, file: !52, line: 64, baseType: !50, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !63, file: !52, line: 64, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !52, line: 65, baseType: !69, size: 32, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !70, line: 48, baseType: !71)
!70 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !72, line: 79, baseType: !5)
!72 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !51, file: !52, line: 66, baseType: !74, size: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !75, line: 49, baseType: !76)
!75 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !77, line: 128, baseType: !78)
!77 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!78 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !51, file: !52, line: 67, baseType: !80, size: 8, offset: 512)
!80 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !51, file: !52, line: 68, baseType: !82, size: 128, offset: 576)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !83, line: 42, size: 128, elements: !84)
!83 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!84 = !{!85, !95}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !82, file: !83, line: 42, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !83, line: 35, size: 192, elements: !88)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !87, file: !83, line: 36, baseType: !26, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !87, file: !83, line: 37, baseType: !50, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !87, file: !83, line: 38, baseType: !92, size: 64, offset: 128)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !83, line: 38, size: 64, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !92, file: !83, line: 38, baseType: !86, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !82, file: !83, line: 42, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !51, file: !52, line: 69, baseType: !98, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !100, line: 90, size: 2176, elements: !101)
!100 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!101 = !{!102, !107, !125, !130, !132, !134, !139, !147, !152, !158, !159, !160, !165, !243, !244, !245}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !99, file: !100, line: 91, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !100, line: 68, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !98}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !99, file: !100, line: 93, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !100, line: 71, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!26, !98, !50, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !115, line: 62, baseType: !116)
!115 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !115, line: 55, size: 128, elements: !117)
!117 = !{!118, !119, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !116, file: !115, line: 57, baseType: !80, size: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !116, file: !115, line: 59, baseType: !120, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !115, line: 53, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !116, file: !115, line: 61, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !75, line: 48, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !77, line: 129, baseType: !124)
!124 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !99, file: !100, line: 94, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !100, line: 74, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !98, !50}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !99, file: !100, line: 95, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !100, line: 76, baseType: !127)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !99, file: !100, line: 96, baseType: !133, size: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !100, line: 78, baseType: !127)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !99, file: !100, line: 98, baseType: !135, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !100, line: 81, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!26, !98, !50, !120}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !99, file: !100, line: 99, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !100, line: 83, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!26, !98, !144, !146}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !99, file: !100, line: 100, baseType: !148, size: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !100, line: 85, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!26, !98, !50, !26}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !99, file: !100, line: 101, baseType: !153, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !100, line: 87, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!26, !98, !144, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !99, file: !100, line: 104, baseType: !80, size: 8, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !99, file: !100, line: 105, baseType: !51, size: 1024, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !99, file: !100, line: 106, baseType: !161, size: 128, offset: 1664)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !52, line: 93, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !161, file: !52, line: 93, baseType: !50, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !161, file: !52, line: 93, baseType: !67, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !99, file: !100, line: 107, baseType: !166, size: 192, offset: 1792)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !167, line: 59, size: 192, elements: !168)
!167 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!168 = !{!169, !234, !238}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !166, file: !167, line: 61, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !167, line: 51, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!59, !174, !124, !124}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !176, line: 77, size: 832, elements: !177)
!176 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!177 = !{!178, !185, !190, !195, !201, !203, !208, !209, !210, !215, !220, !225, !226, !227}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !175, file: !176, line: 79, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !176, line: 54, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!59, !174, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 58, baseType: !124)
!184 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !175, file: !176, line: 80, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !176, line: 56, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!59, !174, !183, !183}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !175, file: !176, line: 81, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !176, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!59, !174, !59, !183}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !175, file: !176, line: 82, baseType: !196, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !176, line: 58, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!26, !174, !200, !183, !183}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !175, file: !176, line: 83, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !176, line: 60, baseType: !187)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !175, file: !176, line: 84, baseType: !204, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !176, line: 64, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !174, !59}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !175, file: !176, line: 87, baseType: !204, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !175, file: !176, line: 88, baseType: !179, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !175, file: !176, line: 92, baseType: !211, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !176, line: 66, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!59, !174, !124}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !175, file: !176, line: 93, baseType: !216, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !176, line: 68, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !174, !59, !124}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !175, file: !176, line: 99, baseType: !221, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !176, line: 70, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!26, !174, !59, !183}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !176, line: 100, baseType: !183, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 103, baseType: !174, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !176, line: 104, baseType: !228, offset: 832)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, elements: !232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !70, line: 20, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !72, line: 41, baseType: !231)
!231 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!232 = !{!233}
!233 = !DISubrange(count: -1)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !166, file: !167, line: 63, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !59}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !166, file: !167, line: 65, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !167, line: 56, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !59, !59}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !99, file: !100, line: 108, baseType: !174, size: 64, offset: 1984)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !100, line: 109, baseType: !98, size: 64, offset: 2048)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !99, file: !100, line: 110, baseType: !59, size: 64, offset: 2112)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !51, file: !52, line: 70, baseType: !59, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !51, file: !52, line: 72, baseType: !26, size: 32, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !51, file: !52, line: 82, baseType: !249, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !251, line: 569, size: 14912, elements: !252)
!251 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!252 = !{!253, !254, !329, !330, !331, !332, !336, !337, !340, !341, !345, !357, !358, !359, !361, !362, !363, !425, !446, !447, !452, !459}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !250, file: !251, line: 571, baseType: !26, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !250, file: !251, line: 576, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !251, line: 287, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !251, line: 181, size: 1408, elements: !258)
!258 = !{!259, !262, !263, !264, !266, !267, !272, !273, !274, !281, !285, !290, !294, !295, !296, !297, !301, !305, !306, !307, !309, !310, !314, !328}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !257, file: !251, line: 182, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !257, file: !251, line: 183, baseType: !26, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !257, file: !251, line: 184, baseType: !26, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !257, file: !251, line: 185, baseType: !265, size: 16, offset: 128)
!265 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !257, file: !251, line: 186, baseType: !265, size: 16, offset: 144)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !257, file: !251, line: 187, baseType: !268, size: 128, offset: 192)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !251, line: 117, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !268, file: !251, line: 118, baseType: !260, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !268, file: !251, line: 119, baseType: !26, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !257, file: !251, line: 188, baseType: !26, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !257, file: !251, line: 195, baseType: !59, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !257, file: !251, line: 197, baseType: !275, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !249, !59, !280, !26}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !279, line: 145, baseType: !78)
!279 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !257, file: !251, line: 199, baseType: !282, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!278, !249, !59, !55, !26}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !257, file: !251, line: 202, baseType: !286, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !249, !59, !289, !26}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !279, line: 114, baseType: !78)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !257, file: !251, line: 203, baseType: !291, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!26, !249, !59}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !257, file: !251, line: 206, baseType: !268, size: 128, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !257, file: !251, line: 207, baseType: !260, size: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !257, file: !251, line: 208, baseType: !26, size: 32, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !257, file: !251, line: 211, baseType: !298, size: 24, offset: 928)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 24, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 3)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !257, file: !251, line: 212, baseType: !302, size: 8, offset: 952)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 8, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !257, file: !251, line: 215, baseType: !268, size: 128, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !257, file: !251, line: 218, baseType: !26, size: 32, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !257, file: !251, line: 219, baseType: !308, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !279, line: 44, baseType: !78)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !257, file: !251, line: 222, baseType: !249, size: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !257, file: !251, line: 226, baseType: !311, size: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !279, line: 175, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !313, line: 12, baseType: !26)
!313 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !257, file: !251, line: 228, baseType: !315, size: 64, offset: 1312)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !279, line: 171, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 163, size: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !316, file: !279, line: 165, baseType: !26, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !316, file: !279, line: 170, baseType: !320, size: 32, offset: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !279, line: 166, size: 32, elements: !321)
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !320, file: !279, line: 168, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !184, line: 124, baseType: !5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !320, file: !279, line: 169, baseType: !325, size: 32)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 32, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 4)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !257, file: !251, line: 229, baseType: !26, size: 32, offset: 1376)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !250, file: !251, line: 576, baseType: !255, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !250, file: !251, line: 576, baseType: !255, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !250, file: !251, line: 578, baseType: !26, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !250, file: !251, line: 579, baseType: !333, size: 200, offset: 288)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 200, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 25)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !250, file: !251, line: 582, baseType: !26, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !250, file: !251, line: 583, baseType: !338, size: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !251, line: 40, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !250, file: !251, line: 585, baseType: !26, size: 32, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !250, file: !251, line: 587, baseType: !342, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !249}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !250, file: !251, line: 590, baseType: !346, size: 64, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !251, line: 47, size: 256, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !347, file: !251, line: 49, baseType: !346, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !347, file: !251, line: 50, baseType: !26, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !347, file: !251, line: 50, baseType: !26, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !347, file: !251, line: 50, baseType: !26, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !347, file: !251, line: 50, baseType: !26, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !347, file: !251, line: 51, baseType: !355, size: 32, offset: 192)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 32, elements: !303)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !251, line: 25, baseType: !5)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !250, file: !251, line: 591, baseType: !26, size: 32, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !250, file: !251, line: 592, baseType: !346, size: 64, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !250, file: !251, line: 593, baseType: !360, size: 64, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !250, file: !251, line: 596, baseType: !26, size: 32, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !250, file: !251, line: 597, baseType: !280, size: 64, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !250, file: !251, line: 632, baseType: !364, size: 2880, offset: 1152)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !251, line: 599, size: 2880, elements: !365)
!365 = !{!366, !416}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !364, file: !251, line: 622, baseType: !367, size: 1728)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !251, line: 601, size: 1728, elements: !368)
!368 = !{!369, !370, !371, !375, !387, !388, !390, !398, !399, !400, !401, !405, !409, !410, !411, !412, !413, !414, !415}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !367, file: !251, line: 603, baseType: !5, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !367, file: !251, line: 604, baseType: !280, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !367, file: !251, line: 605, baseType: !372, size: 208, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 208, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 26)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !367, file: !251, line: 606, baseType: !376, size: 288, offset: 352)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !251, line: 55, size: 288, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !376, file: !251, line: 57, baseType: !26, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !376, file: !251, line: 58, baseType: !26, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !376, file: !251, line: 59, baseType: !26, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !376, file: !251, line: 60, baseType: !26, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !376, file: !251, line: 61, baseType: !26, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !376, file: !251, line: 62, baseType: !26, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !376, file: !251, line: 63, baseType: !26, size: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !376, file: !251, line: 64, baseType: !26, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !376, file: !251, line: 65, baseType: !26, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !367, file: !251, line: 607, baseType: !26, size: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !367, file: !251, line: 608, baseType: !389, size: 64, offset: 704)
!389 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !367, file: !251, line: 609, baseType: !391, size: 112, offset: 768)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !251, line: 319, size: 112, elements: !392)
!392 = !{!393, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !391, file: !251, line: 320, baseType: !394, size: 48)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 48, elements: !299)
!395 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !391, file: !251, line: 321, baseType: !394, size: 48, offset: 48)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !391, file: !251, line: 322, baseType: !395, size: 16, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !367, file: !251, line: 610, baseType: !315, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !367, file: !251, line: 611, baseType: !315, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !367, file: !251, line: 612, baseType: !315, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !367, file: !251, line: 613, baseType: !402, size: 64, offset: 1088)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !367, file: !251, line: 614, baseType: !406, size: 192, offset: 1152)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 24)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !367, file: !251, line: 615, baseType: !26, size: 32, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !367, file: !251, line: 616, baseType: !315, size: 64, offset: 1376)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !367, file: !251, line: 617, baseType: !315, size: 64, offset: 1440)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !367, file: !251, line: 618, baseType: !315, size: 64, offset: 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !367, file: !251, line: 619, baseType: !315, size: 64, offset: 1568)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !367, file: !251, line: 620, baseType: !315, size: 64, offset: 1632)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !367, file: !251, line: 621, baseType: !26, size: 32, offset: 1696)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !364, file: !251, line: 631, baseType: !417, size: 2880)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !251, line: 626, size: 2880, elements: !418)
!418 = !{!419, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !417, file: !251, line: 629, baseType: !420, size: 1920)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 1920, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 30)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !417, file: !251, line: 630, baseType: !424, size: 960, offset: 1920)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !421)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !250, file: !251, line: 636, baseType: !426, size: 64, offset: 4032)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !251, line: 93, size: 6336, elements: !428)
!428 = !{!429, !430, !431, !438}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !427, file: !251, line: 94, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !427, file: !251, line: 95, baseType: !26, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !427, file: !251, line: 97, baseType: !432, size: 2048, offset: 128)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 2048, elements: !436)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null}
!436 = !{!437}
!437 = !DISubrange(count: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !427, file: !251, line: 98, baseType: !439, size: 4160, offset: 2176)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !251, line: 74, size: 4160, elements: !440)
!440 = !{!441, !443, !444, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !439, file: !251, line: 75, baseType: !442, size: 2048)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2048, elements: !436)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !439, file: !251, line: 76, baseType: !442, size: 2048, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !439, file: !251, line: 78, baseType: !356, size: 32, offset: 4096)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !439, file: !251, line: 81, baseType: !356, size: 32, offset: 4128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !250, file: !251, line: 637, baseType: !427, size: 6336, offset: 4096)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !250, file: !251, line: 641, baseType: !448, size: 64, offset: 10432)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !26}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !250, file: !251, line: 646, baseType: !453, size: 192, offset: 10496)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !251, line: 291, size: 192, elements: !454)
!454 = !{!455, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !453, file: !251, line: 293, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !453, file: !251, line: 294, baseType: !26, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !453, file: !251, line: 295, baseType: !255, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !250, file: !251, line: 648, baseType: !460, size: 4224, offset: 10688)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 4224, elements: !299)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !51, file: !52, line: 85, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !10, line: 114, size: 640, elements: !464)
!464 = !{!465, !469, !470, !477, !490}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !463, file: !10, line: 116, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !467, line: 64, baseType: !468)
!467 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !467, line: 63, baseType: !124)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !463, file: !10, line: 118, baseType: !466, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !463, file: !10, line: 120, baseType: !471, size: 128, offset: 128)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !472, line: 51, size: 128, elements: !473)
!472 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !472, line: 52, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !472, line: 53, baseType: !475, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !463, file: !10, line: 122, baseType: !478, size: 256, offset: 256)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !10, line: 98, size: 256, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !478, file: !10, line: 107, baseType: !9, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !478, file: !10, line: 109, baseType: !466, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !478, file: !10, line: 111, baseType: !483, size: 96, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !467, line: 72, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 68, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !484, file: !467, line: 69, baseType: !26, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !484, file: !467, line: 70, baseType: !26, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !484, file: !467, line: 71, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !467, line: 61, baseType: !26)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !463, file: !10, line: 124, baseType: !471, size: 128, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ptHandle", scope: !45, file: !16, line: 88, baseType: !492, size: 128, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !4, line: 413, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !4, line: 411, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 395, size: 128, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !494, file: !4, line: 398, baseType: !59, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !494, file: !4, line: 399, baseType: !5, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prevReuse", scope: !45, file: !16, line: 89, baseType: !43, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !45, file: !16, line: 90, baseType: !500, size: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PThreadState", file: !16, line: 80, baseType: !15)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", scope: !45, file: !16, line: 91, baseType: !59, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !45, file: !16, line: 92, baseType: !59, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ptErrno", scope: !45, file: !16, line: 93, baseType: !26, size: 32, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "detachState", scope: !45, file: !16, line: 94, baseType: !26, size: 32, offset: 480)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "threadLock", scope: !45, file: !16, line: 95, baseType: !507, size: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !4, line: 417, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !16, line: 146, size: 320, elements: !510)
!510 = !{!511, !519, !520, !521, !522}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !509, file: !16, line: 148, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !49, line: 12, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !515, line: 51, size: 192, elements: !516)
!515 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !514, file: !515, line: 52, baseType: !78, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !514, file: !515, line: 53, baseType: !82, size: 128, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !509, file: !16, line: 149, baseType: !26, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !509, file: !16, line: 156, baseType: !26, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !509, file: !16, line: 159, baseType: !26, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !509, file: !16, line: 160, baseType: !492, size: 128, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !45, file: !16, line: 96, baseType: !26, size: 32, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cancelLock", scope: !45, file: !16, line: 97, baseType: !507, size: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cancelState", scope: !45, file: !16, line: 98, baseType: !26, size: 32, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cancelType", scope: !45, file: !16, line: 99, baseType: !26, size: 32, offset: 736)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cancelEvent", scope: !45, file: !16, line: 100, baseType: !26, size: 32, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "start_mark", scope: !45, file: !16, line: 102, baseType: !529, size: 512, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !530, line: 372, baseType: !531)
!530 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/setjmp.h", directory: "/root/.unikraft/apps/redis/build")
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 512, elements: !403)
!532 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !45, file: !16, line: 104, baseType: !26, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !45, file: !16, line: 106, baseType: !59, size: 64, offset: 1408)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "nextAssoc", scope: !45, file: !16, line: 107, baseType: !59, size: 64, offset: 1472)
!536 = !{i32 2, !"Dwarf Version", i32 4}
!537 = !{i32 2, !"Debug Info Version", i32 3}
!538 = !{i32 1, !"wchar_size", i32 4}
!539 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!540 = distinct !DISubprogram(name: "pthread_detach", scope: !1, file: !1, line: 50, type: !541, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{!26, !492}
!543 = !{!544, !545, !546, !547}
!544 = !DILocalVariable(name: "thread", arg: 1, scope: !540, file: !1, line: 50, type: !492)
!545 = !DILocalVariable(name: "result", scope: !540, file: !1, line: 76, type: !26)
!546 = !DILocalVariable(name: "destroyIt", scope: !540, file: !1, line: 77, type: !261)
!547 = !DILocalVariable(name: "tp", scope: !540, file: !1, line: 78, type: !43)
!548 = !DILocation(line: 50, column: 27, scope: !540)
!549 = !DILocation(line: 77, column: 17, scope: !540)
!550 = !DILocation(line: 78, column: 18, scope: !540)
!551 = !DILocation(line: 81, column: 20, scope: !540)
!552 = !{!553, !553, i64 0}
!553 = !{!"any pointer", !554, i64 0}
!554 = !{!"omnipotent char", !555, i64 0}
!555 = !{!"Simple C/C++ TBAA"}
!556 = !DILocation(line: 81, column: 3, scope: !540)
!557 = !DILocation(line: 83, column: 12, scope: !558)
!558 = distinct !DILexicalBlock(scope: !540, file: !1, line: 83, column: 7)
!559 = !DILocation(line: 84, column: 7, scope: !558)
!560 = !DILocation(line: 84, column: 35, scope: !558)
!561 = !{!562, !564, i64 16}
!562 = !{!"pte_thread_t_", !553, i64 0, !563, i64 8, !553, i64 24, !554, i64 32, !553, i64 40, !553, i64 48, !564, i64 56, !564, i64 60, !553, i64 64, !564, i64 72, !553, i64 80, !564, i64 88, !564, i64 92, !564, i64 96, !554, i64 104, !564, i64 168, !553, i64 176, !553, i64 184}
!563 = !{!"", !553, i64 0, !564, i64 8}
!564 = !{!"int", !554, i64 0}
!565 = !DILocation(line: 84, column: 19, scope: !558)
!566 = !DILocation(line: 83, column: 7, scope: !540)
!567 = !DILocation(line: 88, column: 43, scope: !568)
!568 = distinct !DILexicalBlock(scope: !558, file: !1, line: 88, column: 12)
!569 = !{!562, !564, i64 60}
!570 = !DILocation(line: 88, column: 36, scope: !568)
!571 = !DILocation(line: 88, column: 12, scope: !558)
!572 = !DILocation(line: 76, column: 7, scope: !540)
!573 = !DILocation(line: 101, column: 36, scope: !574)
!574 = distinct !DILexicalBlock(scope: !575, file: !1, line: 101, column: 11)
!575 = distinct !DILexicalBlock(scope: !568, file: !1, line: 93, column: 5)
!576 = !DILocation(line: 101, column: 11, scope: !574)
!577 = !DILocation(line: 101, column: 48, scope: !574)
!578 = !DILocation(line: 101, column: 11, scope: !575)
!579 = !DILocation(line: 103, column: 19, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !1, line: 103, column: 15)
!581 = distinct !DILexicalBlock(scope: !574, file: !1, line: 102, column: 9)
!582 = !{!562, !554, i64 32}
!583 = !DILocation(line: 103, column: 25, scope: !580)
!584 = !DILocation(line: 103, column: 15, scope: !581)
!585 = !DILocation(line: 105, column: 31, scope: !586)
!586 = distinct !DILexicalBlock(scope: !580, file: !1, line: 104, column: 13)
!587 = !DILocation(line: 106, column: 13, scope: !586)
!588 = !DILocation(line: 107, column: 24, scope: !589)
!589 = distinct !DILexicalBlock(scope: !580, file: !1, line: 107, column: 20)
!590 = !DILocation(line: 107, column: 36, scope: !589)
!591 = !DILocation(line: 107, column: 20, scope: !580)
!592 = !DILocation(line: 0, scope: !540)
!593 = !DILocation(line: 114, column: 18, scope: !581)
!594 = !DILocation(line: 115, column: 9, scope: !581)
!595 = !DILocation(line: 0, scope: !596)
!596 = distinct !DILexicalBlock(scope: !574, file: !1, line: 117, column: 9)
!597 = !DILocation(line: 123, column: 21, scope: !540)
!598 = !DILocation(line: 123, column: 3, scope: !540)
!599 = !DILocation(line: 125, column: 14, scope: !600)
