; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._rio = type { i64 (%struct._rio*, i8*, i64)*, i64 (%struct._rio*, i8*, i64)*, i64 (%struct._rio*)*, i32 (%struct._rio*)*, void (%struct._rio*, i8*, i64)*, i64, i64, i64, %union.anon }
%union.anon = type { %struct.anon.2 }
%struct.anon.2 = type { i32*, i32*, i32, i64, i8* }
%struct.anon = type { i8*, i64 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.3, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.3 = type { %struct.anon.5 }
%struct.anon.5 = type { [30 x i8*], [30 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rioBufferIO", scope: !2, file: !3, line: 88, type: !59, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !56)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !23, !33, !43, !53, !54, !55}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !8, line: 51, size: 24, elements: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!9 = !{!10, !16, !17, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !7, file: !8, line: 52, baseType: !11, size: 8)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 24, baseType: !13)
!12 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !14, line: 43, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!15 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !7, file: !8, line: 53, baseType: !11, size: 8, offset: 8)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !8, line: 54, baseType: !15, size: 8, offset: 16)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !7, file: !8, line: 55, baseType: !19, offset: 24)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, elements: !21)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !{!22}
!22 = !DISubrange(count: -1)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !8, line: 57, size: 40, elements: !25)
!25 = !{!26, !30, !31, !32}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, file: !8, line: 58, baseType: !27, size: 16)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 36, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !14, line: 57, baseType: !29)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !24, file: !8, line: 59, baseType: !27, size: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !24, file: !8, line: 60, baseType: !15, size: 8, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !24, file: !8, line: 61, baseType: !19, offset: 40)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !8, line: 63, size: 72, elements: !35)
!35 = !{!36, !40, !41, !42}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !8, line: 64, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 48, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !14, line: 79, baseType: !39)
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !34, file: !8, line: 65, baseType: !37, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !8, line: 66, baseType: !15, size: 8, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !34, file: !8, line: 67, baseType: !19, offset: 72)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !8, line: 69, size: 136, elements: !45)
!45 = !{!46, !50, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !44, file: !8, line: 70, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 60, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !14, line: 105, baseType: !49)
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !44, file: !8, line: 71, baseType: !47, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !8, line: 72, baseType: !15, size: 8, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !44, file: !8, line: 73, baseType: !19, offset: 136)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !{!0, !57, !336}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "rioFileIO", scope: !2, file: !3, line: 141, type: !59, isLocal: true, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio", file: !61, line: 87, baseType: !62)
!61 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/rio.h", directory: "/root/.unikraft/apps/redis/build")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rio", file: !61, line: 39, size: 832, elements: !63)
!63 = !{!64, !73, !79, !88, !93, !97, !98, !99, !100}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !62, file: !61, line: 43, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !72, !55, !68}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 40, baseType: !70)
!69 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !71, line: 129, baseType: !49)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !62, file: !61, line: 44, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!68, !72, !77, !68}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tell", scope: !62, file: !61, line: 45, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !72}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !84, line: 173, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 100, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !71, line: 44, baseType: !87)
!87 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !62, file: !61, line: 46, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !72}
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "update_cksum", scope: !62, file: !61, line: 52, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !72, !77, !68}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !62, file: !61, line: 55, baseType: !47, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "processed_bytes", scope: !62, file: !61, line: 58, baseType: !68, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "max_processing_chunk", scope: !62, file: !61, line: 61, baseType: !68, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !62, file: !61, line: 84, baseType: !101, size: 320, offset: 512)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !61, line: 64, size: 320, elements: !102)
!102 = !{!103, !109, !327}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !101, file: !61, line: 69, baseType: !104, size: 128)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !61, line: 66, size: 128, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !104, file: !61, line: 67, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !8, line: 43, baseType: !53)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !104, file: !61, line: 68, baseType: !83, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !101, file: !61, line: 75, baseType: !110, size: 192)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !61, line: 71, size: 192, elements: !111)
!111 = !{!112, !325, !326}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !110, file: !61, line: 72, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !115, line: 66, baseType: !116)
!115 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !117, line: 287, baseType: !118)
!117 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !117, line: 181, size: 1408, elements: !119)
!119 = !{!120, !121, !122, !123, !125, !126, !131, !132, !133, !293, !299, !304, !308, !309, !310, !311, !313, !315, !316, !317, !318, !319, !323, !324}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !118, file: !117, line: 182, baseType: !54, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !118, file: !117, line: 183, baseType: !92, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !118, file: !117, line: 184, baseType: !92, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !118, file: !117, line: 185, baseType: !124, size: 16, offset: 128)
!124 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !118, file: !117, line: 186, baseType: !124, size: 16, offset: 144)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !118, file: !117, line: 187, baseType: !127, size: 128, offset: 192)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !117, line: 117, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !127, file: !117, line: 118, baseType: !54, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !127, file: !117, line: 119, baseType: !92, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !118, file: !117, line: 188, baseType: !92, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !118, file: !117, line: 195, baseType: !55, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !118, file: !117, line: 197, baseType: !134, size: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !138, !55, !53, !92}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !71, line: 145, baseType: !87)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !117, line: 569, size: 14912, elements: !140)
!140 = !{!141, !142, !144, !145, !146, !147, !151, !152, !155, !156, !160, !174, !175, !176, !178, !179, !180, !257, !278, !279, !284, !291}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !139, file: !117, line: 571, baseType: !92, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !139, file: !117, line: 576, baseType: !143, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !139, file: !117, line: 576, baseType: !143, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !139, file: !117, line: 576, baseType: !143, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !139, file: !117, line: 578, baseType: !92, size: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !139, file: !117, line: 579, baseType: !148, size: 200, offset: 288)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 25)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !139, file: !117, line: 582, baseType: !92, size: 32, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !139, file: !117, line: 583, baseType: !153, size: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !117, line: 40, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !139, file: !117, line: 585, baseType: !92, size: 32, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !139, file: !117, line: 587, baseType: !157, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !138}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !139, file: !117, line: 590, baseType: !161, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !117, line: 47, size: 256, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !162, file: !117, line: 49, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !162, file: !117, line: 50, baseType: !92, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !162, file: !117, line: 50, baseType: !92, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !162, file: !117, line: 50, baseType: !92, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !162, file: !117, line: 50, baseType: !92, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !162, file: !117, line: 51, baseType: !170, size: 32, offset: 192)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 32, elements: !172)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !117, line: 25, baseType: !39)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !139, file: !117, line: 591, baseType: !92, size: 32, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !139, file: !117, line: 592, baseType: !161, size: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !139, file: !117, line: 593, baseType: !177, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !139, file: !117, line: 596, baseType: !92, size: 32, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !139, file: !117, line: 597, baseType: !53, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !139, file: !117, line: 632, baseType: !181, size: 2880, offset: 1152)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !139, file: !117, line: 599, size: 2880, elements: !182)
!182 = !{!183, !248}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !181, file: !117, line: 622, baseType: !184, size: 1728)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !117, line: 601, size: 1728, elements: !185)
!185 = !{!186, !187, !188, !192, !204, !205, !207, !216, !231, !232, !233, !237, !241, !242, !243, !244, !245, !246, !247}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !184, file: !117, line: 603, baseType: !39, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !184, file: !117, line: 604, baseType: !53, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !184, file: !117, line: 605, baseType: !189, size: 208, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 208, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 26)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !184, file: !117, line: 606, baseType: !193, size: 288, offset: 352)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !117, line: 55, size: 288, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !193, file: !117, line: 57, baseType: !92, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !193, file: !117, line: 58, baseType: !92, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !193, file: !117, line: 59, baseType: !92, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !193, file: !117, line: 60, baseType: !92, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !193, file: !117, line: 61, baseType: !92, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !193, file: !117, line: 62, baseType: !92, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !193, file: !117, line: 63, baseType: !92, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !193, file: !117, line: 64, baseType: !92, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !193, file: !117, line: 65, baseType: !92, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !184, file: !117, line: 607, baseType: !92, size: 32, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !184, file: !117, line: 608, baseType: !206, size: 64, offset: 704)
!206 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !184, file: !117, line: 609, baseType: !208, size: 112, offset: 768)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !117, line: 319, size: 112, elements: !209)
!209 = !{!210, !214, !215}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !208, file: !117, line: 320, baseType: !211, size: 48)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 48, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !208, file: !117, line: 321, baseType: !211, size: 48, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !208, file: !117, line: 322, baseType: !29, size: 16, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !184, file: !117, line: 610, baseType: !217, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !71, line: 171, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 163, size: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !218, file: !71, line: 165, baseType: !92, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !218, file: !71, line: 170, baseType: !222, size: 32, offset: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !71, line: 166, size: 32, elements: !223)
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !222, file: !71, line: 168, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !226, line: 124, baseType: !39)
!226 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !222, file: !71, line: 169, baseType: !228, size: 32)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 4)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !184, file: !117, line: 611, baseType: !217, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !184, file: !117, line: 612, baseType: !217, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !184, file: !117, line: 613, baseType: !234, size: 64, offset: 1088)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 8)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !184, file: !117, line: 614, baseType: !238, size: 192, offset: 1152)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 192, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !184, file: !117, line: 615, baseType: !92, size: 32, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !184, file: !117, line: 616, baseType: !217, size: 64, offset: 1376)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !184, file: !117, line: 617, baseType: !217, size: 64, offset: 1440)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !184, file: !117, line: 618, baseType: !217, size: 64, offset: 1504)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !184, file: !117, line: 619, baseType: !217, size: 64, offset: 1568)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !184, file: !117, line: 620, baseType: !217, size: 64, offset: 1632)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !184, file: !117, line: 621, baseType: !92, size: 32, offset: 1696)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !181, file: !117, line: 631, baseType: !249, size: 2880)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !117, line: 626, size: 2880, elements: !250)
!250 = !{!251, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !249, file: !117, line: 629, baseType: !252, size: 1920)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1920, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 30)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !249, file: !117, line: 630, baseType: !256, size: 960, offset: 1920)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 960, elements: !253)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !139, file: !117, line: 636, baseType: !258, size: 64, offset: 4032)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !117, line: 93, size: 6336, elements: !260)
!260 = !{!261, !262, !263, !270}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !259, file: !117, line: 94, baseType: !258, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !259, file: !117, line: 95, baseType: !92, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !259, file: !117, line: 97, baseType: !264, size: 2048, offset: 128)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 2048, elements: !268)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !{!269}
!269 = !DISubrange(count: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !259, file: !117, line: 98, baseType: !271, size: 4160, offset: 2176)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !117, line: 74, size: 4160, elements: !272)
!272 = !{!273, !275, !276, !277}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !271, file: !117, line: 75, baseType: !274, size: 2048)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !268)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !271, file: !117, line: 76, baseType: !274, size: 2048, offset: 2048)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !271, file: !117, line: 78, baseType: !171, size: 32, offset: 4096)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !271, file: !117, line: 81, baseType: !171, size: 32, offset: 4128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !139, file: !117, line: 637, baseType: !259, size: 6336, offset: 4096)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !139, file: !117, line: 641, baseType: !280, size: 64, offset: 10432)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !92}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !139, file: !117, line: 646, baseType: !285, size: 192, offset: 10496)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !117, line: 291, size: 192, elements: !286)
!286 = !{!287, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !285, file: !117, line: 293, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !285, file: !117, line: 294, baseType: !92, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !285, file: !117, line: 295, baseType: !143, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !139, file: !117, line: 648, baseType: !292, size: 4224, offset: 10688)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 4224, elements: !212)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !118, file: !117, line: 199, baseType: !294, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!137, !138, !55, !297, !92}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !118, file: !117, line: 202, baseType: !300, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !138, !55, !303, !92}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !71, line: 114, baseType: !87)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !118, file: !117, line: 203, baseType: !305, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!92, !138, !55}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !118, file: !117, line: 206, baseType: !127, size: 128, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !118, file: !117, line: 207, baseType: !54, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !118, file: !117, line: 208, baseType: !92, size: 32, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !118, file: !117, line: 211, baseType: !312, size: 24, offset: 928)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 24, elements: !212)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !118, file: !117, line: 212, baseType: !314, size: 8, offset: 952)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !172)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !118, file: !117, line: 215, baseType: !127, size: 128, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !118, file: !117, line: 218, baseType: !92, size: 32, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !118, file: !117, line: 219, baseType: !86, size: 64, offset: 1152)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !118, file: !117, line: 222, baseType: !138, size: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !118, file: !117, line: 226, baseType: !320, size: 32, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !71, line: 175, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !322, line: 12, baseType: !92)
!322 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !118, file: !117, line: 228, baseType: !217, size: 64, offset: 1312)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !118, file: !117, line: 229, baseType: !92, size: 32, offset: 1376)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !110, file: !61, line: 73, baseType: !83, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "autosync", scope: !110, file: !61, line: 74, baseType: !83, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fdset", scope: !101, file: !61, line: 83, baseType: !328, size: 320)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !61, line: 77, size: 320, elements: !329)
!329 = !{!330, !332, !333, !334, !335}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !328, file: !61, line: 78, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !61, line: 79, baseType: !331, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "numfds", scope: !328, file: !61, line: 80, baseType: !92, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !328, file: !61, line: 81, baseType: !83, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !328, file: !61, line: 82, baseType: !107, size: 64, offset: 256)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "rioFdsetIO", scope: !2, file: !3, line: 254, type: !59, isLocal: true, isDefinition: true)
!338 = !{i32 2, !"Dwarf Version", i32 4}
!339 = !{i32 2, !"Debug Info Version", i32 3}
!340 = !{i32 1, !"wchar_size", i32 4}
!341 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!342 = distinct !DISubprogram(name: "rioInitWithBuffer", scope: !3, file: !3, line: 100, type: !343, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !346)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !345, !107}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!346 = !{!347, !348}
!347 = !DILocalVariable(name: "r", arg: 1, scope: !342, file: !3, line: 100, type: !345)
!348 = !DILocalVariable(name: "s", arg: 2, scope: !342, file: !3, line: 100, type: !107)
!349 = !DILocation(line: 100, column: 29, scope: !342)
!350 = !DILocation(line: 100, column: 36, scope: !342)
!351 = !DILocation(line: 101, column: 10, scope: !342)
!352 = !{i64 0, i64 8, !353, i64 8, i64 8, !353, i64 16, i64 8, !353, i64 24, i64 8, !353, i64 32, i64 8, !353, i64 40, i64 8, !357, i64 48, i64 8, !357, i64 56, i64 8, !357, i64 64, i64 8, !353, i64 72, i64 8, !357, i64 64, i64 8, !353, i64 72, i64 8, !357, i64 80, i64 8, !357, i64 64, i64 8, !353, i64 72, i64 8, !353, i64 80, i64 4, !359, i64 88, i64 8, !357, i64 96, i64 8, !353}
!353 = !{!354, !354, i64 0}
!354 = !{!"any pointer", !355, i64 0}
!355 = !{!"omnipotent char", !356, i64 0}
!356 = !{!"Simple C/C++ TBAA"}
!357 = !{!358, !358, i64 0}
!358 = !{!"long", !355, i64 0}
!359 = !{!360, !360, i64 0}
!360 = !{!"int", !355, i64 0}
!361 = !DILocation(line: 102, column: 8, scope: !342)
!362 = !DILocation(line: 102, column: 18, scope: !342)
!363 = !DILocation(line: 102, column: 22, scope: !342)
!364 = !{!355, !355, i64 0}
!365 = !DILocation(line: 103, column: 18, scope: !342)
!366 = !DILocation(line: 103, column: 22, scope: !342)
!367 = !DILocation(line: 104, column: 1, scope: !342)
!368 = distinct !DISubprogram(name: "rioInitWithFile", scope: !3, file: !3, line: 153, type: !369, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !345, !113}
!371 = !{!372, !373}
!372 = !DILocalVariable(name: "r", arg: 1, scope: !368, file: !3, line: 153, type: !345)
!373 = !DILocalVariable(name: "fp", arg: 2, scope: !368, file: !3, line: 153, type: !113)
!374 = !DILocation(line: 153, column: 27, scope: !368)
!375 = !DILocation(line: 153, column: 36, scope: !368)
!376 = !DILocation(line: 154, column: 10, scope: !368)
!377 = !DILocation(line: 155, column: 8, scope: !368)
!378 = !DILocation(line: 155, column: 16, scope: !368)
!379 = !DILocation(line: 155, column: 19, scope: !368)
!380 = !DILocation(line: 156, column: 16, scope: !368)
!381 = !DILocation(line: 156, column: 25, scope: !368)
!382 = !DILocation(line: 158, column: 1, scope: !368)
!383 = distinct !DISubprogram(name: "rioInitWithFdset", scope: !3, file: !3, line: 266, type: !384, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !345, !331, !92}
!386 = !{!387, !388, !389, !390}
!387 = !DILocalVariable(name: "r", arg: 1, scope: !383, file: !3, line: 266, type: !345)
!388 = !DILocalVariable(name: "fds", arg: 2, scope: !383, file: !3, line: 266, type: !331)
!389 = !DILocalVariable(name: "numfds", arg: 3, scope: !383, file: !3, line: 266, type: !92)
!390 = !DILocalVariable(name: "j", scope: !383, file: !3, line: 267, type: !92)
!391 = !DILocation(line: 266, column: 28, scope: !383)
!392 = !DILocation(line: 266, column: 36, scope: !383)
