; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_init.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_init.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sem_t_ = type { i32, %struct.pthread_mutex_t_*, %struct.uk_semaphore* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.pte_handle_t = type { i8*, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_init.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pte_osResult", file: !11, line: 38, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pte_generic_osal.h", directory: "/root/.unikraft/apps/redis/build")
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "PTE_OS_OK", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PTE_OS_NO_RESOURCES", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PTE_OS_GENERAL_FAILURE", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PTE_OS_TIMEOUT", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PTE_OS_INTERRUPTED", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PTE_OS_INVALID_PARAM", value: 5, isUnsigned: true)
!19 = !{!5, !20, !62}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !21, line: 78, baseType: !22)
!21 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_t_", file: !24, line: 136, size: 192, elements: !25)
!24 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!25 = !{!26, !28, !494}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !23, file: !24, line: 138, baseType: !27, size: 32)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !23, file: !24, line: 139, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !30, line: 417, baseType: !31)
!30 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !24, line: 146, size: 320, elements: !33)
!33 = !{!34, !484, !485, !486, !487}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !32, file: !24, line: 148, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !36, line: 12, baseType: !37)
!36 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !39, line: 51, size: 192, elements: !40)
!39 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !38, file: !39, line: 52, baseType: !42, size: 64)
!42 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !38, file: !39, line: 53, baseType: !44, size: 128, offset: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !45, line: 42, size: 128, elements: !46)
!45 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !{!47, !482}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !44, file: !45, line: 42, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !45, line: 35, size: 192, elements: !50)
!50 = !{!51, !52, !478}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !49, file: !45, line: 36, baseType: !27, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !49, file: !45, line: 37, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !55, line: 59, size: 1024, elements: !56)
!55 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!56 = !{!57, !61, !63, !64, !65, !71, !76, !81, !83, !84, !233, !234, !235, !448}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !55, line: 60, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !54, file: !55, line: 61, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !54, file: !55, line: 62, baseType: !62, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !54, file: !55, line: 63, baseType: !62, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !54, file: !55, line: 64, baseType: !66, size: 128, offset: 256)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !54, file: !55, line: 64, size: 128, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !66, file: !55, line: 64, baseType: !53, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !66, file: !55, line: 64, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !55, line: 65, baseType: !72, size: 32, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !73, line: 48, baseType: !74)
!73 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !75, line: 79, baseType: !5)
!75 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !54, file: !55, line: 66, baseType: !77, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !78, line: 49, baseType: !79)
!78 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !80, line: 128, baseType: !42)
!80 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !54, file: !55, line: 67, baseType: !82, size: 8, offset: 512)
!82 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !54, file: !55, line: 68, baseType: !44, size: 128, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !54, file: !55, line: 69, baseType: !85, size: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !87, line: 90, size: 2176, elements: !88)
!87 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !{!89, !94, !112, !117, !119, !121, !126, !134, !139, !145, !146, !147, !152, !230, !231, !232}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !86, file: !87, line: 91, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !87, line: 68, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !85}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !86, file: !87, line: 93, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !87, line: 71, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!27, !85, !53, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !102, line: 55, size: 128, elements: !104)
!104 = !{!105, !106, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !103, file: !102, line: 57, baseType: !82, size: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !103, file: !102, line: 59, baseType: !107, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !102, line: 53, baseType: !27)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !103, file: !102, line: 61, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !78, line: 48, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !80, line: 129, baseType: !111)
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !86, file: !87, line: 94, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !87, line: 74, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !85, !53}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !86, file: !87, line: 95, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !87, line: 76, baseType: !114)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !86, file: !87, line: 96, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !87, line: 78, baseType: !114)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !86, file: !87, line: 98, baseType: !122, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !87, line: 81, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!27, !85, !53, !107}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !86, file: !87, line: 99, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !87, line: 83, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!27, !85, !131, !133}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !86, file: !87, line: 100, baseType: !135, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !87, line: 85, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!27, !85, !53, !27}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !86, file: !87, line: 101, baseType: !140, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !87, line: 87, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!27, !85, !131, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !86, file: !87, line: 104, baseType: !82, size: 8, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !86, file: !87, line: 105, baseType: !54, size: 1024, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !86, file: !87, line: 106, baseType: !148, size: 128, offset: 1664)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !55, line: 93, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !148, file: !55, line: 93, baseType: !53, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !148, file: !55, line: 93, baseType: !70, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !86, file: !87, line: 107, baseType: !153, size: 192, offset: 1792)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !154, line: 59, size: 192, elements: !155)
!154 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!155 = !{!156, !221, !225}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !153, file: !154, line: 61, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !154, line: 51, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!62, !161, !111, !111}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !163, line: 77, size: 832, elements: !164)
!163 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!164 = !{!165, !172, !177, !182, !188, !190, !195, !196, !197, !202, !207, !212, !213, !214}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !162, file: !163, line: 79, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !163, line: 54, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!62, !161, !170}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 58, baseType: !111)
!171 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !162, file: !163, line: 80, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !163, line: 56, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!62, !161, !170, !170}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !162, file: !163, line: 81, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !163, line: 62, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!62, !161, !62, !170}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !162, file: !163, line: 82, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !163, line: 58, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!27, !161, !187, !170, !170}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !162, file: !163, line: 83, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !163, line: 60, baseType: !174)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !162, file: !163, line: 84, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !163, line: 64, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !161, !62}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !162, file: !163, line: 87, baseType: !191, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !162, file: !163, line: 88, baseType: !166, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !162, file: !163, line: 92, baseType: !198, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !163, line: 66, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!62, !161, !111}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !162, file: !163, line: 93, baseType: !203, size: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !163, line: 68, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !161, !62, !111}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !162, file: !163, line: 99, baseType: !208, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !163, line: 70, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!27, !161, !62, !170}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !162, file: !163, line: 100, baseType: !170, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !163, line: 103, baseType: !161, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !162, file: !163, line: 104, baseType: !215, offset: 832)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, elements: !219)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !73, line: 20, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !75, line: 41, baseType: !218)
!218 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!219 = !{!220}
!220 = !DISubrange(count: -1)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !153, file: !154, line: 63, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !62}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !153, file: !154, line: 65, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !154, line: 56, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !62, !62}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !86, file: !87, line: 108, baseType: !161, size: 64, offset: 1984)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !87, line: 109, baseType: !85, size: 64, offset: 2048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !86, file: !87, line: 110, baseType: !62, size: 64, offset: 2112)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !54, file: !55, line: 70, baseType: !62, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !54, file: !55, line: 72, baseType: !27, size: 32, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !54, file: !55, line: 82, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !238, line: 569, size: 14912, elements: !239)
!238 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!239 = !{!240, !241, !316, !317, !318, !319, !323, !324, !327, !328, !332, !344, !345, !346, !348, !349, !350, !412, !433, !434, !439, !446}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !237, file: !238, line: 571, baseType: !27, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !237, file: !238, line: 576, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !238, line: 287, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !238, line: 181, size: 1408, elements: !245)
!245 = !{!246, !249, !250, !251, !253, !254, !259, !260, !261, !268, !272, !277, !281, !282, !283, !284, !288, !292, !293, !294, !296, !297, !301, !315}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !244, file: !238, line: 182, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !244, file: !238, line: 183, baseType: !27, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !244, file: !238, line: 184, baseType: !27, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !244, file: !238, line: 185, baseType: !252, size: 16, offset: 128)
!252 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !244, file: !238, line: 186, baseType: !252, size: 16, offset: 144)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !244, file: !238, line: 187, baseType: !255, size: 128, offset: 192)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !238, line: 117, size: 128, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !255, file: !238, line: 118, baseType: !247, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !255, file: !238, line: 119, baseType: !27, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !244, file: !238, line: 188, baseType: !27, size: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !244, file: !238, line: 195, baseType: !62, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !244, file: !238, line: 197, baseType: !262, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !236, !62, !267, !27}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !266, line: 145, baseType: !42)
!266 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !244, file: !238, line: 199, baseType: !269, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!265, !236, !62, !58, !27}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !244, file: !238, line: 202, baseType: !273, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !236, !62, !276, !27}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !266, line: 114, baseType: !42)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !244, file: !238, line: 203, baseType: !278, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!27, !236, !62}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !244, file: !238, line: 206, baseType: !255, size: 128, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !244, file: !238, line: 207, baseType: !247, size: 64, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !244, file: !238, line: 208, baseType: !27, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !244, file: !238, line: 211, baseType: !285, size: 24, offset: 928)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 24, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 3)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !244, file: !238, line: 212, baseType: !289, size: 8, offset: 952)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 1)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !244, file: !238, line: 215, baseType: !255, size: 128, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !244, file: !238, line: 218, baseType: !27, size: 32, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !244, file: !238, line: 219, baseType: !295, size: 64, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !266, line: 44, baseType: !42)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !244, file: !238, line: 222, baseType: !236, size: 64, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !244, file: !238, line: 226, baseType: !298, size: 32, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !266, line: 175, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !300, line: 12, baseType: !27)
!300 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !244, file: !238, line: 228, baseType: !302, size: 64, offset: 1312)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !266, line: 171, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 163, size: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !303, file: !266, line: 165, baseType: !27, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !303, file: !266, line: 170, baseType: !307, size: 32, offset: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !266, line: 166, size: 32, elements: !308)
!308 = !{!309, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !307, file: !266, line: 168, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !171, line: 124, baseType: !5)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !307, file: !266, line: 169, baseType: !312, size: 32)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 32, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !244, file: !238, line: 229, baseType: !27, size: 32, offset: 1376)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !237, file: !238, line: 576, baseType: !242, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !237, file: !238, line: 576, baseType: !242, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !237, file: !238, line: 578, baseType: !27, size: 32, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !237, file: !238, line: 579, baseType: !320, size: 200, offset: 288)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 200, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 25)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !237, file: !238, line: 582, baseType: !27, size: 32, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !237, file: !238, line: 583, baseType: !325, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !238, line: 40, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !237, file: !238, line: 585, baseType: !27, size: 32, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !237, file: !238, line: 587, baseType: !329, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !236}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !237, file: !238, line: 590, baseType: !333, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !238, line: 47, size: 256, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !334, file: !238, line: 49, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !334, file: !238, line: 50, baseType: !27, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !334, file: !238, line: 50, baseType: !27, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !334, file: !238, line: 50, baseType: !27, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !334, file: !238, line: 50, baseType: !27, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !334, file: !238, line: 51, baseType: !342, size: 32, offset: 192)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 32, elements: !290)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !238, line: 25, baseType: !5)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !237, file: !238, line: 591, baseType: !27, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !237, file: !238, line: 592, baseType: !333, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !237, file: !238, line: 593, baseType: !347, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !237, file: !238, line: 596, baseType: !27, size: 32, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !237, file: !238, line: 597, baseType: !267, size: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !237, file: !238, line: 632, baseType: !351, size: 2880, offset: 1152)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !238, line: 599, size: 2880, elements: !352)
!352 = !{!353, !403}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !351, file: !238, line: 622, baseType: !354, size: 1728)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !238, line: 601, size: 1728, elements: !355)
!355 = !{!356, !357, !358, !362, !374, !375, !377, !385, !386, !387, !388, !392, !396, !397, !398, !399, !400, !401, !402}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !354, file: !238, line: 603, baseType: !5, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !354, file: !238, line: 604, baseType: !267, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !354, file: !238, line: 605, baseType: !359, size: 208, offset: 128)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 208, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 26)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !354, file: !238, line: 606, baseType: !363, size: 288, offset: 352)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !238, line: 55, size: 288, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !363, file: !238, line: 57, baseType: !27, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !363, file: !238, line: 58, baseType: !27, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !363, file: !238, line: 59, baseType: !27, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !363, file: !238, line: 60, baseType: !27, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !363, file: !238, line: 61, baseType: !27, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !363, file: !238, line: 62, baseType: !27, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !363, file: !238, line: 63, baseType: !27, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !363, file: !238, line: 64, baseType: !27, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !363, file: !238, line: 65, baseType: !27, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !354, file: !238, line: 607, baseType: !27, size: 32, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !354, file: !238, line: 608, baseType: !376, size: 64, offset: 704)
!376 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !354, file: !238, line: 609, baseType: !378, size: 112, offset: 768)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !238, line: 319, size: 112, elements: !379)
!379 = !{!380, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !378, file: !238, line: 320, baseType: !381, size: 48)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 48, elements: !286)
!382 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !378, file: !238, line: 321, baseType: !381, size: 48, offset: 48)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !378, file: !238, line: 322, baseType: !382, size: 16, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !354, file: !238, line: 610, baseType: !302, size: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !354, file: !238, line: 611, baseType: !302, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !354, file: !238, line: 612, baseType: !302, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !354, file: !238, line: 613, baseType: !389, size: 64, offset: 1088)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !354, file: !238, line: 614, baseType: !393, size: 192, offset: 1152)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 192, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 24)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !354, file: !238, line: 615, baseType: !27, size: 32, offset: 1344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !354, file: !238, line: 616, baseType: !302, size: 64, offset: 1376)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !354, file: !238, line: 617, baseType: !302, size: 64, offset: 1440)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !354, file: !238, line: 618, baseType: !302, size: 64, offset: 1504)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !354, file: !238, line: 619, baseType: !302, size: 64, offset: 1568)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !354, file: !238, line: 620, baseType: !302, size: 64, offset: 1632)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !354, file: !238, line: 621, baseType: !27, size: 32, offset: 1696)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !351, file: !238, line: 631, baseType: !404, size: 2880)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !238, line: 626, size: 2880, elements: !405)
!405 = !{!406, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !404, file: !238, line: 629, baseType: !407, size: 1920)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 1920, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 30)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !404, file: !238, line: 630, baseType: !411, size: 960, offset: 1920)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !237, file: !238, line: 636, baseType: !413, size: 64, offset: 4032)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !238, line: 93, size: 6336, elements: !415)
!415 = !{!416, !417, !418, !425}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !414, file: !238, line: 94, baseType: !413, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !414, file: !238, line: 95, baseType: !27, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !414, file: !238, line: 97, baseType: !419, size: 2048, offset: 128)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 2048, elements: !423)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null}
!423 = !{!424}
!424 = !DISubrange(count: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !414, file: !238, line: 98, baseType: !426, size: 4160, offset: 2176)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !238, line: 74, size: 4160, elements: !427)
!427 = !{!428, !430, !431, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !426, file: !238, line: 75, baseType: !429, size: 2048)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, elements: !423)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !426, file: !238, line: 76, baseType: !429, size: 2048, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !426, file: !238, line: 78, baseType: !343, size: 32, offset: 4096)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !426, file: !238, line: 81, baseType: !343, size: 32, offset: 4128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !237, file: !238, line: 637, baseType: !414, size: 6336, offset: 4096)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !237, file: !238, line: 641, baseType: !435, size: 64, offset: 10432)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !27}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !237, file: !238, line: 646, baseType: !440, size: 192, offset: 10496)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !238, line: 291, size: 192, elements: !441)
!441 = !{!442, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !440, file: !238, line: 293, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !440, file: !238, line: 294, baseType: !27, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !440, file: !238, line: 295, baseType: !242, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !237, file: !238, line: 648, baseType: !447, size: 4224, offset: 10688)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 4224, elements: !286)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !54, file: !55, line: 85, baseType: !449, size: 64, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !451)
!451 = !{!452, !456, !457, !464, !477}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !450, file: !4, line: 116, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !454, line: 64, baseType: !455)
!454 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !454, line: 63, baseType: !111)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !450, file: !4, line: 118, baseType: !453, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !450, file: !4, line: 120, baseType: !458, size: 128, offset: 128)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !459, line: 51, size: 128, elements: !460)
!459 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!460 = !{!461, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !458, file: !459, line: 52, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !458, file: !459, line: 53, baseType: !462, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !450, file: !4, line: 122, baseType: !465, size: 256, offset: 256)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !465, file: !4, line: 107, baseType: !3, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !465, file: !4, line: 109, baseType: !453, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !465, file: !4, line: 111, baseType: !470, size: 96, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !454, line: 72, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 68, size: 96, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !471, file: !454, line: 69, baseType: !27, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !471, file: !454, line: 70, baseType: !27, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !471, file: !454, line: 71, baseType: !476, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !454, line: 61, baseType: !27)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !450, file: !4, line: 124, baseType: !458, size: 128, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !49, file: !45, line: 38, baseType: !479, size: 64, offset: 128)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !49, file: !45, line: 38, size: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !479, file: !45, line: 38, baseType: !48, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !44, file: !45, line: 42, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !32, file: !24, line: 149, baseType: !27, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !32, file: !24, line: 156, baseType: !27, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !32, file: !24, line: 159, baseType: !27, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !32, file: !24, line: 160, baseType: !488, size: 128, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !30, line: 413, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !30, line: 411, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 395, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !490, file: !30, line: 398, baseType: !62, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !490, file: !30, line: 399, baseType: !5, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !23, file: !24, line: 140, baseType: !35, size: 64, offset: 128)
!495 = !{i32 2, !"Dwarf Version", i32 4}
!496 = !{i32 2, !"Debug Info Version", i32 3}
!497 = !{i32 1, !"wchar_size", i32 4}
!498 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!499 = distinct !DISubprogram(name: "sem_init", scope: !1, file: !1, line: 51, type: !500, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !503)
!500 = !DISubroutineType(types: !501)
!501 = !{!27, !502, !27, !5}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!503 = !{!504, !505, !506, !507, !508, !509}
!504 = !DILocalVariable(name: "sem", arg: 1, scope: !499, file: !1, line: 51, type: !502)
!505 = !DILocalVariable(name: "pshared", arg: 2, scope: !499, file: !1, line: 51, type: !27)
!506 = !DILocalVariable(name: "value", arg: 3, scope: !499, file: !1, line: 51, type: !5)
!507 = !DILocalVariable(name: "result", scope: !499, file: !1, line: 89, type: !27)
!508 = !DILocalVariable(name: "s", scope: !499, file: !1, line: 90, type: !20)
!509 = !DILocalVariable(name: "osResult", scope: !510, file: !1, line: 120, type: !517)
!510 = distinct !DILexicalBlock(scope: !511, file: !1, line: 118, column: 13)
!511 = distinct !DILexicalBlock(scope: !512, file: !1, line: 117, column: 15)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 114, column: 9)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 109, column: 11)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 106, column: 5)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 101, column: 12)
!516 = distinct !DILexicalBlock(scope: !499, file: !1, line: 93, column: 7)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osResult", file: !11, line: 60, baseType: !10)
!518 = !DILocation(line: 51, column: 19, scope: !499)
!519 = !DILocation(line: 51, column: 28, scope: !499)
!520 = !DILocation(line: 51, column: 50, scope: !499)
!521 = !DILocation(line: 89, column: 7, scope: !499)
!522 = !DILocation(line: 90, column: 9, scope: !499)
!523 = !DILocation(line: 93, column: 15, scope: !516)
!524 = !DILocation(line: 93, column: 7, scope: !499)
!525 = !DILocation(line: 101, column: 18, scope: !515)
!526 = !DILocation(line: 101, column: 12, scope: !516)
!527 = !DILocation(line: 107, column: 19, scope: !514)
!528 = !DILocation(line: 109, column: 16, scope: !513)
!529 = !DILocation(line: 109, column: 11, scope: !514)
!530 = !DILocation(line: 116, column: 14, scope: !512)
!531 = !DILocation(line: 116, column: 20, scope: !512)
!532 = !{!533, !534, i64 0}
!533 = !{!"sem_t_", !534, i64 0, !537, i64 8, !537, i64 16}
!534 = !{!"int", !535, i64 0}
!535 = !{!"omnipotent char", !536, i64 0}
!536 = !{!"Simple C/C++ TBAA"}
!537 = !{!"any pointer", !535, i64 0}
!538 = !DILocation(line: 117, column: 38, scope: !511)
!539 = !DILocation(line: 117, column: 15, scope: !511)
!540 = !DILocation(line: 117, column: 50, scope: !511)
!541 = !DILocation(line: 117, column: 15, scope: !512)
!542 = !DILocation(line: 120, column: 68, scope: !510)
!543 = !DILocation(line: 120, column: 39, scope: !510)
!544 = !DILocation(line: 120, column: 28, scope: !510)
!545 = !DILocation(line: 124, column: 28, scope: !546)
!546 = distinct !DILexicalBlock(scope: !510, file: !1, line: 124, column: 19)
!547 = !DILocation(line: 124, column: 19, scope: !510)
!548 = !DILocation(line: 126, column: 26, scope: !549)
!549 = distinct !DILexicalBlock(scope: !546, file: !1, line: 125, column: 17)
!550 = !DILocation(line: 128, column: 17, scope: !549)
!551 = !DILocation(line: 138, column: 15, scope: !552)
!552 = distinct !DILexicalBlock(scope: !553, file: !1, line: 137, column: 13)
!553 = distinct !DILexicalBlock(scope: !512, file: !1, line: 136, column: 15)
!554 = !DILocation(line: 139, column: 13, scope: !552)
!555 = !DILocation(line: 145, column: 7, scope: !556)
