; ModuleID = '/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_close.c'
source_filename = "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_close.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sem_t_ = type { i32, %struct.pthread_mutex_t_*, %struct.uk_semaphore* }
%struct.pthread_mutex_t_ = type { %struct.uk_semaphore*, i32, i32, i32, %struct.pte_handle_t }
%struct.pte_handle_t = type { i8*, i32 }
%struct.uk_semaphore = type { i64, %struct.uk_waitq }
%struct.uk_waitq = type { %struct.uk_waitq_entry*, %struct.uk_waitq_entry** }
%struct.uk_waitq_entry = type { i32, %struct.uk_thread*, %struct.anon }
%struct.uk_thread = type { i8*, i8*, i8*, i8*, %struct.anon.0, i32, i64, i8, %struct.uk_waitq, %struct.uk_sched*, i8*, i32, %struct._reent*, %struct.uk_thread_sig* }
%struct.anon.0 = type { %struct.uk_thread*, %struct.uk_thread** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/sem_close.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uk_sig_waiting", file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksignal/include/uk/uk_signal.h", directory: "/root/.unikraft/apps/redis/build")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "UK_SIG_NOT_WAITING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "UK_SIG_WAITING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "UK_SIG_WAITING_SCHED", value: 2, isUnsigned: true)
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{i32 1, !"wchar_size", i32 4}
!13 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!14 = distinct !DISubprogram(name: "sem_close", scope: !1, file: !1, line: 56, type: !15, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !493)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !20, line: 78, baseType: !21)
!20 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_t_", file: !23, line: 136, size: 192, elements: !24)
!23 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/implement.h", directory: "/root/.unikraft/apps/redis/build")
!24 = !{!25, !26, !492}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !22, file: !23, line: 138, baseType: !17, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !22, file: !23, line: 139, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !28, line: 417, baseType: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libpthread-embedded/origin/pthread-embedded-44b41d760a433915d70a7be9809651b0a65e001d/pthread.h", directory: "/root/.unikraft/apps/redis/build")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t_", file: !23, line: 146, size: 320, elements: !31)
!31 = !{!32, !482, !483, !484, !485}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !30, file: !23, line: 148, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_osSemaphoreHandle", file: !34, line: 12, baseType: !35)
!34 = !DIFile(filename: "/root/.unikraft/libs/pthread-embedded/include/pte_osal.h", directory: "/root/.unikraft/apps/redis/build")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_semaphore", file: !37, line: 51, size: 192, elements: !38)
!37 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uklock/include/uk/semaphore.h", directory: "/root/.unikraft/apps/redis/build")
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !36, file: !37, line: 52, baseType: !40, size: 64)
!40 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !36, file: !37, line: 53, baseType: !42, size: 128, offset: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq", file: !43, line: 42, size: 128, elements: !44)
!43 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/wait_types.h", directory: "/root/.unikraft/apps/redis/build")
!44 = !{!45, !480}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !42, file: !43, line: 42, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_waitq_entry", file: !43, line: 35, size: 192, elements: !48)
!48 = !{!49, !50, !476}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !47, file: !43, line: 36, baseType: !17, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !47, file: !43, line: 37, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread", file: !53, line: 59, size: 1024, elements: !54)
!53 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread.h", directory: "/root/.unikraft/apps/redis/build")
!54 = !{!55, !59, !61, !62, !63, !69, !74, !79, !81, !82, !231, !232, !233, !446}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !53, line: 60, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !52, file: !53, line: 61, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !52, file: !53, line: 62, baseType: !60, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !52, file: !53, line: 63, baseType: !60, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !52, file: !53, line: 64, baseType: !64, size: 128, offset: 256)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !53, line: 64, size: 128, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !64, file: !53, line: 64, baseType: !51, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !64, file: !53, line: 64, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !53, line: 65, baseType: !70, size: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !71, line: 48, baseType: !72)
!71 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !73, line: 79, baseType: !5)
!73 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_time", scope: !52, file: !53, line: 66, baseType: !75, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__snsec", file: !76, line: 49, baseType: !77)
!76 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/time.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !78, line: 128, baseType: !40)
!78 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!79 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !52, file: !53, line: 67, baseType: !80, size: 8, offset: 512)
!80 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_threads", scope: !52, file: !53, line: 68, baseType: !42, size: 128, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !52, file: !53, line: 69, baseType: !83, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_sched", file: !85, line: 90, size: 2176, elements: !86)
!85 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/sched.h", directory: "/root/.unikraft/apps/redis/build")
!86 = !{!87, !92, !110, !115, !117, !119, !124, !132, !137, !143, !144, !145, !150, !228, !229, !230}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !84, file: !85, line: 91, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_yield_func_t", file: !85, line: 68, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !83}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "thread_add", scope: !84, file: !85, line: 93, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_add_func_t", file: !85, line: 71, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!17, !83, !51, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_thread_attr_t", file: !100, line: 62, baseType: !101)
!100 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uksched/include/uk/thread_attr.h", directory: "/root/.unikraft/apps/redis/build")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_attr", file: !100, line: 55, size: 128, elements: !102)
!102 = !{!103, !104, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !101, file: !100, line: 57, baseType: !80, size: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !101, file: !100, line: 59, baseType: !105, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "prio_t", file: !100, line: 53, baseType: !17)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !101, file: !100, line: 61, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nsec", file: !76, line: 48, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !78, line: 129, baseType: !109)
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "thread_remove", scope: !84, file: !85, line: 94, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_remove_func_t", file: !85, line: 74, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !83, !51}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "thread_blocked", scope: !84, file: !85, line: 95, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_blocked_func_t", file: !85, line: 76, baseType: !112)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "thread_woken", scope: !84, file: !85, line: 96, baseType: !118, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_woken_func_t", file: !85, line: 78, baseType: !112)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_prio", scope: !84, file: !85, line: 98, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_prio_func_t", file: !85, line: 81, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!17, !83, !51, !105}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_prio", scope: !84, file: !85, line: 99, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_prio_func_t", file: !85, line: 83, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!17, !83, !129, !131}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "thread_set_tslice", scope: !84, file: !85, line: 100, baseType: !133, size: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_set_tslice_func_t", file: !85, line: 85, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!17, !83, !51, !17}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thread_get_tslice", scope: !84, file: !85, line: 101, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_sched_thread_get_tslice_func_t", file: !85, line: 87, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!17, !83, !129, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "threads_started", scope: !84, file: !85, line: 104, baseType: !80, size: 8, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !84, file: !85, line: 105, baseType: !52, size: 1024, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "exited_threads", scope: !84, file: !85, line: 106, baseType: !146, size: 128, offset: 1664)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_list", file: !53, line: 93, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !146, file: !53, line: 93, baseType: !51, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !146, file: !53, line: 93, baseType: !68, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "plat_ctx_cbs", scope: !84, file: !85, line: 107, baseType: !151, size: 192, offset: 1792)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ukplat_ctx_callbacks", file: !152, line: 59, size: 192, elements: !153)
!152 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/plat/thread.h", directory: "/root/.unikraft/apps/redis/build")
!153 = !{!154, !219, !223}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "create_cb", scope: !151, file: !152, line: 61, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_create_func_t", file: !152, line: 51, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!60, !159, !109, !109}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_alloc", file: !161, line: 77, size: 832, elements: !162)
!161 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukalloc/include/uk/alloc.h", directory: "/root/.unikraft/apps/redis/build")
!162 = !{!163, !170, !175, !180, !186, !188, !193, !194, !195, !200, !205, !210, !211, !212}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !160, file: !161, line: 79, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_malloc_func_t", file: !161, line: 54, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!60, !159, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !169, line: 58, baseType: !109)
!169 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !160, file: !161, line: 80, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_calloc_func_t", file: !161, line: 56, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!60, !159, !168, !168}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !160, file: !161, line: 81, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_realloc_func_t", file: !161, line: 62, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!60, !159, !60, !168}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "posix_memalign", scope: !160, file: !161, line: 82, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_posix_memalign_func_t", file: !161, line: 58, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!17, !159, !185, !168, !168}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "memalign", scope: !160, file: !161, line: 83, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_memalign_func_t", file: !161, line: 60, baseType: !172)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !160, file: !161, line: 84, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_free_func_t", file: !161, line: 64, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !159, !60}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "free_backend", scope: !160, file: !161, line: 87, baseType: !189, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_backend", scope: !160, file: !161, line: 88, baseType: !164, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "palloc", scope: !160, file: !161, line: 92, baseType: !196, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_palloc_func_t", file: !161, line: 66, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!60, !159, !109}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !160, file: !161, line: 93, baseType: !201, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_pfree_func_t", file: !161, line: 68, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !159, !60, !109}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "addmem", scope: !160, file: !161, line: 99, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uk_alloc_addmem_func_t", file: !161, line: 70, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!17, !159, !60, !168}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !161, line: 100, baseType: !168, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !161, line: 103, baseType: !159, size: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !160, file: !161, line: 104, baseType: !213, offset: 832)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, elements: !217)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !71, line: 20, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !73, line: 41, baseType: !216)
!216 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!217 = !{!218}
!218 = !DISubrange(count: -1)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "start_cb", scope: !151, file: !152, line: 63, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !60}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "switch_cb", scope: !151, file: !152, line: 65, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ukplat_ctx_switch_func_t", file: !152, line: 56, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !60, !60}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !84, file: !85, line: 108, baseType: !159, size: 64, offset: 1984)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !85, line: 109, baseType: !83, size: 64, offset: 2048)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !84, file: !85, line: 110, baseType: !60, size: 64, offset: 2112)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !52, file: !53, line: 70, baseType: !60, size: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !52, file: !53, line: 72, baseType: !17, size: 32, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reent", scope: !52, file: !53, line: 82, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !236, line: 569, size: 14912, elements: !237)
!236 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!237 = !{!238, !239, !314, !315, !316, !317, !321, !322, !325, !326, !330, !342, !343, !344, !346, !347, !348, !410, !431, !432, !437, !444}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !235, file: !236, line: 571, baseType: !17, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !235, file: !236, line: 576, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !236, line: 287, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !236, line: 181, size: 1408, elements: !243)
!243 = !{!244, !247, !248, !249, !251, !252, !257, !258, !259, !266, !270, !275, !279, !280, !281, !282, !286, !290, !291, !292, !294, !295, !299, !313}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !242, file: !236, line: 182, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !242, file: !236, line: 183, baseType: !17, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !242, file: !236, line: 184, baseType: !17, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !242, file: !236, line: 185, baseType: !250, size: 16, offset: 128)
!250 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !242, file: !236, line: 186, baseType: !250, size: 16, offset: 144)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !242, file: !236, line: 187, baseType: !253, size: 128, offset: 192)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !236, line: 117, size: 128, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !253, file: !236, line: 118, baseType: !245, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !253, file: !236, line: 119, baseType: !17, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !242, file: !236, line: 188, baseType: !17, size: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !242, file: !236, line: 195, baseType: !60, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !242, file: !236, line: 197, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !234, !60, !265, !17}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !264, line: 145, baseType: !40)
!264 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !242, file: !236, line: 199, baseType: !267, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!263, !234, !60, !56, !17}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !242, file: !236, line: 202, baseType: !271, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !234, !60, !274, !17}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !264, line: 114, baseType: !40)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !242, file: !236, line: 203, baseType: !276, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!17, !234, !60}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !242, file: !236, line: 206, baseType: !253, size: 128, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !242, file: !236, line: 207, baseType: !245, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !242, file: !236, line: 208, baseType: !17, size: 32, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !242, file: !236, line: 211, baseType: !283, size: 24, offset: 928)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 24, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 3)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !242, file: !236, line: 212, baseType: !287, size: 8, offset: 952)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 1)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !242, file: !236, line: 215, baseType: !253, size: 128, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !242, file: !236, line: 218, baseType: !17, size: 32, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !242, file: !236, line: 219, baseType: !293, size: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !264, line: 44, baseType: !40)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !242, file: !236, line: 222, baseType: !234, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !242, file: !236, line: 226, baseType: !296, size: 32, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !264, line: 175, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !298, line: 12, baseType: !17)
!298 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !242, file: !236, line: 228, baseType: !300, size: 64, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !264, line: 171, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 163, size: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !301, file: !264, line: 165, baseType: !17, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !301, file: !264, line: 170, baseType: !305, size: 32, offset: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !264, line: 166, size: 32, elements: !306)
!306 = !{!307, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !305, file: !264, line: 168, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !169, line: 124, baseType: !5)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !305, file: !264, line: 169, baseType: !310, size: 32)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 32, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 4)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !242, file: !236, line: 229, baseType: !17, size: 32, offset: 1376)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !235, file: !236, line: 576, baseType: !240, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !235, file: !236, line: 576, baseType: !240, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !235, file: !236, line: 578, baseType: !17, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !235, file: !236, line: 579, baseType: !318, size: 200, offset: 288)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 200, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 25)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !235, file: !236, line: 582, baseType: !17, size: 32, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !235, file: !236, line: 583, baseType: !323, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !236, line: 40, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !235, file: !236, line: 585, baseType: !17, size: 32, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !235, file: !236, line: 587, baseType: !327, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !234}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !235, file: !236, line: 590, baseType: !331, size: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !236, line: 47, size: 256, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !332, file: !236, line: 49, baseType: !331, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !332, file: !236, line: 50, baseType: !17, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !332, file: !236, line: 50, baseType: !17, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !332, file: !236, line: 50, baseType: !17, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !332, file: !236, line: 50, baseType: !17, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !332, file: !236, line: 51, baseType: !340, size: 32, offset: 192)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 32, elements: !288)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !236, line: 25, baseType: !5)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !235, file: !236, line: 591, baseType: !17, size: 32, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !235, file: !236, line: 592, baseType: !331, size: 64, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !235, file: !236, line: 593, baseType: !345, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !235, file: !236, line: 596, baseType: !17, size: 32, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !235, file: !236, line: 597, baseType: !265, size: 64, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !235, file: !236, line: 632, baseType: !349, size: 2880, offset: 1152)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !236, line: 599, size: 2880, elements: !350)
!350 = !{!351, !401}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !349, file: !236, line: 622, baseType: !352, size: 1728)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !236, line: 601, size: 1728, elements: !353)
!353 = !{!354, !355, !356, !360, !372, !373, !375, !383, !384, !385, !386, !390, !394, !395, !396, !397, !398, !399, !400}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !352, file: !236, line: 603, baseType: !5, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !352, file: !236, line: 604, baseType: !265, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !352, file: !236, line: 605, baseType: !357, size: 208, offset: 128)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 208, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 26)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !352, file: !236, line: 606, baseType: !361, size: 288, offset: 352)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !236, line: 55, size: 288, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !361, file: !236, line: 57, baseType: !17, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !361, file: !236, line: 58, baseType: !17, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !361, file: !236, line: 59, baseType: !17, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !361, file: !236, line: 60, baseType: !17, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !361, file: !236, line: 61, baseType: !17, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !361, file: !236, line: 62, baseType: !17, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !361, file: !236, line: 63, baseType: !17, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !361, file: !236, line: 64, baseType: !17, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !361, file: !236, line: 65, baseType: !17, size: 32, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !352, file: !236, line: 607, baseType: !17, size: 32, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !352, file: !236, line: 608, baseType: !374, size: 64, offset: 704)
!374 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !352, file: !236, line: 609, baseType: !376, size: 112, offset: 768)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !236, line: 319, size: 112, elements: !377)
!377 = !{!378, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !376, file: !236, line: 320, baseType: !379, size: 48)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 48, elements: !284)
!380 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !376, file: !236, line: 321, baseType: !379, size: 48, offset: 48)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !376, file: !236, line: 322, baseType: !380, size: 16, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !352, file: !236, line: 610, baseType: !300, size: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !352, file: !236, line: 611, baseType: !300, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !352, file: !236, line: 612, baseType: !300, size: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !352, file: !236, line: 613, baseType: !387, size: 64, offset: 1088)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 8)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !352, file: !236, line: 614, baseType: !391, size: 192, offset: 1152)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 24)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !352, file: !236, line: 615, baseType: !17, size: 32, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !352, file: !236, line: 616, baseType: !300, size: 64, offset: 1376)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !352, file: !236, line: 617, baseType: !300, size: 64, offset: 1440)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !352, file: !236, line: 618, baseType: !300, size: 64, offset: 1504)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !352, file: !236, line: 619, baseType: !300, size: 64, offset: 1568)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !352, file: !236, line: 620, baseType: !300, size: 64, offset: 1632)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !352, file: !236, line: 621, baseType: !17, size: 32, offset: 1696)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !349, file: !236, line: 631, baseType: !402, size: 2880)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !236, line: 626, size: 2880, elements: !403)
!403 = !{!404, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !402, file: !236, line: 629, baseType: !405, size: 1920)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 1920, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 30)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !402, file: !236, line: 630, baseType: !409, size: 960, offset: 1920)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 960, elements: !406)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !235, file: !236, line: 636, baseType: !411, size: 64, offset: 4032)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !236, line: 93, size: 6336, elements: !413)
!413 = !{!414, !415, !416, !423}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !412, file: !236, line: 94, baseType: !411, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !412, file: !236, line: 95, baseType: !17, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !412, file: !236, line: 97, baseType: !417, size: 2048, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 2048, elements: !421)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null}
!421 = !{!422}
!422 = !DISubrange(count: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !412, file: !236, line: 98, baseType: !424, size: 4160, offset: 2176)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !236, line: 74, size: 4160, elements: !425)
!425 = !{!426, !428, !429, !430}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !424, file: !236, line: 75, baseType: !427, size: 2048)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !421)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !424, file: !236, line: 76, baseType: !427, size: 2048, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !424, file: !236, line: 78, baseType: !341, size: 32, offset: 4096)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !424, file: !236, line: 81, baseType: !341, size: 32, offset: 4128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !235, file: !236, line: 637, baseType: !412, size: 6336, offset: 4096)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !235, file: !236, line: 641, baseType: !433, size: 64, offset: 10432)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !17}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !235, file: !236, line: 646, baseType: !438, size: 192, offset: 10496)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !236, line: 291, size: 192, elements: !439)
!439 = !{!440, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !438, file: !236, line: 293, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !438, file: !236, line: 294, baseType: !17, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !438, file: !236, line: 295, baseType: !240, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !235, file: !236, line: 648, baseType: !445, size: 4224, offset: 10688)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 4224, elements: !284)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "signals_container", scope: !52, file: !53, line: 85, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig", file: !4, line: 114, size: 640, elements: !449)
!449 = !{!450, !454, !455, !462, !475}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !448, file: !4, line: 116, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !452, line: 64, baseType: !453)
!452 = !DIFile(filename: "/root/.unikraft/libs/newlib/musl-imported/include/signal.h", directory: "/root/.unikraft/apps/redis/build")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !452, line: 63, baseType: !109)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !448, file: !4, line: 118, baseType: !451, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pending_signals", scope: !448, file: !4, line: 120, baseType: !456, size: 128, offset: 128)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_list_head", file: !457, line: 51, size: 128, elements: !458)
!457 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/list.h", directory: "/root/.unikraft/apps/redis/build")
!458 = !{!459, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !457, line: 52, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !457, line: 53, baseType: !460, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !448, file: !4, line: 122, baseType: !463, size: 256, offset: 256)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uk_thread_sig_wait", file: !4, line: 98, size: 256, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !463, file: !4, line: 107, baseType: !3, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "awaited", scope: !463, file: !4, line: 109, baseType: !451, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "received_signal", scope: !463, file: !4, line: 111, baseType: !468, size: 96, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !452, line: 72, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 68, size: 96, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !469, file: !452, line: 69, baseType: !17, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !469, file: !452, line: 70, baseType: !17, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !469, file: !452, line: 71, baseType: !474, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !452, line: 61, baseType: !17)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !448, file: !4, line: 124, baseType: !456, size: 128, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_list", scope: !47, file: !43, line: 38, baseType: !477, size: 64, offset: 128)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !47, file: !43, line: 38, size: 64, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !477, file: !43, line: 38, baseType: !46, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !42, file: !43, line: 42, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lock_idx", scope: !30, file: !23, line: 149, baseType: !17, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "recursive_count", scope: !30, file: !23, line: 156, baseType: !17, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !30, file: !23, line: 159, baseType: !17, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ownerThread", scope: !30, file: !23, line: 160, baseType: !486, size: 128, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !28, line: 413, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pte_handle_t", file: !28, line: 411, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 395, size: 128, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !488, file: !28, line: 398, baseType: !60, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !488, file: !28, line: 399, baseType: !5, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !22, file: !23, line: 140, baseType: !33, size: 64, offset: 128)
!493 = !{!494}
!494 = !DILocalVariable(name: "sem", arg: 1, scope: !14, file: !1, line: 56, type: !18)
!495 = !DILocation(line: 56, column: 20, scope: !14)
!496 = !DILocation(line: 58, column: 3, scope: !14)
!497 = !DILocation(line: 58, column: 9, scope: !14)
!498 = !{!499, !499, i64 0}
!499 = !{!"int", !500, i64 0}
!500 = !{!"omnipotent char", !501, i64 0}
!501 = !{!"Simple C/C++ TBAA"}
!502 = !DILocation(line: 59, column: 3, scope: !14)
