; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/strbuf.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/strbuf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.strbuf_t = type { i8*, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/strbuf.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!9 = distinct !DISubprogram(name: "strbuf_init", scope: !1, file: !1, line: 44, type: !10, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !27)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12, !21}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !14, line: 42, baseType: !15)
!14 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/deps/lua/src/strbuf.h", directory: "/root/.unikraft/apps/redis/build")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 34, size: 256, elements: !16)
!16 = !{!17, !20, !22, !23, !24, !25, !26}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !14, line: 35, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !15, file: !14, line: 36, baseType: !21, size: 32, offset: 64)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !15, file: !14, line: 37, baseType: !21, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "increment", scope: !15, file: !14, line: 38, baseType: !21, size: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !15, file: !14, line: 39, baseType: !21, size: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !15, file: !14, line: 40, baseType: !21, size: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !15, file: !14, line: 41, baseType: !21, size: 32, offset: 224)
!27 = !{!28, !29, !30}
!28 = !DILocalVariable(name: "s", arg: 1, scope: !9, file: !1, line: 44, type: !12)
!29 = !DILocalVariable(name: "len", arg: 2, scope: !9, file: !1, line: 44, type: !21)
!30 = !DILocalVariable(name: "size", scope: !9, file: !1, line: 46, type: !21)
!31 = !DILocation(line: 44, column: 28, scope: !9)
!32 = !DILocation(line: 44, column: 35, scope: !9)
!33 = !DILocation(line: 48, column: 13, scope: !34)
!34 = distinct !DILexicalBlock(scope: !9, file: !1, line: 48, column: 9)
!35 = !DILocation(line: 51, column: 20, scope: !34)
!36 = !DILocation(line: 46, column: 9, scope: !9)
!37 = !DILocation(line: 48, column: 9, scope: !9)
!38 = !DILocation(line: 53, column: 8, scope: !9)
!39 = !DILocation(line: 53, column: 12, scope: !9)
!40 = !{!41, !42, i64 0}
!41 = !{!"", !42, i64 0, !45, i64 8, !45, i64 12, !45, i64 16, !45, i64 20, !45, i64 24, !45, i64 28}
!42 = !{!"any pointer", !43, i64 0}
!43 = !{!"omnipotent char", !44, i64 0}
!44 = !{!"Simple C/C++ TBAA"}
!45 = !{!"int", !43, i64 0}
!46 = !DILocation(line: 54, column: 8, scope: !9)
!47 = !DILocation(line: 54, column: 13, scope: !9)
!48 = !{!41, !45, i64 8}
!49 = !DILocation(line: 55, column: 8, scope: !9)
!50 = !DILocation(line: 55, column: 15, scope: !9)
!51 = !{!45, !45, i64 0}
!52 = !DILocation(line: 59, column: 8, scope: !9)
!53 = !DILocation(line: 59, column: 14, scope: !9)
!54 = !{!41, !45, i64 28}
!55 = !DILocation(line: 61, column: 21, scope: !9)
!56 = !DILocation(line: 61, column: 14, scope: !9)
!57 = !DILocation(line: 61, column: 12, scope: !9)
!58 = !DILocation(line: 62, column: 10, scope: !59)
!59 = distinct !DILexicalBlock(scope: !9, file: !1, line: 62, column: 9)
!60 = !DILocation(line: 62, column: 9, scope: !9)
!61 = !DILocation(line: 63, column: 9, scope: !59)
!62 = !DILocalVariable(name: "s", arg: 1, scope: !63, file: !14, line: 140, type: !12)
!63 = distinct !DISubprogram(name: "strbuf_ensure_null", scope: !14, file: !14, line: 140, type: !64, isLocal: true, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !12}
!66 = !{!62}
!67 = !DILocation(line: 140, column: 49, scope: !63, inlinedAt: !68)
!68 = distinct !DILocation(line: 65, column: 5, scope: !9)
!69 = !DILocation(line: 142, column: 15, scope: !63, inlinedAt: !68)
!70 = !{!41, !45, i64 12}
!71 = !DILocation(line: 142, column: 5, scope: !63, inlinedAt: !68)
!72 = !DILocation(line: 142, column: 23, scope: !63, inlinedAt: !68)
!73 = !{!43, !43, i64 0}
!74 = !DILocation(line: 66, column: 1, scope: !9)
!75 = distinct !DISubprogram(name: "die", scope: !1, file: !1, line: 32, type: !76, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !80)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78, null}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!80 = !{!81, !82}
!81 = !DILocalVariable(name: "fmt", arg: 1, scope: !75, file: !1, line: 32, type: !78)
!82 = !DILocalVariable(name: "arg", scope: !75, file: !1, line: 34, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !84, line: 46, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !86, line: 51, baseType: !87)
!86 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 204, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 192, elements: !97)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 204, size: 192, elements: !90)
!90 = !{!91, !93, !94, !96}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !89, file: !1, line: 204, baseType: !92, size: 32)
!92 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !89, file: !1, line: 204, baseType: !92, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !89, file: !1, line: 204, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !89, file: !1, line: 204, baseType: !95, size: 64, offset: 128)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DILocation(line: 32, column: 29, scope: !75)
!100 = !DILocation(line: 34, column: 5, scope: !75)
!101 = !DILocation(line: 34, column: 13, scope: !75)
!102 = !DILocation(line: 36, column: 5, scope: !75)
!103 = !DILocation(line: 37, column: 14, scope: !75)
!104 = !{!105, !42, i64 24}
!105 = !{!"_reent", !45, i64 0, !42, i64 8, !42, i64 16, !42, i64 24, !45, i64 32, !43, i64 36, !45, i64 64, !42, i64 72, !45, i64 80, !42, i64 88, !42, i64 96, !45, i64 104, !42, i64 112, !42, i64 120, !45, i64 128, !42, i64 136, !43, i64 144, !42, i64 504, !106, i64 512, !42, i64 1304, !108, i64 1312, !43, i64 1336}
!106 = !{!"_atexit", !42, i64 0, !45, i64 8, !43, i64 16, !107, i64 272}
!107 = !{!"_on_exit_args", !43, i64 0, !43, i64 256, !45, i64 512, !45, i64 516}
!108 = !{!"_glue", !42, i64 0, !45, i64 8, !42, i64 16}
!109 = !DILocation(line: 37, column: 5, scope: !75)
!110 = !DILocation(line: 38, column: 5, scope: !75)
!111 = !DILocation(line: 39, column: 13, scope: !75)
!112 = !DILocation(line: 39, column: 5, scope: !75)
!113 = !DILocation(line: 41, column: 5, scope: !75)
!114 = distinct !DISubprogram(name: "strbuf_new", scope: !1, file: !1, line: 68, type: !115, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!12, !21}
!117 = !{!118, !119}
!118 = !DILocalVariable(name: "len", arg: 1, scope: !114, file: !1, line: 68, type: !21)
!119 = !DILocalVariable(name: "s", scope: !114, file: !1, line: 70, type: !12)
!120 = !DILocation(line: 68, column: 26, scope: !114)
!121 = !DILocation(line: 72, column: 9, scope: !114)
!122 = !DILocation(line: 70, column: 15, scope: !114)
!123 = !DILocation(line: 73, column: 10, scope: !124)
!124 = distinct !DILexicalBlock(scope: !114, file: !1, line: 73, column: 9)
!125 = !DILocation(line: 73, column: 9, scope: !114)
!126 = !DILocation(line: 74, column: 9, scope: !124)
!127 = !DILocation(line: 44, column: 28, scope: !9, inlinedAt: !128)
!128 = distinct !DILocation(line: 76, column: 5, scope: !114)
!129 = !DILocation(line: 44, column: 35, scope: !9, inlinedAt: !128)
!130 = !DILocation(line: 48, column: 13, scope: !34, inlinedAt: !128)
!131 = !DILocation(line: 51, column: 20, scope: !34, inlinedAt: !128)
!132 = !DILocation(line: 46, column: 9, scope: !9, inlinedAt: !128)
!133 = !DILocation(line: 48, column: 9, scope: !9, inlinedAt: !128)
!134 = !DILocation(line: 53, column: 8, scope: !9, inlinedAt: !128)
!135 = !DILocation(line: 53, column: 12, scope: !9, inlinedAt: !128)
!136 = !DILocation(line: 54, column: 8, scope: !9, inlinedAt: !128)
!137 = !DILocation(line: 54, column: 13, scope: !9, inlinedAt: !128)
!138 = !DILocation(line: 55, column: 8, scope: !9, inlinedAt: !128)
!139 = !DILocation(line: 55, column: 15, scope: !9, inlinedAt: !128)
!140 = !DILocation(line: 59, column: 8, scope: !9, inlinedAt: !128)
!141 = !DILocation(line: 59, column: 14, scope: !9, inlinedAt: !128)
!142 = !DILocation(line: 61, column: 21, scope: !9, inlinedAt: !128)
!143 = !DILocation(line: 61, column: 14, scope: !9, inlinedAt: !128)
!144 = !DILocation(line: 61, column: 12, scope: !9, inlinedAt: !128)
!145 = !DILocation(line: 62, column: 10, scope: !59, inlinedAt: !128)
!146 = !DILocation(line: 62, column: 9, scope: !9, inlinedAt: !128)
!147 = !DILocation(line: 63, column: 9, scope: !59, inlinedAt: !128)
!148 = !DILocation(line: 57, column: 8, scope: !9, inlinedAt: !128)
!149 = !DILocation(line: 140, column: 49, scope: !63, inlinedAt: !150)
!150 = distinct !DILocation(line: 65, column: 5, scope: !9, inlinedAt: !128)
!151 = !DILocation(line: 142, column: 15, scope: !63, inlinedAt: !150)
!152 = !DILocation(line: 142, column: 5, scope: !63, inlinedAt: !150)
!153 = !DILocation(line: 142, column: 23, scope: !63, inlinedAt: !150)
