; ModuleID = '/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c'
source_filename = "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/t_list.c", directory: "/root/.unikraft/apps/redis/build")
!2 = !{}
!3 = !{!4, !6, !9, !38, !39, !54, !64, !73}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklist", file: !11, line: 80, baseType: !12)
!11 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/quicklist.h", directory: "/root/.unikraft/apps/redis/build")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklist", file: !11, line: 73, size: 320, elements: !13)
!13 = !{!14, !31, !32, !34, !35, !37}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !12, file: !11, line: 74, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistNode", file: !11, line: 55, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistNode", file: !11, line: 44, size: 256, elements: !18)
!18 = !{!19, !21, !22, !23, !25, !26, !27, !28, !29, !30}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !17, file: !11, line: 45, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !11, line: 46, baseType: !20, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "zl", scope: !17, file: !11, line: 47, baseType: !7, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !17, file: !11, line: 48, baseType: !24, size: 32, offset: 192)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !17, file: !11, line: 49, baseType: !24, size: 16, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !17, file: !11, line: 50, baseType: !24, size: 2, offset: 240, flags: DIFlagBitField, extraData: i64 224)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !17, file: !11, line: 51, baseType: !24, size: 2, offset: 242, flags: DIFlagBitField, extraData: i64 224)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "recompress", scope: !17, file: !11, line: 52, baseType: !24, size: 1, offset: 244, flags: DIFlagBitField, extraData: i64 224)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "attempted_compress", scope: !17, file: !11, line: 53, baseType: !24, size: 1, offset: 245, flags: DIFlagBitField, extraData: i64 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !17, file: !11, line: 54, baseType: !24, size: 10, offset: 246, flags: DIFlagBitField, extraData: i64 224)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !12, file: !11, line: 75, baseType: !15, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !12, file: !11, line: 76, baseType: !33, size: 64, offset: 128)
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !11, line: 77, baseType: !33, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !12, file: !11, line: 78, baseType: !36, size: 16, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !12, file: !11, line: 79, baseType: !24, size: 16, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr8", file: !41, line: 51, size: 24, elements: !42)
!41 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/sds.h", directory: "/root/.unikraft/apps/redis/build")
!42 = !{!43, !48, !49, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !41, line: 52, baseType: !44, size: 8)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !46)
!45 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 43, baseType: !8)
!47 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !40, file: !41, line: 53, baseType: !44, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !41, line: 54, baseType: !8, size: 8, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !41, line: 55, baseType: !51, offset: 24)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: -1)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr16", file: !41, line: 57, size: 40, elements: !56)
!56 = !{!57, !61, !62, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !41, line: 58, baseType: !58, size: 16)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 36, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !47, line: 57, baseType: !60)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !55, file: !41, line: 59, baseType: !58, size: 16, offset: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !41, line: 60, baseType: !8, size: 8, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !55, file: !41, line: 61, baseType: !51, offset: 40)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr32", file: !41, line: 63, size: 72, elements: !66)
!66 = !{!67, !70, !71, !72}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !41, line: 64, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 48, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 79, baseType: !24)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !65, file: !41, line: 65, baseType: !68, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !41, line: 66, baseType: !8, size: 8, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !65, file: !41, line: 67, baseType: !51, offset: 72)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr64", file: !41, line: 69, size: 136, elements: !75)
!75 = !{!76, !79, !80, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !41, line: 70, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 60, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !47, line: 105, baseType: !33)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !74, file: !41, line: 71, baseType: !77, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !41, line: 72, baseType: !8, size: 8, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !74, file: !41, line: 73, baseType: !51, offset: 136)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!86 = distinct !DISubprogram(name: "listTypePush", scope: !1, file: !1, line: 41, type: !87, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !99)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !89, !36}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !91, line: 622, baseType: !92)
!91 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/server.h", directory: "/root/.unikraft/apps/redis/build")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !91, line: 614, size: 128, elements: !93)
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !91, line: 615, baseType: !24, size: 4, flags: DIFlagBitField, extraData: i64 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !92, file: !91, line: 616, baseType: !24, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !92, file: !91, line: 617, baseType: !24, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !92, file: !91, line: 620, baseType: !36, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, file: !91, line: 621, baseType: !38, size: 64, offset: 64)
!99 = !{!100, !101, !102, !103, !106}
!100 = !DILocalVariable(name: "subject", arg: 1, scope: !86, file: !1, line: 41, type: !89)
!101 = !DILocalVariable(name: "value", arg: 2, scope: !86, file: !1, line: 41, type: !89)
!102 = !DILocalVariable(name: "where", arg: 3, scope: !86, file: !1, line: 41, type: !36)
!103 = !DILocalVariable(name: "pos", scope: !104, file: !1, line: 43, type: !36)
!104 = distinct !DILexicalBlock(scope: !105, file: !1, line: 42, column: 54)
!105 = distinct !DILexicalBlock(scope: !86, file: !1, line: 42, column: 9)
!106 = !DILocalVariable(name: "len", scope: !104, file: !1, line: 45, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 40, baseType: !109)
!108 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !110, line: 129, baseType: !33)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!111 = !DILocation(line: 41, column: 25, scope: !86)
!112 = !DILocation(line: 41, column: 40, scope: !86)
!113 = !DILocation(line: 41, column: 51, scope: !86)
!114 = !DILocation(line: 42, column: 18, scope: !105)
!115 = !DILocation(line: 42, column: 27, scope: !105)
!116 = !DILocation(line: 42, column: 9, scope: !86)
!117 = !DILocation(line: 43, column: 26, scope: !104)
!118 = !DILocation(line: 43, column: 19, scope: !104)
!119 = !DILocation(line: 43, column: 13, scope: !104)
!120 = !DILocation(line: 44, column: 17, scope: !104)
!121 = !DILocation(line: 45, column: 36, scope: !104)
!122 = !{!123, !127, i64 8}
!123 = !{!"redisObject", !124, i64 0, !124, i64 0, !124, i64 1, !124, i64 4, !127, i64 8}
!124 = !{!"int", !125, i64 0}
!125 = !{!"omnipotent char", !126, i64 0}
!126 = !{!"Simple C/C++ TBAA"}
!127 = !{!"any pointer", !125, i64 0}
!128 = !DILocalVariable(name: "s", arg: 1, scope: !129, file: !41, line: 87, type: !134)
!129 = distinct !DISubprogram(name: "sdslen", scope: !41, file: !41, line: 87, type: !130, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !136)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 58, baseType: !33)
!133 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !41, line: 43, baseType: !4)
!136 = !{!128, !137}
!137 = !DILocalVariable(name: "flags", scope: !129, file: !41, line: 88, type: !8)
!138 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !139)
!139 = distinct !DILocation(line: 45, column: 22, scope: !104)
!140 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !139)
!141 = !{!125, !125, i64 0}
!142 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !139)
!143 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !139)
!144 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !139)
!145 = distinct !DILexicalBlock(scope: !129, file: !41, line: 89, column: 33)
!146 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !139)
!147 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !139)
!148 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !139)
!149 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !139)
!150 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !139)
!151 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !139)
!152 = !{!153, !153, i64 0}
!153 = !{!"short", !125, i64 0}
!154 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !139)
!155 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !139)
!156 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !139)
!157 = !{!124, !124, i64 0}
!158 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !139)
!159 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !139)
!160 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !139)
!161 = !{!162, !162, i64 0}
!162 = !{!"long", !125, i64 0}
!163 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !139)
!164 = !DILocation(line: 0, scope: !145, inlinedAt: !139)
!165 = !DILocation(line: 45, column: 16, scope: !104)
!166 = !DILocation(line: 46, column: 32, scope: !104)
!167 = !DILocation(line: 46, column: 9, scope: !104)
!168 = !DILocation(line: 47, column: 9, scope: !104)
!169 = !DILocation(line: 51, column: 1, scope: !86)
!170 = !DILocation(line: 49, column: 9, scope: !171)
!171 = distinct !DILexicalBlock(scope: !105, file: !1, line: 48, column: 12)
!172 = distinct !DISubprogram(name: "listPopSaver", scope: !1, file: !1, line: 53, type: !173, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !175)
!173 = !DISubroutineType(types: !174)
!174 = !{!38, !7, !24}
!175 = !{!176, !177}
!176 = !DILocalVariable(name: "data", arg: 1, scope: !172, file: !1, line: 53, type: !7)
!177 = !DILocalVariable(name: "sz", arg: 2, scope: !172, file: !1, line: 53, type: !24)
!178 = !DILocation(line: 53, column: 35, scope: !172)
!179 = !DILocation(line: 53, column: 54, scope: !172)
!180 = !DILocation(line: 54, column: 43, scope: !172)
!181 = !DILocation(line: 54, column: 12, scope: !172)
!182 = !DILocation(line: 54, column: 5, scope: !172)
!183 = distinct !DISubprogram(name: "listTypePop", scope: !1, file: !1, line: 57, type: !184, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !186)
!184 = !DISubroutineType(types: !185)
!185 = !{!89, !89, !36}
!186 = !{!187, !188, !189, !191, !192}
!187 = !DILocalVariable(name: "subject", arg: 1, scope: !183, file: !1, line: 57, type: !89)
!188 = !DILocalVariable(name: "where", arg: 2, scope: !183, file: !1, line: 57, type: !36)
!189 = !DILocalVariable(name: "vlong", scope: !183, file: !1, line: 58, type: !190)
!190 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!191 = !DILocalVariable(name: "value", scope: !183, file: !1, line: 59, type: !89)
!192 = !DILocalVariable(name: "ql_where", scope: !183, file: !1, line: 61, type: !36)
!193 = !DILocation(line: 57, column: 25, scope: !183)
!194 = !DILocation(line: 57, column: 38, scope: !183)
!195 = !DILocation(line: 58, column: 5, scope: !183)
!196 = !DILocation(line: 59, column: 5, scope: !183)
!197 = !DILocation(line: 59, column: 11, scope: !183)
!198 = !{!127, !127, i64 0}
!199 = !DILocation(line: 62, column: 18, scope: !200)
!200 = distinct !DILexicalBlock(scope: !183, file: !1, line: 62, column: 9)
!201 = !DILocation(line: 62, column: 27, scope: !200)
!202 = !DILocation(line: 62, column: 9, scope: !183)
!203 = !DILocation(line: 61, column: 26, scope: !183)
!204 = !DILocation(line: 61, column: 20, scope: !183)
!205 = !DILocation(line: 61, column: 9, scope: !183)
!206 = !DILocation(line: 63, column: 41, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 63, column: 13)
!208 = distinct !DILexicalBlock(scope: !200, file: !1, line: 62, column: 54)
!209 = !DILocation(line: 63, column: 56, scope: !207)
!210 = !DILocation(line: 58, column: 15, scope: !183)
!211 = !DILocation(line: 63, column: 13, scope: !207)
!212 = !DILocation(line: 65, column: 18, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !1, line: 65, column: 17)
!214 = distinct !DILexicalBlock(scope: !207, file: !1, line: 64, column: 61)
!215 = !DILocation(line: 63, column: 13, scope: !208)
!216 = !DILocation(line: 66, column: 56, scope: !213)
!217 = !{!218, !218, i64 0}
!218 = !{!"long long", !125, i64 0}
!219 = !DILocation(line: 66, column: 25, scope: !213)
!220 = !DILocation(line: 66, column: 23, scope: !213)
!221 = !DILocation(line: 66, column: 17, scope: !213)
!222 = !DILocation(line: 69, column: 9, scope: !223)
!223 = distinct !DILexicalBlock(scope: !200, file: !1, line: 68, column: 12)
!224 = !DILocation(line: 71, column: 12, scope: !183)
!225 = !DILocation(line: 72, column: 1, scope: !183)
!226 = !DILocation(line: 71, column: 5, scope: !183)
!227 = distinct !DISubprogram(name: "listTypeLength", scope: !1, file: !1, line: 74, type: !228, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !232)
!228 = !DISubroutineType(types: !229)
!229 = !{!33, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!232 = !{!233}
!233 = !DILocalVariable(name: "subject", arg: 1, scope: !227, file: !1, line: 74, type: !230)
!234 = !DILocation(line: 74, column: 42, scope: !227)
!235 = !DILocation(line: 75, column: 18, scope: !236)
!236 = distinct !DILexicalBlock(scope: !227, file: !1, line: 75, column: 9)
!237 = !DILocation(line: 75, column: 27, scope: !236)
!238 = !DILocation(line: 75, column: 9, scope: !227)
!239 = !DILocation(line: 76, column: 40, scope: !240)
!240 = distinct !DILexicalBlock(scope: !236, file: !1, line: 75, column: 54)
!241 = !DILocation(line: 76, column: 16, scope: !240)
!242 = !DILocation(line: 76, column: 9, scope: !240)
!243 = !DILocation(line: 78, column: 9, scope: !244)
!244 = distinct !DILexicalBlock(scope: !236, file: !1, line: 77, column: 12)
!245 = distinct !DISubprogram(name: "listTypeInitIterator", scope: !1, file: !1, line: 83, type: !246, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !268)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !89, !266, !8}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeIterator", file: !91, line: 1347, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 1342, size: 192, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !250, file: !91, line: 1343, baseType: !89, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !250, file: !91, line: 1344, baseType: !8, size: 8, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !250, file: !91, line: 1345, baseType: !8, size: 8, offset: 72)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !250, file: !91, line: 1346, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistIter", file: !11, line: 88, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistIter", file: !11, line: 82, size: 320, elements: !259)
!259 = !{!260, !263, !264, !265, !267}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !258, file: !11, line: 83, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !258, file: !11, line: 84, baseType: !15, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !258, file: !11, line: 85, baseType: !7, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !258, file: !11, line: 86, baseType: !266, size: 64, offset: 192)
!266 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !258, file: !11, line: 87, baseType: !36, size: 32, offset: 256)
!268 = !{!269, !270, !271, !272, !273}
!269 = !DILocalVariable(name: "subject", arg: 1, scope: !245, file: !1, line: 83, type: !89)
!270 = !DILocalVariable(name: "index", arg: 2, scope: !245, file: !1, line: 83, type: !266)
!271 = !DILocalVariable(name: "direction", arg: 3, scope: !245, file: !1, line: 84, type: !8)
!272 = !DILocalVariable(name: "li", scope: !245, file: !1, line: 85, type: !248)
!273 = !DILocalVariable(name: "iter_direction", scope: !245, file: !1, line: 92, type: !36)
!274 = !DILocation(line: 83, column: 46, scope: !245)
!275 = !DILocation(line: 83, column: 60, scope: !245)
!276 = !DILocation(line: 84, column: 54, scope: !245)
!277 = !DILocation(line: 85, column: 28, scope: !245)
!278 = !DILocation(line: 86, column: 9, scope: !245)
!279 = !DILocation(line: 86, column: 17, scope: !245)
!280 = !{!281, !127, i64 0}
!281 = !{!"", !127, i64 0, !125, i64 8, !125, i64 9, !127, i64 16}
!282 = !DILocation(line: 87, column: 29, scope: !245)
!283 = !DILocation(line: 87, column: 20, scope: !245)
!284 = !DILocation(line: 87, column: 9, scope: !245)
!285 = !DILocation(line: 87, column: 18, scope: !245)
!286 = !{!281, !125, i64 8}
!287 = !DILocation(line: 88, column: 9, scope: !245)
!288 = !DILocation(line: 88, column: 19, scope: !245)
!289 = !{!281, !125, i64 9}
!290 = !DILocation(line: 89, column: 9, scope: !245)
!291 = !DILocation(line: 89, column: 14, scope: !245)
!292 = !{!281, !127, i64 16}
!293 = !DILocation(line: 94, column: 22, scope: !294)
!294 = distinct !DILexicalBlock(scope: !245, file: !1, line: 94, column: 9)
!295 = !DILocation(line: 94, column: 9, scope: !245)
!296 = !DILocation(line: 93, column: 19, scope: !245)
!297 = !DILocation(line: 93, column: 9, scope: !245)
!298 = !DILocation(line: 92, column: 9, scope: !245)
!299 = !DILocation(line: 85, column: 23, scope: !245)
!300 = !DILocation(line: 95, column: 59, scope: !301)
!301 = distinct !DILexicalBlock(scope: !294, file: !1, line: 94, column: 49)
!302 = !DILocation(line: 95, column: 20, scope: !301)
!303 = !DILocation(line: 95, column: 18, scope: !301)
!304 = !DILocation(line: 100, column: 5, scope: !245)
!305 = !DILocation(line: 98, column: 9, scope: !306)
!306 = distinct !DILexicalBlock(scope: !294, file: !1, line: 97, column: 12)
!307 = distinct !DISubprogram(name: "listTypeReleaseIterator", scope: !1, file: !1, line: 104, type: !308, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !310)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !248}
!310 = !{!311}
!311 = !DILocalVariable(name: "li", arg: 1, scope: !307, file: !1, line: 104, type: !248)
!312 = !DILocation(line: 104, column: 48, scope: !307)
!313 = !DILocation(line: 105, column: 15, scope: !307)
!314 = !DILocation(line: 105, column: 5, scope: !307)
!315 = !DILocation(line: 106, column: 11, scope: !307)
!316 = !DILocation(line: 106, column: 5, scope: !307)
!317 = !DILocation(line: 107, column: 1, scope: !307)
!318 = distinct !DISubprogram(name: "listTypeNext", scope: !1, file: !1, line: 112, type: !319, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !337)
!319 = !DISubroutineType(types: !320)
!320 = !{!36, !248, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "listTypeEntry", file: !91, line: 1353, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 1350, size: 448, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "li", scope: !323, file: !91, line: 1351, baseType: !248, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !323, file: !91, line: 1352, baseType: !327, size: 384, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "quicklistEntry", file: !11, line: 98, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quicklistEntry", file: !11, line: 90, size: 384, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "quicklist", scope: !328, file: !11, line: 91, baseType: !261, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !328, file: !11, line: 92, baseType: !15, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "zi", scope: !328, file: !11, line: 93, baseType: !7, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !328, file: !11, line: 94, baseType: !7, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "longval", scope: !328, file: !11, line: 95, baseType: !190, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !328, file: !11, line: 96, baseType: !24, size: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !328, file: !11, line: 97, baseType: !36, size: 32, offset: 352)
!337 = !{!338, !339}
!338 = !DILocalVariable(name: "li", arg: 1, scope: !318, file: !1, line: 112, type: !248)
!339 = !DILocalVariable(name: "entry", arg: 2, scope: !318, file: !1, line: 112, type: !321)
!340 = !DILocation(line: 112, column: 36, scope: !318)
!341 = !DILocation(line: 112, column: 55, scope: !318)
!342 = !DILocation(line: 114, column: 5, scope: !318)
!343 = !DILocation(line: 116, column: 12, scope: !318)
!344 = !DILocation(line: 116, column: 15, scope: !318)
!345 = !{!346, !127, i64 0}
!346 = !{!"", !127, i64 0, !347, i64 8}
!347 = !{!"quicklistEntry", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !218, i64 32, !124, i64 40, !124, i64 44}
!348 = !DILocation(line: 117, column: 22, scope: !349)
!349 = distinct !DILexicalBlock(scope: !318, file: !1, line: 117, column: 9)
!350 = !DILocation(line: 117, column: 9, scope: !318)
!351 = !DILocation(line: 118, column: 34, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !1, line: 117, column: 49)
!353 = !DILocation(line: 118, column: 48, scope: !352)
!354 = !DILocation(line: 118, column: 16, scope: !352)
!355 = !DILocation(line: 118, column: 9, scope: !352)
!356 = !DILocation(line: 120, column: 9, scope: !357)
!357 = distinct !DILexicalBlock(scope: !349, file: !1, line: 119, column: 12)
!358 = distinct !DISubprogram(name: "listTypeGet", scope: !1, file: !1, line: 126, type: !359, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !361)
!359 = !DISubroutineType(types: !360)
!360 = !{!89, !321}
!361 = !{!362, !363}
!362 = !DILocalVariable(name: "entry", arg: 1, scope: !358, file: !1, line: 126, type: !321)
!363 = !DILocalVariable(name: "value", scope: !358, file: !1, line: 127, type: !89)
!364 = !DILocation(line: 126, column: 34, scope: !358)
!365 = !DILocation(line: 127, column: 11, scope: !358)
!366 = !DILocation(line: 128, column: 16, scope: !367)
!367 = distinct !DILexicalBlock(scope: !358, file: !1, line: 128, column: 9)
!368 = !DILocation(line: 128, column: 20, scope: !367)
!369 = !DILocation(line: 128, column: 29, scope: !367)
!370 = !DILocation(line: 128, column: 9, scope: !358)
!371 = !DILocation(line: 129, column: 26, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !1, line: 129, column: 13)
!373 = distinct !DILexicalBlock(scope: !367, file: !1, line: 128, column: 56)
!374 = !{!346, !127, i64 32}
!375 = !DILocation(line: 129, column: 13, scope: !372)
!376 = !DILocation(line: 129, column: 13, scope: !373)
!377 = !DILocation(line: 131, column: 53, scope: !378)
!378 = distinct !DILexicalBlock(scope: !372, file: !1, line: 129, column: 33)
!379 = !{!346, !124, i64 48}
!380 = !DILocation(line: 131, column: 40, scope: !378)
!381 = !DILocation(line: 130, column: 21, scope: !378)
!382 = !DILocation(line: 132, column: 9, scope: !378)
!383 = !DILocation(line: 133, column: 65, scope: !384)
!384 = distinct !DILexicalBlock(scope: !372, file: !1, line: 132, column: 16)
!385 = !{!346, !218, i64 40}
!386 = !DILocation(line: 133, column: 21, scope: !384)
!387 = !DILocation(line: 136, column: 9, scope: !388)
!388 = distinct !DILexicalBlock(scope: !367, file: !1, line: 135, column: 12)
!389 = !DILocation(line: 0, scope: !384)
!390 = !DILocation(line: 138, column: 5, scope: !358)
!391 = distinct !DISubprogram(name: "listTypeInsert", scope: !1, file: !1, line: 141, type: !392, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !321, !89, !36}
!394 = !{!395, !396, !397, !398, !401}
!395 = !DILocalVariable(name: "entry", arg: 1, scope: !391, file: !1, line: 141, type: !321)
!396 = !DILocalVariable(name: "value", arg: 2, scope: !391, file: !1, line: 141, type: !89)
!397 = !DILocalVariable(name: "where", arg: 3, scope: !391, file: !1, line: 141, type: !36)
!398 = !DILocalVariable(name: "str", scope: !399, file: !1, line: 144, type: !135)
!399 = distinct !DILexicalBlock(scope: !400, file: !1, line: 142, column: 56)
!400 = distinct !DILexicalBlock(scope: !391, file: !1, line: 142, column: 9)
!401 = !DILocalVariable(name: "len", scope: !399, file: !1, line: 145, type: !107)
!402 = !DILocation(line: 141, column: 36, scope: !391)
!403 = !DILocation(line: 141, column: 49, scope: !391)
!404 = !DILocation(line: 141, column: 60, scope: !391)
!405 = !DILocation(line: 142, column: 16, scope: !400)
!406 = !DILocation(line: 142, column: 20, scope: !400)
!407 = !DILocation(line: 142, column: 29, scope: !400)
!408 = !DILocation(line: 142, column: 9, scope: !391)
!409 = !DILocation(line: 143, column: 17, scope: !399)
!410 = !DILocation(line: 144, column: 26, scope: !399)
!411 = !DILocation(line: 144, column: 13, scope: !399)
!412 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !413)
!413 = distinct !DILocation(line: 145, column: 22, scope: !399)
!414 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !413)
!415 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !413)
!416 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !413)
!417 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !413)
!418 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !413)
!419 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !413)
!420 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !413)
!421 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !413)
!422 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !413)
!423 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !413)
!424 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !413)
!425 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !413)
!426 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !413)
!427 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !413)
!428 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !413)
!429 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !413)
!430 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !413)
!431 = !DILocation(line: 0, scope: !145, inlinedAt: !413)
!432 = !DILocation(line: 145, column: 16, scope: !399)
!433 = !DILocation(line: 146, column: 13, scope: !399)
!434 = !DILocation(line: 147, column: 54, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 146, column: 33)
!436 = distinct !DILexicalBlock(scope: !399, file: !1, line: 146, column: 13)
!437 = !DILocation(line: 147, column: 60, scope: !435)
!438 = !{!346, !127, i64 8}
!439 = !DILocation(line: 147, column: 13, scope: !435)
!440 = !DILocation(line: 149, column: 9, scope: !435)
!441 = !DILocation(line: 150, column: 55, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 149, column: 40)
!443 = distinct !DILexicalBlock(scope: !436, file: !1, line: 149, column: 20)
!444 = !DILocation(line: 150, column: 61, scope: !442)
!445 = !DILocation(line: 150, column: 13, scope: !442)
!446 = !DILocation(line: 152, column: 9, scope: !442)
!447 = !DILocation(line: 153, column: 9, scope: !399)
!448 = !DILocation(line: 157, column: 1, scope: !391)
!449 = !DILocation(line: 155, column: 9, scope: !450)
!450 = distinct !DILexicalBlock(scope: !400, file: !1, line: 154, column: 12)
!451 = distinct !DISubprogram(name: "listTypeEqual", scope: !1, file: !1, line: 160, type: !452, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!36, !321, !89}
!454 = !{!455, !456}
!455 = !DILocalVariable(name: "entry", arg: 1, scope: !451, file: !1, line: 160, type: !321)
!456 = !DILocalVariable(name: "o", arg: 2, scope: !451, file: !1, line: 160, type: !89)
!457 = !DILocation(line: 160, column: 34, scope: !451)
!458 = !DILocation(line: 160, column: 47, scope: !451)
!459 = !DILocation(line: 161, column: 16, scope: !460)
!460 = distinct !DILexicalBlock(scope: !451, file: !1, line: 161, column: 9)
!461 = !DILocation(line: 161, column: 20, scope: !460)
!462 = !DILocation(line: 161, column: 29, scope: !460)
!463 = !DILocation(line: 161, column: 9, scope: !451)
!464 = !DILocation(line: 162, column: 9, scope: !465)
!465 = distinct !DILexicalBlock(scope: !460, file: !1, line: 161, column: 56)
!466 = !DILocation(line: 163, column: 46, scope: !465)
!467 = !{!346, !127, i64 24}
!468 = !DILocation(line: 163, column: 52, scope: !465)
!469 = !DILocation(line: 87, column: 39, scope: !129, inlinedAt: !470)
!470 = distinct !DILocation(line: 163, column: 56, scope: !465)
!471 = !DILocation(line: 88, column: 27, scope: !129, inlinedAt: !470)
!472 = !DILocation(line: 88, column: 19, scope: !129, inlinedAt: !470)
!473 = !DILocation(line: 89, column: 5, scope: !129, inlinedAt: !470)
!474 = !DILocation(line: 91, column: 20, scope: !145, inlinedAt: !470)
!475 = !DILocation(line: 91, column: 13, scope: !145, inlinedAt: !470)
!476 = !DILocation(line: 93, column: 20, scope: !145, inlinedAt: !470)
!477 = !DILocation(line: 93, column: 34, scope: !145, inlinedAt: !470)
!478 = !DILocation(line: 93, column: 13, scope: !145, inlinedAt: !470)
!479 = !DILocation(line: 95, column: 20, scope: !145, inlinedAt: !470)
!480 = !DILocation(line: 95, column: 35, scope: !145, inlinedAt: !470)
!481 = !DILocation(line: 95, column: 13, scope: !145, inlinedAt: !470)
!482 = !DILocation(line: 97, column: 20, scope: !145, inlinedAt: !470)
!483 = !DILocation(line: 97, column: 35, scope: !145, inlinedAt: !470)
!484 = !DILocation(line: 97, column: 13, scope: !145, inlinedAt: !470)
!485 = !DILocation(line: 99, column: 20, scope: !145, inlinedAt: !470)
!486 = !DILocation(line: 99, column: 35, scope: !145, inlinedAt: !470)
!487 = !DILocation(line: 99, column: 13, scope: !145, inlinedAt: !470)
!488 = !DILocation(line: 0, scope: !145, inlinedAt: !470)
!489 = !DILocation(line: 163, column: 56, scope: !465)
!490 = !DILocation(line: 163, column: 16, scope: !465)
!491 = !DILocation(line: 163, column: 9, scope: !465)
!492 = !DILocation(line: 165, column: 9, scope: !493)
!493 = distinct !DILexicalBlock(scope: !460, file: !1, line: 164, column: 12)
!494 = distinct !DISubprogram(name: "listTypeDelete", scope: !1, file: !1, line: 170, type: !495, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !248, !321}
!497 = !{!498, !499}
!498 = !DILocalVariable(name: "iter", arg: 1, scope: !494, file: !1, line: 170, type: !248)
!499 = !DILocalVariable(name: "entry", arg: 2, scope: !494, file: !1, line: 170, type: !321)
!500 = !DILocation(line: 170, column: 39, scope: !494)
!501 = !DILocation(line: 170, column: 60, scope: !494)
!502 = !DILocation(line: 171, column: 16, scope: !503)
!503 = distinct !DILexicalBlock(scope: !494, file: !1, line: 171, column: 9)
!504 = !DILocation(line: 171, column: 20, scope: !503)
!505 = !DILocation(line: 171, column: 29, scope: !503)
!506 = !DILocation(line: 171, column: 9, scope: !494)
!507 = !DILocation(line: 172, column: 33, scope: !508)
!508 = distinct !DILexicalBlock(scope: !503, file: !1, line: 171, column: 56)
!509 = !DILocation(line: 172, column: 47, scope: !508)
!510 = !DILocation(line: 172, column: 9, scope: !508)
!511 = !DILocation(line: 176, column: 1, scope: !494)
!512 = !DILocation(line: 174, column: 9, scope: !513)
!513 = distinct !DILexicalBlock(scope: !503, file: !1, line: 173, column: 12)
!514 = distinct !DISubprogram(name: "listTypeConvert", scope: !1, file: !1, line: 179, type: !515, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !89, !36}
!517 = !{!518, !519, !520, !523}
!518 = !DILocalVariable(name: "subject", arg: 1, scope: !514, file: !1, line: 179, type: !89)
!519 = !DILocalVariable(name: "enc", arg: 2, scope: !514, file: !1, line: 179, type: !36)
!520 = !DILocalVariable(name: "zlen", scope: !521, file: !1, line: 184, type: !107)
!521 = distinct !DILexicalBlock(scope: !522, file: !1, line: 183, column: 40)
!522 = distinct !DILexicalBlock(scope: !514, file: !1, line: 183, column: 9)
!523 = !DILocalVariable(name: "depth", scope: !521, file: !1, line: 185, type: !36)
!524 = !DILocation(line: 179, column: 28, scope: !514)
!525 = !DILocation(line: 179, column: 41, scope: !514)
!526 = !DILocation(line: 180, column: 5, scope: !514)
!527 = !DILocation(line: 181, column: 5, scope: !514)
!528 = !DILocation(line: 183, column: 13, scope: !522)
!529 = !DILocation(line: 183, column: 9, scope: !514)
!530 = !DILocation(line: 184, column: 30, scope: !521)
!531 = !{!532, !124, i64 2864}
!532 = !{!"redisServer", !124, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !124, i64 32, !124, i64 36, !124, i64 40, !127, i64 48, !127, i64 56, !127, i64 64, !127, i64 72, !124, i64 80, !124, i64 84, !124, i64 88, !124, i64 92, !127, i64 96, !127, i64 104, !124, i64 112, !124, i64 116, !125, i64 120, !124, i64 164, !162, i64 168, !124, i64 176, !127, i64 184, !127, i64 192, !127, i64 200, !125, i64 208, !124, i64 216, !124, i64 220, !125, i64 224, !124, i64 352, !127, i64 360, !124, i64 368, !125, i64 372, !124, i64 436, !124, i64 440, !125, i64 444, !124, i64 508, !127, i64 512, !127, i64 520, !127, i64 528, !127, i64 536, !127, i64 544, !127, i64 552, !127, i64 560, !124, i64 568, !218, i64 576, !125, i64 584, !127, i64 840, !162, i64 848, !124, i64 856, !124, i64 860, !162, i64 864, !162, i64 872, !162, i64 880, !162, i64 888, !127, i64 896, !127, i64 904, !127, i64 912, !127, i64 920, !127, i64 928, !127, i64 936, !127, i64 944, !127, i64 952, !127, i64 960, !127, i64 968, !127, i64 976, !127, i64 984, !127, i64 992, !162, i64 1000, !218, i64 1008, !218, i64 1016, !218, i64 1024, !533, i64 1032, !218, i64 1040, !218, i64 1048, !218, i64 1056, !218, i64 1064, !218, i64 1072, !218, i64 1080, !218, i64 1088, !218, i64 1096, !218, i64 1104, !162, i64 1112, !218, i64 1120, !533, i64 1128, !218, i64 1136, !218, i64 1144, !218, i64 1152, !218, i64 1160, !127, i64 1168, !218, i64 1176, !218, i64 1184, !162, i64 1192, !534, i64 1200, !218, i64 1240, !218, i64 1248, !162, i64 1256, !162, i64 1264, !125, i64 1272, !124, i64 1728, !124, i64 1732, !124, i64 1736, !124, i64 1740, !124, i64 1744, !162, i64 1752, !124, i64 1760, !124, i64 1764, !124, i64 1768, !124, i64 1772, !162, i64 1776, !162, i64 1784, !124, i64 1792, !124, i64 1796, !124, i64 1800, !124, i64 1804, !125, i64 1808, !124, i64 1880, !124, i64 1884, !127, i64 1888, !124, i64 1896, !124, i64 1900, !162, i64 1904, !162, i64 1912, !162, i64 1920, !162, i64 1928, !124, i64 1936, !124, i64 1940, !127, i64 1944, !127, i64 1952, !124, i64 1960, !124, i64 1964, !162, i64 1968, !162, i64 1976, !162, i64 1984, !162, i64 1992, !124, i64 2000, !162, i64 2008, !124, i64 2016, !124, i64 2020, !124, i64 2024, !124, i64 2028, !124, i64 2032, !124, i64 2036, !124, i64 2040, !124, i64 2044, !124, i64 2048, !124, i64 2052, !124, i64 2056, !124, i64 2060, !124, i64 2064, !127, i64 2072, !218, i64 2080, !218, i64 2088, !124, i64 2096, !127, i64 2104, !124, i64 2112, !127, i64 2120, !124, i64 2128, !124, i64 2132, !162, i64 2136, !162, i64 2144, !162, i64 2152, !162, i64 2160, !124, i64 2168, !124, i64 2172, !124, i64 2176, !124, i64 2180, !124, i64 2184, !124, i64 2188, !125, i64 2192, !535, i64 2200, !536, i64 2224, !127, i64 2240, !124, i64 2248, !127, i64 2256, !124, i64 2264, !125, i64 2268, !125, i64 2309, !218, i64 2352, !218, i64 2360, !124, i64 2368, !124, i64 2372, !127, i64 2376, !218, i64 2384, !218, i64 2392, !218, i64 2400, !218, i64 2408, !162, i64 2416, !162, i64 2424, !124, i64 2432, !124, i64 2436, !124, i64 2440, !124, i64 2444, !124, i64 2448, !127, i64 2456, !127, i64 2464, !124, i64 2472, !124, i64 2476, !127, i64 2480, !127, i64 2488, !124, i64 2496, !124, i64 2500, !162, i64 2504, !162, i64 2512, !162, i64 2520, !124, i64 2528, !124, i64 2532, !127, i64 2536, !162, i64 2544, !124, i64 2552, !124, i64 2556, !124, i64 2560, !162, i64 2568, !124, i64 2576, !124, i64 2580, !124, i64 2584, !127, i64 2592, !125, i64 2600, !218, i64 2648, !124, i64 2656, !127, i64 2664, !127, i64 2672, !124, i64 2680, !127, i64 2688, !124, i64 2696, !124, i64 2700, !218, i64 2704, !124, i64 2712, !124, i64 2716, !124, i64 2720, !124, i64 2724, !218, i64 2728, !124, i64 2736, !125, i64 2740, !127, i64 2768, !127, i64 2776, !124, i64 2784, !124, i64 2788, !124, i64 2792, !124, i64 2796, !162, i64 2800, !162, i64 2808, !162, i64 2816, !162, i64 2824, !162, i64 2832, !162, i64 2840, !162, i64 2848, !162, i64 2856, !124, i64 2864, !124, i64 2868, !162, i64 2872, !162, i64 2880, !124, i64 2888, !218, i64 2896, !127, i64 2904, !127, i64 2912, !124, i64 2920, !124, i64 2924, !218, i64 2928, !127, i64 2936, !127, i64 2944, !124, i64 2952, !124, i64 2956, !124, i64 2960, !124, i64 2964, !127, i64 2968, !124, i64 2976, !124, i64 2980, !124, i64 2984, !127, i64 2992, !127, i64 3000, !127, i64 3008, !127, i64 3016, !218, i64 3024, !218, i64 3032, !218, i64 3040, !124, i64 3048, !124, i64 3052, !124, i64 3056, !124, i64 3060, !124, i64 3064, !124, i64 3068, !124, i64 3072, !124, i64 3076, !124, i64 3080, !124, i64 3084, !124, i64 3088, !218, i64 3096, !127, i64 3104, !127, i64 3112, !127, i64 3120, !124, i64 3128, !124, i64 3132, !124, i64 3136, !162, i64 3144, !127, i64 3152, !127, i64 3160, !127, i64 3168}
!533 = !{!"double", !125, i64 0}
!534 = !{!"malloc_stats", !162, i64 0, !162, i64 8, !162, i64 16, !162, i64 24, !162, i64 32}
!535 = !{!"", !124, i64 0, !162, i64 8, !218, i64 16}
!536 = !{!"redisOpArray", !127, i64 0, !124, i64 8}
!537 = !DILocation(line: 185, column: 28, scope: !521)
!538 = !{!532, !124, i64 2868}
!539 = !DILocation(line: 185, column: 13, scope: !521)
!540 = !DILocation(line: 186, column: 73, scope: !521)
!541 = !DILocation(line: 186, column: 24, scope: !521)
!542 = !DILocation(line: 186, column: 22, scope: !521)
!543 = !DILocation(line: 187, column: 27, scope: !521)
!544 = !DILocation(line: 191, column: 1, scope: !514)
!545 = !DILocation(line: 189, column: 9, scope: !546)
!546 = distinct !DILexicalBlock(scope: !522, file: !1, line: 188, column: 12)
!547 = distinct !DISubprogram(name: "pushGenericCommand", scope: !1, file: !1, line: 197, type: !548, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !776)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !550, !36}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !91, line: 780, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !91, line: 723, size: 135360, elements: !553)
!553 = !{!554, !555, !556, !659, !660, !661, !662, !663, !664, !665, !667, !691, !692, !693, !694, !695, !696, !698, !699, !702, !703, !704, !705, !706, !707, !708, !709, !714, !715, !716, !717, !718, !719, !720, !721, !725, !726, !730, !731, !747, !748, !765, !766, !767, !768, !769, !770, !771, !772}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !552, file: !91, line: 724, baseType: !77, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !552, file: !91, line: 725, baseType: !36, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !552, file: !91, line: 726, baseType: !557, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !91, line: 656, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !91, line: 647, size: 512, elements: !560)
!560 = !{!561, !624, !625, !626, !627, !628, !629, !630}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !559, file: !91, line: 648, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !564, line: 82, baseType: !565)
!564 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/dict.h", directory: "/root/.unikraft/apps/redis/build")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !564, line: 76, size: 768, elements: !566)
!566 = !{!567, !592, !593, !622, !623}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !564, line: 77, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !564, line: 65, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !564, line: 58, size: 384, elements: !571)
!571 = !{!572, !578, !582, !583, !587, !591}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !570, file: !564, line: 59, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!77, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !570, file: !564, line: 60, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!38, !38, !576}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !570, file: !564, line: 61, baseType: !579, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !570, file: !564, line: 62, baseType: !584, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!36, !38, !576, !576}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !570, file: !564, line: 63, baseType: !588, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !38, !38}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !570, file: !564, line: 64, baseType: !588, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !565, file: !564, line: 78, baseType: !38, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !565, file: !564, line: 79, baseType: !594, size: 512, offset: 128)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 512, elements: !620)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !564, line: 74, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !564, line: 69, size: 256, elements: !597)
!597 = !{!598, !617, !618, !619}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !596, file: !564, line: 70, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !564, line: 56, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !564, line: 47, size: 192, elements: !603)
!603 = !{!604, !605, !615}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !602, file: !564, line: 48, baseType: !38, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !602, file: !564, line: 54, baseType: !606, size: 64, offset: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !602, file: !564, line: 49, size: 64, elements: !607)
!607 = !{!608, !609, !610, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !606, file: !564, line: 50, baseType: !38, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !606, file: !564, line: 51, baseType: !77, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !606, file: !564, line: 52, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !45, line: 56, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !47, line: 103, baseType: !266)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !606, file: !564, line: 53, baseType: !614, size: 64)
!614 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !564, line: 55, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !564, line: 71, baseType: !33, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !596, file: !564, line: 72, baseType: !33, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !596, file: !564, line: 73, baseType: !33, size: 64, offset: 192)
!620 = !{!621}
!621 = !DISubrange(count: 2)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !565, file: !564, line: 80, baseType: !266, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !565, file: !564, line: 81, baseType: !33, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !559, file: !91, line: 649, baseType: !562, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !559, file: !91, line: 650, baseType: !562, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !559, file: !91, line: 651, baseType: !562, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !559, file: !91, line: 652, baseType: !562, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !559, file: !91, line: 653, baseType: !36, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !559, file: !91, line: 654, baseType: !190, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "defrag_later", scope: !559, file: !91, line: 655, baseType: !631, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !633, line: 54, baseType: !634)
!633 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libredis/origin/redis-5.0.6/src/adlist.h", directory: "/root/.unikraft/apps/redis/build")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !633, line: 47, size: 384, elements: !635)
!635 = !{!636, !645, !646, !650, !654, !658}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !634, file: !633, line: 48, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !633, line: 40, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !633, line: 36, size: 192, elements: !640)
!640 = !{!641, !643, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !639, file: !633, line: 37, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !639, file: !633, line: 38, baseType: !642, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !639, file: !633, line: 39, baseType: !38, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !634, file: !633, line: 49, baseType: !637, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !634, file: !633, line: 50, baseType: !647, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!38, !38}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !634, file: !633, line: 51, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !38}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !634, file: !633, line: 52, baseType: !655, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!36, !38, !38}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !634, file: !633, line: 53, baseType: !33, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !91, line: 727, baseType: !89, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !552, file: !91, line: 728, baseType: !135, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "qb_pos", scope: !552, file: !91, line: 729, baseType: !107, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !552, file: !91, line: 730, baseType: !135, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !552, file: !91, line: 734, baseType: !107, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !552, file: !91, line: 735, baseType: !36, size: 32, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !552, file: !91, line: 736, baseType: !666, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !552, file: !91, line: 737, baseType: !668, size: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !91, line: 1307, size: 640, elements: !670)
!670 = !{!671, !672, !677, !678, !679, !680, !686, !687, !688, !689, !690}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !91, line: 1308, baseType: !4, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !669, file: !91, line: 1309, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !91, line: 1305, baseType: !675)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !550}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !669, file: !91, line: 1310, baseType: !36, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !669, file: !91, line: 1311, baseType: !4, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !91, line: 1312, baseType: !36, size: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !669, file: !91, line: 1315, baseType: !681, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !91, line: 1306, baseType: !683)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !668, !666, !36, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !669, file: !91, line: 1317, baseType: !36, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !669, file: !91, line: 1318, baseType: !36, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !669, file: !91, line: 1319, baseType: !36, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !669, file: !91, line: 1320, baseType: !190, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !669, file: !91, line: 1320, baseType: !190, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !552, file: !91, line: 737, baseType: !668, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !552, file: !91, line: 738, baseType: !36, size: 32, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !552, file: !91, line: 739, baseType: !36, size: 32, offset: 800)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !552, file: !91, line: 740, baseType: !266, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !552, file: !91, line: 741, baseType: !631, size: 64, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !552, file: !91, line: 742, baseType: !697, size: 64, offset: 960)
!697 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !552, file: !91, line: 743, baseType: !107, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !552, file: !91, line: 745, baseType: !700, size: 64, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !701, line: 34, baseType: !266)
!701 = !DIFile(filename: "/root/.unikraft/unikraft/lib/uktime/include/uk/time_types.h", directory: "/root/.unikraft/apps/redis/build")
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !552, file: !91, line: 746, baseType: !700, size: 64, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !552, file: !91, line: 747, baseType: !700, size: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !552, file: !91, line: 748, baseType: !36, size: 32, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !552, file: !91, line: 749, baseType: !36, size: 32, offset: 1312)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !552, file: !91, line: 750, baseType: !36, size: 32, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !552, file: !91, line: 751, baseType: !36, size: 32, offset: 1376)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !552, file: !91, line: 752, baseType: !36, size: 32, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !552, file: !91, line: 753, baseType: !710, size: 64, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !711, line: 173, baseType: !712)
!711 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/types.h", directory: "/root/.unikraft/apps/redis/build")
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !110, line: 100, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !110, line: 44, baseType: !266)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !552, file: !91, line: 754, baseType: !710, size: 64, offset: 1536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !552, file: !91, line: 755, baseType: !135, size: 64, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !552, file: !91, line: 756, baseType: !190, size: 64, offset: 1664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !552, file: !91, line: 757, baseType: !190, size: 64, offset: 1728)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !552, file: !91, line: 758, baseType: !190, size: 64, offset: 1792)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !552, file: !91, line: 759, baseType: !190, size: 64, offset: 1856)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !552, file: !91, line: 760, baseType: !190, size: 64, offset: 1920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !552, file: !91, line: 763, baseType: !722, size: 328, offset: 1984)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 328, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 41)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !552, file: !91, line: 764, baseType: !36, size: 32, offset: 2336)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !552, file: !91, line: 765, baseType: !727, size: 368, offset: 2368)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 368, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 46)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !552, file: !91, line: 766, baseType: !36, size: 32, offset: 2752)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !552, file: !91, line: 767, baseType: !732, size: 256, offset: 2816)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !91, line: 673, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !91, line: 665, size: 256, elements: !734)
!734 = !{!735, !743, !744, !745, !746}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !733, file: !91, line: 666, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !91, line: 663, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !91, line: 659, size: 192, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !738, file: !91, line: 660, baseType: !666, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !738, file: !91, line: 661, baseType: !36, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !738, file: !91, line: 662, baseType: !668, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !733, file: !91, line: 667, baseType: !36, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_flags", scope: !733, file: !91, line: 668, baseType: !36, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !733, file: !91, line: 671, baseType: !36, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !733, file: !91, line: 672, baseType: !700, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !552, file: !91, line: 768, baseType: !36, size: 32, offset: 3072)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !552, file: !91, line: 769, baseType: !749, size: 704, offset: 3136)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !91, line: 703, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !91, line: 677, size: 704, elements: !751)
!751 = !{!752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !750, file: !91, line: 679, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !91, line: 52, baseType: !190)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !750, file: !91, line: 683, baseType: !562, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !750, file: !91, line: 685, baseType: !89, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "xread_count", scope: !750, file: !91, line: 689, baseType: !107, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group", scope: !750, file: !91, line: 690, baseType: !89, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "xread_consumer", scope: !750, file: !91, line: 691, baseType: !89, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_time", scope: !750, file: !91, line: 692, baseType: !753, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "xread_retry_ttl", scope: !750, file: !91, line: 692, baseType: !753, size: 64, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xread_group_noack", scope: !750, file: !91, line: 693, baseType: !36, size: 32, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !750, file: !91, line: 696, baseType: !36, size: 32, offset: 544)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !750, file: !91, line: 697, baseType: !190, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !750, file: !91, line: 700, baseType: !38, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !552, file: !91, line: 770, baseType: !190, size: 64, offset: 3840)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !552, file: !91, line: 771, baseType: !631, size: 64, offset: 3904)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !552, file: !91, line: 772, baseType: !562, size: 64, offset: 3968)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !552, file: !91, line: 773, baseType: !631, size: 64, offset: 4032)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !552, file: !91, line: 774, baseType: !135, size: 64, offset: 4096)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "client_list_node", scope: !552, file: !91, line: 775, baseType: !637, size: 64, offset: 4160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !552, file: !91, line: 778, baseType: !36, size: 32, offset: 4224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !552, file: !91, line: 779, baseType: !773, size: 131072, offset: 4256)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 131072, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 16384)
!776 = !{!777, !778, !779, !780, !781, !782}
!777 = !DILocalVariable(name: "c", arg: 1, scope: !547, file: !1, line: 197, type: !550)
!778 = !DILocalVariable(name: "where", arg: 2, scope: !547, file: !1, line: 197, type: !36)
!779 = !DILocalVariable(name: "j", scope: !547, file: !1, line: 198, type: !36)
!780 = !DILocalVariable(name: "pushed", scope: !547, file: !1, line: 198, type: !36)
!781 = !DILocalVariable(name: "lobj", scope: !547, file: !1, line: 199, type: !89)
!782 = !DILocalVariable(name: "event", scope: !783, file: !1, line: 218, type: !4)
!783 = distinct !DILexicalBlock(scope: !784, file: !1, line: 217, column: 17)
!784 = distinct !DILexicalBlock(scope: !547, file: !1, line: 217, column: 9)
!785 = !DILocation(line: 197, column: 33, scope: !547)
!786 = !DILocation(line: 197, column: 40, scope: !547)
!787 = !DILocation(line: 198, column: 12, scope: !547)
!788 = !DILocation(line: 199, column: 36, scope: !547)
!789 = !{!790, !127, i64 16}
!790 = !{!"client", !162, i64 0, !124, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !162, i64 40, !127, i64 48, !162, i64 56, !124, i64 64, !127, i64 72, !127, i64 80, !127, i64 88, !124, i64 96, !124, i64 100, !162, i64 104, !127, i64 112, !218, i64 120, !162, i64 128, !162, i64 136, !162, i64 144, !162, i64 152, !124, i64 160, !124, i64 164, !124, i64 168, !124, i64 172, !124, i64 176, !162, i64 184, !162, i64 192, !127, i64 200, !218, i64 208, !218, i64 216, !218, i64 224, !218, i64 232, !218, i64 240, !125, i64 248, !124, i64 292, !125, i64 296, !124, i64 344, !791, i64 352, !124, i64 384, !792, i64 392, !218, i64 480, !127, i64 488, !127, i64 496, !127, i64 504, !127, i64 512, !127, i64 520, !124, i64 528, !125, i64 532}
!791 = !{!"multiState", !127, i64 0, !124, i64 8, !124, i64 12, !124, i64 16, !162, i64 24}
!792 = !{!"blockingState", !218, i64 0, !127, i64 8, !127, i64 16, !162, i64 24, !127, i64 32, !127, i64 40, !218, i64 48, !218, i64 56, !124, i64 64, !124, i64 68, !218, i64 72, !127, i64 80}
!793 = !DILocation(line: 199, column: 42, scope: !547)
!794 = !{!790, !127, i64 72}
!795 = !DILocation(line: 199, column: 39, scope: !547)
!796 = !DILocation(line: 199, column: 18, scope: !547)
!797 = !DILocation(line: 199, column: 11, scope: !547)
!798 = !DILocation(line: 201, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !547, file: !1, line: 201, column: 9)
!800 = !DILocation(line: 201, column: 14, scope: !799)
!801 = !DILocation(line: 201, column: 23, scope: !799)
!802 = !DILocation(line: 201, column: 28, scope: !799)
!803 = !DILocation(line: 201, column: 9, scope: !547)
!804 = !DILocation(line: 202, column: 27, scope: !805)
!805 = distinct !DILexicalBlock(scope: !799, file: !1, line: 201, column: 41)
!806 = !{!807, !127, i64 112}
!807 = !{!"sharedObjectsStruct", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !127, i64 40, !127, i64 48, !127, i64 56, !127, i64 64, !127, i64 72, !127, i64 80, !127, i64 88, !127, i64 96, !127, i64 104, !127, i64 112, !127, i64 120, !127, i64 128, !127, i64 136, !127, i64 144, !127, i64 152, !127, i64 160, !127, i64 168, !127, i64 176, !127, i64 184, !127, i64 192, !127, i64 200, !127, i64 208, !127, i64 216, !127, i64 224, !127, i64 232, !127, i64 240, !127, i64 248, !127, i64 256, !127, i64 264, !127, i64 272, !127, i64 280, !127, i64 288, !127, i64 296, !127, i64 304, !127, i64 312, !127, i64 320, !127, i64 328, !127, i64 336, !127, i64 344, !127, i64 352, !127, i64 360, !125, i64 368, !125, i64 448, !125, i64 80448, !125, i64 80704, !127, i64 80960, !127, i64 80968}
!808 = !DILocation(line: 202, column: 9, scope: !805)
!809 = !DILocation(line: 203, column: 9, scope: !805)
!810 = !DILocation(line: 198, column: 9, scope: !547)
