; ModuleID = '/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp.c'
source_filename = "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/core/tcp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.tcp_listen_pcbs_t = type { %struct.tcp_pcb_listen* }
%struct.tcp_pcb_listen = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8, %struct.tcp_pcb_listen*, i8*, i32, i8, i16, i8 (i8*, %struct.tcp_pcb*, i8)* }
%struct.ip_addr = type { %union.anon, i8 }
%union.anon = type { %struct.ip6_addr }
%struct.ip6_addr = type { [4 x i32], i8 }
%struct.tcp_pcb = type { %struct.ip_addr, %struct.ip_addr, i8, i8, i8, i8, %struct.tcp_pcb*, i8*, i32, i8, i16, i16, i16, i8, i8, i8, i32, i32, i32, i32, i32, i16, i16, i32, i32, i16, i16, i16, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, i32, %struct.tcp_seg*, %struct.tcp_seg*, %struct.tcp_seg*, %struct.pbuf*, %struct.tcp_pcb_listen*, i8 (i8*, %struct.tcp_pcb*, i16)*, i8 (i8*, %struct.tcp_pcb*, %struct.pbuf*, i8)*, i8 (i8*, %struct.tcp_pcb*, i8)*, i8 (i8*, %struct.tcp_pcb*)*, void (i8*, i8)*, i32, i8, i8, i8, i8, i8, i8 }
%struct.tcp_seg = type { %struct.tcp_seg*, %struct.pbuf*, i16, i8, %struct.tcp_hdr* }
%struct.tcp_hdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.pbuf = type { %struct.pbuf*, i8*, i16, i16, i8, i8, i8, i8 }
%struct.uk_thread_status_block = type { i64, i64 }
%struct.uk_swrand = type opaque

!47 = !DIEnumerator(name: "MEMP_MAX", value: 17, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 53, baseType: !50, size: 32, elements: !51)
!49 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/err.h", directory: "/root/.unikraft/apps/redis/build")
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!52 = !DIEnumerator(name: "ERR_OK", value: 0)
!53 = !DIEnumerator(name: "ERR_MEM", value: -1)
!54 = !DIEnumerator(name: "ERR_BUF", value: -2)
!55 = !DIEnumerator(name: "ERR_TIMEOUT", value: -3)
!56 = !DIEnumerator(name: "ERR_RTE", value: -4)
!57 = !DIEnumerator(name: "ERR_INPROGRESS", value: -5)
!58 = !DIEnumerator(name: "ERR_VAL", value: -6)
!59 = !DIEnumerator(name: "ERR_WOULDBLOCK", value: -7)
!60 = !DIEnumerator(name: "ERR_USE", value: -8)
!61 = !DIEnumerator(name: "ERR_ALREADY", value: -9)
!62 = !DIEnumerator(name: "ERR_ISCONN", value: -10)
!63 = !DIEnumerator(name: "ERR_CONN", value: -11)
!64 = !DIEnumerator(name: "ERR_IF", value: -12)
!65 = !DIEnumerator(name: "ERR_ABRT", value: -13)
!66 = !DIEnumerator(name: "ERR_RST", value: -14)
!67 = !DIEnumerator(name: "ERR_CLSD", value: -15)
!68 = !DIEnumerator(name: "ERR_ARG", value: -16)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lwip_ip_addr_type", file: !70, line: 54, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip_addr.h", directory: "/root/.unikraft/apps/redis/build")
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "IPADDR_TYPE_V4", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "IPADDR_TYPE_V6", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "IPADDR_TYPE_ANY", value: 46, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netif_mac_filter_action", file: !76, line: 156, baseType: !7, size: 32, elements: !77)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/netif.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "NETIF_DEL_MAC_FILTER", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "NETIF_ADD_MAC_FILTER", value: 1, isUnsigned: true)
!80 = !{!81, !88, !89, !91, !95, !98, !145, !264, !167, !267, !171, !198, !269, !270, !272, !273}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16_t", file: !82, line: 127, baseType: !83)
!82 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/arch.h", directory: "/root/.unikraft/apps/redis/build")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !84, line: 36, baseType: !85)
!84 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !86, line: 57, baseType: !87)
!86 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpflags_t", file: !90, line: 206, baseType: !81)
!90 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8_t", file: !82, line: 125, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 24, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !86, line: 43, baseType: !94)
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32_t", file: !82, line: 129, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 48, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !86, line: 79, baseType: !7)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb_listen", file: !90, line: 223, size: 704, elements: !100)
!100 = !{!101, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !99, file: !90, line: 225, baseType: !102, size: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_addr_t", file: !70, line: 76, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_addr", file: !70, line: 69, size: 192, elements: !104)
!104 = !{!105, !124}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "u_addr", scope: !103, file: !70, line: 73, baseType: !106, size: 160)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !103, file: !70, line: 70, size: 160, elements: !107)
!107 = !{!108, !118}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !106, file: !70, line: 71, baseType: !109, size: 160)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_addr_t", file: !110, line: 67, baseType: !111)
!110 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip6_addr.h", directory: "/root/.unikraft/apps/redis/build")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_addr", file: !110, line: 59, size: 160, elements: !112)
!112 = !{!113, !117}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !111, file: !110, line: 60, baseType: !114, size: 128)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 4)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !111, file: !110, line: 62, baseType: !91, size: 8, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !106, file: !70, line: 72, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_addr_t", file: !120, line: 57, baseType: !121)
!120 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/ip4_addr.h", directory: "/root/.unikraft/apps/redis/build")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip4_addr", file: !120, line: 51, size: 32, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !121, file: !120, line: 52, baseType: !95, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !70, line: 75, baseType: !91, size: 8, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !99, file: !90, line: 225, baseType: !102, size: 192, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 392)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 400)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !99, file: !90, line: 225, baseType: !91, size: 8, offset: 408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !90, line: 227, baseType: !98, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !99, file: !90, line: 227, baseType: !88, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !90, line: 227, baseType: !5, size: 32, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !99, file: !90, line: 227, baseType: !91, size: 8, offset: 608)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !99, file: !90, line: 227, baseType: !81, size: 16, offset: 624)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !99, file: !90, line: 231, baseType: !136, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_accept_fn", file: !90, line: 70, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !88, !145, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "err_t", file: !49, line: 96, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8_t", file: !82, line: 126, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !84, line: 20, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !86, line: 41, baseType: !144)
!144 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_pcb", file: !90, line: 242, size: 2240, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !231, !232, !233, !234, !235, !240, !245, !247, !252, !257, !258, !259, !260, !261, !262, !263}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !146, file: !90, line: 244, baseType: !102, size: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip", scope: !146, file: !90, line: 244, baseType: !102, size: 192, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "netif_idx", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "so_options", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 392)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 400)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !146, file: !90, line: 244, baseType: !91, size: 8, offset: 408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !90, line: 246, baseType: !145, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !146, file: !90, line: 246, baseType: !88, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !146, file: !90, line: 246, baseType: !5, size: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !146, file: !90, line: 246, baseType: !91, size: 8, offset: 608)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !146, file: !90, line: 246, baseType: !81, size: 16, offset: 624)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !146, file: !90, line: 249, baseType: !81, size: 16, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !90, line: 251, baseType: !89, size: 16, offset: 656)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "polltmr", scope: !146, file: !90, line: 278, baseType: !91, size: 8, offset: 672)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pollinterval", scope: !146, file: !90, line: 278, baseType: !91, size: 8, offset: 680)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "last_timer", scope: !146, file: !90, line: 279, baseType: !91, size: 8, offset: 688)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tmr", scope: !146, file: !90, line: 280, baseType: !95, size: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !146, file: !90, line: 283, baseType: !95, size: 32, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wnd", scope: !146, file: !90, line: 284, baseType: !167, size: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcpwnd_size_t", file: !6, line: 51, baseType: !95)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_wnd", scope: !146, file: !90, line: 285, baseType: !167, size: 32, offset: 800)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ann_right_edge", scope: !146, file: !90, line: 286, baseType: !95, size: 32, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rtime", scope: !146, file: !90, line: 295, baseType: !171, size: 16, offset: 864)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16_t", file: !82, line: 128, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !84, line: 32, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !86, line: 55, baseType: !174)
!174 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !146, file: !90, line: 297, baseType: !81, size: 16, offset: 880)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rttest", scope: !146, file: !90, line: 300, baseType: !95, size: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rtseq", scope: !146, file: !90, line: 301, baseType: !95, size: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !146, file: !90, line: 302, baseType: !171, size: 16, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !146, file: !90, line: 302, baseType: !171, size: 16, offset: 976)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rto", scope: !146, file: !90, line: 304, baseType: !171, size: 16, offset: 992)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nrtx", scope: !146, file: !90, line: 305, baseType: !91, size: 8, offset: 1008)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dupacks", scope: !146, file: !90, line: 308, baseType: !91, size: 8, offset: 1016)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lastack", scope: !146, file: !90, line: 309, baseType: !95, size: 32, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd", scope: !146, file: !90, line: 312, baseType: !167, size: 32, offset: 1056)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !146, file: !90, line: 313, baseType: !167, size: 32, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rto_end", scope: !146, file: !90, line: 316, baseType: !95, size: 32, offset: 1120)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !146, file: !90, line: 319, baseType: !95, size: 32, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl1", scope: !146, file: !90, line: 320, baseType: !95, size: 32, offset: 1184)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl2", scope: !146, file: !90, line: 320, baseType: !95, size: 32, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "snd_lbb", scope: !146, file: !90, line: 322, baseType: !95, size: 32, offset: 1248)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd", scope: !146, file: !90, line: 323, baseType: !167, size: 32, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd_max", scope: !146, file: !90, line: 324, baseType: !167, size: 32, offset: 1312)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "snd_buf", scope: !146, file: !90, line: 326, baseType: !167, size: 32, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "snd_queuelen", scope: !146, file: !90, line: 328, baseType: !81, size: 16, offset: 1376)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "unsent_oversize", scope: !146, file: !90, line: 332, baseType: !81, size: 16, offset: 1392)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !146, file: !90, line: 335, baseType: !167, size: 32, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "unsent", scope: !146, file: !90, line: 338, baseType: !198, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_seg", file: !200, line: 253, size: 256, elements: !201)
!200 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/priv/tcp_priv.h", directory: "/root/.unikraft/apps/redis/build")
!201 = !{!202, !203, !216, !217, !218}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !200, line: 254, baseType: !198, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !199, file: !200, line: 255, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pbuf", file: !206, line: 186, size: 192, elements: !207)
!206 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/pbuf.h", directory: "/root/.unikraft/apps/redis/build")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !206, line: 188, baseType: !204, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !205, file: !206, line: 191, baseType: !88, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !205, file: !206, line: 200, baseType: !81, size: 16, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !205, file: !206, line: 203, baseType: !81, size: 16, offset: 144)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type_internal", scope: !205, file: !206, line: 208, baseType: !91, size: 8, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !206, line: 211, baseType: !91, size: 8, offset: 168)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !205, file: !206, line: 218, baseType: !91, size: 8, offset: 176)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "if_idx", scope: !205, file: !206, line: 221, baseType: !91, size: 8, offset: 184)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !199, file: !200, line: 256, baseType: !81, size: 16, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !199, file: !200, line: 266, baseType: !91, size: 8, offset: 144)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tcphdr", scope: !199, file: !200, line: 273, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_hdr", file: !221, line: 56, size: 160, elements: !222)
!221 = !DIFile(filename: "/root/.unikraft/apps/redis/build/liblwip/origin/lwip-2.1.2/src/include/lwip/prot/tcp.h", directory: "/root/.unikraft/apps/redis/build")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !220, file: !221, line: 57, baseType: !81, size: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !220, file: !221, line: 58, baseType: !81, size: 16, offset: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !220, file: !221, line: 59, baseType: !95, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ackno", scope: !220, file: !221, line: 60, baseType: !95, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_hdrlen_rsvd_flags", scope: !220, file: !221, line: 61, baseType: !81, size: 16, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "wnd", scope: !220, file: !221, line: 62, baseType: !81, size: 16, offset: 112)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !220, file: !221, line: 63, baseType: !81, size: 16, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "urgp", scope: !220, file: !221, line: 64, baseType: !81, size: 16, offset: 144)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "unacked", scope: !146, file: !90, line: 339, baseType: !198, size: 64, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ooseq", scope: !146, file: !90, line: 341, baseType: !198, size: 64, offset: 1600)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "refused_data", scope: !146, file: !90, line: 344, baseType: !204, size: 64, offset: 1664)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !146, file: !90, line: 347, baseType: !98, size: 64, offset: 1728)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !146, file: !90, line: 352, baseType: !236, size: 64, offset: 1792)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_sent_fn", file: !90, line: 96, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!140, !88, !145, !81}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !146, file: !90, line: 354, baseType: !241, size: 64, offset: 1856)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_recv_fn", file: !90, line: 82, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!140, !88, !145, !204, !140}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !146, file: !90, line: 356, baseType: !246, size: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connected_fn", file: !90, line: 134, baseType: !137)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !146, file: !90, line: 358, baseType: !248, size: 64, offset: 1984)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_poll_fn", file: !90, line: 108, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!140, !88, !145}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "errf", scope: !146, file: !90, line: 360, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_err_fn", file: !90, line: 120, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !88, !140}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "keep_idle", scope: !146, file: !90, line: 369, baseType: !95, size: 32, offset: 2112)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "persist_cnt", scope: !146, file: !90, line: 376, baseType: !91, size: 8, offset: 2144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "persist_backoff", scope: !146, file: !90, line: 378, baseType: !91, size: 8, offset: 2152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "persist_probe", scope: !146, file: !90, line: 380, baseType: !91, size: 8, offset: 2160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "keep_cnt_sent", scope: !146, file: !90, line: 383, baseType: !91, size: 8, offset: 2168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "snd_scale", scope: !146, file: !90, line: 386, baseType: !91, size: 8, offset: 2176)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_scale", scope: !146, file: !90, line: 387, baseType: !91, size: 8, offset: 2184)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32_t", file: !82, line: 130, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !84, line: 44, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !86, line: 77, baseType: !50)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!272 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!274 = !{!275, !280, !287, !289, !0, !291, !293, !295, !297, !299, !301, !303, !330, !335, !340, !345}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "tcp_pcb_lists", scope: !2, file: !3, line: 181, type: !277, isLocal: false, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !115)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "iss", scope: !282, file: !3, line: 2221, type: !95, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "tcp_next_iss", scope: !3, file: !3, line: 2215, type: !283, isLocal: false, isDefinition: true, scopeLine: 2216, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{!95, !145}
!285 = !{!286}
!286 = !DILocalVariable(name: "pcb", arg: 1, scope: !282, file: !3, line: 2215, type: !145)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "tcp_ticks", scope: !2, file: !3, line: 162, type: !95, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "tcp_bound_pcbs", scope: !2, file: !3, line: 171, type: !145, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "tcp_active_pcbs", scope: !2, file: !3, line: 176, type: !145, isLocal: false, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "tcp_tw_pcbs", scope: !2, file: !3, line: 178, type: !145, isLocal: false, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "tcp_active_pcbs_changed", scope: !2, file: !3, line: 185, type: !91, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "tcp_timer", scope: !2, file: !3, line: 188, type: !91, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "tcp_timer_ctr", scope: !2, file: !3, line: 189, type: !91, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "tcp_port", scope: !2, file: !3, line: 159, type: !81, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "__str", scope: !305, file: !306, line: 198, type: !327, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "uk_pr_crit", scope: !306, file: !306, line: 194, type: !307, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !312)
!306 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukdebug/include/uk/print.h", directory: "/root/.unikraft/apps/redis/build")
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309, null}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!312 = !{!313, !314}
!313 = !DILocalVariable(name: "fmt", arg: 1, scope: !305, file: !306, line: 194, type: !309)
!314 = !DILocalVariable(name: "argp", scope: !305, file: !306, line: 196, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !316, line: 32, baseType: !317)
!316 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stdarg.h", directory: "/root/.unikraft/apps/redis/build")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 196, baseType: !318)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 192, elements: !325)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 196, size: 192, elements: !320)
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !319, file: !3, line: 196, baseType: !7, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !319, file: !3, line: 196, baseType: !7, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !319, file: !3, line: 196, baseType: !88, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !319, file: !3, line: 196, baseType: !88, size: 64, offset: 128)
!325 = !{!326}
!326 = !DISubrange(count: 1)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 64, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 8)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "__str", scope: !305, file: !306, line: 198, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 48, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 6)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "tcp_persist_backoff", scope: !2, file: !3, line: 166, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 56, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 7)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "tcp_backoff", scope: !2, file: !3, line: 163, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 104, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 13)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "tcp_state_str", scope: !2, file: !3, line: 144, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 704, elements: !349)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!349 = !{!350}
!350 = !DISubrange(count: 11)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tcp_listen_pcbs_t", file: !200, line: 331, size: 64, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "listen_pcbs", scope: !351, file: !200, line: 332, baseType: !98, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pcbs", scope: !351, file: !200, line: 333, baseType: !145, size: 64)
!355 = !{i32 2, !"Dwarf Version", i32 4}
!356 = !{i32 2, !"Debug Info Version", i32 3}
!357 = !{i32 1, !"wchar_size", i32 4}
!358 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!359 = distinct !DISubprogram(name: "tcp_init", scope: !3, file: !3, line: 201, type: !360, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{null}
!362 = !{}
!363 = !DILocation(line: 65, column: 2, scope: !364, inlinedAt: !381)
!364 = distinct !DISubprogram(name: "isolated_rand", scope: !365, file: !365, line: 63, type: !366, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !370)
!365 = !DIFile(filename: "/root/.unikraft/libs/lwip/include/arch/cc.h", directory: "/root/.unikraft/apps/redis/build")
!366 = !DISubroutineType(types: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !369, line: 88, baseType: !7)
!369 = !DIFile(filename: "/root/.unikraft/unikraft/include/uk/arch/types.h", directory: "/root/.unikraft/apps/redis/build")
!370 = !{!371, !372, !378}
!371 = !DILocalVariable(name: "randn", scope: !364, file: !365, line: 65, type: !368)
!372 = !DILocalVariable(name: "tid", scope: !373, file: !365, line: 66, type: !96)
!373 = distinct !DILexicalBlock(scope: !374, file: !365, line: 66, column: 2)
!374 = distinct !DILexicalBlock(scope: !375, file: !365, line: 66, column: 2)
!375 = distinct !DILexicalBlock(scope: !376, file: !365, line: 66, column: 2)
!376 = distinct !DILexicalBlock(scope: !377, file: !365, line: 66, column: 2)
!377 = distinct !DILexicalBlock(scope: !364, file: !365, line: 66, column: 2)
!378 = !DILocalVariable(name: "_ret", scope: !373, file: !365, line: 66, type: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !84, line: 60, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !86, line: 105, baseType: !272)
!381 = distinct !DILocation(line: 204, column: 14, scope: !359)
!382 = !DILocation(line: 120, column: 2, scope: !383, inlinedAt: !389)
!383 = distinct !DISubprogram(name: "ukarch_read_sp", scope: !384, file: !384, line: 116, type: !385, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !387)
!384 = !DIFile(filename: "/root/.unikraft/unikraft/arch/x86/x86_64/include/uk/asm/lcpu.h", directory: "/root/.unikraft/apps/redis/build")
!385 = !DISubroutineType(types: !386)
!386 = !{!272}
!387 = !{!388}
!388 = !DILocalVariable(name: "sp", scope: !383, file: !384, line: 118, type: !272)
!389 = distinct !DILocation(line: 66, column: 2, scope: !376, inlinedAt: !381)
!390 = !{i32 601524}
!391 = !DILocation(line: 118, column: 16, scope: !383, inlinedAt: !389)
!392 = !DILocation(line: 66, column: 2, scope: !376, inlinedAt: !381)
!393 = !DILocation(line: 120, column: 2, scope: !383, inlinedAt: !394)
!394 = distinct !DILocation(line: 66, column: 2, scope: !376, inlinedAt: !381)
!395 = !DILocation(line: 118, column: 16, scope: !383, inlinedAt: !394)
!396 = !DILocation(line: 66, column: 2, scope: !377, inlinedAt: !381)
!397 = !DILocation(line: 65, column: 11, scope: !398, inlinedAt: !403)
!398 = distinct !DISubprogram(name: "uk_swrand_randr", scope: !399, file: !399, line: 60, type: !366, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !400)
!399 = !DIFile(filename: "/root/.unikraft/unikraft/lib/ukswrand/include/uk/swrand.h", directory: "/root/.unikraft/apps/redis/build")
!400 = !{!401, !402}
!401 = !DILocalVariable(name: "iflags", scope: !398, file: !399, line: 62, type: !272)
!402 = !DILocalVariable(name: "ret", scope: !398, file: !399, line: 63, type: !368)
!403 = distinct !DILocation(line: 66, column: 2, scope: !404, inlinedAt: !381)
!404 = distinct !DILexicalBlock(scope: !376, file: !365, line: 66, column: 2)
!405 = !DILocation(line: 62, column: 16, scope: !398, inlinedAt: !403)
!406 = !DILocation(line: 66, column: 8, scope: !398, inlinedAt: !403)
!407 = !DILocation(line: 63, column: 8, scope: !398, inlinedAt: !403)
!408 = !DILocation(line: 67, column: 2, scope: !398, inlinedAt: !403)
!409 = !DILocation(line: 65, column: 8, scope: !364, inlinedAt: !381)
!410 = !DILocation(line: 66, column: 2, scope: !404, inlinedAt: !381)
!411 = !{!412, !412, i64 0}
!412 = !{!"int", !413, i64 0}
!413 = !{!"omnipotent char", !414, i64 0}
!414 = !{!"Simple C/C++ TBAA"}
!415 = !DILocation(line: 120, column: 2, scope: !383, inlinedAt: !416)
!416 = distinct !DILocation(line: 49, column: 21, scope: !417, inlinedAt: !423)
!417 = distinct !DISubprogram(name: "uk_thread_get_tid", scope: !418, file: !418, line: 47, type: !419, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !421)
!418 = !DIFile(filename: "/root/.unikraft/unikraft/lib/flexos-core/include/flexos/impl/intelpku-impl.h", directory: "/root/.unikraft/apps/redis/build")
!419 = !DISubroutineType(types: !420)
!420 = !{!50}
!421 = !{!422}
!422 = !DILocalVariable(name: "sp", scope: !417, file: !418, line: 49, type: !272)
!423 = distinct !DILocation(line: 66, column: 2, scope: !373, inlinedAt: !381)
!424 = !DILocation(line: 118, column: 16, scope: !383, inlinedAt: !416)
!425 = !DILocation(line: 49, column: 16, scope: !417, inlinedAt: !423)
!426 = !DILocation(line: 50, column: 19, scope: !417, inlinedAt: !423)
!427 = !DILocation(line: 50, column: 11, scope: !417, inlinedAt: !423)
!428 = !DILocation(line: 50, column: 9, scope: !417, inlinedAt: !423)
!429 = !DILocation(line: 66, column: 2, scope: !373, inlinedAt: !381)
!430 = !{i32 -2146754758, i32 -2146754745, i32 -2146754720, i32 -2146754696, i32 -2146754671, i32 -2146754596, i32 -2146754571, i32 -2146754427, i32 -2146751334, i32 -2146751245, i32 -2146751124, i32 -2146751029, i32 -2146750928, i32 -2146750901, i32 -2146750818, i32 -2146750729, i32 -2146750608, i32 -2146750508, i32 -2146750402, i32 -2146750294, i32 -2146754144, i32 -2146754091, i32 -2146754060, i32 -2146754029, i32 -2146754008, i32 -2146753986, i32 -2146753937, i32 -2146753916, i32 -2146750211, i32 -2146750122, i32 -2146750001, i32 -2146749902, i32 -2146749796, i32 -2146749694, i32 -2146749661, i32 -2146749588, i32 -2146749520, i32 -2146753614, i32 -2146753555, i32 -2146753502, i32 -2146753471, i32 -2146753440, i32 -2146753419, i32 -2146753397, i32 -2146753348, i32 -2146753327, i32 -2146749469, i32 -2146749380, i32 -2146749259, i32 -2146749160, i32 -2146749054, i32 -2146748952, i32 -2146748919, i32 -2146748836, i32 -2146748747, i32 -2146748626, i32 -2146748526, i32 -2146748500, i32 -2146748397, i32 -2146748371, i32 -2146753069, i32 -2146753002, i32 -2146752977, i32 -2146752913, i32 -2146752831, i32 -2146752808, i32 -2146752783, i32 -2146752758}
!431 = !DILocation(line: 66, column: 2, scope: !432, inlinedAt: !381)
!432 = distinct !DILexicalBlock(scope: !433, file: !365, line: 66, column: 2)
!433 = distinct !DILexicalBlock(scope: !373, file: !365, line: 66, column: 2)
!434 = !{i32 -2146751811, i32 -2146751794}
!435 = !DILocation(line: 67, column: 9, scope: !364, inlinedAt: !381)
!436 = !DILocation(line: 68, column: 1, scope: !364, inlinedAt: !381)
!437 = !DILocation(line: 204, column: 14, scope: !359)
!438 = !DILocation(line: 204, column: 12, scope: !359)
!439 = !{!440, !440, i64 0}
!440 = !{!"short", !413, i64 0}
!441 = !DILocation(line: 206, column: 1, scope: !359)
!442 = distinct !DISubprogram(name: "tcp_free", scope: !3, file: !3, line: 210, type: !443, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !145}
!445 = !{!446}
!446 = !DILocalVariable(name: "pcb", arg: 1, scope: !442, file: !3, line: 210, type: !145)
!447 = !DILocation(line: 210, column: 26, scope: !442)
!448 = !DILocation(line: 212, column: 3, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 212, column: 3)
!450 = distinct !DILexicalBlock(scope: !442, file: !3, line: 212, column: 3)
!451 = !{!452, !413, i64 72}
!452 = !{!"tcp_pcb", !453, i64 0, !453, i64 24, !413, i64 48, !413, i64 49, !413, i64 50, !413, i64 51, !454, i64 56, !454, i64 64, !413, i64 72, !413, i64 76, !440, i64 78, !440, i64 80, !440, i64 82, !413, i64 84, !413, i64 85, !413, i64 86, !412, i64 88, !412, i64 92, !412, i64 96, !412, i64 100, !412, i64 104, !440, i64 108, !440, i64 110, !412, i64 112, !412, i64 116, !440, i64 120, !440, i64 122, !440, i64 124, !413, i64 126, !413, i64 127, !412, i64 128, !412, i64 132, !412, i64 136, !412, i64 140, !412, i64 144, !412, i64 148, !412, i64 152, !412, i64 156, !412, i64 160, !412, i64 164, !412, i64 168, !440, i64 172, !440, i64 174, !412, i64 176, !454, i64 184, !454, i64 192, !454, i64 200, !454, i64 208, !454, i64 216, !454, i64 224, !454, i64 232, !454, i64 240, !454, i64 248, !454, i64 256, !412, i64 264, !413, i64 268, !413, i64 269, !413, i64 270, !413, i64 271, !413, i64 272, !413, i64 273}
!453 = !{!"ip_addr", !413, i64 0, !413, i64 20}
!454 = !{!"any pointer", !413, i64 0}
!455 = !DILocation(line: 212, column: 3, scope: !450)
!456 = !DILocation(line: 212, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !3, line: 212, column: 3)
!458 = distinct !DILexicalBlock(scope: !449, file: !3, line: 212, column: 3)
!459 = !DILocation(line: 212, column: 3, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !3, line: 212, column: 3)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 212, column: 3)
!462 = distinct !DILexicalBlock(scope: !457, file: !3, line: 212, column: 3)
!463 = !DILocation(line: 216, column: 27, scope: !442)
!464 = !DILocation(line: 216, column: 3, scope: !442)
!465 = !DILocation(line: 217, column: 1, scope: !442)
!466 = !DILocation(line: 194, column: 43, scope: !305)
!467 = !DILocation(line: 196, column: 2, scope: !305)
!468 = !DILocation(line: 196, column: 10, scope: !305)
!469 = !DILocation(line: 197, column: 2, scope: !305)
!470 = !DILocation(line: 198, column: 2, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !306, line: 198, column: 2)
!472 = distinct !DILexicalBlock(scope: !305, file: !306, line: 198, column: 2)
!473 = !DILocation(line: 199, column: 2, scope: !305)
!474 = !DILocation(line: 200, column: 1, scope: !305)
!475 = distinct !DISubprogram(name: "tcp_tmr", scope: !3, file: !3, line: 234, type: !360, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !362)
!476 = !DILocation(line: 237, column: 3, scope: !475)
!477 = !DILocation(line: 239, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !3, line: 239, column: 7)
!479 = !{!413, !413, i64 0}
!480 = !DILocation(line: 239, column: 19, scope: !478)
!481 = !DILocation(line: 239, column: 7, scope: !475)
!482 = !DILocation(line: 242, column: 5, scope: !483)
!483 = distinct !DILexicalBlock(scope: !478, file: !3, line: 239, column: 24)
!484 = !DILocation(line: 243, column: 3, scope: !483)
!485 = !DILocation(line: 244, column: 1, scope: !475)
!486 = distinct !DISubprogram(name: "tcp_fasttmr", scope: !3, file: !3, line: 1479, type: !360, isLocal: false, isDefinition: true, scopeLine: 1480, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !487)
!487 = !{!488, !489}
!488 = !DILocalVariable(name: "pcb", scope: !486, file: !3, line: 1481, type: !145)
!489 = !DILocalVariable(name: "next", scope: !490, file: !3, line: 1490, type: !145)
!490 = distinct !DILexicalBlock(scope: !491, file: !3, line: 1489, column: 43)
!491 = distinct !DILexicalBlock(scope: !492, file: !3, line: 1489, column: 9)
!492 = distinct !DILexicalBlock(scope: !486, file: !3, line: 1488, column: 23)
!493 = !DILocation(line: 1483, column: 3, scope: !486)
!494 = !DILocation(line: 1486, column: 9, scope: !486)
!495 = !{!454, !454, i64 0}
!496 = !DILocation(line: 1481, column: 19, scope: !486)
!497 = !DILocation(line: 1488, column: 14, scope: !486)
!498 = !DILocation(line: 1488, column: 3, scope: !486)
!499 = !DILocation(line: 1489, column: 14, scope: !491)
!500 = !{!452, !413, i64 86}
!501 = !DILocation(line: 1489, column: 28, scope: !491)
!502 = !DILocation(line: 1489, column: 25, scope: !491)
!503 = !DILocation(line: 1489, column: 9, scope: !492)
!504 = !DILocation(line: 1491, column: 23, scope: !490)
!505 = !DILocation(line: 1493, column: 16, scope: !506)
!506 = distinct !DILexicalBlock(scope: !490, file: !3, line: 1493, column: 11)
!507 = !{!452, !440, i64 82}
!508 = !DILocation(line: 1493, column: 22, scope: !506)
!509 = !DILocation(line: 1493, column: 11, scope: !490)
!510 = !DILocation(line: 1495, column: 9, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 1495, column: 9)
!512 = distinct !DILexicalBlock(scope: !506, file: !3, line: 1493, column: 38)
!513 = !DILocation(line: 1496, column: 9, scope: !512)
!514 = !DILocation(line: 1497, column: 9, scope: !515)
!515 = distinct !DILexicalBlock(scope: !512, file: !3, line: 1497, column: 9)
!516 = !DILocation(line: 1498, column: 7, scope: !512)
!517 = !DILocation(line: 1500, column: 16, scope: !518)
!518 = distinct !DILexicalBlock(scope: !490, file: !3, line: 1500, column: 11)
!519 = !DILocation(line: 1500, column: 22, scope: !518)
!520 = !DILocation(line: 1500, column: 11, scope: !490)
!521 = !DILocation(line: 1502, column: 9, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !3, line: 1502, column: 9)
!523 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1500, column: 38)
!524 = !DILocation(line: 1503, column: 9, scope: !523)
!525 = !DILocation(line: 1504, column: 7, scope: !523)
!526 = !DILocation(line: 1506, column: 19, scope: !490)
!527 = !{!452, !454, i64 56}
!528 = !DILocation(line: 1490, column: 23, scope: !490)
!529 = !DILocation(line: 1509, column: 16, scope: !530)
!530 = distinct !DILexicalBlock(scope: !490, file: !3, line: 1509, column: 11)
!531 = !{!452, !454, i64 208}
!532 = !DILocation(line: 1509, column: 29, scope: !530)
!533 = !DILocation(line: 1509, column: 11, scope: !490)
!534 = !DILocation(line: 1510, column: 33, scope: !535)
!535 = distinct !DILexicalBlock(scope: !530, file: !3, line: 1509, column: 38)
!536 = !DILocation(line: 1511, column: 9, scope: !535)
!537 = !DILocation(line: 1512, column: 13, scope: !538)
!538 = distinct !DILexicalBlock(scope: !535, file: !3, line: 1512, column: 13)
!539 = !DILocation(line: 1512, column: 13, scope: !535)
!540 = !DILocation(line: 1519, column: 18, scope: !541)
!541 = distinct !DILexicalBlock(scope: !491, file: !3, line: 1518, column: 12)
!542 = !DILocation(line: 0, scope: !541)
!543 = distinct !{!543, !498, !544}
!544 = !DILocation(line: 1521, column: 3, scope: !486)
!545 = !DILocation(line: 1522, column: 1, scope: !486)
!546 = distinct !DISubprogram(name: "tcp_slowtmr", scope: !3, file: !3, line: 1192, type: !360, isLocal: false, isDefinition: true, scopeLine: 1193, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !563, !566, !574, !575, !578, !579, !580, !581}
!548 = !DILocalVariable(name: "pcb", scope: !546, file: !3, line: 1194, type: !145)
!549 = !DILocalVariable(name: "prev", scope: !546, file: !3, line: 1194, type: !145)
!550 = !DILocalVariable(name: "eff_wnd", scope: !546, file: !3, line: 1195, type: !167)
!551 = !DILocalVariable(name: "pcb_remove", scope: !546, file: !3, line: 1196, type: !91)
!552 = !DILocalVariable(name: "pcb_reset", scope: !546, file: !3, line: 1197, type: !91)
!553 = !DILocalVariable(name: "err", scope: !546, file: !3, line: 1198, type: !140)
!554 = !DILocalVariable(name: "backoff_cnt", scope: !555, file: !3, line: 1241, type: !91)
!555 = distinct !DILexicalBlock(scope: !556, file: !3, line: 1240, column: 16)
!556 = distinct !DILexicalBlock(scope: !557, file: !3, line: 1238, column: 13)
!557 = distinct !DILexicalBlock(scope: !558, file: !3, line: 1235, column: 37)
!558 = distinct !DILexicalBlock(scope: !559, file: !3, line: 1235, column: 11)
!559 = distinct !DILexicalBlock(scope: !560, file: !3, line: 1234, column: 12)
!560 = distinct !DILexicalBlock(scope: !561, file: !3, line: 1231, column: 16)
!561 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1228, column: 9)
!562 = distinct !DILexicalBlock(scope: !546, file: !3, line: 1212, column: 23)
!563 = !DILocalVariable(name: "next_slot", scope: !564, file: !3, line: 1246, type: !50)
!564 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1245, column: 48)
!565 = distinct !DILexicalBlock(scope: !555, file: !3, line: 1245, column: 15)
!566 = !DILocalVariable(name: "backoff_idx", scope: !567, file: !3, line: 1287, type: !91)
!567 = distinct !DILexicalBlock(scope: !568, file: !3, line: 1286, column: 41)
!568 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1286, column: 17)
!569 = distinct !DILexicalBlock(scope: !570, file: !3, line: 1283, column: 109)
!570 = distinct !DILexicalBlock(scope: !571, file: !3, line: 1283, column: 15)
!571 = distinct !DILexicalBlock(scope: !572, file: !3, line: 1275, column: 37)
!572 = distinct !DILexicalBlock(scope: !573, file: !3, line: 1275, column: 13)
!573 = distinct !DILexicalBlock(scope: !558, file: !3, line: 1269, column: 14)
!574 = !DILocalVariable(name: "calc_rto", scope: !567, file: !3, line: 1288, type: !50)
!575 = !DILocalVariable(name: "pcb2", scope: !576, file: !3, line: 1380, type: !145)
!576 = distinct !DILexicalBlock(scope: !577, file: !3, line: 1379, column: 21)
!577 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1379, column: 9)
!578 = !DILocalVariable(name: "err_fn", scope: !576, file: !3, line: 1382, type: !253)
!579 = !DILocalVariable(name: "err_arg", scope: !576, file: !3, line: 1384, type: !88)
!580 = !DILocalVariable(name: "last_state", scope: !576, file: !3, line: 1385, type: !5)
!581 = !DILocalVariable(name: "pcb2", scope: !582, file: !3, line: 1451, type: !145)
!582 = distinct !DILexicalBlock(scope: !583, file: !3, line: 1450, column: 21)
!583 = distinct !DILexicalBlock(scope: !584, file: !3, line: 1450, column: 9)
!584 = distinct !DILexicalBlock(scope: !546, file: !3, line: 1440, column: 23)
!585 = !DILocation(line: 1198, column: 9, scope: !546)
!586 = !DILocation(line: 1202, column: 3, scope: !546)
!587 = !DILocation(line: 1203, column: 3, scope: !546)
!588 = !DILocation(line: 1194, column: 25, scope: !546)
!589 = !DILocation(line: 1208, column: 9, scope: !546)
!590 = !DILocation(line: 1194, column: 19, scope: !546)
!591 = !DILocation(line: 1212, column: 14, scope: !546)
!592 = !DILocation(line: 1212, column: 3, scope: !546)
!593 = !DILocation(line: 1214, column: 5, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !3, line: 1214, column: 5)
!595 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1214, column: 5)
!596 = !DILocation(line: 1214, column: 5, scope: !595)
!597 = !DILocation(line: 1214, column: 5, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !3, line: 1214, column: 5)
!599 = distinct !DILexicalBlock(scope: !594, file: !3, line: 1214, column: 5)
!600 = !DILocation(line: 1214, column: 5, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !3, line: 1214, column: 5)
!602 = distinct !DILexicalBlock(scope: !603, file: !3, line: 1214, column: 5)
!603 = distinct !DILexicalBlock(scope: !598, file: !3, line: 1214, column: 5)
!604 = !DILocation(line: 1215, column: 5, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !3, line: 1215, column: 5)
!606 = distinct !DILexicalBlock(scope: !607, file: !3, line: 1215, column: 5)
!607 = distinct !DILexicalBlock(scope: !608, file: !3, line: 1215, column: 5)
!608 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1215, column: 5)
!609 = !DILocation(line: 1215, column: 5, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !3, line: 1215, column: 5)
!611 = distinct !DILexicalBlock(scope: !612, file: !3, line: 1215, column: 5)
!612 = distinct !DILexicalBlock(scope: !605, file: !3, line: 1215, column: 5)
!613 = !DILocation(line: 1216, column: 5, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !3, line: 1216, column: 5)
!615 = distinct !DILexicalBlock(scope: !616, file: !3, line: 1216, column: 5)
!616 = distinct !DILexicalBlock(scope: !617, file: !3, line: 1216, column: 5)
!617 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1216, column: 5)
!618 = !DILocation(line: 1216, column: 5, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !3, line: 1216, column: 5)
!620 = distinct !DILexicalBlock(scope: !621, file: !3, line: 1216, column: 5)
!621 = distinct !DILexicalBlock(scope: !614, file: !3, line: 1216, column: 5)
!622 = !DILocation(line: 1217, column: 14, scope: !623)
!623 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1217, column: 9)
!624 = !DILocation(line: 1217, column: 28, scope: !623)
!625 = !DILocation(line: 1217, column: 25, scope: !623)
!626 = !DILocation(line: 1217, column: 9, scope: !562)
!627 = !DILocation(line: 1220, column: 18, scope: !628)
!628 = distinct !DILexicalBlock(scope: !623, file: !3, line: 1217, column: 43)
!629 = !DILocation(line: 1221, column: 7, scope: !628)
!630 = distinct !{!630, !592, !631}
!631 = !DILocation(line: 1434, column: 3, scope: !546)
!632 = !DILocation(line: 1223, column: 21, scope: !562)
!633 = !DILocation(line: 1196, column: 8, scope: !546)
!634 = !DILocation(line: 1197, column: 8, scope: !546)
!635 = !DILocation(line: 1228, column: 20, scope: !561)
!636 = !DILocation(line: 0, scope: !560)
!637 = !{!452, !413, i64 126}
!638 = !DILocation(line: 1228, column: 32, scope: !561)
!639 = !DILocation(line: 1228, column: 45, scope: !561)
!640 = !DILocation(line: 1228, column: 9, scope: !562)
!641 = !DILocation(line: 1231, column: 26, scope: !560)
!642 = !DILocation(line: 1231, column: 16, scope: !561)
!643 = !DILocation(line: 1235, column: 16, scope: !558)
!644 = !{!452, !413, i64 269}
!645 = !DILocation(line: 1235, column: 11, scope: !558)
!646 = !DILocation(line: 1235, column: 32, scope: !558)
!647 = !DILocation(line: 1235, column: 11, scope: !559)
!648 = !DILocation(line: 1236, column: 9, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 1236, column: 9)
!650 = distinct !DILexicalBlock(scope: !557, file: !3, line: 1236, column: 9)
!651 = !{!452, !454, i64 192}
!652 = !DILocation(line: 1236, column: 9, scope: !650)
!653 = !DILocation(line: 1236, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !3, line: 1236, column: 9)
!655 = distinct !DILexicalBlock(scope: !649, file: !3, line: 1236, column: 9)
!656 = !DILocation(line: 1236, column: 9, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !3, line: 1236, column: 9)
!658 = distinct !DILexicalBlock(scope: !659, file: !3, line: 1236, column: 9)
!659 = distinct !DILexicalBlock(scope: !654, file: !3, line: 1236, column: 9)
!660 = !DILocation(line: 1237, column: 9, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !3, line: 1237, column: 9)
!662 = distinct !DILexicalBlock(scope: !557, file: !3, line: 1237, column: 9)
!663 = !{!452, !454, i64 184}
!664 = !DILocation(line: 1237, column: 9, scope: !662)
!665 = !DILocation(line: 1237, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !667, file: !3, line: 1237, column: 9)
!667 = distinct !DILexicalBlock(scope: !661, file: !3, line: 1237, column: 9)
!668 = !DILocation(line: 1237, column: 9, scope: !669)
!669 = distinct !DILexicalBlock(scope: !670, file: !3, line: 1237, column: 9)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 1237, column: 9)
!671 = distinct !DILexicalBlock(scope: !666, file: !3, line: 1237, column: 9)
!672 = !DILocation(line: 1238, column: 18, scope: !556)
!673 = !{!452, !413, i64 270}
!674 = !DILocation(line: 1238, column: 32, scope: !556)
!675 = !DILocation(line: 1238, column: 13, scope: !557)
!676 = !DILocation(line: 1241, column: 71, scope: !555)
!677 = !DILocation(line: 1241, column: 30, scope: !555)
!678 = !DILocation(line: 1241, column: 16, scope: !555)
!679 = !DILocation(line: 1242, column: 20, scope: !680)
!680 = distinct !DILexicalBlock(scope: !555, file: !3, line: 1242, column: 15)
!681 = !{!452, !413, i64 268}
!682 = !DILocation(line: 1242, column: 32, scope: !680)
!683 = !DILocation(line: 1242, column: 15, scope: !555)
!684 = !DILocation(line: 1243, column: 29, scope: !685)
!685 = distinct !DILexicalBlock(scope: !680, file: !3, line: 1242, column: 47)
!686 = !DILocation(line: 1244, column: 11, scope: !685)
!687 = !DILocation(line: 1245, column: 20, scope: !565)
!688 = !DILocation(line: 1245, column: 32, scope: !565)
!689 = !DILocation(line: 1245, column: 15, scope: !555)
!690 = !DILocation(line: 1246, column: 17, scope: !564)
!691 = !DILocation(line: 1248, column: 22, scope: !692)
!692 = distinct !DILexicalBlock(scope: !564, file: !3, line: 1248, column: 17)
!693 = !{!452, !412, i64 160}
!694 = !DILocation(line: 1248, column: 30, scope: !692)
!695 = !DILocation(line: 1248, column: 17, scope: !564)
!696 = !DILocation(line: 1249, column: 19, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !3, line: 1249, column: 19)
!698 = distinct !DILexicalBlock(scope: !692, file: !3, line: 1248, column: 36)
!699 = !DILocation(line: 1249, column: 46, scope: !697)
!700 = !DILocation(line: 1261, column: 17, scope: !564)
!701 = !DILocation(line: 1254, column: 45, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !3, line: 1254, column: 19)
!703 = distinct !DILexicalBlock(scope: !692, file: !3, line: 1253, column: 20)
!704 = !DILocation(line: 1254, column: 19, scope: !702)
!705 = !DILocation(line: 1254, column: 66, scope: !702)
!706 = !DILocation(line: 1254, column: 19, scope: !703)
!707 = !DILocation(line: 1255, column: 21, scope: !708)
!708 = distinct !DILexicalBlock(scope: !709, file: !3, line: 1255, column: 21)
!709 = distinct !DILexicalBlock(scope: !702, file: !3, line: 1254, column: 77)
!710 = !DILocation(line: 1255, column: 37, scope: !708)
!711 = !DILocation(line: 1262, column: 32, scope: !712)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 1261, column: 28)
!713 = distinct !DILexicalBlock(scope: !564, file: !3, line: 1261, column: 17)
!714 = !DILocation(line: 1263, column: 24, scope: !715)
!715 = distinct !DILexicalBlock(scope: !712, file: !3, line: 1263, column: 19)
!716 = !DILocation(line: 1263, column: 40, scope: !715)
!717 = !DILocation(line: 1263, column: 19, scope: !712)
!718 = !DILocation(line: 1264, column: 37, scope: !719)
!719 = distinct !DILexicalBlock(scope: !715, file: !3, line: 1263, column: 71)
!720 = !DILocation(line: 1265, column: 15, scope: !719)
!721 = !DILocation(line: 1271, column: 19, scope: !722)
!722 = distinct !DILexicalBlock(scope: !573, file: !3, line: 1271, column: 13)
!723 = !{!452, !440, i64 108}
!724 = !DILocation(line: 1271, column: 25, scope: !722)
!725 = !DILocation(line: 1271, column: 46, scope: !722)
!726 = !DILocation(line: 1271, column: 31, scope: !722)
!727 = !DILocation(line: 1272, column: 11, scope: !728)
!728 = distinct !DILexicalBlock(scope: !722, file: !3, line: 1271, column: 57)
!729 = !DILocation(line: 1273, column: 9, scope: !728)
!730 = !DILocation(line: 1275, column: 18, scope: !572)
!731 = !DILocation(line: 1275, column: 32, scope: !572)
!732 = !{!452, !440, i64 124}
!733 = !DILocation(line: 1275, column: 24, scope: !572)
!734 = !DILocation(line: 1275, column: 13, scope: !573)
!735 = !DILocation(line: 1283, column: 16, scope: !570)
!736 = !DILocation(line: 1283, column: 44, scope: !570)
!737 = !DILocation(line: 1283, column: 55, scope: !570)
!738 = !DILocation(line: 1283, column: 65, scope: !570)
!739 = !DILocation(line: 1283, column: 73, scope: !570)
!740 = !DILocation(line: 1283, column: 82, scope: !570)
!741 = !DILocation(line: 1283, column: 91, scope: !570)
!742 = !DILocation(line: 1283, column: 98, scope: !570)
!743 = !DILocation(line: 1283, column: 15, scope: !571)
!744 = !DILocation(line: 1286, column: 22, scope: !568)
!745 = !DILocation(line: 1286, column: 28, scope: !568)
!746 = !DILocation(line: 1286, column: 17, scope: !569)
!747 = !DILocation(line: 1287, column: 34, scope: !567)
!748 = !DILocation(line: 1287, column: 20, scope: !567)
!749 = !DILocation(line: 1288, column: 37, scope: !567)
!750 = !{!452, !440, i64 120}
!751 = !DILocation(line: 1288, column: 40, scope: !567)
!752 = !DILocation(line: 1288, column: 53, scope: !567)
!753 = !{!452, !440, i64 122}
!754 = !DILocation(line: 1288, column: 48, scope: !567)
!755 = !DILocation(line: 1288, column: 46, scope: !567)
!756 = !DILocation(line: 1288, column: 60, scope: !567)
!757 = !DILocation(line: 1288, column: 57, scope: !567)
!758 = !DILocation(line: 1288, column: 19, scope: !567)
!759 = !DILocation(line: 1289, column: 33, scope: !567)
!760 = !DILocation(line: 1289, column: 26, scope: !567)
!761 = !DILocation(line: 1289, column: 24, scope: !567)
!762 = !DILocation(line: 1290, column: 13, scope: !567)
!763 = !DILocation(line: 1293, column: 24, scope: !569)
!764 = !DILocation(line: 1296, column: 23, scope: !569)
!765 = !{!452, !412, i64 132}
!766 = !DILocation(line: 1195, column: 17, scope: !546)
!767 = !DILocation(line: 1297, column: 37, scope: !569)
!768 = !DILocation(line: 1297, column: 18, scope: !569)
!769 = !DILocation(line: 1298, column: 54, scope: !770)
!770 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1298, column: 17)
!771 = !{!452, !440, i64 110}
!772 = !DILocation(line: 1298, column: 49, scope: !770)
!773 = !DILocation(line: 1298, column: 58, scope: !770)
!774 = !DILocation(line: 1298, column: 31, scope: !770)
!775 = !DILocation(line: 1298, column: 17, scope: !569)
!776 = !DILocation(line: 0, scope: !777)
!777 = distinct !DILexicalBlock(scope: !770, file: !3, line: 1298, column: 65)
!778 = !DILocation(line: 1301, column: 23, scope: !569)
!779 = !DILocation(line: 1305, column: 18, scope: !569)
!780 = !DILocation(line: 1305, column: 30, scope: !569)
!781 = !{!452, !412, i64 176}
!782 = !DILocation(line: 1309, column: 13, scope: !569)
!783 = !DILocation(line: 1310, column: 11, scope: !569)
!784 = !DILocation(line: 0, scope: !562)
!785 = !DILocation(line: 1315, column: 14, scope: !786)
!786 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1315, column: 9)
!787 = !DILocation(line: 1315, column: 20, scope: !786)
!788 = !DILocation(line: 1315, column: 9, scope: !562)
!789 = !DILocation(line: 1317, column: 16, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 1317, column: 11)
!791 = distinct !DILexicalBlock(scope: !786, file: !3, line: 1315, column: 35)
!792 = !DILocation(line: 1317, column: 22, scope: !790)
!793 = !DILocation(line: 1317, column: 11, scope: !791)
!794 = !DILocation(line: 1320, column: 21, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 1320, column: 13)
!796 = distinct !DILexicalBlock(scope: !790, file: !3, line: 1317, column: 37)
!797 = !DILocation(line: 1320, column: 38, scope: !795)
!798 = !{!452, !412, i64 88}
!799 = !DILocation(line: 1320, column: 31, scope: !795)
!800 = !DILocation(line: 1320, column: 43, scope: !795)
!801 = !DILocation(line: 1320, column: 13, scope: !796)
!802 = !DILocation(line: 0, scope: !803)
!803 = distinct !DILexicalBlock(scope: !561, file: !3, line: 1228, column: 63)
!804 = !DILocation(line: 1329, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1329, column: 9)
!806 = !{!452, !413, i64 49}
!807 = !DILocation(line: 1329, column: 43, scope: !805)
!808 = !DILocation(line: 1330, column: 38, scope: !805)
!809 = !DILocation(line: 1332, column: 19, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 1332, column: 11)
!811 = distinct !DILexicalBlock(scope: !805, file: !3, line: 1331, column: 39)
!812 = !DILocation(line: 1332, column: 36, scope: !810)
!813 = !DILocation(line: 1332, column: 29, scope: !810)
!814 = !DILocation(line: 1332, column: 11, scope: !810)
!815 = !DILocation(line: 1333, column: 17, scope: !810)
!816 = !{!452, !412, i64 264}
!817 = !DILocation(line: 1333, column: 12, scope: !810)
!818 = !DILocation(line: 1333, column: 27, scope: !810)
!819 = !DILocation(line: 1333, column: 48, scope: !810)
!820 = !DILocation(line: 1332, column: 41, scope: !810)
!821 = !DILocation(line: 1332, column: 11, scope: !811)
!822 = !DILocation(line: 1338, column: 9, scope: !823)
!823 = distinct !DILexicalBlock(scope: !810, file: !3, line: 1333, column: 69)
!824 = !DILocation(line: 1340, column: 7, scope: !823)
!825 = !DILocation(line: 1341, column: 41, scope: !826)
!826 = distinct !DILexicalBlock(scope: !810, file: !3, line: 1340, column: 18)
!827 = !{!452, !413, i64 271}
!828 = !DILocation(line: 1341, column: 36, scope: !826)
!829 = !DILocation(line: 1341, column: 55, scope: !826)
!830 = !DILocation(line: 1341, column: 34, scope: !826)
!831 = !DILocation(line: 1342, column: 18, scope: !826)
!832 = !DILocation(line: 1340, column: 48, scope: !826)
!833 = !DILocation(line: 1340, column: 18, scope: !810)
!834 = !DILocation(line: 1343, column: 15, scope: !835)
!835 = distinct !DILexicalBlock(scope: !826, file: !3, line: 1342, column: 39)
!836 = !DILocation(line: 1344, column: 17, scope: !837)
!837 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1344, column: 13)
!838 = !DILocation(line: 1344, column: 13, scope: !835)
!839 = !DILocation(line: 1345, column: 29, scope: !840)
!840 = distinct !DILexicalBlock(scope: !837, file: !3, line: 1344, column: 28)
!841 = !DILocation(line: 1346, column: 9, scope: !840)
!842 = !DILocation(line: 0, scope: !843)
!843 = distinct !DILexicalBlock(scope: !795, file: !3, line: 1321, column: 55)
!844 = !DILocation(line: 1354, column: 14, scope: !845)
!845 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1354, column: 9)
!846 = !{!452, !454, i64 200}
!847 = !DILocation(line: 1354, column: 20, scope: !845)
!848 = !DILocation(line: 1354, column: 28, scope: !845)
!849 = !DILocation(line: 1355, column: 10, scope: !845)
!850 = !DILocation(line: 1355, column: 27, scope: !845)
!851 = !DILocation(line: 1355, column: 20, scope: !845)
!852 = !DILocation(line: 1355, column: 46, scope: !845)
!853 = !DILocation(line: 1355, column: 34, scope: !845)
!854 = !DILocation(line: 1355, column: 50, scope: !845)
!855 = !DILocation(line: 1355, column: 31, scope: !845)
!856 = !DILocation(line: 1354, column: 9, scope: !562)
!857 = !DILocalVariable(name: "seg", arg: 1, scope: !858, file: !3, line: 1608, type: !198)
!858 = distinct !DISubprogram(name: "tcp_segs_free", scope: !3, file: !3, line: 1608, type: !859, isLocal: false, isDefinition: true, scopeLine: 1609, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !198}
!861 = !{!857, !862}
!862 = !DILocalVariable(name: "next", scope: !863, file: !3, line: 1611, type: !198)
!863 = distinct !DILexicalBlock(scope: !858, file: !3, line: 1610, column: 23)
!864 = !DILocation(line: 1608, column: 31, scope: !858, inlinedAt: !865)
!865 = distinct !DILocation(line: 2389, column: 5, scope: !866, inlinedAt: !871)
!866 = distinct !DILexicalBlock(scope: !867, file: !3, line: 2388, column: 19)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 2388, column: 7)
!868 = distinct !DISubprogram(name: "tcp_free_ooseq", scope: !3, file: !3, line: 2386, type: !443, isLocal: false, isDefinition: true, scopeLine: 2387, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !869)
!869 = !{!870}
!870 = !DILocalVariable(name: "pcb", arg: 1, scope: !868, file: !3, line: 2386, type: !145)
!871 = distinct !DILocation(line: 1357, column: 7, scope: !872)
!872 = distinct !DILexicalBlock(scope: !845, file: !3, line: 1355, column: 72)
!873 = !DILocation(line: 1611, column: 33, scope: !863, inlinedAt: !865)
!874 = !{!875, !454, i64 0}
!875 = !{!"tcp_seg", !454, i64 0, !454, i64 8, !440, i64 16, !413, i64 18, !454, i64 24}
!876 = !DILocation(line: 1611, column: 21, scope: !863, inlinedAt: !865)
!877 = !DILocalVariable(name: "seg", arg: 1, scope: !878, file: !3, line: 1623, type: !198)
!878 = distinct !DISubprogram(name: "tcp_seg_free", scope: !3, file: !3, line: 1623, type: !859, isLocal: false, isDefinition: true, scopeLine: 1624, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !879)
!879 = !{!877}
!880 = !DILocation(line: 1623, column: 30, scope: !878, inlinedAt: !881)
!881 = distinct !DILocation(line: 1612, column: 5, scope: !863, inlinedAt: !865)
!882 = !DILocation(line: 1626, column: 14, scope: !883, inlinedAt: !881)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 1626, column: 9)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1625, column: 20)
!885 = distinct !DILexicalBlock(scope: !878, file: !3, line: 1625, column: 7)
!886 = !{!875, !454, i64 8}
!887 = !DILocation(line: 1626, column: 16, scope: !883, inlinedAt: !881)
!888 = !DILocation(line: 1626, column: 9, scope: !884, inlinedAt: !881)
!889 = !DILocation(line: 1627, column: 7, scope: !890, inlinedAt: !881)
!890 = distinct !DILexicalBlock(scope: !883, file: !3, line: 1626, column: 25)
!891 = !DILocation(line: 1631, column: 5, scope: !890, inlinedAt: !881)
!892 = !DILocation(line: 1632, column: 29, scope: !884, inlinedAt: !881)
!893 = !DILocation(line: 1632, column: 5, scope: !884, inlinedAt: !881)
!894 = !DILocation(line: 1610, column: 14, scope: !858, inlinedAt: !865)
!895 = !DILocation(line: 1610, column: 3, scope: !858, inlinedAt: !865)
!896 = distinct !{!896, !897, !898}
!897 = !DILocation(line: 1610, column: 3, scope: !858)
!898 = !DILocation(line: 1614, column: 3, scope: !858)
!899 = !DILocation(line: 2390, column: 16, scope: !866, inlinedAt: !871)
!900 = !DILocation(line: 1358, column: 5, scope: !872)
!901 = !DILocation(line: 1362, column: 14, scope: !902)
!902 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1362, column: 9)
!903 = !DILocation(line: 1362, column: 9, scope: !562)
!904 = !DILocation(line: 1372, column: 11, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 1371, column: 33)
!906 = distinct !DILexicalBlock(scope: !562, file: !3, line: 1371, column: 9)
!907 = !DILocation(line: 0, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !3, line: 1372, column: 11)
!909 = !DILocation(line: 0, scope: !905)
!910 = !DILocation(line: 1379, column: 9, scope: !577)
!911 = !DILocation(line: 0, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 1364, column: 53)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 1363, column: 11)
!914 = distinct !DILexicalBlock(scope: !902, file: !3, line: 1362, column: 33)
!915 = !DILocation(line: 1379, column: 9, scope: !562)
!916 = !DILocation(line: 1382, column: 32, scope: !576)
!917 = !{!452, !454, i64 256}
!918 = !DILocation(line: 1382, column: 18, scope: !576)
!919 = !DILocation(line: 1386, column: 7, scope: !576)
!920 = !DILocation(line: 1388, column: 16, scope: !921)
!921 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1388, column: 11)
!922 = !DILocation(line: 0, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 1389, column: 9)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 1389, column: 9)
!925 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1388, column: 25)
!926 = !DILocation(line: 1388, column: 11, scope: !576)
!927 = !DILocation(line: 1389, column: 9, scope: !923)
!928 = !DILocation(line: 1389, column: 9, scope: !924)
!929 = !DILocation(line: 1389, column: 9, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 1389, column: 9)
!931 = distinct !DILexicalBlock(scope: !923, file: !3, line: 1389, column: 9)
!932 = !DILocation(line: 1389, column: 9, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !3, line: 1389, column: 9)
!934 = distinct !DILexicalBlock(scope: !935, file: !3, line: 1389, column: 9)
!935 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1389, column: 9)
!936 = !DILocation(line: 1390, column: 27, scope: !925)
!937 = !DILocation(line: 1390, column: 15, scope: !925)
!938 = !DILocation(line: 1390, column: 20, scope: !925)
!939 = !DILocation(line: 1391, column: 7, scope: !925)
!940 = !DILocation(line: 1393, column: 9, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 1393, column: 9)
!942 = distinct !DILexicalBlock(scope: !943, file: !3, line: 1393, column: 9)
!943 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1391, column: 14)
!944 = !DILocation(line: 1393, column: 9, scope: !942)
!945 = !DILocation(line: 1393, column: 9, scope: !946)
!946 = distinct !DILexicalBlock(scope: !947, file: !3, line: 1393, column: 9)
!947 = distinct !DILexicalBlock(scope: !941, file: !3, line: 1393, column: 9)
!948 = !DILocation(line: 1393, column: 9, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !3, line: 1393, column: 9)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 1393, column: 9)
!951 = distinct !DILexicalBlock(scope: !946, file: !3, line: 1393, column: 9)
!952 = !DILocation(line: 1394, column: 32, scope: !943)
!953 = !DILocation(line: 1394, column: 25, scope: !943)
!954 = !DILocation(line: 1397, column: 11, scope: !955)
!955 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1397, column: 11)
!956 = !DILocation(line: 1397, column: 11, scope: !576)
!957 = !DILocation(line: 1398, column: 27, scope: !958)
!958 = distinct !DILexicalBlock(scope: !955, file: !3, line: 1397, column: 22)
!959 = !{!452, !412, i64 144}
!960 = !DILocation(line: 1398, column: 41, scope: !958)
!961 = !{!452, !412, i64 92}
!962 = !DILocation(line: 1398, column: 56, scope: !958)
!963 = !DILocation(line: 1398, column: 72, scope: !958)
!964 = !DILocation(line: 1399, column: 22, scope: !958)
!965 = !{!452, !440, i64 78}
!966 = !DILocation(line: 1399, column: 39, scope: !958)
!967 = !{!452, !440, i64 80}
!968 = !DILocation(line: 1398, column: 9, scope: !958)
!969 = !DILocation(line: 1400, column: 7, scope: !958)
!970 = !DILocation(line: 1402, column: 22, scope: !576)
!971 = !{!452, !454, i64 64}
!972 = !DILocation(line: 1384, column: 13, scope: !576)
!973 = !DILocation(line: 1385, column: 22, scope: !576)
!974 = !DILocation(line: 1380, column: 23, scope: !576)
!975 = !DILocation(line: 1405, column: 18, scope: !576)
!976 = !DILocation(line: 210, column: 26, scope: !442, inlinedAt: !977)
!977 = distinct !DILocation(line: 1406, column: 7, scope: !576)
!978 = !DILocation(line: 212, column: 3, scope: !449, inlinedAt: !977)
!979 = !DILocation(line: 212, column: 3, scope: !450, inlinedAt: !977)
!980 = !DILocation(line: 212, column: 3, scope: !457, inlinedAt: !977)
!981 = !DILocation(line: 212, column: 3, scope: !460, inlinedAt: !977)
!982 = !DILocation(line: 216, column: 27, scope: !442, inlinedAt: !977)
!983 = !DILocation(line: 216, column: 3, scope: !442, inlinedAt: !977)
!984 = !DILocation(line: 1408, column: 31, scope: !576)
!985 = !DILocation(line: 1409, column: 7, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 1409, column: 7)
!987 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1409, column: 7)
!988 = !DILocation(line: 1409, column: 7, scope: !987)
!989 = !DILocation(line: 1410, column: 11, scope: !990)
!990 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1410, column: 11)
!991 = !DILocation(line: 1416, column: 18, scope: !992)
!992 = distinct !DILexicalBlock(scope: !577, file: !3, line: 1413, column: 12)
!993 = !DILocation(line: 1419, column: 15, scope: !992)
!994 = !DILocation(line: 1419, column: 7, scope: !992)
!995 = !{!452, !413, i64 84}
!996 = !DILocation(line: 1420, column: 34, scope: !997)
!997 = distinct !DILexicalBlock(scope: !992, file: !3, line: 1420, column: 11)
!998 = !{!452, !413, i64 85}
!999 = !DILocation(line: 1420, column: 25, scope: !997)
!1000 = !DILocation(line: 1420, column: 11, scope: !992)
!1001 = !DILocation(line: 1421, column: 23, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !997, file: !3, line: 1420, column: 48)
!1003 = !DILocation(line: 1423, column: 33, scope: !1002)
!1004 = !DILocation(line: 1424, column: 9, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1424, column: 9)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1424, column: 9)
!1007 = !{!452, !454, i64 248}
!1008 = !DILocation(line: 1424, column: 9, scope: !1006)
!1009 = !DILocation(line: 1425, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1425, column: 13)
!1011 = !DILocation(line: 1425, column: 13, scope: !1002)
!1012 = !DILocation(line: 1429, column: 17, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1429, column: 13)
!1014 = !DILocation(line: 1429, column: 13, scope: !1002)
!1015 = !DILocation(line: 1430, column: 11, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 1429, column: 28)
!1017 = !DILocation(line: 1431, column: 9, scope: !1016)
!1018 = !DILocation(line: 1439, column: 9, scope: !546)
!1019 = !DILocation(line: 1440, column: 14, scope: !546)
!1020 = !DILocation(line: 1440, column: 3, scope: !546)
!1021 = !DILocation(line: 0, scope: !582)
!1022 = !DILocation(line: 1441, column: 5, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1441, column: 5)
!1024 = distinct !DILexicalBlock(scope: !584, file: !3, line: 1441, column: 5)
!1025 = !DILocation(line: 1441, column: 5, scope: !1024)
!1026 = !DILocation(line: 1441, column: 5, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1441, column: 5)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1441, column: 5)
!1029 = !DILocation(line: 1441, column: 5, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1441, column: 5)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1441, column: 5)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 1441, column: 5)
!1033 = !DILocation(line: 1445, column: 17, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !584, file: !3, line: 1445, column: 9)
!1035 = !DILocation(line: 1445, column: 34, scope: !1034)
!1036 = !DILocation(line: 1445, column: 27, scope: !1034)
!1037 = !DILocation(line: 1445, column: 39, scope: !1034)
!1038 = !DILocation(line: 1450, column: 9, scope: !584)
!1039 = !DILocation(line: 1452, column: 7, scope: !582)
!1040 = !DILocation(line: 1454, column: 16, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !582, file: !3, line: 1454, column: 11)
!1042 = !DILocation(line: 0, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 1455, column: 9)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 1455, column: 9)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 1454, column: 25)
!1046 = !DILocation(line: 1454, column: 11, scope: !582)
!1047 = !DILocation(line: 1455, column: 9, scope: !1043)
!1048 = !DILocation(line: 1455, column: 9, scope: !1044)
!1049 = !DILocation(line: 1455, column: 9, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 1455, column: 9)
!1051 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 1455, column: 9)
!1052 = !DILocation(line: 1455, column: 9, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1455, column: 9)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 1455, column: 9)
!1055 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 1455, column: 9)
!1056 = !DILocation(line: 1456, column: 27, scope: !1045)
!1057 = !DILocation(line: 1456, column: 15, scope: !1045)
!1058 = !DILocation(line: 1456, column: 20, scope: !1045)
!1059 = !DILocation(line: 1457, column: 7, scope: !1045)
!1060 = !DILocation(line: 1459, column: 9, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 1459, column: 9)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 1459, column: 9)
!1063 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 1457, column: 14)
!1064 = !DILocation(line: 1459, column: 9, scope: !1062)
!1065 = !DILocation(line: 1459, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 1459, column: 9)
!1067 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1459, column: 9)
!1068 = !DILocation(line: 1459, column: 9, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 1459, column: 9)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 1459, column: 9)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 1459, column: 9)
!1072 = !DILocation(line: 1460, column: 28, scope: !1063)
!1073 = !DILocation(line: 1460, column: 21, scope: !1063)
!1074 = !DILocation(line: 1451, column: 23, scope: !582)
!1075 = !DILocation(line: 210, column: 26, scope: !442, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 1464, column: 7, scope: !582)
!1077 = !DILocation(line: 212, column: 3, scope: !449, inlinedAt: !1076)
!1078 = !DILocation(line: 212, column: 3, scope: !450, inlinedAt: !1076)
!1079 = !DILocation(line: 212, column: 3, scope: !457, inlinedAt: !1076)
!1080 = !DILocation(line: 212, column: 3, scope: !460, inlinedAt: !1076)
!1081 = !DILocation(line: 1463, column: 18, scope: !582)
!1082 = !DILocation(line: 216, column: 3, scope: !442, inlinedAt: !1076)
!1083 = !DILocation(line: 1465, column: 5, scope: !582)
!1084 = !DILocation(line: 1467, column: 18, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !583, file: !3, line: 1465, column: 12)
!1086 = !DILocation(line: 0, scope: !1085)
!1087 = distinct !{!1087, !1020, !1088}
!1088 = !DILocation(line: 1469, column: 3, scope: !546)
!1089 = !DILocation(line: 1470, column: 1, scope: !546)
!1090 = distinct !DISubprogram(name: "tcp_close", scope: !3, file: !3, line: 484, type: !1091, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1093)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!140, !145}
!1093 = !{!1094}
!1094 = !DILocalVariable(name: "pcb", arg: 1, scope: !1090, file: !3, line: 484, type: !145)
!1095 = !DILocation(line: 484, column: 27, scope: !1090)
!1096 = !DILocation(line: 488, column: 3, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 488, column: 3)
!1098 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 488, column: 3)
!1099 = !DILocation(line: 488, column: 3, scope: !1098)
!1100 = !DILocation(line: 488, column: 3, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 488, column: 3)
!1102 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 488, column: 3)
!1103 = !DILocation(line: 488, column: 3, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 488, column: 3)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 488, column: 3)
!1106 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 488, column: 3)
!1107 = !DILocation(line: 493, column: 12, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 493, column: 7)
!1109 = !DILocation(line: 493, column: 18, scope: !1108)
!1110 = !DILocation(line: 493, column: 7, scope: !1090)
!1111 = !DILocation(line: 495, column: 5, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 495, column: 5)
!1113 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 493, column: 29)
!1114 = !DILocation(line: 496, column: 3, scope: !1113)
!1115 = !DILocation(line: 498, column: 10, scope: !1090)
!1116 = !DILocation(line: 499, column: 1, scope: !1090)
!1117 = distinct !DISubprogram(name: "tcp_close_shutdown", scope: !3, file: !3, line: 348, type: !1118, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!140, !145, !91}
!1120 = !{!1121, !1122, !1123, !1132}
!1121 = !DILocalVariable(name: "pcb", arg: 1, scope: !1117, file: !3, line: 348, type: !145)
!1122 = !DILocalVariable(name: "rst_on_unacked_data", arg: 2, scope: !1117, file: !3, line: 348, type: !91)
!1123 = !DILocalVariable(name: "tcp_tmp_pcb", scope: !1124, file: !3, line: 364, type: !145)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 364, column: 7)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 364, column: 7)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 364, column: 7)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 364, column: 7)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 353, column: 76)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 353, column: 9)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 352, column: 91)
!1131 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 352, column: 7)
!1132 = !DILocalVariable(name: "tcp_tmp_pcb", scope: !1133, file: !3, line: 388, type: !145)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 388, column: 9)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 388, column: 9)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 388, column: 9)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 387, column: 33)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 387, column: 11)
!1138 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 378, column: 23)
!1139 = !DILocation(line: 348, column: 36, scope: !1117)
!1140 = !DILocation(line: 348, column: 46, scope: !1117)
!1141 = !DILocation(line: 350, column: 3, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 350, column: 3)
!1143 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 350, column: 3)
!1144 = !DILocation(line: 350, column: 3, scope: !1143)
!1145 = !DILocation(line: 350, column: 3, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 350, column: 3)
!1147 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 350, column: 3)
!1148 = !DILocation(line: 350, column: 3, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 350, column: 3)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 350, column: 3)
!1151 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 350, column: 3)
!1152 = !DILocation(line: 352, column: 7, scope: !1131)
!1153 = !DILocation(line: 0, scope: !1131)
!1154 = !DILocation(line: 352, column: 27, scope: !1131)
!1155 = !DILocation(line: 352, column: 59, scope: !1131)
!1156 = !DILocation(line: 353, column: 15, scope: !1129)
!1157 = !DILocation(line: 353, column: 28, scope: !1129)
!1158 = !DILocation(line: 353, column: 37, scope: !1129)
!1159 = !DILocation(line: 356, column: 7, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 356, column: 7)
!1161 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 356, column: 7)
!1162 = !DILocation(line: 353, column: 46, scope: !1129)
!1163 = !{!452, !412, i64 96}
!1164 = !DILocation(line: 353, column: 57, scope: !1129)
!1165 = !DILocation(line: 353, column: 54, scope: !1129)
!1166 = !DILocation(line: 353, column: 9, scope: !1130)
!1167 = !DILocation(line: 356, column: 7, scope: !1161)
!1168 = !DILocation(line: 356, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 356, column: 7)
!1170 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 356, column: 7)
!1171 = !DILocation(line: 356, column: 7, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 356, column: 7)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 356, column: 7)
!1174 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 356, column: 7)
!1175 = !DILocation(line: 360, column: 25, scope: !1128)
!1176 = !DILocation(line: 360, column: 39, scope: !1128)
!1177 = !DILocation(line: 360, column: 54, scope: !1128)
!1178 = !DILocation(line: 360, column: 70, scope: !1128)
!1179 = !DILocation(line: 361, column: 20, scope: !1128)
!1180 = !DILocation(line: 361, column: 37, scope: !1128)
!1181 = !DILocation(line: 360, column: 7, scope: !1128)
!1182 = !DILocation(line: 363, column: 7, scope: !1128)
!1183 = !DILocation(line: 364, column: 7, scope: !1125)
!1184 = !DILocation(line: 364, column: 7, scope: !1126)
!1185 = !DILocation(line: 364, column: 7, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 364, column: 7)
!1187 = !DILocation(line: 364, column: 7, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 364, column: 7)
!1189 = !DILocation(line: 364, column: 7, scope: !1124)
!1190 = !DILocation(line: 364, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 364, column: 7)
!1192 = !DILocation(line: 364, column: 7, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 364, column: 7)
!1194 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 364, column: 7)
!1195 = !DILocation(line: 364, column: 7, scope: !1194)
!1196 = distinct !{!1196, !1187, !1187}
!1197 = !DILocation(line: 364, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 364, column: 7)
!1199 = !DILocation(line: 364, column: 7, scope: !1127)
!1200 = !DILocation(line: 366, column: 11, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 366, column: 11)
!1202 = !DILocation(line: 366, column: 25, scope: !1201)
!1203 = !DILocation(line: 366, column: 11, scope: !1128)
!1204 = !DILocation(line: 368, column: 9, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 366, column: 33)
!1206 = !DILocation(line: 369, column: 7, scope: !1205)
!1207 = !DILocation(line: 210, column: 26, scope: !442, inlinedAt: !1208)
!1208 = distinct !DILocation(line: 370, column: 9, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 369, column: 14)
!1210 = !DILocation(line: 212, column: 3, scope: !449, inlinedAt: !1208)
!1211 = !DILocation(line: 212, column: 3, scope: !450, inlinedAt: !1208)
!1212 = !DILocation(line: 212, column: 3, scope: !457, inlinedAt: !1208)
!1213 = !DILocation(line: 212, column: 3, scope: !460, inlinedAt: !1208)
!1214 = !DILocation(line: 216, column: 27, scope: !442, inlinedAt: !1208)
!1215 = !DILocation(line: 216, column: 3, scope: !442, inlinedAt: !1208)
!1216 = !DILocation(line: 378, column: 3, scope: !1117)
!1217 = !DILocation(line: 387, column: 16, scope: !1137)
!1218 = !DILocation(line: 387, column: 27, scope: !1137)
!1219 = !DILocation(line: 387, column: 11, scope: !1138)
!1220 = !DILocation(line: 388, column: 9, scope: !1134)
!1221 = !DILocation(line: 388, column: 9, scope: !1135)
!1222 = !DILocation(line: 388, column: 9, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 388, column: 9)
!1224 = !DILocation(line: 210, column: 26, scope: !442, inlinedAt: !1225)
!1225 = distinct !DILocation(line: 390, column: 7, scope: !1138)
!1226 = !DILocation(line: 212, column: 3, scope: !450, inlinedAt: !1225)
!1227 = !DILocation(line: 388, column: 9, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 388, column: 9)
!1229 = !DILocation(line: 388, column: 9, scope: !1133)
!1230 = !DILocation(line: 388, column: 9, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 388, column: 9)
!1232 = !DILocation(line: 388, column: 9, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 388, column: 9)
!1234 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 388, column: 9)
!1235 = !DILocation(line: 388, column: 9, scope: !1234)
!1236 = distinct !{!1236, !1227, !1227}
!1237 = !DILocation(line: 388, column: 9, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 388, column: 9)
!1239 = !DILocation(line: 216, column: 27, scope: !442, inlinedAt: !1225)
!1240 = !DILocation(line: 216, column: 3, scope: !442, inlinedAt: !1225)
!1241 = !DILocation(line: 391, column: 7, scope: !1138)
!1242 = !DILocalVariable(name: "pcb", arg: 1, scope: !1243, file: !3, line: 269, type: !145)
!1243 = distinct !DISubprogram(name: "tcp_listen_closed", scope: !3, file: !3, line: 269, type: !443, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1244)
!1244 = !{!1242, !1245}
!1245 = !DILocalVariable(name: "i", scope: !1243, file: !3, line: 272, type: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1247, line: 40, baseType: !1248)
!1247 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !1249, line: 129, baseType: !272)
!1249 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!1250 = !DILocation(line: 269, column: 35, scope: !1243, inlinedAt: !1251)
!1251 = distinct !DILocation(line: 393, column: 7, scope: !1138)
!1252 = !DILocation(line: 272, column: 10, scope: !1243, inlinedAt: !1251)
!1253 = !DILocation(line: 276, column: 25, scope: !1254, inlinedAt: !1251)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 275, column: 55)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 275, column: 3)
!1256 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 275, column: 3)
!1257 = !DILocalVariable(name: "list", arg: 1, scope: !1258, file: !3, line: 251, type: !145)
!1258 = distinct !DISubprogram(name: "tcp_remove_listener", scope: !3, file: !3, line: 251, type: !1259, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1261)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !145, !98}
!1261 = !{!1257, !1262, !1263}
!1262 = !DILocalVariable(name: "lpcb", arg: 2, scope: !1258, file: !3, line: 251, type: !98)
!1263 = !DILocalVariable(name: "pcb", scope: !1258, file: !3, line: 253, type: !145)
!1264 = !DILocation(line: 251, column: 37, scope: !1258, inlinedAt: !1265)
!1265 = distinct !DILocation(line: 276, column: 5, scope: !1254, inlinedAt: !1251)
!1266 = !DILocation(line: 251, column: 66, scope: !1258, inlinedAt: !1265)
!1267 = !DILocation(line: 253, column: 19, scope: !1258, inlinedAt: !1265)
!1268 = !DILocation(line: 257, column: 24, scope: !1269, inlinedAt: !1265)
!1269 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 257, column: 3)
!1270 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 257, column: 3)
!1271 = !DILocation(line: 257, column: 3, scope: !1270, inlinedAt: !1265)
!1272 = !DILocation(line: 258, column: 14, scope: !1273, inlinedAt: !1265)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !3, line: 258, column: 9)
!1274 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 257, column: 50)
!1275 = !{!452, !454, i64 216}
!1276 = !DILocation(line: 258, column: 23, scope: !1273, inlinedAt: !1265)
!1277 = !DILocation(line: 258, column: 9, scope: !1274, inlinedAt: !1265)
!1278 = !DILocation(line: 259, column: 21, scope: !1279, inlinedAt: !1265)
!1279 = distinct !DILexicalBlock(scope: !1273, file: !3, line: 258, column: 32)
!1280 = !DILocation(line: 260, column: 5, scope: !1279, inlinedAt: !1265)
!1281 = !DILocation(line: 257, column: 44, scope: !1269, inlinedAt: !1265)
!1282 = distinct !{!1282, !1283, !1284}
!1283 = !DILocation(line: 257, column: 3, scope: !1270)
!1284 = !DILocation(line: 261, column: 3, scope: !1270)
!1285 = !DILocation(line: 394, column: 7, scope: !1138)
!1286 = !DILocalVariable(name: "pcb", arg: 1, scope: !1287, file: !3, line: 221, type: !145)
!1287 = distinct !DISubprogram(name: "tcp_free_listen", scope: !3, file: !3, line: 221, type: !443, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1288)
!1288 = !{!1286}
!1289 = !DILocation(line: 221, column: 33, scope: !1287, inlinedAt: !1290)
!1290 = distinct !DILocation(line: 395, column: 7, scope: !1138)
!1291 = !DILocation(line: 223, column: 3, scope: !1292, inlinedAt: !1290)
!1292 = distinct !DILexicalBlock(scope: !1293, file: !3, line: 223, column: 3)
!1293 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 223, column: 3)
!1294 = !DILocation(line: 223, column: 3, scope: !1293, inlinedAt: !1290)
!1295 = !DILocation(line: 223, column: 3, scope: !1296, inlinedAt: !1290)
!1296 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 223, column: 3)
!1297 = distinct !DILexicalBlock(scope: !1292, file: !3, line: 223, column: 3)
!1298 = !DILocation(line: 223, column: 3, scope: !1299, inlinedAt: !1290)
!1299 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 223, column: 3)
!1300 = distinct !DILexicalBlock(scope: !1301, file: !3, line: 223, column: 3)
!1301 = distinct !DILexicalBlock(scope: !1296, file: !3, line: 223, column: 3)
!1302 = !DILocation(line: 227, column: 34, scope: !1287, inlinedAt: !1290)
!1303 = !DILocation(line: 227, column: 3, scope: !1287, inlinedAt: !1290)
!1304 = !DILocation(line: 396, column: 7, scope: !1138)
!1305 = !DILocation(line: 398, column: 7, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 398, column: 7)
!1307 = !DILocation(line: 210, column: 26, scope: !442, inlinedAt: !1308)
!1308 = distinct !DILocation(line: 399, column: 7, scope: !1138)
!1309 = !DILocation(line: 212, column: 3, scope: !449, inlinedAt: !1308)
!1310 = !DILocation(line: 212, column: 3, scope: !450, inlinedAt: !1308)
!1311 = !DILocation(line: 212, column: 3, scope: !457, inlinedAt: !1308)
!1312 = !DILocation(line: 212, column: 3, scope: !460, inlinedAt: !1308)
!1313 = !DILocation(line: 216, column: 27, scope: !442, inlinedAt: !1308)
!1314 = !DILocation(line: 216, column: 3, scope: !442, inlinedAt: !1308)
!1315 = !DILocation(line: 401, column: 7, scope: !1138)
!1316 = !DILocation(line: 403, column: 14, scope: !1138)
!1317 = !DILocation(line: 403, column: 7, scope: !1138)
!1318 = !DILocation(line: 0, scope: !1117)
!1319 = !DILocation(line: 406, column: 1, scope: !1117)
!1320 = distinct !DISubprogram(name: "tcp_shutdown", scope: !3, file: !3, line: 515, type: !1321, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1323)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!140, !145, !50, !50}
!1323 = !{!1324, !1325, !1326}
!1324 = !DILocalVariable(name: "pcb", arg: 1, scope: !1320, file: !3, line: 515, type: !145)
!1325 = !DILocalVariable(name: "shut_rx", arg: 2, scope: !1320, file: !3, line: 515, type: !50)
!1326 = !DILocalVariable(name: "shut_tx", arg: 3, scope: !1320, file: !3, line: 515, type: !50)
!1327 = !DILocation(line: 515, column: 30, scope: !1320)
!1328 = !DILocation(line: 515, column: 39, scope: !1320)
!1329 = !DILocation(line: 515, column: 52, scope: !1320)
!1330 = !DILocation(line: 519, column: 3, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1332, file: !3, line: 519, column: 3)
!1332 = distinct !DILexicalBlock(scope: !1320, file: !3, line: 519, column: 3)
!1333 = !DILocation(line: 519, column: 3, scope: !1332)
!1334 = !DILocation(line: 519, column: 3, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 519, column: 3)
!1336 = distinct !DILexicalBlock(scope: !1331, file: !3, line: 519, column: 3)
