; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/ucsconv.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/ucsconv.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.iconv_conversion_handlers_t = type { i8* (%struct._reent*, i8*, i8*)*, i64 (%struct._reent*, i8*)*, i64 (%struct._reent*, i8*, i8**, i64*, i8**, i64*, i32)*, void (i8*, %struct._mbstate_t*, i32)*, i32 (i8*, %struct._mbstate_t*, i32)*, i32 (i8*, i32)*, i32 (i8*, i32)* }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i8*, i32)*, i64 (%struct._reent*, i8*, i64, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64, %struct._reent*, i32, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_iconv_ucs_conversion_handlers", scope: !2, file: !3, line: 328, type: !308, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !305)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/ucsconv.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !{}
!5 = !{!6, !25, !249, !273, !304}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_ucs_conversion_t", file: !8, line: 279, baseType: !9)
!8 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/ucsconv.h", directory: "/root/.unikraft/apps/redis/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 272, size: 256, elements: !10)
!10 = !{!11, !282}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "to_ucs", scope: !9, file: !8, line: 275, baseType: !12, size: 128)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_to_ucs_ces_desc_t", file: !8, line: 238, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 231, size: 128, elements: !14)
!14 = !{!15, !281}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !13, file: !8, line: 234, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_to_ucs_ces_handlers_t", file: !8, line: 161, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 53, size: 448, elements: !20)
!20 = !{!21, !245, !253, !257, !264, !268, !269}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !19, file: !8, line: 71, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !26, !65}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !28, line: 569, size: 14912, elements: !29)
!28 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!29 = !{!30, !32, !113, !114, !115, !116, !120, !121, !124, !125, !129, !141, !142, !143, !145, !146, !147, !209, !230, !231, !236, !243}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !27, file: !28, line: 571, baseType: !31, size: 32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !27, file: !28, line: 576, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !28, line: 287, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !28, line: 181, size: 1408, elements: !36)
!36 = !{!37, !40, !41, !42, !44, !45, !50, !51, !52, !61, !67, !72, !76, !77, !78, !79, !83, !87, !88, !89, !91, !92, !96, !112}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !35, file: !28, line: 182, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !35, file: !28, line: 183, baseType: !31, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !35, file: !28, line: 184, baseType: !31, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !28, line: 185, baseType: !43, size: 16, offset: 128)
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !35, file: !28, line: 186, baseType: !43, size: 16, offset: 144)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !35, file: !28, line: 187, baseType: !46, size: 128, offset: 192)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !28, line: 117, size: 128, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !46, file: !28, line: 118, baseType: !38, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !46, file: !28, line: 119, baseType: !31, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !35, file: !28, line: 188, baseType: !31, size: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !35, file: !28, line: 195, baseType: !25, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !35, file: !28, line: 197, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !26, !25, !59, !31}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !57, line: 145, baseType: !58)
!57 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !35, file: !28, line: 199, baseType: !62, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!56, !26, !25, !65, !31}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !35, file: !28, line: 202, baseType: !68, size: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !26, !25, !71, !31}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !57, line: 114, baseType: !58)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !35, file: !28, line: 203, baseType: !73, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!31, !26, !25}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !35, file: !28, line: 206, baseType: !46, size: 128, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !35, file: !28, line: 207, baseType: !38, size: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !35, file: !28, line: 208, baseType: !31, size: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !35, file: !28, line: 211, baseType: !80, size: 24, offset: 928)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !35, file: !28, line: 212, baseType: !84, size: 8, offset: 952)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !35, file: !28, line: 215, baseType: !46, size: 128, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !35, file: !28, line: 218, baseType: !31, size: 32, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !28, line: 219, baseType: !90, size: 64, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !57, line: 44, baseType: !58)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !35, file: !28, line: 222, baseType: !26, size: 64, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !28, line: 226, baseType: !93, size: 32, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !57, line: 175, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !95, line: 12, baseType: !31)
!95 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !35, file: !28, line: 228, baseType: !97, size: 64, offset: 1312)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !57, line: 171, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 163, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !98, file: !57, line: 165, baseType: !31, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !98, file: !57, line: 170, baseType: !102, size: 32, offset: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !98, file: !57, line: 166, size: 32, elements: !103)
!103 = !{!104, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !102, file: !57, line: 168, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !106, line: 124, baseType: !107)
!106 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!107 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !102, file: !57, line: 169, baseType: !109, size: 32)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 4)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !28, line: 229, baseType: !31, size: 32, offset: 1376)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !27, file: !28, line: 576, baseType: !33, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !27, file: !28, line: 576, baseType: !33, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !27, file: !28, line: 578, baseType: !31, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !27, file: !28, line: 579, baseType: !117, size: 200, offset: 288)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 200, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 25)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !27, file: !28, line: 582, baseType: !31, size: 32, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !27, file: !28, line: 583, baseType: !122, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !28, line: 40, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !27, file: !28, line: 585, baseType: !31, size: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !27, file: !28, line: 587, baseType: !126, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !26}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !27, file: !28, line: 590, baseType: !130, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !28, line: 47, size: 256, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !131, file: !28, line: 49, baseType: !130, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !131, file: !28, line: 50, baseType: !31, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !131, file: !28, line: 50, baseType: !31, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !131, file: !28, line: 50, baseType: !31, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !131, file: !28, line: 50, baseType: !31, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !131, file: !28, line: 51, baseType: !139, size: 32, offset: 192)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 32, elements: !85)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !28, line: 25, baseType: !107)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !27, file: !28, line: 591, baseType: !31, size: 32, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !27, file: !28, line: 592, baseType: !130, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !27, file: !28, line: 593, baseType: !144, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !27, file: !28, line: 596, baseType: !31, size: 32, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !27, file: !28, line: 597, baseType: !59, size: 64, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !27, file: !28, line: 632, baseType: !148, size: 2880, offset: 1152)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !27, file: !28, line: 599, size: 2880, elements: !149)
!149 = !{!150, !200}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !148, file: !28, line: 622, baseType: !151, size: 1728)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !28, line: 601, size: 1728, elements: !152)
!152 = !{!153, !154, !155, !159, !171, !172, !174, !182, !183, !184, !185, !189, !193, !194, !195, !196, !197, !198, !199}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !151, file: !28, line: 603, baseType: !107, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !151, file: !28, line: 604, baseType: !59, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !151, file: !28, line: 605, baseType: !156, size: 208, offset: 128)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 208, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 26)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !151, file: !28, line: 606, baseType: !160, size: 288, offset: 352)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !28, line: 55, size: 288, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !160, file: !28, line: 57, baseType: !31, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !160, file: !28, line: 58, baseType: !31, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !160, file: !28, line: 59, baseType: !31, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !160, file: !28, line: 60, baseType: !31, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !160, file: !28, line: 61, baseType: !31, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !160, file: !28, line: 62, baseType: !31, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !160, file: !28, line: 63, baseType: !31, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !160, file: !28, line: 64, baseType: !31, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !160, file: !28, line: 65, baseType: !31, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !151, file: !28, line: 607, baseType: !31, size: 32, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !151, file: !28, line: 608, baseType: !173, size: 64, offset: 704)
!173 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !151, file: !28, line: 609, baseType: !175, size: 112, offset: 768)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !28, line: 319, size: 112, elements: !176)
!176 = !{!177, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !175, file: !28, line: 320, baseType: !178, size: 48)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 48, elements: !81)
!179 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !175, file: !28, line: 321, baseType: !178, size: 48, offset: 48)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !175, file: !28, line: 322, baseType: !179, size: 16, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !151, file: !28, line: 610, baseType: !97, size: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !151, file: !28, line: 611, baseType: !97, size: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !151, file: !28, line: 612, baseType: !97, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !151, file: !28, line: 613, baseType: !186, size: 64, offset: 1088)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !151, file: !28, line: 614, baseType: !190, size: 192, offset: 1152)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 192, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 24)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !151, file: !28, line: 615, baseType: !31, size: 32, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !151, file: !28, line: 616, baseType: !97, size: 64, offset: 1376)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !151, file: !28, line: 617, baseType: !97, size: 64, offset: 1440)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !151, file: !28, line: 618, baseType: !97, size: 64, offset: 1504)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !151, file: !28, line: 619, baseType: !97, size: 64, offset: 1568)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !151, file: !28, line: 620, baseType: !97, size: 64, offset: 1632)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !151, file: !28, line: 621, baseType: !31, size: 32, offset: 1696)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !148, file: !28, line: 631, baseType: !201, size: 2880)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !28, line: 626, size: 2880, elements: !202)
!202 = !{!203, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !201, file: !28, line: 629, baseType: !204, size: 1920)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1920, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 30)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !201, file: !28, line: 630, baseType: !208, size: 960, offset: 1920)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 960, elements: !205)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !27, file: !28, line: 636, baseType: !210, size: 64, offset: 4032)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !28, line: 93, size: 6336, elements: !212)
!212 = !{!213, !214, !215, !222}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !211, file: !28, line: 94, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !211, file: !28, line: 95, baseType: !31, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !211, file: !28, line: 97, baseType: !216, size: 2048, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 2048, elements: !220)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = !{!221}
!221 = !DISubrange(count: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !211, file: !28, line: 98, baseType: !223, size: 4160, offset: 2176)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !28, line: 74, size: 4160, elements: !224)
!224 = !{!225, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !223, file: !28, line: 75, baseType: !226, size: 2048)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !220)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !223, file: !28, line: 76, baseType: !226, size: 2048, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !223, file: !28, line: 78, baseType: !140, size: 32, offset: 4096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !223, file: !28, line: 81, baseType: !140, size: 32, offset: 4128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !27, file: !28, line: 637, baseType: !211, size: 6336, offset: 4096)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !27, file: !28, line: 641, baseType: !232, size: 64, offset: 10432)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !31}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !27, file: !28, line: 646, baseType: !237, size: 192, offset: 10496)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !28, line: 291, size: 192, elements: !238)
!238 = !{!239, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !237, file: !28, line: 293, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !237, file: !28, line: 294, baseType: !31, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !237, file: !28, line: 295, baseType: !33, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !27, file: !28, line: 648, baseType: !244, size: 4224, offset: 10688)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 4224, elements: !81)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !19, file: !8, line: 87, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !26, !25}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 40, baseType: !251)
!250 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !57, line: 129, baseType: !252)
!252 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_cur_max", scope: !19, file: !8, line: 99, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!31, !25}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "get_state", scope: !19, file: !8, line: 111, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !25, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !263, line: 86, baseType: !97)
!263 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !19, file: !8, line: 126, baseType: !265, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!31, !25, !261}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "is_stateful", scope: !19, file: !8, line: 138, baseType: !254, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "convert_to_ucs", scope: !19, file: !8, line: 158, baseType: !270, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !25, !277, !280}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs4_t", file: !274, line: 61, baseType: !275)
!274 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/local.h", directory: "/root/.unikraft/apps/redis/build")
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !276, line: 79, baseType: !107)
!276 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !13, file: !8, line: 237, baseType: !25, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "from_ucs", scope: !9, file: !8, line: 278, baseType: !283, size: 128, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_from_ucs_ces_desc_t", file: !8, line: 254, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 247, size: 128, elements: !285)
!285 = !{!286, !303}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !284, file: !8, line: 250, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_from_ucs_ces_handlers_t", file: !8, line: 222, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 172, size: 448, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !290, file: !8, line: 175, baseType: !22, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !290, file: !8, line: 179, baseType: !246, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_cur_max", scope: !290, file: !8, line: 183, baseType: !254, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "get_state", scope: !290, file: !8, line: 186, baseType: !258, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !290, file: !8, line: 190, baseType: !265, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "is_stateful", scope: !290, file: !8, line: 194, baseType: !254, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "convert_from_ucs", scope: !290, file: !8, line: 218, baseType: !299, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!249, !25, !273, !302, !280}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !8, line: 253, baseType: !25, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !276, line: 77, baseType: !31)
!305 = !{!0, !306}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "fake_data", scope: !2, file: !3, line: 36, type: !31, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_conversion_handlers_t", file: !310, line: 191, baseType: !311)
!310 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/iconv/lib/conv.h", directory: "/root/.unikraft/apps/redis/build")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 48, size: 448, elements: !312)
!312 = !{!313, !317, !318, !322, !326, !330, !334}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !311, file: !310, line: 66, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!25, !26, !65, !65}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !311, file: !310, line: 84, baseType: !246, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !311, file: !310, line: 117, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!249, !26, !25, !277, !280, !302, !280, !31}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get_state", scope: !311, file: !310, line: 138, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !25, !261, !31}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !311, file: !310, line: 157, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!31, !25, !261, !31}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_cur_max", scope: !311, file: !310, line: 173, baseType: !331, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!31, !25, !31}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "is_stateful", scope: !311, file: !310, line: 188, baseType: !331, size: 64, offset: 384)
!335 = !{i32 2, !"Dwarf Version", i32 4}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{i32 1, !"wchar_size", i32 4}
!338 = !{!"clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)"}
!339 = distinct !DISubprogram(name: "ucs_based_conversion_open", scope: !3, file: !3, line: 48, type: !315, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !340)
!340 = !{!341, !342, !343, !344, !345, !354}
!341 = !DILocalVariable(name: "rptr", arg: 1, scope: !339, file: !3, line: 48, type: !26)
!342 = !DILocalVariable(name: "to", arg: 2, scope: !339, file: !3, line: 48, type: !65)
!343 = !DILocalVariable(name: "from", arg: 3, scope: !339, file: !3, line: 48, type: !65)
!344 = !DILocalVariable(name: "uc", scope: !339, file: !3, line: 53, type: !6)
!345 = !DILocalVariable(name: "to_ucs_bices", scope: !339, file: !3, line: 54, type: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_to_ucs_ces_t", file: !8, line: 297, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 287, size: 128, elements: !350)
!350 = !{!351, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !349, file: !8, line: 293, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !349, file: !8, line: 296, baseType: !16, size: 64, offset: 64)
!354 = !DILocalVariable(name: "from_ucs_bices", scope: !339, file: !3, line: 55, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_from_ucs_ces_t", file: !8, line: 315, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 305, size: 128, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !358, file: !8, line: 311, baseType: !352, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !358, file: !8, line: 314, baseType: !287, size: 64, offset: 64)
!362 = !DILocation(line: 48, column: 1, scope: !339)
!363 = !DILocation(line: 58, column: 14, scope: !339)
!364 = !DILocation(line: 53, column: 27, scope: !339)
!365 = !DILocation(line: 59, column: 10, scope: !366)
!366 = distinct !DILexicalBlock(scope: !339, file: !3, line: 59, column: 7)
!367 = !DILocation(line: 59, column: 7, scope: !339)
!368 = !DILocation(line: 54, column: 32, scope: !339)
!369 = !DILocation(line: 67, column: 22, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 66, column: 3)
!371 = distinct !DILexicalBlock(scope: !339, file: !3, line: 66, column: 3)
!372 = !{!373, !374, i64 0}
!373 = !{!"", !374, i64 0, !374, i64 8}
!374 = !{!"any pointer", !375, i64 0}
!375 = !{!"omnipotent char", !376, i64 0}
!376 = !{!"Simple C/C++ TBAA"}
!377 = !DILocation(line: 67, column: 28, scope: !370)
!378 = !DILocation(line: 66, column: 3, scope: !371)
!379 = !DILocalVariable(name: "searchee", arg: 1, scope: !380, file: !3, line: 345, type: !65)
!380 = distinct !DISubprogram(name: "find_encoding_name", scope: !3, file: !3, line: 345, type: !381, isLocal: true, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{!31, !65, !352}
!383 = !{!379, !384, !385}
!384 = !DILocalVariable(name: "names", arg: 2, scope: !380, file: !3, line: 345, type: !352)
!385 = !DILocalVariable(name: "p", scope: !380, file: !3, line: 349, type: !65)
!386 = !DILocation(line: 345, column: 1, scope: !380, inlinedAt: !387)
!387 = distinct !DILocation(line: 70, column: 11, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 70, column: 11)
!389 = distinct !DILexicalBlock(scope: !370, file: !3, line: 69, column: 5)
!390 = !DILocation(line: 349, column: 16, scope: !380, inlinedAt: !387)
!391 = !DILocation(line: 0, scope: !392, inlinedAt: !387)
!392 = distinct !DILexicalBlock(scope: !393, file: !3, line: 351, column: 3)
!393 = distinct !DILexicalBlock(scope: !380, file: !3, line: 351, column: 3)
!394 = !{!374, !374, i64 0}
!395 = !DILocation(line: 351, column: 22, scope: !392, inlinedAt: !387)
!396 = !DILocation(line: 351, column: 3, scope: !393, inlinedAt: !387)
!397 = !DILocation(line: 351, column: 42, scope: !392, inlinedAt: !387)
!398 = distinct !{!398, !399, !400}
!399 = !DILocation(line: 351, column: 3, scope: !393)
!400 = !DILocation(line: 353, column: 14, scope: !393)
!401 = !DILocation(line: 352, column: 9, scope: !402, inlinedAt: !387)
!402 = distinct !DILexicalBlock(scope: !392, file: !3, line: 352, column: 9)
!403 = !DILocation(line: 352, column: 30, scope: !402, inlinedAt: !387)
!404 = !DILocation(line: 352, column: 9, scope: !392, inlinedAt: !387)
!405 = !DILocation(line: 68, column: 20, scope: !370)
!406 = distinct !{!406, !378, !407}
!407 = !DILocation(line: 72, column: 5, scope: !371)
!408 = !DILocation(line: 79, column: 24, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 78, column: 3)
!410 = distinct !DILexicalBlock(scope: !339, file: !3, line: 78, column: 3)
!411 = !DILocation(line: 55, column: 32, scope: !339)
!412 = !DILocation(line: 79, column: 30, scope: !409)
!413 = !DILocation(line: 78, column: 3, scope: !410)
!414 = !DILocation(line: 345, column: 1, scope: !380, inlinedAt: !415)
!415 = distinct !DILocation(line: 82, column: 11, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 82, column: 11)
!417 = distinct !DILexicalBlock(scope: !409, file: !3, line: 81, column: 5)
!418 = !DILocation(line: 349, column: 16, scope: !380, inlinedAt: !415)
!419 = !DILocation(line: 0, scope: !392, inlinedAt: !415)
!420 = !DILocation(line: 351, column: 22, scope: !392, inlinedAt: !415)
!421 = !DILocation(line: 351, column: 3, scope: !393, inlinedAt: !415)
!422 = !DILocation(line: 351, column: 42, scope: !392, inlinedAt: !415)
