; ModuleID = '/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vfscanf.c'
source_filename = "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vfscanf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__locale_t = type { [7 x [32 x i8]], i32 (%struct._reent*, i8*, i32, %struct._mbstate_t*)*, i32 (%struct._reent*, i32*, i8*, i64, %struct._mbstate_t*)*, i32, i8*, %struct.lconv, [2 x i8], [32 x i8], [32 x i8] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [30 x i8*], [30 x i32] }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "basefix", scope: !2, file: !3, line: 477, type: !391, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "__ssvfscanf_r", scope: !3, file: !3, line: 426, type: !4, isLocal: false, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: true, unit: !296, retainedNodes: !308)
!3 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/vfscanf.c", directory: "/root/.unikraft/apps/redis/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !286, !46, !289}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !9, line: 569, size: 14912, elements: !10)
!9 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/reent.h", directory: "/root/.unikraft/apps/redis/build")
!10 = !{!11, !12, !94, !95, !96, !97, !101, !102, !167, !168, !172, !184, !185, !186, !188, !189, !190, !252, !271, !272, !277, !284}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !8, file: !9, line: 571, baseType: !6, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !8, file: !9, line: 576, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !9, line: 287, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 181, size: 1408, elements: !16)
!16 = !{!17, !20, !21, !22, !24, !25, !30, !31, !33, !42, !48, !53, !57, !58, !59, !60, !64, !68, !69, !70, !72, !73, !77, !93}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !15, file: !9, line: 182, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !15, file: !9, line: 183, baseType: !6, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !15, file: !9, line: 184, baseType: !6, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !9, line: 185, baseType: !23, size: 16, offset: 128)
!23 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !15, file: !9, line: 186, baseType: !23, size: 16, offset: 144)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !15, file: !9, line: 187, baseType: !26, size: 128, offset: 192)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 117, size: 128, elements: !27)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !26, file: !9, line: 118, baseType: !18, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !26, file: !9, line: 119, baseType: !6, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !15, file: !9, line: 188, baseType: !6, size: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !15, file: !9, line: 195, baseType: !32, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !15, file: !9, line: 197, baseType: !34, size: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !7, !32, !40, !6}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !38, line: 145, baseType: !39)
!38 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_types.h", directory: "/root/.unikraft/apps/redis/build")
!39 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !15, file: !9, line: 199, baseType: !43, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!37, !7, !32, !46, !6}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !15, file: !9, line: 202, baseType: !49, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !7, !32, !52, !6}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !38, line: 114, baseType: !39)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !15, file: !9, line: 203, baseType: !54, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!6, !7, !32}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !15, file: !9, line: 206, baseType: !26, size: 128, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !15, file: !9, line: 207, baseType: !18, size: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !15, file: !9, line: 208, baseType: !6, size: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !15, file: !9, line: 211, baseType: !61, size: 24, offset: 928)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 3)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !15, file: !9, line: 212, baseType: !65, size: 8, offset: 952)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 1)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !15, file: !9, line: 215, baseType: !26, size: 128, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !15, file: !9, line: 218, baseType: !6, size: 32, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !9, line: 219, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !38, line: 44, baseType: !39)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !15, file: !9, line: 222, baseType: !7, size: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !9, line: 226, baseType: !74, size: 32, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !38, line: 175, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_RECURSIVE_T", file: !76, line: 12, baseType: !6)
!76 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/lock.h", directory: "/root/.unikraft/apps/redis/build")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !15, file: !9, line: 228, baseType: !78, size: 64, offset: 1312)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !38, line: 171, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 163, size: 64, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !79, file: !38, line: 165, baseType: !6, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !79, file: !38, line: 170, baseType: !83, size: 32, offset: 32)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !79, file: !38, line: 166, size: 32, elements: !84)
!84 = !{!85, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !83, file: !38, line: 168, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !87, line: 124, baseType: !88)
!87 = !DIFile(filename: "/root/.unikraft/libs/newlib/include/stddef.h", directory: "/root/.unikraft/apps/redis/build")
!88 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !83, file: !38, line: 169, baseType: !90, size: 32)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !9, line: 229, baseType: !6, size: 32, offset: 1376)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !8, file: !9, line: 576, baseType: !13, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !8, file: !9, line: 576, baseType: !13, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !8, file: !9, line: 578, baseType: !6, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !8, file: !9, line: 579, baseType: !98, size: 200, offset: 288)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 200, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 25)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !8, file: !9, line: 582, baseType: !6, size: 32, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !8, file: !9, line: 583, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !105, line: 178, size: 3392, elements: !106)
!105 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/stdio/../stdlib/../locale/setlocale.h", directory: "/root/.unikraft/apps/redis/build")
!106 = !{!107, !112, !120, !129, !130, !131, !159, !163, !166}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !104, file: !105, line: 180, baseType: !108, size: 1792)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1792, elements: !109)
!109 = !{!110, !111}
!110 = !DISubrange(count: 7)
!111 = !DISubrange(count: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "wctomb", scope: !104, file: !105, line: 181, baseType: !113, size: 64, offset: 1792)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!6, !7, !40, !116, !117}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !87, line: 83, baseType: !6)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !119, line: 86, baseType: !78)
!119 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/wchar.h", directory: "/root/.unikraft/apps/redis/build")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mbtowc", scope: !104, file: !105, line: 183, baseType: !121, size: 64, offset: 1856)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!6, !7, !124, !46, !125, !117}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !126, line: 40, baseType: !127)
!126 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/strings.h", directory: "/root/.unikraft/apps/redis/build")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !38, line: 129, baseType: !128)
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cjk_lang", scope: !104, file: !105, line: 185, baseType: !6, size: 32, offset: 1920)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_ptr", scope: !104, file: !105, line: 186, baseType: !40, size: 64, offset: 1984)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "lconv", scope: !104, file: !105, line: 187, baseType: !132, size: 768, offset: 2048)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !133, line: 42, size: 768, elements: !134)
!133 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/locale.h", directory: "/root/.unikraft/apps/redis/build")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !132, file: !133, line: 44, baseType: !40, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !132, file: !133, line: 45, baseType: !40, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !132, file: !133, line: 46, baseType: !40, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !132, file: !133, line: 47, baseType: !40, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !132, file: !133, line: 48, baseType: !40, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !132, file: !133, line: 49, baseType: !40, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !132, file: !133, line: 50, baseType: !40, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !132, file: !133, line: 51, baseType: !40, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !132, file: !133, line: 52, baseType: !40, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !132, file: !133, line: 53, baseType: !40, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !132, file: !133, line: 54, baseType: !41, size: 8, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !132, file: !133, line: 55, baseType: !41, size: 8, offset: 648)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !132, file: !133, line: 56, baseType: !41, size: 8, offset: 656)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !132, file: !133, line: 57, baseType: !41, size: 8, offset: 664)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !132, file: !133, line: 58, baseType: !41, size: 8, offset: 672)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !132, file: !133, line: 59, baseType: !41, size: 8, offset: 680)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !132, file: !133, line: 60, baseType: !41, size: 8, offset: 688)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !132, file: !133, line: 61, baseType: !41, size: 8, offset: 696)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !132, file: !133, line: 62, baseType: !41, size: 8, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !132, file: !133, line: 63, baseType: !41, size: 8, offset: 712)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !132, file: !133, line: 64, baseType: !41, size: 8, offset: 720)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !132, file: !133, line: 65, baseType: !41, size: 8, offset: 728)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !132, file: !133, line: 66, baseType: !41, size: 8, offset: 736)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !132, file: !133, line: 67, baseType: !41, size: 8, offset: 744)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !104, file: !105, line: 189, baseType: !160, size: 16, offset: 2816)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 16, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 2)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_codeset", scope: !104, file: !105, line: 190, baseType: !164, size: 256, offset: 2832)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !165)
!165 = !{!111}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "message_codeset", scope: !104, file: !105, line: 191, baseType: !164, size: 256, offset: 3088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !8, file: !9, line: 585, baseType: !6, size: 32, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !8, file: !9, line: 587, baseType: !169, size: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !7}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !8, file: !9, line: 590, baseType: !173, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !9, line: 47, size: 256, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !174, file: !9, line: 49, baseType: !173, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !174, file: !9, line: 50, baseType: !6, size: 32, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !174, file: !9, line: 51, baseType: !182, size: 32, offset: 192)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 32, elements: !66)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !9, line: 25, baseType: !88)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !8, file: !9, line: 591, baseType: !6, size: 32, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !8, file: !9, line: 592, baseType: !173, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !8, file: !9, line: 593, baseType: !187, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !8, file: !9, line: 596, baseType: !6, size: 32, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !8, file: !9, line: 597, baseType: !40, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !8, file: !9, line: 632, baseType: !191, size: 2880, offset: 1152)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !9, line: 599, size: 2880, elements: !192)
!192 = !{!193, !243}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !191, file: !9, line: 622, baseType: !194, size: 1728)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !9, line: 601, size: 1728, elements: !195)
!195 = !{!196, !197, !198, !202, !214, !215, !217, !225, !226, !227, !228, !232, !236, !237, !238, !239, !240, !241, !242}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !194, file: !9, line: 603, baseType: !88, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !194, file: !9, line: 604, baseType: !40, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !194, file: !9, line: 605, baseType: !199, size: 208, offset: 128)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 208, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 26)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !194, file: !9, line: 606, baseType: !203, size: 288, offset: 352)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !9, line: 55, size: 288, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !203, file: !9, line: 57, baseType: !6, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !203, file: !9, line: 58, baseType: !6, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !203, file: !9, line: 59, baseType: !6, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !203, file: !9, line: 60, baseType: !6, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !203, file: !9, line: 61, baseType: !6, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !203, file: !9, line: 62, baseType: !6, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !203, file: !9, line: 63, baseType: !6, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !203, file: !9, line: 64, baseType: !6, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !203, file: !9, line: 65, baseType: !6, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !194, file: !9, line: 607, baseType: !6, size: 32, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !194, file: !9, line: 608, baseType: !216, size: 64, offset: 704)
!216 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !194, file: !9, line: 609, baseType: !218, size: 112, offset: 768)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !9, line: 319, size: 112, elements: !219)
!219 = !{!220, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !218, file: !9, line: 320, baseType: !221, size: 48)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 48, elements: !62)
!222 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !218, file: !9, line: 321, baseType: !221, size: 48, offset: 48)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !218, file: !9, line: 322, baseType: !222, size: 16, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !194, file: !9, line: 610, baseType: !78, size: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !194, file: !9, line: 611, baseType: !78, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !194, file: !9, line: 612, baseType: !78, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !194, file: !9, line: 613, baseType: !229, size: 64, offset: 1088)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !194, file: !9, line: 614, baseType: !233, size: 192, offset: 1152)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 24)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !194, file: !9, line: 615, baseType: !6, size: 32, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !194, file: !9, line: 616, baseType: !78, size: 64, offset: 1376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !194, file: !9, line: 617, baseType: !78, size: 64, offset: 1440)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !194, file: !9, line: 618, baseType: !78, size: 64, offset: 1504)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !194, file: !9, line: 619, baseType: !78, size: 64, offset: 1568)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !194, file: !9, line: 620, baseType: !78, size: 64, offset: 1632)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !194, file: !9, line: 621, baseType: !6, size: 32, offset: 1696)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !191, file: !9, line: 631, baseType: !244, size: 2880)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !9, line: 626, size: 2880, elements: !245)
!245 = !{!246, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !244, file: !9, line: 629, baseType: !247, size: 1920)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1920, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 30)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !244, file: !9, line: 630, baseType: !251, size: 960, offset: 1920)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 960, elements: !248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !8, file: !9, line: 636, baseType: !253, size: 64, offset: 4032)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !9, line: 93, size: 6336, elements: !255)
!255 = !{!256, !257, !258, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !254, file: !9, line: 94, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !254, file: !9, line: 95, baseType: !6, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !254, file: !9, line: 97, baseType: !259, size: 2048, offset: 128)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 2048, elements: !165)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !254, file: !9, line: 98, baseType: !264, size: 4160, offset: 2176)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !9, line: 74, size: 4160, elements: !265)
!265 = !{!266, !268, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !264, file: !9, line: 75, baseType: !267, size: 2048)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !165)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !264, file: !9, line: 76, baseType: !267, size: 2048, offset: 2048)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !264, file: !9, line: 78, baseType: !183, size: 32, offset: 4096)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !264, file: !9, line: 81, baseType: !183, size: 32, offset: 4128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !8, file: !9, line: 637, baseType: !254, size: 6336, offset: 4096)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !8, file: !9, line: 641, baseType: !273, size: 64, offset: 10432)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !6}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !8, file: !9, line: 646, baseType: !278, size: 192, offset: 10496)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !9, line: 291, size: 192, elements: !279)
!279 = !{!280, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !278, file: !9, line: 293, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !278, file: !9, line: 294, baseType: !6, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !278, file: !9, line: 295, baseType: !13, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !8, file: !9, line: 648, baseType: !285, size: 4224, offset: 10688)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 4224, elements: !62)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !288, line: 66, baseType: !14)
!288 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/stdio.h", directory: "/root/.unikraft/apps/redis/build")
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !290, file: !3, baseType: !88, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !290, file: !3, baseType: !88, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !290, file: !3, baseType: !32, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !290, file: !3, baseType: !32, size: 64, offset: 128)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1-8+deb10u2 (tags/RELEASE_701/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !297, retainedTypes: !298, globals: !307)
!297 = !{}
!298 = !{!18, !6, !299, !125, !32, !19, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!128, !7, !46, !302, !6}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !304, line: 82, baseType: !305)
!304 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/sys/_stdint.h", directory: "/root/.unikraft/apps/redis/build")
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !306, line: 232, baseType: !128)
!306 = !DIFile(filename: "/root/.unikraft/apps/redis/build/libnewlibc/origin/newlib-2.5.0.20170922/newlib/libc/include/machine/_default_types.h", directory: "/root/.unikraft/apps/redis/build")
!307 = !{!0}
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !332, !336, !337, !338, !340, !342, !345, !348, !351, !353, !360, !363, !365, !368, !370, !371, !374, !378, !380, !381, !382, !383, !384, !385, !386, !387, !390}
!309 = !DILocalVariable(name: "rptr", arg: 1, scope: !2, file: !3, line: 426, type: !7)
!310 = !DILocalVariable(name: "fp", arg: 2, scope: !2, file: !3, line: 426, type: !286)
!311 = !DILocalVariable(name: "fmt0", arg: 3, scope: !2, file: !3, line: 426, type: !46)
!312 = !DILocalVariable(name: "ap", arg: 4, scope: !2, file: !3, line: 426, type: !289)
!313 = !DILocalVariable(name: "fmt", scope: !2, file: !3, line: 432, type: !18)
!314 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 433, type: !6)
!315 = !DILocalVariable(name: "width", scope: !2, file: !3, line: 434, type: !125)
!316 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 435, type: !40)
!317 = !DILocalVariable(name: "n", scope: !2, file: !3, line: 436, type: !6)
!318 = !DILocalVariable(name: "flags", scope: !2, file: !3, line: 437, type: !6)
!319 = !DILocalVariable(name: "p0", scope: !2, file: !3, line: 438, type: !40)
!320 = !DILocalVariable(name: "nassigned", scope: !2, file: !3, line: 439, type: !6)
!321 = !DILocalVariable(name: "nread", scope: !2, file: !3, line: 440, type: !6)
!322 = !DILocalVariable(name: "base", scope: !2, file: !3, line: 448, type: !6)
!323 = !DILocalVariable(name: "nbytes", scope: !2, file: !3, line: 449, type: !6)
!324 = !DILocalVariable(name: "wc", scope: !2, file: !3, line: 450, type: !116)
!325 = !DILocalVariable(name: "wcp", scope: !2, file: !3, line: 451, type: !124)
!326 = !DILocalVariable(name: "mbslen", scope: !2, file: !3, line: 452, type: !125)
!327 = !DILocalVariable(name: "ccfn", scope: !2, file: !3, line: 458, type: !299)
!328 = !DILocalVariable(name: "ccltab", scope: !2, file: !3, line: 459, type: !329)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 256)
!332 = !DILocalVariable(name: "buf", scope: !2, file: !3, line: 460, type: !333)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2800, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 350)
!336 = !DILocalVariable(name: "lptr", scope: !2, file: !3, line: 461, type: !18)
!337 = !DILocalVariable(name: "cp", scope: !2, file: !3, line: 463, type: !40)
!338 = !DILocalVariable(name: "sp", scope: !2, file: !3, line: 464, type: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!340 = !DILocalVariable(name: "ip", scope: !2, file: !3, line: 465, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
